{
    "1": {
        "Prophet Ayyub": {
            "Full Story": {
                "Family Tree Of Prophet Ayyub": [
                    "Prophet Ayyub (Job) was a descendant of Prophet Ibrahim. Ayyub’s mother was the daughter of Prophet Lut and his wife was a direct descendant of Prophet Yusuf. Ayyub lived in Rome with his dear wife Rahma and fourteen children.",
                    "Ayyub was a Prophet who was immensely blessed by Allah— he was strong and healthy, had large plots of land, abundant livestock, and a righteous and beautiful family; he was also a community leader who was highly respected and loved by his people. Despite his status and wealth, Ayyub was never arrogant; he was always humble, he readily helped the deprived, and constantly thanked and glorified Allah for everything he was blessed with.",
                    "One day, high up in the heavens, the angels began discussing about the best of humans who lived on earth. An angel amongst them said,",
                    "“The best creature on earth today is Ayyub, a man of noble character who displays great patience and always remembers his Generous Lord. He is an excellent model for the worshippers of Allah. In return, his Lord has blessed him with a long life and plenty of servants; the needy and the poor share in his good fortune— he feeds and clothes the poor and buys slaves to set them free. He makes those who receive his charity feel as if they are favouring him— so kind and gentle is he.”",
                    "Satan, who was in the vicinity, overhead the discussion and became very angry. He immediately began plotting to lure Ayyub away from the worship of Allah. He whispered evil thoughts to Ayyub about the many pleasures of life that a man such as Ayyub could easily enjoy; but the Prophet was a sincere servant of Allah and was not easily faltered—this enraged Satan further.",
                    "Satan approached Allah and informed Him that Ayyub was not a sincere servant of His and was only glorifying Him in fear of losing all his wealth. He, Satan, suggested, “If You remove his wealth then You will find that his tongue will no longer mention Your name and his praying will stop.” Allah, the All-Knowing, did not believe Satan, for He knew that Ayyub was among His most sincere believers and did not worship his Lord for mere material possessions. But He agreed to test Ayyub to show Satan the absolute sincerity of His loyal servant. Overjoyed, Satan set out to destroy Prophet Ayyub’s wealth.",
                    "",
                    "As time passed, Prophet Ayyub’s wealth began to diminish—his land, livestock, servants, and money slowly evaded him until he was left with nothing.",
                    "Immensely satisfied with Ayyub’s ordeal, Satan, disguised as a wise old man, approached the Prophet and said, “All your wealth is lost, some people say that it is because you gave too much charity and that you are wasting your time with your continuous prayers to Allah. Others say that Allah has brought this upon you in order to please your enemies. If Allah had the capacity to prevent harm, then He would have protected your wealth.”",
                    "Ayyub replied, “Allah gives whom He wills, and Allah takes from whom He wills. And all of the wealth that I have belongs to Allah, so He has every authority to take it back from me”. Ayyub then turned around and continued to thank and praise Allah.",
                    "Feeling rather frustrated, Satan returned to Allah and said, “I have stripped Ayyub of all his possessions, but he still remains grateful to You. However, he is only hiding his disappointment. The real test of a parent is through his children. You will see how Ayyub will reject You.” Allah still knew that Ayyub’s faith and love for his Lord will not waver, but He agreed to test Ayyub further.",
                    "Before long, the building in which Ayyub’s children lived crashed killing all fourteen of his young, beautiful children. Satan once again visited Ayyub disguised as sympathising bystander, and remarked with sorrow, “The circumstances under which your children died were sad. Surely, your Lord is not rewarding you properly for all your prayers.”",
                    "Ayyub responded, “Allah gives me what is good for me, and takes away what Allah sees that is displeasing for Him and for me. Allah sees that all of these children may be a strong test & trial for me, so Allah took them away from me. Whether a thing is beneficial or harmful to me, I will remain firm in my belief and remain thankful to my Creator.”",
                    "Satan rushed back to Allah and said, “O my Lord, Ayyub’s wealth is gone, his children are dead, and he is still healthy in body, and as long as he enjoys good health he will continue to worship You in hopes of regaining his wealth and producing more children. Grant me authority over his body so that I may weaken it. He will surely neglect worshipping You and will thus become disobedient.”",
                    "Allah granted his request but instructed, “I give you authority over his body but not over his soul, intellect or heart, for in these places reside the knowledge of Me and My religion.”",
                    "Soon after, Ayyub’s health began to deteriorate. He was so ill that the skin of his body used to fall off revealing his muscles and bone. But as Allah instructed, the only two organs that functioned in his body were his heart and tongue—which he continued to use to glorify Allah. Ayyub suffered through severe pain, but he never allowed himself to complain or falter in his belief in Allah.",
                    "The people of the city began discussing, “If Ayyub was a good person, Allah wouldn’t have done this to him”. And eventually, they abandoned him— his relatives, friends, and everyone who loved and respected Ayyub deserted him, except for Rahma, his beloved wife.",
                    "Prophet Ayyub’s Love For Allah",
                    "For years Ayyub continued to suffer through his condition, with none but Rahma by his side to take care of him. They had no money and no income, so his wife took up a job to provide for him. But the people of the city did not allow Rahma to work for long for they feared that she would afflict them with the same illness as her husband. Ayyub meanwhile, continued to pray to Allah to give him the strength and patience to endure this pain and suffering.",
                    "One day, Satan appeared before Rahma in the form of man and asked her, “Where is your husband?” Pointing at the almost lifeless figure of Ayyub, Rahma replied, “There he is, suspended between life and death.”",
                    "Satan then went on to remind her of the blissful days of good health, children and wealth. Overwhelmed with the years of pain and hardship, Rahma approached Ayyub and wailed, “O Ayyub, you are the prophet and the messenger of Allah. You have the closest relationship to Allah. Ask Allah to take you out of this harm that you are in!”",
                    "Ayyub sighed and replied, “Satan must have whispered to you and made you dissatisfied. Tell me how long did I enjoy good health and riches?” His wife responded, “eighty years or so.” He replied, “For how long am I suffering like this?” She said, “seven years.” Ayyub then said, “In that case I am ashamed to call on my Lord to remove my hardship, for I have not suffered longer than the years of good health and plenty. It seems your faith has weakened and you are dissatisfied with the fate of Allah. If I ever regain health, I swear I will punish you with a hundred strokes! From this day onward, I forbid myself to eat or drink anything by your hand. Leave me alone and let my Lord do with me as He pleases.”",
                    "Feeling helpless Ayyub turned to Allah seeking His mercy. “Verily, Satan has touched me with distress (by losing my health) and torment (by losing my wealth)!”, he prayed. Allah immediately responded to Ayyub’s desperate call for help. Allah said, “Strike the ground with your foot: This is a spring of water to wash in and cool and a refreshing drink.”",
                    "Ayyub immediately performed Allah’s bidding. As he struck the ground with his foot, cold water gushed at his feet. As commanded, Ayyub drank and washed his entire body using the water. Within a short while, Ayyub’s blisters disappeared, his skin renewed completely and his internal organs began functioning. Indeed, Ayyub was completely cured by the grace of Allah!",
                    "Rahma, who could not stand to be away from her husband any longer, returned home; as she entered their home, she was greeted by Ayyub whom she did not recognise.",
                    "She asked him, “Where is Ayyub? Who are you? You look very similar to him.” He replied smiling, “It’s me!” Overjoyed, she immediately embraced him and thanked Allah for His mercy.",
                    "Ayyub remembered his promise to punish his wife with a hundred strokes once he regained his health. He did not want to hurt his beloved wife, nor did he want to break his oath to Allah; so Allah, the Most Wise, instructed Ayyub, “Take in your hand a bundle of thin grass and strike therewith your wife, and break not your oath.”",
                    "Allah then restored Ayyub’s wealth. Allah sent down a rain of locusts made of gold that fell all around Ayyub. When Ayyub began gathering the gold locusts, Allah asked him, “O Ayyub! Have I not made you too rich to need what you see?” Ayyub replied, “Yes, My Lord! But I cannot shun Your Blessings.”",
                    "Ayyub and Rahma were also given back their family. The couple were blessed with twenty-eight beautiful, healthy children—fourteen girls and fourteen boys.",
                    "The story of Prophet Ayyub is one adversity mixed with patience. It is easy to be a faithful servant of Allah when everything is going well but his faith never faltered during difficult times which is what makes him a remarkable being."
                ],
                "Quranic Verses Mentioning Ayyub": [
                    "And [for] their taking of usury while they had been forbidden from it, and their consuming of the people’s wealth unjustly. And we have prepared for the disbelievers among them a painful punishment.Abiding eternally therein. The punishment will not be lightened for them, nor will they be reprieved. Indeed, We have revealed to you, [O Muhammad], as We revealed to Noah and the prophets after him. And we revealed to Abraham, Ishmael, Isaac, Jacob, the Descendants, Jesus, Job, Jonah, Aaron, and Solomon, and to David We gave the book [of Psalms]. (Surah NisaAyat 161-163)",
                    "They who believe and do not mix their belief with injustice – those will have security, and they are [rightly] guided. And that was Our [conclusive] argument which We gave Abraham against his people. We raise by degrees whom We will. Indeed, your Lord is Wise and Knowing. And We gave to Abraham, Isaac and Jacob – all [of them] We guided. And Noah, We guided before; and among his descendants, David and Solomon and Job and Joseph and Moses and Aaron. Thus do We reward the doers of good (Surah Anam Ayat 82-84).",
                    "And [mention] Job, when he called to his Lord, “Indeed, adversity has touched me, and you are the Most Merciful of the merciful.”So We responded to him and removed what afflicted him of adversity. And We gave him [back] his family and the like thereof with them as mercy from Us and a reminder for the worshippers [of Allah]. (Surah Anbiya Ayat 83-84)",
                    "And remember Our servant Job, when he called to his Lord, “Indeed, Satan has touched me with hardship and torment.”[So he was told], “Strike [the ground] with your foot; this is a [spring for] a cool bath and drink.”And We granted him his family and a like [number] with them as mercy from Us and a reminder for those of understanding.[We said], “And take in your hand a bunch [of grass] and strike with it and do not break your oath.” Indeed, We found him patient, an excellent servant. Indeed, he was one repeatedly turning back [to Allah]. And remember Our servants, Abraham, Isaac and Jacob – those of strength and [religious] vision.Indeed, We chose them for an exclusive quality: remembrance of the home [of the Hereafter]. (Surah Sad 41-46)"
                ]
            },
            "Intro": "The story of Prophet Ayyub (Job) is one of adversity where his faith is constantly being tested. Yet his love for Allah only grows. He remains true to himself and never questions or doubts Allah’s will for a second. We can learn to be more patient and trusting from Prophet Ayyub."
        }
    },
    "2": {
        "Prophet Yunus": {
            "Full Story": {
                "The Story of Prophet Yunus": [
                    "Yunus Ibn Matta (referred to Jonah in English) was a Messenger of Allah sent to Nineveh, a city in northern Iraq with a population of over a hundred thousand. Prophet Yunus was seemingly an ordinary man who was born and raised amongst the fellow citizens of Nineveh.",
                    "The booming city of Nineveh had long forgotten the message of Allah and became a city filled with idol worshiping and sin. Allah decided to send Prophet Yunus, a man born amongst them, as a Messenger to guide them to His path—the path of light.",
                    "Prophet Yunus immediately set out to fulfill his Lord’s wish and invited his people to turn to Allah and shun idol worship. But the people of Nineveh rejected Yunus, just as many nations rejected the prophets and messengers before him. Yunus was not deterred; he continued to call them to the worship of Allah, reminding them of the terrible wrath of Allah that was directed at Ad, Thamud and the people of Nuh.",
                    "But they rejected this and said, “We and our forefathers have worshipped these gods for many years and no harm has come to us.”",
                    "Prophet Yunus wanted to help them and was persistent, he did not give up on his people; despite their ignorance and harsh words, he continued to warn them of Allah’s punishment.",
                    "“Let it happen”, the men laughed, and informed Yunus that they were not the least afraid of his empty threats. Prophet Yunus was disheartened; he gave up on his people. Without the permission of Allah, he decided to leave the city of Nineveh in hopes of finding a community far away that would accept him and enter the fold of Islam.",
                    "The calm skies over Nineveh soon turned red with anger preparing to spit out the wrath of Allah. Men, women and children gathered at the mountain tops watching the combat of the skies above them with hearts filled with fear.",
                    "They soon remembered Yunus’s warning of Allah’s punishment and feared the predicament of Ad, Thamud, and the people of Nuh. With new found faith, they fell on their knees; with their hands stretched out they began to beg for Allah’s forgiveness and mercy. Moved by this display of sincere repentance, Allah lifted His punishment, forgave his subjects and showered his blessings upon them. As the skies cleared, the people prayed for the safe return of their beloved Prophet Yunus, so that he could guide them through the path of Allah.",
                    "Meanwhile, Prophet Yunus, who had left Nineveh, had boarded a small passenger ship with the intention of travelling as far away from his people as possible. The ship travelled through the calm waters during the day; but as the night closed in, a storm raged on rocking the ship wildly to and fro. The crew and passengers began to fear for their lives as the sea water gradually began flooding into the deck, slowly sinking the ship.",
                    "As the tempest continued through the night, the Captain of ship ordered his men to throw out the luggages and all other excess load overboard to lighten the ship’s load. As instructed, the crew threw out the ship’s excess load; but, the ship continued to sink as it was still too heavy. The Captain was left with no choice—he had to sacrifice the life of one man if he wished to save the lives of his crew and passengers. As it was a common practise among men during those times, the Captain decided to draw lots to choose the passenger to be sacrificed. ",
                    "The lots were cast and Prophet Yunus’s name was selected. The men knew that Yunus was a young, righteous, honest and a blessed man, so they refused to throw him out and agreed to draw lots again.",
                    "So the lots were cast, and Yunus’s name appeared again. The men refused to throw Yunus saying, “We are not going to get rid of Yunus. He is our blessing on the boat. He is the best man we have on the boat; we are not going to get rid of him.” So they drew lots for the third time, and Yunus’s named appeared yet again! The men were baffled, but Prophet Yunus knew that this was the verdict of Allah for he had left his people without his Lord’s consent. So Yunus jumped out of the ship into the dark, angry waves in the middle of ocean.",
                    "As Allah commanded, the largest whale in the ocean swallowed Yunus just as he hit the water. Yunus, who was unconscious, awoke to find himself enveloped by sheer darkness.",
                    "He believed he was in his grave; but as his senses awakened, he realised that he was not in his grave but was in fact in the stomach of a large fish.",
                    "Deep in the stomach of the whale, Prophet Yunus prostrated to Allah and said, “O Allah, I am prostrating to you in a place where no one has prostrated to you before, in the stomach of a fish.” He then called out to Allah, repeating, “None has the right to be worshipped but You. Glorified be You. Truly, I have been among the wrongdoers.” The creatures of the deep sea heard the invocations of Yunus, and gathered around the whale to join along in the celebration of the praises of Allah.",
                    "Allah, the Most-Merciful, was immensely moved by Yunus’s repentance. He commanded the whale to spit out His Messenger at the nearest shore. The whale obeyed Allah’s command and swam to the nearest shore and ejected Yunus. Yunus’s body was inflamed as a result of the acids in the whale’s stomach. He had no protection against the sun and wind so Allah commanded a tree to grow over Yunus to provide him with food and shade. Allah forgave him and informed him that if it were not for his sincere invocations, Yunus would continue to be in the stomach of the whale till the Day of Judgment.",
                    "When Yunus was completely recovered, he travelled back to Nineveh to complete his mission. Upon arriving at his hometown, Yunus was stunned—the entire population of Nineveh had accepted Islam and were awaiting his arrival. Together with his people, Yunus prostrated to his Lord and thanked him for all His blessings.",
                    "Yunus was the only Prophet whose entire community accepted Islam. Allah stated in the Holy Quran regarding the people of Yunus Ibn Matta: “Was there any town community that believed after seeing the punishment, and its Faith at that moment, saved it from the punishment? (the answer is none)—except the people of Yunus; when they believed, We removed from them the torment of disgrace in the life of the present world, and permitted them to enjoy for a while.” [Surah Yunus Ayat 98]"
                ]
            },
            "Intro": "The story of Prophet Yunus (Jonah) was a difficult one. His commitment to Allah was questioned and he had to face the consequence of this. However, his story shows Allah’s mercy as if you are sincere in repentance then Allah will shower his Mercy."
        }
    },
    "3": {
        "Prophet Lut": {
            "Full Story": {
                "The Story Of Prophet Lut in Islam": [
                    "The Story of Prophet Lut (PBUH)- The Corrupt City",
                    "Prophet Lut (“Prophet Lot”) was born and raised by his uncle Prophet Ibrahim, may peace be upon him. Prophet Lut loved, respected and believed in Ibrahim’s message even when everyone ridiculed him. Ibrahim, together with Lut, often travelled far, across land and sea, trying to invite and spread man to the fold of Islam.",
                    "During Ibrahim’s and Lut’s migration to Palestine, they received the divine decree of Allah that Lut had been chosen as a Prophet and Messenger for the people of Sodom. Allah instructed the new Prophet to travel to the city of Sodom, located on the border of Jordan and Palestine, and summon the transgressors back to the worship of Allah.",
                    "Sodom was a thriving city that was visited by many travellers, merchants and businessmen for trade. However, Sodom was also the most corrupt city with the highest criminal activity during that time. Travellers passing Sodom were often waylaid and robbed of their belongings, and sometimes were mercilessly murdered. But, the most notorious act of evil that was committed by this corrupt nation was homosexuality.",
                    "Homosexuality was introduced into the world by the people of Lut—none in the history of mankind had ever experienced or practiced homosexuality before Sodom. This shameful practice was the norm amongst this nation, and the entire population engaged in it. They were immensely proud of their conduct, spoke openly about it, and engaged in these immoral behaviors out in the open.",
                    "Homosexuality was introduced into the world by the people of Lut—none in the history of mankind had ever experienced or practiced homosexuality before Sodom. This shameful practice was the norm amongst this nation, and the entire population engaged in it. They were immensely proud of their conduct, spoke openly about it, and engaged in these immoral behaviors out in the open.",
                    "",
                    "Pleased with the Prophethood and his new mission, Prophet Lut soon settled in Sodom and began to devise ways to bring his people in to the fold of Islam. He was well-aware that his nation was the most corrupt nation of that time; but he held firm faith and hoped and prayed that they would soon see the error of their ways and enter into the path of Allah.",
                    "Soon Prophet Lut approached the men of the city and reminded them of their Lord: “Will you not fear Allah and obey Him? Verily! I am a trustworthy Messenger to you. So fear Allah, keep your duty to Him, and obey me.” Puzzled, the men of the city began discussing amongst themselves: “This man has entered our city, and is telling us to cease what we are doing? Clearly, he is gaining something out of this!” Prophet Lut replied: “No reward do I ask of you for it. My reward is only from the Lord of the Worlds.”",
                    "Prophet Lut then broached the matter of homosexuality and informed them that it was indeed an immoral practice. He said: “Do you approach males among the worlds, and leave those whom your Lord has created for you as your wives? Nay, you are a people of transgressing!”",
                    "Prophet Lut then informed his people that he would never agree to be a part of this such a practice, and warned them of a severe punishment from Allah. He said: “I am indeed, of those who disapprove with severe anger and fury your action (of sodomy).” The men and women of Sodom became very angry at Lut’s speech; they began to discuss amongst each other, planning to drive Lut away from their city. They then warned Prophet Lut: “If you cease not, O Lut! Verily, you will be one of those who are driven out!”",
                    "Prophet Lut became distressed. After years and years of inviting people to Islam, not one person in Sodom had entered the fold of Islam. The only Muslim household in Sodom was Lut’s house and not all its occupants were Muslims—Lut and his daughters were steadfast in their religion, but his wife continued to be among the non-believers. So Prophet Lut raised his hands to the heavens and prayed: “My Lord, support me against the corrupting people. My Lord, save me and my family from what they do.”",
                    "Meanwhile, Allah sent three angels, including Angel Jibreel, disguised as men to Prophet Ibrahim’s house as guests. Ibrahim, who failed to recognise the angels, prepared a grand feast for his guests. But his guests refused the meals offered to them. Prophet Ibrahim became fearful; he asked: “Who are you?” The angels replied: “Do not be afraid! We are the angels of Allah. We have been sent to the people of Lut and we have been sent to give you glad tidings of a son possessing much knowledge and wisdom.” Prophet Ibrahim knew that Allah’s punishment for the people of Sodom was near. He immediately feared for his nephew, Lut; he said to the angels: “Indeed, within it is Lut.” The Angels replied: “We are more knowing of who is within it.” They reassured Ibrahim that Lut will be saved.",
                    "The angels then proceeded towards Sodom disguised as handsome young men. The daughter of Lut, a believer, witnessed the handsome men entering the city and frantically ran to her father and informed him of the three men. Prophet Lut approached the men and welcomed them to city of Sodom. He knew too well of the fate that would befall the young men at the hands of the men of Sodom; so he intended to convince the men to leave the city for their own safety. But Prophet Lut was too embarrassed to ask the guests to leave, so he guided the guests to his home ensuring that none saw the three handsome men.",
                    "Lut’s wife, a non-believer, saw the men as they entered her house, together with her husband, Lut. She hurried to the men of the city and informed them that Lut had three attractive, young men in his house. The men rejoiced at the news and slowly gathered outside the house of Lut and began pounding on his door. Lut shouted: “Do not disgrace me concerning my guests. Is there not among you a man of reason?” Growing restless, the men shouted back: “Have we not forbidden you from [hosting] people?”",
                    "The whole nation of Sodom had now gathered at Lut’s doorstep. They grew impatient by the minute and began breaking down his door. Feeling agitated, Lut called out to his people: “These [the girls of the nation] are my daughters [to marry lawfully] if you must act so.” The men responded: “You have already known that we have no interest in your daughters; and indeed, you know what we want.” Prophet Lut became helpless against the corrupt people. “If only I had against you some power or could take refuge in a strong power”, he thought. The three men then spoke up: “O Lut, indeed we are angels of your Lord; [therefore] they will never reach you.”",
                    "Angel Jibreel then stepped out of Lut’s house and struck the men causing all men to lose their eyesight. Shocked and enraged, the men shouted: “What’s this magic that just hit us? Where did this come from? O Lut! You are the one behind this. You will see what we will do to you tomorrow.” The blind men then returned to their homes plotting to destroy Lut the following day.",
                    "Allah commanded Lut: “Set out with your family during a portion of the night and let not any among you look back, except your wife. Indeed she will be struck by that which strikes them. Indeed, their appointment is [for] the morning. Is not the morning near?” As instructed, Prophet Lut, together with his daughters, left Sodom during the night.",
                    "As the morning dawned, a loud, piercing cry ensued through the city that shook the occupants with great pain and fear. Jibreel then grabbed the nation from the edge of his wing, raised them high up, twisted the land, and crashed it to the ground. Allah then caused the skies to rain down stones of hard clay—each stone inscribed with the name of a transgressor for whom it was intended for, ending the vain lives of the occupants of Sodom.",
                    "Prophet Lut, who left Sodom with his daughters, returned to his uncle, Prophet Ibrahim. Together with Ibrahim, Lut continued to spread the message of Allah till his death.",
                    "Today, the Dead Sea lies at the site of the corrupt city of Sodom, and remains as a powerful reminder of Allah’s wrath against the people of Prophet Lut. Allah the Exalted says in the Holy Quran: “Surely! In this are signs for those who see. And verily! They (the cities) are right on the highroad (from Mecca to Syria, i.e. the place where the Dead Sea is now). Surely! Therein is indeed a sign for the believers.”",
                    "Mentions Hebrew Bible and New Testament",
                    "Moses in the Hebrew Bible referred to the destruction of Sodom and Gomorrah in Deuteronomy 29:22–23:",
                    "“Your children who follow you in later generations and foreigners who come from distant lands will see the calamities that have fallen on the land and the diseases with which the lord has afflicted it. The whole land will be a burning waste of salt and sulfur—nothing planted, nothing sprouting, no vegetation growing on it. It will be like the destruction of Sodom and Gomorrah, Admah and Zeboyim, which the Lord overthrew in fierce anger.”",
                    "In the Bible New Testament,Luke 17:28–30, Jesus compares his second-coming to the judgment of Sodom and Gomorrah:",
                    "Likewise as it was in the days of Lot—they ate, they drank, they bought, they sold, they planted, they built, but on the day when Lot went out from Sodom fire and sulphur rained from heaven and destroyed them all—so will it be on the day when the Son of man is revealed."
                ],
                "Quran Verses That Mention The Story Of Prophet Lut": [
                    "There are a total of 17 ayats that mention the Prophet Lut (pbuh) in the Qur’an.",
                    "Surah Anam (6:86)",
                    "Surah Araf (7:80)",
                    "And [We had sent] Lot when he said to his people, “Do you commit such immorality as no one has preceded you with from among the worlds?Indeed, you approach men with desire, instead of women. Rather, you are a transgressing people.” But the answer of his people was only that they said, “Evict them from your city! Indeed, they are men who keep themselves pure.” (Ayat 80-82)",
                    "Surah Hud (11:70, 74, 77, 89)",
                    "But when he saw their hands not reaching for it, he distrusted them and felt from them apprehension. They said, “Fear not. We have been sent to the people of Lot.” (Ayat 70)",
                    "And when the fright had left Abraham and the good tidings had reached him, he began to argue with Us concerning the people of Lot. (Ayat 74)",
                    "And when Our messengers, [the angels], came to Lot, he was anguished for them and felt for them great discomfort and said, “This is a trying day.” (Ayat 77)",
                    "And O my people, let not [your] dissension from me cause you to be struck by that similar to what struck the people of Noah or the people of Hud or the people of Salih. And the people of Lot are not from you far away. (Ayat 89)",
                    "Surah Hijr (15:59)",
                    "[Abraham] said, “Then what is your business [here], O messengers? They said, “Indeed, we have been sent to a people of criminals, Except the family of Lot; indeed, we will save them all Except his wife.” Allah decreed that she is of those who remain behind. (Ayat 57-60)",
                    "Surah Anbiya (21:71, 74)",
                    "And to Lot We gave judgement and knowledge, and We saved him from the city that was committing wicked deeds. Indeed, they were a people of evil, defiantly disobedient. (Ayat 74)",
                    "Surah Hajj (22:43)Surah Ankabut (29:28, 32)",
                    "And [mention] Lot, when he said to his people, “Indeed, you commit such immorality as no one has preceded you with from among the worlds. Indeed, you approach men and obstruct the road and commit in your meetings [every] evil.” And the answer of his people was not but they said, “Bring us the punishment of Allah, if you should be of the truthful.” He said, “My Lord, support me against the corrupting people.” And when Our messengers came to Abraham with the good tidings, they said, “Indeed, we will destroy the people of that Lot’s city. Indeed, its people have been wrongdoers.” [Abraham] said, “Indeed, within it is Lot.” They said, “We are more knowing of who is within it. We will surely save him and his family, except his wife. She is to be of those who remain behind.” (Ayat 28-32)Surah Saffat (37:153)Surah Sad (38:13)Surah Qaf (50:13)Surah Qamar (54:33)",
                    "The people of Lot denied the warning. Indeed, We sent upon them a storm of stones, except the family of Lot – We saved them before dawn As favor from us. Thus do We reward he who is grateful.And he had already warned them of Our assault, but they disputed the warning.And they had demanded from him his guests, but We obliterated their eyes, [saying], “Taste My punishment and warning.”And there came upon them by morning an abiding punishment. (Ayat 33-38)",
                    "Tahrim (66:10)",
                    "Allah presents an example of those who disbelieved: the wife of Noah and the wife of Lot. They were under two of Our righteous servants but betrayed them, so those prophets did not avail them from Allah at all, and it was said, “Enter the Fire with those who enter.” (Ayat 10)"
                ]
            },
            "Intro": "The people of Sodom were prosperous and thriving. In such success people often diverge to the wrong path away from Allah. They got involved in many sinful activities, one of which being homosexuality. Allah then sent Prophet Lut to help the city of Sodom. The story of Sodom is also mentioned in the Jewish and Christian faith."
        }
    },
    "4": {
        "Prophet Idris": {
            "Full Story": {
                "Story of Prophet Idris In Islam": [
                    "Who Is Prophet Idris?",
                    "Prophet Idris (Biblical name Enoch) was the third Prophet in Islam after Adam (AS).",
                    "According to Wahab, Idris was a well-built man with a strong broad chest and spoke with a low voice. It is also said he was tall and handsome and always spoke with a calm demeanor. Prophet Idris was very intellectually curious, he would ponder the vastness of the universe that his creator made — from the sky, the earth, the moon, the stars and the cloud.",
                    "The Qur’an mentions 2 verses which refer to Prophet Idris and are a testament to his character.",
                    "Wazkur fil Kitaabi Idrees; innahoo kaana siddeeqan Nabiyyaa",
                    "And mention in the Book, Idrees. Indeed, he was a man of truth and a prophet.",
                    "Surah Maryam Ayat 56",
                    "Wa Ismaa’eela wa Idreesa wa Zal Kifli kullum minas saabireen",
                    "And [mention] Ishmael and Idrees and Dhul-Kifl; all were of the patient.",
                    "Surah Anbiya Ayat 85"
                ],
                "Prophet Idris Story": [
                    "Prophet Idris was born during the lifetime of Prophet Adam. He was from amongst the followers of Sheath (Seth) and ruled the progeny of Adam following the death of Sheath. He was truthful, patient and an extraordinary individual— it is reported in hadith by Abu-Dharr that Idris was the first man to introduce the art of reading and writing to mankind.",
                    "Idris was a sincere servant of Allah, hence Allah chose him as a Prophet and Messenger, and elected him as the ruler over the children of Adam.",
                    "What began after death of Sheath is the people of Cain lost guidance and sin and corruption began increasing rapidly and spreading. Idris could not bear to watch his own people falling prey to the influence of shaitan. So Allah instructed Prophet Idris to call for Jihad (holy war) against the corrupt followers of Qabil (Cain) —Idris was the first Prophet and Messenger in the history of Islam to perform Jihad against corruption.",
                    "And as commanded by Allah, Idris gathered an army of men and battled in the name of Allah against the transgressors and emerged victorious.",
                    "Prophet Idris Victory over Transgressors",
                    "One day, Prophet Idris was informed by Allah that he would receive the rewards of all the good deeds performed by man each day till his last breath.",
                    "Prophet Idris was overjoyed with the news and thanked Allah immensely for all His blessings. But Idris was quite old, and was not quite ready to depart earth as enjoyed spreading good. So, he decided to speak to the Angel of death and plead him to delay his death. The Angel agreed to Idris’s plea and decided to meet with the Angel of death together with Idris.",
                    "The Angel flew to the fourth heaven with Prophet Idris on his wings and met with the Angel of death. Idris’s dear companion said to the Angel of death, “Prophet Idris wants to know if you could prolong his life”. The Angel of death was stunned; he replied, “And where is Idris?” “He is upon my back”, answered the Angel. The Angel of death replied, “How astonishing! I was sent and told to cease Idris’s soul in the fourth heaven. I kept thinking how I could cease it in the fourth heaven when he was on earth. Subhanallah (glory be to God), He made it happen!” And as the Lord instructed the Angel of death, the soul of Idris was taken in the fourth heaven.",
                    "Following the death of Prophet Idris, corruption began to increase rapidly again. Several generations later, with no Prophetic guidance, Satan finally managed to influence the children of Adam to commit their first act of shirk (polytheism).",
                    "Sayings And Quotes",
                    "There are some quotes and sayings which are attributed to Prophet Idris’ and here they are:",
                    "“Happy is he who looks at his own deeds and appoints them as pleaders to his Lord.”",
                    "“None can show better gratitude for Allah’s favors than he who shares them with others.”",
                    "“Do not envy people for what they have, as they will only enjoy it for a short while.”“He who indulges in excess will not benefit from it.”“The real joy of life is to have wisdom.”"
                ]
            },
            "Intro": "Prophet Idris (Enoch) was the second Prophet in Islam after Adam. He was the first person to Jihad and fought against corruption of Qabil (Cain)."
        }
    },
    "5": {
        "Prophet Dhul-Kifl": {
            "Full Story": {
                "Prophet Dhul Kifl": [
                    "The Story of Dhul-Kifl (also referred to as Zul-Kifl) is a bit of a mystery.",
                    "There is not much information known or recorded and a lot of debate as to whether he truly is a Prophet.",
                    "The literal meaning of Dhul-Kifl is “Possessor of the Fold”. What we know about him is that he was a righteous man and ‘company of the good’ who was also extremely patient. This is based off two mentions of Dhul-Kifl in the Glorious Qur’an.",
                    "The first is fromSurah Al-Anbya ayat 85-86:",
                    "The second mention in Qur’an is from Surah Sad ayat 45-49:",
                    "“And remember Our servants, Abraham, Isaac and Jacob – those of strength and [religious] vision. Indeed, We chose them for an exclusive quality: remembrance of the home [of the Hereafter]. And indeed they are, to Us, among the chosen and outstanding. And remember Ishmael, Elisha and Dhul-Kifl, and all are among the outstanding. This is a reminder. And indeed, for the righteous is a good place of return.”",
                    "According to Ibn Kather it’s seems logical that him being mentioned in the Glorious Qur’an among those other Prophets then, through association, he should also be considered a prophet.",
                    "However, many other famous Quranic commentators like Imam Ibn Jarir refrained from making such decisive comments. He believes that Dhul-Kifl was a saint and just, but no evidence of being a prophet.",
                    "Ibn Kathir contends by referring to Allah’s statement,",
                    "﴿وَرُسُلاً لَّمْ نَقْصُصْهُمْ عَلَيْكَ﴾",
                    "Which means, “and Messengers We have not mentioned to you” referring to the fact that there are other Prophets whom We did not mention to you in the Qur’an. The Quran makes mention of the following Prophets, may peace be upon them all.",
                    "Adam",
                    "Idris",
                    "Nuh (Noah)",
                    "Hud",
                    "Salih",
                    "Ibrahim (Abraham)",
                    "Lut",
                    "Isma`il (Ishmael)",
                    "Ishaq (Isaac)",
                    "Ya`qub (Jacob)",
                    "Yusuf (Joesph)",
                    "Ayyub (Job)",
                    "Shu`ayb",
                    "Musa(Moses)",
                    "Harun (Aaron)",
                    "Yunus (Jonah)",
                    "Dawud (David)",
                    "Sulayman (Solomon)",
                    "Ilyas (Elias)",
                    "Al-Yasa (Elisha)",
                    "Zakariya (Zachariya)",
                    "Yahya (John)",
                    "Isa (Jesus)",
                    "Muhammad"
                ],
                "Story Of Prophet Dhul-Kifl by Ibn jarir": [
                    "Imam Ibn Jarir gives an account of Dhul-Kifl which provides some insight into the Prophet’s life.",
                    "When Al-Yasa (Elisha) grew old he was looking to appoint a successor that could help guide the Israelites and needed someone with calm demeanor and a clear mind. He assembled a group of companions and set out three conditions which he believed would be a testament to great leader,",
                    "“the person who will be considered for my replacement is one who fasts year around during the day, remembers Allah in prayer throughout the night, and must not ever lose his temper.”",
                    "A relatively unknown person who was held in contempt by the people, stood up and offered himself for the job. Prophet Yasa asked him whether these three conditions were met. The man replied yes to all three but for whatever reason Yasa did not believe his claim and rejected him.",
                    "After few more days past, Yasa gathered the group again and repeated if his conditions were met. Everyone remained seated besides the same man. Yasa seeing his persistence appointed the man to serve as his deputy.",
                    "But to truly test the Man’s will he asked a few people to try and persuade the man into doing something that would result in him being removed from being his deputy.",
                    "They all tried and they all failed.",
                    "Then Iblis (satan) offered his services to Al-Yasa, “Leave him to me. I will take care of him.”",
                    "***",
                    "The man at this point developed a routine which involved fasting during the day, making prayer remembering Allah throughout the night. In the afternoon, he would take a nap to rejuvenate himself.",
                    "Iblis decided to disturb the man right before his afternoon nap by knocking at the door and begging to be let in saying, “I am an old tortured man.”",
                    "Iblis was welcomed in and began to ramble on about the cruelty and injustice which he suffered. He stretched the story so long that no time was spared for the man’s daily nap. The man offered to Iblis to come visit him in his court the next day so that justice would be done for him.",
                    "The man waited for the Iblis the next day but he did not turn up. The next morning, he waited for the Iblis to return but he did not return again. Finally, in the afternoon, right before the man was about to take his nap, Iblis came and started banging on the door. The man, still calm, questioned him, “Didn’t I tell you to come to my court yesterday, but you failed to appear, nor did you come this morning?”",
                    "To this the Iblis replied, “Sir, my enemies are very wicked people; when they learnt that you were sitting in your court and would force them to give back to me what was due, they agreed to settle the matter out of court. But as soon as you left your court, they went back on their promise.”",
                    "The conversation continued for a long time where he missed his usual nap, the man asked Iblis to visit his court again to settle matters. Once again, the man waited patiently in the court but Iblis did not visit. When he returned home that day, he was felt very tired because the lack of sleep. He asked the family members not to allow anyone to knock at the door.",
                    "Iblis once again tried to disturb his sleep so he would not be able to fast, pray and hoped he would grow in anger but when he tried knocking on the door the man’s family members stopped him. Iblis was determined, he forced another way into the man’s home and started knocking at the door of his room.",
                    "The man saw Iblis had come inside the house while the door remained shut. Then he suddenly became aware that the man standing before him was Iblis and asked him, “Are you the enemy of God?”",
                    "He admitted that he was Iblis and remarked, “You have thwarted all my plans and frustrated all my efforts to entice you in my design. My intention was to make you angry somehow, so that one of your claims before Yasa could be proven false.”",
                    "It was because of this episode the man was given the title Dhul-Kifl, a title meaning “possessor of, or giving, a double requital or portion”."
                ]
            },
            "Intro": "Dhul-Kifl is a less known prophet and his story is a bit of a mystery. There are two mentions in the Qur’an about him that are a testament to his moral character."
        }
    },
    "6": {
        "Prophet Nuh": {
            "Full Story": {
                "Prophet Nuh": [
                    "Full Story of Prophet Nuh (Noah) In Islam",
                    "The Muslims were left stranded following the death of Prophet Idris. Since, no other man from amongst them was chosen as a Prophet, people began to look to the pious companions of Idris for guidance. They respected and followed these righteous men and consulted them every time they were faced with a problem. Eventually, as time passed by, the pious men also had passed away leaving the Muslims again with no leader for guidance. They feared and were worried that they would stray from the path of Allah.",
                    "Satan who watched on with shrewd eyes, approached the wailing men and women, disguised as a man, whispered in to their ears: “If we make statues of these righteous men, it will be more pleasing to us in our worship and will remind us of them.” The men agreed as they perceived no harm in erecting statues of their most pious men, that would surely help them remember Allah and encourage them to do good.",
                    "Satan had successfully planted his corrupt seed. He was patient for he knew that getting man to worship another was a slow process. When that generation had passed and the new generation of people had forgotten the intention behind the erecting of statues, Satan whispered into the ears of the men: “Your forefathers used to worship these idols. These statues brought them goodness.”",
                    "Thus, idolatry took root in the hearts of man.",
                    "Centuries passed, and Allah decided to send a Prophet to guide the idolaters back to the truth. The prophet chosen for this sacred task was Nuh (Noah). Allah blessed his loyal disciple with eloquent speech and immense patience so that he may carry out his duty with success. So Prophet Nuh began to preach to his people about the mysteries of the vast universe—he informed them about the night and the day, the stars and the moon, the plants and animals, and the heavens and the earth. He explained to them that man was created by Allah to glorify and worship Him. Nuh then told them about the oneness of Allah—that the mysteries of the world were only proof of the existence of one true God and that is none other than Allah the Most High. He explained to them that Satan had misled them into worshiping idols and warned them of a terrible punishment from Allah if they continued their idol worship.",
                    "The People of Prophet Nuh listened to him with great confusion and patience. The most miserable and desperate amongst Nuh’s people began to find hope and solace in the Prophet’s words and gradually entered into the fold of Islam, whilst the affluent watched on with rage. They said to Nuh: “We see you but a man like ourselves”. Prophet Nuh explained to them that he was certainly a human being and Allah had specifically chosen a human messenger as the earth was predominantly occupied by humans after all. And if the earth was occupied by angels, Allah would have surely sent an angelic messenger to convey his message.",
                    "One day, the wealthy masters of the city approached Prophet Nuh and said to him: “Listen Nuh, if you want us to believe in you, then dismiss your believers. They are meek and poor, while we are elite and rich; no faith can include us both.” Nuh was well-aware of the ignorance of the wealthy men. He knew that he had to remain calm in order to explain to them that materialistic possessions were worthless in the sight of Allah and it was what is within one’s heart that really mattered to Him. Prophet Nuh replied to them: “O my people! I ask for no wealth for it, my reward is from none but Allah. I am not going to drive away those who have believed. Surely, they are going to meet their Lord, but I see that you are ignorant people. O my people! Who will help me against Allah, if I drove them away? Will you not then give a thought? And I do not say to you that with me are the Treasures of Allah nor that I know the unseen, nor do I say that I am an angel, and I do not say of those whom your eyes look down upon that Allah will not bestow any good on them. Allah knows what is in their inner selves. In that case, I should, indeed be one of the wrongdoers.”",
                    "The idolaters were furious. They had tolerated Nuh’s incessant preaching and arguments for far too long. They angrily challenged Nuh: “O Nuh! You have disputed with us and have prolonged the dispute with us, now bring upon us what you threaten us with, if you are of the truthful.” Nuh replied: “Only Allah will bring the punishment on you, if He wills, and then you will not be able to escape. And my advice will not profit you, even if I wish to give you counsel, if Allah’s Will is to keep you astray. He is your Lord! And to Him you shall return.”",
                    "The disbelievers, who had lost all patience with Nuh, resorted to hurl insults at the Messenger of Allah in attempt to frighten him from preaching the religion of Islam. They said: “Verily, we see you in plain error”. Nuh patiently replied: “O my people! There is no error in me, but I am a Messenger from the Lord of the worlds! I convey unto you the Messages of my Lord and give sincere advice to you. And I know from Allah what you know not.”",
                    "Despite the continuous mockery and rejection, Prophet Nuh was persistent in calling his people to Islam for nine hundred and fifty years. But every generation that came to existence rejected Nuh as their fathers did. Each child that reached an age of understanding was clearly warned against the teachings of Prophet Nuh. Whenever the Prophet approached them they ran away from him. They found every excuse to escape from the presence of Nuh. Before long, Prophet Nuh realized that the number of disbelievers were rapidly on the rise, whilst the number of believers remained unchanged. He was very upset for his people and feared a terrible predicament for them, but he was left with no choice.",
                    "So Prophet Nuh prayed to Allah: “My Lord! They have disobeyed me, and followed one whose wealth and children give them no increase but only loss. They have plotted a mighty plot. They have said: ‘you shall not leave your gods, nor shall you leave Wadd, Suwa, Yaghuth, Ya’uq, nor Nasr (names of the idols)’. Indeed they have led many astray. O Allah! Grant no increase to the disbelievers.”",
                    "Allah soon revealed to Prophet Nuh that no other man from his people would enter Islam thereafter. Sad and frustrated, Prophet Nuh replied to Allah: “My Lord! Leave not one of the disbelievers on the earth. If you leave them, they will mislead Your slaves and they will beget none but wicked disbelievers.” Prophet Nuh’s prayer was accepted by his Lord. He instructed Prophet Nuh: “And construct the ark under Our Eyes and with Our Inspiration and address Me not on behalf of those who did wrong.”",
                    "Outside the city limits, away from the sea, Prophet Nuh began to build the ark through day and night with the support and guidance of the Angels. The construction of the ark continued amidst the constant mockery of the people. They jeered at Prophet Nuh saying: “O Nuh! Does carpentry appeal to you more than prophethood? Why are you building an ark so far from the sea? Are you going to drag it to the water or is the wind going to carry it for you?” Prophet Nuh answered: “You will come to know who will be put to shame and suffering.”",
                    "Allah then instructed to Nuh that when the oven at his home begins to gush forth water, collect the believers and board the ark for it was the first sign of the beginning of the floods that would destroy the disbelievers. Not long after, the terrible day dawned as water began gushing forth from the oven at Prophet Nuh’s house. Nuh knew it was time to board the ark. Along with the believers, Nuh also took with him pairs of animals, birds and insects. The people who witnessed Nuh’s peculiar behaviour laughed at him again saying: “Nuh must have gone out of his head! What is he going to do with the animals?”",
                    "Soon after, heavy rains began to pour down from the angry skies and water began to rise through every crack on earth. The water levels gradually began to rise and the oceans conquered the land. The once dry land was now completely submerged in water for the first time.",
                    "Prophet Nuh witnessed the terrible calamity that had befallen his people. He knew the disbelievers had no escape from the wrath of Allah. Amongst the disbelievers was Prophet Nuh’s wife and son who refused to board his ark. Nuh desperately called out to his son: “O my son! Embark with us and be not among the disbelievers.” The ignorant son of Nuh replied, “I will get to the mountain; it will save me from the water.” Nuh answered: “This day there is no saviour from the Decree of Allah except him on whom He has mercy.” Before long, Nuh’s son was engulfed by angry waves never to be seen again.",
                    "When every single disbeliever had perished, Allah ordered the skies and the earth: “O Earth! Swallow up your water, and O sky! Withhold your rain.” The skies immediately cleared and the sun shone brightly on the land. Meanwhile, Nuh’s ark peacefully landed on Mount Judi. Allah instructed His Prophet: “O Nuh! Come down (from the ship) with peace from Us and blessings on you and on the people who are with you.”",
                    "As instructed, Prophet Nuh along with the believers got off the ark, releasing the rescued animals, birds and insects across the green land. Prophet Nuh, placed his forehead on the ground, prostrated to his Lord and thanked Him immensely for His mercy and blessings. The believers were grateful to Allah for safeguarding them from the terrible ordeal and observed a day of fasting as an act of gratitude to Allah."
                ],
                "References that refer to Prophet Noah": [
                    "There are a total of 47 different instances where Allah directly refers to Prophet Noah. Here they are for your reference:",
                    "Imran (3:33)",
                    "Anam (6:84)",
                    "Araf (7:59)",
                    "Araf (7:69)",
                    "Taubah (9:70)",
                    "Yunus (10:71)",
                    "Hud (11:25)",
                    "Hud (11:36)",
                    "Hud (11:89)",
                    "Ibrahim (14:9)",
                    "Isra (17:3)",
                    "Isra (17:17)",
                    "Maryam (19:58)",
                    "Anbiya (21:76)",
                    "Hajj (22:42)",
                    "Muminun (23:23)",
                    "Furqan (25:37)",
                    "Shuara (26:105)",
                    "Ankabut (29:14)",
                    "Saffat (37:75)",
                    "Sad (38:12)",
                    "Ghafir (40:5)",
                    "Ghafir (40:31)",
                    "Shura (42:13)",
                    "Qaf (50:12)",
                    "Dhariyat (51:46)",
                    "Najm (53:52)",
                    "Qamar (54:9)",
                    "Hadid (57:26)",
                    "Tahrim (66:10)",
                    "Araf (7:64)",
                    "Yunus (10:73)",
                    "Hud (11:37)",
                    "Hud (11:40)",
                    "Muminun (23:27)",
                    "Ankabut (29:15)",
                    "Qamar (54:13)",
                    "Haqqah (69:11)",
                    "Nuh (71:1)",
                    "Araf (7:64)",
                    "Yunus (10:73)",
                    "Hud (11:40)",
                    "Furqan (25:37)",
                    "Ankabut (29:120)",
                    "Ankabut (29:14)",
                    "Qamar (54:11)",
                    "Nuh (71:25)"
                ]
            },
            "Intro": "Prophet Nuh (Noah) is a story about disbelievers. Prophet Noah was sent down to prevent the Muslims that were following Prophet Idris from going astray after his passing."
        }
    },
    "7": {
        "Prophet Al-Yasa": {
            "Full Story": {
                "Story of Al-Yasa (Elisha)": [
                    "Story of Al-Yasa (Elisha)",
                    "The Story of Al-Yasa (Elisha)",
                    "Al-Yasa, also referred to as Elisha or Elyas’ (pbuh) is regarded as a Prophet in Judaism, Christianity, and in Islam.",
                    "Al Yasa was one of the Children of Israel descendent from Yusuf ibn Ya’qoob ibn is-haaq ibn Ibraaheem al-khaleel.",
                    "Allah sent down Al-yasa as a successor to Prophet Elijah (pbuh) to help guide the children of Israel. He lived among his people and called upon them to obey the laws and commands of Allah.",
                    "Not much is known about his life, but the Quran speaks highly of him in the two ayah he is mentioned.",
                    "Allah says in Surah Al-An’am Ayat 84-87:",
                    "84. وَوَهَبْنَا لَهُۥٓ إِسْحَٰقَ وَيَعْقُوبَ ۚ كُلًّا هَدَيْنَا ۚ وَنُوحًا هَدَيْنَا مِن قَبْلُ ۖ وَمِن ذُرِّيَّتِهِۦ دَاوُۥدَ وَسُلَيْمَٰنَ وَأَيُّوبَ وَيُوسُفَ وَمُوسَىٰ وَهَٰرُونَ ۚ وَكَذَٰلِكَ نَجْزِى ٱلْمُحْسِنِينَ",
                    "85. وَزَكَرِيَّا وَيَحْيَىٰ وَعِيسَىٰ وَإِلْيَاسَ ۖ كُلٌّ مِّنَ ٱلصَّٰلِحِينَ",
                    "86.وَإِسْمَٰعِيلَ وَٱلْيَسَعَ وَيُونُسَ وَلُوطًا ۚ وَكُلًّا فَضَّلْنَا عَلَى ٱلْعَٰلَمِينَ",
                    "87. وَمِنْ ءَابَآئِهِمْ وَذُرِّيَّٰتِهِمْ وَإِخْوَٰنِهِمْ ۖ وَٱجْتَبَيْنَٰهُمْ وَهَدَيْنَٰهُمْ إِلَىٰ صِرَٰطٍ مُّسْتَقِيمٍ",
                    "“And We gave to Abraham, Isaac and Jacob – all [of them] We guided. And Noah, We guided before; and among his descendants, David and Solomon and Job and Joseph and Moses and Aaron. Thus do We reward the doers of good. And Zechariah and John and Jesus and Elias – and all were of the righteous. And Ishmael and Elisha and Jonah and Lot – and all [of them] We preferred over the worlds. And [some] among their fathers and their descendants and their brothers – and We chose them and We guided them to a straight path.”",
                    "In Surah Sad Ayat 48-50 Allah (SWT) says,",
                    "48.وَٱذْكُرْ إِسْمَٰعِيلَ وَٱلْيَسَعَ وَذَا ٱلْكِفْلِ ۖ وَكُلٌّ مِّنَ ٱلْأَخْيَارِ",
                    "49.هَٰذَا ذِكْرٌ ۚ وَإِنَّ لِلْمُتَّقِينَ لَحُسْنَ مَـَٔابٍ",
                    "50.جَنَّٰتِ عَدْنٍ مُّفَتَّحَةً لَّهُمُ ٱلْأَبْوَٰبُ",
                    "“And remember Ishmael, Elisha and Dhul-Kifl, and all are among the outstanding. This is a reminder. And indeed, for the righteous is a good place of return Gardens of perpetual residence, whose doors will be opened to them.”",
                    "It is said by Ibn Kathir that after Elijah’s passing, dissension rose, events took momentum and sins increased everywhere. Eventually the number of tyrants increased in size and sought to kill the Prophets.",
                    "There are sources that claim that Al-yasa had been hiding with Elijah in a cave in Mount Qasium to escape from the king of Ba’alabak. When Elijah passed, he then succeeded him as Prophet.",
                    "The story of Al-yasa is told in more detail in the Hebrew scriptures and the Bible, but across all texts one thing remains consistent which we can learn from is Al-Yasa character.",
                    "He really loved and was committed to guiding his people on the right path. He was righteous and consistently showed humility, passion and did the right thing. This is something we can all strive for and practice.Allah says in Surah Baqarah,",
                    "“”Righteousness is not that you turn your faces toward the east or the west, but [true] righteousness is [in] one who believes in God, the Last Day, the angels, the Book, and the prophets and gives wealth, in spite of love for it, to relatives, orphans, the needy, the traveler, those who ask [for help], and for freeing slaves; [and who] establishes prayer and gives zakah (obligatory charity); [those who] fulfill their promise when they promise; and [those who] are patient in poverty and ailment and during battle. Those are the ones who have been true, and it is those who are the righteous.” (Quran 2:177)”"
                ]
            },
            "Intro": "Prophet Al-Yasa (Elisha) was a Prophet in Judiasm, Christianity and in Islam. He was the successor to Elijah. Allah refers to him twice in the Qur’an."
        }
    },
    "8": {
        "Prophet Yusuf": {
            "Full Story": {
                "The Story of Prophet Yusuf (PBUH)": [
                    "Yusuf (Joseph) was the beloved son of Prophet Yaqub (Jacob), who also had 11 other sons. Binyamin, who was youngest, was from the same mother as Yusuf, while the rest were older half-brothers.",
                    "Yusuf, still a young boy, awoke one glorious morning delighted by a pleasant dream he just had. He ran to his father in excitement and said, “O my father, indeed I have seen eleven stars and the sun and the moon; I saw them prostrating to me.” Yaqub was overjoyed in realisation that his dear son was indeed chosen by Allah to be bestowed with Prophethood. However, Yaqub was concerned about his older sons’ possible reaction to this narration, for even though he treated them the same, they harboured jealousy towards Yusuf. He therefore warned Yusuf against relating his dream to his brothers, lest they plot for his downfall.",
                    "With the passage of time, the malice in the hearts of Yusuf’s brothers kept growing. They envied Yusuf because they felt he was special and they were not. Unable to handle their emotions they devised a plan to get rid of Yusuf by throwing him into a well. So, one day they approached their father and suggested that he send Yusuf to come with them on an outing. A very reluctant Yaqub said, “Indeed, it saddens me that you should take him and I fear that a wolf would eat him while you are unaware.” But the brothers insisted that they would take extreme care of him and that they Yusuf would enjoy himself.",
                    "The next day, Yusuf set off with his brothers. They traveled far, in pursuit of a well deep enough to throw their brother in. When they finally reached the well, on the pretext of drinking water they led him to it, grabbed him, and removed his shirt. Yusuf began struggling and pleaded with them to let go. The brothers eventually outpowered Yusuf and threw him down the well and rushed back home.",
                    "The brothers ran to their father carrying Yusuf’s shirt that was smeared with sheep’s blood. They cried, “O our father, indeed we went racing with each other and left Yusuf with our possessions, and a wolf ate him.” Yaqub’s was suspicious of their story, he in his heart believed his son was still alive and that the brothers were likely enticed by Shaitan (satan) to do evil. He remarked that the wolf was indeed merciful to have eaten his son up without tearing his shirt! He bore the bereavement with patience and prayed for his son’s safe return.",
                    "Meanwhile, Yusuf managed to cling onto a stone ledge, he prayed fervently to Allah to grant him salvation. Soon, a caravan bound for Egypt stopped at this well to fetch water. The water drawer hauled up his bucket and was shocked to see the handsome boy clinging onto the rope. The caravan peopleimmediately shackled Yusuf and took him along to Egypt. Here, he was auctioned and sold as a slave to the highest bidder who happened to be the treasurer, Al-Azeez. Yusuf’s new master, who had no children, was completely taken with Yusuf. He told his wife to take good care of Yusuf and they could either use him as slave or take him for a son.",
                    "Yusuf not only grew up to be a handsome young man but was also blessed with exceptional knowledge and wisdom by Allah. His honesty won the heart of Al-Azeez, who placed Yusuf in charge of his household. During this period, Yusuf was confronted with his second trial. Zulaika, Al-Azeez’s wife, who watched Yusuf day after day, began to feel passionately about him. Her obsession heightened to a degree where she was desperate to fulfil her desire.",
                    "One day, when her husband was away from home, she closed the doors and invited Yusuf to her. Yusuf, fearing Allah, replied, “[I seek] refuge in Allah. Indeed, he is my master, who has made good my residence. Indeed, wrongdoers will not succeed.” He turned away and run towards the closed door to escape. Zulaika chased after him in desperation and grabbed his shirt from the back which caused his shirt to rip. The door opened and Al-Azeez entered. Ashmed, she ran to him and cried, “What is the recompense of the one who intended evil for your wife but that he be imprisoned or a painful punishment?” Yusuf was baffled. He continued to deny his mistress’s claim saying, “It was she who sought to seduce me.”",
                    "Al-Azeez was a fair man. He was confused and unsure of whom to believe. So he consulted his wife’s cousin for advice. “If his shirt is torn from the front, then she has told the truth, and he is of the liars,” advised the cousin. Thus, Yusuf’s innocence was proven. Al-Azeez apologised for his wife’s indecency and swore Yusuf to secrecy.",
                    "Nevertheless, the story of Zulaika’s pursuit spread. Other women began ridiculing her character. Distressed, Zulaika planned to prove to them her helpless reaction to Yusuf’s extraordinary handsomeness. Hence, she invited these women to a banquet at her residence one day. There she served them fruit along with knives. When the women were happily chatting away while slicing fruits, Zulaika summoned Yusuf. The women looked up at him. Astonished at such angelic beauty, they cut their hands without even realizing they had. Zulaika seized the moment to announce that this was the man for whom she was blamed. She then warned Yusuf that if he denied her again he would be imprisoned, to which Yusuf replied, “My Lord, prison is more to my liking than that to which they invite me.” That night Zulaika convinced her husband that the only way to safeguard her honor and his prestige was to imprison Yusuf. Thus, Yusuf was thrown into jail.",
                    "During Yusuf’s time in jail, he was bestowed with the ability to interpret dreams. Two of Yusuf’s cell mates, mesmerized by his piety, sought him to have their dreams explained. One dreamt that he was serving the king wine and the other was carrying bread on his head which two birds were eating up. Yusuf initially called them to Allah, then interpreted, “O two companions of prison, as for one of you, he will give drink to his master of wine; but as for the other, he will be crucified, and the birds will eat from his head. The matter has been decreed about which you both inquire.” And he said to the one whom he knew would go free, “Mention me before your master.” But Shaitan made him forget the mention [to] his master, and Yaqub remained in prison several years.",
                    "One day the king of Egypt had an odd dream. He summoned his men and said, “Indeed, I have seen seven fat cows being eaten by seven [that were] lean, and seven green spikes [of grain] and others [that were] dry. O eminent ones, explain to me my vision, if you should interpret visions.” The cupbearer, who immediately remembered his companion in prison, informed the King of Yusuf and his impeccable dream interpretations. The King sent off his cupbearer to prison to meet with Yusuf and inquire about the peculiar dream.",
                    "Yusuf was overjoyed at the sight of his companion and knew that this was indeed the plan of Allah. He narrated to him, “You will plant for seven years consecutively; and what you harvest leave in its spikes, except a little from which you will eat. Then will come after that seven difficult [years] which will consume what you advanced [saved] for them, except a little from which you will store. Then will come after that a year in which the people will be given rain and in which they will press [olives and grapes].”",
                    "Amazed, the king ordered Yusuf to be presented before him. Yusuf, however, refused to leave prison until his innocence was proved. The king thus summoned the women relating to Yusuf’s incident. The women who had their hands cut, spoke of Yusuf’s innocence before the King, “Allah forbid! We know about him no evil.” ",
                    "The wife of Al-Azeez was trapped. She confessed to the King, “Now the truth has become evident. It was I who sought to seduce him, and indeed, he is truthful.”",
                    "Thus, Yusuf’s innocence was proven. Released from prison, Yusuf stood before the King to thank him for his generosity. The king who was greatly impressed by Yusuf’s honest mannerisms and his pleasant personality led him to being appointed as the storekeeper over the storehouses across his land.",
                    "Yusuf harvested and stored crops during the seven years of fertility. Then there approached the years of famine, that also reached the household of Yaqub in Canaan. Yaqub sent all his sons except Binyamin to Egypt to purchase provisions. Yusuf immediately recognized his brothers and provided for them, but kept his identity disguised. He casually inquired about their family. The brothers informed the storekeeper of their house back in Canaan and their father and brother back home. Yusuf informed them to bring their younger brother along next time, or they shall receive no further provisions. He also placed the money they had paid with their supplies as an incentive to return.",
                    "The brothers returned home and said, “O our father, measure has been denied to us, so send with us our brother [that] we will be given measure. And indeed, we will be his guardians.” Yaqub was enraged. How could he trust them when they had failed him terribly with Yusuf before? After some time, however, their needs pressed Yaqub to send Binyamin with them for more provisions. He took their solemn oath to safeguard him. When they reached Egypt, Yusuf drew Binyamin aside and whispered into his ear, “Indeed, I am your brother, so do not despair over what they used to do [to me].”",
                    "The following day, Yusuf filled his brothers’ bags with grain. He then secretly planted the King’s golden bowl in Binyamin’s bag.",
                    "On departing, the brothers were stopped by the King’s soldiers who were looking for the King’s missing cup. The bags of the brothers’ were searched and the missing cup was retrieved from the bag of the youngest brother, Binyamin. The soldiers cried, “O caravan, indeed you are thieves.” The brothers were shocked! The brothers immediately remembered their sick father back home, and their vow to safeguard Binyamin at all cost. They begged the soldiers to release their younger brother and take one of them instead but the soldiers refused. The eldest among the brothers said, “I will never leave this land until my father permits me or Allah decides for me.” So the rest of the brothers left Egypt leaving the eldest behind.",
                    "When Yaqub learnt of his youngest son’s predicament he wept and wept until he became blind. He resorted to prayer for comfort for he knew that only Allah could ease his pain. Soon, he instructed his sons to return to the King’s land and inquire about their brother.",
                    "The sons returned to Egypt once again. They met with Yusuf and pleaded that tragedy had befallen them. Yusuf then spoke to them in their native language, “Do you know what you did with Yusuf and his brother when you were ignorant?” It didn’t take long for the brothers to realise that this was indeed their long lost brother and began to tremble in fear. But Yusuf comforted them saying, “No reproach on you this day, may Allah forgive you.” He then said, “Take this, my shirt, and cast it over the face of my father; his eyesight will return.”",
                    "As instructed, the brothers cast Yusuf’s shirt over their father’s face and Allah miraculously restored his eyesight! They beseeched their father to seek Allah’s forgiveness for them. Together, they all set off to Egypt where Yusuf warmly welcomed them. Yusuf raised his father upon the throne and said, “O my father, this is the explanation of my vision of before. My Lord has made it reality. And He was certainly good to me when He took me out of prison and brought you [here] from bedouin life after Satan had induced [estrangement] between me and my brothers. Indeed, my Lord is Subtle in what He wills. Indeed, it is He who is the Knowing, the Wise.”Thus, Allah reunited father and son.",
                    "Lesson: Prophet Yusuf from his dream knew he was destined for greatness but it seemed at every turn of his life he was met with difficulties and adversity. He was betrayed by his brothers, sold as slave, and unjustly imprisoned. Yusuf could have chosen to be bitter and question Allah by saying, “I thought you had ordained for me greatness”. He could have easily complained and ask “why do these things keep happening to me”. But he knew better, he knew Allah had a plan for him and he had to just keep faith. Yusuf knew by just focusing on being the best he could, treating people right and with respect, doing more than what was requested that Allah would take care of him.",
                    "“There was certainly in their stories a lesson for those of understanding. Never was the Qur’an a narration invented, but a confirmation of what was before it and a detailed explanation of all things and guidance and mercy for a people who believe.” Surah Yusuf Ayah 111"
                ]
            },
            "Intro": "Prophet Yusuf (Joseph) had a dream that he was destined for greatness. Yet his life was filled with had adversity and difficulty. It seemed everything would not go his way, he was betrayed by his brothers, sold as slave, and unjustly imprisoned. Yusuf could have chosen to be bitter and question his fate by asking Allah, what happened to my dreamdestined for greatness? He could have easily complained “why do these things keep happening to me” as many of us would. But he knew better…"
        }
    },
    "9": {
        "Prophet Saleh": {
            "Full Story": {
                "Story Of Prophet Saleh": [
                    "Story Of Prophet Salih In Islam",
                    "Prophet Saleh, sometimes written as Salih, was a descendant of the great prophet Nuh (may peace be upon him). He was sent by Allah to the nation of Thamud who lived in Al Hijr, located in Arabia. The nation over a few generations had matured and became very powerful, wealthy and influential.",
                    "The Qur’an mentions how the society grew very proud of their accomplishments and began building huge castles, palaces, and other structures as status symbol of their power. This is mentioned in Surah Ash Shura ayat 128-129:",
                    "“Do you construct on every elevation a sign amusing yourselves? And take for yourselves palaces and fortresses that you may abide eternally?”",
                    "They were given a chance by Allah to turn back to Him especially knowing what had happened to the people of Ad for their disobedience. The Qur’an mentions the warning from Prophet Hud who said, “Will you not fear Allah?” (26:124). They denied these warnings as obsession with materialism took over. They turned away from the path of truth, the poor began worshiping the rich who proclaimed themselves as Gods.",
                    "Now, Prophet Saleh was a man from a very high standing in society. He built a reputation of respect and was wealthy himself. The People of Thamud held him in high regard for his wisdom and virtue and were prepared to appoint him as their leader. It was during this period that Allah bestowed Saleh with Prophethood.",
                    "Prophet Saleh admonished his people, “O my people, worship Allah; you have no deity other than Him. He has produced you from the earth and settled you in it. So ask forgiveness of Him and then repent to Him. Indeed, my Lord is near and responsive” (11:61).",
                    "Saleh continued to urge the people to obey him and fear and worship Allah. But they replied, “O Saleh, you were among us a man of promise before this. Do you forbid us to worship what our fathers worshipped?And indeed we are in disquieting doubt about that to which you invite us.”(11:62) However, few among the poor followed and entered the fold of Islam while the majority rebuked Saleh. Some called him a lunatic while others said he must be possessed.",
                    "As the days passed, the Thamud feared that Prophet Saleh’s followers would increase in number. In an attempt to put him off, they planned to ask Saleh for a miracle proving that he was indeed the messenger of Allah. They intended to make this miracle impossible to be brought up. So the main leaders of the Thamud sat down together and confronted Saleh. They pointed at a particularly enormous rock and demanded Saleh to bring out from it a she camel that was extremely tall, very woolly, attractive and ten months pregnant! They further stipulated that it should be able to produce milk for the entire town.",
                    "Saleh was desperate to bring his people to the path of Allah. So he pleaded with Allah to grant him what the people had asked for. And there came the day when Saleh gathered his people to witness the coming of the miracle. Allah ordered that very rock to split asunder and from it emerged a red, gigantic, ten month pregnant she-camel, much to the awe and amazement of the people. It was a clear evidence in their midst that a number of people declared their faith. However, the vast majority remained untouched and pursued their disbelief, stating this was nothing but pure magic.",
                    "(side note: Some narrations believe the camel did not have a miraculous birth or dispute that it came from a rock, the Qur’an simply states, “O my people, this is the she-camel of Allah – [she is] to you a sign. So let her feed upon Allah ‘s earth and do not touch her with harm, or you will be taken by an impending punishment.”)",
                    "The she-camel was indeed a living miracle that every passing day people converted to Islam. The disbelievers could not bear this. Eventually their hatred for Saleh was diverted towards the she-camel. Saleh feared that the disbelievers would conspire against the she-camel and warned them, “O my people! This she camel of Allah is a sign to you, leave her to feed on Allah’s earth, and touch her not with evil lest a near torment will seize you.” The Thamud initially allowed the she-camel to graze on their land and drink freely from the common well but this was short-lived.",
                    "It wasn’t long before Thamud became disgruntled, the believers found their faith increasing while the disbelievers’ hatred intensified to a degree where they began plotting to kill the she camel.",
                    "With the support of all the disbelievers in town, nine men set out aiming to kill the she-camel. They watched her closely. As she approached to drink from the well one of the men shot her in the leg, thereby hindering her from escape. The others immediately sprang forward and put a sword through her body, killing her.",
                    "The townspeople saw this as a clear victory and cheered loudly for the men. They went on to slaughter the she-camel and eat her meat. When Saleh heard of this he hurried to warn the people, but it was too late. The people mocked him saying, “O Saleh, bring us what you promise us, if you should be of the messengers.” Saleh replied, “Enjoy yourselves in your homes for three days. That is a promise that will not be denied.” (11:65)",
                    "The disbelievers taunted Saleh and asked him to hasten the punishment. Prophet Saleh said “O my people, why are you impatient for evil instead of good? Why do you not seek forgiveness of Allah that you may receive mercy?” The people paid no heed. They were only infuriated and began plotting to kill Prophet Saleh. The nine men gathered together and discussed, “Take a mutual oath by Allah that we will kill him by night, he and his family. Then we will say to his executor, ‘We did not witness the destruction of his family, and indeed, we are truthful.” (27:49)",
                    "Meanwhile Allah had a plan for the people of Thamud, “And they planned a plan, and We planned a plan, while they perceived not”(27:50) so heinstructed Saleh to gather his followers and leave town. The people were only too happy to be rid of him. They were unperturbed by Saleh’s warning. The Thamud possessed excellent craftsmanship that they had carved their houses out of the dense rock of the mountains. This made them feel secure. They believed their rock fortresses would protect them from all disasters.",
                    "Three days after Salih’s warning, thunderbolts filled the air, followed by severe earthquakes which destroyed the entire tribe and its homeland. The land was violently shaken, destroying all living creatures in it. There was one terrific cry which had hardly ended when the disbeliveers of Salih’s people were struck dead, one and all, at the same time. Neither their strong buildings nor their rock hewn homes could protect them.",
                    "The disbelievers of Thamud had no ally that day. They had incurred the wrath of Allah which caused them to be destroyed before they realised what was happening.",
                    "Meanwhile, Prophet Saleh and the believers were saved by Allah’s grace. He returned to Al Hijr one day to witness the destruction of his people and said with a heavy heart, “O my people, I had certainly conveyed to you the message of my Lord and advised you, but you do not like advisors.” Prophet Saleh then migrated to Palestine, where he lived until his death."
                ]
            },
            "Intro": "Prophet Saleh was a respected and wise man sent to help guide the nation of Thamud. At the time, the city grew very prosperous and began the love for short term materialistic pleasures. The Prophet sought to make sure the people knew the consequence of their actions. Read full story to find out what happened to the people of Thamud."
        }
    },
    "10": {
        "Prophet Sulaiman": {
            "Full Story": {
                "The Story of Prophet Sulaiman (PBUH)": [
                    "Sulaiman was the son of Prophet Dawud (David). Dawud was the wise King of Israel and a noble Prophet of Allah (SWT). Sulaiman learnt from his father’s vast knowledge and judgement and often joined his father during hearings. He was an observer and learned from him and occasionally contributed to the discussion.",
                    "One day Prophet Dawud called his 19 sons in front of the chiefs and academic scholars of his kingdom. He then put forth the following questions:",
                    "1. Which thing is closest (nearest) to man?2. Which is the farthest thing?3. Which two things are attached to each other?4. Which is the most awe-creating thing?5. Which two things remain unchanged?6. Which two things are always different?7. Which two things are opposed to each other?8. What is the action the result of which is good?9. What is that action the result of which is bad?",
                    "The sons of Prophet Dawud became flustered and couldn’t answer these questions. The youngest of the sons, Sulaiman stood up and gave the following answers:",
                    "1. The nearest things to a man is the hereafter (Life and Death – as one may die any moment);2. The farthest things is the time which has passed away (which is not to come again);3. The two things that are attached to each other is man’s body with the soul;4. The most awe-creating is the man’s body (dead) without soul;5. The two things which remain the same are the sky and the earth;6. The two things which are different are the day and night;7. The two things which are opposed to each other are life and death;8. The action – the end of which is good – is patience and forbearance at the time of anger;9. The action – the end of which is bad is haste at the time of anger.",
                    "Impressed by these answers Prophet Dawud appointed his son Sulaiman to take charge following his death. So, with the passing of time Sulaiman inherited the kingdom of Israel and was elected by Allah to continue his Prophethood. He beseeched his Lord for a kingdom that would occur to none after him. Allah granted Sulaiman his wish and bestowed upon him many miracles, like the ability to control the wind which he used to travel at incredible speeds; the jinns which were under his command and a copper mine with which he used to make weaponry. He was even blessed with the ability to communicate with animals. The Quran makes mention of this:",
                    "",
                    "Prophet Sulaiman and his battalion of men, jinns and birds, “came upon the valley of the ants, an ant said, “O ants, enter your dwellings that you not be crushed by Sulaiman and his soldiers while they perceive not.” So [Solomon] smiled, amused at her speech, and said, “My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And admit me by Your mercy into [the ranks of] Your righteous servants.” Surah Naml Ayat 18-19",
                    "In his mission as a Prophet of Allah, Sulaiman built a prominent place of worship—the Dome of the Rock in Jerusalem. From there Sulaiman and his followers made pilgrimage to Makkah. On completion of their Hajj, they travelled to Yemen where Sulaiman witnessed the Yemeni’s incredible water channeling mechanism. He desired to replicate this system in his own land, but knew that they had insufficient springs. Determined to find a way, Sulaiman set about looking for the Hoopoe bird, which had the ability to detect water underground. But the bird was nowhere in sight. Sulaiman who grew increasingly impatient exclaimed, “Why do I not see the Hoopoe bird– or is he among the absent? I will surely punish him with a severe torment, or slaughter him, unless he brings me a clear reason!",
                    "Before long, the Hoopoe returned to his master with great news. But the hoopoe stayed not long and said, “I have encompassed [in knowledge] that which you have not encompassed, and I have come to you from Sheba with certain news. Indeed, I found [there] a woman ruling them, and she has been given of all things, and she has a great throne. I found her and her people prostrating to the sun instead of Allah, and Satan has made their deeds pleasing to them and averted them from [His] way, so they are not guided, [And] so they do not prostrate to Allah, who brings forth what is hidden within the heavens and the earth and knows what you conceal and what you declare -Allah – there is no deity except Him, Lord of the Great Throne.”Surah Naml Ayat 22-26",
                    "Prophet Sulaiman said, “We will see whether you were truthful or were of the liars. Take this letter of mine and deliver it to them. Then leave them and see what [answer] they will return.”Surah Naml Ayat 27-28",
                    "The Hoopoe bird flew back to Bilkis’s palace and dropped Sulaiman’s letter before her. He soon hid and watched what happened. Having noticed the letter, Bilkis began reading it, “Verily! It is from Solomon. It reads: ‘In the Name of Allah, the Most Beneficent, the Most Merciful; be you not exalted against me, but come to me as Muslims.” ",
                    "Bilkis immediately summoned her chiefs and sought their advice. They replied, “We have great strength, and great ability for war, but it is for you to command; so think over what you will command.” Bilkis, however, was not in favour of war as they were unaware of the size of Sulaiman’s army. She answered, “Verily! Kings, when they enter a town, they despoil it, and make the most honourable amongst its people low.” She decided, as a token of friendship, to send Sulaiman some valuable gifts through her messengers, who could also bring back information about Sulaiman’s army.",
                    "Sulaiman immediately learnt of Bilkis’s response through the Hoopoe. He decided to display the might of his army to her messengers. When the messengers arrived, all of Sulaiman’s army complete with animals, such as lions and tigers, birds, men and jinn, gathered before them. Bilkis’s messengers were indeed stunned by the size and variety of Sulaiman’s battalion. His incomparable strength was eminent.",
                    "The messengers eagerly presented Bilkis’s gift to Sulaiman with a pledge of friendship. Sulaiman replied, “Will you help me in wealth? What Allah has given me is better than that which He has given you! Nay, you rejoice in your gift!” Sulaimanthen turned to the chief of her messengers and instructed: “Go back to them. We verily shall come to them with hosts that they cannot resist, and we shall drive them out from there in disgrace, and they will be abased.” Shocked, the messengers soon returned to their Queen and conveyed Sulaiman’s message together with an account of the magnificence of Sulaiman’s kingdom.",
                    "Bilkis decided to meet Sulaiman in person, together with her officials. On receiving this news, Sulaiman decided to show Bilkis and her officials the power of the miracles bestowed to him by Allah. He asked his army, “Which of you can bring me Bilkis’s throne before they come to me, surrendering themselves in obedience?” Ifrit, one of the powerful jinns, immediately responded to Prophet Sulaiman, “I will bring it to you before you rise from your place. And verily, I am indeed strong and trustworthy for such work.” (27:30)",
                    "But Sulaiman remained silent, awaiting a better offer. Another jinn with knowledge of the scriptures spoke up, “I will bring it to you before your glance returns to you.” And when [Solomon] saw it placed before him, he said, “This is from the favor of my Lord to test me whether I will be grateful or ungrateful. And whoever is grateful – his gratitude is only for [the benefit of] himself. And whoever is ungrateful – then indeed, my Lord is Free of need and Generous.”(27:40)",
                    "“I will bring it to you within the twinkling of an eye!” And in a split second the throne of Bilkis was brought from across 2,000 miles to Prophet Sulaiman. Sulaiman himself was amazed by the miracle Allah had given him and praised his Lord immensely. Sulaiman then instructed the jinn, “Disguise for her her throne; we will see whether she will be guided [to truth] or will be of those who is not guided.” (27:41)He then ordered the jinns to build a palace with floors made of thin but solid glass, underneath through which rivers flowed.",
                    "When Bilkis arrived, her throne immediately caught her attention. Having noticed Bilkis’s reaction to the throne, Sulaiman asked, “is your throne like this?” Bilkis was thoroughly confused. She wondered if her throne actually got here or if it was possible that someone replicated it. She replied cautiously, “it is as though it was the very same.” Sulaimanjudged her to be intelligent and diplomatic so he then invited her to his palace. When Bilkis was about to enter she mistook the glass floor for water and lifted her skirts. In the Quran it says, “she thought it was a body of water and uncovered her shins [to wade through]. He said, “Indeed, it is a palace [whose floor is] made smooth with glass.” She said, “My Lord, indeed I have wronged myself, and I submit with Solomon to Allah, Lord of the worlds.”(27:44)",
                    "Bilkis realized that Sulaiman’s kingdom was indeed unlike any palace she had seen before. She witnessed his wisdom and humility along with his mighty power and accepted him as the messenger of Allah. She repented and embraced Islam along with her nation.",
                    "Prophet Sulaiman’s Death",
                    "Prophet Sulaiman lived and reigned in glory. Much of his public work was performed by the jinns as a punishment for making people believe that jinns had knowledge of the unseen. Sulaiman taught his people that Allah alone had such knowledge. Even Prophet Sulaiman’s death was a lesson in this regard.",
                    "The future is not known neither by the jinns nor by the prophets, but by Allah alone.",
                    "Sulaiman was seated, holding his staff, while he oversee some jinns working in a mine. The jinns, who were terrified of Sulaiman, were heavily focused on the building when Allah decided to take Sulaiman’s life.",
                    "No one was aware of his death, until days later, a hungry ant began nibbling on his wooden staff. As it ate on, the staff broke and Prophet Sulaiman’s body that was leaning on it fell to the floor. People ran to their Prophet, and soon realized that he had died long ago. Thus everyone learned that had the jinns possessed the knowledge of the unseen, they wouldn’t have tormented themselves working hard, thinking Sulaiman was watching them. The life and death of Sulaiman is indeed full of miracles from which mankind can derive incredible lessons.",
                    "“And when We decreed for Solomon death, nothing indicated to the jinn his death except a creature of the earth eating his staff. But when he fell, it became clear to the jinn that if they had known the unseen, they would not have remained in humiliating punishment.” (34:14)",
                    ""
                ]
            },
            "Intro": "Prophet Sulaiman (Solomon) was the youngest son of Dawud (david) and the third king of the people of Israel. Allah bestowed many gifts to Sulaiman including the ability to speak with animals and rule over Jinn. He ruled justly and is often regarded as one of the greatest rulers."
        }
    },
    "11": {
        "Prophet Adam": {
            "Full Story": {
                "Story Of Prophet Adam (As) In Islam": [
                    "In the heavens, Allah (SWT) informed His angels that He had decided to place a vicegerent on earth who would reside there from generation to generation. The Angels were not too pleased with Allah’s (SWT) announcement as they were aware that the jinns who existed on earth previously had corrupted the land and caused ample bloodshed.",
                    " وَإِذۡ  قَالَ  رَبُّكَ  لِلۡمَلَـٰٓئِكَةِ  إِنِّي  جَاعِلٞ  فِي  ٱلۡأَرۡضِ  خَلِيفَةٗۖ  قَالُوٓاْ  أَتَجۡعَلُ  فِيهَا  مَن  يُفۡسِدُ  فِيهَا  وَيَسۡفِكُ  ٱلدِّمَآءَ  وَنَحۡنُ  نُسَبِّحُ  بِحَمۡدِكَ  وَنُقَدِّسُ  لَكَۖ  قَالَ  إِنِّيٓ  أَعۡلَمُ  مَا  لَا  تَعۡلَمُونَ",
                    "Wa iz qaala rabbuka lil malaaa’ikati innee jaa’ilun fil ardi khaleefatan qaalooo ataj’alu feehaa mai yufsidu feehaa wa yasfikud dimaaa’a wa nahnu nusabbihu bihamdika wa nuqaddisu laka qaala inneee a’lamu maa laa ta’lamoon",
                    "And [mention, O Muhammad], when your Lord said to the angels, “Indeed, I will make upon the earth a successive authority.” They said, “Will You place upon it one who causes corruption therein and sheds blood, while we declare Your praise and sanctify You?” Allah said, “Indeed, I know that which you do not know.”",
                    "- Qur'an 2:30",
                    "Creation of Adam (As) - The First Man:",
                    "Allah (SWT) moulded the first man using a handful of clay gathered from various parts of the earth and made him in His picture. Narrations state that due to the different types of clay that were used for the creation of the first man, the children of Adam (PBUH) are diverse in their complexions and other physical characteristics.",
                    "It is also reported Prophet Muhammad (PBUH) has said that Adam (PBUH) was created at a height of 30 meters. According to a Sahih Muslim hadith, Adam (PBUH) was created by Allah (SWT) after Asr on a Friday.",
                    "The first man remained a mere clay figure for a period of forty years. Each time the angels passed by the figure, they were overcome with fear. Iblis was the most fearful of the new creation. Consumed by a mixture of curiosity and envy, Iblis would strike the figure which would emit a sound similar to that of striking a clay pot.",
                    "Allah (SWT) stated in the Quran: \"He created humankind from sounding clay like pottery.\" (Surah Ar-Rahman 55:14)",
                    "Angels prostrate before Adam (as):",
                    "When it was finally time to breathe the soul into the first man, Allah (SWT) commanded the angels: “When I breathe My spirit into him prostrate before him.” [Surah As-Sad 38:72] The Almighty then breathed the soul into Adam (PBUH).",
                    "When the soul reached him, Adam (PBUH) sneezed saying: “Alhamdulillah [All praise belongs to God]!” Allah (SWT) then responded by saying: “May Allah have mercy upon you O’ Adam.” (Jami at-Tirmidhi 3367)",
                    "As commanded, the angels fell in prostration out of respect for the creation of Allah (SWT). However, Iblees, a jinn, who was also among the angels refrained from following Allah’s (SWT) command. (Surah Al-Hijr 15:30-32)",
                    "Allah (SWT) asked Iblees: “O Iblis! What is the matter with you that you did not join others in prostration?” (Surah Al-Hijr 15:32)",
                    "He arrogantly replied: “It is not for me to prostrate to a human You created from sounding clay moulded from black mud.” (Surah Al-Hijr 15:33) He strongly felt that he was a far superior creation to humankind who was made using mere clay, whilst he was made using fire.",
                    "Allah (SWT) was angered by Iblees’ response: “So get out! You are truly cursed.” (Surah Al-Hijr 15:34)",
                    "Iblees then appealed to Allah (SWT): “My Lord! Then delay my end until the Day of their resurrection. For allowing me to stray I will surely tempt them on earth and mislead them all together, except Your chosen servants among them.” (Surah Al-Hijr 15:36,39,40)",
                    "“You are of those allowed respite (until the Day of Judgment),” Allah (SWT) conceded adding: “This is the Way, binding on Me: you will certainly have no authority over My servants, except the deviant who follows you, and surely Hell is their destined place, all together. It has seven gates, to each a group of them is designated.” (Surah Al-Hijr 15: 37-8, 41-4)",
                    "Having just received the gift of life, Adam (PBUH) witnessed the exchange between his Creator and His creation and was overcome with a myriad of emotions. He felt deep love and admiration for Allah (SWT) who had granted him life and who had instructed His angels to prostrate before him. He was filled with awe at having witnessed Iblees’ disobedience towards Allah (SWT) and the Lord’s tolerance. Adam (PBUH) was also surprised at Iblees’ hatred towards Adam (PBUH) without having any knowledge about him. He realised that Iblees was a creature that was consumed by arrogance and wile and understood then that Iblees was his eternal enemy. He knew that Iblees was among the bad and the angels were among the good.",
                    "Allah (SWT) then instructed Adam (PBUH) to go to a gathering of angels, and greet them with: “As-salaamu alaikum (peace be upon you).”",
                    "Upon doing so, the angels replied to Adam (PBUH) with: “Wa-alaikas-salamu wa rahmatullah (May the peace and mercy of Allah be with you too).”",
                    "When Adam (PBUH) returned to his Creator, He said: “This is your greeting and the greeting of your children among each other.” (Jami at-Tirmidhi 3367)"
                ],
                "Adam (PBUH) learns the names of everything": [
                    "Allah (SWT) was keen on making Adam (PBUH) perceive his true identity, and the purpose of his existence, and granting him the knowledge of all things which was a gift that was bestowed to no other creation before. As the All-Knower states in the Quran, He taught Adam (PBUH) the names of everything. (Surah Al-Baqarah 2:31).",
                    "Allah (SWT) gave Adam (PBUH) the power to understand the nature of all creations and to assign each creation suitable names. He also instilled in Adam (PBUH) a love for knowledge and a strong desire to impart knowledge to his offspring. When His creation had learned all that he needed to learn, Allah (SWT) presented him before His angels.",
                    "“Tell Me the names of these, if what you say is true?”, Allah (SWT) asked the angels. (Surah Al-Baqarah 2:31]",
                    "“Glory be to You! We have no knowledge except what You have taught us. You are truly the All-Knowing, All-Wise,” the angels replied, admitting their inability to do so. (Surah Al-Baqarah 2:32)",
                    "Allah (SWT) then turned to Adam (PBUH), and instructed: “O’ Adam! Inform them of their names.” ",
                    "As commanded, Adam (PBUH) recited the names of everything, to the amazement of the angels.",
                    "“Did I not tell you that I know the secrets of the heavens and the earth, and I know what you reveal and what you conceal?” (Surah Al-Baqarah 2:33)",
                    "The angels then comprehended that Adam (PBUH) indeed had the knowledge of everything and that this was his noblest quality. Adam’s (PBUH) knowledge encompassed that of worldly knowledge, knowledge of the Creator, and His creations.",
                    "Adam (PBUH) was eager to share his knowledge, so he would approach the angels to discuss the way of things with them. However, as is the duty of the angels, they were busy attending to the Lord’s bidding. Hence, Adam (PBUH) felt lonely. Thus, Allah (SWT) decided to create a partner for him from his ribs.",
                    "The creation of Eve:",
                    "One day, as Adam (PBUH) awoke from his sleep, he found a human gazing intently at him with tender eyes. ",
                    "“Who are you?” he asked the creation. ",
                    "“A woman”, came the response.",
                    "“Why have you been created?” Adam (PBUH) asked. ",
                    "“So you can find tranquillity in me”, she responded. ",
                    "The angels were in awe of this new creature, so they asked Adam (PBUH), “What is her name, O’ Adam?”",
                    "He replied: “Eve.”",
                    "They then asked: “Why has she been named so?”",
                    "Adam (PBUH) responded: “Because she was created from something living.”",
                    "The forbidden tree:",
                    "Adam (PBUH) and Eve lived a life of complete freedom in paradise. Allah (SWT) allowed them to explore heaven and live as they pleased, but there was one exception. Allah (SWT) warned them against approaching a specific tree, failing which they would be deemed disbelievers. ",
                    "Allah (SWT) said in the Quran: “But come not near this tree or you both will be of the wrongdoers.” (Surah Al-Baqarah 2:35)",
                    "It was clear as undisturbed water that eating from the specific tree was off limits; but, before long, as it is human nature, Adam (PBUH) forgot Allah’s (SWT) command. His willpower weakened and his mind changed.",
                    "This was the opportune moment for Iblees to strike and show Allah (SWT) that humans were weaklings after all, and he, Iblees, was the superior being. He was resolute in his mission to lead humans astray from Allah’s (SWT) worship. ",
                    "He began his mission with mere whispers, through which he buried the seed of doubt in Adam’s (PBUH) mind. ",
                    "\"Shall I guide you to the tree of immortality and the eternal kingdom?\", Iblees asked the pair.",
                    "He also said: \"Your Lord did not forbid you this tree save you should become angels or become of the immortals.\" Swearing by Allah (SWT), Iblees added that he was among the sincerest well-wishers for both Adam (PBUH) and Eve.",
                    "So, the pair were coaxed into disobeying Allah (SWT).",
                    "Before he finished consuming the fruit of the forbidden tree, Adam (PBUH) was awash with a sense of shame, sadness, and pain. ",
                    "With the single act of disobedience, both Adam (PBUH) and Even became aware of their nudity and they frantically began to pluck leaves to cover themselves. ",
                    "Condemned to earth:",
                    "Adam (PBUH) and Eve were summoned before their Lord who asked: \"Did I not forbid you from that tree and tell you that Satan is to you a clear enemy?\" (Surah Al-A'raf ayah 22)",
                    "The pair was forlorn and consumed by guilt. They pleaded: “Our Lord! We have wronged ourselves. If You forgive us not and bestow not upon us Your Mercy, we shall certainly be of the losers.” (Surah Al-A'raf ayah 23)",
                    "It was indeed too late; Allah (SWT) had already planned His sentence for the two humans. He expelled Adam (PBUH), Eve, and Iblees to earth where He destined humans to be enemies with Iblees. He said: “Descend as enemies to each other. You will find in the earth a residence and provision for your appointed stay. There you will live, there you will die, and from there you will be resurrected.” (Surah Al-A'raf ayah 24)",
                    "Life on earth:",
                    "Adam (PBUH) and Eve led a life of hardship on earth. Food did not come easy unlike in their previous abode, heaven; they were compelled to work hard in order to sustain themselves on earth. He was burdened with searching for food, clothing, and shelter for his wife and children. He was also challenged with fighting wild animals who were wandering about in search of a full meal.",
                    "However, above all, the biggest burden that Adam (PBUH) had to constantly battle was the whispers of Satan. Satan stuck to his word and continued to torment the humans with his evil whispers. Nonetheless, he remained resolute and proved himself to his Lord. It was vital that he thrive on earth and bring forth offspring who would remain steadfast in their assigned duty—to worship Allah (SWT).",
                    "Adam's (as) children:",
                    "The lonesome existence of Adam (PBUH) and Eve on earth soon changed. They were first blessed with a set of twins, Cain and his sister, and were also blessed with twins the second time, when they welcomed Abel and his sister. ",
                    "The children grew up to be young healthy adults, while the family enjoyed a humble life with Allah’s (SWT) ample blessings. Cain cultivated the land, whereas Abel reared the cattle.",
                    "Part of Adam (PBUH) and Eve’s expulsion to earth was with the aim of populating the land with dutiful humans who worshipped the Almighty. Thus, when the children reached marriageable age, Allah (SWT) revealed to Adam (PBUH) to marry each son to the other’s twin sister. There was after all no other family in existence besides Adam’s (PBUH) family. ",
                    "Adam (PBUH) did as Allah (SWT) bid and instructed his children that they were to marry each other’s twin. While Abel was ready to follow Allah’s (SWT) command, Cain was not too pleased. Whilst Abel was known for his intelligence, obedience, and his readiness to obey the will of Allah (SWT), Cain was arrogant, selfish, and disobedient to his Lord.",
                    "Cain was unhappy with the command as, according to him, Abel’s twin sister was not as pleasing to the eye as his own. He defied Allah’s (SWT) command as he refused to accept his father’s advice.",
                    "Adam (PBUH) was in a quandary. He was uncertain as to what needed to be done, so he called out to Allah (SWT) seeking His assistance. Thus, Allah (SWT) commanded that each son offer a sacrifice in the name of Allah (SWT) and He would favour the son whose sacrifice he accepted.",
                    "While Abel offered his best lamb to Allah (SWT), Cain offered his worst harvest. Therefore, naturally, Allah (SWT) accepted Abel’s offer, whilst Cain’s disobedience towards Allah’s (SWT) command and his insincerity in his offering caused his plea to be rejected. ",
                    "Enraged, Cain threatened to kill his brother. \"I will kill you!\" he said. (Surah Al-Ma'idah 5:27)",
                    "\"Allah only accepts the offering of the sincerely devout. If you raise your hand to kill me, I will not raise mine to kill you, because I fear Allah—the Lord of all worlds. I want to let you bear your sin against me along with your other sins, then you will be one of those destined to the Fire. And that is the reward of the wrongdoers,\" Abel responded with sincerity. (Surah Al-Ma'idah 5:27-29)",
                    "Abel was not fazed by the threats of his brother, but he made certain that he reminded his brother to not stray from the path of Allah (SWT).",
                    "The first murder:",
                    "The hatred that Cain had towards his brother outweighed all other forms of familial bonds and emotions. The fear of Allah’s (SWT) punishment also failed to arise in his mind.",
                    "As expected, Cain did not heed the warnings of his brother. He struck Abel with a stone and killed him in an instant. This was the first death and murder in the history of humankind. ",
                    "As time passed, and Abel did not return home, Adam (PBUH) began worrying. He began to look for his son but found no trace. When he inquired Cain about Abel’s whereabouts, Cain stated that he was not his brother’s keeper nor protector.",
                    "It didn’t take Adam (PBUH) long to realise that his beloved Abel was no more. Adam (PBUH) was consumed with grief. ",
                    "Having murdered his brother, Cain was unsure what needed to be done with Abel’s body. He wandered all over, pondering how he could hide the body from his family. ",
                    "As his anger slowly subsided, Cain began to feel remorse for his brother and was overcome with guilt.",
                    "In a bid to retain the dignity of the deceased, Allah (SWT) caused Cain to witness the death and burial of two crows. ",
                    "Cain watched as the crow used its claws and beak to dig a hole in the earth, push the carcass into it and cover it with sand. Caine followed suit and buried his brother, Abel. (Surah Al-Ma'idah 5:31)",
                    "Adam (PBUH) lost both his sons and was overwhelmed with grief. Abel was murdered while Cain was under the spell of the devil. He made dua for his son and went on to carry out the duties expected of him. He continued to warn his children and grandchildren of Iblees and constantly reminded them to worship Allah (SWT) and not be among those who disobeyed him.",
                    "Adam (as) Death:",
                    "One day, Adam (PBUH) who was gravely ill said to his children: “O my children, indeed I feel an appetite for the fruits of Paradise.”",
                    "Intent on fulfilling their father’s request, the children set out to gather the fruits of paradise. On their way, they met with some angels who carried with them Adam’s (PBUH) shroud and other materials required for the preparation of a body for burial. ",
                    "The angels instructed the children of Adam to hasten home as their father was about to meet his end soon. So the children returned home with the angels. ",
                    "Upon arrival, the angels took Adam’s (PBUH) soul. They prepared him for the funeral, wrapped him in the shroud, dug his grave, and laid him in it. They told the children of Adam: “O Children of Adam, this is your tradition at the time of death.”",
                    "Prior to Adam’s (PBUH) death, he reassured his offspring that Allah (SWT) would not abandon them and continue to watch over and guide them. He also informed them that Allah (SWT) would continue to send down Prophets as a guide for mankind. ",
                    "Following the death of Adam (PBUH), his son Seth (PBUH) succeeded him. He too was made a Prophet and was tasked with the duty of guiding people to the path of Allah (SWT)."
                ]
            },
            "Intro": "The story of the first man, Prophet Adam (as). His life is filled with many lessons we can learn from. It covers topics such as creation, temptation, and pride, as well as touching on our purpose here on earth and the love and mercy of Allah سُبْحَٰنَهُۥ وَتَعَٰلَىٰ."
        }
    }
}