{
    "How to Perform Wudu’": {
        "THE FOLLOWING STEPS MUST BE OBSERVED IN ORDER (TARTEEB).": {
            "1": {
                "Step 1 - Bismillah": "BEFORE WUDU’: Intention of making wudu’ should  be done in the heart, then say: Bismillah (In the name of Allah) ِللها  ِم ْسِب"
            },
            "2": {
                "Step 2 - Hands": "Repeat 3 Times Completely wash the  hands, including the  wrists and between the  fingers"
            },
            "3": {
                "Step 3 - Mouth": "Repeat 3 Times Rinse the mouth. Using the right hand  put a small amount of water into the  mouth, swirl around, then expel."
            },
            "4": {
                "Step 4 - Nose": "Repeat 3 Times Sniff water into the nostrils as far  as possible with the right hand, and  then sniff it out with left hand."
            },
            "5": {
                "Step 5 - Face": "Repeat 3 Times Wash the face from forehead  to chin, left earlobe to the right  earlobe making sure the whole  face is washed."
            },
            "6": {
                "Step 6 - Arms": "Repeat 3 Times Wash the two arms up to and including  the elbows, hand and between the  fingers. Begin with the right arm."
            },
            "9": {
                "Step 9 – Feet": "BEFORE WUDU’: Intention of making wudu’ should  be done in the heart, then say: Bismillah (In the name of Allah)"
            },
            "10": {
                "Step 10 - Closing Du’a/Invocation": "AFTER WUDU’: Say: Ash-hadu anllaa ilaaha illallaah wa ash-hadu  anna Muhammadan ‘abduhu wa rasooluh (I bear witness that there is no God worthy of worship  except Allah. And I bear witness that Muhammad is His  slave and Messenger.) ُلو س ر و هُدْب"
            },
            "7": {
                "Step 7 - Head": [
                    "Wipe the head with wet fingers ",
                    "starting at the fringe to the back ",
                    "hairline and back the same way all ",
                    "in one movement. "
                ]
            },
            "8": {
                "Step 8 – Ears": [
                    "Simultaneously wipe the insides of ",
                    "both ears with index finger, and the ",
                    "back of the ears with the thumbs "
                ]
            }
        }
    }
}