{
    "id": 106,
    "name_simple": "Quraysh",
    "revelation_place": "makkah",
    "revelation_order": 29,
    "bismillah_pre": true,
    "verses_count": 4,
    "short_text": "The Surah has been titled after the word Quraish in the very first verse.",
    "text": [
        "The Surah has been titled after the word Quraish in the very first verse.",
        "Period of Revelation",
        "Although Dahhak and Kalbi regard Surah Quraysh as a Madani Surah, a great majority of the commentators are agreed that it is Makki, and a manifest evidence of this are the words Rabba hadh-al-Bait (Lord of this House) in this Surah itself. Had it been revealed at Madinah, the words \"this House\" for the Ka'bah could not be relevant. Moreover, its subject matter so closely relates to that of Surah Al-Fil that probably it was revealed immediately after it, without any other Surah intervening between them. On this basis exactly, some of the earliest scholars regard the two Surahs as one entity. This view is strengthened by the traditions which say that in the Quran copy belonging to Hadrat Ubayy bin Ka'b these two were written as one Surah, i.e. without the insertion of the Bismillah between them. Furthermore, Hadrat Umar had once recited the two Surahs as one in the Prayer. However, this view is not acceptable because in the Quran copy which Hadrat Uthman (may Allah bless him) had got written down officially by the cooperation of a large number of the Companions and sent to the centers of Islamic lands, the Bismillah was written between these two Surahs, and since then these two have been written as separate Surahs in all the copies of the Quran everywhere in the world. Moreover, the style of the two Surahs is so different that they manifestly appear as two separate Surahs.",
        "Historical Background",
        "To understand the Surah well it is essential that one should keep the historical background relevant to the contents of this Surah and of Surah Al-Fil in view.",
        "The tribe of Quraish was scattered throughout Hijaz until the time of Qusayy bin Kilab, the ancestor of the Holy Prophet (upon whom be Allah's peace). First of all, Qusayy gathered his tribe in Makkah and this tribe was able to gain authority over the Ka'bah. On that basis Qusayy was called mujammi (uniter, assembler) by his people. This man by his sagacity and wisdom founded a city state in Makkah and made excellent arrangements for the welfare of the pilgrims coming from all over Arabia, with the result that the Quraish were able to gain great influence among the Arabian tribes and lands. After Qusayy, the offices of the state of Makkah were divided between his sons, Abdi Manaf and Abd ad-Dar, but of the two Abdi Manaf gained greater fame even during his father's lifetime and was held in high esteem throughout Arabia. Abdi Manaf had four sons: Hashim, Abdi Shams, Al-Muttalib, and Naufal. Of these, Hashim, father of Abdul Muttalib and grandfather of the Holy Prophet, first conceived the idea to take part in the trade that passed between the eastern countries and Syria and Egypt through Arabia, and also to purchase the necessities of life for the Arabians so that the tribes living by the trade route bought these from them and the merchants living in the interior of the country were attracted to the market of Makkah. This was the time when the Sasanian kingdom of Iran had captured the international trade that was carried out between the northern lands and the eastern countries and Byzantine empire through the Persian Gulf. This had boosted up the trade activity on the trade route leading from southern Arabia to Syria and Egypt along the Red Sea coast. As against the other Arabian caravans, the Quraish had the advantage that the tribes on the route held them in high esteem on account of them being keepers of the Ka'bah. The tribes stood indebted to them for the great generosity with which the Quraish treated them in the Hajj season. That is why the Quraish felt no fear that their caravans would be robbed or harmed anywhere on the way. The tribes on the way did not even charge them the heavy transit taxes that they demanded from the other caravans. Hashim taking advantage of this, prepared the trade scheme and made his three brothers partners in it. Thus, Hashim obtained trade privileges from the Ghassanide king of Syria, Abdi Shams from the Negus, Al-Muttalib from the Yamanite nobles and Naufal from the governments of Iraq and Iran, and their trade began to flourish. That is how the four brothers became famous as traders and began to be called ashab al-ilaf (generators of love and affection) on account of their friendly relations with the tribes and states of the surrounding lands.",
        "Because of their business relations with Syria, Egypt, Iraq, Iran, Yaman and Abyssinia, the Quraish came across opportunities and their direct contact with the culture and civilization of different countries greatly enhanced the level of their knowledge and wisdom such that no tribe in Arabia could match and equal them. In regards to wealth and worldly goods, they became the most affluent tribe, and Makkah became the most important commercial center of the Arabian peninsula. Another great advantage that accrued from these international relations was that they brought from Iraq, tile script which later was used for writing down the Quran. No other Arabian tribe could boast of so many literate people as the Quraish could. For these very reasons the Holy Prophet (upon whom be peace) said: \"Quraish are the leaders of men.\" (Musnad Ahmad: Marwiyat Amr bin al As). And according to a tradition from Hadrat Ali in Baihaqi, the Holy Prophet said: \"First the leadership of the Arabians was in the hands of the people of Himyar, then Allah withdrew it from them and gave it to Quraish.\"",
        "The Quraish were thus prospering and flourishing when the event of Abrahah's invasion of Makkah took place. Had Abrahah at that time succeeded in taking this holy City and destroying the Ka'bah, the glory and renown of not only the Quraish but of the Ka'bah itself, would have faded away, the belief of the pre-Islamic Arabia that the House indeed was Allah's House would have been shattered, and the high esteem in which Quraish were held for being keepers of the House throughout the country would have been tarnished. Then, after the Abyssinian advance to Makkah, the Byzantium also would have taken the initiative to gain control over the trade route between Syria and Makkah and the Quraish would have been reduced to a plight worse than that in which they were involved before Qusayy bin Kilab. But when Allah showed this manifestation of His power that the swarms of birds destroyed 60,000 Abyssinian troops brought by Abrahah by pelting them with stones, and from Makkah to Yaman they went on falling and dying by the wayside, the faith of the Arabs that the Ka'bah indeed was Allah's House increased manifold, and the glory and renown of Quraish too was enhanced considerably throughout the country. Now the Arabs were convinced that they were under Allah's special favor; therefore, they visited every part of Arabia fearlessly and passed through every land with their trade caravans unharmed. No one could dare touch them with an evil intention. Let alone touching the Quraysh, even if they had a non-Quraishite under their protection, he too was allowed to pass unharmed.",
        "Theme and Substance",
        "As all this was well known in the time of the Holy Prophet's appointment to Prophethood, there was no need to mention it in the Surah. That is why in the four brief sentences of this Surah, Quraish were simply asked to consider: \"When you yourselves acknowledge this House (i e. the Ka'bah) to be Allah's House, and not of the idols, and when you fully well know that it is Allah alone Who has granted you peace by virtue of this House, made your trade and commerce flourish and saving you from destitution favored you with prosperity, you should then worship and serve Him alone.\""
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that admonishes the first recipients of the Quran, the Meccan tribe of Quraysh, to give thanks to the One God alone who had long bequeathed to them, in their desert surroundings, abundant provision and security. It takes its name from verse 1, which mentions the Quraysh, the tribe to which the Prophet Muḥammad belonged.The surah is also known as: Koraish, The Quraish, The Quraish (Custodians of the Ka’ba), The Tribe of Quraysh.",
    "name_translation": "Quraysh",
    "name_complex": "Quraysh",
    "surah_name_ar": "قريش",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 106:1": "(Perëndia e zhduku ushtrinë e elefantëve) për t’i qetësuar Kurejshët,",
                            "verse 106:2": "t’i qetësojë ata në udhëtimin që bëjnë dimër e verë,",
                            "verse 106:3": "le të adhurojnë pra Zotin e kësaj shtëpie (Qabes),",
                            "verse 106:4": "i cili i ushqen (ngop) ata nga uria dhe i siguroi nga frika."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "(Ya Peyğəmbər! Qüreyşlilərə de ki) Qüreyşin ülfəti (dostluğu və ya Allahın onlar üçün səfəri asanlaşdırması) xatirinə,",
                            "verse 106:2": "Onlara qış və yay səfərini müyəssər edilməsi (qışda Yəməndə, yayda Şamda istirahət və ticarət edə bilmələri) xatirinə.",
                            "verse 106:3": "Bu evin Rəbbinə (Kə'bənin sahibi Allaha) ibadət etsinlər!",
                            "verse 106:4": "O Allah ki, onları aclıqdan qurtarıb yemək verdi və onlara qorxudan (fil sahiblərinin təhlükəsindən) sonra əmin-amanlıq bəxş etdi."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Zbog navike Kurejšija,",
                            "verse 106:2": "navike njihove da zimi i ljeti putuju,",
                            "verse 106:3": "neka se oni Gospodaru hrama ovoga klanjaju,",
                            "verse 106:4": "koji ih gladne hrani i od straha brani."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "কোরাইশের আসক্তির কারণে,",
                            "verse 106:2": "আসক্তির কারণে তাদের শীত ও গ্রীষ্মকালীন সফরের।",
                            "verse 106:3": "অতএব তারা যেন এবাদত করে এই ঘরের পালনকর্তার",
                            "verse 106:4": "যিনি তাদেরকে ক্ষুধায় আহার দিয়েছেন এবং যুদ্ধভীতি থেকে তাদেরকে নিরাপদ করেছেন।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 106:1": "Заради обичая на Курайш,",
                            "verse 106:2": "техния обичай да пътуват и зиме, и лете,",
                            "verse 106:3": "нека служат на Господа на този Дом,",
                            "verse 106:4": "който им даде храна срещу глада и сигурност срещу страха!"
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "因為保護古來氏 ,",
                            "verse 106:2": "因為在冬季和夏季的旅行中保護他們 ,",
                            "verse 106:3": "故教他們崇敬這天房的主 ,",
                            "verse 106:4": "他曾為飢荒而賑濟他們 ,曾為恐怖而保祐他們。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Pro soudržnost Kurajšovců,",
                            "verse 106:2": "pro soudržnost jejich, když připravuji zimní a letní karavanu,",
                            "verse 106:3": "nechť slouží chrámu tohoto Pánu,",
                            "verse 106:4": "jenž nasytil je a ochránil před hladem"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Ter bescherming van de Qoraishieten,",
                            "verse 106:2": "Ter bescherming op hun zomer- en winterreis.",
                            "verse 106:3": "Laten zij derhalve de Heer van dit Huis aanbidden.",
                            "verse 106:4": "Die hen van voedsel tegen honger heeft voorzien en van vrees bevrijd."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 106:1": "For the taming of Qureysh.",
                            "verse 106:2": "For their taming (We cause) the caravans to set forth in winter and summer.",
                            "verse 106:3": "So let them worship the Lord of this House,",
                            "verse 106:4": "Who hath fed them against hunger and hath made them safe from fear."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 106:1": "For the covenants (of security and safeguard enjoyed) by the Quraish,",
                            "verse 106:2": "Their covenants (covering) journeys by winter and summer,-",
                            "verse 106:3": "Let them adore the Lord of this House,",
                            "verse 106:4": "Who provides them with food against hunger, and with security against fear (of danger)."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 106:1": "For the composing of Koraish,",
                            "verse 106:2": "their composing for the winter and summer caravan!",
                            "verse 106:3": "So let them serve the Lord of this House",
                            "verse 106:4": "who has fed them against hunger and secured them from fear."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 106:1": "SO THAT the Quraysh might remain secure,",
                            "verse 106:2": "secure in their winter and summer journeys.",
                            "verse 106:3": "Let them, therefore, worship the Sustainer of this Temple,",
                            "verse 106:4": "who has given them food against hunger, and made them safe from danger."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 106:1": "For the uniting of the Qoraish. [UM]That the Quraish might be united.",
                            "verse 106:2": "The winter caravan, the summer caravan. [UM]United for the caravans of winter and summer.",
                            "verse 106:3": "So worship they the lord of this house. [UM]So let them worship the Lord of this house.",
                            "verse 106:4": "Who hath fed them against hunger and hath shielded them from fear. [UM]Who hath fed them against hunger and shielded them from fear."
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 106:1": "Because of the familiarity of the Quraish,",
                            "verse 106:2": "that is, their familiarity with the trips of winter and summer,",
                            "verse 106:3": "they must worship the Lord of this House,",
                            "verse 106:4": "who gave them food against hunger, and gave them security against fear."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 106:1": "[In gratitude] for the security of Quraysh,",
                            "verse 106:2": "their security for the journey of winter and of summer,",
                            "verse 106:3": "let them worship the Lord of this House,",
                            "verse 106:4": "Who has fed them against hunger and made them secure from fear."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 106:1": "To awake drive amongst the Quraysh,",
                            "verse 106:2": "They were acclimatized to the summer and winter (commercial) trips.",
                            "verse 106:3": "So they should worship the Lord of this (Sacred) House (Ka‘ba, to give Him thanks),",
                            "verse 106:4": "Who has fed them in hunger (i.e., provided them sustenance in starving conditions) and secured them from fear (of foes i.e., blessed them with secure and peaceful life)."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 106:1": "A l'union des Quraïchites,",
                            "verse 106:2": "à leur union pour la caravane de l'hiver et celle de l'été !",
                            "verse 106:3": "Qu'ils adorent donc le Seigneur de cette Maison,",
                            "verse 106:4": "qui les a nourris et sauvés de la famine, et qui les a délivrés de la peur."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 106:1": "A cause du pacte des Qoraïsh ,",
                            "verse 106:2": "De leur pacte [concernant] les voyages d’hiver et d’été .",
                            "verse 106:3": "Qu’ils adorent donc le Seigneur de cette Maison (la Kaaba).",
                            "verse 106:4": "qui les a nourris contre la faim et rassurés de la crainte !"
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Wegen der Vorliebe der Quraisch,",
                            "verse 106:2": "Ihrer Vorliebe für Reisen im Winter und Sommer,",
                            "verse 106:3": "Sollten sie den Herrn dieses Hauses verehren,",
                            "verse 106:4": "Der sie gespeist hat gegen Hunger und sie sicher gemacht vor Furcht."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "pw¡fd d+qjS’k dks tkM+s vkSj xehZ ds lQ+j ls ekuwl dj fn;k gS",
                            "verse 106:2": "rks mudks ekuwl dj nsus dh otg ls",
                            "verse 106:3": "bl ?kj ¼dkck½ ds ekfyd dh bcknr djuh pkfg,",
                            "verse 106:4": "ftlus mudks Hkw[k esa [kkuk fn;k vkSj mudks [kkSQ+ ls veu vrk fd;k"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Karena kebiasaan orang-orang Quraisy,",
                            "verse 106:2": "(yaitu) kebiasaan mereka bepergian pada musim dingin dan musim panas.",
                            "verse 106:3": "Maka hendaklah mereka menyembah Tuhan Pemilik rumah ini (Ka’bah).",
                            "verse 106:4": "Yang telah memberi makanan kepada mereka untuk menghilangkan lapar dan mengamankan mereka dari ketakutan."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Per il patto dei Coreisciti ,",
                            "verse 106:2": "per il loro patto delle carovane invernali ed estive .",
                            "verse 106:3": "Adorino dunque il Signore di questa Casa ,",
                            "verse 106:4": "Colui che li ha preservati dalla fame e li ha messi al riparo da [ogni] timore."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "クライシュ族の保護のため，",
                            "verse 106:2": "冬と夏のかれらの隊商の保護のため，（そのアッラーの御恵みのために）",
                            "verse 106:3": "かれらに，この聖殿の主に仕えさせよ。",
                            "verse 106:4": "飢えに際しては，かれらに食物を与え，また恐れに際しては，それを除き心を安らかにして下さる御方に。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "꾸레이쉬 족의 보호를 위하여",
                            "verse 106:2": "대상으로 하여금 겨울과 여름에 안전하게 여행케 하였노라",
                            "verse 106:3": "그러므로 이 집의 주님을 그 들로 하여금 경배토록 하라",
                            "verse 106:4": "그분은 그들을 기아로부터 배불려 주셨고 공포로부터 안전케 하여 주셨노라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "له‌به‌ر ئه‌وه‌ی قوڕه‌یش هۆگر بووه‌و...",
                            "verse 106:2": "خوی گرتووه به کاروانی زستانه‌ی (یه‌مه‌ن)و کاروانی هاوینه‌ی (شام) بۆ بازرگانی و (دابین کردنی بژێوی).",
                            "verse 106:3": "که‌واته با په‌روه‌ردگارو خاوه‌نی ئه‌م ماڵه پیرۆزه (که‌عبه‌) بپه‌رستن.",
                            "verse 106:4": "ئه‌و زاته‌ی له‌برسێتی ڕزگاری کردن و خۆراکی پێبه‌خشین و له ترس و بیمی (جه‌رده و ڕێگران) پاڕاستوونی و ئاسایشی بۆ دابین کردوون."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Kerana kebiasaan aman tenteram kaum Quraisy (penduduk Mekah)",
                            "verse 106:2": "(laitu) kebiasaan aman tenteram perjalanan mereka (menjalankan perniagaan) pada musim sejuk (ke negeri Yaman) dan pada musim panas (ke negeri Syam),",
                            "verse 106:3": "Maka hendaklah mereka menyembah Tuhan yang menguasai rumah (Kaabah) ini,",
                            "verse 106:4": "Tuhan yang memberi mereka penghidupan, menyelamatkan mereka dari kelaparan, dan mengamankan mereka dari ketakutan."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "(كيفر لشكر فيل‏سواران) بخاطر اين بود كه قريش (به اين سرزمين مقدس) الفت گيرند (و زمينه ظهور پيامبر فراهم شود)!",
                            "verse 106:2": "الفت آنها در سفرهاى زمستانه و تابستانه (و بخاطر اين الفت به آن بازگردند)!",
                            "verse 106:3": "پس (بشكرانه اين نعمت بزرگ) بايد پروردگار اين خانه را عبادت كنند،",
                            "verse 106:4": "همان كس كه آنها را از گرسنگى نجات داد و از ترس و ناامنى ايمن ساخت"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Pelo convênio dos coraixitas,",
                            "verse 106:2": "O convênio das viagens de inverno e de verão!",
                            "verse 106:3": "Que adorem o Senhor desta Casa,",
                            "verse 106:4": "Que os provê contra a fome e os salvaguarda do temor!"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 106:1": "Pentru obiceiul [neamului] Qurayș,",
                            "verse 106:2": "Obiceiul lor pentru cãlãtoria de iarnã și cea de varã,",
                            "verse 106:3": "Sã-L adore ei pe Stãpânul acestei Case,",
                            "verse 106:4": "Care-i hrãnește, pãzindu-i de foame și-i ferește pe ei de spaimã!"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 106:1": "Pentru învoiala quraişiţilor,",
                            "verse 106:2": "învoiala lor de unire la caravana de iarnă şi de vară,",
                            "verse 106:3": "să se închine Domnului acestui Lăcaş,",
                            "verse 106:4": "căci El, la foame, i-a hrănit; căci El, la teamă, i-a liniştit!"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Для единенья корейшитов,",
                            "verse 106:2": "Для их союза в дальних переходахлетом и зимой —",
                            "verse 106:3": "Пусть чтят Владыку этого СвятогоДома,",
                            "verse 106:4": "Кто дал им пищу, и от голода сберег,И от тревог освободил, от страха."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Por el pacto de los coraixíes,",
                            "verse 106:2": "pacto relativo a la caravana de invierno y la de verano,",
                            "verse 106:3": "¡que sirvan, pues, al Señor de esta Casa,",
                            "verse 106:4": "que les ha alimentado contra el hambre y dado seguridad frente al temor!"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "குறைஷிகளுக்கு விருப்பம் உண்டாக்கி,",
                            "verse 106:2": "மாரி காலத்துடையவும் கோடைக்காலத்துடையவும் பிரயாணத்தில் அவர்களுக்கு மன விருப்பத்தை உண்டாக்கியமைக்காக-",
                            "verse 106:3": "இவ்வீட்டின் (கஅபாவின்) இறைவனை அவர்கள் வணங்குவார்களாக.",
                            "verse 106:4": "அவனே, அவர்களுக்கு பசிக்கு உணவளித்தான்; மேலும் அவர்களுக்கு அச்சத்திலிருந்தும் அபயமளித்தான்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "เพื่อให้ความคุ้นเคยแก่ชาวกุเรช",
                            "verse 106:2": "เพื่อให้ความคุ้นเคยแก่พวกเขา ในการเดินทางในฤดูหนาว (ไปเยเมน) และฤดูร้อน (ไปชาม)",
                            "verse 106:3": "ดังนั้น จงให้พวกเขาเคารพภักดีพระเจ้า แห่งบ้านหลังนี้เถิด (คืออัลกะอฺบะฮ์)",
                            "verse 106:4": "ผู้ทรงให้อาหารแก่พวกเขาให้พ้นจากความหิว และทรงให้ความปลอดภัยแก่พวกเขา ให้พ้นจากความหวาดกลัว"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Kureyş'e kolaylaştırıldığı,",
                            "verse 106:2": "Evet, kış ve yaz seyahatleri onlara kolaylaştırıldığı için ,",
                            "verse 106:3": "Onlar, şu evin Rabbine kulluk etsinler,ki,",
                            "verse 106:4": "Kendilerini açlıktan doyuran ve her çeşit korkudan emin kıldı."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 106:1": "Қурайшнинг лозим тутиши қандай яхши!",
                            "verse 106:2": "Уларнинг қиш ва ёз сафарларини ўзларига лозим тутишлари қандай яхши!",
                            "verse 106:3": "Бас, улар мана шу Байтнинг Роббисига ибодат қилсинлар!",
                            "verse 106:4": "У зот уларини очликдан тўқ қилган, хавфдан омон қилгандир."
                        }
                    }
                }
            }
        }
    }
}