{
    "id": 112,
    "name_simple": "Al-Ikhlas",
    "revelation_place": "makkah",
    "revelation_order": 22,
    "bismillah_pre": true,
    "verses_count": 4,
    "short_text": "Al-Ikhlas is not merely the name of this Surah but also the title of its contents, for it deals exclusively with Tauhid. The other Surahs of the Quran generally have been designated after a word occurring in them, but in this Surah the word Ikhlas has occurred nowhere. It has been given this name in view of its meaning and subject matter. Whoever understands it and believes in its teaching, will get rid of shirk (polytheism) completely.",
    "text": [
        "\n",
        "Al-Ikhlas is not merely the name of this Surah but also the title of its contents, for it deals exclusively with Tauhid. The other Surahs of the Quran generally have been designated after a word occurring in them, but in this Surah the word Ikhlas has occurred nowhere. It has been given this name in view of its meaning and subject matter. Whoever understands it and believes in its teaching, will get rid of shirk (polytheism) completely.",
        "\n",
        "Period of Revelation",
        "\n",
        "Whether it is a Makki or a Madani Surah is disputed, and the difference of opinion has been caused by the traditions which have been related concerning the occasion of its revelation. We give them below ad seriatim:",
        "\n",
        "\n\nHadrat Abdullah bin Masud has reported that the Quraish said to the Holy Prophet (upon whom be be peace): \"Tell us of the ancestry of your Lord.\" Thereupon this Surah was sent down. (Tabarani).\n\n\nAbul Aliyah has related on the authority of Hadrat Ubayy bin Kab that the polytheists said to the Holy Prophet (upon whom be peace): “Tell us of your Lord's ancestry.\" Thereupon Allah sent down this Surah. (Musnad Ahmad, Ibn Abi Harim, Ibn Jarir, Tirmidhi, Bukhari in At-Tarikh, Ibn al-Mundhir, Hakim, Baihaqi). Tirmidhi has related a tradition on the same theme from Abul Aliyah, which does not contain any reference to Hadrat Ubayy bin Kab, and has declared it to be more authentic.\n\n\nHadrat Jabir bin Abdullah has stated that a bedouin (according to other traditions, some people) said to the Holy Prophet (upon whom be peace): \"Tell us of your Lord's ancestry.\" Thereupon Allah sent down this Surah.(Abu Yala, Ibn Jarir, Ibn al-Mundhir, Tabarani in Al-Ausat, Baihaqi, Abu Nuaim in Al-Hilyah).\n\n\nIkrimah has related a tradition form Ibn Abbas, saying that a group of the Jews, including Kab bin Ashraf, Huyayy bin Akhtab and other, came before the Holy Prophet (upon whom be peace) and said: \"O Muhammad (upon whom be Allah's peace and blessings), tell us of the attributes of your Lord, who has sent you as a Prophet.\" Thereupon Allah sent down this Surah. (Ibn Abi Hatim, Ibn Adi, Baihaqi in Al-Asma was-Sifat).\nIn addition to these, some other traditions also have been cited by Ibn Taimiyyali in his commentary of Surah Al-Ikhlas, which are as follows;\n\n\nHadrat Anas has stated that some Jews of Khaiber came before the Holy Prophet (upon whom be peace) and they said: \"O Abul Qasim, Allah created the angels from light, Adam from rotten clay, Iblis from the flame of fire, the sky from smoke, and the earth from the foam of water. Now tell us about your Lord (of what He is made).\" The Holy Prophet (upon whom be peace) did not give any reply to this question. Then Gabriel came and he said: \"O Muhammad, say to them: Huwa Allahu ahad.\"\n\n\nAmir bin at-Tufail said to the Holy Prophet: \"O Muhammad, what do you call us to?\"The Holy Prophet replied: \"To Allah.\" Amir said, \"Then, tell us of what He is made, whether of gold, silver, or iron?\" Thereupon this surah was sent down.\n\n\nDahhak, Qatadah and Muqatil have stated that some Jewish rabbis came before the Holy Prophet, and they said: \"O Muhammad, tell us what is your Lord like, so that we may believe in you. Allah in the Torah has sent down His description. Kindly tell us of what He is made, what is His sex, whether He is made of gold, copper, brass, iron, or silver, and whether He eats and drinks. Also tell us from whom He has inherited the world, and who will inherit it after Him.\" Thereupon Allah sent down this Surah.\n\n\nIbn Abbas has reported that a deputation of the Christians of Najran along with seven priests visited the Holy Prophet upon whom be peace), and they said: \"O Muhammad, tell us what is your Lord like and of what substance He is made.\"The Holy Prophet replied, \"My Lord is not made from any substance. He is unique and exalted above everything.\" Thereupon Allah sent down this Surah.\n\n",
        "\n",
        "These traditions show that different people on different occasions had questioned the Holy Prophet (upon whom be peace) about the essence and nature of the God to Whose service and worship he invited the people, and on every occasion he recited by Allah's command this very Surah in response. First of all, the pagans. of Quraish asked him this question in Makkah, and in reply this Surah was sent down. Then, at Madinah, sometimes the Christians, and sometimes the other people of Arabia, asked him questions of this nature, and every time Allah inspired him to recite this very Surah in answer to them. In each of these traditions, it has been said that this Surah was revealed on this or that occasion. From this one should not form the impression that all these traditions are mutually contradictory. The fact is that whenever there existed with the Holy Prophet a verse or a Surah previously revealed in respect of a particular question or matter, and later the same question was\npresented before him, Allah inspired him to recite the same verse or Surah to the people as it contained the answer to their question. The reporters of Hadith describe the same thing, saying: When such and such a question or matter was presented before the Holy Prophet, such and such a verse or Surah was revealed. This has also been described as repetition of revelation, i. e. the revelation of a verse or Surah several times.",
        "\n",
        "Thus, the fact is that this Surah is Makki, rather in view of its subject matter a Surah revealed in the earliest period at Makkah, when detailed verses of the Quran dealing with the essence and attributes of Allah Almighty had not yet been revealed, and the people hearing, the Holy Prophet's invitation to Allah, wanted to know what was his Lord like to whose worship and service he was calling them. Another proof of this Surah's being one of the earliest Surahs to be revealed is that when in Makkah Umayyah bin Khalaf, the master of Hadrat Bilal, made him lie down on burning sand and placed a heavy stone on his chest, Bilal used to cry \"Ahad, Ahad !\" This word was derived from this very Surah.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "A little consideration of the traditions regarding the occasion of the revelation of this Surah, shows what were the religious concepts of the world at the time the Holy Prophet began to preach the message of Tauhid. The idolatrous polytheists were worshiping gods made of wood, stone, gold, silver and other substances. These gods had a form, shape and body. The gods and goddesses were descended from each other. No goddess was without a husband and no god without a wife. They stood in need of food and drink and their devotees arranged these for them. A large number of the polytheists believed that God assumed human form and there were some people who descended from Him. Although the Christians claimed to believe in One God, yet their God also had at least a son, and besides the Father and Son, the Holy Ghost also had the honor of being an associate in Godhead: so much so that God had a mother and a mother-in-law too. The Jews also claimed to believe in One God, but their\nGod too was not without physical, material and other human qualities and characteristics. He went for a stroll, appeared in human form, wrestled with a servant of His, and was father of a son, Ezra. Besides these religious communities, the Zoroastrians were fire worshipers, and the Sabeans star worshipers. Under such conditions when the people were invited to believe in Allah, the One Who has no associate, it was inevitable that questions arose in the minds as to what kind of a God it was, Who was one and Only Lord and invitation to believe in Whom was being given at the expense of all other gods and deities. It is a miracle of the Quran that in a few words briefly it answered all the questions and presented such a clear concept of the Being of Allah as destroyed all polytheistic concepts, without leaving any room for the ascription of any of the human qualities to His Being.",
        "\n",
        "Merit and Importance",
        "\n",
        "That is why the Holy Messenger of Allah (upon whom be peace) held this Surah in great esteem, and he made the Muslims realize its importance in different ways so that they recited it frequently and disseminated it among the people. For it states the foremost and fundamental doctrine of Islam (viz. Tauhid) in four such brief sentences as are immediately impressed on human memory and can be read and recited easily. There are a great number of the traditions of Hadith, which show that the Holy Prophet on different occasions and in different ways told the people that this Surah is equivalent to one third the Quran. Several ahadith on this subject have been related in Bukhari, Muslim, Abu Daud; Nasai, Tirmidhi, Ibn Majah, Musnad Ahmad, Tabarani and other books, on the authority of Abu Said Khudri, Abu Hurairah, Abu Ayyub Ansari, Abu ad-Darda, Muadh bin Jabal, Jabir bin Abdullah, Ubayy bin Kab, Umm Kulthum bint Uqbah bin Abi Muait, Ibn Umar, Ibn Masud,\nQatadah bin an-Numan, Anas bin Malik, and Abu Masud (may Allah be pleased with all of them).",
        "\n",
        "The commentators have given many explanations of the Holy Prophet's saying. But in our opinion it simply means that the religion presented by the Quran is based on three doctrines: Tauhid, Prophethood and the Hereafter. This Surah teaches Tauhid, pure and undefiled. Therefore, the Holy Prophet (upon whom he Peace) regarded it as, equal to one-third of the Quran.",
        "\n",
        "A tradition on the authority of Hadrat Aishah has been related in Bukhari, Muslim and other collections of the Ahadith, saying that the Holy Prophet sent a man as leader of an expedition. During the journey he concluded his recitation of the Quran in every Prayer with Qul Huwa-Allahu ahad. On their return him companions mentioned this before the Holy Prophet. He said: \"Ask him why he did so.\" When the man was asked, he replied: \"In this Surah the attributes of the Merciful God have been stated; therefore, I love to recite it again and again.\" When the Holy Prophet heard this reply, he said to the people: \"Inform him that Allah holds him in great love and esteem.\"",
        "\n",
        "A similar incident has been related in Bukhari, on the authority of Hadrat Anas. He says: \"A man from among the Ansar led the Prayers in the Quba Mosque. His practice was that in every rak\\`ah he first recited this Surah and then would join another Surah to it. The people objected to it and said to him:\"Don't you think that Surah Ikhlas is by itself enough? Why do you join another Surah to it? You should either recite only this surah, or should leave it and recite some other Surah. He said: \"I cannot leave it, I would rather give up leadership in the Prayer, if you so desired.\" The people did not approve that another man be appointed leader instead of him. At last, the matter was brought before the Holy Prophet. He asked the man, \"What prevents you from conceding what your companions desire? What makes you recite this particular Surah in every rak\\`ah?\" The man replied: \"I have great love for it.\" The Holy Prophet remarked: \"Your this love for this Surah has\nearned you entry into Paradise.\"",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah whose six elements of belief constitute pure sincerity of faith or Monotheism, wherein a believer airms God’s divinity, Oneness, and eternality, and negates in relation to Him any ospring, ancestry, or likeness. It negates any kind of anthropomorphism that may compromise pure monotheism. It is unusual in having as its title a term not mentioned in the body of the surah. The word “Ikhlas” conveys the meaning of sincerity in one’s religion and total dedication to the One true God.The surah is also known as: Divine Unity, Oneness, Pure Faith, Pure Sincerity, Pure Truth, Purity (of Faith), Sincere Religion, Sincerity, The Purity of Faith, Unity.",
    "name_translation": "Monotheism",
    "name_complex": "Al-Ikhlâs",
    "surah_name_ar": "الاخلاص",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 112:1": "Thuaj: “Perëndia është Një!",
                            "verse 112:2": "Perëndisë i drejtohen për çdo gjë!",
                            "verse 112:3": "(Ai) nuk ka lindur prej ndokujt, as nuk ka lindur kë,",
                            "verse 112:4": "dhe askush nuk i gjason Atij!”"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "(Ya Peyğəmbər! Allahın zatı və sifətləri haqqında səndən soruşan müşriklərə) de: \"(Mənim Rəbbim olan) O Allah birdir (heç bir şəriki yoxdur);",
                            "verse 112:2": "Allah (heç kəsə, heç nəyə) möhtac deyildir! (Hamı Ona möhtacdır; O, əzəlidir, əbədidir!)",
                            "verse 112:3": "O, nə doğmuş, nə də doğulmuşdur! (Allah ?zünə heç bir övlad götürməmişdir!)",
                            "verse 112:4": "Onun heç bir tayı-bərabəri (bənzəri) də yoxdur!\""
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "Reci: \"On je Allah - Jedan!",
                            "verse 112:2": "Allah je Utočište svakom!",
                            "verse 112:3": "Nije rodio i rođen nije,",
                            "verse 112:4": "i niko Mu ravan nije!\""
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "বলুন, তিনি আল্লাহ, এক,",
                            "verse 112:2": "আল্লাহ অমুখাপেক্ষী,",
                            "verse 112:3": "তিনি কাউকে জন্ম দেননি এবং কেউ তাকে জন্ম দেয়নি",
                            "verse 112:4": "এবং তার সমতুল্য কেউ নেই।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 112:1": "Кажи [о, Мухаммад]: Той е Аллах - Единствения,",
                            "verse 112:2": "Аллах, Целта [на всички въжделения]!",
                            "verse 112:3": "Нито е раждал, нито е роден,",
                            "verse 112:4": "и няма равен Нему."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "你說：他是真主，是獨一的主；",
                            "verse 112:2": "真主是萬物所仰賴的；",
                            "verse 112:3": "他沒有生產，也沒有被生產；",
                            "verse 112:4": "沒有任何物可以做他的匹敵。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "Rci: \"On Bůh je jedinečný,",
                            "verse 112:2": "Bůh sám o sobě věčný.",
                            "verse 112:3": "Neplodil a nebyl zplozen",
                            "verse 112:4": "a není nikoho, kdo je mu roven.\""
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "Zeg: \"God is de Enige.",
                            "verse 112:2": "God is zichzelf-genoeg, Eeuwig.",
                            "verse 112:3": "Hij verwekte niet, noch werd Hij verwekt.",
                            "verse 112:4": "En niemand is Hem in enig opzicht gelijk.\""
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 112:1": "Say: He is Allah, the One!",
                            "verse 112:2": "Allah, the eternally Besought of all!",
                            "verse 112:3": "He begetteth not nor was begotten.",
                            "verse 112:4": "And there is none comparable unto Him."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 112:1": "Say: He is God, the One and Only;",
                            "verse 112:2": "God, the Eternal, Absolute;",
                            "verse 112:3": "He begetteth not, nor is He begotten;",
                            "verse 112:4": "And there is none like unto Him."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 112:1": "Say: ’He is God, One,",
                            "verse 112:2": "God, the Everlasting Refuge,",
                            "verse 112:3": "who has not begotten, and has not been begotten,",
                            "verse 112:4": "and equal to Him is not any one.’"
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 112:1": "SAY: \"He is the One God:",
                            "verse 112:2": "\"God the Eternal, the Uncaused Cause of All That Exists.",
                            "verse 112:3": "\"He begets not, and neither is He begotten;",
                            "verse 112:4": "\"and there is nothing that could be compared with Him.\""
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 112:1": "Say: He, God, is One. [UM] [BC] [WS][M]The indivisible One-and-Only. [QACI]",
                            "verse 112:2": "God- The Eternally Sufficient unto Himself. [UM] [BC]God, the Self-Sufficing in Infinite Plenitude. [SS]God, the Absolute Plenitude Sufficing-unto-Himself (as-Samad). [WS]God, the Totally Sufficing unto Himself in His Infinite Perfection. [QACI] [SQCI]God, the Self-Sufficient Besought of all.",
                            "verse 112:3": "He begetteth not and He is not begotten. [UM]He begetteth not, nor is begotten.",
                            "verse 112:4": "And there is none like unto Him. [UM]And none is like Him."
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 112:1": "Say, “The truth is that Allah is One.",
                            "verse 112:2": "Allah is Besought of all, needing none.",
                            "verse 112:3": "He neither begot anyone, nor was he begotten.",
                            "verse 112:4": "And equal to Him has never been any one.”"
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 112:1": "Say: ‘He is God, One.",
                            "verse 112:2": "God, the Self-Sufficient, Besought of all.",
                            "verse 112:3": "He neither begot, nor was begotten.",
                            "verse 112:4": "Nor is there anyone equal to Him’."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 112:1": "(O Esteemed Messenger!) Proclaim: ‘He is Allah, Who is the One.",
                            "verse 112:2": "Allah is the Transcendent of all, the Protector and Far-Superior to all.",
                            "verse 112:3": "He has not begotten any, nor is He begotten.",
                            "verse 112:4": "Nor is there anyone equal to Him.’"
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 112:1": "Dis : \" Lui, Dieu, est Un !",
                            "verse 112:2": "Dieu est le Soutien universel !",
                            "verse 112:3": "Il n'engendre pas et Il n'est pas engendré,",
                            "verse 112:4": "et Il n'a pas d'égal. \""
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 112:1": "Dis : «Il est Dieu, Unique.",
                            "verse 112:2": "Dieu, Le Seul à être imploré pour ce que nous désirons.",
                            "verse 112:3": "Il n’a jamais engendré, n’a pas été engendré non plus.",
                            "verse 112:4": "Et nul n’est égal à Lui»."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "Sprich: «Er ist Allah, der Einzige;",
                            "verse 112:2": "Allah, der Unabhängige und von allen Angeflehte.",
                            "verse 112:3": "Er zeugt nicht und ward nicht gezeugt;",
                            "verse 112:4": "Und keiner ist Ihm gleich.»"
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "¼,s jlwy½ rqe dg nks fd [+kqnk ,d gS",
                            "verse 112:2": "[+kqnk cjgd+ csfu;kt+ gS",
                            "verse 112:3": "u mlus fdlh dks tuk u mldks fdlh us tuk]",
                            "verse 112:4": "vkSj mldk dksbZ gelj ugha"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "Katakanlah: \"Dia-lah Allah, Yang Maha Esa,",
                            "verse 112:2": "Allah adalah Tuhan yang bergantung kepada-Nya segala sesuatu.",
                            "verse 112:3": "Dia tiada beranak dan tiada pula diperanakkan,",
                            "verse 112:4": "dan tidak ada seorang pun yang setara dengan Dia\"."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "Di': \" Egli Allah è Unico,",
                            "verse 112:2": "Allah è l'Assoluto .",
                            "verse 112:3": "Non ha generato, non è stato generato",
                            "verse 112:4": "e nessuno è eguale a Lui\"."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "言え，「かれはアッラー，唯一なる御方であられる。",
                            "verse 112:2": "アッラーは，自存され，",
                            "verse 112:3": "御産みなさらないし，御産れになられたのではない，",
                            "verse 112:4": "かれに比べ得る，何ものもない。」"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "일러가로되 하나님은 단 한분이시고",
                            "verse 112:2": "하나님은 영원하시며",
                            "verse 112:3": "성자와 성부도 두지 않으셨으 며",
                            "verse 112:4": "그분과 대등한 것 세상에 없 노라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "(ئه‌ی محمد (صلی الله علیه وسلم) ئه‌ی ئیماندار) بڵێ: ئه‌و خوای که ناوی _ الله‌_ خوایه‌کی تاک و ته‌نهایه (بێ هاوه‌ڵ و هاوتایه‌).",
                            "verse 112:2": "خوا زاتێکی پایه‌دار و ده‌سه‌ڵاتداره‌، نیازی به که‌س نییه‌و هه‌موویان ئاتاجی ئه‌ون، هه‌ر ئه‌و ده‌توانێ به‌ڵاو و ناخۆشی لابه‌رێت و پێویستی و داخوازیه‌کانمان جێ به جێ بکات.",
                            "verse 112:3": "هیچ که‌سی لێ نه‌بووه و خۆشی له که‌س نه‌بووه‌.",
                            "verse 112:4": "هه‌رگیز هاوتاو هاوشێوه و ده‌سه‌ڵاتدارێکی تر نییه که له‌به‌رامبه‌ریه‌وه به‌وه‌ستێت و هاوشانی بێت."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "Katakanlah (wahai Muhammad): (Tuhanku) ialah Allah Yang Maha Esa.",
                            "verse 112:2": "Allah Yang menjadi tumpuan sekalian makhluk untuk memohon sebarang hajat.",
                            "verse 112:3": "Dia tiada beranak dan Dia pula tidak diperanakkan",
                            "verse 112:4": "Dan tidak ada sesiapapun yang serupa denganNya."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "بگو: خداوند، يكتا و يگانه است;",
                            "verse 112:2": "خداوندى است كه همه نيازمندان قصد او مى‏كنند;",
                            "verse 112:3": "(هرگز) نزاد، و زاده نشد،",
                            "verse 112:4": "و براى او هيچگاه شبيه و مانندى نبوده است!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "Dize: Ele é Deus, o Único!",
                            "verse 112:2": "Deus! O Absoluto!",
                            "verse 112:3": "Jamais gerou ou foi gerado!",
                            "verse 112:4": "E ninguém é comparável a Ele!"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 112:1": "Spune: \"El este Allah, Cel Unic !",
                            "verse 112:2": "Allah-us-Samad!",
                            "verse 112:3": "El nu zãmislește și nu este nãscut",
                            "verse 112:4": "Și El nu are pe nimeni egal!\""
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 112:1": "Spune: “Unul este Dumnezeu.",
                            "verse 112:2": "Dumnezeu!.. Absolutul!",
                            "verse 112:3": "El nu naşte şi nu se naşte,",
                            "verse 112:4": "şi nimeni nu-I este asemenea.”"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "Скажи: «Он — Аллах — Един;",
                            "verse 112:2": "Извечен Аллах один,Ему чужды любые нужды,Мы же нуждаемся лишь в Нем2338.",
                            "verse 112:3": "Он не рождает и Сам не рожден,",
                            "verse 112:4": "Неподражаем Он и не сравним(ни с чем,Что наше виденье объять способноИли земное знанье может охватить)»."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "Di: «¡Él es Alá, Uno,",
                            "verse 112:2": "Dios, el Eterno.",
                            "verse 112:3": "No ha engendrado, ni ha sido engendrado.",
                            "verse 112:4": "No tiene par»."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "(நபியே!) நீர் கூறுவீராக: அல்லாஹ் அவன் ஒருவனே.",
                            "verse 112:2": "அல்லாஹ் (எவரிடத்தும்) தேவையற்றவன்.",
                            "verse 112:3": "அவன் (எவரையும்) பெறவுமில்லை (எவராலும்) பெறப்படவுமில்லை.",
                            "verse 112:4": "அன்றியும், அவனுக்கு நிகராக எவரும் இல்லை."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "จงล่าวเถิดมุฮัมมัด พระองค์คืออัลลอฮ์ผู้ทรงเอกกะ",
                            "verse 112:2": "อัลลอฮ์นั้นทรงเป็นที่พึ่ง",
                            "verse 112:3": "พระองค์ไม่ประสูติ และไม่ทรงถูกประสูติ",
                            "verse 112:4": "และไม่มีผู้ใดเสมอเหมือนพระองค์"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "De ki: O, Allah birdir.",
                            "verse 112:2": "Allah sameddir.",
                            "verse 112:3": "O, doğurmamış ve doğmamıştır.",
                            "verse 112:4": "Onun hiçbir dengi yoktur."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 112:1": "Айт: «У Аллоҳ ягонадир».",
                            "verse 112:2": "Аллоҳ сомаддир. (Ҳожатларни ва рағбатларни қондирувчидир.)",
                            "verse 112:3": "У туғмаган ва туғилмаган.",
                            "verse 112:4": "Ва Унга ҳеч ким тенг бўлмаган. (Аллоҳ таолога бирор зот на зотида, на сифатида ва на амалида тенг бўлган эмас, бўлолмайди ҳам.)"
                        }
                    }
                }
            }
        }
    }
}