{
    "id": 31,
    "name_simple": "Luqman",
    "revelation_place": "makkah",
    "revelation_order": 57,
    "bismillah_pre": true,
    "verses_count": 34,
    "short_text": "The Surah has been named Luqman after Luqman the Sage, whose admonitions to his son have been related in vv. 12-19 of this Surah.",
    "text": [
        "\n",
        "The Surah has been named Luqman after Luqman the Sage, whose admonitions to his son have been related in vv. 12-19 of this Surah.",
        "\n",
        "Period of Revelation",
        "\n",
        "A perusal of the subject matter shows that it was sent down in the period when persecution to suppress and thwart the invitation to Islam had begun and every sort of machination had started being employed for the purpose. This is borne out by vv. 14-15, in which the young converts to Islam have been told that although the rights of the parents are the uppermost after God, they should not listen to them if they prevented them from accepting Islam, or compelled them to revert to the creed of shirk and polytheism. The same thing has been said in Surah Al-Ankabut, which indicates that both these Surahs were sent down in the same period. A study of the style and subject matter of the two Surahs on the whole, however, shows that Surah Luqman was sent down earlier, for one does not see any sign of the antagonism in its background though, contrary to this, while studying Surah Al-Ankabut one can clearly feel that the Muslims were being severely persecuted during the period of its\r\nrevelation.",
        "\n",
        "Theme and Subject matter",
        "\n",
        "In this Surah the people have been made to understand the meaninglessness and absurdity of shirk and the truth and reasonableness of Tauhid, and they have been invited to give up blind imitation of their forefathers, consider with a cool mind the teachings which the Prophet Muhammad (upon whom be Allah's peace and blessings) is presenting from the Lord of the worlds, and see with open eyes the manifest Signs found in the universe around them and in their own selves, which bear evidence to its truth.",
        "\n",
        "In this connection, it has also been pointed out that this is not a new teaching which might have been, presented in the world, or in the land of Arabia, for the first time, and with which the people might be unfamiliar. The learned and wise people of the past ages said and taught the same thing which Muhammad (upon whom be Allah's peace) is teaching today. It is as if to say, \"O people! In your own country there has lived a wise man, named Luqman, whose wisdom has been well known among you, whose proverbs and wise sayings are cited in your daily conversation and who is often quoted by your poets and orators. Now you should see for yourselves what creed and what morals he used to teach.\"",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that mentions the judicious and poignant admonitions of Luqmān (whom some call Lokman, the Wise, a man of faith) as he spoke them to his beloved son. It is named after Luqmān, whose account is given in verse 12. The surah opens with a description of the believers, and it condemns those who attempt to lead others away from guidance. It extols God’s power and warns the disbelievers of the consequences of their actions. The Prophet is told not to be saddened by their disbelief.The surah is also known as: Lokman, Luqmaan, Luqman (The Wise).",
    "name_translation": "Luqmān",
    "name_complex": "Luqmân",
    "surah_name_ar": "لقمان",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 31:1": "Elif, L?m, Mîm.",
                            "verse 31:2": "Këto janë ajetet nga Libri plotë dijeni,",
                            "verse 31:3": "(i cili) është udhërrëfyes dhe mëshirë për bamirësit,",
                            "verse 31:4": "ata që kryejnë namazin dhe japin zeqatin, dhe të cilët besojnë bindshëm në jetën tjetër.",
                            "verse 31:5": "Këta janë ata që janë udhëzuar nga Zoti i tyre dhe vetëm ata janë të shpëtuar.",
                            "verse 31:6": "E, ka disa nga njerëzit që besojnë në tregime të kota, për t’u shmangur nga rruga e Perëndisë, pa kurrfarë dijenie, duke e pandehur (rrugën e Zotit) qesharake. Të atillët i pret dënimi i poshtëruar.",
                            "verse 31:7": "Kur ndonjërit prej tyre, u lexohen ajetet Tona (Kur’ani), ai shmanget me mendjemadhësi, thuase nuk i ka dëgjuar, thuase iu kanë shurdhuar veshët. Andaj, sihariqoi ata me dënim të dhembshëm.",
                            "verse 31:8": "Me të vërtetë, ata që kanë besuar dhe punojnë vepra të mira do të gjenden në kopshtet e dhuntisë,",
                            "verse 31:9": "në të cilat do të qëndrojnë përherë. Premtimi i Perëndisë është i vërtetë, e Ai është i Plotëfuqishëm dhe i Gjithëdijshëm.",
                            "verse 31:10": "(Ai) ka krijuar qiejt pa shtylla, e i shihni ju – ka vendosur male të palëvizshme në Tokë, për të mos u lëkundur ju, dhe ka shpërndarë në të, gjithfarë lloj shtazësh. Ne, e kemi zbritu ujin nga qielli dhe me të, kemi bërë të mbijnë sa e sa lloje bimësh të mira (buta).",
                            "verse 31:11": "Ky është krijimi i Perëndisë; më tregoni çka kanë krijuar të tjerët pos Tij? Jo, por, me të vërtetë, zullumqarët janë në humbje të vërtetë.",
                            "verse 31:12": "Dhe, Ne, me të vërtetë, i kemi dhënë Llukmanit dijeninë e mrekullueshme, (dhe i kemi thënë): “Falenderoje Perëndinë, e kush është falenderues, ai falenderon për të mirën e vet, e kush mohon – Perëndia, me të vërtetë, është i pavarur dhe i lavdëruar”.",
                            "verse 31:13": "Dhe, (kujtoje) kur Llukmani i tha djalit të vet, duke e këshilluar: “O djali im, mos i bënë shok Perëndisë! Me të vërtetë, të bërit shok Perëndisë, është zullum i madh”.",
                            "verse 31:14": "Dhe, Ne, i kemi urdhëruar njeriun që t’i nderojë prindërit e vet. Nëna e ka bartur atë, duke duruar mundim pas mundimi, e ndarja e tij (nga gjiri) është brenda dy vitesh. (Dhe i kemi thënë njeriut): “Bëhu falenderues ndaj Meje dhe prindërve tu! Tek Unë do të ktheheni të gjithë”.",
                            "verse 31:15": "Nëse insistojnë ata, që të më bësh Mua shok për atë që nuk din asgjë, mos i dëgjo, por shoqërohu me ta në këtë jetë me të mirë, e ndiqe rrugën e atij që drejtohet tek Unë; pastaj, tek Unë do të ktheheni dhe Unë do t’ju lajmëroj për atë që keni punuar.",
                            "verse 31:16": "“O djali im, nëse (vepra e punuar) është e rëndë qoftë se një kokërr hardeli (lloj mëlmese), e ajo të jetë në shkëmb, ose në qiej ose në tokë, Perëndia do ta nxjerrë në shesh atë. Me të vërtetë, Perëndia është i butë dhe njohës i të gjitha fshehtësive.",
                            "verse 31:17": "O djali im, kryeje namazin, urdhëro me të mirë dhe pengo nga të këqiat dhe bëhu i durueshëm për atë që të ka goditur! Me të vërtetë, kjo është nga punët e mëdha, të vendosura.",
                            "verse 31:18": "Mos e shmang fytyrën tënde nga njerëzit dhe mos ec nëpër tokë mendjemadhësisht, se Perëndia nuk e don asnjë mendjemadh, as mburracak.",
                            "verse 31:19": "Ec me kujdes e modesti, e fol me zë të ulët; se zëri më i vrazhdë është zëri (pallja e) i gomarit!”",
                            "verse 31:20": "A nuk shihni, se si Perëndia u ka mundësuar – t’i shfrytëzoni të gjitha ato që gjenden në qiej dhe në Tokë dhe ju ka plotësuar dhuntitë e Tij – të jashtme dhe të brendshme? E, ka njerëz që polemizojnë për Perëndinë pa kurrfarë dijenie, pa kurrfarë rrëfyesi dhe pa libër ndriçues.",
                            "verse 31:21": "Kur atyre u thuhet: “Pasoni atë që u ka shpallur Perëndia!” ata thonë: “Jo, (por) ne pasojmë të parët tanë”. E, sikur ata t’i thërriste djalli edhe në dënimin e skëterrës, (a do ta pasonin)?",
                            "verse 31:22": "Kush kthehet kah Perëndia, me tërë qenien e tij, duke qenë i mirë, ai është kapur për vegën më të fortë. E, te Perëndia, është fundi i çdo gjëje.",
                            "verse 31:23": "Dhe kush mohon, të mos të brengos mohimi i tij. Tek Ne do të kthehen ata, e Ne do t’i lajmërojmë për atë që kanë punuar. Me të vërtetë, Perëndia di ç’ka në zemrat e njerëzve.",
                            "verse 31:24": "Ne, ata do t’i kënaqim përkohësisht, e pastaj, do t’i hudhin furishëm në dënimin e ashpër.",
                            "verse 31:25": "E, nëse i pyet ti (o Muhammed) ata: “Kush ka krijuar qiejt dhe Tokën?” – me siguri do të thonë: “Perëndia!” E ti thuaj: “Falenderimi qoftë për Perëndinë!” Por, shumica e tyre nuk dinë.",
                            "verse 31:26": "Të Perëndisë janë të gjitha, në qiej dhe në Tokë. Me të vërtetë, Perëndia është i pavarur dhe i lavdëruar.",
                            "verse 31:27": "Sikur të gjithë drunjtë të gjenden në Tokë – të jenë penda (shkrimi), e deti ngjyrë shkrimi (tintë), e t’i shtohen atij edhe shtatë dete të tjera, nuk do të soseshin fjalët e Perëndisë. Me të vërtetë, Perëndia është i Plotëfuqishëm dhe i Gjithëdijshëm.",
                            "verse 31:28": "Të krijuarit dhe të ringjallurit e të gjithë juve është njësoj (për Te) – si të krijuarit e vetëm një njeriu. Me të vërtetë, Perëndia i dëgjon dhe i sheh të gjitha.",
                            "verse 31:29": "A nuk po sheh ti se Perëndia e shtie natën në ditë dhe ditën në natë (e zgjatë njërën dhe e shkurton tjetrën), dhe e ka nënshtruar Diellin dhe Hënën – secili lëvizë deri në kohë të caktuar – dhe se Perëndia e di mirë çka punoni ju.",
                            "verse 31:30": "Kjo është (kështu), ngase Perëndia është i vetmi i Vërtetë, e ato që adhurojnë ata – pos Tij, janë të kota, dhe se Perëndia është i lartësuar dhe i madh.",
                            "verse 31:31": "A nuk po sheh ti, e anijet lundrojnë nëpër det me dhuntinë e Perëndisë, për t’ju treguar disa argumente të Veta? Këto janë, me të vërtetë, argumente për çdo njeri të durueshëm dhe mirënjohës.",
                            "verse 31:32": "E, kur ata t’i mbulojë vala – si bjeshkë, e thërrasin Perëndinë me lutje të sinqerta; e, posa t’i shpëtojë ata në tokë, një pjesë e tyre e mbajnë mesataren; e ajetet Tona i mohon vetëm mshtruesi dhe jomirënjohësi.",
                            "verse 31:33": "O njerëz! Druajuni Zotit tuaj dhe frikësojuni Ditës kur prindi nuk do të mund t’i ndihmojë fëmijës së vet asgjë, e as fëmija nuk do të mund t’i ndihmojë asgjë prindit të vet! Me të vërtetë, premtimi i Perëndisë është i sigurt, e, le të mos u mashtrojë jeta e kësaj bote, dhe le të mos u mashtrojë mashtruesi (djalli) në Perëndinë.",
                            "verse 31:34": "Me të vërtetë, vetëm Perëndia e di Castin (Ditën e Kijametit), Ai e zbret shiun dhe di çka k në barkun e shtatzënës, e askush nuk di ç’do të fitojë nesër dhe askush nuk di se në ç’vend do të vdes. Me të vërtetë, Perëndia është i Gjithëdijshëm dhe njohës i çdo gjëje."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Əlif, Lam, Mim!",
                            "verse 31:2": "Bu hikmətli Kitabın (Qur'anın) ayələridir.",
                            "verse 31:3": "(O Qur'an) yaxşı əməllər edənlərə bir hidayət (doğru yolu göstərən rəhbər) və rəhmətdir.",
                            "verse 31:4": "O kəslər ki, namaz qılar, zəkat verər və axirətə tam yəqinliklə inanarlar.",
                            "verse 31:5": "Onlar öz Rəbbi tərəfindən (göstərilmiş) doğru yoldadırlar. Nicat tapanlar da (axirət əzabından qurtarıb savaba yetişənlər də) onlardır!",
                            "verse 31:6": "İnsanlar içərisində eləsi də vardır ki, nadanlığı üzündən (tutduğu işin günahını anlamadan xalqı) Allah yolundan (islam dinindən) döndərmək və bu minvalla onu məsxərəyə qoymaq üçün mə'nasız (oyun-oyuncaq) sözləri satın alarlar. Məhz belələrini alçaldıcı bir əzab gözləyir.",
                            "verse 31:7": "Və ayələrimiz ona oxunduğu zaman onları eşitmirmiş, qulaqlarında ağırlıq (karlıq) varmış kimi təkəbbürlə arxasını çevirər. (Ya Rəsulum!) Sən də ona şiddətli bir əzabla (axirətdə cəhənnəm odunda yanacağı ilə) müjdə ver!",
                            "verse 31:8": "İman gətirib yaxşı işlər görənləri Nəim cənnətləri gözləyir.",
                            "verse 31:9": "Onlar orada əbədi qalacaqlar. Allahın (mö'minlərə verdiyi cənnət) və'di haqdır. O, yenilməz qüvvət, hikmət sahibidir!",
                            "verse 31:10": "Allah gördüyünüz göyləri dirəksiz yaratmış (yaxud O, göyləri görə bildiyiniz bir dirək olmadan xəlq etmiş), sizi yırğalamasın (atıb-tutmasın) deyə, yerdə möhkəm durmuş dağlar bərqərar etmiş və ora (yer üzünə) cürbəcür heyvanlar səpələmişdir. Biz göydən yağış yağdırdıq və (onunla) yerdə növbənöv gözəl (bitkilər, meyvələr) yetişdirdik.",
                            "verse 31:11": "Bu (gördükləriniz) Allahın yaratdıqlarıdır. İndi siz də Mənə (Allahdan) başqalarının nə yaratdığını göstərin. Xeyr, zalımlar (müşriklər) açıq-aşkar əyri yoldadırlar (haqq yoldan azmışlar).",
                            "verse 31:12": "Həqiqətən, Loğmana: \"Allaha şükür et!\" (deyə) hikmət verdik. Kim (Allahın ne'mətlərinə) şükür etsə, özü üçün şükür edər. Kim nankor olsa, (bilsin ki) Allah onun şükürünə möhtac deyildir, (özlüyündə) şükürə (tə'rifə) layiqdir! (Onun bütün işləri bəyəniləndir!)",
                            "verse 31:13": "(Ya Rəsulum!) Yadında olsun ki, bir zaman Loğman öz oğluna nəsihət edərək belə demişdi: \"Oğlum! Allaha şərik qoşma. Doğrudan da, Allaha şərik qoşmaq böyük zülmdür! (Ağır günahdır!)\"",
                            "verse 31:14": "Biz insana ata-anasına (yaxşılıq etməyi, valideyninə yaxşı baxmağı, onlarla gözəl davranmağı) tövsiyə etdik. Anası onu (bətnində) çox zəif bir halda daşımışdı. (Uşağın süddən) kəsilməsi isə iki il ərzində olur. (Biz insana buyurduq: ) \"Mənə və ata-anana şükür et. Axır dönüş Mənədir!",
                            "verse 31:15": "Əgər (ata-anan) bilmədiyin bir şeyi Mənə şərik qoşmağına cəhd göstərsələr, (bu işdə) onlara itaət etmə. (Qalan) dünya işlərində onlarla gözəl keçin (onlara itaət et). Tövbə edib Mənə tərəf dönənlərin (islamı qəbul edənlərin) yolunu tut. Sonra (qiyamət günü) Mənim hüzuruma qayıdacaqsınız. Mən də (dünyada) nə etdiklərinizi (bir-bir) sizə xəbər verəcəyəm!\"",
                            "verse 31:16": "(Loğman öyüd-nəsihətinə davam edərək) dedi: \"Oğlum, (dünyada gördüyün hər hansı yaxşı, yaxud pis iş) bir xardal dənəsi ağırlığında olsa da, bir qayanın (daşın) içində, yaxud göylərdə və ya yerin təkində olsa da, Allah onu (qiyamət günü) ortaya gətirər (onun haqq-hesabını çəkər). Həqiqətən, Allah lətifdir (bütün incə, nazik işləri biləndir; lütfkardır), (hər şeydən) xəbərdardır!",
                            "verse 31:17": "Oğlum! Namaz qıl, (insanlara) yaxşı işlər görməyi əmr et, pis işləri qadağan elə. (Bu yolda) sənə üz verəcək müsibətlərə döz. Həqiqətən, bu (dediklərim) vacib əməllərdəndir!",
                            "verse 31:18": "Adamlardan təkəbbürlə üz çevirmə, yer üzündə lovğa-lovğa gəzib dolanma. Həqiqətən, Allah heç bir özündən razını, lovğalanıb fəxr edəni sevməz!",
                            "verse 31:19": "Yerişində müvazinət gözlə (nə çox yeyin, nə də çox asta get) və (danışında) səsini qaldırma. Cünki ən çirkin səs uzunqulaq səsidir!",
                            "verse 31:20": "(Ey İnsanlar!) Məgər Allahın göylərdə və yerdə olanları (günəşi, ayı, ulduzları və buludları; meyvələri, bitkiləri, dənizləri, çayları və gölləri) sizə ram etdiyini (sizin istifadənizə verdiyini), aşkar (görmə, eşitmə, sağlamlıq) və gizli (əql, şüur, fəhm, elm və i. a.) ne'mətləri sizə bolluca ehsan etdiyini görmürsünüzmü? İnsanlar içərisində eləsi də vardır ki, nə bir elmi, nə bir doğru yol göstərən rəhbəri, nə də bir nurani (ilahi) kitabı olmadan Allah barəsində mübahisə edər.",
                            "verse 31:21": "Onlara (Məkkə əhlinə): \"Allahın nazil etdiyinə (Qur'ana) tabe olun!\" deyildikdə, onlar: \"Xeyr, biz atalarımızın getdiyi yolla (ibadət etdiyi dinə) tabe olacağıq!\" - deyə cavab verərlər. Bəs Şeytan onları cəhənnəm odunun əzabına çağırırsa necə? (Yenədəmi həmin yolla gedəcəklər?)",
                            "verse 31:22": "Kim yaxşı əməl sahibi olub özünü (səmimi-qəlbdən) Allaha təslim edərsə, o artıq ən möhkəm ipdən (dəstəkdən - Qur'andan, imandan) yapışmış olur. Bütün işlərin axırı Allaha gəlib çıxacaqdır! (Buyuruq Allahındır!)",
                            "verse 31:23": "Kim küfr etsə, onun küfrü (ya Rəsulum) səni kədərləndirməsin. Onlar Bizim hüzurumuza qayıdacaqlar. Biz də onlara (dünyada) nələr etdiklərini xəbər verəcəyik. Həqiqətən, Allah ürəklərdə olanları biləndir!",
                            "verse 31:24": "Biz onlara bir qədər gün-güzəran (bir az dünya malı) verəcək, sonra da (axirətdə) ağır bir əzaba düçar edəcəyik!",
                            "verse 31:25": "(Ya Rəsulum!) Həqiqətən, əgər sən (müşriklərdən): \"Göyləri və yeri kim yaratmışdır?\" - deyə soruşsan, onlar mütləq: \"Allah!\" - deyə cavab verəcəklər. De: \"Həmd olsun Allaha!\" Lakin onların əksəriyyəti (həmd-sənanın kimə məxsus olduğunu) bilməz!",
                            "verse 31:26": "Göylərdə və yerdə nə varsa, Allahındır. Allah (bəndələrinin, o cümlədən müşriklərin ibadətinə) möhtac deyildir və (özlüyündə hər cür) şükrə (tə'rifə) layiqdir! (Onun bütün işləri bəyəniləndir!)",
                            "verse 31:27": "Əgər yer üzündəki bütün ağaclar qələm, dərya da arxasından yeddi dərya qatılaraq (mürəkkəb) olsaydı, yenə də Allahın sözləri (yazmaqla) tükənməzdi. Həqiqətən, Allah yenilməz qüdrət, hikmət sahibidir!",
                            "verse 31:28": "(Ey insanlar!) Sizi (yoxdan) yaratmaq və (qiyamət günü) diriltmək (Allah üçün) ancaq bir nəfəri yaratmaq və diriltmək kimidir. Həqiqətən, Allah (hər şeyi) eşidəndir, görəndir!",
                            "verse 31:29": "(Ya Rəsulum!) Məgər Allahın gecəni gündüzə, gündüzü də gecəyə qatdığını (gah gündüzü, gah da gecəni uzatdığını), günəşi və ayı ram (sizin mənafeyinizə tabe) etdiyini görmürsənmi? Onların hər biri (öz hədəqəsində, dairəsində) müəyyən müddətədək (qiyamət gününə qədər) dövr edər. Həqiqətən, Allah nə etdiklərinizdən xəbərdardır!",
                            "verse 31:30": "Bu (deyilənlər) ona görədir ki, Allah haqq, (müşriklərin) Ondan qeyri ibadət etdikləri isə batildir. Həqiqətən, Allah (hər şeydən) ucadır, (hər şeydən) böyükdür!",
                            "verse 31:31": "(Ya Rəsulum!) Sizə öz qüdrət əlamətlərindən bə'zisini göstərsin deyə, gəmilərin dənizdə Allahın lütfü ilə üzdüyünü görmürsənmi? Həqiqətən, bunda (əziyyətlərə) səbr, (Allahın ne'mətlərinə) çox şükür edən hər kəs üçün ibrətlər vardır!",
                            "verse 31:32": "(Kafirləri) ətrafına kölgə salan uca dağlar (yaxud qara buludlar) kimi dalğalar bürüdüyü zaman onlar dini (ibadəti) Allaha məxsus edərək yalnız Ona dua edərlər. Allah onları sağ-salamat quruya çıxartdıqda içərilərindən bə'ziləri (küfrlə iman arasında) orta mövqe tutar. (Bə'ziləri isə öz küfründə qalar). Bizim ayələrimizi yalnız çox xain, nankor olanlar danarlar!",
                            "verse 31:33": "Ey insanlar! Rəbbinizdən qorxun. Atanın oğula, oğulun da ataya heç bir şeylə kara gələ bilməyəcəyi bir gündən həzər edin. Allahın və'di, şübhəsiz ki, haqdır. (Qiyamət günü mütləq gələcəkdir). Ehtiyatlı olun ki, dünya həyatı sizi aldatmasın. Şeytan sizi Allaha arxayın edib (Allah ?z bəndələrinə mehribandır, onların hamısını bağışlayacaq, günahlarından keçəcək deyə) tovlamasın!",
                            "verse 31:34": "Həqiqətən, o saatı (qiyamətin qopacağı vaxtı) ancaq Allah bilir. Yağışı (istədiyi vaxt) göydən O yağdırır, bətnlərdə olanı (doğulacaq uşağın oğlan, yaxud qız, xəstə və ya sağlam, xoşbəxt və ya bədbəxt, yaxşı və ya pis əməl sahibi olacağını) O bilir. Heç kəs səhər nə kəsb edəcəyini (savab, yaxud günah qazanacağını), heç kəs harada öləcəyini bilməz. Allah isə, şübhəsiz ki, (hər şeyi) biləndir, (hər şeydən) xəbərdardır!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Elif Lam Mim.",
                            "verse 31:2": "Ovo su ajeti mudre Knjige,",
                            "verse 31:3": "upute i milosti onima koji budu dobro činili,",
                            "verse 31:4": "onima koji molitvu budu obavljali i zekat davali i koji u onaj svijet budu čvrsto vjerovali;",
                            "verse 31:5": "njima će Gospodar njihov na Pravi put ukazati i oni će želje svoje ostvariti.",
                            "verse 31:6": "Ima ljudi koji kupuju priče za razonodu, da bi, ne znajući koliki je to grijeh, s Allahova puta odvodili i da bi ga predmetom za ismijavanje uzimali. Njih čeka sramna kazna.",
                            "verse 31:7": "Kad se nekom od njih ajeti Naši kazuju, on oholo glavu okreće, kao da ih nije ni čuo, kao da je gluh - zato mu navijesti patnju nesnosnu.",
                            "verse 31:8": "One koji budu vjerovali i dobra djela činili, doista čekaju bašče uživanja,",
                            "verse 31:9": "u njima će vječno boraviti - obećanje je Allahovo istinito, a On je silan i mudar.",
                            "verse 31:10": "Nebesa je, vidite ih, bez stubova stvorio, a po Zemlji planine nepomične razbacao da vas ne trese, i po njoj životinje svih vrsta razasuo. Mi s neba kišu spuštamo i činimo da po njoj niču svakovrsne plemenite biljke.",
                            "verse 31:11": "To je Allahovo djelo; a pokažite Mi šta su drugi, mimo Njega, stvorili? Ništa! Mnogobošci su u pravoj zabludi.",
                            "verse 31:12": "A Mi smo Lukmanu mudrost darovali: \"Budi zahvalan Allahu! Ko je zahvalan, čini to u svoju korist, a ko je nezahvalan - pa, Allah je, zaista, neovisan i hvale dostojan.\"",
                            "verse 31:13": "Kada Lukman reče sinu svome, savjetujući ga: \"O sinko moj, ne smatraj druge Allahu ravnim, mnogoboštvo je, zaista, velika nepravda.\"",
                            "verse 31:14": "Mi smo naredili čovjeku da bude poslušan roditeljima svojim. Majka ga nosi, a njeno zdravlje trpi, i odbija ga u toku dvije godine. Budi zahvalan Meni i roditeljima svojim, Meni će se svi vratiti.",
                            "verse 31:15": "A ako te budu nagovarali da drugog Meni ravnim smatraš, onoga o kome ništa ne znaš, ti ih ne slušaj i prema njima se, na ovome svijetu, velikodušno ponašaj, a slijedi put onoga koji se iskreno Meni obraća; Meni ćete",
                            "verse 31:16": "O sinko moj, dobro ili zlo, teško koliko zrno gorušice, bilo u stijeni ili na nebesima ili u zemlji, Allah će na vidjelo iznijeti, jer Allah zna najskrivenije stvari, On je Sveznajući.",
                            "verse 31:17": "O sinko moj, obavljaj molitvu i traži da se čine dobra djela, a odvraćaj od hrđavih i strpljivo podnosi ono što te zadesi - dužnost je tako postupiti.",
                            "verse 31:18": "I, iz oholosti, ne okreći od ljudi lice svoje i ne idi zemljom nadmeno, jer Allah ne voli ni gordog ni hvalisavog.",
                            "verse 31:19": "U hodu budi odmjeren, a u govoru ne budi grlat; ta najneprijatniji glas je revanje magarca!\"",
                            "verse 31:20": "Kako ne vidite da vam je Allah omogućio da se koristite svim onim što postoji na nebesima i na Zemlji i da vas darežljivo obasipa milošću Svojom, i vidljivom i nevidljivom? A ima ljudi koji raspravljaju o Allahu bez ikakva znanja,",
                            "verse 31:21": "A kad im se govori: \"Slijedite ono što vam Allah objavljuje!\" - odgovaraju: \"Ne, mi slijedimo ono što smo zapamtili od predaka naših.\" Zar i onda kad ih šejtan poziva na patnju u ognju?!",
                            "verse 31:22": "Onaj ko se sasvim preda Allahu, a uz to čini dobra djela, uhvatio se za najčvršću vezu. Allahu se na koncu sve vraća.",
                            "verse 31:23": "A onaj koji ne vjeruje, pa, neka te ne zabrinjava nevjerovanje njegovo. Nama će se svi vratiti i Mi ćemo ih o onome šta su radili obavijestiti; Allahu su, uistinu, poznate svačije misli.",
                            "verse 31:24": "Mi im dajemo da kratko uživaju, a onda ćemo ih natjerati u patnju neizdržljivu.",
                            "verse 31:25": "A da ih upitaš: \"Ko je stvorio nebesa i Zemlju?\" - sigurno bi rekli: \"Allah!\" - a ti reci: \"Hvaljen neka je Allah!\" - samo što većina njih ne zna.",
                            "verse 31:26": "Allahovo je sve na nebesima i na Zemlji! Allah je, uistinu, nezavisan i hvale dostojan.",
                            "verse 31:27": "Da su sva stabla na Zemlji pisaljke, a da se u more, kad presahne, ulije još sedam mora, ne bi se ispisale Allahove riječi; Allah je, uistinu, silan i mudar.",
                            "verse 31:28": "Stvoriti sve vas i sve vas oživiti isto je kao stvoriti i oživiti jednoga čovjeka; Allah, zaista, sve čuje i sve vidi.",
                            "verse 31:29": "Kako ne vidiš da Allah uvodi noć u dan i uvodi dan u noć, i da je potčinio Sunce i Mjesec - svako se kreće do roka određenog - i da Allah dobro zna ono što radite?",
                            "verse 31:30": "To zato što je Allah - Istina, a oni kojima se, pored Njega, oni mole - neistina, i što je Allah uzvišen i velik.",
                            "verse 31:31": "Zar ne vidiš da lađe Allahovom milošću morem plove da bi vam pokazao neke dokaze Svoje? To su, zaista, pouke za sve strpljive i zahvalne.",
                            "verse 31:32": "A kad ih talas, kao oblak, prekrije, mole se Allahu iskreno Mu vjeru ispovijedajući; a čim ih On do kopna dovede, samo Mu neki zahvalni ostaju. A dokaze Naše samo izdajnik, nezahvalnik poriče.",
                            "verse 31:33": "O ljudi, bojte se Gospodara svoga i strahujte od Dana kod roditelj djetetu svome neće moći nimalo pomoći, niti će dijete moći svome roditelju imalo pomoći! Allahova prijetnja je istinita, pa neka vas nikako život na ovom",
                            "verse 31:34": "Samo Allah zna kad će Smak svijeta nastupiti, samo On spušta kišu i samo On zna šta je u matericama, a čovjek ne zna šta će sutra zaraditi i ne zna čovjek u kojoj će zemlji umrijeti; Allah, uistinu, sve zna i o"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "আলিফ-লাম-মীম।",
                            "verse 31:2": "এগুলো প্রজ্ঞাময় কিতাবের আয়াত।",
                            "verse 31:3": "হেদায়েত ও রহমত সৎকর্মপরায়ণদের জন্য।",
                            "verse 31:4": "যারা সালাত কায়েম করে, যাকাত দেয় এবং আখেরাত সম্পর্কে দৃঢ় বিশ্বাস রাখে।",
                            "verse 31:5": "এসব লোকই তাদের পরওয়ারদেগারের তরফ থেকে আগত হেদায়েতের উপর প্রতিষ্ঠিত এবং এরাই সফলকাম।",
                            "verse 31:6": "একশ্রেণীর লোক আছে যারা মানুষকে আল্লাহর পথ থেকে গোমরাহ করার উদ্দেশে অবান্তর কথাবার্তা সংগ্রহ করে অন্ধভাবে এবং উহাকে নিয়ে ঠাট্টা-বিদ্রূপ করে। এদের জন্য রয়েছে অবমাননাকর শাস্তি।",
                            "verse 31:7": "যখন ওদের সামনে আমার আয়তসমূহ পাঠ করা হয়, তখন ওরা দম্ভের সাথে এমনভাবে মুখ ফিরিয়ে নেয়, যেন ওরা তা শুনতেই পায়নি অথবা যেন ওদের দু’কান বধির। সুতরাং ওদেরকে কষ্টদায়ক আযাবের সংবাদ দাও।",
                            "verse 31:8": "যারা ঈমান আনে আর সৎকাজ করে তাদের জন্য রয়েছে নেয়ামতে ভরা জান্নাত।",
                            "verse 31:9": "সেখানে তারা চিরকাল থাকবে। আল্লাহর ওয়াদা যথার্থ। তিনি পরাক্রমশালী ও প্রজ্ঞাময়।",
                            "verse 31:10": "তিনি খুঁটি ব্যতীত আকাশমন্ডলী সৃষ্টি করেছেন; তোমরা তা দেখছ। তিনি পৃথিবীতে স্থাপন করেছেন পর্বতমালা, যাতে পৃথিবী তোমাদেরকে নিয়ে ঢলে না পড়ে এবং এতে ছড়িয়ে দিয়েছেন সর্বপ্রকার জন্তু। আমি আকাশ থেকে পানি বর্ষণ করেছি, অতঃপর তাতে উদগত করেছি সর্বপ্রকার কল্যাণকর উদ্ভিদরাজি।",
                            "verse 31:11": "এটা আল্লাহর সৃষ্টি; অতঃপর তিনি ব্যতীত অন্যেরা যা সৃষ্টি করেছে, তা আমাকে দেখাও। বরং জালেমরা সুস্পষ্ট পথভ্রষ্টতায় পতিত আছে।",
                            "verse 31:12": "আমি লোকমানকে প্রজ্ঞা দান করেছি এই মর্মে যে, আল্লাহর প্রতি কৃতজ্ঞ হও। যে কৃতজ্ঞ হয়, সে তো কেবল নিজ কল্যানের জন্যই কৃতজ্ঞ হয়। আর যে অকৃতজ্ঞ হয়, আল্লাহ অভাবমুক্ত, প্রশংসিত।",
                            "verse 31:13": "যখন লোকমান উপদেশচ্ছলে তার পুত্রকে বললঃ হে বৎস, আল্লাহর সাথে শরীক করো না। নিশ্চয় আল্লাহর সাথে শরীক করা মহা অন্যায়।",
                            "verse 31:14": "আর আমি মানুষকে তার পিতা-মাতার সাথে সদ্ব্যবহারের জোর নির্দেশ দিয়েছি। তার মাতা তাকে কষ্টের পর কষ্ট করে গর্ভে ধারণ করেছে। তার দুধ ছাড়ানো দু বছরে হয়। নির্দেশ দিয়েছি যে, আমার প্রতি ও তোমার পিতা-মতার প্রতি কৃতজ্ঞ হও। অবশেষে আমারই নিকট ফিরে আসতে হবে।",
                            "verse 31:15": "পিতা-মাতা যদি তোমাকে আমার সাথে এমন বিষয়কে শরীক স্থির করতে পীড়াপীড়ি করে, যার জ্ঞান তোমার নেই; তবে তুমি তাদের কথা মানবে না এবং দুনিয়াতে তাদের সাথে সদ্ভাবে সহঅবস্থান করবে। যে আমার অভিমুখী হয়, তার পথ অনুসরণ করবে। অতঃপর তোমাদের প্রত্যাবর্তন আমারই দিকে এবং তোমরা যা করতে, আমি সে বিষয়ে তোমাদেরকে জ্ঞাত করবো।",
                            "verse 31:16": "হে বৎস, কোন বস্তু যদি সরিষার দানা পরিমাণও হয় অতঃপর তা যদি থাকে প্রস্তর গর্ভে অথবা আকাশে অথবা ভূ-গর্ভে, তবে আল্লাহ তাও উপস্থিত করবেন। নিশ্চয় আল্লাহ গোপন ভেদ জানেন, সবকিছুর খবর রাখেন।",
                            "verse 31:17": "হে বৎস, নামায কায়েম কর, সৎকাজে আদেশ দাও, মন্দকাজে নিষেধ কর এবং বিপদাপদে সবর কর। নিশ্চয় এটা সাহসিকতার কাজ।",
                            "verse 31:18": "অহংকারবশে তুমি মানুষকে অবজ্ঞা করো না এবং পৃথিবীতে গর্বভরে পদচারণ করো না। নিশ্চয় আল্লাহ কোন দাম্ভিক অহংকারীকে পছন্দ করেন না।",
                            "verse 31:19": "পদচারণায় মধ্যবর্তিতা অবলম্বন কর এবং কন্ঠস্বর নীচু কর। নিঃসন্দেহে গাধার স্বরই সর্বাপেক্ষা অপ্রীতিকর।",
                            "verse 31:20": "তোমরা কি দেখ না আল্লাহ নভোমন্ডল ও ভূ-মন্ডলে যাকিছু আছে, সবই তোমাদের কাজে নিয়োজিত করে দিয়েছেন এবং তোমাদের প্রতি তাঁর প্রকাশ্য ও অপ্রকাশ্য নেয়ামতসমূহ পরিপূর্ন করে দিয়েছেন? এমন লোক ও আছে; যারা জ্ঞান, পথনির্দেশ ও উজ্জল কিতাব ছাড়াই আল্লাহ সম্পর্কে বাকবিতন্ডা করে।",
                            "verse 31:21": "তাদেরকে যখন বলা হয়, আল্লাহ যা নাযিল করেছেন, তোমরা তার অনুসরণ কর, তখন তারা বলে, বরং আমরা আমাদের পূর্বপুরুষদেরকে যে বিষয়ের উপর পেয়েছি, তারই অনুসরণ করব। শয়তান যদি তাদেরকে জাহান্নামের শাস্তির দিকে দাওয়াত দেয়, তবুও কি?",
                            "verse 31:22": "যে ব্যক্তি সৎকর্মপরায়ণ হয়ে স্বীয় মুখমন্ডলকে আল্লাহ অভিমূখী করে, সে এক মজবুত হাতল ধারণ করে, সকল কর্মের পরিণাম আল্লাহর দিকে।",
                            "verse 31:23": "যে ব্যক্তি কুফরী করে তার কুফরী যেন আপনাকে চিন্তিত না করে। আমারই দিকে তাদের প্রত্যাবর্তন, অতঃপর আমি তাদের কর্ম সম্পর্কে তাদেরকে অবহিত করব। অন্তরে যা কিছু রয়েছে, সে সম্পর্কে আল্লাহ সবিশেষ পরিজ্ঞাত।",
                            "verse 31:24": "আমি তাদেরকে স্বল্পকালের জন্যে ভোগবিলাস করতে দেব, অতঃপর তাদেরকে বাধ্য করব গুরুতর শাস্তি ভোগ করতে।",
                            "verse 31:25": "আপনি যদি তাদেরকে জিজ্ঞেস করেন, নভোমন্ডল ও ভূ-মন্ডল কে সৃষ্টি করেছে? তারা অবশ্যই বলবে, আল্লাহ। বলুন, সকল প্রশংসাই আল্লাহর। বরং তাদের অধিকাংশই জ্ঞান রাখে না।",
                            "verse 31:26": "নভোমন্ডল ও ভূ-মন্ডলে যা কিছু রয়েছে সবই আল্লাহর। আল্লাহ অভাবমুক্ত, প্রশংসিত।",
                            "verse 31:27": "পৃথিবীতে যত বৃক্ষ আছে, সবই যদি কলম হয় এবং সমুদ্রের সাথেও সাত সমুদ্র যুক্ত হয়ে কালি হয়, তবুও তাঁর বাক্যাবলী লিখে শেষ করা যাবে না। নিশ্চয় আল্লাহ পরাক্রমশালী, প্রজ্ঞাময়।",
                            "verse 31:28": "তোমাদের সৃষ্টি ও পুনরুত্থান একটি মাত্র প্রাণীর সৃষ্টি ও পুনরুত্থানের সমান বৈ নয়। নিশ্চয় আল্লাহ সব কিছু শোনেন, সবকিছু দেখেন।",
                            "verse 31:29": "তুমি কি দেখ না যে, আল্লাহ রাত্রিকে দিবসে প্রবিষ্ট করেন এবং দিবসকে রাত্রিতে প্রবিষ্ট করেন? তিনি চন্দ্র ও সূর্যকে কাজে নিয়োজিত করেছেন। প্রত্যেকেই নির্দিষ্টকাল পর্যন্ত পরিভ্রমণ করে। তুমি কি আরও দেখ না যে, তোমরা যা কর, আল্লাহ তার খবর রাখেন?",
                            "verse 31:30": "এটাই প্রমাণ যে, আল্লাহ-ই সত্য এবং আল্লাহ ব্যতীত তারা যাদের পূজা করে সব মিথ্যা। আল্লাহ সর্বোচ্চ, মহান।",
                            "verse 31:31": "তুমি কি দেখ না যে, আল্লাহর অনুগ্রহে জাহাজ সমুদ্রে চলাচল করে, যাতে তিনি তোমাদেরকে তাঁর নিদর্শনাবলী প্রদর্শন করেন? নিশ্চয় এতে প্রত্যেক সহনশীল, কৃতজ্ঞ ব্যক্তির জন্যে নিদর্শন রয়েছে।",
                            "verse 31:32": "যখন তাদেরকে মেঘমালা সদৃশ তরংগ আচ্ছাদিত করে নেয়, তখন তারা খাঁটি মনে আল্লাহকে ডাকতে থাকে। অতঃপর তিনি যখন তাদেরকে স্থলভাগের দিকে উদ্ধার করে আনেন, তখন তাদের কেউ কেউ সরল পথে চলে। কেবল মিথ্যাচারী, অকৃতজ্ঞ ব্যক্তিই আমার নিদর্শনাবলী অস্বীকার করে।",
                            "verse 31:33": "হে মানব জাতি! তোমরা তোমাদের পালনকর্তাকে ভয় কর এবং ভয় কর এমন এক দিবসকে, যখন পিতা পুত্রের কোন কাজে আসবে না এবং পুত্রও তার পিতার কোন উপকার করতে পারবে না। নিঃসন্দেহে আল্লাহর ওয়াদা সত্য। অতএব, পার্থিব জীবন যেন তোমাদেরকে ধোঁকা না দেয় এবং আল্লাহ সম্পর্কে প্রতারক শয়তানও যেন তোমাদেরকে প্রতারিত না করে।",
                            "verse 31:34": "নিশ্চয় আল্লাহর কাছেই কেয়ামতের জ্ঞান রয়েছে। তিনিই বৃষ্টি বর্ষণ করেন এবং গর্ভাশয়ে যা থাকে, তিনি তা জানেন। কেউ জানে না আগামীকল্য সে কি উপার্জন করবে এবং কেউ জানে না কোন দেশে সে মৃত্যুবরণ করবে। আল্লাহ সর্বজ্ঞ, সর্ববিষয়ে সম্যক জ্ঞাত।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 31:1": "Алиф. Лам. Мим.",
                            "verse 31:2": "Тези са знаменията на мъдрата Книга -",
                            "verse 31:3": "напътствие и милост за благодетелните,",
                            "verse 31:4": "които отслужват молитвата и дават милостинята закат, и за отвъдния живот са убедени.",
                            "verse 31:5": "Тези са напътени от своя Господ и тези са сполучилите.",
                            "verse 31:6": "А сред хората някой купува слова за забавление, за да отклонява в неведение от пътя на Аллах и да го взимат на присмех. За тези има унизително мъчение.",
                            "verse 31:7": "И когато Нашите знамения му биват четени, той се отвръща високомерно, сякаш не ги чува, сякаш е оглушал. Възвести го за болезнено мъчение!",
                            "verse 31:8": "За онези, които вярват и вършат праведни дела, са Градините на блаженството,",
                            "verse 31:9": "там ще пребивават вечно - истинно обещание от Аллах. Той е Всемогъщия, Премъдрия.",
                            "verse 31:10": "Сътвори Той небесата без видима за вас опора и положи върху земята непоклатими планини, за да не се люлее с вас, и пръсна по нея всякакви животни. И изсипваме вода от небето, и караме с нея да поникват всякакви полезни видове.",
                            "verse 31:11": "Това е творението на Аллах. Покажете Ми какво са сътворили другите, а не Той! Да, угнетителите са в явна заблуда.",
                            "verse 31:12": "И дадохме на Лукман мъдростта: Бъди признателен на Аллах! Който е признателен, за себе си е признателен. А който е неблагодарен - Аллах е над всяка нужда, всеславен.",
                            "verse 31:13": "И рече Лукман на сина си, поучавайки го: О, синко мой, не съдружавай с Аллах! Съдружаването е огромен гнет.",
                            "verse 31:14": "И повелихме на човека да се отнася добре с родителите си... Носи го майка му в слабост връз слабост и го отбива в две години. Бъди признателен на Мен и на родителите си! Завръщането е при Мен.",
                            "verse 31:15": "А ако те принуждават да съдружаваш с Мен онова, за което нямаш знание, не им се покорявай! И бъди добър с тях в земния живот, и следвай пътя на онзи, който се е насочил към Мен! После вашето завръщане е към Мен и ще ви известя какво сте вършили.",
                            "verse 31:16": "О, синко мой, всяко твое дело, дори и да е с тежест на синапено зърно, и то да е в скала, или да е на небесата, или на земята, Аллах ще го покаже. Аллах е всепроникващ, сведущ.",
                            "verse 31:17": "О, синко мой, отслужвай молитвата и повелявай одобряваното, и възбранявай порицаваното, и бъди търпелив към онова, което те сполети! Това е от решителните дела.",
                            "verse 31:18": "И не криви лице пред хората, и не върви по земята с високомерие! Аллах не обича никой горделивец, самохвалец.",
                            "verse 31:19": "И бъди умерен в своята походка, и снижавай своя глас! Най-противният от гласовете е магарешкият глас.",
                            "verse 31:20": "Не виждате ли, че Аллах подчинява за вас всичко на небесата и всичко на земята, и щедро ви дава Своята благодат - и явна, и скрита? А някои от хората спорят за Аллах, без да имат нито знание, нито напътствие, нито просветляващо писание.",
                            "verse 31:21": "И когато им се каже: Следвайте онова, което Аллах е низпослал!, казват: Не, ще следваме онова, с което заварихме предците си. Ала нима и ако сатаната ги е зовял към мъчението на Пламъците?",
                            "verse 31:22": "А който се отдава на Аллах и благодетелства, той се е хванал за най-здравата връзка. При Аллах е завръщането на делата.",
                            "verse 31:23": "А който не вярва, да не те наскърбява неверието му! Към Нас е тяхното завръщане и ще им известим какво са вършили. Аллах знае съкровеното в сърцата.",
                            "verse 31:24": "Даваме им да се насладят малко, после ще ги подкараме към тежко мъчение.",
                            "verse 31:25": "И ако ги попиташ кой е сътворил небесата и земята, непременно ще рекат: Аллах! Кажи: Слава на Аллах! Ала повечето от тях не съзнават.",
                            "verse 31:26": "На Аллах е всичко на небесата и на земята. Аллах е Пребогатия, Всеславния.",
                            "verse 31:27": "И ако всички дървета на земята станат калеми, и в морето придойдат още седем морета [мастило], няма да се изчерпят Словата на Аллах. Аллах е всемогъщ, премъдър.",
                            "verse 31:28": "Вашето сътворяване и вашето възкресяване е само като на една душа. Аллах е всечуващ, всезрящ.",
                            "verse 31:29": "Нима не виждаш, че Аллах въвежда нощта в деня и въвежда деня в нощта, и подчинява слънцето и луната, всяко да се движи до определен срок, и че за вашите дела Аллах е сведущ?",
                            "verse 31:30": "Така е, защото Аллах е Истината и защото всичко, което зоват вместо Него, е лъжа, и защото Аллах е Всевишния, Превеликия.",
                            "verse 31:31": "Нима не виждаш, че корабите плават по морето с милостта на Аллах, за да ви покаже Той от Своите знамения? В това има знамения за всеки многотърпелив, признателен.",
                            "verse 31:32": "И щом ги покрият вълни като сенчести планини, те зоват Аллах, предани Нему в религията. А щом Той ги спаси на сушата, някои от тях са въздържани. Отрича Нашите знамения не друг, а всеки изменник, неблагодарник.",
                            "verse 31:33": "О, хора, бойте се от вашия Господ и се страхувайте от Деня, в който родител не ще бъде от полза за своята рожба, нито детето ще бъде от полза за своя родител! Обещанието на Аллах е истинно. И никога да не ви подмами земният живот, и никога най-измамният да не ви подмами за Аллах!",
                            "verse 31:34": "Единствено при Аллах е знанието за Часа. Той изсипва дъжда и знае какво има в утробите. И никой не знае какво ще придобие утре, и никой не знае къде ще умре. Аллах е всезнаещ, сведущ."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "艾列弗，倆目，米目。",
                            "verse 31:2": "這些是有智慧的經典的節文，",
                            "verse 31:3": "是行善者的向導和恩惠。",
                            "verse 31:4": "行善者，謹守拜功，完納天課，且確信後世。",
                            "verse 31:5": "這等人，是遵守他們的主的正道的，這等人確是成功的。",
                            "verse 31:6": "有人購買無謂的談話，以便他無知無識地使人背離真主的正道，而且把它當作笑柄。這等人，將受凌辱的刑罰。",
                            "verse 31:7": "有人對他宣讀我的蹟象的時候，他自大地退避，彷彿沒有聽見一樣，彷彿他的兩耳重聽一樣。你以痛苦的刑罰，向他報喜吧。",
                            "verse 31:8": "信道而且行善者，必將享受極樂園，",
                            "verse 31:9": "而永居其中。這是真主的真實的應許，他確是萬能的，確是至睿的。",
                            "verse 31:10": "他創造諸天，而不用你們所能見的支柱；他在大地上安置許多山岳，以免大地動搖，使你們不安；他在大地上散布各種動物。他從雲中降下雨水，而在大地上滋生各種優良的植物。",
                            "verse 31:11": "這是真主所創造的，你們指示我吧，你們捨真主而崇拜的（偶像〕究竟創造了甚麼呢？不然，不義的人是在明顯的迷誤中的。",
                            "verse 31:12": "我確已把智慧賞賜魯格曼，（我說）：「你當感謝真主。感謝的人，只為自己而感謝，孤負的人，須知真主確是無求的，確是可頌的。」",
                            "verse 31:13": "當日，魯格曼曾教訓他的兒子說：「我的小子啊！你不要以任何物配主。以物配主，確是大逆不道的。」",
                            "verse 31:14": "我曾命人孝敬父母——他母親弱上加弱地懷著他，他的斷乳，是在兩年之中——（我說）：「你應當感謝我和你的父母；惟我是最後的歸宿。",
                            "verse 31:15": "如果他倆勒令你以你所不知道的東西配我，那麼，你不要服從他倆，在今世，你應當依禮義而奉事他倆，你應當遵守歸依我者的道路；惟我是你們的歸宿，我要把你們的行為告訴你們。」",
                            "verse 31:16": "魯格曼說：「我的小子啊！善惡的行為，雖小如芥子，隱藏在磐石裡，或在天空中，或在地底下，真主都要顯示它。真主確是明察的，確是徹知的。",
                            "verse 31:17": "我的小子啊！你應當謹守拜功，應當勸善戒惡，應當忍受患難，這確是應該決心做的事情。",
                            "verse 31:18": "你不要為藐視眾人而轉臉，不要洋洋得意地在大地上行走，真主確是不喜愛一切傲慢者、矜誇者的。",
                            "verse 31:19": "你應當節制你的步伐，你應當抑制你的聲音；最討厭的聲音，確是驢子的聲音。」",
                            "verse 31:20": "難道你們不知道嗎？真主曾為你們制服天地間的一切，他博施你們表裡的恩惠。有人爭論真主的德性，但他們既無知識，又無向導，且無燦爛的經典。",
                            "verse 31:21": "如果有人對他們說：「你們應當遵守真主所降示的（經典）。」他們就說：「不然，我們遵守我們祖先的遺教。」即使惡魔叫他們去受烈火的刑罰，（他們仍要遵循）嗎？",
                            "verse 31:22": "誠心歸順真主而且常行善事者，確已把握住堅固的把柄。萬事的結局，只歸真主。",
                            "verse 31:23": "不信道者，你不要為他們的不信而憂愁，他們只歸於我，我要把他們的行為告訴他們。真主確是全知他們的胸懷的。",
                            "verse 31:24": "我使他們稍稍享受幸福，然後，強迫他們去受嚴厲的刑罰。",
                            "verse 31:25": "如果你問他們：「誰創造了大地？」他們必定說：「真主。」你說：「一切讚頌，全歸真主！」不然，他們大半不知道。",
                            "verse 31:26": "天地萬物只是真主的，真主確是無求的，確是可頌的。",
                            "verse 31:27": "假若用大地上所有的樹來制成筆，用海水作墨汁，再加上七海的墨汁，終不能寫盡真主的言語。真主確是萬能的，確是至睿的。",
                            "verse 31:28": "創造你們和復活你們，只像創造一個人和復活一個人一祥。真主確是全聰的，確是全明的。",
                            "verse 31:29": "道你不知道嗎？真主使黑夜侵入白晝，使白晝侵入黑夜，並制服日月，各自運行，至一定期。真主是徹知你們的行為的。",
                            "verse 31:30": "那是因為真主確是真實的；他們捨他而祈禱的，確是虛偽的；真主確是至尊的，確是至大的。",
                            "verse 31:31": "難道你不知道嗎？船舶在海中帶著真主的恩惠而航行，以便他指示你們他的一部分蹟象，對於每個堅忍的、感謝的人，此中確有許多蹟象。",
                            "verse 31:32": "當山岳般的波濤籠罩他們的時候，他們虔誠地祈禱真主，當他使他們平安登陸的時候，他們中有中和的人；只有每個狡猾的、孤恩的人，否認我的蹟象。",
                            "verse 31:33": "人們啊！你們應當敬畏你們的主，你們應當畏懼那一日，父親對於兒子毫無裨益，兒子對於父親也毫無裨益。真主的應許，確是真實的，絕不要讓今世的生活欺騙你們，絕不要讓猾賊以真主的容忍欺騙你們。",
                            "verse 31:34": "在真主那裡，的確有關於復活時的知識，他常降及時雨，他知道胎兒的（性別）；而任何人都不知道自己明日將做甚麼事，任何人都不知道自己將死在甚麼地方。真主確是全知的，確是徹知的。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Alif lám mím!",
                            "verse 31:2": "Toto jsou znamení Písma moudrého,",
                            "verse 31:3": "vedení i milosrdenství pro ty, kdož dobro konají,",
                            "verse 31:4": "kdož modlitby dodržují, almužny dávají a v život posmrtný pevně doufají.",
                            "verse 31:5": "Tito jsou Pánem svým dobře vedeni a ti budou blažení.",
                            "verse 31:6": "Mezi lidmi je i jeden, jenž bez jakéhokoliv vědění zábavné povídání nakupuje, aby tak svedl lidi z cesty Boží, z níž posměšky si tropí - a to jsou ti, kteří se trestu zahanbujícího dočkají",
                            "verse 31:7": "Když jsou takovému přednášena Naše znamení, tu odvrací se domýšlivě, jako by je ani neslyšel a jako by měl v uších svých hluchotu - tomu oznam, že čeká jej trest bolestný.",
                            "verse 31:8": "Pro ty však, kdož uvěřili a zbožné skutky konali, zahrady slastí jsou připraveny,",
                            "verse 31:9": "v nichž budou nesmrtelní, a tehdy slib Boží se uskuteční a On mocný je i moudrý.",
                            "verse 31:10": "On stvořil nebesa bez opor, jež jsou viditelné, a rozhodil po zemi hory pevně zakotvené, aby se s vámi nekymácela. A rozšířil po ní zvířata rozličná. A seslali jsme z nebes vodu a dali jsme z ní vyrůst všem druhům rostlin štědrých.",
                            "verse 31:11": "Toto je stvoření Boží a nyní mi ukažte, co vlastně stvořila božstva, jež vedle Něho máte. Ano, nespravedliví jsou věru v bludu zjevném!",
                            "verse 31:12": "Kdysi jsme darovali Luqmánovi moudrost řkouce: \"Buď vděčný Bohu, neboť ten, kdo vděčný je Bohu, je vděčný pro dobro své vlastní. Kdo však je nevděčný... tedy Bůh soběstačný je i chvályhodný.\"",
                            "verse 31:13": "Pravil Luqmán synu svému napomínaje jej: \"Synáčku, nepřidružuj nic k Bohu, vždyť přidružování je věru křivda nesmírná.\"",
                            "verse 31:14": "A uložili jsme člověku laskavost k rodičům jeho - neb nosila jej matka jeho se samými nesnázemi a odstavila jej po dvou letech - řkouce: \"Buď vděčný Mně i rodičům svým neb u Mne je cíl konečný!\"",
                            "verse 31:15": "Nutí-li tě však usilovně, abys ke Mě přidružoval něco, o čem nemáš vědění žádné, pak je neposlouchej! Buď k nim na tomto světě laskavý podle zvyklosti uznané, avšak následuj cestu těch, kdož kajícně se ke Mně obrátili! Ke Mně se pak uskuteční návrat váš a Já vás poučím o tom, co jste konali.",
                            "verse 31:16": "... Synáčku, i kdyby to byla váha zrnka hořčičného a i kdyby to bylo ve skále či na nebi anebo na zemi, Bůh to přinese! Vždyť Bůh věru bystrý je i dobře zpravený.",
                            "verse 31:17": "Synáčku, dodržuj modlitbu, přikazuj vhodné a zakazuj zavrženíhodné! Buď trpělivý vůči tomu, co tě postihne, neboť to patří k podstatě věci!",
                            "verse 31:18": "Neodvracej tvář svou od lidí a nechoď nadutě po zemi, neboť Bůh věru nemiluje domýšlivé vychloubače!",
                            "verse 31:19": "Buď umírněný v chůzi své a ztišuj hlas svůj, vždyť nejodpornější z hlasů všech je věru hlas oslů.\"",
                            "verse 31:20": "Což nevidíte, že Bůh vám podmanil vše, co je na nebesích a na zemi, a že zahrnul vás dobrodiním Svým zjevným i skrytým? Však mezi lidmi jsou někteří, kdož ohledně Boha se hádají bez jakýchkoliv znalostí či vedení anebo Písma osvíceného.",
                            "verse 31:21": "A když je jim řečeno: \"Následujte to, co seslal Bůh!\", odpovídají: \"Nikoliv, my budeme následovat to, co u otců svých jsme nalezli.\" A což když je satan zve k trestu plamene šlehajícího?",
                            "verse 31:22": "Ten, kdo se odevzdal do vůle Boží a koná dobré skutky, ten chopil se rukojeti nejspolehlivější a Bohu patří konečné rozhodnutí.",
                            "verse 31:23": "Nechť tě nermoutí nevíra těch, kdož neuvěřili! K Nám se uskuteční návrat jejich a poučíme je již o tom, co konali - vždyť Bůh dobře ví, co hrudi skrývají.",
                            "verse 31:24": "Necháváme je užívat trochu radostí, ale potom je podrobíme trestu přísnému.",
                            "verse 31:25": "Když se jich zeptáš: \"Kdo stvořil nebesa a zemi?\", jistě odpoví: \"Bůh.\" Rci: \"Chvála Bohu!\" Však většina z nich nic neví.",
                            "verse 31:26": "Bohu náleží vše, co na nebesích je i na zemi, a Bůh věru je soběstačný, chvályhodný.",
                            "verse 31:27": "Kdyby všechno stromoví, jež je na zemi, bylo pery, a kdyby moře, rozmnožené ještě o sedm moří, bylo inkoustem, nevyčerpala by se nikdy slova Boží - a Bůh mocný je i moudrý.",
                            "verse 31:28": "Vaše stvoření i vaše vzkříšení je pro Něj jen jako stvoření a vzkříšení duše jediné - a Bůh zajisté je slyšící i vidoucí.",
                            "verse 31:29": "Což nevidíš, že Bůh dává přejít noci v den a dni v noc - a podmanil si slunce a měsíc, takže obě tělesa směřují ke lhůtě stanovené a že Bůh dobře je zpraven o všem, co konáte!",
                            "verse 31:30": "A je to proto, že Bůh je skutečnost, zatímco to, co vzýváte vedle Něho, je falešné - a Bůh věru je vznešený i veliký.",
                            "verse 31:31": "Což nevidíš, že lodi plují po moři díky dobrodiní Božímu a proto, aby vám ukázal některá ze Svých znamení? A věru jsou v tom znamení pro každého člověka trpělivého, vděčného.",
                            "verse 31:32": "A když zahalí je vlny jako temnota, vzývají Boha a zasvěcují mu upřímnou svou víru, a když zachrání je na souši, tu někteří z nich k Němu směřují... A popírat znamení Naše může jedině nevděčník proradný!",
                            "verse 31:33": "Lidé, bojte se Pána svého a obávejte se dne, kdy otec nevykoupí syna svého a syn nevykoupí ničím otce svého. Slib Boží se věru uskuteční, nechť vás tedy neoklame život pozemský a nechť vás nepodvede podvodník žádný ohledně Boha!",
                            "verse 31:34": "Jen u Boha je vědění o příchodu Hodiny. On déšť hojný sesílá a ví, co skryto je v lůnech, zatímco duše žádná nezná, co si zítra vyslouží, a žádná neví, ve které zemře zemi. Bůh věru je vševědoucí a dobře zpravený!"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Alif Laam Miem.",
                            "verse 31:2": "Dit zijn verzen van het Boek vol van Wijsheid.",
                            "verse 31:3": "Een leiding en een genade voor de goeden.",
                            "verse 31:4": "Zij, die het Gebed naleven en de Zakaat betalen, en die in het Hiernamaals vast geloven,",
                            "verse 31:5": "Zij zijn het, die de leiding van hun Heer volgen, en zij zullen slagen.",
                            "verse 31:6": "En onder de mensen is iemand die door ijdele praatjes zonder kennis (anderen) van God’s pad wil doen afdwalen en er mee de spot drijft; voor zulken zal er een vernederende straf zijn.",
                            "verse 31:7": "En wanneer Onze woorden aan hem worden voorgedragen, wendt hij zich verachtelijk af alsof hij ze niet hoorde en zijn oren verstopt waren. Kondig hem daarom een pijnlijke straf aan.",
                            "verse 31:8": "Voorzeker, die geloven en goede werken doen, zullen gezegende tuinen hebben,",
                            "verse 31:9": "Waarin zij zullen vertoeven, zo is God’s Belofte; Hij is de Almachtige, de Alwijze.",
                            "verse 31:10": "Hij heeft de hemelen geschapen zonder enige voor u zichtbare pilaren en Hij heeft op aarde hechte bergen gemaakt opdat zij niet beven met u, en Hij heeft er allerlei dieren over verspreid. Wij hebben water uit de wolken nedergezonden en hebben allerlei edele soorten daarin (de aarde) doen groeien.",
                            "verse 31:11": "Dit is de Schepping van God. Toont mij nu wat degenen hebben geschapen die naast Hem (worden gesteld). Neen, de onrechtvaardigen verkeren klaarblijkelijk in dwaling.",
                            "verse 31:12": "En Wij schonken wijsheid aan Loqmaan, zeggende: \"Wees God dankbaar, want hij die dankbaar is, is dankbaar voor zichzelf, en die ondankbaar is: God is Zichzelf-genoeg, Geprezen.",
                            "verse 31:13": "Toen Loqmaan tot zijn zoon, terwijl hij hem raad gaf, zeide: \"O mijn lieve zoon, ken geen medegoden aan God toe; afgoderij is inderdaad een grote ongerechtigheid.\"",
                            "verse 31:14": "Wij hebhen de mens op het hart gedrukt betreffende zijn ouders, zijn moeder droeg hem in zwakte op zwakte, en zijn zogen nam twee jaren in beslag. Zeg Mij en uw ouders dank, tot Mij is de terugkeer.",
                            "verse 31:15": "Maar indien (uw ouders) trachten u iets met Mij te doen vereenzelvigen, waarvan gij geen kennis hebt, gehoorzaam hen niet. Doch leef met hen samen in de wereld op een behoorlijke wijze en volg de weg van hem die zich tot Mij richt. Dan zult gij tot Mij terugkeren en Ik zal u inlichten over hetgeen gij deedt. -",
                            "verse 31:16": "\"O mijn lieve zoon! Al zou het het gewicht van een mosterdzaadje zijn, en al zou het zich in een rots bevinden of in de hemelen of op aarde, God zal het zeker openbaar maken. Voorwaar, God is Aldoordringend, Alkennend.",
                            "verse 31:17": "O mijn lieve zoon, verricht het gebed en beveel het goede aan en verbied het kwade en verdraag geduldig wat u ook overkome. Dit is een ernstige zaak.",
                            "verse 31:18": "En keer uw gelaat niet (in verachting) van de mensen af noch wandel in hoogmoed op aarde; want God heeft de hoogmoedige noch de pocher lief.",
                            "verse 31:19": "En loop met gewone stap en verzacht uw stem; want de meest onaangename stem is het gebalk van een ezel.\"",
                            "verse 31:20": "Hebt gij niet gezien, dat God alles wat in de hemelen en op aarde is in uw dienst heeft gesteld en Zijn gunsten rijkelijk aan u heeft geschonken, zowel uiterlijk als innerlijk? En onder de mensen zijn er, die over God twisten, zonder kennis of enige leiding of een verlichtend Boek.",
                            "verse 31:21": "En als er tot hen wordt gezegd: \"Volgt hetgeen God heeft geopenbaard,\" zeggen zij: \"Neen, wij zullen datgene volgen wat wij onze vaderen zagen volgen.\" Zelfs al zou Satan hen tot de straf van het branden hebben uitgenodigd?",
                            "verse 31:22": "Maar hij, die zich aan God onderwerpt en het goede doet, heeft inderdaad een sterk houvast gegrepen. Bij God rust het einde aller dingen.",
                            "verse 31:23": "En zij die niet geloven, laat hun ongeloof u niet verdrieten. Tot Ons zullen zij wederkeren en Wij zullen hen inlichten over wat zij deden; God weet heel goed wat in hun innerlijk is.",
                            "verse 31:24": "Wij zullen hen voor een poosje zich laten vermaken; daarna zullen Wij hen tot een strenge straf voortdrijven.",
                            "verse 31:25": "En als gij hun vraagt: \"Wie schiep de hemelen en de aarde?\" zullen zij gewis antwoorden: \"God\". Zeg: \"Alle roem behoort aan God.\" Maar de meesten hunner weten het niet.",
                            "verse 31:26": "Aan God behoort al hetgeen in de hemelen en op aarde is, voorzeker God is Zichzelf-genoeg, Geprezen.",
                            "verse 31:27": "En als alle bomen op aarde pennen waren en de oceaan, met nog zeven oceanen aangevuld (inkt was), de woorden van God zouden niet kunnen worden uitgeput. Voorwaar, God is Almachtig, Alwijs.",
                            "verse 31:28": "O mensen uw Schepping en uw Opstanding zijn slechts als die van een enkele ziel. Voorwaar, God is Alhorend, Alziende.",
                            "verse 31:29": "Hebt gij niet gezien, dat God de nacht in de dag doet overgaan en de dag in de nacht en dat hij de zon en de maan in dienst heeft gesteld? Elk loopt voor een vastgestelde tijd; God is goed op de hoogte van hetgeen gij doet.",
                            "verse 31:30": "Dit is omdat God de Waarheid en wat zij naast Hem aanroepen vals is, en omdat God de Verhevene, de Grote is.",
                            "verse 31:31": "Hebt gij niet gezien, dat de schepen op zee varen door de gunst van God, opdat Hij u Zijn tekenen moge tonen? Voorzeker daarin zijn tekenen voor een ieder, die geduldig en dankbaar is.",
                            "verse 31:32": "En wanneer de golven hen als schaduwen omhullen, roepen zij God oprecht zijnde in gehoorzaamheid aan; maar wanneer Hij hen veilig aan land brengt, volgen slechts enigen hunner de rechte weg. En niemand verloochent Onze tekenen behalve de trouweloze, de ondankbare.",
                            "verse 31:33": "O mensen, vreest uw Heer, en ducht de Dag waarop geen vader zijn zoon iets zal baten, noch de zoon zijn vader van enig nut zal kunnen zijn. God’s belofte is zeker waar. Laat daarom het wereldse leven u niet misleiden, noch laat de Verleider u omtrent God bedriegen.",
                            "verse 31:34": "Voorwaar, God alleen bezit de kennis van het Uur. Hij zendt de regen neder en Hij weet wat zich in de baarmoeder bevindt. Geen ziel weet wat zij morgen zal doen, en geen ziel weet in welk land zij zal sterven. Voorwaar, God is Alwetend, Alkennend."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 31:1": "Alif. Lam. Mim.",
                            "verse 31:2": "These are revelations of the wise Scripture,",
                            "verse 31:3": "A guidance and a mercy for the good,",
                            "verse 31:4": "Those who establish worship and pay the poor-due and have sure faith in the Hereafter.",
                            "verse 31:5": "Such have guidance from their Lord. Such are the successful.",
                            "verse 31:6": "And of mankind is he who payeth for mere pastime of discourse, that he may mislead from Allah’s way without knowledge, and maketh it the butt of mockery. For such there is a shameful doom.",
                            "verse 31:7": "And when Our revelations are recited unto him he turneth away in pride as if he heard them not, as if there were a deafness in his ears. So give him tidings of a painful doom.",
                            "verse 31:8": "Lo! those who believe and do good works, for them are the gardens of delight,",
                            "verse 31:9": "Wherein they will abide. It is a promise of Allah in truth. He is the Mighty, the Wise.",
                            "verse 31:10": "He hath created the heavens without supports that ye can see, and hath cast into the earth firm hills, so that it quake not with you; and He hath dispersed therein all kinds of beasts. And We send down water from the sky and We cause (plants) of every goodly kind to grow therein.",
                            "verse 31:11": "This is the Creation of Allah. Now show me that which those (ye worship) beside Him have created. Nay, but the wrong-doers are in error manifest!",
                            "verse 31:12": "And verily We gave Luqman wisdom, saying: Give thanks unto Allah; and whosoever giveth thanks, he giveth thanks for (the good of) his soul. And whosoever refuseth - Lo! Allah is Absolute, Owner of Praise.",
                            "verse 31:13": "And (remember) when Luqman said unto his son, when he was exhorting him: O my dear son! Ascribe no partners unto Allah. Lo! to ascribe partners (unto Him) is a tremendous wrong -",
                            "verse 31:14": "And We have enjoined upon man concerning his partners - His mother beareth him in weakness upon weakness, and his weaning is in two years - Give thanks unto Me and unto thy parents. Unto Me is the journeying.",
                            "verse 31:15": "But if they strive with thee to make thee ascribe unto Me as partner that of which thou hast no knowledge, then obey them not. Consort with them in the world kindly, and follow the path of him who repenteth unto Me. Then unto Me will be your return, and I shall tell you what ye used to do -",
                            "verse 31:16": "O my dear son! Lo! though it be but the weight of a grain of mustard-seed, and though it be in a rock, or in the heavens, or in the earth, Allah will bring it forth. Lo! Allah is Subtile, Aware.",
                            "verse 31:17": "O my dear son! Establish worship and enjoin kindness and forbid iniquity, and persevere whatever may befall thee. Lo! that is of the steadfast heart of things.",
                            "verse 31:18": "Turn not thy cheek in scorn toward folk, nor walk with pertness in the land. Lo! Allah loveth not each braggart boaster.",
                            "verse 31:19": "Be modest in thy bearing and subdue thy voice. Lo! the harshest of all voices is the voice of the ass.",
                            "verse 31:20": "See ye not how Allah hath made serviceable unto you whatsoever is in the skies and whatsoever is in the earth and hath loaded you with His favours both without and within ? Yet of mankind is he who disputeth concerning Allah, without knowledge or guidance or a scripture giving light.",
                            "verse 31:21": "And if it be said unto them: Follow that which Allah hath revealed, they say: Nay, but we follow that wherein we found our fathers. What! Even though the devil were inviting them unto the doom of flame ?",
                            "verse 31:22": "Whosoever surrendereth his purpose to Allah while doing good, he verily hath grasped the firm hand-hold. Unto Allah belongeth the sequel of all things.",
                            "verse 31:23": "And whosoever disbelieveth, let not his disbelief afflict thee (O Muhammad). Unto Us is their return, and We shall tell them what they did. Lo! Allah is Aware of what is in the breasts (of men).",
                            "verse 31:24": "We give them comfort for a little, and then We drive them to a heavy doom.",
                            "verse 31:25": "If thou shouldst ask them: Who created the heavens and the earth ? they would answer: Allah. Say: Praise be to Allah! But most of them know not.",
                            "verse 31:26": "Unto Allah belongeth whatsoever is in the heavens and the earth. Lo! Allah, He is the Absolute, the Owner of Praise.",
                            "verse 31:27": "And if all the trees in the earth were pens, and the sea, with seven more seas to help it, (were ink), the words of Allah could not be exhausted. Lo! Allah is Mighty, Wise.",
                            "verse 31:28": "Your creation and your raising (from the dead) are only as (the creation and the raising of) a single soul. Lo! Allah is Hearer, Knower.",
                            "verse 31:29": "Hast thou not seen how Allah causeth the night to pass into the day and causeth the day to pass into the night, and hath subdued the sun and the moon (to do their work), each running unto an appointed term; and that Allah is Informed of what ye do ?",
                            "verse 31:30": "That (is so) because Allah, He is the True, and that which they invoke beside Him is the False, and because Allah, He is the Sublime, the Great.",
                            "verse 31:31": "Hast thou not seen how the ships glide on the sea by Allah’s grace, that He may show you of His wonders ? Lo! therein indeed are portents for every steadfast, grateful (heart).",
                            "verse 31:32": "And if a wave enshroudeth them like awnings, they cry unto Allah, making their faith pure for Him only. But when He bringeth them safe to land, some of them compromise. None denieth Our signs save every traitor ingrate.",
                            "verse 31:33": "O mankind! Keep your duty to your Lord and fear a Day when the parent will not be able to avail the child in aught, nor the child to avail the parent. Lo! Allah’s promise is the very truth. Let not the life of the world beguile you, nor let the deceiver beguile you, in regard to Allah.",
                            "verse 31:34": "Lo! Allah! With Him is knowledge of the Hour. He sendeth down the rain, and knoweth that which is in the wombs. No soul knoweth what it will earn to-morrow, and no soul knoweth in what land it will die. Lo! Allah is Knower, Aware."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 31:1": "A. L. M.",
                            "verse 31:2": "These are Verses of the Wise Book,-",
                            "verse 31:3": "A Guide and a Mercy to the Doers of Good,-",
                            "verse 31:4": "Those who establish regular Prayer, and give regular Charity, and have (in their hearts) the assurance of the Hereafter.",
                            "verse 31:5": "These are on (true) guidance from their Lord: and these are the ones who will prosper.",
                            "verse 31:6": "But there are, among men, those who purchase idle tales, without knowledge (or meaning), to mislead (men) from the Path of God and throw ridicule (on the Path): for such there will be a Humiliating Penalty.",
                            "verse 31:7": "When Our Signs are rehearsed to such a one, he turns away in arrogance, as if he heard them not, as if there were deafness in both his ears: announce to him a grievous Penalty.",
                            "verse 31:8": "For those who believe and work righteous deeds, there will be Gardens of Bliss,-",
                            "verse 31:9": "To dwell therein. The promise of God is true: and He is Exalted in Power, Wise.",
                            "verse 31:10": "He created the heavens without any pillars that ye can see; He set on the earth mountains standing firm, lest it should shake with you; and He scattered through it beasts of all kinds. We send down rain from the sky, and produce on the earth every kind of noble creature, in pairs.",
                            "verse 31:11": "Such is the Creation of God: now show Me what is there that others besides Him have created: nay, but the Transgressors are in manifest error.",
                            "verse 31:12": "we bestowed (in the past) Wisdom on Luqman: \"Show (thy) gratitude to God.\" Any who is (so) grateful does so to the profit of his own soul: but if any is ungrateful, verily God is free of all wants, Worthy of all praise.",
                            "verse 31:13": "Behold, Luqman said to his son by way of instruction: \"O my son! join not in worship (others) with God: for false worship is indeed the highest wrong-doing.\"",
                            "verse 31:14": "And We have enjoined on man (to be good) to his parents: in travail upon travail did his mother bear him, and in years twain was his weaning: (hear the command), \"Show gratitude to Me and to thy parents: to Me is (thy final) Goal.",
                            "verse 31:15": "\"But if they strive to make thee join in worship with Me things of which thou hast no knowledge, obey them not; yet bear them company in this life with justice (and consideration), and follow the way of those who turn to me (in love): in the end the return of you all is to Me, and I will tell you the truth (and meaning) of all that ye did.\"",
                            "verse 31:16": "\"O my son!\" (said Luqman), \"If there be (but) the weight of a mustard-seed and it were (hidden) in a rock, or (anywhere) in the heavens or on earth, God will bring it forth: for God understands the finest mysteries, (and) is well-acquainted (with them).",
                            "verse 31:17": "\"O my son! establish regular prayer, enjoin what is just, and forbid what is wrong: and bear with patient constancy whatever betide thee; for this is firmness (of purpose) in (the conduct of) affairs.",
                            "verse 31:18": "\"And swell not thy cheek (for pride) at men, nor walk in insolence through the earth; for God loveth not any arrogant boaster.",
                            "verse 31:19": "\"And be moderate in thy pace, and lower thy voice; for the harshest of sounds without doubt is the braying of the ass.\"",
                            "verse 31:20": "Do ye not see that God has subjected to your (use) all things in the heavens and on earth, and has made his bounties flow to you in exceeding measure, (both) seen and unseen? Yet there are among men those who dispute about God, without knowledge and without guidance, and without a Book to enlighten them!",
                            "verse 31:21": "When they are told to follow the (Revelation) that God has sent down, they say: \"Nay, we shall follow the ways that we found our fathers (following). \"What! even if it is Satan beckoning them to the Penalty of the (Blazing) Fire?",
                            "verse 31:22": "Whoever submits his whole self to God, and is a doer of good, has grasped indeed the most trustworthy hand-hold: and with God rests the End and Decision of (all) affairs.",
                            "verse 31:23": "But if any reject Faith, let not his rejection grieve thee: to Us is their return, and We shall tell them the truth of their deeds: for God knows well all that is in (men’s) hearts.",
                            "verse 31:24": "We grant them their pleasure for a little while: in the end shall We drive them to a chastisement unrelenting.",
                            "verse 31:25": "If thou ask them, who it is that created the heavens and the earth. They will certainly say, \"God\". Say: \"Praise be to God!\" But most of them understand not.",
                            "verse 31:26": "To God belong all things in heaven and earth: verily God is He (that is) free of all wants, worthy of all praise.",
                            "verse 31:27": "And if all the trees on earth were pens and the ocean (were ink), with seven oceans behind it to add to its (supply), yet would not the words of God be exhausted (in the writing): for God is Exalted in Power, full of Wisdom.",
                            "verse 31:28": "And your creation or your resurrection is in no wise but as an individual soul: for God is He Who hears and sees (all things).",
                            "verse 31:29": "Seest thou not that God merges Night into Day and he merges Day into Night; that He has subjected the sun, and the moon (to his Law), each running its course for a term appointed; and that God is well-acquainted with all that ye do?",
                            "verse 31:30": "That is because God is the (only) Reality, and because whatever else they invoke besides Him is Falsehood; and because God,- He is the Most High, Most Great.",
                            "verse 31:31": "Seest thou not that the ships sail through the ocean by the Grace of God?- that He may show you of His Signs? Verily in this are Signs for all who constantly persevere and give thanks.",
                            "verse 31:32": "When a wave covers them like the canopy (of clouds), they call to God, offering Him sincere devotion. But when He has delivered them safely to land, there are among them those that halt between (right and wrong). But none reject Our Signs except only a perfidious ungrateful (wretch)!",
                            "verse 31:33": "O mankind! do your duty to your Lord, and fear (the coming of) a Day when no father can avail aught for his son, nor a son avail aught for his father. Verily, the promise of God is true: let not then this present life deceive you, nor let the chief Deceiver deceive you about God.",
                            "verse 31:34": "Verily the knowledge of the Hour is with God (alone). It is He Who sends down rain, and He Who knows what is in the wombs. Nor does any one know what it is that he will earn on the morrow: Nor does any one know in what land he is to die. Verily with God is full knowledge and He is acquainted (with all things)."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 31:1": "Alif Lam Mim",
                            "verse 31:2": "Those are the signs of the Wise Book",
                            "verse 31:3": "for a guidance and a mercy to the good-doers",
                            "verse 31:4": "who perform the prayer, and pay the alms, and have sure faith in the Hereafter.",
                            "verse 31:5": "Those are upon guidance from their Lord; those are the prosperers.",
                            "verse 31:6": "Some men there are who buy diverting talk to lead astray from the way of God without knowledge, and to take it in mockery; those -- there awaits them a humbling chastisement.",
                            "verse 31:7": "And when Our signs are recited to such a man he turns away, waxing proud, as though he heard them not, and in his ears were heaviness; so give him good tidings of a painful chastisement.",
                            "verse 31:8": "Surely those who believe, and do deeds of righteousness, there awaits them Gardens of Bliss",
                            "verse 31:9": "therein to dwell forever -- God’s promise in truth; and He is the All-mighty, the All-wise.",
                            "verse 31:10": "He created the heavens without pillars you can see, and He cast on the earth firm mountains, lest it shake with you, and He scattered abroad in it all manner of crawling thing. And We sent down out of heaven water, and caused to grow in it of every generous kind.",
                            "verse 31:11": "This is God’s creation; now show me what those have created that are apart from Him! Nay, but the evildoers are in manifest error.",
                            "verse 31:12": "Indeed, We gave Lokman wisdom: ’Give thanks to God. Whosoever gives thanks gives thanks only for his own soul’s good, and whosoever is ungrateful -- surely God is All-sufficient, All-laudable.’",
                            "verse 31:13": "And when Lokman said to his son, admonishing him, ’O my son, do not associate others with God; to associate others with God is a mighty wrong.",
                            "verse 31:14": "(And We have charged man concerning his parents -- his mother bore him in weakness upon weakness, and his weaning was in two years -- ’Be thankful to Me, and to thy parents; to Me is the homecoming.",
                            "verse 31:15": "But if they strive with thee to make thee associate with Me that whereof thou hast no knowledge, then do not obey them. Keep them company honourable in this world; but follow the way of him who turns to Me. Then unto Me you shall return, and I shall tell you what you were doing.’)",
                            "verse 31:16": "’O my son, if it should be but the weight of one grain of mustard-seed, and though it be in a rock, or in the heavens, or in the earth, God shall bring it forth; surely God is All-subtle, All-aware.",
                            "verse 31:17": "O my son, perform the prayer, and bid unto honour, and forbid dishonour. And bear patiently whatever may befall thee; surely that is true constancy.",
                            "verse 31:18": "Turn not thy cheek away from men in scorn, and walk not in the earth exultantly; God loves not any man proud and boastful.",
                            "verse 31:19": "Be modest in thy walk, and lower thy voice; the most hideous of voices is the ass’s.’",
                            "verse 31:20": "Have you not seen how that God has subjected to you whatsoever is in the heavens and earth, and He has lavished on you His blessings, outward and inward? And among men there is such a one that disputes concerning God without knowledge or guidance, or an illuminating Book;",
                            "verse 31:21": "and when it is said to them, ’Follow what God has sent down,’ they say, ’No; but we will follow such things as we found our fathers doing.’ What? Even though Satan were calling them to the chastisement of the burning?",
                            "verse 31:22": "And whosoever submits his will to God, being a good-doer, has laid hold of the most firm handle; and unto God is the issue of all affairs.",
                            "verse 31:23": "And whoso disbelieves, let not his disbelief grieve thee; unto Us they shall return, and We shall tell them what they did. Surely God knows all the thoughts within the breasts.",
                            "verse 31:24": "To them We give enjoyment a little, then We compel them to a harsh chastisement.",
                            "verse 31:25": "If thou askest them, ’Who created the heavens and the earth?’ they will say, ’God.’ Say: ’Praise belongs to God.’ Nay, but most of them have no knowledge.",
                            "verse 31:26": "To God belongs all that is in the heavens and the earth; surely God -- He is the All-sufficient, the All-laudable.",
                            "verse 31:27": "Though all the trees in the earth were pens, and the sea-seven seas after it to replenish it, yet would the Words of God not be spent. God is All-mighty, All-wise.",
                            "verse 31:28": "Your creation and your upraising are as but as a single soul. God is All-hearing, All-seeing.",
                            "verse 31:29": "Hast thou not seen how that God makes the night to enter into the day and makes the day to enter into the night. and He has subjected the sun and the moon, each of them running to a stated term, and that God is aware of what you do?",
                            "verse 31:30": "That is because God -- He is the Truth, and that they call upon apart from Him -- that is the false; and for that God is the All-high, the All-great.",
                            "verse 31:31": "Hast thou not seen how that the ships run upon the sea by the blessing of God, that He may show you some of His signs? Surely in that are signs for every man enduring, thankful.",
                            "verse 31:32": "And when the waves cover them like shadows they call upon God, making their religion sincerely His; but when He has delivered them to the land, some of them are lukewarm. And none denies Our signs, except every ungrateful traitor.",
                            "verse 31:33": "O men, fear your Lord, and dread a day when no father shall give satisfaction for his child, and no child shall give satisfaction for his father whatever. Surely God’s promise is true; so let not the present life delude you, and let not the Deluder delude you concerning God.",
                            "verse 31:34": "Surely God -- He has knowledge of the Hour; He sends down the rain; He knows what is in the wombs. No soul knows what it shall earn tomorrow, and no soul knows in what land it shall die. Surely God is All-knowing, All-aware."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 31:1": "Alif. Lām. Mīm.",
                            "verse 31:2": "THESE ARE MESSAGES of the divine writ, full of wisdom,",
                            "verse 31:3": "providing guidance and grace unto the doers of good",
                            "verse 31:4": "who are constant in prayer and dispense charity: for it is they, they who in their innermost are certain of the life to come!",
                            "verse 31:5": "It is they who follow the guidance [that comes to them] from their Sustainer; and it is they, they who shall attain to a happy state!",
                            "verse 31:6": "But among men there is many a one that prefers a mere play with words [to divine guidance], so as to lead [those] without knowledge astray from the path of God, and to turn it to ridicule: for such there is shameful suffering in store.",
                            "verse 31:7": "For whenever Our messages are conveyed to such a one, he turns away in his arrogance as though he had not heard them – as though there were deafness in his ears: give him, then, the tiding of grievous suffering [in the life to come].",
                            "verse 31:8": "[As against this,] verily, those who attain to faith and do righteous deeds shall have gardens of bliss,",
                            "verse 31:9": "to abide therein in accordance with God’s true promise: for He alone is almighty, truly wise.",
                            "verse 31:10": "He [it is who] has created the skies without any supports that you could see, and has placed firm mountains upon the earth, lest it sway with you, and has caused all manner of living creatures to multiply thereon. And We send down water from the skies, and thus We cause every noble kind [of life] to grow on earth.",
                            "verse 31:11": "[All] this is God’s creation: show Me, then, what others than He may have created! Nay, but the evildoers are obviously lost in error!",
                            "verse 31:12": "AND, INDEED, We granted this wisdom unto Luqmān: \"Be grateful unto God – for he who is grateful [unto Him] is but grateful for the good of his own self; whereas he who chooses to be ungrateful [ought to know that], verily, God is self-sufficient, ever to be praised!\"",
                            "verse 31:13": "And, lo, Luqmān spoke thus unto his son, admonishing him: \"O my dear son! Do not ascribe divine powers to aught beside God: for, behold, such [a false] ascribing of divinity is indeed an awesome wrong!",
                            "verse 31:14": "\"And [God says:] ‘We have enjoined upon man goodness towards his parents: his mother bore him by bearing strain upon strain, and his utter dependence on her lasted two years: [hence, O man,] be grateful towards Me and towards thy parents, land remember that] with Me is all journeys’ end.",
                            "verse 31:15": "\"‘[Revere thy parents;] yet should they endeavour to make thee ascribe divinity, side by side with Me, to something which thy mind cannot accept [as divine], obey them not; but [even then] bear them company in this world’s life with kindness, and follow the path of those who turn towards Me. In the end, unto Me you all must return; and thereupon I shall make you [truly] understand all that you were doing [in life].’",
                            "verse 31:16": "\"O my dear son,\" [continued Luqmān,] \"verily, though there be aught of but the weight of a mustard-seed, and though it be [hidden] in a rock, or in the skies, or in the earth, God will bring it to light: for, behold, God is unfathomable [in His wisdom], all-aware.",
                            "verse 31:17": "\"O my dear son! Be constant in prayer, and enjoin the doing of what is right and forbid the doing of what is wrong, and bear in patience whatever [ill] may befall thee: this, behold, is something to set one’s heart upon!",
                            "verse 31:18": "\"And turn not thy cheek away from people in [false] pride, and walk not haughtily on earth: for, behold, God does not love anyone who, out of self-conceit, acts in a boastful manner.",
                            "verse 31:19": "\"Hence, be modest in thy bearing, and lower thy voice: for, behold, the ugliest of all voices is the [loud] voice of asses....\"",
                            "verse 31:20": "ARE YOU NOT aware that God has made subservient to you all that is in the heavens and all that is on earth, and has lavished upon you His blessings, both outward and inward? And yet, among men there is many a one that argues about God without having any knowledge [of Him], without any guidance, and without any light-giving revelation;",
                            "verse 31:21": "and when such [people] are told to follow that which God has bestowed from on high, they answer, \"Nay, we shall follow that which we found our forefathers believing in and doing!\" Why – [would you follow your forefathers] even if Satan had invited them unto the suffering of the blazing flame?",
                            "verse 31:22": "Now whoever surrenders his whole being unto God, and is a doer of good withal, has indeed taken hold of a support most unfailing: for with God rests the final outcome of all events.",
                            "verse 31:23": "But as for him who is bent on denying the truth – let not his denial grieve thee: unto Us they must return, and then We shall make them [truly] understand all that they were doing [in life]: for, verily, God has full knowledge of what is in the hearts [of men].",
                            "verse 31:24": "We will let them enjoy themselves for a short while – but in the end We shall drive them into suffering severe.",
                            "verse 31:25": "AND THUS it is [with most people]: if thou ask them, \"Who is it that has created the heavens and the earth?\" – they will surely answer, \"God.\" Say: \"[Then you ought to know that] all praise is due to God!\" – for most of them do not know [what this implies].",
                            "verse 31:26": "Unto God belongs all that is in the heavens and on earth. Verily, God alone is self-sufficient, the One to whom all praise is due!",
                            "verse 31:27": "And if all the trees on earth were pens, and the sea [were ink], with seven [more] seas yet added to it, the words of God would not be exhausted: for, verily, God is almighty, wise.",
                            "verse 31:28": "[For Him,] the creation of you all and the resurrection of you all is but like [the creation and resurrection of] a single soul: for, verily, God is all-hearing, all-seeing.",
                            "verse 31:29": "Art thou not aware that it is God who makes the night grow longer by shortening the day, and makes the day grow longer by shortening the night, and that He has made the sun and the moon subservient [to His laws], each running its course for a term set [by Him] – and that God is fully aware of all that you do?",
                            "verse 31:30": "Thus it is, because God alone is the Ultimate Truth, so that all that men invoke instead of Him is sheer falsehood; and because God alone is exalted, truly great!",
                            "verse 31:31": "Art thou not aware how the ships speed through the sea by God’s favour, so that He might show you some of His wonders? Herein, behold, there are messages indeed for all who are wholly patient in adversity and deeply grateful [to God].",
                            "verse 31:32": "For [thus it is with most men:] when the waves engulf them like shadows [of death], they call unto God, sincere [at that moment] in their faith in Him alone: but as soon as He has brought them safe ashore, some of them stop half-way [between belief and unbelief]. Yet none could knowingly reject Our messages unless he be utterly perfidious, ingrate.",
                            "verse 31:33": "O MEN! Be conscious of your Sustainer, and stand in awe of the Day on which no parent will be of any avail to his child, nor a child will in the least avail his parent! Verily, God’s promise [of resurrection] is true indeed: let not, then, the life of this world delude you and let not [your own] deceptive thoughts about God delude you!",
                            "verse 31:34": "Verily, with God alone rests the knowledge of when the Last Hour will come; and He [it is who] sends down rain; and He [alone] knows what is in the wombs: whereas no one knows what he will reap tomorrow, and no one knows in what land he will die. Verily, God [alone] is all-knowing, all-aware."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 31:1": "Alif Lām Mīm .",
                            "verse 31:2": "These are verses of the Wise Book,",
                            "verse 31:3": "a guidance and mercy for those who are good in their deeds",
                            "verse 31:4": "who are steadfast in Salāh and who pay Zakāh and have faith in the Hereafter.",
                            "verse 31:5": "It is these who are on guidance given by their Lord, and it is just these who are successful.",
                            "verse 31:6": "There is a man among the people who buys discourses of distracting amusements, so that he may mislead (people) from the Way of Allah, and make a mockery of it. For such people there is a disgraceful punishment.",
                            "verse 31:7": "And when Our verses are recited to him, he turns away in arrogance, as if he did not hear them, as if there is heaviness in his ears. So give him the ‘good’ news of a painful punishment.",
                            "verse 31:8": "Surely, for those who believe and do righteous deeds there are gardens of bliss",
                            "verse 31:9": "in which they will live forever - an absolute promise of Allah. He is the Mighty, the Wise.",
                            "verse 31:10": "He has created the skies without the pillars that you may see, and placed mountains on the earth, lest it shakes with you, and spread over it all kinds of creatures. And We sent down water from the heavens, and caused to grow in it every noble pair.",
                            "verse 31:11": "This is the creation of Allah. Now, show me what is created by those others, besides Him. Rather, the transgressors are in open error.",
                            "verse 31:12": "We gave wisdom to Luqmān, and said, “Be grateful to Allah;” and whoever is grateful is, in fact, grateful for his own benefit, and whoever is ungrateful, then Allah is free of all needs, worthy of all praise.",
                            "verse 31:13": "(Remember) when Luqmān said to his son, while he was advising him, “My dear son, do not ascribe partners to Allah. Indeed, ascribing partners to Allah (shirk) is grave transgression.”",
                            "verse 31:14": "We commanded man (to be good) in respect of his parents. His mother carried him (in her womb) despite weakness upon weakness, and his weaning is in two years. (We said to man,) “Be grateful to Me, and to your parents. To Me is the ultimate return.",
                            "verse 31:15": "However, if they force you to ascribe partners to Me about whom you (can) have no (source of) knowledge, then do not obey them. Remain with them in this world with due fairness, but follow the way of the one who has turned himself towards Me. Then, towards Me is your return, so I shall tell you what you had been doing.”",
                            "verse 31:16": "(Luqmān went on saying to his son,) “My dear son, in fact, if there be anything to the measure of a grain of rye, and it be (hidden) in a rock or in the heavens or in the earth, Allah will bring it forth. Surely, Allah is All-Fine, All-Aware.",
                            "verse 31:17": "My dear son, establish Salāh , and bid the Fair and forbid the Unfair, and observe patience on what befalls you. Surely, this is among the matters of determination;",
                            "verse 31:18": "and do not turn your cheek away from people, and do not walk on the earth haughtily. Surely, Allah does not like anyone who is arrogant, proud;",
                            "verse 31:19": "and be moderate in your walk, and lower your voice. Surely, the ugliest of voices is the voice of the donkeys.”",
                            "verse 31:20": "Have you not seen that Allah has subjugated for you what is in the heavens and what is on the earth, and has perfected His blessings on you, both outward and inward? But among people there are those who debate about Allah with no knowledge, no guidance and no book to enlighten.",
                            "verse 31:21": "When it is said to them, “follow what Allah has sent down,” they say, “Instead, we would follow that on which we have found our fathers.” Is it so, even though the Satan has been calling them to the punishment of the flaming Fire?",
                            "verse 31:22": "And whoever submits his self to Allah and is good in deeds, he in fact holds on to the strongest ring. Towards Allah is the ultimate end of all matters.",
                            "verse 31:23": "And whoever disbelieves, let not his disbelief grieve you. To Us is their return. Then We will tell them what they did. Surely, Allah is All Aware of what lies in the hearts.",
                            "verse 31:24": "We let them enjoy a little, then We will drag them to a heavy punishment.",
                            "verse 31:25": "And if you ask them as to who has created the heavens and the earth, they will certainly say, “Allah.” Say, “AlHamdulillāh ” (Praise be to Allah). But most of them do not know.",
                            "verse 31:26": "To Allah belongs what is in the heavens and the earth. Surely, it is Allah who is free of all needs, worthy of every praise.",
                            "verse 31:27": "And if all trees that are on the earth were to be pens, and the ocean (converted into ink) is supported by seven seas following it, the words of Allah would not come to an end. Surely, Allah is Mighty, Wise.",
                            "verse 31:28": "Creation and resurrection of all of you is no more (to Allah) than that of one single person. Surely, Allah is All-Hearing, All Seeing.",
                            "verse 31:29": "Did you not see that Allah makes the night enter into the day, and makes the day enter into the night, and He has subjugated the sun and the moon, each running towards an appointed time, and that Allah is fully aware of what you do?",
                            "verse 31:30": "That is because Allah is the only Real One and what they invoke other than Him is false and Allah is the High, the Great.",
                            "verse 31:31": "Did you not see that the ships sail through the sea by the grace of Allah, so that He shows you some of His signs? In that, indeed, there are signs for every man of patience and gratitude.",
                            "verse 31:32": "And when they are covered by waves like canopies, they pray to Allah, having faith exclusively in Him. Then, once He brings them safe to the land, some of them remain balanced, (while others turn ungrateful by denying Allah’s signs.) And no one denies Our signs except every ungrateful traitor.",
                            "verse 31:33": "O people, fear your Lord and fear a day when no father will help his son, nor will a son be helpful to his father at all. Surely, the promise of Allah is true. So, the worldly life must not deceive you, nor should you ever be deceived about Allah by the Deceiver.",
                            "verse 31:34": "Surely, it is Allah with whom rests the knowledge of the Hour; and He sends down the rain, and He knows what is in the wombs. No one knows what he will earn tomorrow, and no one knows in which land he will die. Surely, Allah is All Knowing, All Aware."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 31:1": "Alif lām mīm.",
                            "verse 31:2": "Those are the signs of the wise Book,",
                            "verse 31:3": "a guidance and a mercy for the virtuous,",
                            "verse 31:4": "who maintain the prayer and pay the alms and who are certain of the Hereafter.",
                            "verse 31:5": "Such follow guidance from their Lord and it is they who are the successful.",
                            "verse 31:6": "And among people there is he who purchases idle talk that he may lead [people] astray from the way of God without knowledge and take it in mockery. For such there will be a humiliating chastisement.",
                            "verse 31:7": "And when Our signs are recited to such [a one] he turns away disdainfully as though he never heard them, as though there were a deafness in his ears. So give him tidings of a painful chastisement.",
                            "verse 31:8": "Surely those who believe and perform righteous deeds, for them there shall be Gardens of Bliss,",
                            "verse 31:9": "abiding therein — a promise of God in truth, and He is the Mighty, the Wise.",
                            "verse 31:10": "He created the heavens without any pillars that you can see and cast high mountains into the earth, lest it shake with you, and He dispersed therein all kinds beasts. And We sent down water from the heaven and We caused to grow in it of every splendid kind.",
                            "verse 31:11": "This is God’s creation. Now show me what those [you worship] besides Him have created. Nay but the evildoers are in manifest error.",
                            "verse 31:12": "And verily We gave Luqm?n wisdom: ‘Give thanks to God. Whoever gives thanks only for his own sake and whoever is ungrateful, then surely God is Independent, Praised’.",
                            "verse 31:13": "And when Luqmān said to his son, when he was admonishing him, ‘O my son do not ascribe partners to God: idolatry is truly a tremendous wrong’.",
                            "verse 31:14": "And We have enjoined man concerning his parents — his mother bears him in weakness after weakness, and his weaning is in two year. ‘Give thanks to Me and to your parents. To Me is the journey’s end.",
                            "verse 31:15": "But if they urge you to ascribe to Me as partner that whereof you have no knowledge, then do not obey them. And keep them company in this world honourably, and follow the way of him who returns to Me [in penitence]. Then to Me will be your return, and I will inform you of what you used to do.",
                            "verse 31:16": "‘O my son! Even if it should be the weight of a grain of mustard-seed, and [even if] it be in a rock, or in the heavens, or in the earth, God will bring it forth. Truly God is Subtle, Aware.",
                            "verse 31:17": "O my son! Establish prayer and enjoin decency and forbid indecency. And be patient through whatever may befall you. Truly that is true constancy.",
                            "verse 31:18": "And do not turn your cheek disdainfully from people and do not walk upon the earth exultantly. Truly God does not like any swaggering braggart.",
                            "verse 31:19": "And be modest in your bearing and lower your voice; indeed the most hideous of voices is the donkey’s voice’.",
                            "verse 31:20": "Do you not see that God has disposed for you whatever is in the heavens and whatever is in the earth, and He has showered His favours upon you, [both] outwardly and inwardly? Yet among people there are those who dispute concerning God without any knowledge or guidance or an illuminating scripture.",
                            "verse 31:21": "And if it is said to them: ‘Follow what God has revealed’, they say, ‘We will rather follow what we found our fathers following’. What! even though Satan were calling them to the chastisement of the Blaze?",
                            "verse 31:22": "And whoever surrenders his purpose to God and is virtuous, has certainly grasped the firmest handle, and to God belongs the sequel of all matters.",
                            "verse 31:23": "And whoever disbelieves, then do not let his disbelief grieve you. To Us shall be their return and We shall inform them of what they did. Truly God knows [best] what is in the breasts.",
                            "verse 31:24": "We will give them comfort for a little [while], then We will drive them, to a harsh chastisement.",
                            "verse 31:25": "And if you were to ask them, ‘Who created the heavens and the earth?’ they will surely say, ‘God’. Say: ‘Praise be to God’. Nay, but most of them do not realise.",
                            "verse 31:26": "To God belongs whatever is in the heavens and the earth. Indeed God, He is the Independent, the Praised.",
                            "verse 31:27": "And if all the trees on earth were pens, and the sea replenished with seven more seas, the Words of God would not be spent. Truly God is Mighty, Wise.",
                            "verse 31:28": "Your creation and your resurrection are only as [that of] a single soul. Truly God is Hearer, Seer.",
                            "verse 31:29": "Have you not seen that God makes the night pass into the day and makes the day pass into the night, and He has disposed the sun and the moon, each running to an appointed term, and that God is Aware of what you do?",
                            "verse 31:30": "That is [so] because God, He is the Truth, and whatever they call on besides Him is falsehood, and because God is the High [Exalted], the Great.",
                            "verse 31:31": "Have you not seen that the ships run upon the sea by the grace of God, that He may show you some of His signs? Surely in that there are signs for every [servant who is] steadfast, grateful.",
                            "verse 31:32": "And if waves cover them like awnings, they call on God, sincere before Him in their faith; but when He delivers them to land, some of them compromise. And none denies Our signs, except every perfidious ingrate.",
                            "verse 31:33": "O people, fear your Lord and fear a day when no parent shall avail a child; and no child shall avail its parent in any way. Surely God’s promise is true. So do not let the life of this world deceive you, and do not let the Deceiver deceive you concerning God.",
                            "verse 31:34": "Lo! God, with Him lies knowledge of the Hour; and He sends down the rain, and He knows what is in the wombs. And no soul knows what it will earn tomorrow, and no soul knows in what land it will die. Truly God is Knower, Aware."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 31:1": "Alif, Lam, Mim. (Only Allah and the Messenger [blessings and peace be upon him] know the real meaning.)",
                            "verse 31:2": "These are Verses of the Book of Wisdom,",
                            "verse 31:3": "Guidance and mercy for the pious,",
                            "verse 31:4": "Who establish Prayer and pay Zakat (the Alms-due) and those who believe in the Hereafter.",
                            "verse 31:5": "It is they who are following guidance from their Lord and it is they who will prosper.",
                            "verse 31:6": "And of people there are those who buy absurd narrations to make the people lacking in knowledge lose the path of Allah and to mock this (path). It is they for whom there is painful torment.",
                            "verse 31:7": "And when Our Revelations are recited to such a one, he turns his face away showing arrogance as though he had not heard it at all, as if there were weight (of deafness) in his ears. So give him the news of an agonizing torment.",
                            "verse 31:8": "Undoubtedly, those who believe and keep doing good deeds, for them are Gardens of Bliss.",
                            "verse 31:9": "(They) will live in them forever. The promise of Allah is true. And He is Almighty, Most Wise.",
                            "verse 31:10": "He created the heavens without pillars (as) you see them and He placed firm mountains in the earth so that it might not quake carrying you (during rotation) and He spread in it all kinds of animals. And We sent down water from the heaven, and We caused to grow in it all kinds of fine and useful vegetation.",
                            "verse 31:11": "This is Allah’s Creation. So, (O polytheists,) show Me what others, apart from Allah, have created. In truth, the wrongdoers are in open error.",
                            "verse 31:12": "And surely, We blessed Luqman with wisdom and sound judgment (and said to him:) ‘Be grateful to Allah. And whoever gives thanks gives thanks for his own good; and whoever shows ingratitude, then surely Allah is Self-Sufficient, Worthy of all praise.’",
                            "verse 31:13": "And (recall) when Luqman said to his son as he was advising him: ‘O my son, do not set up partners with Allah. Verily, associating partners with Allah is a very grave injustice.’",
                            "verse 31:14": "And We emphatically enjoined upon man (to do good) to his parents—whose mother bore him (in her reproductive system) in pain after pain, and whose weaning also takes two years (and commanded him:) ‘Give thanks to Me and to your parents. (You) shall return to Me alone.’",
                            "verse 31:15": "And if both of them contend with you that you should associate (others) with Me, of which you have no knowledge, then do not obey them. And cooperate with them in worldly affairs in a decent manner. But (in the matter of faith and the Last Hour and the related affairs) follow someone who adopts the path of turning to Me in repentance and submitting to My injunctions. Then you are to return to Me alone. So I shall inform you about the works that you used to do.’",
                            "verse 31:16": "(Luqman said:) ‘O my son, if there is a thing equal to the grain of a mustard seed (hidden) inside a rock or in the heavens or in the earth, (even then) Allah will bring it forth (for reckoning on the Day of Judgment). Surely, Allah is the Subtle Knower of the minutest matters, All-Aware and Most Vigilant (as well).",
                            "verse 31:17": "O my son! Establish Prayer and enjoin good and forbid evil, and patiently endure every suffering that touches you. Verily, these are matters of great courage and high resolve.",
                            "verse 31:18": "And do not turn your face away from the people (in arrogance), nor walk haughtily on earth. Surely, Allah does not love the arrogant one who walks gloatingly in self-conceit.",
                            "verse 31:19": "And adopt moderation whilst walking and keep your voice low. Surely, the worst voice is the bray of a donkey.’",
                            "verse 31:20": "(O people!) Have you not seen that Allah has subjected to you whatever is in the heavens and whatever is in the earth, and He has completed upon you His blessings outwardly as well as inwardly? And amongst people there are (also) those who dispute about Allah without knowledge and without guidance and without (any evidence from) the enlightening Book.",
                            "verse 31:21": "And when it is said to them: ‘Follow this Book which Allah has revealed,’ they say: ‘Nay, we shall follow (that) way which we found our fathers following,’ even though Satan should be inviting them to the torment of Hell.",
                            "verse 31:22": "And whoever bows his face in obedience to Allah, and is also a man of spiritual excellence (in action and state of mind), has firmly grasped a strong handhold. And the end of all deeds returns to Allah alone.",
                            "verse 31:23": "And whoever disbelieves, (O Esteemed Beloved,) let not his disbelief grieve you. They (too) are to return to Us. We shall inform them of the deeds which they used to do. Surely, Allah knows best the (hidden) contents of the breasts.",
                            "verse 31:24": "We shall provide them a little benefit (in the world) then, making them helpless, We shall drive them towards the severe torment.",
                            "verse 31:25": "And if you ask them: ‘Who created the heavens and the earth?’ they shall answer: ‘Allah.’ Say: ‘All praise belongs to Allah alone.’ But most of them do not know.",
                            "verse 31:26": "Whatever is in the heavens and the earth (all) belongs to Allah alone. Surely, Allah is Self-Sufficient, Worthy of all praise (by Himself).",
                            "verse 31:27": "And if (all) the trees on earth were pens, and the ocean reinforced by seven more oceans were ink, even then the Words of Allah would never be exhausted. Surely, Allah is Almighty, Most Wise.",
                            "verse 31:28": "Creating you all and raising you all (after death) is (in Allah’s power) like (creating and raising) a single person. Surely, Allah is All-Hearing, All-Seeing.",
                            "verse 31:29": "Have you not seen that Allah makes the night pass into the day and makes the day pass into the night; and (He is the One Who) has made the sun and the moon subservient, each rotating for an appointed term and that Allah is Aware of (all) the deeds that you do?",
                            "verse 31:30": "That is because Allah alone is the truth and those whom these people worship besides Allah are false and because Allah is Most High, the Supreme.",
                            "verse 31:31": "Have you not seen that vessels sail on the sea by Allah’s bounty so that He shows you some of His signs? Surely, there are signs in it for every greatly steadfast and grateful person.",
                            "verse 31:32": "And when the sea wave engulfs them like (clouds or towering mountains or) canopies, they (the disbelievers and polytheists) start calling upon Allah, dedicating their most sincere devotion to Him alone. But when rescuing them He brings them back to land, then only a few of them remain on the moderate path (i.e., the path of guidance). And none but every deceptive and ungrateful person denies Our signs.",
                            "verse 31:33": "O people! Fear your Lord and fear that Day when no father will be able to expiate for his son, nor will a son be able to atone for his father. Surely, the promise of Allah is true. So let not the worldly life deceive you, nor let the Arch-Deceiver (Satan) deceive you concerning Allah.",
                            "verse 31:34": "Surely, Allah is the One with Whom is the knowledge of the Last Hour. And He is the One Who sends down rain and knows whatever is in the wombs. And no one knows what (deed) he will earn the next day, nor does anyone know in what land he will die. Surely, Allah is All-Knowing, All-Aware (i.e., Self-Knowing and fully Aware of everything besides Him. He Himself knows everything and also informs him whom He likes)."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Aliif, Laam, Miim. (Minä olen Jumala, parhain tietäjä.)",
                            "verse 31:2": "Nämä ovat Viisauden Kirjan jakeita;",
                            "verse 31:3": "johdatukseksi ja armoksi niille, jotka hyvää tekevät.",
                            "verse 31:4": "Niille, jotka suorittavat rukouksensa ja antavat säädetyt almut ja ovat varmat tulevasta elämästä.",
                            "verse 31:5": "He saavat Herraltansa johdatuksen, ja he ovat niitä, jotka menestyvät.",
                            "verse 31:6": "On sellaisiakin, jotka Koraanin vaihtavat joutaviin taruihin eksyttääkseen ihmiset Jumalan tieltä, vaikka heillä ei ole mitään tietoa, ja tehdäkseen pilaa Viisauden Kirjan jakeista. He ovat niitä, joita kohtaa häpeällinen rangaistus.",
                            "verse 31:7": "Kun Meidän merkkimme esitetään tällaiselle, hän kääntää korskeasti selkänsä, ikäänkuin hän ei olisi niitä kuullut, ikäänkuin hänen korvansa olisivat ummessa. Kerro hänelle sentähden tuskallisesta tuomiosta.",
                            "verse 31:8": "Totisesti, jotka uskovat ja tekevät hyvää, heitä varten ovat autuaiden tarhat.",
                            "verse 31:9": "Siellä he saavat alati asua. Jumalan lupaus on totinen, sillä Hän on kaikkivaltias, viisas.",
                            "verse 31:10": "Hän on luonut taivaat ilmantukipylväitä, kuten voit nähdä,ja Hän on sijoittanut vuoria maan kamaralle, jottei se sinua horjuttaisi, ja Hän on levittänyt ympäri maata kaikenlaisia elollisia olentoja. Me lähetämme myös sateen taivaasta maan päälle ja kasvatamme monenlaisia hyödyllisiä kasveja.",
                            "verse 31:11": "Tällainen on Jumalan luomakunta. Näytä nyt minulle, mitä ne, jotka on asetettu Jumalan rinnalle, ovat luoneet. Niin, väärämieliset ovat suuren harhan vallassa.",
                            "verse 31:12": "Totisesti, Me annoimme Lukmaanille viisautta ja sanoimme: »Kiitä Jumalaa. Ken osoittaa kiitollisuuttaan, hän tekee sen oman sielunsa hyväksi. Ja jos joku on kiittämätön, niin totisesti, Jumala on riippumaton, ylistetty.»",
                            "verse 31:13": "Muista, miten Lukmaan antoi pojalleen kehoituksen sanoen: »Poikani, älä aseta ketään Jumalan rinnalle. Totisesti, sellainen on perin väärää.»",
                            "verse 31:14": "Olemme myös määrännyt ihmisen pitämään huolta vanhemmistaan; hänen äitinsä on kantanut häntä äärimmäiseen uupumukseen saakka, ja hänen vieroittamisensa on kestänyt toista vuotta. Kiitä Minua ja molempia vanhempiasi. Minun luokseni on kaikkien palattava.",
                            "verse 31:15": "Mutta jos he pakottavat sinua asettamaan Minun rinnalleni sellaista, mistä sinulla ei ole mitään tietoa, älä heitä silloin tottele; elä kuitenkin heidän kanssaan soveliaasti tässä maailmassa. Seuraa sellaisen tietä, joka kääntyy Minunun puoleeni. Minun luokseni teidän on palattava, ja silloin Minä osoitan teille teidän tekonne.»",
                            "verse 31:16": "Ja Lukmaan lausui edelleen: »Oi poikani! Totisesti, jos sinapinsiemenen painoinen jyvänen on kätketty kiven sisään tai taivaisiin taikka maan päälle, niin Jumala on sen löytävä. Totisesti, Jumala on terävänäköinen, ymmärtävä.",
                            "verse 31:17": "Oi poikani, suorita rukouksesi, kehoita hyvän tekemiseen ja kiellä pahat teot sekä pysy lujana, mitä tahansa sinulle sattuukin. Näin on todella vakavasti määrätty.",
                            "verse 31:18": "Älä ole ylpeä ihmisiä kohtaan, äläkä vaella maassa pöyhkeänä. Totisesti, Jumala ei rakasta omahyväistä kerskuria.",
                            "verse 31:19": "Hillitse itsesi ja puhu sävyisästi. Totisesti, rumin ääni on aasin hirnunta.",
                            "verse 31:20": "Ettekö huomaa, että Jumala on alistanut valtaanne kaikki, mikä on taivaassa ja mikä on maassa, ja siunannut teidät yltäkylläisesti sekä ruumiin että sielun tarpeilla. Mutta ihmisten joukossa on sellaisiakin, jotka kiistelevät Jumalasta, vaikka heillä ei ole tietoa eikä johdatusta eikä mitään valaisevaa kirjaa.",
                            "verse 31:21": "Ja kun heille sanotaan: »Seuratkaa sitä, minkä Jumala on maan päälle lähettänyt, he vastaavat: »Me seuraamme sitä, jota havaitsimme esi-isiemmekin seuraavan.» Mutta entäpä jos saatana siten kutsuu heitä kohti liekehtivän tulen tuomiota?",
                            "verse 31:22": "Ken alistaa koko olemuksensa Jumalalle ja tekee hyvää, hän on tarttunut luotettavimpaan kädensijaan, Jumalassa on kaikkien toimien päätös.",
                            "verse 31:23": "Mutta jos joku on valinnut epäuskon, älä anna hänen epäuskonsa sinua murehduttaa. Meidän luoksemme heidän on palattava, ja silloin Me ilmituomme heille heidän tekonsa. Totisesti, Jumala tietää tarkoin, mitä sydämiin on kätketty.",
                            "verse 31:24": "Me annamme heidän nauttia lyhyen ajan; sitten vedämme heidät ankaralle tuomiolle.",
                            "verse 31:25": "Totisesti, jos kysyt heiltä: »Kuka on luonut taivaat ja maan?» niin he varmasti vastaavat: »Jumala.» Sano: »Kaikki ylistys kuuluu Jumalalle!» Mutta useimmat heistä eivät tiedä mitään.",
                            "verse 31:26": "Jumalalle kuuluu kaikki, mikä on taivaassa ja maan päällä. Totisesti, Jumala on kaikista riippumattomin, kaikkein ylistetyin.",
                            "verse 31:27": "Vaikka kaikki maan pinnalla olevat puut olisivat kyniä ja valtameri sekä seitsemän valtamerta sen lisäksi olisivat mustetta, niin Jumalan sanat eivät loppuisi. Totisesti, Jumala on mahtava, viisas.",
                            "verse 31:28": "Sekä nykyinen olemuksenne että ylösnousemuksenne ovat vain ikäänkuin saman sielun ilmenemismuotoja. Totisesti, Jumala on kuuleva, näkevä.",
                            "verse 31:29": "Etkö näe, että Jumala antaa yön seurata päivää ja päivän yötä, ja Hän säätää auringon ja kuun liikkeet; kumpikin kulkee kohti määrättyä hetkeään, Jumala on tietoinen teidän teoistanne.",
                            "verse 31:30": "Sillä Jumala on totuus, ja se, mitä he Hänen asemestaan rukoilevat, on valhetta; Jumala on kaikkein korkein, kaikkein suurin.",
                            "verse 31:31": "Etkö havaitse, miten laivat Jumalan siunaamina purjehtivat merellä, jotta Hän voisi näyttää teille erään merkeistään? Totisesti, tässä on merkkejä jokaiselle lujana pysyvälle ja kiitolliselle ihmiselle.",
                            "verse 31:32": "Ja kun aallot vyöryvät heidän päälleen kuin vuoret, niin he rukoilevat Jumalaa uskoen Häneen täydellisesti, mutta kun Hän pelastaa heidät maihin, niin vain muutamat heistä kulkevat oikeata tietä. Vain sopimusten rikkojat ja kiittämättömät väittelevät Meidän merkkejämme vastaan.",
                            "verse 31:33": "Oi ihmiset, palvelkaa Herraanne ja varokaa sitä päivää, jolloin isä ei voi auttaa poikaansa eikä poika saata vähääkään tukea isäänsä. Jumalan lupaus on varmasti tosi, älkää siis antako tämän maailman elämän johtaa itseänne harhaan, älkääkä salliko suuren viettelijän eksyttää teitä Jumalan luota.",
                            "verse 31:34": "Totisesti, Jumala tietää tuomion hetken, Hän lähettää sateen maan päälle ja Hän tietää, mitkä ihmiskohtalot äitien kohtuihin kätketyt ovat. Yksikään sielu ei aavista, mitä hänen on huomenna koettava, eikä sitä, missä maassa hän on kuoleva. Totisesti, Jumala on tietävä, tarkkanäköinen."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 31:1": "Alif. Lâm. Mîm.",
                            "verse 31:2": "Voici les versets du Livre sage :",
                            "verse 31:3": "Guidance et Miséricorde pour ceux qui font le bien,",
                            "verse 31:4": "ceux qui s'acquittent de la prière et qui font l'aumône tout en croyant fermement à la vie future.",
                            "verse 31:5": "Ceux-là suivent la Guidance de leur Seigneur et ceux-là sont les bienheureux !",
                            "verse 31:6": "Parmi les hommes il en est qui, sans la moindre connaissance, s'emploient à colporter des discours frivoles pour éloigner du chemin de Dieu et le tourner en dérision. Ceux-là subiront un châtiment ignominieux.",
                            "verse 31:7": "Un tel, lorsqu'on lui récite Nos versets, se détourne avec orgueil comme s'il ne les entendait pas, comme si ses oreilles étaient bouchées. Annonce-lui la nouvelle d'un châtiment douloureux.",
                            "verse 31:8": "Certes, à ceux qui ont cru et ont accompli des œuvres pies sont destinés les Jardins du délice.",
                            "verse 31:9": "Ils y demeureront à jamais. La promesse de Dieu est vérité, et Il est l'Omniscient, le Sage.",
                            "verse 31:10": "Il a créé les cieux sans des piliers que vous puissiez voir ; Il a jeté sur la terre des montagnes pour lui servir d'appui, ainsi qu'à vous, et Il y a propagé toutes sortes d'animaux. Et Nous avons fait descendre du ciel une eau, puis Nous avons fait croître sur la terre toutes sortes d'espèces fécondes.",
                            "verse 31:11": "Telle est la création de Dieu ! Or, montrez-moi ce que d'autres que Lui ont créé ! Vraiment, les iniques sont dans un égarement manifeste.",
                            "verse 31:12": "Jadis Nous avons donné la Sagesse à Luqmân : \" Sois reconnaissant envers Dieu. Celui qui est reconnaissant, sa reconnaissance ne profite qu'à lui même ; quant à l'ingrat, la vérité est que Dieu se suffit à lui-même, qu'Il est digne de toute louange \".",
                            "verse 31:13": "Lorsqu'il s'adressait à son fils, Luqmân l'exhortait ainsi : \" O mon fils ! N'associe rien à Dieu. Lui donner des associés est une monstrueuse iniquité \".",
                            "verse 31:14": "Et Nous avons fait à l'homme une recommandation au sujet de ses parents - sa mère l'a porté avec peine, jour après jour, le sevrant après deux ans - : \" Sois reconnaissant envers Moi et envers tes parents, lui avons-Nous enjoint. C'est à Moi que tout retourne.",
                            "verse 31:15": "Si tous deux veulent t'obliger à M'associer ce dont tu ne possèdes aucune connaissance, ne leur obéis pas. Accompagne-les en ce monde avec bienséance, et suis le chemin de celui qui revient à Moi. Plus tard vous retournerez tous à Moi et Je vous instruirai alors sur ce que vous avez fait \".",
                            "verse 31:16": "\" O mon fils ! [dit Luqmân] Même s'il ne s'agit que du poids d'un grain de moutarde et que la chose soit cachée dans un rocher, dans les cieux ou sur la terre, Dieu la fera ressurgir. Dieu est subtil, instruit de tout !",
                            "verse 31:17": "O mon fils ! Acquitte-toi de la prière, ordonne ce qui est convenable et interdis ce qui est blâmable ; supporte patiemment ce qui t'atteint : ce sont là de fermes préceptes.",
                            "verse 31:18": "Ne fais pas aux hommes une moue dédaigneuse et ne marche pas sur la terre avec arrogance : Dieu n'aime pas l'insolent, l'outrecuidant.",
                            "verse 31:19": "Sois modeste en ta démarche, modère ta voix : la voix la plus détestable est la voix de l'âne \".",
                            "verse 31:20": "Ne voyez-vous pas que Dieu vous a assujetti ce qui est dans les cieux et ce qui est sur la terre ? Il a répandu sur vous bienfaits apparents et cachés. Et pourtant, parmi les hommes, il en est qui discutent au sujet de Dieu sans aucune science, ni direction, ni Livre lumineux.",
                            "verse 31:21": "Si on leur dit : \" Suivez ce que Dieu a révélé \", ils répondent : \" Que non ! Nous suivons ce que nous avons appris de nos ancêtres \"... Et cela, même si le Démon les appelait au châtiment de la Fournaise ?",
                            "verse 31:22": "Celui qui soumet sa face à Dieu et qui fait le bien saisit l'anse la plus solide. C'est à Dieu qu'appartient la fin de toute chose.",
                            "verse 31:23": "Que l'incrédulité du mécréant ne t'attriste pas. Leur retour se fera vers Nous et Nous les instruirons alors sur ce qu'ils faisaient. Dieu sait parfaitement ce que contiennent les poitrines.",
                            "verse 31:24": "Nous les laisserons jouir peu de temps, puis Nous leur ferons endurer un lourd châtiment.",
                            "verse 31:25": "Si tu leur demandes : \" Qui a créé les cieux et la terre ? \", ils répondront certainement : \" C'est Dieu ! \" Dis : \" Louange à Dieu ! \" Mais la plupart d'entre eux ne savent pas.",
                            "verse 31:26": "A Dieu appartient ce qui est dans les cieux et sur la terre. Certes, Dieu est le Riche, Celui qui est digne de toute louange.",
                            "verse 31:27": "Si tous les arbres de la terre étaient des calames et si la mer, aidée par sept autres mers, leur fournissait de l'encre, les Paroles de Dieu ne l'épuiseraient pas. Dieu est puissant et sage.",
                            "verse 31:28": "Votre création et votre résurrection sont pour Lui comme celles d'un seul être. Dieu entend tout et voit tout.",
                            "verse 31:29": "Ne vois-tu pas que Dieu fait pénétrer la nuit dans le jour et qu'Il fait pénétrer le jour dans la nuit ; qu'Il oblige le soleil et la lune à courir vers un terme fixé, et que Dieu est informé de tout ce que vous faites ?",
                            "verse 31:30": "Il en est ainsi parce que Dieu est la Vérité et que ce qu'ils implorent en dehors de Lui est illusion et parce que Lui, Dieu, est le Sublime, l'infiniment Grand.",
                            "verse 31:31": "Ne vois-tu pas que le vaisseau vogue sur la mer par la grâce de Dieu afin qu'Il vous montre certains de Ses signes ? Il y a vraiment là des signes pour tout homme patient et reconnaissant !",
                            "verse 31:32": "Lorsqu'une vague semblable à des ténèbres les recouvre, ils implorent Dieu en Lui vouant un culte sincère. Mais lorsque Dieu les a ramenés sains et saufs vers la terre ferme, il en est parmi eux qui tiédissent. Seul, pourtant, l'inconstant, le mécréant est ingrat envers Nos signes.",
                            "verse 31:33": "O vous, les hommes, craignez votre Seigneur ! Redoutez un jour où le père ne pourra pas racheter son enfant, ni l'enfant racheter en rien son père. Certes, la promesse de Dieu est vérité ! Que la vie de ce monde ne vous séduise pas, et que le Grand Séducteur ne vous trompe pas au sujet de Dieu.",
                            "verse 31:34": "Certes, la connaissance de l'Heure est auprès de Dieu. Il fait descendre l'ondée salvatrice, et Il sait ce que contiennent les matrices. Personne ne sait ce qu'il acquerra demain et personne ne sait en quelle terre il mourra. Dieu, en vérité, est omniscient, instruit de tout. v.12,13,16-19 : Luqmân, sage antique que d'aucuns assimilent à Esope car comme celui-ci il aurait été - selon la tradition arabe - un esclave noir affranchi par son maître, personnifie la Sagesse d'inspiration divine à laquelle l'être humain est appelé à se conformer."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 31:1": "Alif, Lam, Mim .",
                            "verse 31:2": "Voici les versets du Livre plein de sagesse,",
                            "verse 31:3": "c’est un guide et une miséricorde aux bienfaisants,",
                            "verse 31:4": "qui accomplissent la Salat, acquittent le Zakat et qui croient avec certitude en l’au-delà.",
                            "verse 31:5": "Ceux-là sont sur le chemin droit de leur Seigneur et ce sont eux les bienheureux.",
                            "verse 31:6": "Et, parmi les hommes, il est [quelqu’un] qui, dénué de science, achète de plaisants discours pour égarer hors du chemin de Dieu et pour le prendre en raillerie. Ceux-là subiront un châtiment avilissant.",
                            "verse 31:7": "Et quand on lui récite Nos versets, il tourne le dos avec orgueil, comme s’il ne les avait point entendus, comme s’il y avait un poids dans ses oreilles. Fais-lui donc l’annonce d’un châtiment douloureux.",
                            "verse 31:8": "Ceux qui croient et accomplissent les bonnes oeuvres auront les Jardins des délices,",
                            "verse 31:9": "pour y demeurer éternellement, - c’est en vérité une promesse de Dieu. - C’est Lui le Puissant, le Sage.",
                            "verse 31:10": "Il a créé les cieux sans piliers que vous puissiez voir; et Il a enfoncé des montagnes fermes dans la terre pour l’empêcher de basculer avec vous; et Il y a propagé des animaux de toute espèce. Et du ciel, Nous avons fait descendre une eau, avec laquelle Nous avons fait pousser des plantes productives par couples de toute espèce.",
                            "verse 31:11": "«Voilà la création de Dieu. Montrez-Moi donc ce qu’ont créé, ceux qui sont en dehors de Lui ? » Mais les injustes sont dans un égarement évident.",
                            "verse 31:12": "Nous avons effectivement donné à Luqman la sagesse : «Sois reconnaissant à Dieu, car quiconque est reconnaissant, n’est reconnaissant que pour soi-même; quant à celui qui est ingrat..., En vérité, Dieu se dispense de tout, et Il est digne de louange».",
                            "verse 31:13": "Et lorsque Luqman dit à son fils tout en l’exhortant : «ô mon fils, ne donne pas d’associé à Dieu, car l’association à [Dieu] est vraiment une injustice énorme».",
                            "verse 31:14": "Nous avons commandé à l’homme [la bienfaisance envers] ses père et mère; sa mère l’a porté [subissant pour lui] peine sur peine : son sevrage a lieu à deux ans.» Sois reconnaissant envers Moi ainsi qu’envers tes parents. Vers Moi est la destination.",
                            "verse 31:15": "Et si tous deux te forcent a M’associer ce dont tu n’as aucune connaissance, alors ne leur obéis pas; mais reste avec eux ici-bas de façon convenable. Et suis le sentier de celui qui se tourne vers Moi. Vers Moi, ensuite, est votre retour, et alors Je vous informerai de ce que vous faisiez».",
                            "verse 31:16": "«ô mon enfant, fût-ce le poids d’un grain de moutarde, au fond d’un rocher, ou dans les cieux ou dans la terre, Dieu le fera venir . Dieu est infiniment Doux et Parfaitement Connaisseur.",
                            "verse 31:17": "ô mon enfant, accomplis la Salat, commande le convenable, interdis le blâmable et endure ce qui t’arrive avec patience. Telle est la résolution à prendre dans toute entreprise !",
                            "verse 31:18": "Et ne détourne pas ton visage des hommes, et ne foule pas la terre avec arrogance : car Dieu n’aime pas le présomptueux plein de gloriole.",
                            "verse 31:19": "Sois modeste dans ta démarche, et baisse ta voix, car la plus détestée des voix, c’est bien la voix des ânes».",
                            "verse 31:20": "Ne voyez-vous pas que Dieu vous a assujetti ce qui est dans les cieux et sur la terre ? Et Il vous a comblés de Ses bienfaits apparents et cachés. Et parmi les gens, il y en a qui disputent à propos de Dieu, sans science, ni guidée, ni Livre éclairant.",
                            "verse 31:21": "Et quand on leur dit : «Suivez ce que Dieu a fait descendre», ils disent : «Nous suivons plutôt ce sur quoi nous avons trouvé nos ancêtres». Est-ce donc même si le Diable les appelait au châtiment de la fournaise !",
                            "verse 31:22": "Et quiconque soumet son être à Dieu, tout en étant bienfaisant, s’accroche réellement à l’anse la plus ferme . La fin de toute chose appartient à Dieu.",
                            "verse 31:23": "Celui qui a mécru, que sa mécréance ne t’afflige pas : vers Nous sera leur retour et Nous les informerons de ce qu’ils faisaient. Dieu connaît bien le contenu des poitrines.",
                            "verse 31:24": "Nous leur donnons de la jouissance pour peu de temps; ensuite Nous les forcerons vers un dur châtiment.",
                            "verse 31:25": "Si tu leur demandes : «Qui a créé les cieux et la terre ? », ils diront, certes : «Dieu ! » Dis : «Louange à Dieu ! ». Mais la plupart d’entre eux ne savent pas.",
                            "verse 31:26": "A Dieu appartient tout ce qui est dans les cieux et en terre. Dieu est Celui qui se suffit à Lui-même, Il est Le Digne de louange !",
                            "verse 31:27": "Quand bien même tous les arbres de la terre se changeraient en calames [plumes pour écrire], quand bien même l’océan serait un océan d’encre où conflueraient sept autres océans, les paroles de Dieu ne s’épuiseraient pas. Car Dieu est Puissant et Sage.",
                            "verse 31:28": "Votre création et votre résurrection [à tous] sont [aussi faciles à Dieu] que s’il s’agissait d’une seule âme. Certes Dieu est Audient et Clairvoyant.",
                            "verse 31:29": "N’as-tu pas vu que Dieu fait pénétrer la nuit dans le jour, et qu’il fait pénétrer le jour dans la nuit, et qu’Il a assujetti le soleil et la lune chacun poursuivant sa course jusqu’à un terme fixé ? Et Dieu est Parfaitement Connaisseur de ce que vous faites.",
                            "verse 31:30": "Il en est ainsi parce que Dieu est la Vérité, et que tout ce qu’ils invoquent en dehors de Lui est le Faux, et que Dieu, c’est Lui le Haut, le Grand.",
                            "verse 31:31": "N’as-tu pas vu que c’est par la grâce de Dieu que le vaisseau vogue dans la mer, afin qu’Il vous fasse voir de Ses merveilles ? Il y a en cela des preuves pour tout homme patient et reconnaissant.",
                            "verse 31:32": "Quand une vague les recouvre comme des ombres, ils invoquent Dieu, vouant leur Culte exclusivement à Lui; et lorsqu’Il les sauve, en les ramenant vers la terre ferme, certains d’entre eux deviennent réticents; mais, seul le grand traître et le grand ingrat renient Nos signes.",
                            "verse 31:33": "ô hommes ! Craignez votre Seigneur et redoutez un jour où le père ne répondra en quoi que ce soit pour son enfant, ni l’enfant pour son père. La promesse de Dieu est vérité. Que la vie présente ne vous trompe donc pas, et que le Trompeur (Satan) ne vous induise pas en erreur sur Dieu !",
                            "verse 31:34": "La connaissance de l’Heure est auprès de Dieu; et c’est Lui qui fait tomber la pluie salvatrice; et Il sait ce qu’il y a dans les matrices. Et personne ne sait ce qu’il acquerra demain, et personne ne sait dans quelle terre il mourra. Certes Dieu est Omniscient et Parfaitement Connaisseur."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Alif Lám Mím.",
                            "verse 31:2": "Dies sind die Verse des weisen Buches.",
                            "verse 31:3": "Eine Führung und eine Barmherzigkeit für jene, die Gutes tun,",
                            "verse 31:4": "Die das Gebet verrichten und die Zakat zahlen und die fest ans Jenseits glauben.",
                            "verse 31:5": "Sie sind es, die der Führung ihres Herrn folgen, und sie sind es, die Erfolg haben werden.",
                            "verse 31:6": "Unter den Menschen gibt es einen, der eitle Geschichten erhandelt, um (die Leute) irrezuleiten, hinweg von Allahs Pfad, ohne Wissen, und um damit Spott zu treiben. Solcher harrt eine schmähliche Strafe.",
                            "verse 31:7": "Und wenn ihm Unsere Zeichen vorgetragen werden, so kehrt er sich verächtlich ab, als hätte er sie nicht gehört, als wäre eine Schwerhörigkeit in seinen Ohren. So künde ihm eine schmerzliche Strafe an.",
                            "verse 31:8": "Die aber glauben und gute Werke tun, ihnen werden Gärten der Wonne,",
                            "verse 31:9": "Darin sie weilen werden immerdar. Eine Verheißung Allahs in Wahrheit! Und Er ist der Allmächtige, der Allweise.",
                            "verse 31:10": "Er hat die Himmel erschaffen ohne Stützen, die ihr zu sehen vermöchtet, und Er hat in der Erde feste Berge gegründet, damit sie nicht mit euch bebe, und hat allerlei Getier über sie verstreut. Und Wir senden Wasser aus den Wolken nieder und lassen jede edle Art auf ihr sprießen.",
                            "verse 31:11": "Dies ist Allahs Schöpfung. Zeigt mir nun, was andere, außer Ihm, geschaffen haben. Nein, die Frevler sind in offenkundigem Irrtum.",
                            "verse 31:12": "Wir verliehen Luqmán Weisheit, auf daß er Allah dankbar sein möchte: denn wer da dankbar ist, der ist dankbar zum Besten seiner eigenen Seele. Ist aber einer undankbar, dann ist wahrlich Allah Sich Selbst genügend, preiswürdig.",
                            "verse 31:13": "Und (denke daran) da Luqmán zu seinem Sohn sprach, indem er ihn ermahnte: «O mein lieber Sohn, setze Allah keine Götter zur Seite, denn Götzendienst ist fürwahr eine schwere Sünde.»",
                            "verse 31:14": "Und Wir haben dem Menschen für seine Eltern ans Herz gelegt - seine Mutter trug ihn in Schwäche über Schwäche, und seine Entwöhnung erfordert zwei Jahre -: «Sei dankbar Mir und deinen Eltern. Zu Mir ist die Heimkehr.",
                            "verse 31:15": "Doch wenn sie mit dir eifern, damit du Mir das zur Seite setzest, wovon du keine Kenntnis hast, dann gehorche ihnen nicht. In weltlichen Dingen aber verkehre mit ihnen auf geziemende Weise. Doch folge dem Weg dessen, der sich zu Mir wendet. Dann werdet ihr zu Mir zurückkehren, und Ich werde euch verkünden, was ihr getan.»",
                            "verse 31:16": "«O mein lieber Sohn, hätte es auch nur das Gewicht eines Senfkorns und wäre es in einem Felsen oder in den Himmeln oder in der Erde, Allah wird es gewißlich hervorbringen. Wahrlich, Allah ist scharfsinnig. allwissend.",
                            "verse 31:17": "O mein lieber Sohn, verrichte das Gebet und gebiete Gutes und verbiete Böses und ertrage geduldig, was dich auch treffen mag. Das ist fürwahr ein Merkmal einer festen Gemütsart.",
                            "verse 31:18": "Und weise deine Wange nicht verächtlich den Menschen und wandle nicht hochmütig auf Erden; denn Allah liebt keine eingebildeten Prahler.",
                            "verse 31:19": "Und wandle gemessenen Schritts und dämpfe deine Stimme; denn wahrlich, die widerwärtigste der Stimmen ist der Eselsschrei.»",
                            "verse 31:20": "Habt ihr nicht gesehen, daß Allah euch alles dienstbar gemacht hat, was in den Himmeln und was auf der Erde ist, und Seine Wohltaten reichlich über euch ergossen hat äußerlich wie innerlich? Und doch gibt es unter den Menschen so manchen, der über Allah streitet, ohne Kenntnis und ohne Führung und ohne ein erleuchtendes Buch.",
                            "verse 31:21": "Und wenn zu ihnen gesprochen wird: «Folget dem, was Allah herniedergesandt hat», dann sagen sie: «Nein, wir wollen dem folgen, wobei wir unsere Väter vorfanden.» Wie! selbst wenn der Satan sie zu der Strafe des brennenden Feuers lädt?",
                            "verse 31:22": "Wer aber sein Antlitz auf Allah richtet und Gutes tut, der hat fürwahr die festeste Handhabe ergriffen. Und bei Allah ruht das Ende aller Dinge.",
                            "verse 31:23": "Und jener, der ungläubig ist, laß seinen Unglauben dich nicht bekümmern. Zu Uns wird ihre Heimkehr sein, dann werden Wir ihnen verkünden, was sie getan; denn Allah weiß recht wohl, was in den Herzen ist.",
                            "verse 31:24": "Wir werden sie eine kleine Weile sich ergötzen lassen; dann aber werden Wir sie zu strenger Strafe treiben.",
                            "verse 31:25": "Und wenn du sie fragst: «Wer schuf die Himmel und die Erde?» - dann werden sie gewiß antworten: «Allah». Sprich: «Aller Preis gebührt Allah.» Jedoch die meisten von ihnen wissen es nicht.",
                            "verse 31:26": "Allahs ist, was in den Himmeln und auf Erden ist. Wahrlich, Allah ist der Sich Selbst Genügende, der Preiswürdige.",
                            "verse 31:27": "Und wenn alle Bäume, die auf der Erde sind, Federn wären, und der Ozean (Tinte), und sieben Ozeane würden nachträglich ihm zugefügt, selbst dann könnten Allahs Zeichen nicht erschöpft werden. Wahrlich, Allah ist allmächtig, allweise.",
                            "verse 31:28": "Eure Erschaffung und eure Auferweckung sind nur die eines einzigen Wesens. Wahrlich, Allah ist allhörend, allsehend.",
                            "verse 31:29": "Hast du denn nicht gesehen, daß Allah die Nacht in den Tag übergehen läßt und den Tag übergehen läßt in die Nacht und daß Er die Sonne und den Mond dienstbar gemacht, so daß jedes seine Bahn läuft zu einem bestimmten Ziel, und daß Allah wohl kundig ist dessen, was ihr tut?",
                            "verse 31:30": "Dies, weil Allah allein die Wahrheit ist - und was sie sonst außer Ihm anrufen, ist Falsches - und weil Allah, Er, der Erhabene ist, der Große.",
                            "verse 31:31": "Hast du denn nicht gesehen, daß die Schiffe über das Meer hinsegeln mit Allahs Gaben, auf daß Er euch von Seinen Zeichen zeige? Hierin sind wahrlich Zeichen für jeden Standhaften, Dankbaren.",
                            "verse 31:32": "Und wenn Wogen sie bedecken gleich Hüllen, dann rufen sie Allah an, in lauterem Gehorsam gegen Ihn; doch rettet Er sie dann ans Land, so folgen (nur) einige von ihnen der rechten Bahn. Und niemand leugnet Unsere Zeichen, außer allen Treulosen, Undankbaren.",
                            "verse 31:33": "O ihr Menschen, fürchtet euren Herrn und fürchtet den Tag, da der Vater nicht Buße leisten wird für seinen Sohn, noch wird der Sohn im geringsten Buße leisten können für seinen Vater. Allahs Verheißung ist wahr. Das Leben dieser Welt soll euch nicht täuschen, noch soll der Verführer euch täuschen über Allah.",
                            "verse 31:34": "Wahrlich, bei Allah allein ist die Kenntnis der «Stunde». Er sendet den Regen nieder, und Er weiß, was in den Mutterschößen ist. Niemand weiß, was er sich morgen eintragen wird, und niemand weiß, in welchem Lande er sterben wird. Wahrlich, Allah ist allwissend, allkundig."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "vfyQ+ yke ehe",
                            "verse 31:2": ";s lwjk fgder ls Hkjh gq;h fdrkck dh vk;rsa gS",
                            "verse 31:3": "tks ¼vt+ljrkik½ mu yksxksa ds fy, fgnk;r o jger gS",
                            "verse 31:4": "tks ikcUnh ls uekt+ vnk djrs gSa vkSj t+dkr nsrs gSa vkSj ogh yksx vkf[k+jr dk Hkh ;d+hu j[krs gSa",
                            "verse 31:5": ";gh yksx vius ijojfnxkj dh fgnk;r ij vkfey gSa vkSj ;gh yksx ¼d+;ker esa½ viuh fnyh eqjknsa ik,¡xs",
                            "verse 31:6": "vkSj yksxksa esa ckt+ ¼ut+j fcu gkfjl½ ,slk gS tks csgwnk fd+Lls ¼dgkfu;k¡½ [k+jhnrk gS rkfd cx+Sj le>s cw>s ¼yksxksa dks½ [+k+qnk dh ¼lh/kh½ jkg ls HkM+dk ns vkSj vk;krsa [+k+qnk ls el[k+jkiu djs ,sls gh yksxksa ds fy, cM+k #lok djus okyk vt+kc gS",
                            "verse 31:7": "vkSj tc mlds lkeus gekjh vk;rsa i<+h tkrh gSa rks ’ks[k+h ds ekjs eq¡g Qsjdj ¼bl rjg½ py nsrk gS xks;k mlus bu vk;rksa dks lquk gh ugha tSls mlds nksuks dkuksa esa BsBh gS rks ¼,s jlwy½ rqe mldks nnZukd vt+kc dh ¼vHkh ls½ [kq’k[k+cjh ns ns",
                            "verse 31:8": "cs’kd tks yksx bZeku yk, vkSj mUgksaus vPNs dke fd, muds fy, usver ds ¼gjs Hkjs csg’rh½ ckx+ gSa fd ;ks muesa ges’kk jgsaxs",
                            "verse 31:9": ";s [+kqnk dk iDdk ok;nk gS vkSj og rks ¼lc ij½ x+kfyc fgder okyk gS",
                            "verse 31:10": "rqe mUgsa ns[k jgs gks fd mlh us cx+Sj lqrwu ds vklekuksa dks cuk Mkyk vkSj mlh us t+ehu ij ¼Hkkjh Hkkjh½ igkM+ksa ds yaxj Mky fn, fd ¼eqcknk½ rqEgsa ysdj fdlh rjQ tqfEc’k djs vkSj mlh us gj rjg py fQj djus okys ¼tkuoj½ t+ehu esa QSyk, vkSj geus vkleku ls ikuh cjlk;k vkSj ¼mlds t+fj, ls½ t+ehu esa gj jax ds uQ+hl tksM+s iSnk fd,",
                            "verse 31:11": "¼,s jlwy muls dg nks fd½ ;s rks [kq+nk dh f[k+yd+r gS fd ¼Hkyk½ rqe yksx eq>s fn[kkvksa rks fd tks ¼tks ekcwn½ [+kq+nk ds flok rqeus cuk j[ks gS mUgksaus D;k iSnk fd;k cfYd ljd’k yksx ¼dq¶+Q+kj½ ljhgh xqejkgh esa ¼iMs+½ gSa",
                            "verse 31:12": "vkSj ;d+huu ge us yqd+eku dks fgder vrk dh ¼vkSj gqDe fn;k Fkk fd½ rqe [+k+qnk dk ’kqØ djks vkSj tks [+k+qnk dk ’kqØ djsxk&og vius gh Qk;ns ds fy, ’kqØ djrk gS vkSj ftlus uk’kqØh dh rks ¼viuk fcxkM+k½ D;ksadh [+k+qnk rks ¼cgjgky½ cs ijokg ¼vkSj½ d+kfcy genks luk gS",
                            "verse 31:13": "vkSj ¼og oD+r ;kn djks½ tc yqd+eku us vius csVs ls mldh ulhgr djrs gq, dgk ,s csVk ¼[k+cjnkj dHkh fdlh dks½ [+k+qnk dk ’kjhd u cukuk ¼D;ksafd½ f’kdZ ;d+huh cM+k l[+r xqukg gS",
                            "verse 31:14": "¼ftl dh c[+f’k’k ugha½ vkSj geus bUlku dks ftls mldh ek¡ us nq[k ij nq[k lg ds isV esa j[kk ¼blds vykok½ nks cjl esa ¼tkds½ mldh nw/k c<+kbZ dh ¼vius vkSj½ mlds ek¡ cki ds ckjs esa rkd+hn dh fd esjk Hkh ’kqfØ;k vnk djks vkSj vius okynSu dk ¼Hkh½ vkSj vkf[k+j lcdks esjh rjQ ykSV dj tkuk gS",
                            "verse 31:15": "vkSj vxj rsjs ek¡ cki rq>s bl ckr ij etcwj djsa fd rw esjk ’kjhd ,slh pht+ dks d+jkj ns ftldk rq>s bYe Hkh ugha rks rw ¼blesa½ mudh brkvr u djks ¼exj rdyhQ+ u igq¡pkuk½ vkSj nqfu;k ¼ds dkeksa½ esa mudk vPNh rjg lkFk ns vkSj mu yksxksa ds rjhd+s ij py tks ¼gj ckr esa½ esjh ¼gh½ rjQ #tw djs fQj ¼rks vkf[k+j½ rqe lcdh #tw esjh gh rjQ gS rc ¼nqfu;k esa½ tks dqN rqe djrs Fks",
                            "verse 31:16": "¼ml oD+r mldk vUtke½ crk nw¡xk ,s csVk blesa ’kd ugha fd og vey ¼vPNk gks ;k cqjk½ vxj jkbZ ds cjkcj Hkh gks vkSj fQj og fdlh l[+r iRFkj ds vUnj ;k vkleku esa ;k t+ehu es ¼Nqik gqvk½ gks rks Hkh [k+qnk mls ¼d+;ker ds fnu½ gkft+j dj nsxk cs’kd [k+qnk cM+k ckjhdchu okfd+Qdkj gS",
                            "verse 31:17": ",s csVk uekt+ ikcUnh ls i<+k dj vkSj ¼yksxksa ls½ vPNk dke djus dks dgks vkSj cqjs dke ls jksdks vkSj tks eqlhcr rqe ij iMs+ ml ij lcz djks ¼D;ksafd½ cs’kd ;s cM+h fgEer dk dke gS",
                            "verse 31:18": "vkSj yksxksa ds lkeus ¼xq+#j ls½ viuk eq¡g u Qqykuk vkSj t+ehu ij vdM+dj u pyuk D;ksafd [k+qnk fdlh vdM+us okys vkSj brjkus okys dks nksLr ugha j[krk vkSj viuh pky <ky esa fe;kuk joh ,[+rs;kj djks",
                            "verse 31:19": "vkSj nwljks ls cksyus esa viuh vkokt+ /kheh j[kks D;ksafd vkokt+ksa esa rks lc ls cqjh vkokt+ ¼ph[k+us dh otg ls½ x/kksa dh gS",
                            "verse 31:20": "D;k rqe yksxksa us bl ij x+kSj ugha fd;k fd tks dqN vklekuksa esa gS vkSj tks dqN t+ehu esa gS ¼x+jt+ lc dqN½ [k+qnk gh us ;d+huh rqEgkjk rkcs, dj fn;k gS vkSj rqe ij viuh t+kfgjh vkSj ckfruh usversa iwjh dj nha vkSj ckt+ yksx ¼uqlj fcu gkfjl oxS+jg½ ,sls Hkh gSa tks ¼[+okg ek [+okg½ [+k+qnk ds ckjs esa >xM+rs gSa ¼gkykWfd muds ikl½ u bYe gS vkSj u fgnk;r gS vkSj u dksbZ jkS’ku fdrkc gS",
                            "verse 31:21": "vkSj tc muls dgk tkrk gS fd tks ¼fdrkc½ [+k+qnk us ukft+y dh gS mldh iSjoh djks rks ¼NwVrs gh½ dgrs gSa fd ugha ge rks mlh ¼rjhd+s ls pysaxs½ ftl ij geus vius cki nknkvksa dks ik;k Hkyk vxjps ’kSrku muds cki nknkvksa dks tgUuqe ds vt+kc dh rjQ cqykrk jgk gks ¼rks Hkh mUgh dh iSjoh djsaxs½",
                            "verse 31:22": "vkSj tks ’k[+l [k+qnk ds vkxs viuk lj ¼rLyhe½ [k+e djs vkSj og usdksdkj ¼Hkh½ gks rks cs’kd mlus ¼bZeku dh½ et+cwr jLlh idM+ yh vkSj ¼vkf[k+j rks½ lc dkeksa dk vUtke [+kq+nk gh dh rjQ gS",
                            "verse 31:23": "vkSj ¼,s jlwy½ tks dkfQj cu cSBs rks rqe mlds dqÝ ls dq<+ksa ugh mu lcdks rks gekjh rjQ ykSV dj vkuk gS rks tks dqN mu yksxksa us fd;k gS ¼mldk urhtk½ ge crk nsxsa cs’kd [k+qnk fnyksa ds jkt+ ls ¼Hkh½ [kwc okfd+Q gS",
                            "verse 31:24": "ge mUgsa pUn jkst+ksa rd pSu djus nsxsa fQj mUgsa etcwj djds l[+r vt+kc dh rjQ [khp yk,¡xsa",
                            "verse 31:25": "vkSj ¼,s jlwy½ rqe vxj muls iwNks fd lkjs vkleku vkSj t+ehu dks fdlus iSnk fd;k rks t+#j dg nsxs fd vYykg us ¼,s jlwy½ bl ij rqe dg nks vYgenksfyYYkkg exj muesa ls vDlj ¼bruk Hkh½ ugha tkurs gSa",
                            "verse 31:26": "tks dqN lkjs vkleku vkSj t+ehu esa gS ¼lc½ [+k+qnk gh dk gS cs’kd [k+qnk rks ¼gj pht+ ls½ csijok ¼vkSj cgjgky½ d+kfcys gEnks luk gS",
                            "verse 31:27": "vkSj ftrus nj[+r t+ehu esa gSa lc ds lc d+ye cu tk,¡ vkSj leUnj mldh fl;kgh cusa vkSj mlds ¼[+kRe gksus ds½ ckn vkSj lkr leUnj ¼fl;kgh gks tk,¡ vkSj [k+qnk dk bYe vkSj mldh ckrsa fy[kh tk,¡½ rks Hkh [k+qnk dh ckrsa [k+Re u gksxha cs’kd [k+qnk lc ij x+kfyc ¼vkSj½ nkuk ¼chuk½ gS",
                            "verse 31:28": "rqe lcdk iSnk djuk vkSj fQj ¼ejus ds ckn½ ftyk mBkuk ,d ’k[+l ds ¼iSnk djus vkSj ftyk mBkus ds½ cjkcj gS cs’kd [+k+qnk ¼rqe lc dh½ lqurk vkSj lc dqN ns[k jgk gS",
                            "verse 31:29": "D;k rwus ;s Hkh [+;ky u fd;k fd [k+qnk gh jkr dks ¼c<+k ds½ fnu esa nkf[k+y dj nsrk gS ¼rks jkr c<+ tkrh gS½ vkSj fnu dks ¼c<+k ds½ jkr esa nkf[k+y dj nsrk gS ¼rks fnu c<+ tkrk gS½ mlh us vkQrkc o ekgrkc dks ¼xks;k½ rqEgkjk rkcs, cuk fn;k gS fd ,d eqd+jZj eh;kn rd ¼;w¡ gh½ pyrk jgsxk vkSj ¼D;k rwus ;s Hkh [+;ky u fd;k fd½ tks dqN rqe djrs gks [k+qnk mlls [k+wc okfdQdkj gS",
                            "verse 31:30": ";s ¼lc ckrsa½ bl lcc ls gSa fd [k+qnk gh ;d+huh cjgd+ ¼ekcwn½ gS vkSj ml ds flok ftldks yksx iqdkjrs gSa ;d+huh fcYdqy ckfry vkSj blesa ’kd ugha fd [k+qnk gh vkyh’kku vkSj cM+k #rcs okyk gS",
                            "verse 31:31": "D;k rwus bl ij Hkh x+kSj ugha fd;k fd [k+qnk gh ds Qt+y ls d’rh nfj;k esa cgrh pyrh jgrh gS rkfd ¼ydM+h esa ;s d+wor nsdj½ rqe yksxksa dks viuh ¼dq+njr dh½ ckt+ fu’kkfu;k¡ fn[kk ns cs’kd ml esa Hkh reke lcz o ’kqØ djus okys ¼cUnksa½ ds fy, ¼dqnjr [k+qnk dh½ cgqr lh fu’kkfu;k¡ fn[kk ns cs’kd blesa Hkh reke lcz o ’kqØ djus okys ¼cUnksa½ ds fy, ¼d+qnjrs [+k+qnk dh½ cgqr lh fu’kkfu;k¡ gSa",
                            "verse 31:32": "vkSj tc mUgsa ekSt ¼Å¡ph gksdj½ lk,ckuksa dh rjg ¼Åij ls½ <kWd ysrh gS rks fujk [kqjk mlh dk vd+hnk j[kdj [+k+qnk dks iqdkjus yxrs gSa fQj tc [+k+qnk mudks utkr nsdj [kq’dh rd igq¡pk nsrk gS rks muesa ls ckt+ rks dqN nsj ,rnky ij jgrs gSa ¼vkSj ckt+ iDds dkfQj½ vkSj gekjh ¼d+qnjr dh½ fu’kkfu;ksa ls bUdkj rks cl cn,gn vkSj uk’kqØs gh yksx djrs gSa",
                            "verse 31:33": "yksxksa vius ijojfnxkj ls Mjks vkSj ml fnu dk [k+kSQ j[kks tc u dksbZ cki vius csVs ds dke vk,xk vkSj u dksbZ csVk vius cki ds dqN dke vk ldsxk [+k+qnk dk ¼d+;ker dk½ ok;nk fcYdqy iDdk gS rks ¼dgha½ rqe yksxksa dks nqfu;k dh ¼pUn jkst+k½ ft+Unxh /kks[ks esa u Mkys vkSj u dgha rqEgsa Qjsc nsus okyk ¼’kSrku½ dqN Q+jsc ns",
                            "verse 31:34": "cs’kd [+k+qnk gh ds ikl d+;ker ¼ds vkus½ dk bYe gS vkSj ogh ¼tc ekSd+k equkflc ns[krk gS½ ikuh cjlkrk gS vkSj tks dqN vkSjrksa ds isV esa ¼uj eknk½ gS tkurk gS vkSj dksbZ ’k[+l ¼bruk Hkh rks½ ugha tkurk fd og [+k+qn dy D;k djsxk vkSj dksbZ ’k[+l ;s ¼Hkh½ ugha tkurk gS fd og fdl lj t+ehu ij ejs ¼xM+s½ xk cs’kd [+k+qnk ¼lc ckrksa ls½ vkxkg [k+cjnkj gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Alif Laam Miim.",
                            "verse 31:2": "Inilah ayat-ayat Al Qur’an yang mengandung hikmah,",
                            "verse 31:3": "menjadi petunjuk dan rahmat bagi orang-orang yang berbuat kebaikan.",
                            "verse 31:4": "(yaitu) orang-orang yang mendirikan salat, menunaikan zakat dan mereka yakin akan adanya negeri akhirat.",
                            "verse 31:5": "Mereka itulah orang-orang yang tetap mendapat petunjuk dari Tuhannya dan mereka itulah orang-orang yang beruntung.",
                            "verse 31:6": "Dan di antara manusia (ada) orang yang mempergunakan perkataan yang tidak berguna untuk menyesatkan (manusia) dari jalan Allah tanpa pengetahuan dan menjadikan jalan Allah itu olok-olokan. Mereka itu akan memperoleh azab yang menghinakan.",
                            "verse 31:7": "Dan apabila dibacakan kepadanya ayat-ayat Kami dia berpaling dengan menyombongkan diri seolah-olah dia belum mendengarnya, seakan-akan ada sumbat di kedua telinganya; maka beri kabar gembiralah dia dengan azab yang pedih.",
                            "verse 31:8": "Sesungguhnya orang-orang yang beriman dan mengerjakan amal-amal saleh, bagi mereka surga-surga yang penuh keni’matan,",
                            "verse 31:9": "Kekal mereka di dalamnya; sebagai janji Allah yang benar. Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.",
                            "verse 31:10": "Dia menciptakan langit tanpa tiang yang kamu melihatnya dan Dia meletakkan gunung-gunung (di permukaan) bumi supaya bumi itu tidak menggoyangkan kamu; dan memperkembang biakkan padanya segala macam jenis binatang. Dan Kami turunkan air hujan dari langit, lalu Kami tumbuhkan padanya segala macam tumbuh-tumbuhan yang baik.",
                            "verse 31:11": "Inilah ciptaan Allah, maka perlihatkanlah olehmu kepadaku apa yang telah diciptakan oleh sembahan-sembahan (mu) selain Allah sebenarnya orang-orang yang zalim itu berada di dalam kesesatan yang nyata.",
                            "verse 31:12": "Dan sesungguhnya telah Kami berikan hikmah kepada Luqman, yaitu: \"Bersyukurlah kepada Allah. Dan barangsiapa yang bersyukur (kepada Allah), maka sesungguhnya ia bersyukur untuk dirinya sendiri; dan barangsiapa yang tidak bersyukur, maka sesungguhnya Allah Maha Kaya lagi Maha Terpuji\".",
                            "verse 31:13": "Dan (ingatlah) ketika Luqman berkata kepada anaknya, di waktu ia memberi pelajaran kepadanya: \"Hai anakku, janganlah kamu mempersekutukan (Allah) sesungguhnya mempersekutukan (Allah) adalah benar-benar kezaliman yang besar\".",
                            "verse 31:14": "Dan Kami perintahkan kepada manusia (berbuat baik) kepada dua orang ibu-bapaknya; ibunya telah mengandungnya dalam keadaan lemah yang bertambah-tambah, dan menyapihnya dalam dua tahun Bersyukurlah kepada-Ku dan kepada dua orang ibu bapakmu, hanya kepada-Kulah kembalimu.",
                            "verse 31:15": "Dan jika keduanya memaksamu untuk mempersekutukan dengan Aku sesuatu yang tidak ada pengetahuanmu tentang itu, maka janganlah kamu mengikuti keduanya, dan pergaulilah keduanya di dunia dengan baik, dan ikutilah jalan orang yang kembali kepada-Ku, kemudian hanya kepada-Kulah kembalimu, maka Ku-beritakan kepadamu apa yang telah kamu kerjakan.",
                            "verse 31:16": "(Luqman berkata): \"Hai anakku, sesungguhnya jika ada (sesuatu perbuatan) seberat biji sawi, dan berada dalam batu atau di langit atau di dalam bumi, niscaya Allah akan mendatangkannya (membalasinya). Sesungguhnya Allah Maha Halus lagi Maha Mengetahui.",
                            "verse 31:17": "Hai anakku, dirikanlah shalat dan suruhlah (manusia) mengerjakan yang baik dan cegahlah (mereka) dari perbuatan yang mungkar dan bersabarlah terhadap apa yang menimpa kamu. Sesungguhnya yang demikian itu termasuk hal-hal yang diwajibkan (oleh Allah).",
                            "verse 31:18": "Dan janganlah kamu memalingkan mukamu dari manusia (karena sombong) dan janganlah kamu berjalan di muka bumi dengan angkuh. Sesungguhnya Allah tidak menyukai orang-orang yang sombong lagi membanggakan diri.",
                            "verse 31:19": "Dan sederhanalah kamu dalam berjalan dan lunakkanlah suaramu. Sesungguhnya seburuk-buruk suara ialah suara keledai.",
                            "verse 31:20": "Tidakkah kamu perhatikan sesungguhnya Allah telah menundukkan untuk (kepentingan)mu apa yang di langit dan apa yang di bumi dan menyempurnakan untukmu ni’mat-Nya lahir dan batin. Dan di antara manusia ada yang membantah tentang (keesaan) Allah tanpa ilmu pengetahuan atau petunjuk dan tanpa Kitab yang memberi penerangan.",
                            "verse 31:21": "Dan apabila dikatakan kepada mereka: \"Ikutilah apa yang diturunkan Allah\". Mereka menjawab: \"(Tidak), tapi kami (hanya) mengikuti apa yang kami dapati bapak-bapak kami mengerjakannya\". Dan apakah mereka (akan mengikuti bapak-bapak mereka) walaupun syaitan itu menyeru mereka ke dalam siksa api yang menyala-nyala (neraka)?",
                            "verse 31:22": "Dan barangsiapa yang menyerahkan dirinya kepada Allah, sedang dia orang yang berbuat kebaikan, maka sesungguhnya ia telah berpegang kepada buhul tali yang kokoh. Dan hanya kepada Allah-lah kesudahan segala urusan.",
                            "verse 31:23": "Dan barangsiapa kafir maka kekafirannya itu janganlah menyedihkanmu. Hanya kepada Kami-lah mereka kembali, lalu Kami beritakan kepada mereka apa yang telah mereka kerjakan. Sesungguhnya Allah Maha Mengetahui segala isi hati.",
                            "verse 31:24": "Kami biarkan mereka bersenang-senang sebentar, kemudian Kami paksa mereka (masuk) ke dalam siksa yang keras.",
                            "verse 31:25": "Dan sesungguhnya jika kamu tanyakan kepada mereka: \"Siapakah yang menciptakan langit dan bumi?\" Tentu mereka akan menjawab: \"Allah\". Katakanlah: \"Segala puji bagi Allah\"; tetapi kebanyakan mereka tidak mengetahui.",
                            "verse 31:26": "Kepunyaan Allah-lah apa yang di langit dan yang di bumi. Sesungguhnya Allah Dia-lah Yang Maha Kaya lagi Maha Terpuji.",
                            "verse 31:27": "Dan seandainya pohon-pohon di bumi menjadi pena dan laut (menjadi tinta), ditambahkan kepadanya tujuh laut (lagi) sesudah (kering)nya, niscaya tidak akan habis-habisnya (dituliskan) kalimat Allah. Sesungguhnya Allah Maha Perkasa lagi Maha Bijaksana.",
                            "verse 31:28": "Tidaklah Allah menciptakan dan membangkitkan kamu (dari dalam kubur) itu melainkan hanyalah seperti (menciptakan dan membangkitkan) satu jiwa saja. Sesungguhnya Allah Maha Mendengar lagi Maha Melihat.",
                            "verse 31:29": "Tidakkah kamu memperhatikan, bahwa sesungguhnya Allah memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam dan Dia tundukkan matahari dan bulan masing-masing berjalan sampai kepada waktu yang ditentukan, dan sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan.",
                            "verse 31:30": "Demikianlah, karena sesungguhnya Allah, Dia-lah yang hak dan sesungguhnya apa saja yang mereka seru selain dari Allah itulah yang bathil; dan sesungguhnya Allah, Dialah Yang Maha Tinggi lagi Maha Besar.",
                            "verse 31:31": "Tidakkah kamu memperhatikan bahwa sesungguhnya kapal itu berlayar di laut dengan ni’mat Allah, supaya diperlihatkan-Nya kepadamu sebagian dari tanda-tanda (kekuasaan)-Nya. Sesungguhnya pada yang demikian itu benar-benar terdapat tanda-tanda bagi semua orang yang sangat sabar lagi banyak bersyukur.",
                            "verse 31:32": "Dan apabila mereka dilamun ombak yang besar seperti gunung, mereka menyeru Allah dengan memurnikan keta’atan kepada-Nya maka tatkala Allah menyelamatkan mereka sampai di daratan, lalu sebagian mereka tetap menempuh jalan yang lurus. Dan tidak ada yang mengingkari ayat-ayat Kami selain orang-orang yang tidak setia lagi ingkar.",
                            "verse 31:33": "Hai manusia, bertakwalah kepada Tuhanmu dan takutilah suatu hari yang (pada hari itu) seorang bapak tidak dapat menolong anaknya dan seorang anak tidak dapat (pula) menolong bapaknya sedikitpun. Sesungguhnya janji Allah adalah benar, maka janganlah sekali-kali kehidupan dunia memperdayakan kamu, dan jangan (pula) penipu (syaitan) memperdayakan kamu dalam (menta’ati) Allah.",
                            "verse 31:34": "Sesungguhnya Allah, hanya pada sisi-Nya sajalah pengetahuan tentang Hari Kiamat; dan Dia-lah Yang menurunkan hujan, dan mengetahui apa yang ada dalam rahim. Dan tiada seorangpun yang dapat mengetahui (dengan pasti) apa yang akan diusahakannya besok. Dan tiada seorangpun yang dapat mengetahui di bumi mana dia akan mati. Sesungguhnya Allah Maha Mengetahui lagi Maha Mengenal."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Alif, Lâm, Mîm .",
                            "verse 31:2": "Questi sono i versetti del Libro saggio",
                            "verse 31:3": "guida e misericordia per coloro che compiono il bene",
                            "verse 31:4": "che assolvono all'orazione e pagano la decima e fermamente credono nell'altra vita,",
                            "verse 31:5": "che seguono la guida del loro Signore: questi sono coloro che prospereranno.",
                            "verse 31:6": "Tra gli uomini vi è chi compra storie ridicole per traviare gli uomini dal sentiero di Allah e burlarsi di esso: quelli avranno un castigo umiliante.",
                            "verse 31:7": "Quando gli si recitano i Nostri versetti, volge le spalle superbo come se non li avesse sentiti, come se avesse un peso nelle orecchie. Dagli annuncio di un doloroso castigo.",
                            "verse 31:8": "Coloro che credono e compiono il bene avranno i Giardini della Delizia,",
                            "verse 31:9": "dove rimarranno in perpetuo: questa in verità la promessa di Allah. Egli è l'Eccelso, il Saggio.",
                            "verse 31:10": "Ha creato i cieli senza pilastri che possiate vedere, ha infisso le montagne sulla terra,-ché altrimenti si sarebbe mossa e voi con essa e l'ha popolata di animali di tutte le specie. Abbiamo fatto scendere un'acqua [dal cielo] e abbiamo fatto germogliare ogni tipo di magnifica specie [di piante].",
                            "verse 31:11": "Questa la creazione di Allah. Mostratemi allora quello che hanno creato gli altri [che adorate] all'infuori di Lui. No, gli ingiusti sono in errore palese.",
                            "verse 31:12": "Certamente fummo Noi a dare la saggezza a Luqmân : «Sii riconoscente ad Allah: chi è riconoscente lo è per se stesso. Quanto a colui che è ingrato, in verità Allah è Colui che basta a Se stesso, il Degno di lode».",
                            "verse 31:13": "E [ricorda] quando Luqmân disse a suo figlio: «Figlio mio, non attribuire ad Allah associati. Attribuirgli associati è un'enorme ingiustizia».",
                            "verse 31:14": "Abbiamo imposto all'uomo di trattare bene i suoi genitori: lo portò sua madre di travaglio in travaglio e lo svezzò dopo due anni: «Sii riconoscente a Me e ai tuoi genitori . Il destino ultimo è verso di Me.",
                            "verse 31:15": "E se entrambi ti obbligassero ad associarMi ciò di cui non hai conoscenza alcuna, non obbedire loro, ma sii comunque cortese con loro in questa vita e segui la via di chi si rivolge a Me. Poi a Me farete ritorno e vi informerò su quello che avrete fatto».",
                            "verse 31:16": "« O figlio mio, anche se fosse come il peso di un granello di senape, nel profondo di una roccia o nei cieli o sulla terra, Allah lo porterà alla luce . Allah è dolce e ben informato.",
                            "verse 31:17": "O figlio mio, assolvi all'orazione, raccomanda le buone consuetudini e proibisci il biasimevole e sopporta con pazienza quello che ti succede: questo il comportamento da tenere in ogni impresa.",
                            "verse 31:18": "Non voltare la tua guancia dagli uomini e non calpestare la terra con arroganza: in verità Allah non ama il superbo vanaglorioso.",
                            "verse 31:19": "Sii modesto nel camminare e abbassa la tua voce: invero la più sgradevole delle voci è quella dell'asino».",
                            "verse 31:20": "Non vedete come Allah vi ha sottomesso quel che è nei cieli e sulla terra e ha diffuso su di voi i Suoi favori, palesi e nascosti? Ciononostante vi è qualcuno tra gli uomini che polemizza a proposito di Allah senza avere né scienza né guida né un Libro luminoso .",
                            "verse 31:21": "E quando si dice loro: « Seguite quello che Allah ha rivelato», rispondono: « Seguiremo invece quello che abbiamo trovato presso i nostri avi!» [Insisterebbero così] anche se Satana li chiamasse al castigo del la Fiamma?",
                            "verse 31:22": "Chi sottomette il suo volto ad Allah e compie il bene, si afferra all'ansa più salda. In Allah è l'esito di tutte le cose!",
                            "verse 31:23": "Quanto a chi è miscredente, non ti affligga la sua miscredenza: a Noi faranno ritorno e li informeremo di quel che avranno fatto. Allah conosce perfettamente cosa c'è nei cuori.",
                            "verse 31:24": "Diamo loro godimento effimero per un po' di tempo e poi li spingeremo con forza nel castigo terribile.",
                            "verse 31:25": "Se domandi loro: « Chi ha creato i cieli e la terra?», certamente risponderanno: « Allah». Di': «Lode ad Allah!» Ma la maggior parte di loro non sanno.",
                            "verse 31:26": "[Appartiene] ad Allah tutto quello che è nei cieli e sulla terra. Allah basta a Se stesso, è il Degno di lode.",
                            "verse 31:27": "Anche se tutti gli alberi della terra diventassero calami , e il mare e altri sette mari ancora [fossero inchiostro], non potrebbero esaurire le parole di Allah. In verità Allah è eccelso, saggio .",
                            "verse 31:28": "La vostra creazione e resurrezione [per Allah] è [facile] come quella di una sola anima. Allah è l'Audiente, Colui che tutto osserva.",
                            "verse 31:29": "Non hai visto come Allah ha fatto sì che la notte compenetri il giorno e il giorno compenetri la notte? E [come] ha sottomesso il sole e la luna, ciascuno dei quali procede [nel suo corso] fino a un termine stabilito?",
                            "verse 31:30": "Ciò in quanto Allah è la Verità, mentre quel che invocano all'infuori di Lui è falsità. Allah è l'Altissimo, il Grande.",
                            "verse 31:31": "Non hai visto che è per grazia di Allah che la nave solca il mare, affinché vi mostri qualcuno dei Suoi segni? In verita in ciò vi sono segni per ogni uomo di perserveranza, di riconoscenza.",
                            "verse 31:32": "Quando li copre un'onda come fosse tenebra, invocano Allah e Gli rendono un culto puro; quando poi [Allah] li mette al sicuro sulla terra ferma, alcuni di loro seguono una via intermedia . Solo il peggior traditore, il peggior ingrato rinnegherà i Nostri segni.",
                            "verse 31:33": "Uomini, temete il vostro Signore e paventate il Giorno in cui il padre non potrà soddisfare il figlio né il figlio potrà soddisfare il padre in alcunché. La promessa di Allah è verità. Badate che non vi inganni la vita terrena e non vi inganni su Allah l'Ingannatore .",
                            "verse 31:34": "In verità la scienza dell'Ora è presso Allah, Colui che fa scendere la pioggia e conosce quello che c'è negli uteri. Nessuno conosce ciò che guadagnerà l'indomani e nessuno conosce la terra in cui morrà. In verità Allah è il Sapiente, il Ben informato ."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "アリフ・ラーム・ミーム。",
                            "verse 31:2": "これは英知の啓典の微節（印）であり，",
                            "verse 31:3": "善行に勤しむ者への導きであり，また慈悲である。",
                            "verse 31:4": "礼拝の務めを守り，定めの喜捨をなし，また，来世を堅く信じる者たちへの（導きであり慈悲）である。",
                            "verse 31:5": "これらの者は主の御導きの許にあり，かれらこそは成功する者である。",
                            "verse 31:6": "だが人びとの中には，無益の話を買い込んで，知識もないくせに（人びとを）アッラーの道から背かせ，（正しい道に）嘲笑を浴びせる者がある。これらの者には，恥ずべき懲罰が下るであろう。",
                            "verse 31:7": "われの印がこのような者に向かって読誦されると，かれらはそれを聞こえないかのように，まるで聾唖者であるかのように，高慢に背を向けて去る。そのような者には，痛ましい懲罰（に就いての消息）を告げなさい。",
                            "verse 31:8": "信仰して善行に動しむ者には喜びの楽園があり，",
                            "verse 31:9": "永遠にその中に住むであろう。アッラーの御約束は真実である。かれは偉力ならびなく英明であられる。",
                            "verse 31:10": "かれは，あなたがたに見える柱もなしに諸天を創り，また地上には確りと山々を据えてあなたがたと共にぐらつかないようになされる。種々雑多な動物をそれに(捲?)き散らされる。またわれは，天から雨を降らせ，いろいろな見事なものをそこに雌雄で生育させた。",
                            "verse 31:11": "これがアッラーの創造である。アッラー以外のものが，創造したものがあればわれに示せ。いや，性悪者たちは，明らかに迷いの中にいる。",
                            "verse 31:12": "われは（以前に）ルクマーンに，アッラーに感謝するよう英知を授けた。誰でも感謝する者は，自分の魂のために感謝するのである。だが恩を忘れる者がいたところで，本当にアッラーには，何の問題もない。かれは讃美される方である。",
                            "verse 31:13": "さてルクマーンが，自分の息子を戒めてこう言った時を思い起しなさい。「息子よ，アッラーに（外の神を）同等に配してはならない。それを配するのは，大変な不義である。」",
                            "verse 31:14": "われは，両親への態度を人間に指示した。人間の母親は，苦労に(空?)れてその（子）を胎内で養い，更に離乳まで2年かかる。「われとあなたの父母に感謝しなさい。われに（最後の）帰り所はあるのである。",
                            "verse 31:15": "だがもし，あなたの知らないものを，われに（同等に）配することを，かれら（両親）があなたに強いても，かれらに従ってはならない。だが現世では懇切にかれらに仕え，悔悟してわれの許に帰る者に従え。やがてあなたがたはわれに帰り，われはあなたがたの行ったことを告げ知らせるのである。」",
                            "verse 31:16": "（ルクマーンは言った。）「息子よ，仮令芥子粒程の重さでも，それが岩の中，または天の上，または地の下に（潜んで）いても，アッラーはそれを探し出される。本当にアッラーは深奥の神秘を知っておられ，（それらに）通暁なされる方であられる。」",
                            "verse 31:17": "「息子よ，礼拝の務めを守り，善を（人に）勧め悪を禁じ，あなたに降りかかることを耐え忍ベ。本当にそれはアッラーが人に定められたこと。",
                            "verse 31:18": "他人に対して（高慢に）あなたの頬を背けてはならない。また横柄に地上を歩いてはならない。本当にアッラーは，自惚れの強い威張り屋を御好みになられない。",
                            "verse 31:19": "歩き振を穏やかにし，声を低くしなさい。本当に声の最も厭わしいのは，ロバの声である。」",
                            "verse 31:20": "あなたがたは思い起さないのか。アッラーは天にあり地にある凡てのものを，あなたがたの用のために供させ，また外面と内面の恩恵を果されたではないか。だが人びとの中には，知識も導きもなく，また光明の啓典もなく，アッラーに就いて論議する者がある。",
                            "verse 31:21": "かれらに対し，「アッラーが下される啓示に従え。」と言うと，かれらは，「いや，わたしたちは，祖先たちの奉じたものに従う。」と言う。仮令悪魔が，かれらを炎の懲罰に招いてもよいのか。",
                            "verse 31:22": "誰でも善行に励み，真心を尽くしてアッラーに傾� する者は，堅固な取っ手を確り握った者である。凡ての事の終末はアッラーに（帰着するので）ある。",
                            "verse 31:23": "誰が信仰しなくても，その不信心に悩まされてはならない。かれらはわれの許に帰る。その時われは，その行ったことをかれらに告げ知らせるであろう。本当にアッラーは（人間が）胸に抱くことを熟知なされる。",
                            "verse 31:24": "われはしばらくかれらに楽しませ，それから手荒い懲罰に駆り立てるであろう。",
                            "verse 31:25": "あなたがもしかれらに，「天地を創造されたのは誰か。」と問えば，かれらはきっと「アッラー。」と言うであろう。言ってやるがいい。「アッラーを讃えます。」だがかれらの多くは理解しないのである。",
                            "verse 31:26": "天と地の凡てのものは，アッラーに属する。本当にアッラーは満ち足られる方，讃美されるべき方であられる。",
                            "verse 31:27": "仮令え地上の凡ての木がペンであって，また海（が墨で），その外に7つの海をそれに差し添えても，アッラーの御言葉は（書き）尽くすことは出来ない。本当にアッラーは，偉力ならびなく英明であられる。",
                            "verse 31:28": "あなたがた（無数）の創造もまた復活も，まるで一個の魂を扱うようなものに過ぎない。本当にアッラーは全聴にして全視であられる。",
                            "verse 31:29": "あなたは見ないのか，アッラーが夜を昼に入り込ませ，また昼を夜の中に入り込ませ，更に太陽と月を従わせてそれぞれ定められた期間にその（軌道）を運行なされるのを。本当にアッラーはあなたがたの行うことを熟知なされる。",
                            "verse 31:30": "それはアッラーこそが真理であられるためである。かれを差し置いて，あなたがたの祈るのは虚偽のものである。本当にアッラーこそは，至高にして至大であられる。",
                            "verse 31:31": "あなたは船が，アッラーの恵みで，大洋を航行するのを見ないのか。（それは）かれの印をあなたがたに示されたためではないか。本当にその中には，不断に耐え忍ぶ者と感謝する凡ての者のために，様々な印がある。",
                            "verse 31:32": "大波が天蓋のようにかれらを覆う時は，アッラーに祈り，誠を尽くしてかれに傾� しなさい。だが，かれらを無事陸地に着かせると，かれらの中の或る者は，（善と悪の中間の）あやふやな状態になる。だが二心ある者，不信心な者の外は，誰もわれの印を否定しない。",
                            "verse 31:33": "人びとよ，あなたがたの主を畏れなさい。また父がその子のために役立たず，子も自分の父のために少しも役立たない日を恐れなさい。本当にアッラーの約束は真実である。あなたがたは現世の生活に欺かれてはならない。アッラーのことに就いて欺く者に，あなたがたは欺かれてはならない。",
                            "verse 31:34": "アッラー，本当にかれ（だけ）が，（審判の）時を知っておられる。かれは雨を降らせられる。また胎内にあるものをも知っておられる。だが（人間は）誰も明日自分が何を稼ぐかを知らず，誰も何処で死ぬかを知らない。本当にアッラーは全知にして凡てに通暁される御方であられる。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "알리프 람 빔",
                            "verse 31:2": "이것이야말로 지혜로운 성서의 말씀이며",
                            "verse 31:3": "선을 행하는 자들을 위한 복 음이며 자비라",
                            "verse 31:4": "이들은 예배를 드리고 이슬람세를 바치며 내세를 확신하도다",
                            "verse 31:5": "이들이 주님으로부터 인도를 받을 자요 이들이 번성할 자들이 라",
                            "verse 31:6": "그러나 사람들 중에는 무익한이야기로 아는 것 없이 하나님의 길을 탈선케 하거나 그것을 조롱 하는 자들이 있나니 그들은 굴욕 적인 벌을 받게 되리라",
                            "verse 31:7": "하나님의 말씀이 그애게 낭송 될 때면 그의 두 귀가 벙어리로 마치 그것을 듣지 않는것처럼 오 만을 피우니 고통스러운 벌이 있 을 것이라 경고하라",
                            "verse 31:8": "그러나 실로 믿음을 갖고 선 을 실천하는 자들에게는 축복의 천국이 있거늘",
                            "verse 31:9": "그 안에서 영생하니라 실로 하나님의 약속은 진실이니 그분은 권능과 지혜로 충만하심이라",
                            "verse 31:10": "하나님은 너희가 보듯 기동 없이 하늘을 창조하셨고 대지 위 에 고정된 산을 세워 너희로 하여 금 흔들리지 아니 하도록 하였으 며 그 안에 모든 동물이 번성하도 록 하셨도다 또한 하늘로부터 비 를 내리게 하여 그 안에 온갖 귀 한 종들이 자응으로 자라게 하셨 노라",
                            "verse 31:11": "이것이 바로 하나님의 창조 이거늘 그분 외에 누가 무엇을 창 조 했느뇨 내게 보여다오 그러나 죄인들은 분명히 잘못속에 빠져 있노라",
                            "verse 31:12": "하나님은 루끄만에게 지혜를주며 하나님께 감사드리라 했거늘 감사를 드리는 자는 곧 자기 자신 을 위한 것이며 감사할 줄 모르는 자가 있다면 실로 하나님께서는 자족하시며 은혜로우시니라",
                            "verse 31:13": "루끄만이 그의 아들에게 훈계하사 아들아 하나님을 불신하 지 말라 실로 하나님을 불신함이 가장 른 죄악이니라",
                            "verse 31:14": "하나님은 모든 인간에게 명령하여 부모를 존경하라 했거늘 그의 어머니는 태아를 가짐과 이 년간 젖을 먹이므로 말미암아 허 약하여지니라 내게 감사하고 그리고 네 부모에게 감사하라 내게로 옴이 최후이니라",
                            "verse 31:15": "그러나 부모가 그대로 하여금 그대가 알지 못하는 것을 숭배케 하여 나를 볼신한다면 그것에 대해서는 그들을 따르지 말며 현 세에서 부모에게 순종하고 내게로향해 회개하는 자의 길을 따르라 그후 너희는 내게로 귀의하리니 그때 내가 너희에게 너희가 행한 일들을 알려 주리라",
                            "verse 31:16": "나의 아들아 겨자씨 만큼이나 작은 것이라 할지라도 그것이 돌속에 있던 하늘위에 있던 깊은 땅속에 있던간에 하나님은 그것을들추어 내시거늘 실로 하나님은 세심히 아시는 분이시라",
                            "verse 31:17": "나의 아들아 예배를 드리라 그리고 선을 행하고 악을 금하며 네가 당하는 모든 것에 인내하라 이것은 실로 용기가 필요한 것이 니라",
                            "verse 31:18": "그리고 너의 얼굴을 돌려 사람들을 경멸하지 말것이며 걸음을 걸을 때면 거만하지 말라 실로 하 나님께서는 오만한 자들을 사랑하 시지 아니 하니라",
                            "verse 31:19": "걸을 때는 겸손하고 너의 목소리를 낮추어라 가장 중오스러운 목소리는 당나귀 같은 소리라",
                            "verse 31:20": "하나님께서 하늘에 있는 것 과 땅속에 있는 모든 것이 너희에 게 유용하도록 하였으며 그분의 은혜를 보이게 또는 보이지 않게 너희를 위해 완성하셨음을 너희는 알지 못하느뇨 사람들 중에는 지 식도 없고 인도 받음도 없이 그리 고 그들을 교화시키는 성서도 없 이 하나님에 관하여 논쟁하는자가 있더라",
                            "verse 31:21": "하나님께서 계시한 것을 따 르라 하니 우리는 우리의 선조들 이 하는대로 하리라고 그들은 말 하도다 이는 실로 사탄이 그들을 타오르는 불지옥의 형벌로 유혹함 이 아니더뇨",
                            "verse 31:22": "모든 일을 하나님께 의탁하 고 선을 행하는 자는 가장 단단한손잡이를 붙잡으니 만사의 종결이하나님께 있게 되니라",
                            "verse 31:23": "믿음을 거역한자 있다 하여 그의 불신이 그대를 슬프게 하지 않으리라 그들이 하나님께 귀의하나니 하나님은 그들에게 그들이 행했던 모든 것을 알려 주리라 실로 하나님께서는 인간 마음 속의 모든 것을 알고 계시노라",
                            "verse 31:24": "하나님은 잠시 그들로 하여 금 향락케 하다가 그들을 엄한 벌로 유도하니라",
                            "verse 31:25": "만일 그대가 천지를 창조하 신 분이 누구냐고 그들에게 묻는 다면 하나님이라 말하리라 하나님을 찬미하라 그러나 그들 대다수 는 알지 못하더라",
                            "verse 31:26": "천지에 있는 모든 것이 하나님께 있나니 실로 하나님은 풍요 와 자비로 충만 하심이라",
                            "verse 31:27": "지상에 있는 모든 수목이 연필이 되고 일곱개의 바다를 더하 여 물로 가득찬 바다가 잉크가 된다 하더라도 하나님 말씀 모두를 기륵 할 수는 없나니 실로 하나님온 권능과 지혜로 충만하심이라",
                            "verse 31:28": "너희를 창조하고 또 부활시 키는 것은 한 생명을 창조하고 부 활하는 정도와 같아서 실로 하나 님은 들으시고 지켜보고 계시노라",
                            "verse 31:29": "하나님께서는 낮 다음에 밤 이 오게하고 밤 후에는 낮을 오게 하시며 태양과 달을 그분의 법칙에따르게 하시니 모든 것이 제 운행 을 하고 있음을 너희는 알지 못하 느뇨 실로 하나님은 너희가 알고 있는 모든 것을 알고 계시니라",
                            "verse 31:30": "이는 하나님께서 진리이기 때문이라 그분 외에 다른 것을 숭 배하는 것은 허위라 실로 하나님 은 가장 높고 위대하심이라",
                            "verse 31:31": "하나님의 은혜로 말미암아 배들이 운행함을 알지 못하느뇨 이는 그분 예중을 너희에게 보여 주심이니 실로 그안에는 인내하고 감사하는 모든 자들을 위한 예증 이 있노라",
                            "verse 31:32": "산과 같은 파도가 그들을 덮 칠 때 그들은 하나님께 구원을 청 하고 그분께 성실히 복종하매 하 나님이 그들을 육지로 구출하니 그들 중에는 중간에 있는자 있고 또 거역하는자 있도다 그러나 어 느 누구도 하나님의 예증을 거역 하지 아니하나 은혜를 망각한 불 신자들은 제외더라",
                            "verse 31:33": "백성들이여 너희 주님을 경 외하고 다가올 그날을 두려워 하 라 그때는 아버지가 아들에게 도 움이 되지 못하고 아들이 그의 아 버지께 무익 하도다 실로 하나님 의 약속은 진실이나니 이 현세가 너희들을 현혹토록 해서는 아니되 며 유혹하는 자들이 너희를 유혹 케 하지 않도록 하라",
                            "verse 31:34": "심판의 날과 비가 내림과 태아에 있는 것과 너희가 매일 무엇을 얻을 것이며 너희가 어느 곳에서 죽을 것인가 하는 것은 하나님만이 아심이라 실로 하나님은 지 해와 아심으로 충만하시니라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "سه‌رنجی سه‌ره‌تای سوره‌تی (البقرة) بده‌.",
                            "verse 31:2": "ئه‌وه چه‌نده‌ها ئایه‌ت و فه‌رمانێکن له قورئانی پڕ له حیکمه‌ت و دانایی.",
                            "verse 31:3": "ئه‌م قورئانه هیدایه‌ت به‌خش و ڕێنموویی به‌خش و ڕه‌حمه‌ت و میهره‌بانیه بۆ چاکه‌کاران...",
                            "verse 31:4": "ئه‌وانه‌ی که نوێژه‌کانیان به چاکی ئه‌نجام ده‌ده‌ن، زه‌کاتیش (له ماڵ و سامانیان) ده‌رده‌که‌ن، دڵنیاش ده‌بن به‌هاتنه دیی ڕۆژی قیامه‌ت (خۆیانی بۆ ئاماده ده‌که‌ن).",
                            "verse 31:5": "ئا ئه‌وانه له‌سه‌ر ڕێنموویی و ڕێبازی په‌روه‌ردگاریانن، ئا ئه‌وانه‌شن ڕزگار و سه‌رفراز.",
                            "verse 31:6": "هه‌ندێک له خه‌ڵکی هه‌ن قسه‌ی بێ خێر و بێ مانا ده‌کڕن (وه‌ک گۆرانیه ناپوخته‌کان، کتێب و شریته بێ خێره‌کان... هتد) تا خۆی و که‌سانی تریش له ڕێبازی خوا وێڵ بکات، بێ ئه‌وه‌ی هه‌ست بکات به‌مه‌ترسی کاره‌که‌ی و بزانێت چ که‌تنێک ده‌کات به خۆی و خه‌ڵکی و بۆیه ئه‌و شته بێ نرخو خێرانه ده‌کرێت تا گاڵته به په‌یام و ڕێبازی خوا بکات، ئا ئه‌وانه سزا و تۆڵه‌یه‌کی ڕیسواکه‌رو ئابڕووبه‌ر چاوه‌ڕێیانه‌.",
                            "verse 31:7": "هه‌ر کاتێکیش ئایه‌ته‌کانی ئێمه‌ی به‌سه‌ردا ده‌خوێنرێته‌وه‌، فیز ده‌کات و فوو ده‌کاته خۆی و پشت هه‌ڵده‌کات، هه‌روه‌ک نه‌یبیستبێت، هه‌روه‌ک له گوێیدا قورسی و گرانیی هه‌بێت، که‌وابوو مژده بده به‌و جۆره که‌سانه به‌وه‌ی سزای به ئێش چاوه‌ڕێیانه‌!!",
                            "verse 31:8": "به‌ڕاستی ئه‌وانه ئیمانیان هێناوه و کرده‌وه چاکه‌کانیان ئه‌نجامداوه‌، چه‌نده‌ها باخچه‌ی به‌هه‌شتی پڕ له نازو نیعمه‌ت بۆیان ئاماده‌یه‌...",
                            "verse 31:9": "هاوڕێ له‌گه‌ڵ ژیانی نه‌بڕاوه و نه‌مریی تیایدا، ئه‌و به‌ڵێنه‌ی خوا پیی داوون، وه‌عده و به‌ڵێنێکی حه‌ق و ڕاسته و هه‌ر دێته دی، به‌ڕاستی ئه‌و زاته به ده‌سه‌ڵات و دانایه‌.",
                            "verse 31:10": "ئاسمانه‌کانی دروست کردووه به‌بێ کۆڵه‌که به‌چاوی خۆتان ده‌یانبینن، له زه‌ویشدا کێوه‌کانی دامه‌زراندوه که له‌نگه‌ری زه‌ویان ڕاگرتووه و (چه‌نده‌ها سوودی تریان هه‌یه‌) ئه‌وه‌کو ژێره و ژوورببن و لارببنه‌وه‌، جۆره‌ها زینده‌وه‌ر و گیانله‌به‌ریشی تیادا بڵاوکردۆته‌وه‌، (هه‌روه‌ها ده‌فه‌رموێت): له ئاسمانیشه‌وه ئاومان دابه‌زاند، جۆره‌ها وه‌ک و گژوگیای هاو جووتی به‌سوود و به که‌ڵک و جوان و ڕازاوه‌مان له زه‌ویدا پێ ڕواند.",
                            "verse 31:11": "ئا ئه‌مه‌یه دروستکراوانی خوا، وه‌رن نیشانم بده‌ن بزانم ئه‌وانی ترجگه له‌وزاته‌، چیان دروست کردووه‌، نه‌خێر هیچیان دروست نه‌کردووه‌، به‌ڵکو سته‌مکاران هه‌میشه له گومڕاییه‌کی ئاشکرادان.",
                            "verse 31:12": "سوێند به خوا به ڕاستی ئێمه حیکمه‌ت و دانایمان به ‎_‎‎لوقمان_ به‌خشی، به‌م شێوه‌یه (پێمان وت) شوکرانه بژێرو سوپاسگوزاریه‌که‌ی هه‌ر بۆ خۆی ده‌گه‌ڕێته‌وه، ئه‌وه‌ش سوپاسی خوای نه‌کرد، ئه‌وه بێگومان خوا بێ نیازه‌و سوپاسکراوه (پێویستی به‌سوپاسی که‌س نیه‌).",
                            "verse 31:13": "جا لوقمان به کوڕه‌که‌ی خۆی وت له کاتێکدا که ئامۆژگاری ده‌کرد: کوڕه شیرینه‌که‌م; نه‌که‌یت شتێک یان که‌سێک به هاوتاو هاوبه‌شی خوا بڕیار بده‌یت، چونکه به‌ڕاستی هاوتاو هاوبه‌ش بڕیاردان سته‌مێکی زۆر گه‌وره و ناڕه‌وایه‌.",
                            "verse 31:14": "(لێره‌دا خوا ئامۆژگاریه‌کان له ده‌می لوقمان ده‌فه‌رموێت): ئێمه فه‌رمانمانداوه به ئاده‌میزاد به چاک ڕه‌فتاری له‌گه‌ڵ دایک و باوکیدا، دایکی به ئێش و ئازارو لاوازی و بێتاقه‌تیه‌کی زۆره‌وه‌، (به پێستی سکی نۆ مانگ) هه‌ڵی گرتووه‌، بڕینه‌وه‌شی له دوای دوو ساڵه‌، فه‌رمانمان پێدا که ئه‌ی ئینسان سوپاسگوزاری منیش و دایک و باوکیشت به‌، دڵنیابن که گه‌ڕانه‌وه‌تان هه‌ر بۆ لای منه‌.",
                            "verse 31:15": "ئه‌گه‌ر دایک و باوکت کۆششیان له‌گه‌ڵتا کرد، تا به‌بێ هیچ به‌ڵگه و زانیاریه‌ک هاوه‌ك بۆ من قسه‌یان مه‌که‌، له دنیاشدا هاوڕێ و هاوه‌ڵ و خزمه‌تگوزارێکی چاک به بۆیان له هه‌موو بارو دۆخێکدا، شوێنی ڕێبازی ئه‌وانه بکه‌وه که بۆلای من گه‌ڕاونه‌ته‌وه‌، له‌وه‌وداو گه‌ڕانه‌وه‌تان هه‌ر بۆ لای منه‌، جا هه‌واڵتان ده‌ده‌مێ به‌و کارو کرده‌وانه‌ی که ده‌تانکرد.",
                            "verse 31:16": "پاشان له‌سه‌ر زاری لوقمان ده‌فه‌رموێت: ئه‌ی کوڕی ئازیزم: به‌ڕاستی ئه‌گه‌ر گوناهێک به قه‌ده‌ر تۆوی خه‌رته‌له‌یه‌ک (که زۆر ورده‌) هه‌بێت و له‌ناو به‌ردێکدا له ئاسمانه‌کان یان له‌و زه‌ویدا حه‌شاردرا بێت، (لای خوا شاراوه نیه‌) و ده‌یهێنێته مه‌یدان، چونکه به‌ڕاستی خوا هیچ شتێکی لێ شاراوه نیه و زۆریش ئاگایه‌.",
                            "verse 31:17": "کوڕی شیرینم نوێژه‌کانت به چاکی ئه‌نجام بده‌، فه‌رمان به چاکه بده‌، قه‌ده‌غه له گوناهو خراپه بکه‌، به ئارامبه له به‌رامبه‌ر ئه‌و ناخۆشیانه‌ی که تووشت ده‌بێت، به‌ڕاستی ئه‌وانه‌ی که باسکران هه‌ندێکن له‌وانه‌ی هه‌ر ده‌بێت بکرێن.",
                            "verse 31:18": "هه‌وره‌ها ڕووت وه‌رمه‌گێڕه له خه‌ڵكی و (لووت به‌رز مه‌به و به‌چاوی سووک سه‌یریان مه‌که‌)، به‌سه‌ر زه‌ویدا به‌ناز و فیزه‌وه مه‌ڕۆ، به‌ڕاستی خوا ئه‌و که‌سانه‌ی خۆش ناوێت که خۆهه‌ڵکێش و فه‌خر فرۆش و فیزاوین.",
                            "verse 31:19": "هه‌وڵ بده له ڕۆیشتنتدا مام ناوه‌ندیانه بڕۆ، به‌ره‌و ئامانجێکی چاک هه‌نگا و بنێ، به‌ده‌نگی هێواش و له‌بار گفتوگۆ بکه و بدوێ، چونکه به‌ڕاستی بێزارترین و ناخۆشترینی ده‌نگه‌کان ده‌نگی گوێ درێژه‌کانه‌.",
                            "verse 31:20": "ئایا سه‌رنجتان نه‌داوه که به‌ڕاستی هه‌رچی له ئاسمانه‌کان و زه‌ویدا هه‌یه هه‌ر هه‌مووی خوا بۆ خزمه‌تی ئێوه‌ی دروست کردووه و ملکه‌چی کردووه‌، هه‌روه‌ها به‌فراوانی نازو نیعمه‌تی ئاشكراو په‌نهانی به‌سه‌ردا ڕژاندون، (له‌گه‌ڵ ئه‌وه‌شدا) هه‌ندێک له خه‌ڵکی موجاده‌له و گفتوگۆی نابه‌جێ ده‌رباره‌ی خوا وبه‌رنامه‌که‌ی ده‌که‌ن، بێ هیچ به‌ڵگه‌یه‌کی زانستی و ڕێنموویه‌کی پێغه‌مبه‌ران و کتێببێکی ڕوونکه‌ره‌وه‌ی خوایی.",
                            "verse 31:21": "کاتێكیش پێیان بوترێت شوێنی ئه‌و به‌رنامه‌یه بکه‌ون که خوا ناردویه‌تی، ئه‌وه هه‌ر شوێنی ئه‌و شتانه ده‌که‌وین که باو و باپیران و مامۆستایانمان په‌یڕه‌وییان لی کردووه‌، ئایا ئه‌گه‌ر شه‌یتانیش بانگی کردبن بۆ سزای داگیرساوی دۆزه‌خ، هه‌ر په‌یڕه‌وی ده‌که‌ن؟!",
                            "verse 31:22": "ئه‌و که‌سه‌ی ڕوو بکاته په‌روه‌ردگاری و کاره‌کانی هه‌مووی بگێڕێته‌وه بۆ لای ئه‌و، له کاتێکدا ئاده‌میزادێکی چاکه‌خوازه‌، ئه‌وه به‌ڕاستی مانای وایه که ده‌ستی به به هێزترین کارێکیش هه‌ر بۆ لای خوا ده‌گه‌ڕێته‌وه‌.",
                            "verse 31:23": "ئه‌وه‌ش کافر بووه‌، ئه‌وه کافربوونه‌که‌ی، خه‌فه‌تبارت نه‌کات، گه‌ڕانه‌وه‌یان هه‌ر بۆ لای ئێمه‌یه‌، جا ئاگاداریان ده‌که‌ینه‌وه به‌وه‌ی که کردوویانه‌، بێگومان خوا ئاگاداره به هه‌موو ئه‌و شتانه‌ی که له سینه‌و دڵ و ده‌روونه‌کاندا حه‌شاردراون.",
                            "verse 31:24": "که‌مێک ماوه‌یان ده‌ده‌ین، تا تاوێک ڕابوێرن، پاشان ناچاریان ده‌کین که بچنه ناو سزای توندو سه‌خته‌وه‌.",
                            "verse 31:25": "سوێند به خوا ئه‌گه‌ر پرسیار له خوانه‌ناسان بکه‌یت: کێ ئاسمانه‌کان و زه‌وی دروست کردووه‌، ئه‌وه به دڵنیاییه‌وه ده‌ڵێن: (الله‌)، دروستی کردوون، تۆش ئه‌ی محمد (صلی الله علیه وسلم) بڵێ: سوپاس و ستایش بۆ خوا (له‌سه‌ر وتنی ڕاستی)، نه‌خێر وانییه‌، ئه‌و وه‌ڵامه له قه‌ناعه‌ته‌وه هه‌ڵنه‌قوڵاوه‌، به‌ڵکو زۆربه‌یان نازانن (له خۆیانه‌وه قسه ده‌که‌ن).",
                            "verse 31:26": "هه‌رچی له ئاسمانه‌کان و زه‌ویدا هه‌یه‌، هه‌ر خوا خاوه‌نیانه‌، به‌ڕاستی هه‌ر ئه‌و خوایه خۆی بێ نیازه و سوپاسگوزاریی هه‌ر شایسته‌ی ئه‌وه (ئه‌گه‌ر خه‌ڵكی به‌وه‌فا و به ئه‌مه‌ک بن).",
                            "verse 31:27": "خۆ ئه‌گه‌ر به‌ڕاستی هه‌رچی دره‌خت هه‌یه له زه‌ویدا ببنه پێنووس، ده‌ریاش چه‌نده‌یه ببێته حه‌وت ئه‌وه‌نده و (ببێته مره‌که‌ف و زانستی ونهێنی دروستکاوه‌کانی خوا بنووسنه‌وه‌)، ئه‌وه هێشتا زانست و زانیاری و فه‌رمانه‌کانی خوا هه‌ر ته‌واو نابێت، به‌ڕاستی خوای گه‌وره به‌ده‌سه‌ڵاته و دانایه‌.",
                            "verse 31:28": "دروستکردن و به دیهێنانی هه‌مووتان و زیندو کردنه‌وه‌تان، ته‌نها وه‌ک دروستکردن و زیندووکردنه‌وه‌ی تاکه‌که‌سێک وایه‌، به‌ڕاستی خوا بیسه‌ره و بینایه‌.",
                            "verse 31:29": "ئایا سه‌رنجت نه‌داوه که به‌ڕاستی خوا شه‌و تێهه‌ڵکێشی ڕۆژ ده‌کات و ڕۆژیش تێهه‌ڵکێشی شه‌و ده‌کات، خۆر و مانگی بۆ ته‌رخان و ملکه‌چ کردون. هه‌ریه‌که‌یان تاکاتێکی دیاریکراو له سوڕانه‌وه‌یاندا به‌رده‌وام ده‌بن، به‌ڕاستی خوا به‌کارو کرده‌وه‌تان زۆر ئاگاداره‌.",
                            "verse 31:30": "ئه‌و شتانه ده‌ریده‌خه‌ن که‌: بێگومان هه‌ر خوا خۆی حه‌ق و ڕاسته‌قینه‌یه‌، به‌ڕاستی هه‌رچی خه‌ڵکی له‌باتی و ناحه‌قیه‌، دڵنیا بن خوا هه‌ر خۆی هه‌میشه به‌رز و پایه بڵندو گه‌وره‌یه‌.",
                            "verse 31:31": "ئایا سه‌رنجت نه‌داوه که به‌ڕاستی که‌شتیه‌کان به ده‌ریادا هاتوچۆ دکه‌ن و ناز و نیعمه‌تی خوا دهێنن و ده‌یبه‌ن و ده‌سه‌ڵاتی خوا ده‌خه‌نه ڕوو، به‌ڕاستی ئا له‌و شتانه دا به‌ڵگه و نیشانه‌ی زۆر هه‌یه بۆ ئه‌و که‌سانه‌ی زۆر دان به خۆدا ده‌گرن و زۆر سوپاسگوزارن.",
                            "verse 31:32": "کاتێکیش له ده‌ریادا شه‌پۆلێک ئابڵوقه‌ی هاوه‌ڵگه‌رو کاره‌کان بدات، وه‌ک کێوه‌کان گه‌وره بێت، ئه‌وه هاناو هاوار هه‌ر بۆ خوا ده‌به‌ن زۆر به دڵسۆزانه ملکه‌چن بۆ خوا، جا کاتێک فریایان ده‌که‌وێت و ڕزگاریان ده‌کات و ده‌یانگه‌یه‌نێته وشکانی، جا هه‌یانه به‌رده‌وام ده‌بێت له سه‌ر ڕێبازی ئیمان و ده‌مێنێته‌وه له‌سه‌ر یه‌کتاناسینی خوای میهره‌بان، (هه‌شیانه ڕێگه‌ی نادروستی خۆی ده‌گرێته‌وه‌)، جا که‌س له ئایات و به‌ڵگه‌کانی ئێمه نکول و په‌یمان شکێنی ناکت جگه له زۆردار و ناپاک و سپڵه‌.",
                            "verse 31:33": "ئه‌ی خه‌ڵکینه له په‌روه‌ردگارتان بترسن (خۆتان له خه‌شم و قینی بپارێزن) و له ڕۆژێک بترسن که باوک فریای ڕۆڵه‌ی خۆی ناکه‌وێت، ڕۆڵه‌یش هیچی له ده‌ست نایه‌ت که بۆ باوکی ئه‌نجامی بدات، به‌ڕاستی به‌ڵێنی خوا به به‌رپابوونی قیامه‌ت، حه‌قیقه‌ت و ڕاسته‌قینه‌یه‌، که‌وابوو وریا بن ژیانی دنیا له خشته‌یان نه‌بات، (نه‌فسی به‌دکار و شه‌یتانی به‌دره‌فتار) سه‌رگه‌ردانتان نه‌کات و غه‌ڕاتان نه‌کات له ڕێبازی خوا.",
                            "verse 31:34": "به‌ڕاستی هه‌ر خوا خۆی زانیاری به‌رپابوونی ڕۆژی قیامه‌ت ده‌زانێت، بارانیش هه‌ر ئه‌و ده‌یبارێنێت، ده‌زانێت چی له سکی دایکاندا هه‌یه‌، هیچ که‌س نازانێت سبه‌ی چی به‌سه‌ردێت و چی ده‌ست ده‌که‌وێت (له‌به‌رهه‌می مادی دنیایی یان له زه‌خیره و توێشووی قیامه‌ت)، هیچ که‌سیش نازانێت له‌سه‌ر چ زه‌ویه‌ک ده‌مرێت و کۆتای به‌ژیانی دێت (هه‌روه‌ها کاتی مردن و چۆنیه‌تیه‌که‌یشی شاراوه‌یه‌) به‌ڕاستی خوا به هه‌موو شتێک زانایه و ئاگاداره‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Alif, Laam, Miim.",
                            "verse 31:2": "Ini ialah ayat-ayat Kitab (Al-Quran) yang mengandungi hikmat-hikmat dan kebenaran yang tetap kukuh,",
                            "verse 31:3": "Menjadi hidayat petunjuk dan rahmat bagi orang-orang yang sedia mengerjakan amal-amal yang baik",
                            "verse 31:4": "Iaitu orang-orang yang mendirikan sembahyang dan memberi zakat, serta mereka yakin tentang adanya hari akhirat.",
                            "verse 31:5": "Mereka itulah yang tetap mendapat hidayat petunjuk dari Tuhan mereka dan merekalah orang-orang yang berjaya.",
                            "verse 31:6": "Dan ada di antara manusia: Orang yang memilih serta membelanjakan hartanya kepada cerita-cerita dan perkara-perkara hiburan yang melalaikan; yang berakibat menyesatkan (dirinya dan orang ramai) dari agama Allah dengan tidak berdasarkan sebarang pengetahuan dan ada pula orang yang menjadikan agama Allah itu sebagai ejek-ejekan; merekalah orang-orang yang akan beroleh azab yang menghinakan.",
                            "verse 31:7": "Dan apabila dibacakan kepadanya ayat-ayat Kami, berpalinglah dia dengan angkuhnya, seoleh-oleh ada penyumbat pada kedua telinganya; maka gembirakanlah dia dengan balasan azab yang tidak terperi sakitnya.",
                            "verse 31:8": "Sesungguhnya orang-orang yang beriman dan beramal soleh, mereka akan beroleh Syurga yang penuh dengan berbagai nikmat;",
                            "verse 31:9": "Kekallah mereka di dalamnya. Demikian dijanjikan Allah (janji yang tetap benar) dan Dialah jua Yang Maha Kuasa, lagi Maha Bijaksana.",
                            "verse 31:10": "Dia menciptakan langit dengan tidak bertiang sebagaimana yang kamu melihatnya; dan Dia mengadakan di bumi gunung-ganang yang menetapnya supaya bumi itu tidak menghayun-hayunkan kamu dan Dia biakkan padanya berbagai jenis binatang; dan Kami menurunkan hujan dari langit, lalu Kami tumbuhkan di bumi berbagai jenis tanaman yang memberi banyak manfaat.",
                            "verse 31:11": "Ini (semuanya adalah) ciptaan Allah, maka cubalah kamu tunjukkan kepadaKu apakah yang telah diciptakan oleh makhluk-makhluk yang lain daripadaNya (yang kamu sembah itu)? (Tidak ada sesuatu pun) bahkan orang-orang yang zalim (dengan perbuatan syiriknya) itu berada dalam kesesatan yang jelas nyata.",
                            "verse 31:12": "Dan sesungguhnya Kami telah memberi kepada Luqman, hikmat kebijaksanaan, (serta Kami perintahkan kepadanya): Bersyukurlah kepada Allah (akan segala nikmatNya kepadamu) dan sesiapa yang bersyukur maka faedahnya itu hanyalah terpulang kepada dirinya sendiri dan sesiapa yang tidak bersyukur (maka tidaklah menjadi hal kepada Allah), kerana sesungguhnya Allah Maha Kaya, lagi Maha Terpuji.",
                            "verse 31:13": "Dan (ingatlah) ketika Luqman berkata kepada anaknya, semasa dia memberi nasihat kepadanya: Wahai anak kesayanganku, janganlah engkau mempersekutukan Allah (dengan sesuatu yang lain), sesungguhnya perbuatan syirik itu adalah satu kezaliman yang besar.",
                            "verse 31:14": "Dan Kami wajibkan manusia berbuat baik kepada kedua ibu bapanya; ibunya telah mengandungnya dengan menanggung kelemahan demi kelemahan (dari awal mengandung hingga akhir menyusunya) dan tempoh menceraikan susunya ialah dalam masa dua tahun; (dengan yang demikian) bersyukurlah kepadaKu dan kepada kedua ibubapamu; dan (ingatlah), kepada Akulah jua tempat kembali (untuk menerima balasan).",
                            "verse 31:15": "Dan jika mereka berdua mendesakmu supaya engkau mempersekutukan denganKu sesuatu yang engkau dengan fikiran sihatmu tidak mengetahui sungguh adanya maka janganlah engkau taat kepada mereka dan bergaulah dengan mereka di dunia dengan cara yang baik dan turutlah jalan orang-orang yang rujuk kembali kepadaKu (dengan tauhid dan amal-amal yang soleh). Kemudian kepada Akulah tempat kembali kamu semuanya, maka Aku akan menerangkan kepada kamu segala yang kamu telah kerjakan.",
                            "verse 31:16": "(Luqman menasihati anaknya dengan berkata): Wahai anak kesayanganku, sesungguhnya jika ada sesuatu perkara (yang baik atau yang buruk) sekalipun seberat bijih sawi serta ia tersembunyi di dalam batu besar atau di langit atau pun di bumi, sudah tetap akan dibawa oleh Allah (untuk dihakimi dan dibalasNya); kerana sesungguhnya Allah Maha Halus pengetahuanNya; lagi Amat Meliputi akan segala yang tersembunyi.",
                            "verse 31:17": "Wahai anak kesayanganku, dirikanlah sembahyang dan suruhlah berbuat kebaikan, serta laranglah daripada melakukan perbuatan yang mungkar dan bersabarlah atas segala bala bencana yang menimpamu. Sesungguhnya yang demikian itu adalah dari perkara-perkara yang dikehendaki diambil berat melakukannya.",
                            "verse 31:18": "Dan janganlah engkau memalingkan mukamu (kerana memandang rendah) kepada manusia, dan janganlah engkau berjalan di bumi dengan berlagak sombong; sesungguhnya Allah tidak suka kepada tiap-tiap orang yang sombong takbur, lagi membanggakan diri.",
                            "verse 31:19": "Dan sederhanakanlah langkahmu semasa berjalan, juga rendahkanlah suaramu (semasa berkata-kata), sesungguhnya seburuk-buruk suara ialah suara keldai.",
                            "verse 31:20": "Tidakkah kamu memperhatikan bahawa Allah telah memudahkan untuk kegunaan kamu apa yang ada di langit dan yang ada di bumi dan telah melimpahkan kepada kami nikmat-nimatNya yang zahir dan yang batin? Dalam pada itu, ada di antara manusia orang yang membantah mengenai (sifat-sifat) Allah dengan tidak berdasarkan sebarang pengetahuan atau sebarang petunjuk dan tidak juga berdasarkan mana-mana Kitab Allah yang menerangi kebenaran.",
                            "verse 31:21": "Dan apabila dikatakan kepada mereka (yang ingkar): Turutlah akan apa yang telah diturunkan oleh Allah. Mereka menjawab: (Tidak), bahkan Kami hanya menurut apa yang Kami dapati datuk nenek kami melakukannya. Patutkah mereka (menurut datuk neneknya) sekalipun Syaitan mengajak mereka itu (melakukan perbuatan yang menjerumuskan mereka) ke dalam azab api Neraka yang marak menjulang?",
                            "verse 31:22": "Dan sesiapa yang berserah diri bulat-bulat kepada Allah (dengan ikhlas) sedang dia berusaha mengerjakan kebaikan, maka sesungguhnya dia telah berpegang kepada simpulan (tali agama) yang teguh dan (ingatlah) kepada Allah jualah kesudahan segala urusan.",
                            "verse 31:23": "Dan sesiapa yang kufur ingkar, maka janganlah engkau (wahai Muhammad) berdukacita tentang kekufurannya itu; kepada Kamilah tempat kembalinya mereka, kemudian Kami akan memberitahu kepada mereka tentang apa yang mereka telah kerjakan. Sesungguhnya Allah Maha Mengetahui akan segala (isi hati) yang terkandung di dalam dada.",
                            "verse 31:24": "Kami akan berikan mereka menikmati kesenangan bagi sementara (di dunia), kemudian Kami akan memaksa mereka (dengan menyeretnya) ke dalam azab yang amat berat.",
                            "verse 31:25": "Dan sesungguhnya jika engkau (wahai Muhammad) bertanya kepada mereka (yang musyrik) itu: Siapakah yang menciptakan langit dan bumi? Sudah tentu mereka akan menjawab: \"Allah\". Ucapkanlah (wahai Muhammad): \"Alhamdulillah\" (sebagai bersyukur disebabkan pengakuan mereka yang demikian tidak mengingkari Allah), bahkan kebanyakan mereka tidak mengetahui (hakikat tauhid dan pengertian syirik).",
                            "verse 31:26": "Allah jua yang memiliki segala yang ada di langit dan di bumi; sesungguhnya Allah Dialah jua Yang Maha Kaya, lagi sentiasa Terpuji.",
                            "verse 31:27": "Dan sekiranya segala pohon yang ada di bumi menjadi pena dan segala lautan (menjadi tinta), dengan dibantu kepadanya tujuh lautan lagi sesudah itu, nescaya tidak akan habis Kalimah-kalimah Allah itu ditulis. Sesungguhnya Allah Maha Kuasa, lagi Maha Bijaksana.",
                            "verse 31:28": "(Bagi Allah Yang Maha Kuasa) soal menciptakan kamu semua (dari tiada kepada ada) dan soal membangkitkan kamu hidup semula sesudah mati, tidak ada apa-apa sukarnya, hanyalah seperti (mencipta dan menghidupkan semula) seorang manusia sahaja. Sesungguhnya Allah Maha Mendengar, lagi Maha Melihat.",
                            "verse 31:29": "Tidakkah engkau memerhatikan bahawa Allah memasukkan malam pada siang dan memasukkan siang pada malam (silih berganti) dan Dia memudahkan matahari dan bulan (untuk faedah makhluk-makhlukNya)? Tiap-tiap satu dari keduanya beredar untuk suatu masa yang telah ditetapkan dan (ingatlah) sesungguhnya Allah Maha Mengetahui dengan mendalam akan apa yang kamu lakukan.",
                            "verse 31:30": "Bersifatnya Allah dengan penuh kekuasaan dan luas ilmu pengetahuan itu kerana bahawasanya Allah Dialah sahaja Tuhan Yang Sebenar-benarnya dan bahawa segala yang mereka sembah selain dari Allah adalah palsu belaka dan (ingatlah) sesungguhnya Allah Dialah Yang Maha Tinggi keadaanNya, lagi Maha Besar (kekuasaanNya).",
                            "verse 31:31": "Tidakkah engkau memerhatikan bahawasanya kapal-kapal belayar di laut dengan nikmat kurnia Allah, untuk diperlihatkan kepada kamu sebahagian dari tanda-tanda kemurahanNya? Sesungguhnya yang demikian itu mengandungi keterangan-keterangan dan bukti (untuk berfikir) bagi tiap-tiap (mukmin) yang tetap teguh pendiriannya, lagi sentiasa bersyukur.",
                            "verse 31:32": "Dan (orang-orang yang tidak bersifat demikian) apabila mereka dirempuh serta diliputi oleh ombak yang besar seperti kelompok-kelompok awan menyerkup, pada saat itu mereka semua berdoa kepada Allah dengan mengikhlaskan kepercayaan mereka kepadaNya semata-mata. Kemudian bila sahaja Allah menyelamatkan mereka ke darat maka sebahagian sahaja di antara mereka yang bersikap adil (lalu bersyukur kepada Allah serta mengesakanNya) dan sememangnya tiada yang mengingkari bukti-bukti kemurahan Kami melainkan tiap-tiap orang yang bersifat pemungkir janji, lagi amat tidak mengenang budi.",
                            "verse 31:33": "Wahai sekalian manusia, bertakwalah kepada Tuhan kamu dan takutilah akan hari (akhirat) yang padanya seseorang ibu atau bapa tidak dapat melepaskan anaknya dari azab dosanya dan seorang anak pula tidak dapat melepaskan ibu atau bapanya dari azab dosa masing-masing sedikit pun. Sesungguhnya janji Allah itu adalah benar, maka janganlah kamu diperdayakan oleh kehidupan dunia dan jangan pula kamu diperdayakan oleh bisikan dan ajakan Syaitan yang menyebabkan kamu berani melanggar perintah Allah.",
                            "verse 31:34": "Sesungguhnya di sisi Allah pengetahuan yang tepat tentang hari kiamat dan Dialah jua Yang Menurunkan hujan dan Yang Mengetahui dengan sebenar-benarnya tentang apa yang ada dalam rahim (ibu yang mengandung) dan tiada seseorang pun yang betul mengetahui apa yang akan diusahakannya esok (samada baik atau jahat); dan tiada seorangpun yang dapat mengetahui di bumi negeri manakah dia akan mati. Sesungguhnya Allah Maha Mengetahui, lagi Amat Meliputi pengetahuanNya."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "الم",
                            "verse 31:2": "اين آيات كتاب حكيم است (كتابى پرمحتوا و استوار)!",
                            "verse 31:3": "مايه هدايت و رحمت براى نيكوكاران است",
                            "verse 31:4": "همانان كه نماز را برپا مى‏دارند، و زكات را مى‏پردازند و آنها به آخرت يقين دارند",
                            "verse 31:5": "آنان بر طريق هدايت از پروردگارشانند، و آنانند رستگاران!",
                            "verse 31:6": "و بعضى از مردم سخنان بيهوده را مى‏خرند تا مردم را از روى نادانى، از راه خدا گمراه سازند و آيات الهى را به استهزا گيرند; براى آنان عذابى خواركننده است!",
                            "verse 31:7": "و هنگامى كه آيات ما بر او خوانده مى‏شود، مستكبرانه روى برمى‏گرداند، گويى آن را نشنيده است; گويى اصلا گوشهايش سنگين است! او را به عذابى دردناك بشارت ده!",
                            "verse 31:8": "(ولى) كسانى كه ايمان آورده و اعمال صالح انجام داده‏اند، باغهاى پرنعمت بهشت از آن آنهاست;",
                            "verse 31:9": "جاودانه در آن خواهند ماند; اين وعده حتمى الهى است; و اوست عزيز و حكيم (شكست‏ناپذير و دانا)",
                            "verse 31:10": "(او) آسمانها را بدون ستونى كه آن را ببينيد آفريد، و در زمين كوه‏هايى افكند تا شما را نلرزاند (و جايگاه شما آرام باشد) و از هر گونه جنبنده‏اى روى آن منتشر ساخت; و از آسمان آبى نازل كرديم و بوسيله آن در روى زمين انواع گوناگونى از جفتهاى گياهان پر ارزش رويانديم",
                            "verse 31:11": "اين آفرينش خداست; اما به من نشان دهيد معبودانى غير او چه چيز را آفريده‏اند؟! ولى ظالمان در گمراهى آشكارند",
                            "verse 31:12": "ما به لقمان حكمت داديم; (و به او گفتيم:) شكر خدا را بجاى آور هر كس شكرگزارى كند، تنها به سود خويش شكر كرده; و آن كس كه كفران كند، (زيانى به خدا نمى‏رساند); چرا كه خداوند بى‏نياز و ستوده است",
                            "verse 31:13": "(به خاطر بياور) هنگامى را كه لقمان به فرزندش -در حالى كه او را موعظه مى‏كرد- گفت: س‏خ‏للّهپسرم! چيزى را همتاى خدا قرار مده كه شرك، ظلم بزرگى است»",
                            "verse 31:14": "و ما به انسان درباره پدر و مادرش سفارش كرديم; مادرش او را با ناتوانى روى ناتوانى حمل كرد (به هنگام باردارى هر روز رنج و ناراحتى تازه‏اى را متحمل مى‏شد)، و دوران شيرخوارگى او در دو سال پايان مى‏يابد; (آرى به او توصيه كردم) كه براى من و براى پدر و مادرت شكر بجا آور كه بازگشت (همه شما)به سوى من است!",
                            "verse 31:15": "و هرگاه آن دو، تلاش كنند كه تو چيزى را همتاى من قرار دهى، كه از آن آگاهى ندارى (بلكه مى‏دانى باطل است)، از ايشان اطاعت مكن، ولى با آن دو، در دنيا به طرز شايسته‏اى رفتار كن; و از راه كسانى پيروى كن كه توبه‏كنان به سوى من آمده‏اند; سپس بازگشت همه شما به سوى من است و من شما را از آنچه عمل مى‏كرديد آگاه مى‏كنم",
                            "verse 31:16": "پسرم! اگر به اندازه سنگينى دانه خردلى (كار نيك يا بد) باشد، و در دل سنگى يا در (گوشه‏اى از) آسمانها و زمين قرار گيرد، خداوند آن را (در قيامت براى حساب) مى‏آورد; خداوند دقيق و آگاه است!",
                            "verse 31:17": "پسرم! نماز را برپا دار، و امر به معروف و نهى از منكر كن، و در برابر مصايبى كه به تو مى‏رسد شكيبا باش كه اين از كارهاى مهم است!",
                            "verse 31:18": "(پسرم!) با بى‏اعتنايى از مردم روى مگردان، و مغرورانه بر زمين راه مرو كه خداوند هيچ متكبر مغرورى را دوست ندارد",
                            "verse 31:19": "(پسرم!) در راه‏رفتن، اعتدال را رعايت كن; از صداى خود بكاه (و هرگز فرياد مزن) كه زشت‏ترين صداها صداى خران است",
                            "verse 31:20": "آيا نديديد خداوند آنچه را در آسمانها و زمين است مسخر شما كرده، و نعمتهاى آشكار و پنهان خود را به طور فراوان بر شما ارزانى داشته است؟! ولى بعضى از مردم بدون هيچ دانش و هدايت و كتاب روشنگرى درباره خدا مجادله مى‏كنند!",
                            "verse 31:21": "و هنگامى كه به آنان گفته شود: «از آنچه خدا نازل كرده پيروى كنيد!»، مى‏گويند: «نه، بلكه ما از چيزى پيروى مى‏كنيم كه پدران خود را بر آن يافتيم!»آيا حتى اگر شيطان آنان را دعوت به عذاب آتش فروزان كند (باز هم تبعيت مى‏كنند)؟!",
                            "verse 31:22": "كسى كه روى خود را تسليم خدا كند در حالى كه نيكوكار باشد، به دستگيره محكمى چنگ زده (و به تكيه‏گاه مطمئنى تكيه كرده است); و عاقبت همه كارها به سوى خداست",
                            "verse 31:23": "و كسى كه كافر شود، كفر او تو را غمگين نسازد; بازگشت همه آنان به سوى ماست و ما آنها را از اعمالى كه انجام داده‏اند (و نتايج شوم آن) آگاه خواهيم ساخت; خداوند به آنچه درون سينه‏هاست آگاه است",
                            "verse 31:24": "ما اندكى آنها را از متاع دنيا بهره‏مند مى‏كنيم، سپس آنها را به تحمل عذاب شديدى وادار مى‏سازيم!",
                            "verse 31:25": "و هرگاه از آنان سؤال كنى: «چه كسى آسمانها و زمين را آفريده است؟» مسلما مى‏گويند: «الله س‏ذللّه، بگو: «الحمد لله (كه خود شما معترفيد)!» ولى بيشتر آنان نمى‏دانند!",
                            "verse 31:26": "آنچه در آسمانها و زمين است از آن خداست، چرا كه خداوند بى‏نياز و شايسته ستايش است!",
                            "verse 31:27": "و اگر همه درختان روى زمين قلم شود، و دريا براى آن مركب گردد، و هفت درياچه به آن افزوده شود، اينها همه تمام مى‏شود ولى كلمات خدا پايان نمى‏گيرد; خداوند عزيز و حكيم است",
                            "verse 31:28": "آفرينش و برانگيختن (و زندگى دوباره) همه شما (در قيامت) همانند يك فرد بيش نيست; خداوند شنوا و بيناست!",
                            "verse 31:29": "آيا نديدى كه خداوند شب را در روز، و روز را در شب داخل مى‏كند، و خورشيد و ماه را مسخر ساخته و هر كدام تا سرآمد يعنى به حركت خود ادامه مى‏دهند؟! خداوند به آنچه انجام مى‏دهيد آگاه است",
                            "verse 31:30": "اينها همه دليل بر آن است كه خداوند حق است، و آنچه غير از او مى‏خوانند باطل است، و خداوند بلند مقام و بزرگ مرتبه است!",
                            "verse 31:31": "آيا نديدى كشتيها بر (صفحه) درياها به فرمان خدا، و به (بركت) نعمت او حركت مى‏كنند تا بخشى از آياتش را به شما نشان دهد؟! در اينها نشانه‏هايى است براى كسانى كه شكيبا و شكرگزارند!",
                            "verse 31:32": "و هنگامى كه (در سفر دريا) موجى همچون ابرها آنان را بپوشاند (و بالا رود و بالاى سرشان قرار گيرد)، خدا را با اخلاص مى‏خوانند; اما وقتى آنها را به خشكى رساند و نجات داد، بعضى راه اعتدال را پيش مى‏گيرند (و به ايمان خود وفادار مى‏مانند، در حالى كه بعضى ديگر فراموش كرده راه كفر پيش مى‏گيرند); ولى آيات ما را هيچ كس جز پيمان‏شكنان ناسپاس انكار نمى‏كنند!",
                            "verse 31:33": "اى مردم! تقواى الهى پيشه كنيد و بترسيد از روزى كه نه پدر كيفر اعمال فرزندش را تحمل مى‏كند، و نه فرزند چيزى از كيفر (اعمال) پدرش را; به يقين وعده الهى حق است; پس مبادا زندگانى دنيا شما را بفريبد، و مبادا (شيطان) فريبكار شما را (به كرم) خدا مغرور سازد!",
                            "verse 31:34": "آگاهى از زمان قيام قيامت مخصوص خداست، و اوست كه باران را نازل مى‏كند، و آنچه را كه در رحم‏ها(ى مادران) است مى‏داند، و هيچ كس نمى‏داند فردا چه به دست مى‏آورد، و هيچ كس نمى‏داند در چه سرزمينى مى‏ميرد؟ خداوند عالم و آگاه است!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Alef, Lam, Mim.",
                            "verse 31:2": "Estes são os versículos do Livro da Sabedoria.",
                            "verse 31:3": "Orientação e misericórdia para os benfeitores.",
                            "verse 31:4": "Que observam a oração, pagam o zakat e estão persuadidos da outra vida.",
                            "verse 31:5": "Estes são orientados por seu Senhor, e serão os bem-aventurados.",
                            "verse 31:6": "Entre os humanos, há aqueles que entabula vãs conversas, para com isso desviar nesciamente (os seus semelhantes) da senda de Deus, escarnecendo-a. Este sofrerá um castigo ignominioso!",
                            "verse 31:7": "E quando lhe são recitados os Nossos versículos, volta-se, ensoberbecido, como se não os tivesse ouvido, como se sofresse de surdez; anuncia-lhe, pois, um doloroso castigo.",
                            "verse 31:8": "Em verdade, os fiéis, que praticam o bem, abrigar-se-ão nos jardins do prazer.",
                            "verse 31:9": "Onde morarão eternamente. A promessa de Deus é inexorável, e Ele é o Poderoso, o Prudentíssimo.",
                            "verse 31:10": "Criou os céus, sem colunas aparentes; fixou na terra firmes montanhas, para que não oscile convosco, e disseminou nela animais de toda a espécie. E enviamos a água do céu, com que fazemos brotar toda a nobre espécie de casais.",
                            "verse 31:11": "Aí está a criação de Deus! Mostra-me, então, o que criaram outros, em lugar d’Ele. Porém, os iníquos estão em evidente erro.",
                            "verse 31:12": "Agraciamos Lucman com a sabedoria, (dizendo-lhe): Agradece a Deus, porque quem agradece, o faz em benefício próprio; por outro lado, quem desagradece, (saiba) que certamente Deus é, por Si, Opulento, Laudabilíssimo.",
                            "verse 31:13": "Recorda-te de quando Lucman disse ao seu filho, exortando-o : Ó filho meu, não atribuas parceiros a Deus, porque a idolatria é grave iniqüidade.",
                            "verse 31:14": "E recomendamos ao homem benevolência para com os seus pais. Sua mãe o suporta, entre dores e dores, e sua desmama é aos dois anos. (E lhe dizemos): Agradece a Mim e aos teus pais, porque retorno será a Mim.",
                            "verse 31:15": "Porém, se te constrangerem a associar-Me o que tu ignoras, não lhes obedeças; comporta-te com eles com benevolência neste mundo, e segue a senda de quem se voltou contrito a Mim. Logo o retorno de todos vós será a Mim, e então inteirar-vos-ei de tudo quanto tiverdes feito.",
                            "verse 31:16": "Ó filho meu (disse) Lucman, em verdade, ainda que algo como o peso de um grão de mostarda estivesse (oculto) em uma rocha, fosse nos céus, fosse na terra, Deus o descobriria, porque é Onisciente, Sutilíssimo.",
                            "verse 31:17": "Ó filho meu, observa a oração, recomenda o bem, proíbe o ilícito e sofre pacientemente tudo quanto te suceda, porque isto é firmeza (de proprósito na condução) dos assuntos.",
                            "verse 31:18": "E não vires o rosto às gentes, nem andes insolentemente pala terra, porque Deus não estima arrogante e jactancioso algum.",
                            "verse 31:19": "E modera o teu andar e baixa a tua voz, porque o mais desagradável dos sons é o zurro dos asnos.",
                            "verse 31:20": "Porventura, não reparais em que Deus vos submeteu tudo quanto há nos céus e na terra, e vos cumulou com as Suas mercês, cognoscíveis e incognoscíveis? Sem dúvida, entre os humanos, há os que disputam nesciamente acerca de Deus, sem orientação ou Livro lúcido algum.",
                            "verse 31:21": "E quanto lhes é dito: Segui o que Deus tem revelado, retrucam: Seguiremos o que vimos praticar os nossos pais! Seguí-los-iam eles, mesmo que (com isso) Satanás os convidasse ao castigo do tártaro?",
                            "verse 31:22": "Mas quem se submeter a Deus e for caritativo ver-se-á apegado à verdade inquebrantável. E em Deus e for caritativo ver-se-á apegado à verdade inquebrantável. E em Deus reside o destino de todos os assuntos.",
                            "verse 31:23": "Quando ao incrédulo, que a sua incredulidade não te atribule, porque o seu retorno será a Nós, e então o inteiraremos de tudo quanto tiver feito; Deus é Conhecedor das intimidades dos corações.",
                            "verse 31:24": "Agraciá-los-emos um pouco; então, lhes infligiremos um severo castigo.",
                            "verse 31:25": "E se lhes perguntares quem criou os céus e a terra, dirão: Deus! Dize: Louvado seja Deus! Porém, a maioria dos homens o ignora.",
                            "verse 31:26": "A Deus pertence tudo quanto há nos céus e na terra, porque Deus é o Opulento, o Laudabilíssimo.",
                            "verse 31:27": "Ainda que todas as árvores da terra se convertessem em cálamos e o oceano (em tinta), e lhes fossem somados mais sete oceanos, isso não exauriria as palavras de Deus, porque Deus é Poderoso, Prudentíssimo.",
                            "verse 31:28": "Vossa criação e ressurreição não são mais do que (o são) a de um só ser; sabei que Deus é Oniouvinte, Onividente.",
                            "verse 31:29": "Não tens reparado, acaso, em que Deus insere a noite no dia e o dia na noite, e que submeteu o sol e a lua, e que cada um (destes) gira em sua órbita até um término prefixado, e que Deus está inteirado de tudo quanto fazeis?",
                            "verse 31:30": "Isso ocorre porque Deus é a Verdade, e porque tudo quanto invocam, em lugar d’Ele, é a falsidade, e porque Deus é o Grandioso, o Altíssimo.",
                            "verse 31:31": "Não reparas, acaso, nos navios, que singram os mares pela graça de Deus, para mostrar-vos algo dos Seus sinais? Sabei que nisto há sinais para o perseverante, agradecido.",
                            "verse 31:32": "E quando as ondas montanhas tenebrosas, os envolvem, invocam sinceramente Deus e, tão logo Ele os põe a salvo, em terra, eis que alguns deles vacilam; entretanto, ninguém nega os Nossos versículos, além do pérfido, ingrato.",
                            "verse 31:33": "Ó humanos, temei vosso Senhor e temei o dia em que um pai em nada poderá redimir o filho, nem o filho ao pai. Certamente, a promessa de Deus é verdadeira! Que não vos iluda a vida terrena, nem vos iluda a sedutor, com respeito a Deus!",
                            "verse 31:34": "Em verdade, Deus possui o conhecimento da Hora, faz descer a chuva e conhece o que encerram os ventres maternos. Nenhum ser saber o que ganhará amanhã, tampouco nenhum ser saberá em que terra morrerá, porque (só) Deus é Sapiente, Inteiradíssimo!"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 31:1": "Alif, Lam, Mim .",
                            "verse 31:2": "Acestea sunt versetele Cãrții celei pline de înțelepciune.",
                            "verse 31:3": "[În ele sunt] cãlãuzire și îndurare pentru cei care fac bine,",
                            "verse 31:4": "Care împlinesc Rugãciunea [As-Salat], achitã Dania [Az-Zakat] și care cred în Viața de Apoi.",
                            "verse 31:5": "Aceștia au bunã cãlãuzire de la Domnul lor și aceștia vor fi cei care vor izbândi .",
                            "verse 31:6": "Dar printre oameni sunt și [unii] care cumpãrã poveștile deșarte pentru a rãtãci cu ele de la calea lui Allah , fãrã de științã, și pentru ao lua în derâdere . Aceia vor avea",
                            "verse 31:7": "Iar atunci când i se recitã lui versetele Noastre, el se întoarce de la ele semeț, de parcã nici nu le-ar auzi, ca și când ar avea în urechile sale o greutate . Vestește-i lui un chin dureros!",
                            "verse 31:8": "Aceia, însã, care cred și sãvârșesc fapte bune vor avea parte de grãdinile fericirii,",
                            "verse 31:9": "Și veșnic vor rãmâne în ele. Fãgãduința lui Allah este adevãratã, iar El este Puternic [și] Înțelept [Al-’Aziz, Al-Hakim].",
                            "verse 31:10": "El a creat cerurile fãrã stâlpi pe care voi sã-i puteți vedea și aaruncat [înfigând] în pãmânt munți trainici, pentru ca el sã nu seclatine cu voi și a risipit pe el tot fe",
                            "verse 31:11": "“Aceasta este înfãptuirea lui Allah! Arãtați-mi mie ce au creataceia pe care [i-ați luat] în locul Lui!” Însã cei nelegiuiți sunt în rãtãcire învederatã.",
                            "verse 31:12": "Noi i-am dat lui Luqman înțelepciunea, [zicând]: “Adu-I mulțumiri lui Allah , cãci cel care aduce mulțumire nu aduce mulțumire decât pentru sine , pe când cel care este nemulțumitor [sã știe cã] All",
                            "verse 31:13": "Și i-a zis Luqman fiului sãu, sfãtuindu-l pe el: \"O, fiule! Nu-I face lui Allah asociat, cãci facerea de pãrtași este fãrãdelege mare!”",
                            "verse 31:14": "Noi l-am povãțuit pe om [sã facã bine] pãrinților sãi, mama lui l-a purtat, [suportând pentru el] slãbiciune dupã slãbiciune, iar înțãrcarea lui a fost dupã doi ani,",
                            "verse 31:15": "Dar dacã se strãduiesc pentru ca tu sã-Mi faci ca asociat altceva,despre care tu nu ai cunoștințã , atunci nu te supune lor! Rãmâiîmpreunã cu ei în aceastã lume, cu dreptate,",
                            "verse 31:16": "“O, fiul Meu! De ar fi [ceva] de greutatea numai a unui bob de muștar și s-ar afla ascuns într-o stâncã, în ceruri sau în pãmânt , Allah îl va scoate la ivealã , iar Allah este Binevoitor [și] Bineștiutor[Latif, K",
                            "verse 31:17": "O, fiul Meu! Împlinește Rugãciunea [As-Salat], poruncește faptabunã, oprește de la ceea ce este urât și rabdã ceea ce vine asupra ta , cãci aceasta este dintre lucrurile hotãrâte",
                            "verse 31:18": "Nu te întoarce de la oameni și nu pãși pe pãmânt cu semeție, cãci Allah nu-l iubește pe cel trufaș și mândru!",
                            "verse 31:19": "Fii cumpãtat în mersul tãu și scoboarã glasul tãu, cãci cel mai urât dintre toate este glasul mãgarului!”",
                            "verse 31:20": "Oare nu vedeți voi cã Allah v-a supus vouã câte sunt în ceruri și câte sunt pe pãmânt și v-a copleșit pe voi cu binefacerile Sale - atât cele vãzute cât și cele ascunse? Și sunt unii dintre oame",
                            "verse 31:21": "Și când li se zice lor : “Urmați ceea ce a trimis Allah!”, atuncizic ei: “Ba noi urmãm cele cu care i-am gãsit pe pãrinții noștri!” Chiar dacã-i cheamã Șeitan la pedeapsa vãpãii",
                            "verse 31:22": "Acela care supune fața sa lui Allah și este binefãcãtor, acela s-aprins de toarta cea mai trainicã. La Allah se aflã sfârșitul [tuturor]lucrurilor .",
                            "verse 31:23": "Iar acela care nu crede, sã nu te întristeze necredința lui! La Noieste întoarcerea lor și [atunci] Noi le vom vesti ceea ce au fãcut ei. Allah este Bineștiutor al celor ascunse în piepturi.",
                            "verse 31:24": "Le dãm lor bucuria numai pentru puțin [timp], apoi îi vom sili pe ei la chin aspru .",
                            "verse 31:25": "Însã dacã îi întrebi: “Cine a creat cerurile și pãmântul?”, ei vor rãspunde: “Allah!” Spune: “Slavã lui Allah!” Dar cei mai mulți dintreei nu știu.",
                            "verse 31:26": "Ale lui Allah sunt cele din ceruri și de pre pãmânt. Allah esteDeajuns pentru Sine [și] Vrednic de Laudã [Al-Ghaniyy, Al-Hamid]!",
                            "verse 31:27": "Și de s-ar schimba în calemuri toți copacii de pe pãmânt și de s- ar vãrsa în mare șapte mãri [de cernealã], cuvintele lui Allah tot nu s-ar termina. Allah este Puternic [și] Înțelept",
                            "verse 31:28": "Crearea voastrã și învierea voastrã nu sunt [pentru Allah] decât [lafel de ușoare] ca pentru un singur suflet! Allah este Cel care AudeTotul [și] Cel care Vede [Samih, Basir]!",
                            "verse 31:29": "Oare nu vezi cã Allah face sã intre noaptea în zi și face sã intreziua în noapte și cã El a supus Soarele și Luna, fiecare alergândpânã la un termen hotãrât , și cã Allah este Bine&ord",
                            "verse 31:30": "Aceasta pentru cã Allah este Adevãrul, iar ceea ce cheamã ei în locul Lui sunt vorbe deșarte și pentru cã Allah este Cel Înalt [și] CelMare [Al-’Aliyy, Al-Kabir].",
                            "verse 31:31": "Oare nu vezi cã din harul lui Allah corãbiile plutesc pe mare,spre a vã arãta vouã din semnele Sale? Și întru aceasta sunt semne pentru oricine este rãbdãtor și mulțumitor.",
                            "verse 31:32": "Și dacã-i învãluie pe ei valurile, asemenea umbrelor , atunci Îl cheamã ei numai pe Allah, cu credințã fațã de religia Lui, iar dupãce-i izbãvește pe ei,",
                            "verse 31:33": "O, voi oameni, fiți cu fricã fațã de Domnul vostru și temeți-vã de o Zi în care nici un pãrinte nu-i va putea fi fiului sãu de ajutor și nici un fiu nu-i va fi de ajutor pãrintelui s&a",
                            "verse 31:34": "Numai la Allah se aflã cunoașterea Ceasului . El face sã coboare ploaia îmbelșugatã și El știe ce se aflã în pântece . Nici un suflet nu știe ce va dobândi mâine și nici un suflet nu &or"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 31:1": "Alif. Lam. Mim.",
                            "verse 31:2": "Acestea sunt versetele Cărţii înţelepte,",
                            "verse 31:3": "călăuzire şi milostivenie făptuitorilor de bine",
                            "verse 31:4": "care îşi săvârşesc rugăciunea, care dau milostenie şi care cred cu tărie în Viaţa de Apoi.",
                            "verse 31:5": "Aceştia sunt călăuziţi de Domnul lor. Aceştia vor fi cei fericiţi!",
                            "verse 31:6": "Dintre oameni, cineva cumpără poveşti vesele cu care rătăceşte de la Calea Domnului cu neştiinţă şi spre a-şi bate joc. Aceştia vor avea o osândă umilitoare.",
                            "verse 31:7": "Când i se recită versetele Noastre, se întoarce cu trufie, ca şi cum nici nu le-ar auzi, ca şi cum urechile lui ar fi lovite de surzenie. Vesteşte-i o dureroasă osândă.",
                            "verse 31:8": "Grădinile plăcerii sunt ale celor care cred şi săvârşesc fapte bune,",
                            "verse 31:9": "şi în ele vor veşnici. Făgăduiala lui Dumnezeu este Adevăr. El este Puternicul, Înţeleptul.",
                            "verse 31:10": "El a creat cerurile fără stâlpi pe care să-i vedeţi, a înfipt munţii pe pământ ca să nu se clatine cu voi şi a împrăştiat pe el vietăţi de tot soiul. Noi am trimis din cer apă şi am făcut să răsară pe el perechi din toate soiurile folositoare.",
                            "verse 31:11": "Aceasta este creaţia lui Dumnezeu! “Arătaţi-mi ceea ce alţii, în afară de El, au creat!” Cei nedrepţi însă sunt într-o vădită rătăcire!",
                            "verse 31:12": "Noi i-am dăruit lui Luqman înţelepciunea: “Mulţumeşte-i lui Dumnezeu. Cel care mulţumeşte, mulţumeşte pentru sufletul lui, iar cel care este nemulţumitor, să ştie că Dumnezeu este Bogat, Lăudat.”",
                            "verse 31:13": "Luqman îi spuse fiului său pe când îl dăscălea: “O, fiul meu! Nu alătura pe nimeni lui Dumnezeu. Închinăciunea la idoli este o nelegiuire grozavă.”",
                            "verse 31:14": "Noi l-am sfătuit pe om cu privire la părinţii lui. Mama sa l-a purtat pe când el era în neputinţă şi l-a înţărcat după doi ani. Mulţumeşte-mi Mie şi părinţilor tăi. Întru Mine este devenirea.",
                            "verse 31:15": "Dacă amândoi te silesc să-Mi alături ceva de care tu nu ai ştiinţă, nu le da ascultare. Fii alături de ei pe lumea aceasta după cuviinţă, însă urmează calea celui ce către Mine se căieşte. Întoarcerea voastră va fi către Mine, iar Eu vă voi da de ştire de ceea ce aţi făptuit.",
                            "verse 31:16": "“O, fiul meu! Chiar dacă este ceva greu cât o boabă de muştar, ascuns într-o stâncă, fie în ceruri, fie pe pământ, Dumnezeu îl va scoate la lumină. Dumnezeu este Blând, Cunoscător.",
                            "verse 31:17": "O, fiul meu! Săvârşeşte-ţi rugăciunea, porunceşte ceea ce este cuviincios, opreşte ceea ce este urâcios, rabdă ceea ce a căzut asupra ta. Întru aceasta este tăria firii.",
                            "verse 31:18": "Nu-ţi întoarce obrazul de la oameni, nu umbla semeţ pe pământ, căci Dumnezeu nu-l iubeşte pe lăudărosul fudul.",
                            "verse 31:19": "Fii simplu în umbletul tău. Domoleşte-ţi glasul, căci cel mai urât glas este glasul măgarului.”",
                            "verse 31:20": "Nu vedeţi că Dumnezeu v-a supus vouă cele din ceruri, precum şi cele de pe pământ? El a răspândit asupra voastră harurile Sale văzute şi nevăzute. Şi printre oameni unii se ceartă asupra lui Dumnezeu fără ştiinţă, fără călăuzire, fără Carte luminoasă!",
                            "verse 31:21": "Dacă li se spune: “Urmaţi ceea ce Dumnezeu a pogorât”, ei răspund: “Ba nu! Noi urmăm ceea ce am aflat de la taţii noştri...” Dacă Diavolul îi cheamă însă la osânda Iadului...?",
                            "verse 31:22": "Cel care îşi supune faţa lui Dumnezeu şi săvârşeşte fapte bune, apucă toarta cea mai trainică, căci la Dumnezeu este urmarea lucrurilor!",
                            "verse 31:23": "Tăgada necredinciosului să nu te mâhnească, căci întoarcerea tăgăduitorilor va fi către Noi şi atunci le vom da de ştire ceea ce au făptuit. Dumnezeu este Cunoscător al lăuntrului inimilor.",
                            "verse 31:24": "Îi vom lăsa să se bucure o vreme de Viaţa de Acum, apoi îi vom sili la o grea osândă.",
                            "verse 31:25": "Dacă îi întrebi: “Cine a creat cerurile şi pământul?”, vor spune: “Dumnezeu!” Spune: “Laudă lui Dumnezeu!” Cei mai mulţi dintre ei nu ştiu însă!",
                            "verse 31:26": "Ale Lui sunt cele din ceruri şi de pe pământ. Dumnezeu este Bogatul, Lăudatul.",
                            "verse 31:27": "Dacă toţi copacii de pe pământ ar fi condeie şi dacă marea, şi încă şapte mări asemenea ei, ar da cerneală, Cuvintele lui Dumnezeu tot nu s-ar sfârşi. Dumnezeu este Puternic, Înţelept.",
                            "verse 31:28": "Crearea voastră şi învierea voastră nu sunt decât ca ale unui singur suflet. Dumnezeu este Auzitor, Văzător,",
                            "verse 31:29": "Nu vezi oare că Dumnezeu face noaptea să străpungă ziua şi ziua să străpungă noaptea! El a silit soarele şi luna să alerge fiecare către un anumit soroc. Dumnezeu a ceea ce făptuiţi este Cunoscător.",
                            "verse 31:30": "Aceasta pentru că Dumnezeu este Adevărul, iar ceea ce voi chemaţi, în afară de El, este deşărtăciune. Dumnezeu este Înaltul, Marele!",
                            "verse 31:31": "Nu vedeţi cum corabia pluteşte pe mare prin harul lui Dumnezeu ca să vă arate din semnele Sale. Întru acestea sunt semne pentru orice răbdător, mulţumitor.",
                            "verse 31:32": "Când un val asemenea întunecimilor îi acoperă, oamenii îl cheamă pe Dumnezeu curaţi Lui în credinţă După ce îi mântuie Dumnezeu ducându-i pe uscat, unii vor fi chibzuiţi, însă numai schimbătorul nemulţumitor se va lepăda de semnele Noastre.",
                            "verse 31:33": "O, voi oameni! Temeţi-vă de Domnul vostru! Să vă fie frică de Ziua când un tată nu va putea face nimic pentru fiul său, şi nici fiul pentru tatăl său. Făgăduiala lui Dumnezeu este Adevăr! Viaţa de Acum să nu vă amăgească şi nici amăgitorul să nu vă amăgească asupra lui Dumnezeu.",
                            "verse 31:34": "Numai Dumnezeu are ştiinţa Ceasului. El trimite ploaia. El ştie ceea ce este în pântecele mamelor. Nimeni nu ştie ce va agonisi mâine, nimeni nu ştie pe ce pământ va muri. Dumnezeu este Ştiutor, Cunoscător!"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Алеф — Ля –м — Ми –м.",
                            "verse 31:2": "Это — знаменья мудрой Книги",
                            "verse 31:3": "Как руководство и как милостьДля всех, кто доброе творит,",
                            "verse 31:4": "Молитву совершает по часамИ правит очистительную подать,Уверовав в (их) будущую жизнь.",
                            "verse 31:5": "Они идут прямой стезею Бога, —Лишь им познать Господнюблагодать1749.",
                            "verse 31:6": "Но есть среди людей и тот1750,Кто, никаким познанием не обладая,Пустые небылицы1751 покупает,Чтоб ими уклонить с Господнего путиИ обратить в забаву (заповеданноеБогом).Бесчестие их (ждет) и унизительнаякара.",
                            "verse 31:7": "Когда читаются ему знаменья Наши,Он отвращается надменно,Как будто бы не слыша их,Как будто б глухотой закрыты егоуши.Благовести ж ему мучительную кару!",
                            "verse 31:8": "Для тех же, кто уверовал и делаетблагое, —Сады (Господней) благодати,",
                            "verse 31:9": "И вечно пребывать им тамПо верному обетованию Аллаха, —Он мудр и могущ!",
                            "verse 31:10": "Он небеса воздвиг без видимыхопор1752,На землю бросил горные твердыни,Прочно стоящие (в недвижностисвоей),Чтобы она не колебалась с вами1753,И там рассеял всяку живность.Мы с неба льем (обильные) дождиИ ими взращиваем па’рыблагородных видов1754.",
                            "verse 31:11": "И это (все) — творение Аллаха.Так покажите Мне,Что’ сотворили те, иные, кроме Бога.Поистине, неправедные — в явномзаблужденье!",
                            "verse 31:12": "Мы прежде мудростью Лукманаодарили,(Сказав ему): «Благодари Аллаха!Кто благодарен Господу,Его благодарит своей душе на благо;А кто Ему неблагодарен — что ж!Аллах, поистине, свободен от любойнужды и славен!»1755",
                            "verse 31:13": "Вот как-то, увещая сына своего, сказалЛукман:«Дитя мое! Ты никогда Аллахусоучастников не прочь,Ведь многобожие — великоенечестие и зло».",
                            "verse 31:14": "Мы завещали человеку(Заботу проявлять) к родителямсвоим, —Во чреве носит его мать,За тягостью испытывая тягость,И от груди в течение двух летне отлучает.«Благодари Меня! — (тебеЯ завещаю). —И почитай родителей своих».Ко Мне лежит обратный твой приход.",
                            "verse 31:15": "Но если они будут добиваться,Чтоб ты Мне в соучастники придал,О чем тебе (из Откровений)неизвестно,Не повинуйся им,Но соучаствуй с ними в добромв этом миреИ следуй по пути того,Кто искренне ко Мне свой ликнаправил, —Ведь лишь ко Мне вы все вернетесь,И Я тогда вам сообщуВсю (суть) того, что вы творили.",
                            "verse 31:16": "«О мой сынок! — (Лукман сказал). —Ведь если что-нибудь(Не больше) веса горчичного зернаСхоро’нится в скале, в (бескрайнем)небеИль в (недоступной глубине) земли,То и тогда наружу извлечет егоАллах, —(Он зрит), поистине, (во всякоестество)И ведает о всем, что суще1757.",
                            "verse 31:17": "О мой сынок! Твори молитву по часам,Зови людей творить добро,Удерживай от злогоИ с терпеливой стойкостью примиВсе, что падет тебе (на плечи), —В этом и есть та твердость (духа),(Которая нужна тебе) в делах.",
                            "verse 31:18": "С надменностью не пыжьсяпред людьми1758И горделиво по земле не шествуй, —Аллах, поистине, хвастливыхгордецов не любит.",
                            "verse 31:19": "Старайся размерять свою походкуИ (должным образом) свой голоспонижать, —Ведь, несомненно, неприятнейшийиз звуков —Звук голоса (безмозглого) осла».",
                            "verse 31:20": "Неужто вам не ясно1759, что АллахНа службу вам поставил все,Что (пребывает) на земле и в небесах,Обильные щедроты вам излил,Что явны (вашим взорам) ильсокрыты?И все же среди вас есть те,Которые о Господе своем заводятспорыБез знания, без руководстваИ без Книги, которая (способна) Светпролить.",
                            "verse 31:21": "Когда им говорят: «Вы следуйте за тем,Что вам ниспослано Аллахом!»,Они ответствуют: «О нет!Мы будем следовать той (вере),Которую нашли мы в нашихпраотцах».Неужто даже зная, что за этоИх Сатана зовет к (суровой) кареАда?",
                            "verse 31:22": "Тот, кто всецело обратил свой ликк АллахуИ совершает добрые дела,Поистине, обрел надежнуюопору1760, —Ведь только у Аллаха завершениевсего.",
                            "verse 31:23": "И пусть тебя не огорчаетНеверие того, кто не уверовал(в Аллаха), —Ведь к Нам — обратный их приход,И Мы тогда им сообщим (весь грех)содеянного ими, —Аллах ведь знает, что у них в груди!",
                            "verse 31:24": "Мы им дадим довольствоватьсяжизньюЛишь (на земной) недолгий срок1761,Потом Мы их повергнем в огненнуюмуку.",
                            "verse 31:25": "А если ты их спросишь:«Кто небеса и землю сотворил?»,«Аллах!» — они ответят непременно.«Хвала Аллаху!» — (им) скажи,Но большинство из них не знает.",
                            "verse 31:26": "Аллах владеет всем,Что на земле и в небесах (пребудет), —Поистине, свободен Он от всякихнужд и преисполнен славы.",
                            "verse 31:27": "И если б в перья обратилисьДеревья все, что на земле,(Для записи Словес Господних)И если б океан (земной в чернилаобратился)И влились бы в него еще таких жесемь,То и тогда бы не иссякли ГосподаСлова, —Аллах, поистине, велик и мудр!",
                            "verse 31:28": "Ему вас (всех) создать и воскреситьСтоль же (легко),Как и с одной душою это сделать, —Аллах, поистине, все видит и всеслышит!",
                            "verse 31:29": "Неужто ты не видишь, как АллахВ (свет) Дня вливает (темень) НочиИ в (темень) Ночи вводит День;Как подчинил Он (Своему веленью)Движенье Солнца и Луны,И всяк из них путь держит к своемупределуВо срок, что Им определен1762,И то, что ведомо ЕмуВсе то, что (явно или тайно) вытворите?",
                            "verse 31:30": "И это потому, что лишь Аллах естьИстина,А те, кого, опричь Него, вы чтите, —Ложь,И потому, что лишь АллахВозвышен и велик безмерно!",
                            "verse 31:31": "Ужель не видел ты, что судноПлывет по морю волею Аллаха1763,Чтоб вам явить знамение Его?В этом, поистине, знамение для тех,Кто терпелив и благодарен.",
                            "verse 31:32": "Когда волна (могильной) сеньюпокрывает их,Они (с отчаяньем) взывают к БогуИ всей душою (заверяют,Что будут) благочестие блюсти1764.Когда же, (выбросив) на сушу,Он спасает их,Средь них всегда находятся такие,Кто (склонен все же) удержаться(от поклонения Ему)1765.Но отрицать знаменья Наши(Способен) лишь изменник, грешный!",
                            "verse 31:33": "О род людской!Страшитесь гнева вашего ВладыкиИ бойтесь Дня, когда отецНичем не сможет быть полезен сынуИ сын отцу ничем не пособит1766, —Верно1767, поистине, обетованиеАллаха!А потому не обольщайтесь(Мгновеньем кратким) жизнина земле.Не позволяйте искусителю —ШайтануВас об Аллахе обольстить.",
                            "verse 31:34": "Лишь у Аллаха — знание о Часе1768,Лишь Он дожди вам с неба льет,Ему лишь одному известно,Что’ хоронят утробы (самок);И ни одна душа не знает,Что’ завтра возыметь ей предстоитИ на какой земле ей смертьпредстанет, —Аллах, поистине, всеведущ — (Он)знает (обо всем)!"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "'lm.",
                            "verse 31:2": "Éstas son las aleyas de la Escritura sabia,",
                            "verse 31:3": "como dirección y misericordia para quienes hacen el bien.",
                            "verse 31:4": "que hacen la azalá, dan el azaque y están convencidos de la otra vida.",
                            "verse 31:5": "Esos tales están dirigidos por su Señor, ésos son los que prosperarán.",
                            "verse 31:6": "Hay entre los hombres quien compra historietas divertidas para, sin conocimiento, extraviar a otros del camino de Alá y para tomarlo a burla. Quienes tal hagan tendrán un castigo humillante.",
                            "verse 31:7": "Cuando se le recitan Nuestras aleyas, se aleja altivamente, como si no las hubiera oído, como si hubiera estado sordo. ¡Anúnciale un castigo doloroso!",
                            "verse 31:8": "Quienes, en cambio, hayan creído y obrado bien tendrán los jardines de la Delicia.",
                            "verse 31:9": "en los que estarán eternamente. ¡Promesa de Alá verdad! Él es el Poderoso, el Sabio.",
                            "verse 31:10": "Ha creado los cielos sin pilares visibles. Ha fijado en la tierra las montañas para que ella y vosotros no vaciléis. Ha diseminado por ella toda clase de bestias. Hemos hecho bajar agua del cielo y crecer en ella toda especie generosa.",
                            "verse 31:11": "Ésta es la creación de Alá. ¡Mostradme, pues, qué han creado los otros dioses que hay fuera de Él! Sí, los impíos están evidentemente extraviados.",
                            "verse 31:12": "Dimos a Luqmán la sabiduría: «¡Sé agradecido con Alá! Quien es agradecido lo es, en realidad, en provecho propio. Quien es desagradecido... Alá Se basta a Sí mismo, es digno de alabanza».",
                            "verse 31:13": "Y cuando Luqmán amonestó a su hijo, diciéndole: «¡Hijito! ¡No asocies a Alá otros dioses, que la asociación es una impiedad enorme!».",
                            "verse 31:14": "Hemos ordenado al hombre con respecto a sus padres -su madre le llevó sufriendo pena tras pena y le destetó a los dos años-: «Sé agradecido conmigo y con tus padres. ¡Soy Yo el fin de todo!",
                            "verse 31:15": "Pero, si te insisten en que Me asocies aquello de que no tienes conocimiento, ¡no les obedezcas! En la vida de acá ¡pórtate amablemente con ellos! ¡Sigue el camino de quien vuelve a Mí arrepentido! Luego, volveréis a Mí y ya os informaré de lo que hacíais».",
                            "verse 31:16": "«¡Hijito! Aunque se trate de algo del peso de un grano de mostaza y esté escondido en una roca, en los cielos o en la tierra, Alá lo sacará a luz. Alá es sutil, está bien informado.",
                            "verse 31:17": "¡Hijito! ¡Haz la azalá! ¡Ordena lo que está bien y prohíbe lo que está mal! ¡Ten paciencia ante la adversidad! ¡Eso sí que es dar muestras de resolución!",
                            "verse 31:18": "¡No pongas mala cara a la gente, ni pises la tierra con insolencia! Alá no ama a nadie que sea presumido, jactancioso.",
                            "verse 31:19": "¡Sé modesto en tus andares! ¡Habla en voz baja! ¡La voz más desagradable es, ciertamente, la del asno!»",
                            "verse 31:20": "¿No veis que Alá ha sujetado a vuestro servicio lo que está en los cielos y en la tierra, y os ha colmado de Sus gracias, visibles u ocultas? Pero hay algunos hombres que discuten de Alá sin tener conocimiento, ni dirección, ni Escritura luminosa.",
                            "verse 31:21": "Y, cuando se les dice: «¡Seguid lo que Alá ha revelado!», dicen: «¡No, sino que seguiremos lo mismo que nuestros padres seguían!» ¿Y si el Demonio les llamara al castigo del fuego de la gehena?",
                            "verse 31:22": "Quien se somete a Alá y hace el bien se ase del asidero más firme. El fin de todo es Alá.",
                            "verse 31:23": "Si alguien no cree, ¡que su incredulidad no te entristezca! Volverán a Nosotros y ya les informaremos de lo que hacían. Alá sabe bien lo que encierran los pechos.",
                            "verse 31:24": "Les dejaremos que gocen por breve tiempo. Luego, les arrastraremos a un duro castigo.",
                            "verse 31:25": "Si les preguntas: «¿Quién ha creado los cielos y la tierra?», seguro que dicen: «¡Alá!» Di: «¡Alabado sea Alá!» No, la mayoría no saben.",
                            "verse 31:26": "Es de Alá lo que está en los cielos y en la tierra. Alá es Quien Se basta a Sí mismo, el Digno de Alabanza.",
                            "verse 31:27": "Si se hicieran cálamos de los árboles de la tierra, y se añadieran al mar, luego de él, otros siete mares más, no se agotarían las palabras de Alá. Alá es poderoso, sabio.",
                            "verse 31:28": "Crearos y resucitaros cuesta a Alá tanto como si se tratara de una sola persona. Alá todo lo oye, todo lo ve.",
                            "verse 31:29": "¿No ves que Alá hace que la noche entre en el día y que el día entre en la noche, ha sujetado el sol y la luna, prosiguiendo los dos su curso hasta un término fijo, y que Alá está bien informado de lo que hacéis?",
                            "verse 31:30": "Esto es así porque Alá es la Verdad, pero lo que ellos invocan en lugar de invocarle a Él es lo falso. Alá es el Altísimo, el Grande.",
                            "verse 31:31": "¿No ves que las naves navegan por la gracia de Alá, para que Él os muestre algunos de Sus signos? Ciertamente, hay en ello signos para todo aquél que tenga mucha paciencia, mucha gratitud.",
                            "verse 31:32": "Y, cuando las olas les cubren cual pabellones, invocan a Alá rindiéndole culto sincero. Pero, en cuanto les salva, llevándolos a tierra firme, algunos de ellos vacilan. Nadie niega Nuestros signos sino todo aquél que es pérfido, desagradecido.",
                            "verse 31:33": "¡Hombres! ¡Temed a vuestro Señor y tened miedo de un día en que el padre no pueda satisfacer por su hijo, ni el hijo por su padre! ¡Lo que Alá promete es verdad! ¡Que la vida de acá no os engañe, y que el Engañador no os engañe acerca de Alá!",
                            "verse 31:34": "Alá tiene conocimiento de la Hora. Envía abajo la lluvía. Sabe lo que encierran las entrañas de la madre, mientras que nadie sabe lo que el día siguiente le deparará, nadie sabe en qué tierra morirá. Alá es omnisciente, está bien informado."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "அலிஃப், லாம், மீம்.",
                            "verse 31:2": "இவை ஞானம் நிறைந்த வேதத்தின் வசனங்களாகும்.",
                            "verse 31:3": "(இது) நன்மை செய்வோருக்கு நேர் வழி காட்டியாகவும் ரஹ்மத்தாகவும் இருக்கிறது.",
                            "verse 31:4": "அவர்கள் (எத்தகையோரென்றால்) தொழுகையை நிலை நாட்டுவார்கள்; ஜகாத்தும் கொடுத்து வருவார்கள்; இன்னும் அவர்கள் ஆகிரத்தை (மறுமையை) உறுதியாக நம்புவார்கள்.",
                            "verse 31:5": "இவர்கள் தாம் தம் இறைவனின் நேர் வழியில் இருப்பவர்கள்; மேலும் இவர்களே வெற்றியாளர்கள்.",
                            "verse 31:6": "(இவர்கள் தவிர) மனிதர்களில் சிலர் இருக்கின்றார்கள் - அவர்கள் அறிவில்லாமல் வீணான பேச்சக்களை விலைக்கு வாங்கி, (அவற்றால் மக்களை) அல்லாஹ்வின் பாதையிலிருந்து வழி கெடுக்கவும், அல்லாஹ்வின் பாதையைப் பரிகாசமாக்கிக் கொள்ளவும் (முயல்கிறார்கள்) இத்தகையோருக்கு இழிவுதரும் வேதனையுண்டு.",
                            "verse 31:7": "அ(த்தகைய)வனுக்கு நம்முடைய வசனங்கள் ஓதிக்க காண்பிக்கப்பட்டால், அவன் அவற்றைக் கேட்காதவனே போல் - அவன் இரு காதுகளிலும் செவிட்டுத் தனம் இருப்பது போல், பெருமை கொண்டவனாகத் திரும்பி விடுகிறான்; ஆகவே அவனுக்கு நோவினை செய்யும் வேதனையுண்டென்று (நபியே!) நீர் நற் செய்தி கூறுவீராக.",
                            "verse 31:8": "நிச்சயமாக, ஈமான் கொண்டு ஸாலிஹான (நல்ல) அமல்கள் செய்பவர்களுக்குப் பாக்கியமுள்ள சுவனபதிகள் உண்டு.",
                            "verse 31:9": "அவர்கள் அங்கு என்றென்றும் தங்குவார்கள் - அல்லாஹ்வின் வாக்குறுதி உண்மையானது அவன் (யாவற்றையும்) மிகைத்தவன்; ஞானம் மிக்கோன்.",
                            "verse 31:10": "அவன் வானங்களைத் தூண்களின்றியே படைத்துள்ளான். அதனை நீங்களும் பார்க்கிறீர்கள். உங்களுடன் பூமி அசையாதிருப்பதற்காக அவன் அதன் மேல் மலைகளை உறுதியாக நிறுத்தினான்; மேலும் அதன் மீது எல்லா விதமான பிராணிகளையும் அவன் பரவவிட்டிருக்கின்றான்; இன்னும் நாமே வானத்திலிருந்து மழையை பொழியச் செய்து அதில் சங்கையான, வகை வகையான (மரம், செடி, கொடி ஆகியவற்றை) ஜோடி ஜோடியாக முளைப்பித்திருக்கின்றோம்.",
                            "verse 31:11": "\"இவை(யாவும்) அல்லாஹ்வின் படைப்பாகும் - அவனன்றி உள்ளவர்கள் எதைப் படைத்திருக்கின்றனர் என்பதை எனக்குக் காண்பியுங்கள்\" (என்று அவர்களிடம் நபியே! நீர் கூறும்.) அவ்வாறல்ல அநியாயக்காரர்கள் பகிரங்கமான வழிகேட்டில்தான் இருக்கின்றனர்.",
                            "verse 31:12": "இன்னும், நாம் லுஃக்மானுக்கு நிச்சயமாக ஞானத்தைக் கொடுத்தோம். \"அல்லாஹ்வுக்கு நீர் நன்றி செலுத்தும்; ஏனென்றால் எவன் நன்றி செலுத்துகிறானோ அவன் தன(து நன்மை)க்காவே நன்றி செலுத்துகிறான்; இன்னும் எவன் நிராகரிக்கிறானோ (அவன் தன்னையே நட்டப்படுத்திக் கொள்கிறான்) - நிச்சயமாக அல்லாஹ் (எவரிடத்தருந்தும்) தேவையில்லாதவன்; புகழப்படுபவன்\".",
                            "verse 31:13": "இன்னும் லுஃக்மான் தம் புதல்வருக்கு; \"என் அருமை மகனே! நீ அல்லாஹ்வுக்கு இணை வைக்காதே நிச்சயமாக இணை வைத்தல் மிகப் பெரும் அநியாயமாகும்,\" என்று நல்லுபதேசம் செய்து கூறியதை (நினைவுபடுத்துவீராக).",
                            "verse 31:14": "நாம் மனிதனுக்கு தன் பெற்றோர் (இருவருக்கும் நலம் செய்ய வேண்டியது) பற்றி வஸிய்யத்துச் செய்(து போதித்)தோம்; அவனுடைய தாய் பலஹீனத்தின் மேல் பலஹீனம் கொண்டவளாக (கர்ப்பத்தில்) அவனை சுமந்தாள்; இன்னும் அவனுக்குப் பால் குடி மறத்த(லி)ல் இரண்டு வருடங்கள் ஆகின்றன் ஆகவே \"நீ எனக்கும் உன் பெற்றோர்க்கும் நன்றி செலுத்துவாயாக என்னிடமே உன்னுடைய மீளுதல் இருக்கிறது.\"",
                            "verse 31:15": "ஆனால், நீ எது பற்றி அறிவு (ஆதாரம்) பெற்றவனாக இல்லையோ அதனை எனக்கு இணை வைக்குமாறு உன்னை அவ்விருவரும் வற்புறுத்தினால் அப்போது நீ அவ்விருவருக்கும் வழிபட வேணடாம்; ஆனால் இவ்வுலக வாழ்க்கையில் அவ்விருவருடனும் அழகிய முறையில் உறவு வைத்துக் கொள்; (யாவற்றிலும்) என்னையே நோக்கி நிற்போரின் வழியையே நீ பின்பற்றுவாயாக - பின்னர் உங்கள் (அனைவருடைய) மீளுதலும் என்னிடமேயாகும்; நீங்கள் என்ன செய்து கொண்டிருந்தீர்கள் என்பதை (அப்போது) நான் உங்களுக்கு அறிவிப்பேன்.\"",
                            "verse 31:16": "(லுஃக்மான் தம் புதல்வரிடம்) என் அருமை மகனே! (நன்மையோ, தீமையோ) அது ஒரு கடுகின் வித்து அளவே எடையுள்ளது ஆயினும்; அது கற்பாறைக்குள் இருந்தாலும் அல்லது வானங்களில் இருந்தாலும், அல்லது பூமிக்குள்ளே இருந்தாலும் அல்லாஹ் அதையும் (வெளியே) கொண்டு வருவான்; நிச்சயமாக அல்லாஹ் நுண்ணறிவு மிக்கவன்; (ஒவ்வொன்றின் அந்தரங்கத்தையும்) நன்கறிபவன்.",
                            "verse 31:17": "\"என் அருமை மகனே! நீ தொழுகையை நிலை நாட்டுவாயாக நன்மையை ஏவி, தீமையை விட்டும் (மனிதர்களை) விலக்குவாயாக உனக்கு ஏற்படும் கஷ்டங்களைப் பொறுத்துக் கொள்வாயாக் நிச்சயமாக இதுவே வீரமுள்ள செயல்களில் உள்ளதாகும்",
                            "verse 31:18": "\"(பெருமையோடு) உன் முகத்தை மனிதர்களை விட்டும் திருப்பிக் கொள்ளாதே! பூமியில் பெருமையாகவும் நடக்காதே! அகப்பெருமைக்காரர், ஆணவங் கொண்டோர் எவரையும் நிச்சயமாக அல்லாஹ் நேசிக்க மாட்டான்.",
                            "verse 31:19": "\"உன் நடையில் (மிக வேகமோ, அதிக சாவதானமோ இல்லாமல்) நடுத்தரத்தை மேற்கொள்; உன் குரலையும் தாழ்த்திக் கொள்; குரல்களிலெல்லாம் வெறுக்கத்தக்கது நிச்சயமாக கழுதையின் குரலேயாகும்.",
                            "verse 31:20": "நிச்சயமாக அல்லாஹ் வானங்களில் உள்ளவற்றையும், பூமியில் உள்ளவற்றையும், உங்களுக்கு வசப்படுத்தி இருக்கிறான் என்பதையும்; இன்னும் தன் அருட் கொடைகளை உங்கள் மீது புறத்திலும், அகத்திலும் நிரம்பச் செய்திருக்கிறான் என்பதையும் நீங்கள் அறியவில்லையா? ஆயினும், மக்களில் சிலர் இருக்கிறார்கள்; அவர்கள் போதிய கல்வியறிவில்லாமலும்; நேர்வழி இல்லாமலும், ஒளிமிக்க வேதமில்லாமலும் அல்லாஹ்வைக் குறித்துத் தர்க்கம் செய்கின்றனர்.",
                            "verse 31:21": "\"அல்லாஹ் இறக்கி வைத்த (வேதத்)தை நீங்கள் பின்பற்றுங்கள்\" என அவர்களுக்குச் சொல்லப்பட்டால், அவர்கள் \"(அப்படியல்ல)! நாங்கள் எங்களுடைய மூதாதையவர்களை எதில் கண்டோமோ, அதைத் தான் நாங்கள் பின்பற்றுவோம்\" என்று கூறுகிறார்கள். அவர்களை ஷைத்தான் கொழுந்து விட்டெரியும் (நரக) நெருப்பின் வேதனையின் பக்கம் அழைத்தாலுமா (பின்பற்றுவர்?)",
                            "verse 31:22": "எவன் தன் முகத்தை முற்றிலும் அல்லாஹ்வின் பக்கமே திருப்பி, நன்மை செய்து கொண்டிருக்கிறானோ, அவன் நிச்சயமாக உறுதியான கயிற்றை பலமாக பற்றிப் பிடித்துக் கொண்டான். இன்னும் காhயங்களின் முடிவெல்லாம் அல்லாஹ்விடமேயுள்ளது.",
                            "verse 31:23": "(நபியே!) எவன் நிராகரிப்பானோ அவனுடைய குஃப்ரு - நிராகரிப்பு உம்மை விசனப்படுத்த வேண்டாம். அவர்களின் மீளுதல் நம்மிடத்தில்தான் இருக்கிறது அவர்கள் என்ன செய்து கொண்டிருந்தார்கள் என்பதை அப்பொழுது நாம் அவர்களுக்கு அறிவிப்போம் - நிச்சயமாக அல்லாஹ் இருதயங்களில் உள்ளவற்றை நன்கறிபவன்.",
                            "verse 31:24": "அவர்களை நாம் சிறிது சுகிக்கச் செய்வோம்; பின்னர் நாம் அவர்களை மிகவும் கடுமையான வேதனையில் (புகுமாறு) நிர்ப்பந்திப்போம்.",
                            "verse 31:25": "\"வானங்களையும், பூமியையும் படைத்தவன் யார்? என்று அவர்களிடம் நீர் கேட்பீராயின் அவர்கள், \"அல்லாஹ்\" என்றே நிச்சயமாக சொல்லுவார்கள்; அல்ஹம்து லில்லாஹ் - எல்லாப்புகழும் அல்லாஹ்வுக்கே\" என்று நீர் கூறுவீராக் எனினும், அவர்களில் பெரும்பாலோர் அறியமாட்டார்கள்.",
                            "verse 31:26": "வானங்களிலுள்ளவையும், பூமியிலுள்ளவையும் (யாவும்) அல்லாஹ்வுக்கே உரியன. நிச்சயமாக, அல்லாஹ் (எவரிடமும்) தேவையற்றவன்; புகழப்படுபவன்.",
                            "verse 31:27": "மேலும், நிச்சயமாக இப்பூமியிலுள்ள மரங்கள் யாவும் எழுது கோல்களாகவும், கடல் (நீர் முழுதும்) அதனுடன் கூட மற்றும் ஏழு கடல்கள் அதிகமாக்கப்பட்டு (மையாக) இருந்த போதிலும், அல்லாஹ்வின் (புகழ்) வார்த்தைகள் முடிவுறா நிச்சயமாக அல்லாஹ் மிகைத்தவன்; ஞானம் மிக்கோன்.",
                            "verse 31:28": "(மனிதர்களே!) உங்களை படைப்பதும், (நீங்கள் மரித்த பின்) உங்களை (உயிர்ப்பித்து) எழுப்புவதும் ஒருவரைப் (படைத்து, அவர் மரித்தபின் உயிர் கொடுத்து எழுப்புவது) போலன்றி வேறில்லை நிச்சயமாக அல்லாஹ் (யாவற்றையும்) செவியேற்பவன்; உற்று நோக்குபவன்.",
                            "verse 31:29": "\"நிச்சயமாக அல்லாஹ்தான் இரவைப் பகலில் புகுத்துகிறான்; பகலை இரவில் புகுத்துகிறான்; இன்னும் சூரியனையும், சந்திரனையும் வசப்படுத்தினான்\" என்பதை நீர் பார்க்கவில்லையா? ஒவ்வொன்றும் ஒரு குறிப்பிட்ட தவணைவரை செல்கின்றன அன்றியும் நிச்சயமாக அல்லாஹ் நீங்கள செய்பவற்றை நன்கறிபவன்.",
                            "verse 31:30": "எதனாலென்றால் நிச்சயமாக அல்லாஹ்வே மெய்யான (இறை)வனாவான்; அவனை அன்றி அவர்கள் பிரார்த்திப்பவையாவும் அசத்தியமானவை மேலும் நிச்சயமாக அல்லாஹ்வே உன்னத மிக்கவன்; மகாப் பெரியவன்.",
                            "verse 31:31": "தன்னுடைய அத்தாட்சிகளை உங்களுக்குக் காண்பிப்பதற்காக வேண்டி, அல்லாஹ்வுடைய அருள் கொடையைக் கொண்டு நிச்சமயாகக் கப்பல் கடலில் (மிதந்து) செல்வதை நீர் காணவில்லையா? நிச்சயமாக இதில் பொறுமை மிக்க - நன்றியறிதலுடைய ஒவ்வொருவருக்கும் அத்தாட்சிகள் இருக்கின்றன.",
                            "verse 31:32": "(கப்பலில் செல்லும்) அவர்களை, மலைமுகடுகளைப் போன்ற அலை சூழ்ந்து கொள்ளுமானால், அல்லாஹ்வுக்கே வழிபட்டு அந்தரங்க சுத்தியுடன் அவனிடம் பிரார்த்திக்கின்றனர்; ஆனால் அவன் அவர்களைக் காப்பாற்றிக்கரைசேர்த்து விட்டால், அவர்களில் சிலர் நடுநிலையாக நடந்து கொள்கிறார்கள் - எனினும் மிகவும் நன்றி கெட்ட, பெருந்துரோகிகளைத் தவிர வேறு எவரும் நம் அத்தாட்சிகளை நிராகரிப்பதில்லை.",
                            "verse 31:33": "மனிதர்களே! உங்கள் இறைவனையஞ்ச (நடந்து) கொள்ளுங்கள்; இன்னும் அந்த (கியாமத்) நாளைக்குறித்துப் பயந்து கொள்ளுங்கள்; (அந்நாளில்) தந்தை தன் மகனுக்கு பலனளிக்க மாட்டார்; (அதே போன்று) பிள்ளையும் தன் தந்தைக்கு எதையும் நிறைவேற்றி வைக்க இயலாது நிச்சயமாக அல்லாவின் வாக்குறுதி உண்மையானதாகும்; ஆகவே இவ்வுலக வாழ்க்கை உங்களை மருட்டி ஏமாற்றிவிட வேண்டாம்; மருட்டி ஏமாற்றுபவ(னாகிய ஷைத்தா)னும் அல்லாஹ்வைக் குறித்து உங்களை மருட்டி ஏமாற்றாதிருக்கட்டும்.",
                            "verse 31:34": "நிச்சயமாக அந்த (கியாம) நேரம் பற்றிய ஞானம் அல்லாஹ்விடமே இருக்கிறது அவனே மழையையும் இறக்குகிறான்; இன்னும் அவன் கர்ப்பங்களில் உள்ளவற்றையும் அறிகிறான். நாளை தினம் தாம் (செய்வது) சம்பாதிப்பது எது என்பதை எவரும் அறிவதில்லை தான் எந்த பூமியில் இறப்போம் என்பதையும் எவரும் அறிவதில்லை. நிச்சயமாக அல்லாஹ்தான் நன்கறிபவன்; நுட்பம் மிக்கவன்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "อะลิฟ ลาม มีม",
                            "verse 31:2": "เหล่านั้นคือบรรดาอายาตแห่งคัมภีร์ที่ชัดแจ้ง",
                            "verse 31:3": "(เพื่อ) เป็นแนวทางที่ถูกต้องและเป็นการเมตตาแก่บรรดาผู้กระทำความดี",
                            "verse 31:4": "(คือ) บรรดาผู้ดำรงการละหมาด และบริจาคซะกาต และพวกเขาเชื่อมั่นต่อวันปรโลก",
                            "verse 31:5": "ชนเหล่านั้นอยู่บนแนวทางที่ถูกต้องจากพระเจ้าของพวกเขา และชนเหล่านั้นพวกเขาเป็นผู้ประสบความสำเร็จ",
                            "verse 31:6": "และในหมู่มนุษย์มีผู้ซื้อเอาเรื่องไร้สาระ เพื่อทำให้เขาหลงไปจากทางของอัลลอฮ์ โดยปราศจากความรู้ และถือเอามันเป็นเรื่องขบขัน ชนเหล่านี้พวกเขาจะได้รับการลงโทษอันอัปยศ",
                            "verse 31:7": "และเมื่ออายาตทั้งหลายของเราถูกอ่านให้แก่เขา เขาก็ผินหลังให้อย่างจองหอง ประหนึ่งว่าเขาไม่ได้ยินอายาตนั้นๆ ประหนึ่งว่าในหูของเขานั้นหนวก ดังนั้น จงแจ้งข่าวแก่เขาถึงการลงโทษอันเจ็บปวด",
                            "verse 31:8": "แท้จริงบรรดาผู้ศรัทธาและกระทำความดีทั้งหลาย พวกเขาจะได้รับสวนสวรรค์หลากหลายอย่างสุขสำราญ",
                            "verse 31:9": "พวกเขาเป็นผู้พำนักอยู่ในนั้นตลอดกาล สัญญาของอัลลอฮ์นั้นเป็นจริง และพระองค์คือผู้ทรงอำนาจผู้ทรงปรีชาญาณ",
                            "verse 31:10": "พระองค์ทรงสร้างชั้นฟ้าทั้งหลายโดยปราศจากเสาที่พวกเจ้าจะมองเห็นมันได้ และทรงปักเทือกเขาไว้อย่างมั่นคงในแผ่นดินเพื่อมิให้มันสั่นคลอนไปกับพวกเจ้า และทรงให้สัตว์ทุกชนิดแพร่หลายในมัน (แผ่นดิน) และเราได้ให้น้ำ (ฝน) หลั่งลงมาจากฟากฟ้าและเราได้ให้พืชทุกชนิดงอกเงยออกมาเป็นคู่ ๆ อย่างดีงาม",
                            "verse 31:11": "นี่คือการสร้างของอัลลอฮ์ ดังนั้น พวกเจ้าจงแสดงให้ข้า (อัลลอฮ์) เห็นซิว่า อันใดเล่าที่เขาเหล่านั้นได้สร้างมันขึ้นมาอื่นจากพระองค์ แต่ว่าบรรดาผู้อธรรมต่างหากที่อยู่ในการหลงผิดอย่างชัดแจ้ง",
                            "verse 31:12": "และโดยแน่นอน เราได้ให้ฮิกมะฮ์ แก่ลุกมานว่า จงขอบพระคุณต่ออัลลอฮ์ และผู้ใดขอบคุณ แท้จริงเขาก็ขอบคุณตัวของเขาเอง และผู้ใดปฏิเสธ แท้จริงอัลลอฮ์นั้นทรงพอเพียงและทรงได้รับการสรรเสริญ",
                            "verse 31:13": "และจงรำลึกเมื่อลุกมานได้กล่าวแก่บุตรของเขา โดยสั่งสอนเขาว่า โอ้ลูกเอ๋ย เจ้าอย่าได้ตั้งภาคีใด ๆ ต่ออัลลอฮ์ เพราะแท้จริงการตั้งภาคีนั้นเป็นความผิดอย่างมหันต์ โดยแน่นอน",
                            "verse 31:14": "และเราได้สั่งการแก่มนุษย์เกี่ยวกับบิดา มารดาของเขา โดยที่มารดาของเขาได้อุ้มครรภ์เขาอ่อนเพลียลงครั้งแล้วครั้งเล่า และการหย่านมของเขาในระยะเวลาสองปี เจ้าจงขอบคุณข้า และบิดามารดาของเจ้า ยังเรานั้น คือการกลับไป",
                            "verse 31:15": "และถ้าเขาทั้งสองบังคับเจ้าให้ตั้งภาคีต่อข้า โดยที่เจ้าไม่มีความรู้ในเรื่องนั้น เจ้าอย่าได้เชื่อฟังปฏิบัติตามเขาทั้งสอง และจงอดทนอยู่กับเขาทั้งสองในโลกนี้ด้วยการทำความดี และจงปฏิบัติตามทางของผู้ที่กลับไปสู่ข้า และยังเรานั้นถือทางกลับของพวกเจ้า ดังนั้น ข้าจะบอกแก่พวกเจ้าในสิ่งที่พวกเจ้าได้กระทำไว้",
                            "verse 31:16": "โอ้ลูกเอ๋ย แท้จริง (หากว่าความผิดนั้น) มันจะหนักเท่าเมล็ดผักสักเมล็ดหนึ่ง มันจะซ่อนอยู่ในหิน หรืออยู่ในชั้นฟ้าทั้งหลาย หรืออยู่ในแผ่นดิน อัลลอฮ์ก็จะทรงนำมันออกมา แท้จริง อัลลอฮ์เป็นผู้ทรงเมตตา ผู้ทรงรอบรู้ยิ่ง",
                            "verse 31:17": "โอ้ลูกเอ๋ย เจ้าจงดำรงไว้ซึ่งการละหมาด และจงใช้กันให้กระทำความดี และจงห้ามปรามกันให้ละเว้นการทำความชั่ว และจงอดทนต่อสิ่งที่ประสบกับเจ้า แท้จริง นั่นคือส่วนหนึ่งจากกิจการที่หนักแน่น มั่นคง",
                            "verse 31:18": "และเจ้าอย่าหันแก้ม (ใบหน้า) ของเจ้าให้แก่ผู้คนอย่างยะโส และอย่าเดินไปตามแผ่นดินอย่างไร้มรรยาท แท้จริง อัลลอฮ์ มิทรงชอบทุกผู้หยิ่งจองหอง และผู้คุยโวโอ้อวด",
                            "verse 31:19": "และเจ้าจงก้าวเท้าของเจ้าพอประมาณ และจงลดเสียงของเจ้าลง แท้จริง เสียงที่น่าเกลียดยิ่งคือเสียง (ร้อง) ของลา",
                            "verse 31:20": "พวกเจ้ามิเห็นดอกหรือว่า แท้จริงอัลลอฮ์ทรงอำนวยความสะดวกให้แก่พวกเจ้าสิ่งที่มีอยู่ในชั้นฟ้าทั้งหลายและสิ่งที่มีอยู่ในแผ่นดิน และพระองค์ได้ทรงประทานความ โปรดปรานมากมายของพระองค์อย่างครบครันแก่พวกเจ้า ทั้งที่เปิดเผยและที่ซ่อนเร้นและในหมู่มนุษย์มีผู้โต้เถียงในเรื่องของอัลลอฮ์โดยปราศจากความรู้และปราศจากแนวทางที่ถูกต้องและปราศจากคัมภีร์ที่ให้ความสว่าง (แก่พวกเขา)",
                            "verse 31:21": "และได้เมื่อมีการกล่าวแก่พวกเขาว่า จงปฏิบัติตามสิ่งที่อัลลอฮ์ทรงประทานลงมา พวกเขากล่าวว่า แต่เราจะปฏิบัติตามสิ่งที่เราพบบรรพบุรุษของเราปฏิบัติในเรื่องนั้น อะไรกัน ถึงแม้ว่าชัยตอนจะเรียกร้องพวกเขาสู่การลงโทษที่มีไฟลุกโชนอยู่กระนั้นหรือ?",
                            "verse 31:22": "และผู้ใดยอมนอบน้อมใบหน้าของเขายังอัลลอฮ์ โดยที่เขาเป็นผู้กระทำดี แน่นอนเขาได้ยึดห่วงอันมั่นคงไว้แล้ว และบั้นปลายของกิจการทั้งหลายย่อมกลับไปหาอัลลอฮ์",
                            "verse 31:23": "และผู้ใดปฏิเสธศรัทธา ก็อย่าให้การปฏิเสธศรัทธาของเขาทำให้เจ้าเศร้าโศกเสียใจ และยังเรานั้นคือทางกลับของพวกเขา ดังนั้น เราจะบอกแก่พวกเขาในสิ่งที่พวกเขาได้กระทำไว้ แท้จริง อัลลอฮ์นั้นเป็นผู้ทรงรอบรู้สิ่งที่อยู่ในทรวงอก",
                            "verse 31:24": "เราจะให้เวลาพวกเขาสนุกสนานกันเพียงเล็กน้อย แล้วเราจะไล่ต้อนพวกเขาสู่การลงโทษที่รุนแรง",
                            "verse 31:25": "และถ้าเจ้าถามพวกเขา ใครเป็นผู้สร้างชั้นฟ้าทั้งหลายและแผ่นดิน แน่นอนพวกเขาจะกล่าวว่า อัลลอฮ์ จงกล่าวเถิด (มุฮัมมัด) บรรดาการสรรเสริญเป็นของอัลลอฮ์ แต่ทว่าส่วนมากของพวกเขาไม่รู้",
                            "verse 31:26": "สิ่งที่อยู่ในชั้นฟ้าทั้งหลายและแผ่นดินเป็นสิทธิของอัลลอฮ์ แท้จริงอัลลอฮ์นั้นคือ ผู้ทรงพอเพียงจากสิ่งทั้งหลาย ผู้ทรงได้รับการสรรเสริญ",
                            "verse 31:27": "และหากว่าต้นไม้ทั้งหมดที่มีอยู่ในแผ่นดินเป็นปากกาหลาย ๆ ด้าม และมหาสมุทร (เป็นน้ำหมึก) มีสำรองไว้อีกเจ็ดมหาสมุทรพจนารถของอัลลอฮ์ก็จะยังไม่หมดสิ้นไป แท้จริงอัลลอฮ์เป็นผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ",
                            "verse 31:28": "การบังเกิดของพวกเจ้าและการฟื้นคืนชีพของพวกเจ้า มิใช่อื่นใดนอกจากเสมือนชีวิตเดียว แท้จริง อัลลอฮ์เป็นผู้ทรงได้ยินผู้ทรงเห็น",
                            "verse 31:29": "เจ้ามิเห็นดอกหรือว่า แท้จริงอัลลอฮ์ทรงให้กลางคืนคาบเกี่ยวเข้าไปในเวลากลางวัน และทรงให้กลางวันคาบเกี่ยวเข้าไปในเวลากลางคืน และทรงสร้างให้ดวงอาทิตย์และดวงจันทร์ (เป็นประโยชน์แก่มนุษย์) ทุกสิ่งโคจรไปตามวาระที่กำหนดไว้ และแท้จริงอัลลอฮ์นั้นทรงรู้ดียิ่งในสิ่งที่พวกเจ้ากระทำ",
                            "verse 31:30": "นั่นเพราะว่าอัลลอฮ์นั้น พระองค์คือผู้ทรงสัจจะ และเพราะว่าสิ่งที่พวกเขาวิงวอนขออื่นจากพระองค์นั้นเป็นเท็จ",
                            "verse 31:31": "เจ้ามิเห็นดอกหรือว่า เรือนั้นแล่นไปตามท้องทะเลเนื่องด้วยความโปรดปรานของอัลลอฮ์ เพื่อพระองค์จะให้พวกเจ้าได้เห็นสัญญาณต่าง ๆ ของพระองค์ แท้จริงในการนั้นย่อมเป็นสัญญาณแก่ผู้อดทนผู้ขอบคุณทุกคน",
                            "verse 31:32": "และเมื่อลูกคลื่นซัดมาท่วมมิดตัวพวกเขาคล้ายฝาที่ครอบคลุม พวกเขาก็วิงวอนขอต่ออัลลอฮ์ด้วยความบริสุทธิ์ใจต่อพระองค์ ครั้นเมื่อพระองค์ได้ช่วยให้พวกเขาได้ขึ้นบกในหมู่พวกเขามีผู้อยู่ในสายกลาง และไม่มีผู้ปฏิเสธสัญญาณต่าง ๆ ของเรา นอกจากทุกผู้ทรยศผู้เนรคุณ",
                            "verse 31:33": "โอ้มนุษย์เอ๋ย พวกเจ้าจงยำเกรงพระเจ้าของพวกเจ้าเถิด และจงกลัววันหนึ่งที่พ่อไม่อาจจะช่วยลูกของเขาได้ และลูกก็ไม่อาจจะช่วยพ่อของเขาได้แต่อย่างใด แท้จริงสัญญาของอัลลอฮ์นั้นเป็นความจริง ดังนั้นอย่าให้การมีชีวิตอยู่ในโลกนี้ล่อลวงพวกเจ้า และอย่าให้หัวหน้าพวกล่อลวง (ชัยตอน) มาหลอกลวงพวกเจ้าเกี่ยวกับอัลลอฮ์เป็นอันขาด",
                            "verse 31:34": "แท้จริงอัลลอฮ์นั้น ความรู้แห่งวันอวสานมีอยู่ ณ ที่พระองค์ และพระองค์ทรงประทานฝนลงมาและพระองค์ทรงรอบรู้สิ่งที่อยู่ในมดลูก และไม่มีชีวิตใดรู้ว่า ณ แผ่นดินใดมันจะตาย"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Elif. Lâm. Mîm.",
                            "verse 31:2": "İşte bu âyetler, hikmet dolu Kitab'ın âyetleridir.",
                            "verse 31:3": "Güzel davrananlar için bir hidayet rehberi ve rahmet olmak üzere (indirilmiştir).",
                            "verse 31:4": "O kimseler, namazı kılarlar, zekâtı verirler; onlar ahirete de kesin olarak iman ederler.",
                            "verse 31:5": "İşte onlar, Rableri tarafından gösterilmiş doğru yol üzeredirler ve onlar kurtuluşa erenlerdir.",
                            "verse 31:6": "İnsanlardan öylesi var ki, herhangi bir ilmî delile dayanmadan Allah yolundan saptırmak ve sonra da onunla alay etmek için boş lafı satın alır. İşte onlara rüsvay edici bir azap vardır.",
                            "verse 31:7": "Ona âyetlerimiz okunduğu zaman, sanki bunları işitmemiş, sanki kulaklarında ağırlık varrmış gibi büyüklük taslayarak yüz çevirir. Sen de ona acıklı bir azabın müjdesini ver!",
                            "verse 31:8": "Şüphesiz, iman edip de güzel davranışlarda bulunanlar için, nimetleri bol cennetler vardır.",
                            "verse 31:9": "Orada ebedi kalacaklardır. Bu, Allah'ın verdiği gerçek sözdür. O, mutlak güç ve hikmet sahibidir.",
                            "verse 31:10": "O, gökleri görebildiğiniz bir direk olmaksızın yarattı, sizi sarsmasın diye yere de ulu dağlar koydu ve orada her çeşit canlıyı yaydı. Biz gökyüzünden su indirip, orada her faydalı nebattan çift çift bitirdik.",
                            "verse 31:11": "İşte bunlar Allah'ın yarattıklarıdır. Şimdi (ey kâfirler!) O'ndan başkasının ne yarattığını bana gösterin! Hayır (gösteremezler)! Zalimler açık bir sapıklık içindedirler.",
                            "verse 31:12": "Andolsun biz Lokman'a: Allah'a şükret! diyerek hikmet verdik. Şükreden ancak kendisi için şükretmiş olur. Nankörlük eden de bilsin ki, Allah hiçbir şeye muhtaç değildir, her türlü övgüye lâyıktır.",
                            "verse 31:13": "Lokman, oğluna öğüt vererek: Yavrucuğum! Allah'a ortak koşma! Doğrusu şirk, büyük bir zulümdür, demişti.",
                            "verse 31:14": "Biz insana, ana-babasına iyi davranmasını tavsiye etmişizdir. Çünkü anası onu nice sıkıntılara katlanarak taşımıştır. Sütten ayrılması da iki yıl içinde olur. (İşte bunun için) önce bana, sonra da ana-babana şükret diye tavsiyede bulunmuşuzdur. Dönüş ancak banadır.",
                            "verse 31:15": "Eğer onlar seni, hakkında bilgin olmayan bir şeyi (körü körüne) bana ortak koşman için zorlarlarsa, onlara itaat etme. Onlarla dünyada iyi geçin. Bana yönelenlerin yoluna uy. Sonunda dönüşünüz ancak banadır. O zaman size, yapmış olduklarınızı haber veririm.",
                            "verse 31:16": "(Lokman, öğütlerine devamla şöyle demişti:) Yavrucuğum! Yaptığın iş (iyilik veya kötülük), bir hardal tanesi ağırlığında bile olsa ve bu, bir kayanın içinde veya göklerde yahut yerin derinliklerinde bulunsa, yine de Allah onu (senin karşına) getirir. Doğrusu Allah, en ince işleri görüp bilmektedir ve her şeyden haberdardır.",
                            "verse 31:17": "Yavrucuğum! Namazı kıl, iyiliği emret, kötülükten vazgeçirmeye çalış, başına gelenlere sabret. Doğrusu bunlar, azmedilmeye değer işlerdir.",
                            "verse 31:18": "Küçümseyerek insanlardan yüz çevirme ve yeryüzünde böbürlenerek yürüme. Zira Allah, kendini beğenmiş övünüp duran kimseleri asla sevmez.",
                            "verse 31:19": "Yürüyüşünde tabiî ol, sesini alçalt. Unutma ki, seslerin en çirkini merkeplerin sesidir.",
                            "verse 31:20": "Allah'ın, göklerde ve yerdeki (nice varlık ve imkânları) sizin emrinize verdiğini, nimetlerini açık ve gizli olarak size bolca ihsan ettiğini görmediniz mi? Yine de, insanlar içinde, -bilgisi, rehberi ve aydınlatıcı bir kitabı yokken- Allah hakkında tartışan kimseler vardır.",
                            "verse 31:21": "Onlara \"Allah'ın indirdiğine uyun\" dendiğinde: Hayır, biz babalarımızı üzerinde bulduğumuz yola uyarız, derler. Ya şeytan; onları alevli ateşin azabına çağırıyor idiyse!",
                            "verse 31:22": "İyi davranışlar içinde kendini bütünüyle Allah'a veren kimse, gerçekten en sağlam kulpa yapışmıştır. Zaten bütün işlerin sonu Allah'a varır.",
                            "verse 31:23": "(Resûlüm!) İnkâr edenin inkârı seni üzmesin. Onların dönüşü ancak bizedir. İşte o zaman yaptıklarını kendilerine haber veririz. Allah kalplerde olanı şüphesiz çok iyi bilir.",
                            "verse 31:24": "Onları biraz faydalandırır, sonra kendilerini ağır bir azaba sürükleriz.",
                            "verse 31:25": "Andolsun ki onlara, \"Gökleri ve yeri kim yarattı?\" diye sorsan, mutlaka \"Allah...\" derler. De ki: (Öyleyse) övgü de yalnız Allah'a mahsustur, ama onların çoğu bilmezler.",
                            "verse 31:26": "Göklerde ve yerde ne varsa, hepsi Allah'ındır. Bilinmeli ki, asıl ganî ve övülmeye lâyık olan Allah'tır.",
                            "verse 31:27": "Şayet yeryüzündeki ağaçlar kalem, deniz de arkasından yedi deniz katılarak (mürekkep olsa) yine Allah'ın sözleri (yazmakla) tükenmez. Şüphe yok ki Allah mutlak galip ve hikmet sahibidir.",
                            "verse 31:28": "(İnsanlar!) Sizin yaratılmanız ve diriltilmeniz, ancak tek bir kişinin yaratılması ve diriltilmesi gibidir. Unutulmasın ki, Allah her şeyi bilen ve görendir.",
                            "verse 31:29": "Bilmez misin ki Allah, geceyi gündüze ve gündüzü geceye katmaktadır. Güneşi ve ayı da buyruğu altına almıştır. Bunların her biri belli bir vâdeye kadar hareketine devam eder. Ve Allah, yaptıklarınızdan tamamen haberdardır.",
                            "verse 31:30": "Çünkü Allah, hakkın ta kendisidir; O'ndan başka taptıkları ise hiç şüphesiz bâtıldır. Gerçekten Allah çok yüce, çok uludur.",
                            "verse 31:31": "Size varlığının delillerini göstermesi için, Allah'ın lütfuyla gemilerin denizde yüzdüğünü görrmedin mi? Şüphesiz bunda, çok sabreden, çok şükreden herkes için ibretler vardır.",
                            "verse 31:32": "Dağlar gibi dalgalar onları kuşattığı zaman, dini tamamen Allah'a has kılarak (ihlâsla) O'na yalvarırlar. Allah onları karaya çıkararak kurtardığı vakit içlerinden bir kısmı orta yolu tutar. Zaten bizim âyetlerimizi, ancak nankör hâinler bilerek inkâr eder.",
                            "verse 31:33": "Ey İnsanlar! Rabbinize karşı gelmekten sakının. Ne babanın evlâdı, ne evlâdın babası nâmına bir şey ödeyemeyeceği günden çekinin. Bilin ki, Allah'ın verdiği söz gerçektir. Sakın dünya hayatı sizi aldatmasın ve şeytan, Allah'ın affına güvendirerek sizi kandırmasın.",
                            "verse 31:34": "Kıyamet vakti hakkındaki bilgi, ancak Allah'ın katındadır. Yağmuru O yağdırır, rahimlerde olanı O bilir. Hiç kimse yarın ne kazanacağını bilemez. Yine hiç kimse nerede öleceğini bilemez. Şüphesiz Allah, her şeyi bilendir, her şeyden haberdardır."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 31:1": "Алиф. Лам. Мийм.",
                            "verse 31:2": "Ушбулар ҳикматли Китоб оятларидир.",
                            "verse 31:3": "У муҳсинларга ҳидоят ва раҳматдир.",
                            "verse 31:4": "Намозни тўкис адо этадиган, закотни берадиган ва охиратга ишонч-ла иймон келтирадиганларга.",
                            "verse 31:5": "Ана ўшалар, Роббиларидан бўлган ҳидоятдадирлар. Ана ўшалар, ўзлари нажот топгувчилардир.",
                            "verse 31:6": "Одамлар орасида илмсиз равишда Аллоҳнинг йўлидан адаштириш учун ва у(йўл)ни истеҳзо қилиш учун беҳуда сўзни сотиб оладиган кимсалар ҳам бор. Ана ўшаларга ўзларига хорловчи азоб бордир. (Улар ҳикмат тўла Қуръони Каримни, Аллоҳнинг пурҳикмат сўзларини қабул қилмасдан, уларга бадалсиз тақдим этилаётган икки дунё саодатига элтувчи илоҳий дастурга бўйинсунмасдан, қандайдир беҳуда сўзларни кўтариб юрадилар. Ҳа, ўша беҳуда сўзлар эгаси бўлиш учун молу мулкни, ҳаётни, зеҳн-заковатни, бутун имкониятларни сарфлайдилар.)",
                            "verse 31:7": "Қачон унга Бизнинг оятларимиз тиловат қилинса, худди уларни эшитмагандек, худди қулоғида оғирлик бордек мутакаббирлик билан ортга қараб кетадир. Бас, унга аламли азобнинг башоратини бер.",
                            "verse 31:8": "Албатта, иймон келтириб, яхши амаллар қилганларга, ўшаларга неъмат жаннатлари бордир.",
                            "verse 31:9": "Улар унда абадий қолурлар. Аллоҳнинг ваъдаси ҳақдир. Ва У азиз ва ҳакимдир.",
                            "verse 31:10": "У, сиз кўриб турганингиздек, осмонларни устунсиз яратган, сизларни тебратмаслиги учун ер юзига оғир тоғларни ташлаган ва (ер)да ҳар турли жониворларни таратиб қўйган зотдир. Ва осмондан сув тушириб, у билан ун(ер юзи)да турли гўзал ва фойдали жуфтларни ўстириб қўйдик. (Оятда «ўсимликларни ўстириб қўйдик», дейилмасдан, «карамли (гўзал ва фойдали) жуфтларни ўстириб қўйдик», деб айтилмоқда. Бу ерда, аввало, ўсимликлардаги гўзаллик ва фойдага ишора қилиняпти, қолаверса, улар жуфт бўлиши ҳам билдириб қўйиляпти. Аллоҳнинг китобида ўн беш аср илгари зикр этилган бу ҳақиқатга илм яқиндагина етди. Ҳар бир ўсимликда эркак ва урғочи хўжайралар бўлиб, улар бир-бири билан чатишгандагина мева ҳосил бўлиши энди тушуниб етилди. Ўсимликларни бундай қилиб яратишга фақат Аллоҳ қодирдир.)",
                            "verse 31:11": "Бу Аллоҳнинг яратганидир. Қани менга кўрсатинг-чи, Ундан бошқалар нимани яратдилар. Йўқ! Золимлар очиқ-ойдин адашувдадирлар.",
                            "verse 31:12": "Батаҳқиқ, Биз Луқмонга: «Аллоҳга шукр қил. Ким шукр қилса, ўзи учун қиладир. Ким ношукрлик қилса, бас, албатта, Аллоҳ беҳожат ва мақталган зотдир», деб ҳикматни бердик. («Ҳикмат», аслида, ҳар бир нарсани яхшилаб ўз жойига қўйиш, деган маънони беради. Шу боисдан ҳам ҳар бир гапни тўғри сўзлаш ва ҳар бир ишни тўғри бажаришга «ҳикмат» дейилади. Аллоҳ таоло ҳазрати Луқмонга ана шундай неъматни ато қилганини ушбу оятда билдирмоқда. У кишининг исмларига »ҳаким« лақаби қўшилиб зикр қилиши сабаби ҳам шундан. Баъзи кишилар бу ҳикмат соҳиби бўлган зотни Пайғамбар деб ҳам айтишган. Аммо аксар уламоларимиз, жумладан, кўпгина тафсирчиларимиз, Ҳазрати Луқмон Пайғамбар эмас, ҳаким бўлган, дейдилар. Чунки Пайғамбарларнинг зикри келган Қуръон оятларида бу кишининг исмлари келмаган. Шунингдек, у кишининг Пайғамбар бўлганлари ҳақида Пайғамбаримиз Муҳаммад (с.а.в.) ҳам ҳеч бир хабар бермаганлар.)",
                            "verse 31:13": "Луқмон ўғлига ваъз-насиҳат қилиб айтганларини эсла: «Эй ўғилчам, Аллоҳга ширк келтирма. Албатта, ширк катта зулмдир».",
                            "verse 31:14": "Биз инсонга ота-онаси ҳақида тавсия қилдик: онаси уни заифлик устига заифлик билан кўтарди; уни сутдан ажратиш икки йил ичидадир: «Менга ва ота-онага шукр қилгин. Ва қайтиш фақат Менгадир».",
                            "verse 31:15": "Агар икковлари сени ўзинг билмаган нарсани Менга ширк келтиришга зўрласалар, бас, уларга итоат этма! Ва дунёда икковларига яхшилик қил ҳамда Менга йўналганларнинг йўлига эргаш. Сўнгра қайтишингиз фақат Менгадир. Бас, Мен сизга нима амал қилганингиз хабарини берурман.",
                            "verse 31:16": "«Эй ўғилчам, албатта, у(амал) агар ачитқининг бир дона уруғича бўлсаю у бир қоя тош ичида ёки осмонларда ёхуд ерда бўлса ҳам, Аллоҳ уни келтирур. Албатта, Аллоҳ ўта лутфли ва ўта хабардор зотдир.",
                            "verse 31:17": "Эй ўғилчам, намозни тўкис адо қил, яхшиликка буюриб, ёмонликдан қайтар ва ўзингга етган мусибатга сабр қил. Албатта, булар азм этилажак ишлардандир.",
                            "verse 31:18": "Одамлардан такаббурла юз ўгирма ва ер юзида кибр-ҳаво ила юрма. Албатта, Аллоҳ ҳеч бир мутакаббир ва мақтанчоқни севмас.",
                            "verse 31:19": "Юришингда мўътадил бўл ва овозингни пасайтир. Чунки овозларнинг энг ёмони эшакнинг овозидир». (Яъни, юришинг ўртача ва мақсадли бўлсин. Бекорчи сохта ҳаракатлар билан куч-қувватни исроф қилиб, кибру ҳаво билан ҳам юрма, жуда лапашанг бўлиб, судралма ҳам эшак бекордан-бекорга бор овози билан ҳанграб туради. Ҳеч бир сабабсиз баланд кўтарилган овознинг эшакникига ўхшатилишининг ўзи етарли. Оятда бу овоз энг ёмон эканлиги ҳам таъкидланмоқда.)",
                            "verse 31:20": "Аллоҳ сизларга осмонлардаги нарсаларни ва ердаги нарсаларни беминнат хизматкор қилиб қўйганини ва сизга зоҳирий ва ботиний неъматларни мукаммал қилиб берганини билмадингизми?! Одамлардан илмсиз, ҳидоятсиз ва ёритувчи китобсиз Аллоҳ ҳақида тортишадиганлари ҳам бор. (Баъзи одамлар ўзларида ҳақиқатни исбот қилувчи илм бўлмаса ҳам, Аллоҳ ҳақида тортишаверадилар. Тўғри йўлга бошловчи ҳидоятчилари бўлмаса ҳам, Аллоҳ хусусида баҳслашаверадилар. Турли бўлмағур фикрларни айтадилар. Унга куфр келтирадилар. Унга ширк келтирадилар.)",
                            "verse 31:21": "Қачон уларга: «Аллоҳ нозил қилган нарсага эргашинглар», дейилса: «Йўқ! Биз оталаримизни ниманинг устида топсак, ўшанга эргашамиз», дерлар. Агар шайтон уларни дўзах азобига чақираётган бўлса ҳам-а?!",
                            "verse 31:22": "Ким гўзал амалларни қилгувчи бўлган ҳолида Аллоҳга юз тутса, батаҳқиқ, у ишончли арқонни маҳкам тутибди. Ишларнинг оқибати фақат Аллоҳга қайтур. (Биз «ишончли арқон» деб таржима қилган маъно оятда «ал-урватул вусқо» деб келган. «Вусқо» ишончли дегани, «ал-урвату» деб эса, тоққа осилиб чиқиладиган арқонга айтилади. Демак, бу дунёда олий мақсадга эришиш баланд тоғ чўққисига чиқиш деб олинса, Ислом динини тутиш ўша чўққига чиқиш учун узилмайдиган, ишончли арқонни маҳкам тутишга ўхшар экан. Чўққига чиқмоқчи бўлган одам, энди арқондан кўнгли тўқ бўлаверсин. Бу ёғи ўзига боғлиқ, ҳаракат қилса, чўққига албатта чиқади. Шунинг учун аввал-бошдан унга иймон келтириб, у нозил қилган Қуръонга эргашавериш керак.)",
                            "verse 31:23": "Ким куфр келтирса, унинг куфри сени хафа қилмасин. Қайтишлари фақат Бизгадир. Бас, Биз уларга нима амал қилганлари хабарини берурмиз. Албатта, Аллоҳ қалблардаги нарсаларни ўта билгувчидир.",
                            "verse 31:24": "Уларни бир оз ҳузурлантирурмиз, сўнгра қаттиқ азобга мажбур қилурмиз.",
                            "verse 31:25": "Агар улардан: «Осмонлару ерни ким яратган?» деб сўрасанг, албатта, — «Аллоҳ», дерлар. Сен: «Аллоҳга ҳамд бўлсин», деб айт. Йўқ! Кўплари билмаслар.",
                            "verse 31:26": "Осмонлару ердаги нарсалар Аллоҳникидир. Албатта, Аллоҳ Ўзи беҳожат ва мақталган зотдир.",
                            "verse 31:27": "Агар ер юзидаги дарахтнинг барчаси қаламлар бўлиб, денгиз–уни ортида етти денгиз мадад бериб туриб (сиёҳ) бўлса ҳам, Аллоҳнинг калималари битмас. Албатта, Аллоҳ азиз ва ҳакимдир.",
                            "verse 31:28": "Сизларни яратиш ҳам, қайта тирилтириш ҳам фақат бир жон (яратиш ва қайта тирилтириш) кабидир. Албатта, Аллоҳ ўта эшитгувчи ва ўта кўргувчидир.",
                            "verse 31:29": "Аллоҳ кечани кундузга киритишини ва кундузни кечага киритишини, қуёш ва ойни беминнат хизматкор қилиб қўйганини, уларнинг ҳар бири белгиланган муддат томон юришини ва, албатта, Аллоҳ нима амал қилаётганингиздан хабардор эканини кўрмадингми?!",
                            "verse 31:30": "Бу, албатта, Аллоҳнинг Ўзи ҳақ, албатта, Ундан ўзга илтижо қилаётганлари ботил ва, албатта, Аллоҳнинг Ўзи энг юксак ва энг буюк зот эканидандир.",
                            "verse 31:31": "Кемалар Аллоҳнинг неъмати ила сизга Унинг оят-белгиларини кўрсатиш учун денгизда юрганини кўрмадингми?! Албатта, бунда ҳар бир ўта сабрли ва ўта шукрлилар учун оят-белгилар бордир.",
                            "verse 31:32": "Қачон уларни тоғ каби тўлқин ўраб қолса, Аллоҳнинг динига ихлос этароқ, дуо қилурлар. Нажот бериб, уларни қуруқликка чиқарса, баъзилари тежамкор бўлур. Бизнинг оятларимизни фақат ўта хоин ва ўта кофирларгина инкор этурлар. (Ўлим кўзига кўринган чоғда, минган кемаси қаттиқ довулга учраб, денгизда хасдек у ён-бу ён отилаётган бир пайтда ҳамма нарсани унутиб, ёлғиз Аллоҳнинг Ўзига ёлбориб илтижо қилишга тушади. Аллоҳдан бошқа нарса ёдига келмайди. Аллоҳга, Унинг динига ихлос қилиб қолади. Эсон-омон қутулиб олса, доимо Аллоҳга шукр этиб, ибодат қилиб юришга ваъдалар беради. Улар тўлқинга учраган пайтларида, бундан буён Аллоҳга иймон-эътиқодда бўлиб, ибодат қилиб юраман, деб ваъдалар берган эдилар, ўша ваъдаларига хиёнат қиладилар. Аллоҳнинг неъмати ила ўлимдан топган нажотларига ношукрлик қиладилар. Кемага минган ва довулда қолган пайтда кўрган оят-белгиларини инкор этадилар.)",
                            "verse 31:33": "Эй одамлар! Роббингизга тақво қилинг ва ота боласига фойда бера олмайдиган, бола отасига бирор нарсада фойда бергувчи бўлмайдиган кундан қўрқинг. Албатта, Аллоҳнинг ваъдаси ҳақдир. Бас, ҳаёти дунё сизни ғурурга кетказмасин. Ўта ғурурга кетказгувчи сизни Аллоҳ ила ғурурга кетказмасин. (Бу кун қиёмат кунидир. У кунда инсонлар орасидаги боғланишлар, алоқалар кесилади. Ҳар ким ўзи учун жавоб беради. Бировнинг бировга фойдаси тегмайди. Ҳатто, ота болага, бола отага фойда бера олмай қолади. У кунда бирдан-бир фойда берадиган нарса иймон ва яхши амал бўлади. Ана ўшандай кундан қўрқиш барча одамларнинг одамийлик бурчидир. Қиёмат кунидан қўрққан одамгина барча ёмонликлардан қайтади. Аксинча, қиёмат кунидан қўрқмайдиган одам ҳеч қандай ёмонликдан қайтмайди.)",
                            "verse 31:34": "Албатта, соат (қиёмат) илми ёлғиз Аллоҳнинг ҳузуридадир. Ёмғирни У ёғдирур. Бачадонлардаги нарсани ҳам У билур. Ҳеч бир жон эртага нима касб қилишини билмас. Ҳеч бир жон қайси ерда ўлишини ҳам билмас. Албатта, Аллоҳ ўта билгувчи ва ўта хабардордир. (Оятда Аллоҳ таолонинг илми шомилу комил ҳамда мутлақ экани, унинг илми қаршисида бошқа илмлар ҳеч нарсага арзимаслиги баён қилинмоқда.)"
                        }
                    }
                }
            }
        }
    }
}