{
    "id": 44,
    "name_simple": "Ad-Dukhan",
    "revelation_place": "makkah",
    "revelation_order": 64,
    "bismillah_pre": true,
    "verses_count": 59,
    "short_text": "The Surah takes its name from the word dukhan which occurs in verse 10.",
    "text": [
        "\n",
        "The Surah takes its name from the word dukhan which occurs in verse 10.",
        "\n",
        "Period of Revelation",
        "\n",
        "Its period of revelation also could not be determined from any authentic tradition, but the internal evidence of the subject matter shows that this Surah too was sent down in the same period in which Surah Zukhruf and a few other earlier Surahs had been revealed. However, this Surah was sent down somewhat later. Its historical background is this: When the disbelievers of Makkah became more and more antagonistic in their attitude and conduct, the Holy Prophet prayed: O God, help me with a famine like the famine of Joseph. He thought that when the people would be afflicted with a calamity, they would remember God, their hearts would soften and they would accept the admonition. Allah granted his prayer, and the whole land was overtaken by such a terrible famine that the people were sorely distressed. At last, some of the Quraish chiefs among whom Hadrat Abdullah bin Masud has particularly mentioned the name of Abu Sufyan came to the Holy Prophet and requested him to pray to Allah\r\nto deliver his people from the calamity. On this occasion Allah sent down this Surah.",
        "\n",
        "Subject Matter and Topics",
        "\n",
        "The introduction to the address revealed on this occasion for the admonition and warning of the people of Makkah contained some important points, which are as follows:",
        "\n",
        "\n\n\"You, O People of Makkah, are wrong in thinking that the Quran is being composed by Muhammad (upon whom be Allah's peace). This Book by itself bears the clear testimony that it is not the composition of a man but of Allah, Lord of the worlds.\"\n\n\n\"You are making a wrong estimate of the worth of this Book. You think it is a calamity that has descended on you, whereas the Hour when Allah, out of sheer mercy, decided to send His Messenger and His Book to you was highly blessed.\"\n\n\n\"You are foolishly involved in the misunderstanding that you will fight this Messenger and this Book and will win, whereas the fact is that the Messenger has been raised and the Book sent down in that particular Hour when Allah decides the destinies, and Allah's decisions are not so weak that they may be changed to a person's liking, nor are they based on ignorance and folly that there may be the likelihood of a mistake or error or weakness in them. They are rather the firm and unalterable decisions of the Ruler of the Universe, Who is All Hearing, All Knowing and All Wise. Therefore, they cannot be treated lightly.\n\n\n\"You yourselves acknowledge that Allah alone is the Master and Lord of the earth and heavens and of everything in the Universe and also admit that life and death are only in His power, yet you insist on making others your deities, for which the only argument you offer is that that had been the practice since the time of your forefathers, whereas if a person has the conviction that Allah alone is the Master, Sustainer and Giver of life and death, he can never entertain the doubt that there can be other gods also beside Him, who can be worthy of worship. If your forefathers had committed this folly, there is no reason why you also should continue committing it blindly. As a matter of fact, their Lord too was only One God, Who is your Lord, and they also should have worshiped only Him, Whom you should worship.\"\n\n\n\"The only demand of Allah's Providence and Mercifulness is not this that He should feed you, but also this that He should arrange guidance for you. For this very guidance He has sent His Messenger and His Book.\"\n\n",
        "\n",
        "After this introduction, the question of the famine that was raging in Makkah has been discussed. As already mentioned, this famine had occurred on the Holy Prophet's prayer, and he had prayed for it so that when the calamity befell it would break the stubbornness of the disbelievers and then they would listen to the rebuke. It looked as if this expectation was being fulfilled to some extent, for some of the most stubborn enemies of the Truth, on account of the severities of the famine, had cried out: \"O Lord, avert this torment from us and we will believe.\" At this, on the one hand, the Holy Prophet has been foretold :\"These people will not learn any lesson from such calamities. When they have turned away from the Messenger, whose life, character, works and speech clearly show that he is Allah's true Messenger, how will a mere famine help remove their disbelief?\" On the other, the unbelievers have been addressed, so as to say : \"You lie when you say that you will believe as\r\nsoon as the torment is removed from you. We shall just remove it to see how sincere you are in your promise. There is a graver disaster about to fall upon you. You need a much more crushing blow :minor misfortunes cannot set you right.\"",
        "\n",
        "In this very connection, a reference has been made a little below to Pharaoh and his people, implying that those people also had met with precisely the same trial as the chiefs of the disbelieving Quraish are now afflicted. To them also a similar noble and honorable Messenger had come; they also had seen those express pointers and signs which clearly showed that he had been appointed by Allah; they also had gone on witnessing one sign after the other but they did not give up their stubbornness, till at last they made up their mind to put an end to the Messenger's life, and they met their doom, which has since become an object lesson for the people for ever.",
        "\n",
        "After this the theme of the Hereafter has been taken up, which the disbelievers of Makkah vehemently denied. They said: \"We have never seen anyone rising back to life after death. Raise our forefathers back to life if you are true in your claim about the life hereafter.\" In response to this, two arguments for the Hereafter have been presented briefly (1) That the denial of this creed has always proved destructive for the morals; and (2) that the universe is not a plaything of a thoughtless deity, but it is a wise system and no work of wisdom is ever vain or useless. Then the disbelievers demand to bring their forefathers back to life has been answered, thus : \"This cannot be done every day to meet the demand of the individuals, but Allah has appointed a time when He will resurrect all mankind simultaneously and will subject them to accountability in His Court. If one has to protect oneself there, one should think about it here. For no one will be able to save himself there by\r\nhis own power, nor by the power of any one else.\"",
        "\n",
        "In connection with this Court of Allah, mention has been made of the fate of those who will be declared as culprits and of the rewards of those who will be declared as successful. The discourse has been concluded with this warning: \"This Quran has been revealed in simple language in your own tongue so that you may understand it; yet if you do not understand it and insist on seeing your evil end, you may wait; Our Prophet too is waiting. Whatever is to happen, will happen at its own appointed time.\"",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that mentions a divine portent of an evil destiny that will come in the appearance of something unknown called the Smoke. It manifests in the sky and enveils the unbelievers on the earth, until they cry in vain to God that they shall believe in the Quran and its Messenger of only He delivers them from this torment. It takes its name from the “smoke” (dukhān) mentioned in verse 10. The surah highlights the mercy that is the Quran, addresses the obduracy of the powerful and wealthy oppressors, and draws comparisons between the people of Pharaoh, Tubbaʾ, and the Meccans. The people of Paradise will enjoy heavenly bliss while those who were mighty in this world will suer the torments of Hell.The surah is also known as: Mist.",
    "name_translation": "Smoke",
    "name_complex": "Ad-Dukhân",
    "surah_name_ar": "الدخان",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 44:1": "Hâ, Mîm.",
                            "verse 44:2": "Pasha Librin e qartë!",
                            "verse 44:3": "Na, me të vërtetë, e kemi shpallur (Kur’anin) në natë të shenjtë, dhe Ne, me të vërtetë, jemi paralajmërues.",
                            "verse 44:4": "Në atë (natë) zgjidhet çdo punë e gjykueshme (e paluhatshme),",
                            "verse 44:5": "me urdhërin Tonë! Na, me të vërtetë, kemi dërguar pejgamberë,",
                            "verse 44:6": "mëshirë prej Zotit tënd, - me të vërtetë, Ai i dëgjon të gjitha dhe i di të gjitha,",
                            "verse 44:7": "Zotit të qiejve dhe të Tokës dhe çka gjendet në mes tyre, nëse besoni me këmbëngulje.",
                            "verse 44:8": "S’ka zot tjetër pos Atij. Jeta dhe vdekja janë vepër e Tij. Ai është Zoti juaj dhe Zoti i të parëve tuaj të lashtë!",
                            "verse 44:9": "Por, at dyshojnë dhe argëtohen,",
                            "verse 44:10": "andaj ti prite atë (ditë), kur nga qielli do të lëshohet tym i qartë,",
                            "verse 44:11": "që do t’i mbulojë njerëzit, (e u thuhet atyre): “Ky është dënimi i dhembshëm!”",
                            "verse 44:12": "(mohuesit) atëherë, do të thonë: “O Zoti ynë, lirona prej dënimit, na, me siguri do të besojmë!",
                            "verse 44:13": "E, prej nga ata do të marrin këshilla, e madje u pat ardhur atyre Pejgamberi (me argumente) të qarta?",
                            "verse 44:14": "E u shmangën prej tij dhe thanë: “(Ai është) i mësuar (prej tjetërkujt) – i çmendur (prej xhindëve)”.",
                            "verse 44:15": "Na, do t’i lirojmë ata nga dënimi pak (kohë), por ju, me siguri, do të ktheheni (në mohim)”.",
                            "verse 44:16": "(Kujtoju) ditën kur do t’i kapim ata, me një fuqi të madhe – Na, me të vërtetë, do t’i dënojmë.",
                            "verse 44:17": "Me të vërtetë, Na qysh më parë e kemi vënë në sprovë popullin e Faraonit, e atyre u pat ardhur pejgamberi fisnik.",
                            "verse 44:18": "(Duke u thënë): “Plotësoni ndaj meje atë që jeni të obliguar, o robërit e Perëndisë, sepse, unë jam për ju pejgamber i besuar;",
                            "verse 44:19": "dhe mos u madhëroni (mos u ngritni) mbi Perëndinë; unë, me të vërtetë, po ju sjell (prej Tij) dokument të qartë,",
                            "verse 44:20": "dhe unë mbështetem në Zotin tim dhe Zotin tuaj (për të më mbrojtur), që të mos më mbytni me gurë,",
                            "verse 44:21": "e, nëse nuk më besoni, atëherë (bile) largohuni prej meje!",
                            "verse 44:22": "(Nuk dëgjuan ata) dhe ai e thirri Zotin e tij: “Me të vërtetë, ky është popull mëkatarë!”",
                            "verse 44:23": "(Perëndia, atij i tha): “Ec me robërit e Mi natën, meqë do t’ju ndjekin,",
                            "verse 44:24": "dhe lëre ti detin e hapur, se ata, me të vërtetë, do të janë ushtri e fundosur”.",
                            "verse 44:25": "E, sa e sa kopshtije e burime i lanë ata,",
                            "verse 44:26": "ara të mbjella dhe pallate të mrekullueshme,",
                            "verse 44:27": "dhuntitë, në të cilat kënaqeshin,",
                            "verse 44:28": "(ajo ka qenë) kështu, dhe Ne u kemi dhënë trashëgim ato (dhuntitë e tyre) popullit tjetër –",
                            "verse 44:29": "Nuk i vajtoi ata as qielli as Toka, nuk u lanë ata (për t’u dënuar në një kohë tjetër),",
                            "verse 44:30": "e Na, me të vërtetë, i shpëtuam bijtë e Israelit nga dënimi poshtërues,",
                            "verse 44:31": "prej Faraonit, - ai ishte mendjemadh, njeri që për keq kalonte çdo kufi –",
                            "verse 44:32": "dhe, në të vërtetë, i kemi zgjedhur ata, duke i ditur (rrethanat e tyre) mbi popujt tjerë (të asaj kohe),",
                            "verse 44:33": "dhe u kemi dhënë argumente, në të cilat ka sprova të qarta.",
                            "verse 44:34": "E, këta (Kurejshit), në të vërtetë, thonin:",
                            "verse 44:35": "“Ekziston vetëm vdekja jonë e parë, na nuk do të ringjallemi (më);",
                            "verse 44:36": "na i sjellni pra (ringjallna) të parët tanë, nëse e thoni të vërtetën!”",
                            "verse 44:37": "A janë këta më të mirë apo populli i Tubbas, apo ata para tyre (Tubbas)? – Ata, Na i kemi shkatërruar, meqë, me të vërtetë, ishin popull mëkatarë.",
                            "verse 44:38": "Na, nuk i kemi krijuar qiejt dhe Tokën, as atë që gjendet në mes tyre, për t’u zbavitur (pa qëllim),",
                            "verse 44:39": "Na i kemi krijur ato me qëllim të plotë, por shumica e tyre nuk e dinë.",
                            "verse 44:40": "Me të vërtetë, Dita e dallimit (të së mirës nga e keqja), është e caktuar për të gjithë,",
                            "verse 44:41": "Dita kur i afërmi nuk mund t’i ndihmojë asgjë të afërmit, as që atyre do t’u ndihmojë kush,",
                            "verse 44:42": "pos ata që i ka mëshiruar Perëndia, sepse Ai, në të vërtetë, është i Plotëfuqishëm dhe Mëshirues.",
                            "verse 44:43": "Me të vërtetë, druri i Zekkumit (një lloj druri tepër i idhët)",
                            "verse 44:44": "do të jetë ushqim i mëkatarit,",
                            "verse 44:45": "në barkun e tyre vëlon sikur xehja e shkrirë,",
                            "verse 44:46": "ashtu si vëlon uji i nxehtë.",
                            "verse 44:47": "(engjëjve u thuhet): “Rrëmbejeni atë dhe shpieni në mes të xhehennemit,",
                            "verse 44:48": "e, pastaj, për dënim, hedhni mbi kokën e tyre ujë të vluar!”",
                            "verse 44:49": "(I thuhet atij): “Shijoje, (dënimin), meqë ti je, “i fuqishëm” dhe “fisnik” (me hamendjen tënde),",
                            "verse 44:50": "kjo është, me të vërtetë, ajo në të cilën keni dyshuar ju!”",
                            "verse 44:51": "E, ata që i druajnë Perëndisë, me të vërtetë, do të jenë në vend të sigurt,",
                            "verse 44:52": "në mes kopshtijeve dhe burimeve,",
                            "verse 44:53": "të veshur me petka (rroba) mëndafshi të hollë dhe të trashë, duke ndejtur të ulur njëri karshi tjetrit.",
                            "verse 44:54": "Kështu (do të jenë të shpërblyer), dhe Ne do t’i martojmë ata me hyri, sy bukur.",
                            "verse 44:55": "Aty do të kërkojnë çfarë pemësh dëshirojnë, e do të kënaqen (duke qenë të sigurt);",
                            "verse 44:56": "në to (xhennete), nuk do ta shijojnë vdekjen, pos vdekjes së parë (në këtë botë) dhe i ruan (Perëndia) prej dënimit të xhehennemit,",
                            "verse 44:57": "kjo do të jetë dhutni prej Zotit tënd. Ky, me të vërtetë, do të jetë sukses i madh!",
                            "verse 44:58": "Na, i kemi bërë të lehtë atë (Kur’anin për ta kuptuar) në gjuhën tënde, për t’u këshilluar ata,",
                            "verse 44:59": "andaj prit ti (të shohësh çka do të bëhet me ta), por edhe ata presin (çka do të bëhet me ty)!"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Ha, Mim!",
                            "verse 44:2": "(Haqqı batildən, halalı haramdan ayıran) açıq-aydın Kitaba and olsun ki,",
                            "verse 44:3": "Biz onu mübarək bir gecədə (qədr gecəsində) nazil etdik. Biz (o Kitab vəsitəsilə kafirləri ?z əzabımızla) qorxuduruq!",
                            "verse 44:4": "Hər bir hikmətli (dəyişilməsi mümkün olmayan) iş o gecə hökm (ayırd) olunur -",
                            "verse 44:5": "Dərgahımızdan bir buyuruq olaraq! Həqiqətən, (peyğəmbərləri) Biz göndəririk -",
                            "verse 44:6": "Sənin Rəbbindən (bəndələrə) bir mərhəmət olaraq (ya Peyğəmbər!). Şübhəsiz ki, O (hər şeyi) eşidəndir, (hər şeyi) biləndir!",
                            "verse 44:7": "O, göylərin, yerin və onların arasında olanların (bütün məxluqatın) Rəbbidir. (Ey Məkkə əhli!) Əgər (Allahın haqq olduğuna) tam yəqinliklə inanırsınızsa (bilin ki, Muhəmməd əleyhissəlam da Onun Peyğəmbəridir)!",
                            "verse 44:8": "Ondan başqa heç bir tanrı yoxdur. O həm dirildir, həm də öldürür. O həm sizin Rəbbiniz, həm də ulu babalarınızın Rəbbidir.",
                            "verse 44:9": "Lakin onlar (Məkkə müşrikləri) şəkk içində qalıb oyun oynayırlar (Allaha, qiyamətə ürəkdən inanmır, Qur'ana və Peyğəmbərə istehza edirlər).",
                            "verse 44:10": "(Ya Peyğəmbər!) Sən göyün aşkar bir dumana bürünəcəyi günü gözlə! (O gün müşriklərə elə bir aclıq üz verəcəkdir ki, gözləri qaranlıq gətirib yerlə göyün arasını, sanki bir duman bürüdüyünü görəcəklər!)",
                            "verse 44:11": "(Elə bir duman ki) insanları saracaqdır. Bu, şiddətli bir əzabdır! (Doğrudan da, Qüreyş müşriklərinə küfrləri üzündən belə bir aclıq üz vermiş, onlar çarəsizlikdən napak şeyləri belə yeməyə məcbur olmuşlar).",
                            "verse 44:12": "(Belə bir bəlaya uğrayan müşriklər deyəcəklər: ) \"Ey Rəbbimiz! Bizi bu əzabdan qurtar. Biz, həqiqətən iman gətirəcəyik!\" (Məkkə müşriklərinin bu yalvarışından sonra Peyğəmbər əleyhissəlam Allaha dua etmiş, Allah da onları həmin bəladan qurtarmışdı. Lakin müşriklərin çoxu öz sözünün üstündə durmamışdı).",
                            "verse 44:13": "Onlara hara, öyüd-nəsihət eşitmək hara?! Halbuki onlara açıq-aşkar bir peyğəmbər gəldi,",
                            "verse 44:14": "Onlar isə ondan üz çevirib belə dedilər: \"(Bu başqası tərəfindən) öyrədilmiş bir divanədir! (?zü heç bir şey bilmir, Qur'anı kimsə ona öyrədir)\".",
                            "verse 44:15": "Biz sizi bu əzabdan azacıq qurtaracağıq, siz isə (yenidən küfrə) qayıdacaqsınız!",
                            "verse 44:16": "Onları lap möhkəm yaxalayacağımız gün (qiyamət, yaxud Bədr vuruşu günü), şübhəsiz ki, Biz (onlardan) intiqam alacağıq!",
                            "verse 44:17": "And olsun ki, Biz onlardan əvvəl Fir'on qövmünü imtahana çəkmişdik. Onlara möhtərəm bir peyğəmbər (Musa) gəlmişdi.",
                            "verse 44:18": "(O demişdi: ) \"Allahın bəndələrini (İsrail oğullarını) mənə verin. Həqiqətən, mən sizin üçün mö'təbər (güvəniləsi, sözündə düz, əmanətə xəyanət etməyən) bir peyğəmbərəm!",
                            "verse 44:19": "Allaha qarşı təkəbbür göstərməyin. Həqiqətən, mən sizə (dediklərimin düzgünlüyünü sübut edən) açıq-aşkar bir dəlil gətirmişəm!\"",
                            "verse 44:20": "(Onlar Musanı daşqalaq edəcəkləri ilə hədələdilər. Musa dedi: ) \"Mən sizin məni daşqalaq etmənizdən mənim də Rəbbim, sizin də Rəbbiniz olan Allaha pənah aparıram!",
                            "verse 44:21": "Əgər mənə iman gətirməyəcəksinizsə, məndən uzaq olun!\"",
                            "verse 44:22": "Sonra (Musa) Rəbbinə belə dua etdi: \"Həqiqətən, bunlar günahkar bir qövmdür! (Pərvərdigara! Bunlara layiq olduqları cəzanı ver!)\"",
                            "verse 44:23": "(Allah buyurdu: ) \"Bəndələrimi (İsrail oğullarını) götürüb gecə ikən onlarla yola çıx. Siz (Fir'on və onun qövmü tərəfindən) tə'qib olunacaqsınız!",
                            "verse 44:24": "Dənizi də açıq (və sakit) burax! (Dəryanı - Nil çayını keçdikdən sonra əsanı suya vurub orada açılmış yolları bağlama. Qoy Fir'on və qoşunu dəryada yollar açıldığını görüb ora girsinlər). Onlar suya qərq olacaq əsgərlərdir!\"",
                            "verse 44:25": "(Fir'onun bütün ə'yan-əşrafı və əsgərləri boğulub tələf oldular). Onlar (özlərindən sonra) neçə-neçə bağlar, çeşmələr qoyub getdilər;",
                            "verse 44:26": "Neçə-neçə əkinlər, gözəl yerlər (möhtəşəm qəsrlər).",
                            "verse 44:27": "Və zövq aldıqları neçə-neçə ne'mətlər (tərk etdilər).",
                            "verse 44:28": "(Onları) belə (cəzalandırdıq) və ona (onların sərvətlərinə, mülklərinə) başqalarını (İsrail oğullarını) varis etdik!",
                            "verse 44:29": "Onlardan ötrü nə göy, nə də yer ağladı. Onlara (tövbə etməyə) imkan da verilmədi! (Əksinə, elə bu dünyada cəzalarına çatdılar; axirət əzabı isə daha şiddətli olacaqdır. Budur küfrün nəticəsi!)",
                            "verse 44:30": "İsrail oğularını isə o alçaldıcı əzabdan qurtardıq,",
                            "verse 44:31": "Fir'ondan (xilas etdik). Həqiqətən, o, təkəbbür göstərən, həddi aşanlardan idi!",
                            "verse 44:32": "And olsun ki, Biz onları (İsrail övladını) ?zümüz bilə-bilə aləmlərdən (bir hikməti-ilahi ilə zəmanələrindəki bəşər əhlindən) üstün tutduq.",
                            "verse 44:33": "Onlara (özlərini necə aparacaqlarını bilmək üçün) hər biri açıq-aşkar bir imtahan olan mö'cüzələr (dənizin yarılması, bildirçin əti, qüdrət halvası və s.) verdik.",
                            "verse 44:34": "(Ya Peyğəmbər!) Bunlar (sənin qövmünün müşrikləri) mütləq deyəcəklər:",
                            "verse 44:35": "\"Bu (ölüm) elə bizim ilk (və son) ölümümüzdür ki var. Biz bir daha dirildiləcək deyilik!",
                            "verse 44:36": "Əgər (öləndən sonra Allahın bizi dirildəcəyini) doğru deyirsinizsə, (bizdən qabaq ölmüş) atalarımızı (dirildib) gətirin görək!\"",
                            "verse 44:37": "(Ya Peyğəmbər!) Bunlar (Məkkə müşrikləri) yaxşıdır (qüvvətlidir), yoxsa (Yəmən padşahlarından Tövrata inanan Əbu Kərb Əs'ədin) Tübbə' qövmü, yaxud onlardan əvvəlkilər?! (Ad, Səmud, Mədyən və Əykə tayfaları?!) Günah işlədikləri üçün Biz onları məhv etdik.",
                            "verse 44:38": "Biz göyləri, yeri və onların arasında olanları oyun-oyuncaq (əyləncə) yaratmadıq!",
                            "verse 44:39": "Biz onları yalnız haqq olaraq yaratdıq, lakin onların (Məkkə müşriklərinin) əksəriyyəti (bunu) bilməz!",
                            "verse 44:40": "Şübhəsiz ki, (haqqı batildən, yaxşını yamandan, mö'mini kafirdən) ayırd etmə günü onların hamısının (bir yerdə olma) vaxtıdır!",
                            "verse 44:41": "O gün dostun dosta heç bir faydası olmaz, onlara kömək də edilməz! (Heç kəs heç kəsdən Allahın əzabını dəf edə bilməz!)",
                            "verse 44:42": "Allahın rəhm etdiyi kimsədən başqa! Şübhəsiz ki, O, yenilməz qüvvət, mərhəmət sahibidir!",
                            "verse 44:43": "Həqiqətən, (Cəhənnəmdəki) zəqqum ağacı",
                            "verse 44:44": "Günahkar (kafir) kimsənin yeməyidir!",
                            "verse 44:45": "O, ərinmiş mis (yağ) kimi qarınlarda qaynar;",
                            "verse 44:46": "Qaynar su qaynayan kimi!",
                            "verse 44:47": "(Allah əzab mələklərinə buyurar: ) \"Onu tutub Cəhənnəmin tən ortasına sürüyün!",
                            "verse 44:48": "Sonra başına əzab olaraq qaynar su tökün!",
                            "verse 44:49": "(Və ona belə deyin: ) \"(Bu əzabı) bir dad görək! Sən ki (öz aləmində) çox qüvvətli, möhtərəm bir şəxs idin!\"",
                            "verse 44:50": "Bu, (dünyada ikən) şəkk etdiyiniz (əzabdır)!",
                            "verse 44:51": "Müttəqilər isə qorxusuz-xətərsiz bir yerdə -",
                            "verse 44:52": "Bağçalarda və bulaqlar başında olacaqlar!",
                            "verse 44:53": "Taftadan və atlazdan (nazik və qalın ipdən) libaslar geyib qarşı-qarşıya əyləşəcəklər.",
                            "verse 44:54": "(Mö'minlərin Cənnətdəki əhvalı) belədir. Hələ onları iri (ahu) gözlü hurilərlə evləndirəcəyik.",
                            "verse 44:55": "Onlar orada (cənnət ne'mətlərinin tükənməzliyinə) arxayın olaraq hər meyvədən istəyəcəklər.",
                            "verse 44:56": "Onlar orada ilk (dünyadakı) ölümdən başqa heç bir ölüm dadmayacaqlar! (Allah) onları cəhənnəm əzabından qorumuşdur -",
                            "verse 44:57": "Sənin Rəbbindən bir lütf olaraq (ya Peyğəmbər!) Bu, böyük qurtuluşdur (uğurdur)!",
                            "verse 44:58": "Biz onu (Qur'anı ümmətin üçün) ancaq sənin dilinlə asanlaşdırdıq. Bəlkə, anlayıb öyüd-nəsihət qəbul edələr!",
                            "verse 44:59": "(Ya Peyğəmbər!) Sən (müşriklərin ölümünü, məğlubiyyətini) gözlə. Şübhəsiz ki, onlar da (sənin ölümünü, məğlubiyyətini) gözləyirlər!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Ha Mim.",
                            "verse 44:2": "Tako Mi Knjige jasne,",
                            "verse 44:3": "Mi smo počeli da je u Blagoslovljenoj noći objavljujemo - i Mi, doista, opominjemo -",
                            "verse 44:4": "u kojoj se svaki mudri posao riješi",
                            "verse 44:5": "po zapovijedi Našoj! Mi smo, zaista, slali poslanike",
                            "verse 44:6": "kao milost Gospodara tvoga - On, uistinu, sve čuje i sve zna,",
                            "verse 44:7": "Gospodara nebesa i Zemlje i onoga što je između njih - ako čvrsto vjerujete,",
                            "verse 44:8": "drugog boga osim Njega nema; On život i smrt daje, Gospodara vašeg i Gospodara vaših predaka davnih!",
                            "verse 44:9": "Ali ovi sumnjaju i zabavljaju se,",
                            "verse 44:10": "zato sačekaj dan kad će im se činiti da prema nebu vide vidljiv dim",
                            "verse 44:11": "koji će ljude prekriti. \"Ovo je neizdržljiva patnja!",
                            "verse 44:12": "Gospodaru naš, otkloni patnju od nas, mi ćemo, sigurno, vjerovati!\"",
                            "verse 44:13": "A kako će oni pouku primiti, a već im je došao istiniti Poslanik",
                            "verse 44:14": "od koga oni glave okreću i govore: \"Poučeni - umno poremećeni!\"",
                            "verse 44:15": "Mi ćemo patnju malo-pomalo otklanjati i vi ćete se, sigurno, u mnogobožačku vjeru vratiti;",
                            "verse 44:16": "ali onog Dana kada ih svom silom zgrabimo, zbilja ćemo ih kazniti.",
                            "verse 44:17": "Još davno prije njih Mi smo faraonov narod u iskušenje stavili, kada im je bio došao plemeniti poslanik:",
                            "verse 44:18": "Ispunite prema meni ono što ste dužni, o Allahovi robovi, jer ja sam vam poslanik pouzdani,",
                            "verse 44:19": "i ne uzdižite se iznad Allaha, ja vam donosim dokaz očevidni,",
                            "verse 44:20": "i ja se utječem i svome i vašem Gospodaru da me ne kamenujete,",
                            "verse 44:21": "a ako mi ne vjerujete, onda me na miru ostavite!\"",
                            "verse 44:22": "I on pozva u pomoć Gospodara svoga: \"Ovo je, doista, narod nevjernički!\" -",
                            "verse 44:23": "Izvedi noću robove Moje, za vama će potjera poći",
                            "verse 44:24": "i ostavi more nek miruje, oni su vojska koja će, zaista, potopljena biti.\"",
                            "verse 44:25": "I koliko ostaviše bašča i izvora,",
                            "verse 44:26": "i njiva zasijanih i dvorova divnih,",
                            "verse 44:27": "i zadovoljstava koja su u radosti provodili! -",
                            "verse 44:28": "Tako to bî, i Mi smo to u nasljedstvo drugima ostavili -",
                            "verse 44:29": "ni nebo ih ni Zemlja nisu oplakivali, i nisu pošteđeni bili,",
                            "verse 44:30": "a sinove Israilove smo ponižavajuće patnje spasili",
                            "verse 44:31": "od faraona - on je bio gord, jedan od onih koji su u zlu svaku mjeru prevršili -",
                            "verse 44:32": "i znajući kakvi su, između savremenika smo ih odabrali,",
                            "verse 44:33": "i neka znamenja puna očite blagosti smo im dali",
                            "verse 44:34": "A ovi, doista, govore:",
                            "verse 44:35": "Postoji samo naša prva smrt, mi nećemo biti oživljeni;",
                            "verse 44:36": "pretke naše nam dovedite, ako je istina to što govorite!\"",
                            "verse 44:37": "Da li su silniji oni ili narod Tubba’ i oni prije njega? - njih smo uništili jer su nevjernici bili.",
                            "verse 44:38": "Mi nismo stvorili nebesa i Zemlju i ono što je između njih da bismo se igrali.",
                            "verse 44:39": "Mi smi ih stvorili sa ciljem, ali većina ovih ne zna.",
                            "verse 44:40": "Dan sudnji će svima njima rok određeni biti,",
                            "verse 44:41": "Dan kada bližnji neće nimalo od koristi bližnjem biti i kada sami sebi neće moći pomoći,",
                            "verse 44:42": "moći će samo oni kojima se Allah smiluje, jer - On je, uistinu, silan i milostiv.",
                            "verse 44:43": "Drvo Zekkum",
                            "verse 44:44": "biće hrana grješniku,",
                            "verse 44:45": "u trbuhu će kao rastopljena kovina vreti,",
                            "verse 44:46": "kao što voda kada ključa vri.",
                            "verse 44:47": "Ščepajte ga i usred ognja odvucite,",
                            "verse 44:48": "a zatim mu, za kaznu, na glavu ključavu vodu izljevajte!\"",
                            "verse 44:49": "Okušaj, ta ti si, uistinu, ’moćni’ i ’poštovani’,",
                            "verse 44:50": "ovo je, zaista, ono u što ste sumnjali!\"",
                            "verse 44:51": "A oni koji su se Allaha bojali, oni će na sigurnu mjestu biti,",
                            "verse 44:52": "usred bašči i izvora,",
                            "verse 44:53": "u dibu i kadifu obučeni i jedni prema drugima.",
                            "verse 44:54": "Eto, tako će biti i Mi ćemo ih hurijama, krupnih očiju, ženiti.",
                            "verse 44:55": "U njima će moći bezbjedno koju hoće vrstu voća tražiti;",
                            "verse 44:56": "u njima, poslije one prve smrti, smrt više neće okusiti i On će ih patnje u ognju sačuvati,",
                            "verse 44:57": "blagodat će to od Gospodara tvoga biti; to će, zaista, biti uspjeh veliki!",
                            "verse 44:58": "A Kur’an smo učinili lahkim, na jeziku tvome, da bi oni pouku primili,",
                            "verse 44:59": "zato čekaj, i oni će čekati!"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "হা-মীম।",
                            "verse 44:2": "শপথ সুস্পষ্ট কিতাবের।",
                            "verse 44:3": "আমি একে নাযিল করেছি। এক বরকতময় রাতে, নিশ্চয় আমি সতর্ককারী।",
                            "verse 44:4": "এ রাতে প্রত্যেক প্রজ্ঞাপূর্ণ বিষয় স্থিরীকৃত হয়।",
                            "verse 44:5": "আমার পক্ষ থেকে আদেশক্রমে, আমিই প্রেরণকারী।",
                            "verse 44:6": "আপনার পালনকর্তার পক্ষ থেকে রহমতস্বরূপ। তিনি সর্বশ্রোতা, সর্বজ্ঞ।",
                            "verse 44:7": "যদি তোমাদের বিশ্বাস থাকে দেখতে পাবে। তিনি নভোমন্ডল, ভূমন্ডল ও এতদুভয়ের মধ্যেবর্তী সবকিছুর পালনকর্তা।",
                            "verse 44:8": "তিনি ব্যতীত কোন উপাস্য নেই। তিনি জীবন দান করেন ও মৃত্যু দেন। তিনি তোমাদের পালনকর্তা এবং তোমাদের পূর্ববর্তী পিতৃ-পুরুষদেরও পালনকর্তা।",
                            "verse 44:9": "এতদসত্ত্বেও এরা সন্দেহে পতিত হয়ে ক্রীড়া-কৌতুক করছে।",
                            "verse 44:10": "অতএব আপনি সেই দিনের অপেক্ষা করুন, যখন আকাশ ধূয়ায় ছেয়ে যাবে।",
                            "verse 44:11": "যা মানুষকে ঘিরে ফেলবে। এটা যন্ত্রণাদায়ক শাস্তি।",
                            "verse 44:12": "হে আমাদের পালনকর্তা আমাদের উপর থেকে শাস্তি প্রত্যাহার করুন, আমরা বিশ্বাস স্থাপন করছি।",
                            "verse 44:13": "তারা কি করে বুঝবে, অথচ তাদের কাছে এসেছিলেন স্পষ্ট বর্ণনাকারী রসূল।",
                            "verse 44:14": "অতঃপর তারা তাকে পৃষ্ঠপ্রদর্শন করে এবং বলে, সে তো উম্মাদ-শিখানো কথা বলে।",
                            "verse 44:15": "আমি তোমাদের উপর থেকে আযাব কিছুটা প্রত্যাহার করব, কিন্তু তোমরা পুনরায় পুনর্বস্থায় ফিরে যাবে।",
                            "verse 44:16": "যেদিন আমি প্রবলভাবে ধৃত করব, সেদিন পুরোপুরি প্রতিশোধ গ্রহণ করবই।",
                            "verse 44:17": "তাদের পূর্বে আমি ফেরাউনের সম্প্রদায়কে পরীক্ষা করেছি এবং তাদের কাছে আগমন করেছেন একজন সম্মানিত রসূল,",
                            "verse 44:18": "এই মর্মে যে, আল্লাহর বান্দাদেরকে আমার কাছে অর্পণ কর। আমি তোমাদের জন্য প্রেরীত বিশ্বস্ত রসূল।",
                            "verse 44:19": "আর তোমরা আল্লাহর বিরুদ্ধে ঔদ্ধত্য প্রকাশ করো না। আমি তোমাদের কাছে প্রকাশ্য প্রমাণ উপস্থিত করছি।",
                            "verse 44:20": "তোমরা যাতে আমাকে প্রস্তরবর্ষণে হত্যা না কর, তজ্জন্যে আমি আমার পালনকর্তা ও তোমাদের পালনকর্তার শরনাপন্ন হয়েছি।",
                            "verse 44:21": "তোমরা যদি আমার প্রতি বিশ্বাস স্থাপন না কর, তবে আমার কাছ থেকে দূরে থাক।",
                            "verse 44:22": "অতঃপর সে তার পালনকর্তার কাছে দোয়া করল যে, এরা অপরাধী সম্প্রদায়।",
                            "verse 44:23": "তাহলে তুমি আমার বান্দাদেরকে নিয়ে রাত্রিবেলায় বের হয়ে পড়। নিশ্চয় তোমাদের পশ্চাদ্ধবন করা হবে।",
                            "verse 44:24": "এবং সমুদ্রকে অচল থাকতে দাও। নিশ্চয় ওরা নিমজ্জত বাহিনী।",
                            "verse 44:25": "তারা ছেড়ে গিয়েছিল কত উদ্যান ও প্রস্রবন,",
                            "verse 44:26": "কত শস্যক্ষেত্র ও সূরম্য স্থান।",
                            "verse 44:27": "কত সুখের উপকরণ, যাতে তারা খোশগল্প করত।",
                            "verse 44:28": "এমনিই হয়েছিল এবং আমি ওগুলোর মালিক করেছিলাম ভিন্ন সম্প্রদায়কে।",
                            "verse 44:29": "তাদের জন্যে ক্রন্দন করেনি আকাশ ও পৃথিবী এবং তারা অবকাশও পায়নি।",
                            "verse 44:30": "আমি বনী-ইসরাঈলকে অপমানজনক শাস্তি থেকে উদ্ধার করছি।",
                            "verse 44:31": "ফেরাউন সে ছিল সীমালংঘনকারীদের মধ্যে শীর্ষস্থানীয়।",
                            "verse 44:32": "আমি জেনেশুনে তাদেরকে বিশ্ববাসীদের উপর শ্রেষ্ঠত্ব দিয়েছিলাম।",
                            "verse 44:33": "এবং আমি তাদেরকে এমন নিদর্শনাবলী দিয়েছিলাম যাতে ছিল স্পষ্ট সাহায্য।",
                            "verse 44:34": "কাফেররা বলেই থাকে,",
                            "verse 44:35": "প্রথম মৃত্যুর মাধ্যমেই আমাদের সবকিছুর অবসান হবে এবং আমরা পুনরুত্থিত হব না।",
                            "verse 44:36": "তোমরা যদি সত্যবাদী হও, তবে আমাদের পূর্বপুরুষদেরকে নিয়ে এস।",
                            "verse 44:37": "ওরা শ্রেষ্ঠ, না তুব্বার সম্প্রদায় ও তাদের পূর্ববর্তীরা? আমি ওদেরকে ধ্বংস করে দিয়েছি। ওরা ছিল অপরাধী।",
                            "verse 44:38": "আমি নভোমন্ডল, ভূমন্ডল ও এতদুভয়ের মধ্যবর্তী সবকিছু ক্রীড়াচ্ছলে সৃষ্টি করিনি।",
                            "verse 44:39": "আমি এগুলো যথাযথ উদ্দেশ্যে সৃষ্টি করেছি; কিন্তু তাদের অধিকাংশই বোঝে না।",
                            "verse 44:40": "নিশ্চয় ফয়সালার দিন তাদের সবারই নির্ধারিত সময়।",
                            "verse 44:41": "যেদিন কোন বন্ধুই কোন বন্ধুর উপকারে আসবে না এবং তারা সাহায্যপ্রাপ্তও হবে না।",
                            "verse 44:42": "তবে আল্লাহ যার প্রতি দয়া করেন, তার কথা ভিন্ন। নিশ্চয় তিনি পরাক্রমশালী দয়াময়।",
                            "verse 44:43": "নিশ্চয় যাক্কুম বৃক্ষ",
                            "verse 44:44": "পাপীর খাদ্য হবে;",
                            "verse 44:45": "গলিত তাম্রের মত পেটে ফুটতে থাকবে।",
                            "verse 44:46": "যেমন ফুটে পানি।",
                            "verse 44:47": "একে ধর এবং টেনে নিয়ে যাও জাহান্নামের মধ্যস্থলে,",
                            "verse 44:48": "অতঃপর তার মাথার উপর ফুটন্ত পানির আযাব ঢেলে দাও,",
                            "verse 44:49": "স্বাদ গ্রহণ কর, তুমি তো সম্মানিত, সম্ভ্রান্ত।",
                            "verse 44:50": "এ সম্পর্কে তোমরা সন্দেহে পতিত ছিলে।",
                            "verse 44:51": "নিশ্চয় খোদাভীরুরা নিরাপদ স্থানে থাকবে-",
                            "verse 44:52": "উদ্যানরাজি ও নির্ঝরিণীসমূহে।",
                            "verse 44:53": "তারা পরিধান করবে চিকন ও পুরু রেশমীবস্ত্র, মুখোমুখি হয়ে বসবে।",
                            "verse 44:54": "এরূপই হবে এবং আমি তাদেরকে আনতলোচনা স্ত্রী দেব।",
                            "verse 44:55": "তারা সেখানে শান্ত মনে বিভিন্ন ফল-মূল আনতে বলবে।",
                            "verse 44:56": "তারা সেখানে মৃত্যু আস্বাদন করবে না, প্রথম মৃত্যু ব্যতীত এবং আপনার পালনকর্তা তাদেরকে জাহান্নামের আযাব থেকে রক্ষা করবেন।",
                            "verse 44:57": "আপনার পালনকর্তার কৃপায় এটাই মহা সাফল্য।",
                            "verse 44:58": "আমি আপনার ভাষায় কোরআনকে সহজ করে দিয়েছি, যাতে তারা স্মরণ রাখে।",
                            "verse 44:59": "অতএব, আপনি অপেক্ষা করুন, তারাও অপেক্ষা করছে।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 44:1": "Ха. Мим.",
                            "verse 44:2": "Кълна се в ясната Книга.",
                            "verse 44:3": "Низпослахме я Ние в благословена нощ. Ние предупреждаваме.",
                            "verse 44:4": "През нея се решава всяко мъдро дело",
                            "verse 44:5": "по заповед от Нас. Ние пращаме",
                            "verse 44:6": "милост от твоя Господ. Той е Всечуващия, Всезнаещия -",
                            "verse 44:7": "Господът на небесата и на земята, и на всичко между тях, ако сте убедени.",
                            "verse 44:8": "Няма друг Бог освен Него. Той съживява и Той умъртвява - вашият Господ и Господът на древните ви предци.",
                            "verse 44:9": "Но те в съмнение се забавляват.",
                            "verse 44:10": "Изчакай Деня, в който небето ще донесе явен дим!",
                            "verse 44:11": "Той ще обгърне хората. Това е болезнено мъчение.",
                            "verse 44:12": "[Неверниците ще кажат:] Господи наш, премахни от Нас мъчението! Ние вече вярваме.",
                            "verse 44:13": "Как ще са се поучили, когато при тях дойде явен Пратеник,",
                            "verse 44:14": "а те се отметнаха от него и рекоха: Той е подучен, луд.",
                            "verse 44:15": "Ние ще отмахнем за малко мъчението, но пак ще се върнете.",
                            "verse 44:16": "В този Ден най-силно ще ги сграбчим. Ние отмъщаваме.",
                            "verse 44:17": "Преди тях изпитахме народа на Фараона, когато при тях дойде достоен пратеник:",
                            "verse 44:18": "Предайте на мен рабите на Аллах! Аз съм ваш доверен пратеник.",
                            "verse 44:19": "И не се възгордявайте пред Аллах! Донесох ви явен довод.",
                            "verse 44:20": "И опазил ме моят Господ и вашият Господ, да не ме пребиете с камъни!",
                            "verse 44:21": "А ако не ми вярвате, оставете ме!",
                            "verse 44:22": "И позова той своя Господ: Тези хора са престъпници.",
                            "verse 44:23": "[Аллах каза:] Върви с Моите раби нощем! Вас ще ви преследват.",
                            "verse 44:24": "И остави морето разцепено! Те са войници, които ще бъдат издавени.",
                            "verse 44:25": "Колко градини и извори оставиха те,",
                            "verse 44:26": "и ниви, и прекрасни места,",
                            "verse 44:27": "и блаженство, на което се наслаждаваха!",
                            "verse 44:28": "И така оставихме това в наследство на друг народ.",
                            "verse 44:29": "И не ги оплака нито небето, нито земята. И не им бе дадена отсрочка.",
                            "verse 44:30": "И спасихме синовете на Исраил от унизителното мъчение,",
                            "verse 44:31": "от Фараона. Той бе горделивец от престъпващите.",
                            "verse 44:32": "И ги избрахме - знаейки - да превъзхождат те народите [по тяхно време].",
                            "verse 44:33": "И им дадохме от знаменията онова, в което имаше явно изпитание.",
                            "verse 44:34": "Те [- неверниците] казват:",
                            "verse 44:35": "Смъртта е само веднъж. И не ще бъдем възкресени.",
                            "verse 44:36": "Доведете нашите предци, ако говорите истината!",
                            "verse 44:37": "Те ли са по-добри, или народът на Туббаа и онези преди тях? Погубихме ги, защото бяха престъпници.",
                            "verse 44:38": "И не сътворихме напразно небесата и земята, и всичко между тях.",
                            "verse 44:39": "Сътворихме ги само с мъдрост. Ала повечето от тях не знаят.",
                            "verse 44:40": "Денят на разделението е срокът за всички тях.",
                            "verse 44:41": "Денят, в който близък не ще избави близък с нищо. И не ще им се помогне,",
                            "verse 44:42": "освен когото Аллах пощади. Той е Всемогъщия, Милосърдния.",
                            "verse 44:43": "Дървото Зокум",
                            "verse 44:44": "е храната на всеки грешник.",
                            "verse 44:45": "Подобно разтопен метал тя ще кипи в стомасите,",
                            "verse 44:46": "сякаш кипи вряща вода.",
                            "verse 44:47": "Вземете го и го замъкнете в средата на Ада!",
                            "verse 44:48": "После излейте върху главата му от мъчението на врящата вода:",
                            "verse 44:49": "Вкуси! Нали ти бе могъщият, знатният.",
                            "verse 44:50": "Това е, в което се съмнявахте.",
                            "verse 44:51": "Богобоязливите ще са на сигурно място -",
                            "verse 44:52": "сред градини и извори,",
                            "verse 44:53": "ще са облечени в коприна и брокат, един срещу друг.",
                            "verse 44:54": "Така! И ще им дадем за съпруги красавици с големи очи.",
                            "verse 44:55": "Ще пожелават там всякъкъв плод - в сигурност.",
                            "verse 44:56": "Не ще са вкусили там друга освен първата смърт [в земния им живот]. Ще ги опази Той от мъчението на Ада -",
                            "verse 44:57": "благодат от твоя Господ. Това е великото спасение.",
                            "verse 44:58": "Сторихме го [Корана] лесен - на твоя език, за да се поучат.",
                            "verse 44:59": "И чакай! Те също очакват."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "哈一，米目。",
                            "verse 44:2": "以明確的經典盟誓，",
                            "verse 44:3": "在一個吉祥的夜間，我確已降示它，我確是警告者。",
                            "verse 44:4": "在那夜裡，一切睿智的事，都被判定，",
                            "verse 44:5": "那是按照從我那裡發出的命令的。我確是派遣使者的。",
                            "verse 44:6": "那是由於從你的主發出的恩惠。他確是全聰的，確是全知的。",
                            "verse 44:7": "他是天地萬物之主，如果你們是堅信者。",
                            "verse 44:8": "除他外，絕無應受崇拜的。他能使死者生，能使生者死，他是你們的主，也是你們祖先的主。",
                            "verse 44:9": "不然，他們是在疑惑中的，是游戲的。",
                            "verse 44:10": "你應當等待煙霧漫天的日子，",
                            "verse 44:11": "那煙霧將籠罩世人，他們說：「這是一種痛苦的刑罰。",
                            "verse 44:12": "我們的主啊！求你為我們解除這種刑罰，我們確是信道的。」",
                            "verse 44:13": "他們怎能覺悟呢？顯赫的使者，確已來臨他們，",
                            "verse 44:14": "而他們卻鄙棄他。他們說：「他是受教的，是瘋狂的。」",
                            "verse 44:15": "我必定要暫時解除這種刑罰，你們必定復返於悖逆。",
                            "verse 44:16": "我進行最大的襲擊之日，我必定要懲罰他們。",
                            "verse 44:17": "在他們之前，我確已考驗了法老的百姓。有一個高貴的使者來臨他們，",
                            "verse 44:18": "說：「你們把真主的僕人們交給我吧！我確是一個忠實的使者，奉命來教化你們的。",
                            "verse 44:19": "你們不要對真主高傲。我必定要昭示你們一個明証。",
                            "verse 44:20": "我確已求庇於我的主和你們的主，免遭你們的謀害。",
                            "verse 44:21": "如果你們不歸信我，那末，你們放任我吧！」",
                            "verse 44:22": "他就祈禱他的主說：「這等人，確是犯罪的民眾。」",
                            "verse 44:23": "（主說）：「你帶著我的眾僕在夜間出走吧！你們必定要被追趕。",
                            "verse 44:24": "你讓海水保持平靜，他們必定是被淹死的軍隊。」",
                            "verse 44:25": "他們曾拋下若干園圃和泉源，",
                            "verse 44:26": "莊稼和美宅，",
                            "verse 44:27": "以及他們所享受的福澤！",
                            "verse 44:28": "結局是這樣的：我曾使別的民眾繼承他們，",
                            "verse 44:29": "天地沒有哭他們，他們也沒有獲得緩刑。",
                            "verse 44:30": "我確已使以色列的後裔擺脫了凌辱的刑罰——",
                            "verse 44:31": "法老的刑罰。他確是高傲的，確是過份的。",
                            "verse 44:32": "我確已本真知而選拔他們，使他們超越各民族，",
                            "verse 44:33": "我賞賜他們許多蹟象，都是有明顯的試驗的。",
                            "verse 44:34": "這等人必定要說：",
                            "verse 44:35": "「我們只有初次的死亡，我們不會復活。",
                            "verse 44:36": "你們把我們的祖先召喚回來吧，如果你們是說實話的。」",
                            "verse 44:37": "他們是更高貴的呢？還是圖白的宗族是更高貴呢？在他們之前的許多民族，我已加以毀滅了；因為他們確是犯罪者。",
                            "verse 44:38": "我沒有以游戲的態度創造天地萬物，",
                            "verse 44:39": "我只本真理而創造之，但他們大半不知道。",
                            "verse 44:40": "甄別日，確是為他們全體預定的日期。",
                            "verse 44:41": "在那日，朋友對於朋友，毫無裨益，他們也不蒙援助；",
                            "verse 44:42": "惟真主所憐恤者則不然。他確是萬能的，確是至慈的。",
                            "verse 44:43": "欑楛木的果實，",
                            "verse 44:44": "確是罪人的食品，",
                            "verse 44:45": "像油腳樣在他們的腹中沸騰，",
                            "verse 44:46": "像開水一樣地沸騰�",
                            "verse 44:47": "（主說）「你們捉住他，然後，把他拖入火獄中，",
                            "verse 44:48": "然後，再把沸水的刑罰傾注在他的頭上！」",
                            "verse 44:49": "「你嘗試吧！你確是顯赫的，確是尊貴的！",
                            "verse 44:50": "這（刑罰）確是你們生前所懷疑的。」",
                            "verse 44:51": "敬畏者必定要住在安全的地方——",
                            "verse 44:52": "住在樂園之中，住在泉源之濱，",
                            "verse 44:53": "穿著綾羅綢緞，相向而坐。",
                            "verse 44:54": "結局是這樣的：我將以白皙的、美目的女子，做他們的伴侶。",
                            "verse 44:55": "他們在樂園中，將安全地索取各種水果。",
                            "verse 44:56": "他們在樂園中，除初次的死亡外不再嘗死的滋味。真主將使他們得免於火獄的刑罰。",
                            "verse 44:57": "那是由於你的主的恩典，那確是偉大的成功。",
                            "verse 44:58": "我以你的語言，使《古蘭經》成為易解的，只為希望他們能覺悟。",
                            "verse 44:59": "你等待吧，他們確是等待著的！"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Há mím.",
                            "verse 44:2": "Při Písmu zřetelném!",
                            "verse 44:3": "Věru seslali jsme je, abychom byli varovateli, v noci požehnané,",
                            "verse 44:4": "v níž jsou rozdělována všechna zjevení moudrá",
                            "verse 44:5": "podle rozkazu od Nás vycházejícího. A My věru jsme těmi, kdo posly vysílají",
                            "verse 44:6": "jako milosrdenství od Pána tvého, a On slyšící je a vševědoucí,",
                            "verse 44:7": "Pán nebes i země a všeho, co mezi nimi je - jste-li pevně věřící!",
                            "verse 44:8": "Není božstva kromě Něho a On oživuje a usmrcuje a Pánem vaším je i vašich předků dávných.",
                            "verse 44:9": "A přesto nevěřící v pochybnostech si hrají.",
                            "verse 44:10": "Očekávej tedy den, kdy na nebesích se ukáže dým viditelný,",
                            "verse 44:11": "který lidi zahalí; a to bude trest bolestný!",
                            "verse 44:12": "Tehdy vzkřiknou: \"Pane náš, odvrať od nás trest tento, my nyní jsme věřící!\"",
                            "verse 44:13": "K čemu je jim nyní připomenutí? Vždyť přišel k nim již posel zjevný,",
                            "verse 44:14": "však zády se k němu obrátili a řekli: \"Blázen je to, jinými poučený!\"",
                            "verse 44:15": "Jestliže jen trochu od vás trest tento odvrátíme, vy zcela jistě se do nevěrectví navrátíte,",
                            "verse 44:16": "však v den, kdy udeříme velkým útokem, pomsty Naší okusíte!",
                            "verse 44:17": "A již před nimi jsme lid Faraónův zkoušce vystavili a přišel k nim posel vznešený,",
                            "verse 44:18": "jenž pravil: \"Vydejte mi služebníky Boží! Já pro vás jsem posel spolehlivý!",
                            "verse 44:19": "Nepovstávejte proti Bohu, neb já k vám se zplnomocněním zřetelným přicházím,",
                            "verse 44:20": "a utíkám se k Pánu svému i Pánu vašemu před vaším ukamenováním.",
                            "verse 44:21": "A jestliže mi nevěříte, tedy se ode mne držte stranou!\"",
                            "verse 44:22": "Pak volal k Pánu svému: \"Tito lidé hříšníci jsou!\"",
                            "verse 44:23": "Odejdi za noci se služebníky Mými, neb pronásledovat vás budou,",
                            "verse 44:24": "a přejdi přes moře otevřené; a oni vojska jsou, jež utopením zahynou!\"",
                            "verse 44:25": "Kolik opustili zahrad a pramenů,",
                            "verse 44:26": "osetých polí a vznešených příbytků",
                            "verse 44:27": "a příjemností, v nichž vesele si žili!",
                            "verse 44:28": "A stalo se tak a dědici toho jsme lid jiný učinili.",
                            "verse 44:29": "Ani nebesa, ani země nad nimi nezaplakaly a nebyl dán odklad jim,",
                            "verse 44:30": "však dítka Izraele jsme zachránili před trestem zahanbujícím",
                            "verse 44:31": "Faraonóvým; a byl on mezi přestupníky zpupný.",
                            "verse 44:32": "A vyvolili jsme je nad ostatní lidstvo vědomě",
                            "verse 44:33": "a ukázali jsme jim znamení, v nichž zkouška zjevná byla pro ně.",
                            "verse 44:34": "A věru tito zde hovoří:",
                            "verse 44:35": "Není jiné smrti než první a my nebudeme vzkříšeni;",
                            "verse 44:36": "přiveďte tedy naše otce, jste-li pravdomluvní!\"",
                            "verse 44:37": "Jsou snad oni lepší než lid tubba´ů a než jejich předchůdci, jež za hříšnost jejich jsme zahubili?",
                            "verse 44:38": "A nestvořili jsme nebesa a zemi, a co je mezi nimi, pro kratochvíli,",
                            "verse 44:39": "nýbrž stvořili jsme to jako skutečnost vážnou, však většina z nich to neví.",
                            "verse 44:40": "A věru den rozhodnutí bude časem schůzky pro všechny,",
                            "verse 44:41": "a to bude den, kdy přítel nebude nic platný příteli a nikdo jim nebude nápomocný",
                            "verse 44:42": "kromě těch, nad nimiž Bůh se slituje, vždyť On věru mocný je a slitovný.",
                            "verse 44:43": "Vskutku bude strom Zaqqúm",
                            "verse 44:44": "patřit k hříšníka pokrmům.",
                            "verse 44:45": "Je jak roztavená smůla, jež ve vnitřnostech kypí,",
                            "verse 44:46": "podoben vodě vroucí.",
                            "verse 44:47": "Vezměte ho a do hlubin pekelných jej dovlecte",
                            "verse 44:48": "a potom na jeho hlavu za trest vodu vroucí lijte!\"",
                            "verse 44:49": "Ochutnej, vždyť tys mocný, vznešený zajisté!",
                            "verse 44:50": "Tohle je přece to, o čem vy pochybovali jste.\"",
                            "verse 44:51": "A bohabojní budou věru na místě bezpečném přebývat",
                            "verse 44:52": "mezi zahradami a prameny",
                            "verse 44:53": "a oděni do atlasu a brokátu se jeden na druhého budou dívat.",
                            "verse 44:54": "Tak stane se! A oženíme je s dívkami velkých černých očí,",
                            "verse 44:55": "a budou si tam všechny druhy ovoce žádat, jsouce v bezpečí.",
                            "verse 44:56": "A neokusí tam smrti - kromě smrti první - a ušetří je trest pekelný",
                            "verse 44:57": "z milosti Pána tvého; a to štěstí je nesmírné.",
                            "verse 44:58": "A ulehčili jsme ti to pomocí jazyka tvého - snad se upamatují!",
                            "verse 44:59": "Pozoruj, vždyť také oni zpozorují!"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Haa Miem.",
                            "verse 44:2": "Bij het duidelijke Boek.",
                            "verse 44:3": "Waarlijk, Wij openbaarden het in een gezegende nacht en Wij zijn de Waarschuwer.",
                            "verse 44:4": "Waarin al het wijze tot in bijzonderheden is uitgelegd.",
                            "verse 44:5": "Door Ons gebod. - Voorzeker, Wij zenden (de profeten)",
                            "verse 44:6": "Als een barmhartigheid van uw Heer; waarlijk, Hij is de Alhorende, de Alwetende.",
                            "verse 44:7": "Van de Heer der hemelen en der aarde en alles wat er tussen is, indien gij er vertrouwen in stelt.",
                            "verse 44:8": "Er is geen God naast Hem. Hij doet leven en sterven, uw Heer en de Heer uwer voorvaderen.",
                            "verse 44:9": "Doch zij vermaken zich door te twijfelen.",
                            "verse 44:10": "Maar wacht op de Dag waarop de hemel een zichtbare damp zal voortbrengen,",
                            "verse 44:11": "Die het volk zal omhullen. Dit zal een pijnlijke straf zijn.",
                            "verse 44:12": "\"Onze Heer, neem de marteling van ons weg; waarlijk wij zijn gelovigen,\" (zullen zij zeggen).",
                            "verse 44:13": "Hoe kan er lering voor hen zijn, terwijl er tot hen een boodschapper is gekomen, die alles duidelijk maakt.",
                            "verse 44:14": "En zij hebben zich van hem afgewend zeggende: \"Hij is (door mensen) onderwezen, een bezetene.\"",
                            "verse 44:15": "Wij zullen de straf voor een wijle wegnemen, maar zij zullen stellig terugvallen.",
                            "verse 44:16": "De de dag, waarop Wij hen met een machtige greep aanvallen, zullen Wij hen zeker straffen.",
                            "verse 44:17": "Wij hebben het volk van Pharao reeds vóór hen beproefd en er kwam een eerwaardige boodschapper tot hen zeggende:",
                            "verse 44:18": "\"Geeft mij de dienaren van God, voorwaar, ik ben voor u een betrouwbare Boodschapper.",
                            "verse 44:19": "En verheft u niet tegen God. Zeker, ik kom tot u met duidelijk gezag.",
                            "verse 44:20": "En ik zoek toevlucht tot mijn en uw Heer, vrezende dat gij mij zult stenigen.",
                            "verse 44:21": "En laat mij alleen, indien gij mij niet gelooft.\"",
                            "verse 44:22": "Toen bad hij tot zijn Heer: \"Dit is inderdaad een zondig volk.\"",
                            "verse 44:23": "God zeide: \"Trek met Mijn dienaren ’s nachts weg want gij zult gewis worden achtervolgd.",
                            "verse 44:24": "En doorwaad de zee terwijl deze rustig is. Voorzeker, zij zijn een schare die zal verdrinken.\"",
                            "verse 44:25": "Hoevele tuinen en bronnen lieten zij achter!",
                            "verse 44:26": "En de korenvelden en de schone plaatsen!",
                            "verse 44:27": "En de aangename dingen, waarvan zij genoten!",
                            "verse 44:28": "Zo was het, maar Wij deden ze een ander volk erven.",
                            "verse 44:29": "De hemel en de aarde weenden niet om hen noch werd hun uitstel gegeven.",
                            "verse 44:30": "En zo redden Wij de kinderen van Israël van een vernederende kwelling.",
                            "verse 44:31": "Door Pharao: want hij was trots en één der buitensporigen.",
                            "verse 44:32": "En Wij verkozen hen doelbewust boven andere volkeren.",
                            "verse 44:33": "En Wij gaven hun tekenen, waar een duidelijke beproeving in lag.",
                            "verse 44:34": "Deze mensen (de ongelovigen) zeggen:",
                            "verse 44:35": "\"Het is slechts onze enige dood want wij zullen niet worden opgewekt.",
                            "verse 44:36": "Breng onze voorvaderen dan terug indien gij de waarheid spreekt.\"",
                            "verse 44:37": "Zijn zij beter of het volk van Tobba of zij die vóór hen zijn geweest? Wij vernietigden hen omdat zij schuldig waren.",
                            "verse 44:38": "En Wij hebben de hemelen en de aarde en alles wat er tussen is niet als spel geschapen.",
                            "verse 44:39": "Wij schiepen ze slechts in waarheid, maar de meesten hunner begrijpeen het niet.",
                            "verse 44:40": "Voorwaar, de Dag der beslissing is voor hen allen de vastgestelde tijd.",
                            "verse 44:41": "De Dag waarop een vriend de vriend niets zal baten noch zullen zij worden geholpen.",
                            "verse 44:42": "Met uitzondering van hen, die God genadig zal zijn. Voorwaar, Hij is de Almachtige, de Genadevolle.",
                            "verse 44:43": "De boom van Zaqqoem,",
                            "verse 44:44": "Zal het voedsel voor de zondaar zijn,",
                            "verse 44:45": "Als gesmolten koper zal het in de buik koken,",
                            "verse 44:46": "Gelijk het koken van ziedend water.",
                            "verse 44:47": "\"Grijpt hem en sleurt hem in het midden van het laaiend Vuur;",
                            "verse 44:48": "Giet daarna als marteling kokend water op zijn hoofd.\"",
                            "verse 44:49": "Proef dit! Voorzeker gij waart eens de machtige, de eerwaardige.",
                            "verse 44:50": "Dit is inderdaad datgene waaraan gij twijfeldet.",
                            "verse 44:51": "Voorwaar, de rechtvaardigen zullen in een woning van vrede en veiligheid zijn,",
                            "verse 44:52": "Tussen tuinen en bronnen,",
                            "verse 44:53": "Gekleed in fijne zijde en zwaar goudlaken naar elkander toegekeerd.",
                            "verse 44:54": "Zo zal het zijn. En Wij zullen hen met schone meisjes die grote, mooie ogen hebben, verenigen.",
                            "verse 44:55": "Zij zullen daar naar alle fruitsoorten vragen (en deze ontvangen) in vrede en veiligheid.",
                            "verse 44:56": "Zij zullen daarin geen andere dood smaken na de eerste dood. En Hij heeft hen voor de straf van het laaiend Vuur behoed.",
                            "verse 44:57": "Als een genade van uw Heer. Dit is de grootste zegepraal.",
                            "verse 44:58": "Wij hebben hem (de Koran) gemakkelijk voor uw tong gemaakt, opdat men er lering uit moge trekken.",
                            "verse 44:59": "Wacht daarom, zij wachten ook."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 44:1": "Ha. Mim.",
                            "verse 44:2": "By the Scripture that maketh plain",
                            "verse 44:3": "Lo! We revealed it on a blessed night - Lo! We are ever warning -",
                            "verse 44:4": "Whereon every wise command is made clear",
                            "verse 44:5": "As a command from Our presence - Lo! We are ever sending -",
                            "verse 44:6": "A mercy from thy Lord. Lo! He, even He is the Hearer, the Knower,",
                            "verse 44:7": "Lord of the heavens and the earth and all that is between them, if ye would be sure.",
                            "verse 44:8": "There is no God save Him. He quickeneth and giveth death; your Lord and Lord of your forefathers.",
                            "verse 44:9": "Nay, but they play in doubt.",
                            "verse 44:10": "But watch thou (O Muhammad) for the day when the sky will produce visible smoke",
                            "verse 44:11": "That will envelop the people. This will be a painful torment.",
                            "verse 44:12": "(Then they will say): Our Lord relieve us of the torment. Lo! we are believers.",
                            "verse 44:13": "How can there be remembrance for them, when a messenger making plain (the Truth) had already come unto them,",
                            "verse 44:14": "And they had turned away from him and said: One taught (by others), a madman ?",
                            "verse 44:15": "Lo! We withdraw the torment a little. Lo! ye return (to disbelief).",
                            "verse 44:16": "On the day when We shall seize them with the greater seizure, (then) in truth We shall punish.",
                            "verse 44:17": "And verily We tried before them Pharaoh’s folk, when there came unto them a noble messenger,",
                            "verse 44:18": "Saying: Give up to me the slaves of Allah. Lo! I am a faithful messenger unto you.",
                            "verse 44:19": "And saying: Be not proud against Allah. Lo! I bring you a clear warrant.",
                            "verse 44:20": "And lo! I have sought refuge in my Lord and your Lord lest ye stone me to death.",
                            "verse 44:21": "And if ye put no faith in me, then let me go.",
                            "verse 44:22": "And he cried unto his Lord, (saying): These are guilty folk.",
                            "verse 44:23": "Then (his Lord commanded): Take away My slaves by night. Lo! ye will be followed,",
                            "verse 44:24": "And leave the sea behind at rest, for lo! they are a drowned host.",
                            "verse 44:25": "How many were the gardens and the watersprings that they left behind,",
                            "verse 44:26": "And the cornlands and the goodly sites",
                            "verse 44:27": "And pleasant things wherein they took delight!",
                            "verse 44:28": "Even so (it was), and We made it an inheritance for other folk;",
                            "verse 44:29": "And the heaven and the earth wept not for them, nor were they reprieved.",
                            "verse 44:30": "And We delivered the Children of Israel from the shameful doom;",
                            "verse 44:31": "(We delivered them) from Pharaoh. Lo! he was a tyrant of the wanton ones.",
                            "verse 44:32": "And We chose them, purposely, above (all) creatures.",
                            "verse 44:33": "And We gave them portents wherein was a clear trial.",
                            "verse 44:34": "Lo! these, forsooth, are saying:",
                            "verse 44:35": "There is naught but our first death, and we shall not be raised again.",
                            "verse 44:36": "Bring back our fathers, if ye speak the truth!",
                            "verse 44:37": "Are they better, or the folk of Tubb’a and those before them ? We destroyed them, for surely they were guilty.",
                            "verse 44:38": "And We created not the heavens and the earth, and all that is between them, in play.",
                            "verse 44:39": "We created them not save with truth; but most of them know not.",
                            "verse 44:40": "Assuredly the Day of Decision is the term for all of them,",
                            "verse 44:41": "A day when friend can in naught avail friend, nor can they be helped,",
                            "verse 44:42": "Save him on whom Allah hath mercy. Lo! He is the Mighty, the Merciful.",
                            "verse 44:43": "Lo! the tree of Zaqqum,",
                            "verse 44:44": "The food of the sinner!",
                            "verse 44:45": "Like molten brass, it seetheth in their bellies",
                            "verse 44:46": "As the seething of boiling water.",
                            "verse 44:47": "(And it will be said): Take him and drag him to the midst of hell,",
                            "verse 44:48": "Then pour upon his head the torment of boiling water.",
                            "verse 44:49": "(Saying): Taste! Lo! thou wast forsooth the mighty, the noble!",
                            "verse 44:50": "Lo! this is that whereof ye used to doubt.",
                            "verse 44:51": "Lo! those who kept their duty will be in a place secured.",
                            "verse 44:52": "Amid gardens and watersprings,",
                            "verse 44:53": "Attired in silk and silk embroidery, facing one another.",
                            "verse 44:54": "Even so (it will be). And We shall wed them unto fair ones with wide, lovely eyes.",
                            "verse 44:55": "They call therein for every fruit in safety.",
                            "verse 44:56": "They taste not death therein, save the first death. And He hath saved them from the doom of hell,",
                            "verse 44:57": "A bounty from thy Lord. That is the supreme triumph.",
                            "verse 44:58": "And We have made (this Scripture) easy in thy language only that they may heed.",
                            "verse 44:59": "Wait then (O Muhammad). Lo! they (too) are waiting."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 44:1": "Ha-Mim.",
                            "verse 44:2": "By the Book that makes things clear;-",
                            "verse 44:3": "We sent it down during a Blessed Night: for We (ever) wish to warn (against Evil).",
                            "verse 44:4": "In the (Night) is made distinct every affair of wisdom,",
                            "verse 44:5": "By command, from Our Presence. For We (ever) send (revelations),",
                            "verse 44:6": "As Mercy from thy Lord: for He hears and knows (all things);",
                            "verse 44:7": "The Lord of the heavens and the earth and all between them, if ye (but) have an assured faith.",
                            "verse 44:8": "There is no god but He: It is He Who gives life and gives death,- The Lord and Cherisher to you and your earliest ancestors.",
                            "verse 44:9": "Yet they play about in doubt.",
                            "verse 44:10": "Then watch thou for the Day that the sky will bring forth a kind of smoke (or mist) plainly visible,",
                            "verse 44:11": "Enveloping the people: this will be a Penalty Grievous.",
                            "verse 44:12": "(They will say:) \"Our Lord! remove the Penalty from us, for we do really believe!\"",
                            "verse 44:13": "How shall the message be (effectual) for them, seeing that an Apostle explaining things clearly has (already) come to them,-",
                            "verse 44:14": "Yet they turn away from him and say: \"Tutored (by others), a man possessed!\"",
                            "verse 44:15": "We shall indeed remove the Penalty for a while, (but) truly ye will revert (to your ways).",
                            "verse 44:16": "One day We shall seize you with a mighty onslaught: We will indeed (then) exact Retribution!",
                            "verse 44:17": "We did, before them, try the people of Pharaoh: there came to them an apostle most honourable,",
                            "verse 44:18": "Saying: \"Restore to me the Servants of God: I am to you an apostle worthy of all trust;",
                            "verse 44:19": "\"And be not arrogant as against God: for I come to you with authority manifest.",
                            "verse 44:20": "\"For me, I have sought safety with my Lord and your Lord, against your injuring me.",
                            "verse 44:21": "\"If ye believe me not, at least keep yourselves away from me.\"",
                            "verse 44:22": "(But they were aggressive:) then he cried to his Lord: \"These are indeed a people given to sin.\"",
                            "verse 44:23": "(The reply came:) \"March forth with My Servants by night: for ye are sure to be pursued.",
                            "verse 44:24": "\"And leave the sea as a furrow (divided): for they are a host (destined) to be drowned.\"",
                            "verse 44:25": "How many were the gardens and springs they left behind,",
                            "verse 44:26": "And corn-fields and noble buildings,",
                            "verse 44:27": "And wealth (and conveniences of life), wherein they had taken such delight!",
                            "verse 44:28": "Thus (was their end)! And We made other people inherit (those things)!",
                            "verse 44:29": "And neither heaven nor earth shed a tear over them: nor were they given a respite (again).",
                            "verse 44:30": "We did deliver aforetime the Children of Israel from humiliating Punishment,",
                            "verse 44:31": "Inflicted by Pharaoh, for he was arrogant (even) among inordinate transgressors.",
                            "verse 44:32": "And We chose them aforetime above the nations, knowingly,",
                            "verse 44:33": "And granted them Signs in which there was a manifest trial",
                            "verse 44:34": "As to these (Quraish), they say forsooth:",
                            "verse 44:35": "\"There is nothing beyond our first death, and we shall not be raised again.",
                            "verse 44:36": "\"Then bring (back) our forefathers, if what ye say is true!\"",
                            "verse 44:37": "What! Are they better than the people of Tubba and those who were before them? We destroyed them because they were guilty of sin.",
                            "verse 44:38": "We created not the heavens, the earth, and all between them, merely in (idle) sport:",
                            "verse 44:39": "We created them not except for just ends: but most of them do not understand.",
                            "verse 44:40": "Verily the Day of sorting out is the time appointed for all of them,-",
                            "verse 44:41": "The Day when no protector can avail his client in aught, and no help can they receive,",
                            "verse 44:42": "Except such as receive God’s Mercy: for He is Exalted in Might, Most Merciful.",
                            "verse 44:43": "Verily the tree of Zaqqum",
                            "verse 44:44": "Will be the food of the Sinful,-",
                            "verse 44:45": "Like molten brass; it will boil in their insides.",
                            "verse 44:46": "Like the boiling of scalding water.",
                            "verse 44:47": "(A voice will cry: \"Seize ye him and drag him into the midst of the Blazing Fire!",
                            "verse 44:48": "\"Then pour over his head the Penalty of Boiling Water,",
                            "verse 44:49": "\"Taste thou (this)! Truly wast thou mighty, full of honour!",
                            "verse 44:50": "\"Truly this is what ye used to doubt!\"",
                            "verse 44:51": "As to the Righteous (they will be) in a position of Security,",
                            "verse 44:52": "Among Gardens and Springs;",
                            "verse 44:53": "Dressed in fine silk and in rich brocade, they will face each other;",
                            "verse 44:54": "So; and We shall join them to Companions with beautiful, big, and lustrous eyes.",
                            "verse 44:55": "There can they call for every kind of fruit in peace and security;",
                            "verse 44:56": "Nor will they there taste Death, except the first death; and He will preserve them from the Penalty of the Blazing Fire,-",
                            "verse 44:57": "As a Bounty from thy Lord! that will be the supreme achievement!",
                            "verse 44:58": "Verily, We have made this (Qur’an) easy, in thy tongue, in order that they may give heed.",
                            "verse 44:59": "So wait thou and watch; for they (too) are waiting."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 44:1": "Ha Mim",
                            "verse 44:2": "By the Clear Book.",
                            "verse 44:3": "We have sent it down in a blessed night (We are ever warning)",
                            "verse 44:4": "therein every wise bidding",
                            "verse 44:5": "determined as a bidding from Us, (We are ever sending)",
                            "verse 44:6": "as a mercy from thy Lord (surely He is the All-hearing, the All-knowing)",
                            "verse 44:7": "Lord of the heavens and earth, and all that between them is if you have faith.",
                            "verse 44:8": "There is no god but He; He gives life and makes to die; your Lord and the Lord of your fathers, the ancients.",
                            "verse 44:9": "Nay, but they are in doubt, playing.",
                            "verse 44:10": "So be on the watch for a day when heaven shall bring a manifest smoke",
                            "verse 44:11": "covering the people; this is a painful chastisement.",
                            "verse 44:12": "’O our Lord, remove Thou from us the chastisement; we are believers.’",
                            "verse 44:13": "How should they have the Reminder, seeing a clear Messenger already came to them,",
                            "verse 44:14": "then they turned away from him and said, ’A man tutored, possessed!’",
                            "verse 44:15": "’Behold, We are removing the chastisement a little; behold, you revert!’",
                            "verse 44:16": "Upon the day when We shall assault most mightily, then We shall take Our vengeance.",
                            "verse 44:17": "Already before them We tried the people of Pharaoh, and a noble Messenger came unto them,",
                            "verse 44:18": "saying, ’Deliver to me God’s servants; I am for you a faithful Messenger,",
                            "verse 44:19": "and, ’Rise not up against God; behold, I come to you with a clear authority,",
                            "verse 44:20": "and I take refuge in my Lord and your Lord, lest you should stone me.",
                            "verse 44:21": "’But if so be that you believe me not, go you apart from me!’",
                            "verse 44:22": "And he called to his Lord, saying, ’These are a sinful people.’",
                            "verse 44:23": "’Then set thou forth with My servants in a watch of the night; surely you will be followed.",
                            "verse 44:24": "And leave the sea becalmed; they are a drowned host.’",
                            "verse 44:25": "They left how many gardens and fountains,",
                            "verse 44:26": "sown fields, and how noble a station,",
                            "verse 44:27": "and what prosperity they had rejoiced in!",
                            "verse 44:28": "Even so; and We bequeathed them upon another people.",
                            "verse 44:29": "Neither heaven nor earth wept for them, nor were they respited;",
                            "verse 44:30": "and We delivered the Children of Israel from the humbling chastisement,",
                            "verse 44:31": "from Pharaoh; surely he was a high One, of the prodigals;",
                            "verse 44:32": "and We chose them, out of a knowledge, above all beings,",
                            "verse 44:33": "and gave them signs wherein there was a manifest trial.",
                            "verse 44:34": "These men do say,",
                            "verse 44:35": "’There is nothing but our first death; we shall not be revived.",
                            "verse 44:36": "Bring us our fathers, if you speak truly!’",
                            "verse 44:37": "Are they better, or the people of Tubba’ and those before them whom We destroyed? They were surely sinners.",
                            "verse 44:38": "We created not the heavens and earth, and all that between them is, in play;",
                            "verse 44:39": "We created them not save in truth; but most of them know it not.",
                            "verse 44:40": "Surely the Day of Decision shall be their appointed time, all together,",
                            "verse 44:41": "the day a master shall avail nothing a client, and they shall not be helped,",
                            "verse 44:42": "save him upon whom God has mercy; He is the All-mighty, the All-compassionate.",
                            "verse 44:43": "Lo, the Tree of Ez-Zakkoum",
                            "verse 44:44": "is the food of the guilty,",
                            "verse 44:45": "like molten copper, bubbling in the belly",
                            "verse 44:46": "as boiling water bubbles.",
                            "verse 44:47": "’Take him, and thrust him into the midst of Hell,",
                            "verse 44:48": "then pour over his head the chastisement of boiling water!’",
                            "verse 44:49": "’Taste! Surely thou art the mighty, the noble.",
                            "verse 44:50": "This is that concerning which you were doubting.’",
                            "verse 44:51": "Surely the godfearing shall be in a station secure",
                            "verse 44:52": "among gardens and fountains,",
                            "verse 44:53": "robed in silk and brocade, set face to face.",
                            "verse 44:54": "Even so; and We shall espouse them to wide-eyed houris,",
                            "verse 44:55": "therein calling for every fruit, secure.",
                            "verse 44:56": "They shall not taste therein of death, save the first death, And He shall guard them against the chastisement of Hell --",
                            "verse 44:57": "a bounty from thy Lord; that is the mighty triumph.",
                            "verse 44:58": "Now We have made it easy by thy tongue, that haply they may remember.",
                            "verse 44:59": "So be on the watch; they too are on the watch."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 44:1": "Hā. Mīm.",
                            "verse 44:2": "CONSIDER this divine writ, clear in itself and clearly showing the truth!",
                            "verse 44:3": "Behold, from on high have We bestowed it on a blessed night: for, verily, We have always been warning .",
                            "verse 44:4": "On that [night] was made clear, in wisdom, the distinction between all things [good and evil]",
                            "verse 44:5": "at a behest from Ourselves: for, verily, We have always been sending [Our messages of guidance]",
                            "verse 44:6": "in pursuance of thy Sustainer’s grace [unto man]. Verily, He alone is all-hearing, all-knowing,",
                            "verse 44:7": "the Sustainer of the heavens and the earth and all that is between them – if you could but grasp it with inner certainty!",
                            "verse 44:8": "There is no deity save Him: He grants life and deals death: He is your Sustainer as well as the Sustainer of your forebears of old.",
                            "verse 44:9": "Nay, but they [who lack inner certainty] are but toying with their doubts.",
                            "verse 44:10": "WAIT, THEN, for the Day when the skies shall bring forth a pall of smoke which will make obvious [the approach of the Last Hour],",
                            "verse 44:11": "enveloping all mankind, [and causing the sinners to exclaim:] \"Grievous is this suffering!",
                            "verse 44:12": "O our Sustainer, relieve us of suffering, for, verily, we [now] believe [in Thee]!\"",
                            "verse 44:13": "[But] how shall this remembrance avail them [at the Last Hour], seeing that an apostle had previously come unto them, clearly expounding the truth,",
                            "verse 44:14": "whereupon they turned their backs on him and said, \"Taught [by others] is he, a madman\"?",
                            "verse 44:15": "[Still,] behold, We shall postpone this suffering for a little while, although you are bound to revert [to your evil ways: but]",
                            "verse 44:16": "on the Day when We shall seize [all sinners] with a most mighty onslaught, We shall, verily, inflict Our retribution [on you as well]!",
                            "verse 44:17": "AND, INDEED, [long] before their time did We try Pharaoh’s people [in the same way]: for there came unto them a noble apostle, [who said:]",
                            "verse 44:18": "\"Give in unto me, O God’s bondmen! Verily, I am an apostle [sent] unto you, worthy of trust!",
                            "verse 44:19": "\"And exalt not yourselves against God: for, verily, I come unto you with a manifest authority [from Him];",
                            "verse 44:20": "and, behold, it is with my Sustainer – and your Sustainer – that I seek refuge against all your endeavours to revile me.",
                            "verse 44:21": "And if you do not believe me, [at least] stand away from me!\"",
                            "verse 44:22": "But then, [when they beset him with their enmity,] he called out to his Sustainer, \"These are [indeed] people lost in sin!\"",
                            "verse 44:23": "And [God said]: \"Go thou forth with My servants by night, for you will surely be pursued;",
                            "verse 44:24": "and leave the sea becalmed [between thee and Pharaoh’s men]: for, verily, they are a host destined to be drowned!\"",
                            "verse 44:25": "[And so they perished: and] how many gardens did they leave behind, and water-runnels,",
                            "verse 44:26": "and fields of grain, and noble dwellings,",
                            "verse 44:27": "and [all that] life of ease in which they used to delight!",
                            "verse 44:28": "Thus it was. And [then] We made another people heirs [to what they had left],",
                            "verse 44:29": "and neither sky nor earth shed tears over them, nor were they allowed a respite.",
                            "verse 44:30": "And, indeed, We delivered the children of Israel from the shameful suffering",
                            "verse 44:31": "[inflicted on them] by Pharaoh, seeing that he was truly outstanding among those who waste their own selves;",
                            "verse 44:32": "and, indeed, We chose them knowingly above all other people,",
                            "verse 44:33": "and gave them such signs [of Our grace] as would clearly presage a test.",
                            "verse 44:34": "[Now,] behold, these [people] say indeed:",
                            "verse 44:35": "\"That [which is ahead of us] is but our first [and only] death, and we shall not be raised to life again.",
                            "verse 44:36": "So then, bring forth our forefathers [as witnesses], if what you claim is true!\"",
                            "verse 44:37": "Are they, then, better than the people of Tubba’ and those before them, whom We destroyed because they were truly lost in [the same] sin?",
                            "verse 44:38": "For [thus it is:] We have not created the heavens and the earth and all that is between them in mere idle play:",
                            "verse 44:39": "none of this have We created without [an inner] truth: but most of them understand it not.",
                            "verse 44:40": "VERILY, the Day of Distinction [between the true and the false] is the term appointed for all of them:",
                            "verse 44:41": "the Day when no friend shall be of the least avail to his friend, and when none shall be succoured",
                            "verse 44:42": "save those upon whom God will have bestowed His grace and mercy: for, verily, He alone is almighty, a dispenser of grace.",
                            "verse 44:43": "Verily, [in the life to come] the tree of deadly fruit",
                            "verse 44:44": "will be the food of the sinful:",
                            "verse 44:45": "like molten lead will it boil in the belly,",
                            "verse 44:46": "like the boiling of burning despair.",
                            "verse 44:47": "[And the word will be spoken:] \"Seize him, [O you forces of hell,] and drag him into the midst of the blazing fire:",
                            "verse 44:48": "then pour over his head the anguish of burning despair!",
                            "verse 44:49": "Taste it – thou who [on earth] hast considered thyself so mighty, so noble!",
                            "verse 44:50": "This is the very thing which you [deniers of the truth] were wont to call in question!\"",
                            "verse 44:51": "[As against this –] verily, the God-conscious will find themselves in a state secure,",
                            "verse 44:52": "amid gardens and springs,",
                            "verse 44:53": "wearing [garments] of silk and brocade, facing one another [in love].",
                            "verse 44:54": "Thus shall it be. And We shall pair them with companions pure, most beautiful of eye.",
                            "verse 44:55": "In that [paradise] they shall [rightfully] claim all the fruits [of their past deeds], resting in security;",
                            "verse 44:56": "and neither shall they taste death there after having passed through their erstwhile death. Thus will He have preserved them from all suffering through the blazing fire –",
                            "verse 44:57": "an act of thy Sustainer’s favour: and that, that will be the triumph supreme!",
                            "verse 44:58": "THUS, THEN, [O Prophet,] have We made this [divine writ] easy to understand, in thine own [human] tongue, so that men might take it to heart.",
                            "verse 44:59": "So wait thou [for what the future will bring]: behold, they, too, are waiting."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 44:1": "Hā Mīm .",
                            "verse 44:2": "By the manifest Book,",
                            "verse 44:3": "We have sent it down in a blessed night, (because) We had to warn (people).",
                            "verse 44:4": "In that (night), every wise matter is allocated",
                            "verse 44:5": "through a command from Us. We were to send the Messenger",
                            "verse 44:6": "as a mercy from your Lord, -Surely, He is the All-Hearing, the All-Knowing-",
                            "verse 44:7": "the Lord of the heavens and the earth and of whatever there is between them, if you are to believe.",
                            "verse 44:8": "There is no god, but He. He gives life and brings death. He is your Lord and the Lord of your forefathers.",
                            "verse 44:9": "But they, being in doubt, are playing around.",
                            "verse 44:10": "So, wait for a day when the sky will come up with a visible smoke",
                            "verse 44:11": "that will envelop people. This is a painful punishment.",
                            "verse 44:12": "(Then they will say,) “O our Lord, remove from us the punishment; we will truly believe.”",
                            "verse 44:13": "How will they take lesson, while there has already come to them a messenger making things clear?",
                            "verse 44:14": "Then they turned away from him, and said, “(He is) tutored, crazy.”",
                            "verse 44:15": "(Well,) We are going to remove the punishment for a while, (but) you will certainly go back (to your original position).",
                            "verse 44:16": "(Then,) the day We will seize (you) with the greatest seizure, We will take vengeance.",
                            "verse 44:17": "And We tested the people of Fir‘aun (Pharaoh) prior to them, and a noble messenger came to them",
                            "verse 44:18": "saying, “Deliver to me the servants of Allah. I am an honest messenger to you,”",
                            "verse 44:19": "and saying, “Do not be haughty against Allah. I bring to you a clear proof.",
                            "verse 44:20": "And I have sought refuge with my Lord and your Lord, lest you stone me to death.",
                            "verse 44:21": "And if you do not believe in me, then keep away from me.”",
                            "verse 44:22": "Then he prayed to his Lord saying, “These are a guilty people.”",
                            "verse 44:23": "(So, Allah answered his prayer saying,) “Now, take away my servants at night. You will certainly be chased,",
                            "verse 44:24": "and leave the sea in the state of stillness; they are an army that is sure to be drowned.”",
                            "verse 44:25": "How many gardens and fountains have they left behind-",
                            "verse 44:26": "- and how many fields and noble sites,",
                            "verse 44:27": "and how many a luxury they used to rejoice in!",
                            "verse 44:28": "This is how it happened. And We made other people inherit all this.",
                            "verse 44:29": "So, neither the sky and earth wept over them, nor were they given a respite.",
                            "verse 44:30": "And We delivered the children of Isrā’īl from the humiliating punishment,",
                            "verse 44:31": "from Fir‘aun. Indeed, he was haughty, one of the transgressors.",
                            "verse 44:32": "And We chose them, with knowledge, above all the worlds.",
                            "verse 44:33": "And We gave them the clear signs in which there was a manifest blessing.",
                            "verse 44:34": "These people say,",
                            "verse 44:35": "“There is nothing more than our first death, and we are not going to be resurrected.",
                            "verse 44:36": "So, (O believers,) bring our fathers, if you are true (in your belief in resurrection.)”",
                            "verse 44:37": "Are they better or the people of Tubba‘ and those who were before them? We have destroyed them. They were guilty indeed.",
                            "verse 44:38": "And We did not create the heavens and the earth and what is between them just as players.",
                            "verse 44:39": "We did not create them but with true purpose, but most of them do not know.",
                            "verse 44:40": "The Day of Decision is the appointed time for all of them-",
                            "verse 44:41": "the day when no close relation will be of any use to any close relation, nor will they be helped,",
                            "verse 44:42": "except the One on whom Allah has mercy. Of course, He is the All-Mighty, the Very-Merciful.",
                            "verse 44:43": "Indeed the tree of zaqqūm",
                            "verse 44:44": "is the food of the sinful,",
                            "verse 44:45": "like dregs of oil. It will boil in the bellies",
                            "verse 44:46": "like the boiling of hot water.",
                            "verse 44:47": "(It will be said to angels,) “Seize him, and drag him into the midst of the Hell.",
                            "verse 44:48": "Then pour on his head some torment of boiling water.”",
                            "verse 44:49": "“Have a taste! You are the ‘man of might’, the ‘man of honour’.",
                            "verse 44:50": "This is the thing about which you used to be skeptic.”",
                            "verse 44:51": "Indeed the God-fearing will be in a place free from fear,",
                            "verse 44:52": "in gardens and fountains.",
                            "verse 44:53": "They will be dressed in fine silk and thick silk, facing each other.",
                            "verse 44:54": "Thus (it will happen,) and We will marry them with houris having big dark eyes.",
                            "verse 44:55": "They will call therein for every fruit peacefully.",
                            "verse 44:56": "They will not taste death therein beyond the first death (they faced in the world). And He (Allah) will save them from the torment of Hell,",
                            "verse 44:57": "as a favour from your Lord. That is the great achievement.",
                            "verse 44:58": "So, We had made it (the Qur’ān) easy in your tongue, so that they may take lesson.",
                            "verse 44:59": "Now wait. They too are waiting."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 44:1": "Hā mīm.",
                            "verse 44:2": "By the Book that clarifies.",
                            "verse 44:3": "Indeed We revealed it on a blessed night. Indeed We have been warning.",
                            "verse 44:4": "In it every definitive matter is distinguished.",
                            "verse 44:5": "As an ordinance from Us. Indeed We have been sending from your Lord,",
                            "verse 44:6": "as a mercy. Surely He is the Hearer, the Knower.",
                            "verse 44:7": "Lord of the heavens and the earth and all that is between them if you should be certain.",
                            "verse 44:8": "There is no god except Him. He gives life and brings death. Your Lord and the Lord of your forefathers.",
                            "verse 44:9": "Nay, but they linger in doubt, playing.",
                            "verse 44:10": "So watch out for the day when the heaven will produce a visible smoke.",
                            "verse 44:11": "that will envelop the people: ‘This is a painful chastisement!",
                            "verse 44:12": "Our Lord, relieve us from the chastisement; indeed we have believed’.",
                            "verse 44:13": "How can there be a reminder for them, when already there has come to them a manifest Messenger,",
                            "verse 44:14": "but they turned away from him and said, ‘He has been taught; [he is] a madman!’",
                            "verse 44:15": "‘Indeed We will remove the chastisement a little. [But] you will indeed revert!’",
                            "verse 44:16": "The day when We shall assault with the most mighty assault; [then] indeed We shall take vengeance.",
                            "verse 44:17": "And certainly We tried before them the people of Pharaoh, when a messenger came to them, who was honoured,",
                            "verse 44:18": "[saying], ‘Give over to me, servants of God; indeed I am for you a messenger [who is] faithful’,",
                            "verse 44:19": "and, ‘Do not rebel against God. Lo! I bring you a clear warrant’.",
                            "verse 44:20": "‘And truly I seek refuge in my Lord and your Lord, lest you should stone me.",
                            "verse 44:21": "And if you do not believe me, then stay away from me’.",
                            "verse 44:22": "So he called to his Lord, saying, ‘These are indeed a guilty lot!’",
                            "verse 44:23": "‘Then set out with My servants by night; for you will assuredly be pursued.",
                            "verse 44:24": "And leave the sea behind at rest: indeed they will be a drowned host’.",
                            "verse 44:25": "How many gardens and fountains did they leave behind,",
                            "verse 44:26": "as well as sown fields and many a glorious residence,",
                            "verse 44:27": "and the bounty in which they rejoiced!",
                            "verse 44:28": "So [it was] and We made these an inheritance for another people.",
                            "verse 44:29": "So neither the heaven nor the earth wept for them; nor were they reprieved.",
                            "verse 44:30": "And verily We delivered the Children of Israel from the humiliating chastisement,",
                            "verse 44:31": "from Pharaoh. Truly he was a tyrant of the wanton ones.",
                            "verse 44:32": "And verily We chose them with a knowledge over [all] the worlds.",
                            "verse 44:33": "And We gave them signs in which there was a manifest trial.",
                            "verse 44:34": "Indeed these ones say,",
                            "verse 44:35": "‘It is nothing more than our first death, and we shall not be resurrected.",
                            "verse 44:36": "Bring us then our fathers, if you are being truthful’.",
                            "verse 44:37": "Are they better, or the people of Tubba’ and those before them? We destroyed [them]; indeed they were criminals.",
                            "verse 44:38": "And We did not create the heavens and the earth and all that is between them, [intending] to play.",
                            "verse 44:39": "We did not create them, except with the truth; but most of them do not know.",
                            "verse 44:40": "Assuredly the Day of Decision will be the tryst for all of them,",
                            "verse 44:41": "the day when a friend will not avail a friend anything, nor will they be helped,",
                            "verse 44:42": "except for him on whom God has mercy. He is indeed the Mighty, the Merciful.",
                            "verse 44:43": "Lo! the tree of Zaqqūm",
                            "verse 44:44": "will be the food of the sinful.",
                            "verse 44:45": "Like molten copper it will boil inside the bellies,",
                            "verse 44:46": "as the boiling of boiling water.",
                            "verse 44:47": "‘Seize him and drag him to the midst of Hell-fire.",
                            "verse 44:48": "Then pour over his head the torture of boiling water!’",
                            "verse 44:49": "‘Taste! Indeed you are the mighty, the noble one!",
                            "verse 44:50": "This is indeed that which you used to doubt’.",
                            "verse 44:51": "Assuredly the God-fearing will be in a secure place,",
                            "verse 44:52": "amid gardens and springs,",
                            "verse 44:53": "dressed in fine silk and [heavy] silk brocade, sitting face to face.",
                            "verse 44:54": "So [shall it be]; and We shall pair them with houris of beautiful eyes.",
                            "verse 44:55": "They will call therein every fruit, [remaining] secure.",
                            "verse 44:56": "They will not taste death therein, other than the first death. And He will shield them from the chastisement of Hell-fire —",
                            "verse 44:57": "a bounty from your Lord. That is the supreme triumph.",
                            "verse 44:58": "For We have made it easy in your tongue that perhaps they may remember.",
                            "verse 44:59": "So be on the look out. Indeed they [too] are on the look out."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 44:1": "Ha-Mim. (Only Allah and the Messenger [blessings and peace be upon him] know the real meaning.)",
                            "verse 44:2": "By this Light-Giving Book,",
                            "verse 44:3": "Surely, We have sent it down in a blessed night. Surely, We are the Warner.",
                            "verse 44:4": "In this (night) judgment is given on all matters of wisdom (separately),",
                            "verse 44:5": "By Our command; surely, it is We Who send.",
                            "verse 44:6": "(It) is mercy from your Lord. Verily, He is All-Hearing, All-Knowing,",
                            "verse 44:7": "The Lord of the heavens and the earth and all that is between them, provided you have faith with certitude.",
                            "verse 44:8": "There is no God but He. He is the One Who gives life and causes death. He is your Lord and the Lord of your fathers (as well).",
                            "verse 44:9": "Yet they are in doubt, busy playing.",
                            "verse 44:10": "So wait for the Day when the sky will cause a clear smoke to appear,",
                            "verse 44:11": "Which will envelop people (i.e., will encompass everything). That will be a painful torment.",
                            "verse 44:12": "(They will then say:) ‘O our Lord! Remove this torment from us. Surely, we believe.’",
                            "verse 44:13": "How can their acceptance of the admonition now be (of any use), whereas there came to them a Messenger with a clear exposition?",
                            "verse 44:14": "But they turned their faces from him and (denigrating) they said: ‘(He) is a tutored madman.’",
                            "verse 44:15": "Indeed, We remove the torment a little (but) you will certainly reiterate (the same disbelief).",
                            "verse 44:16": "The Day when We will seize with the Greatest Seizure, (that Day) We shall certainly exact revenge.",
                            "verse 44:17": "And in fact, We put to trial the people of Pharaoh (also) before them and the exalted Messenger (Musa [Moses]) came to them.",
                            "verse 44:18": "(He said:) ‘Hand over to me the servants of Allah (the Children of Israel). Verily, I am a trusted Messenger for your guidance and leadership.",
                            "verse 44:19": "And do not rebel against Allah. I have come to you with the enlightening proof.",
                            "verse 44:20": "And I have indeed sought the protection of my Lord and your Lord lest you should stone me.",
                            "verse 44:21": "And if you do not believe in me, then keep away from me.’",
                            "verse 44:22": "Then he prayed to his Lord: ‘Surely, they are a sinful people.’",
                            "verse 44:23": "(Allah said:) ‘Then set out with My servants by night. You shall certainly be chased.",
                            "verse 44:24": "And (after you pass through) leave the river still and split open. Surely, they are an army who will be drowned.’",
                            "verse 44:25": "How many a garden and spring they left behind!",
                            "verse 44:26": "And green crops and magnificent buildings!",
                            "verse 44:27": "And blessings (and comforts) in which they used to luxuriate!",
                            "verse 44:28": "So it happened! We made another people the inheritors of all that.",
                            "verse 44:29": "Then neither the heaven nor the earth wept over them, nor were they given respite.",
                            "verse 44:30": "And verily, We delivered the Children of Israel from a humiliating suffering,",
                            "verse 44:31": "From Pharaoh. Indeed, he was of the most rebellious transgressors.",
                            "verse 44:32": "And surely, We chose them (the Children of Israel) above (their contemporary civilizations of) the world on the basis of knowledge.",
                            "verse 44:33": "And We bestowed upon them signs containing an obvious favour (and a clear trial).",
                            "verse 44:34": "Surely, they say:",
                            "verse 44:35": "‘There is nothing after our first death and we shall not be raised up (again).",
                            "verse 44:36": "So bring back our ancestors (alive) if you are truthful.’",
                            "verse 44:37": "Well, are they better or the people of Tubba‘ (the people of As‘ad Abu Kurib al-Himyari, the King of Yemen) and those who were before them? We destroyed (all of) them. Surely, they were people given to evildoing.",
                            "verse 44:38": "And We have not created the heavens and the earth and all that is between them merely in sport.",
                            "verse 44:39": "We have created them both with (the purpose and reason) of truth. But most of them do not know.",
                            "verse 44:40": "Surely, the Day of Judgment is the appointed time for all of them;",
                            "verse 44:41": "The Day when a friend shall not avail a friend at all, nor will they be helped,",
                            "verse 44:42": "Except those to whom Allah has shown mercy. (They will intercede for one another.) Surely, He is Almighty, Ever-Merciful.",
                            "verse 44:43": "Indeed, the tree bearing thorny fruit,",
                            "verse 44:44": "Will be the food of the major sinners.",
                            "verse 44:45": "It will boil in the bellies like molten copper,",
                            "verse 44:46": "Like the seething of simmering water.",
                            "verse 44:47": "(It will be commanded:) ‘Seize him and drag him forcefully to the midst of Hell,",
                            "verse 44:48": "Then torment him by pouring boiling water over his head.",
                            "verse 44:49": "Taste it! Yes, you it is, the respectable and venerable (in your notion and claim).",
                            "verse 44:50": "Certainly, this is the very Hell you used to doubt.’",
                            "verse 44:51": "Assuredly, the Godfearing will be in a place of calm and peace,",
                            "verse 44:52": "Amid gardens and springs,",
                            "verse 44:53": "Dressed in fine silk and heavy brocade, facing one another.",
                            "verse 44:54": "So will it happen! And We shall marry them to fair maidens having lovely wide eyes.",
                            "verse 44:55": "(Sitting) there, they will call calmly for every kind of fruit.",
                            "verse 44:56": "There (in Paradise) they will not taste death except the first death (which would have passed). And Allah will save them from the torment of Hell.",
                            "verse 44:57": "It is a bounty of your Lord (i.e., your Lord will bestow through your mediation alone). That is but a great success.",
                            "verse 44:58": "So We have made this (Qur’an) easy in your own tongue so that they may take advice.",
                            "verse 44:59": "So wait. Certainly, they (too) are waiting. (You will see Our revenge and their evil end, and they will see your glory and My favours to the believers through your mediation.)"
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Ylistetty, kunnian Jumala!",
                            "verse 44:2": "Pitäkää arvossa Kirjoitus, joka tuo ilmi totuuden.",
                            "verse 44:3": "Totisesti olemme ilmoittanut sen siunattuna yönä; Me totisesti varoitamme herkeämättä.",
                            "verse 44:4": "Siinä kaikki viisaus selvitetään,",
                            "verse 44:5": "niinkuin Me käskemme; totisesti, Me lähetämme sananjulistajat,",
                            "verse 44:6": "armona, joka on lähtöisin Herrastasi; Hän on totisesti kuuleva, tietävä,",
                            "verse 44:7": "Herra taivaassa ja maan päällä sekä niiden välillä. Jospa te sen uskoisitte!",
                            "verse 44:8": "Ei ole muuta Jumalaa kuin Hän; Hän antaa elämän ja tuottaa kuoleman, sinun ja muinaisten esi-isiesi Herra.",
                            "verse 44:9": "Ei, he epäilevät, he tekevät pilkkaa.",
                            "verse 44:10": "Jääkää siis odottamaan sitä päivää, jolloin taivas lähettää suuren savupilven,",
                            "verse 44:11": "joka yllättää ihmiset. Se on tuskallinen rangaistus.",
                            "verse 44:12": "»Herra, poista meiltä rangaistus! Totisesti, me uskomme.»",
                            "verse 44:13": "Miten heitä siis pitää muistuttaa? Heidän luokseen tuli jo sananjulistaja, joka ilmoitti heille totuuden,",
                            "verse 44:14": "mutta he käänsivät hänelle selkänsä sanoen: »Toisten opettama, hullu.»",
                            "verse 44:15": "Me viivytämme rangaistusta vähän aikaa, mutta te tulette varmasti palaamaan vääryyteen.",
                            "verse 44:16": "Päivänä, jolloin Me tartumme heihin väkevällä otteella, Me totisesti määräämme koston.",
                            "verse 44:17": "Ennen heitä panimme totisesti faraon kansan koetukselle, ja sen luokse tuli jalo sananjulistaja",
                            "verse 44:18": "sanoen: »Luovuttakaa minulle Jumalan palvelijat, olen totisesti teidän uskollinen sananjulistajanne.",
                            "verse 44:19": "Älkää nousko Jumalaa vastaan. Minä tulen totisesti luoksenne selvin valtuuksin;",
                            "verse 44:20": "etsin turvaa Häneltä, joka on minun ja teidän Herranne, jotta ette surmaisi minua,",
                            "verse 44:21": "ja ellette usko minua, niin poistukaa luotani!»",
                            "verse 44:22": "Ja hän kutsui avuksi Herraansa, koska he olivat syntisiä.",
                            "verse 44:23": "Lähde siis matkaan palvelijoitteni kanssa öiseen aikaan; teitä tullaan varmasti ajamaan takaa,",
                            "verse 44:24": "mutta jätä meri välillenne. Heidän sotajoukkonsa on totisesti hukkuva.»",
                            "verse 44:25": "Kuinka monta puutarhaa ja lähdettä he saivatkaan jättää jälkeensä,",
                            "verse 44:26": "viljavainioita ja ihania asumuksia",
                            "verse 44:27": "ja hyvinvoinnin, josta he iloitsivat.",
                            "verse 44:28": "Näin kävi, ja Me annoimme sen perinnöksi muille ihmisille.",
                            "verse 44:29": "Mutta ei taivas eikä maa itkenyt heidän tähtensä, eikä heidän tuomionsa täytäntöönpanoa siirretty.",
                            "verse 44:30": "Totisesti Me vapahdimme Israelin lapset häpeällisestä kurituksesta",
                            "verse 44:31": "ja faraosta. Hän oli ylpeä ja kuului häikäilemättömien joukkoon.",
                            "verse 44:32": "Totisesti Me kaikkiviisaudessamme valitsimme heidät kaikista kansakunnista",
                            "verse 44:33": "ja annoimme heille ilmoituksemme, joka sisälsi selvän koetuksen.",
                            "verse 44:34": "Totisesti nämä sanovat:",
                            "verse 44:35": "»Ei ole muuta kuin ensimmäinen kuolemamme, eikä meitä herätetä uuteen eloon",
                            "verse 44:36": "Herättäkääpä meille takaisin isämme, jos puhutte totta!»",
                            "verse 44:37": "Kuka on parempi, hekö vai Tubban kansa ja ne, jotka elivät ennen heitä? Me kukistimme heidät, sillä totisesti he tekivät syntiä.",
                            "verse 44:38": "Me emme vain huvin vuoksi ole luonut taivaita ja maata sekä mitä niiden välillä on,",
                            "verse 44:39": "vaan Me olemme luonut ne täydellä todella, mutta useimmat heistä ovat tietoa vailla.",
                            "verse 44:40": "Totisesti, ratkaisun päivä on heille kaikille määrätty,",
                            "verse 44:41": "se päivä, jolloin ystävä ei ole ystävälle hyödyksi eivätkä he saa lainkaan apua,",
                            "verse 44:42": "paitsi ne, joita Jumala armahtaa. Hän on totisesti mahtava, armollinen.",
                            "verse 44:43": "Totisesti on Zakkuum-puu",
                            "verse 44:44": "syntisten ravintoa.",
                            "verse 44:45": "Kuin öljysakka se kiehuu heidän vatsassaan,",
                            "verse 44:46": "niinkuin kuuma vesi kiehuu.",
                            "verse 44:47": "»Ottakaa hänet kiinni ja raahatkaa hänet keskelle helvettiä!",
                            "verse 44:48": "Kaatakaa sitten hänen päänsä yli kiehuvaa vettä hänelle piinaksi!",
                            "verse 44:49": "»Maista, sinä mahtava ja kunnianarvoisa!»",
                            "verse 44:50": "Totisesti, tämä on se rangaistus, jota te epäilitte.",
                            "verse 44:51": "Totisesti ne, jotka karttavat pahaa, ovat turvallisessa paikassa,",
                            "verse 44:52": "puutarhoissa ja lähteiden partaalla,",
                            "verse 44:53": "puettuina silkkiin ja samettiin, ja katsoen toisiaan kasvoista kasvoihin.",
                            "verse 44:54": "Niin on oleva, ja Me yhdistämme heidät puhtaaseen, ihanaan kumppaniin.",
                            "verse 44:55": "Siellä turvassa on heille tarjolla kaikenlaisia hedelmiä,",
                            "verse 44:56": "ensimmäisen kuoleman lisäksi he eivät siellä maista kuolemaa, ja Hän säästää heiltä helvetin piinan",
                            "verse 44:57": "Herrasi armosta; tämä on suuri autuus.",
                            "verse 44:58": "Me olemme tehnyt sen helposti tajuttavaksi omalla kielelläsi, jotta he ottaisivat varoituksesta vaarin.",
                            "verse 44:59": "Odota siis! Totisesti hekin odottavat."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 44:1": "Hâ. Mîm.",
                            "verse 44:2": "Par le Livre explicite !",
                            "verse 44:3": "En vérité, Nous l'avons fait descendre durant une nuit bénie. Certes, Nous voulions lancer un avertissement.",
                            "verse 44:4": "En cette nuit, tout ordre sage est clairement décrété,",
                            "verse 44:5": "comme un ordre venant de Nous. Certes, c'est Nous qui avons décidé d'envoyer",
                            "verse 44:6": "une miséricorde venue de ton Seigneur. Il est, en vérité, Celui qui entend tout, l'Omniscient,",
                            "verse 44:7": "le Seigneur des cieux et de la terre et de ce qui est entre les deux. Puissiez-vous croire avec certitude !",
                            "verse 44:8": "Il n'y a de dieu que Lui. Il donne la vie et Il donne la mort. Il est votre Seigneur et le Seigneur de vos premiers ancêtres.",
                            "verse 44:9": "Et pourtant, ils sont dans le doute et ils s'amusent.",
                            "verse 44:10": "Guette donc le jour où le ciel produira une fumée bien visible",
                            "verse 44:11": "qui enveloppera les hommes. Ce sera un châtiment douloureux !",
                            "verse 44:12": "\" Notre Seigneur, s'écrieront-ils, éloigne de nous le châtiment ! Vraiment, nous sommes croyants ! \"",
                            "verse 44:13": "Comment le Rappel pourrait-il les toucher alors qu'un envoyé est déjà venu à eux avec des preuves évidentes ?",
                            "verse 44:14": "Ils se sont détournés de lui, disant : \" C'est un endoctriné, un possédé \".",
                            "verse 44:15": "Oui, Nous allons ajourner quelque peu le châtiment, mais vous récidiverez certainement.",
                            "verse 44:16": "Un jour Nous agirons avec une grande violence, et ce sera Notre vengeance.",
                            "verse 44:17": "Avant eux, Nous avons éprouvé le peuple de Pharaon à qui fut envoyé un noble messager.",
                            "verse 44:18": "\" Remettez-moi les serviteurs de Dieu, leur dit-il ; je suis, pour vous, un envoyé digne de confiance.",
                            "verse 44:19": "Ne vous élevez pas contre Dieu. Je viens à vous nanti d'une autorité incontestable.",
                            "verse 44:20": "J'ai pris refuge en mon Seigneur et en votre Seigneur, de peur que vous ne me lapidiez.",
                            "verse 44:21": "Et si vous ne me faites pas confiance, laissez-moi partir ! \"",
                            "verse 44:22": "Il implora son Seigneur : \" Ces gens sont des scélérats ! \"",
                            "verse 44:23": "\" Pars de nuit avec Mes serviteurs. Vous serez certainement poursuivis,",
                            "verse 44:24": "mais laisse la mer s'ouvrir, car leur armée sera noyée \".",
                            "verse 44:25": "Combien ont-ils abandonné de jardins, de sources,",
                            "verse 44:26": "de champs cultivés, de somptueuses demeures,",
                            "verse 44:27": "de délices dans lesquels ils se complaisaient.",
                            "verse 44:28": "Il en fut ainsi, et Nous en avons fait hériter un autre peuple.",
                            "verse 44:29": "Ni le ciel ni la terre n'ont pleuré sur eux, et il ne leur a pas été accordé de délai.",
                            "verse 44:30": "Ainsi, Nous avons délivré les fils d'Israël du châtiment ignominieux",
                            "verse 44:31": "et de Pharaon, qui était hautain d'entre les transgresseurs.",
                            "verse 44:32": "Nous les avons choisis, en toute connaissance, parmi les peuples de l'univers,",
                            "verse 44:33": "et Nous leur avons apporté des signes qui contenaient une épreuve évidente.",
                            "verse 44:34": "Voici des gens qui disent :",
                            "verse 44:35": "\" Il n'y a que notre première mort, et nous ne serons pas ressuscités.",
                            "verse 44:36": "Faites donc revenir nos ancêtres, si vous êtes véridiques ! \"",
                            "verse 44:37": "Sont-ils meilleurs que le peuple de Tubba' et que leurs prédécesseurs, que Nous avons anéantis parce qu'ils étaient coupables ?",
                            "verse 44:38": "Ce n'est pas par jeu que Nous avons créé les cieux, la terre et ce qui est entre les deux.",
                            "verse 44:39": "Nous ne les avons créés que par la Vérité, mais la plupart d'entre eux ne savent pas.",
                            "verse 44:40": "Certes, le Jour de la Décision est le terme fixé pour tous les hommes,",
                            "verse 44:41": "le Jour où un ami ne pourra en rien aider un ami et où nul ne sera secouru,",
                            "verse 44:42": "sauf celui à qui Dieu fera miséricorde. Il est, en vérité, le Puissant, le Clément.",
                            "verse 44:43": "Certes, l'arbre de Zaqqoum",
                            "verse 44:44": "est l'aliment du pécheur.",
                            "verse 44:45": "Il bout dans les entrailles comme du métal en fusion,",
                            "verse 44:46": "comme bouillonne l'eau bouillante.",
                            "verse 44:47": "\" Saisissez-vous de lui et traînez-le au fond de la Fournaise,",
                            "verse 44:48": "puis versez sur sa tête le supplice d'eau bouillante ! \"",
                            "verse 44:49": "\" Goûte [le châtiment], toi qui te croyais puissant et noble ! \"",
                            "verse 44:50": "Voilà ce que vous mettiez en doute !",
                            "verse 44:51": "Ceux qui craignent Dieu seront dans une station sûre,",
                            "verse 44:52": "au milieu de jardins et de sources.",
                            "verse 44:53": "Ils seront vêtus de satin et de brocart et se feront face.",
                            "verse 44:54": "Telle sera leur condition, et Nous leur donnerons pour épouses des houris aux grands yeux.",
                            "verse 44:55": "Là, ils se feront servir toutes sortes de fruits, à l'abri de la crainte.",
                            "verse 44:56": "Ils n'y goûteront pas la mort, sauf la première mort [déjà subie]. Dieu les a préservés du châtiment de la Fournaise.",
                            "verse 44:57": "C'est une grâce de ton Seigneur. Voilà le bonheur suprême !",
                            "verse 44:58": "Nous n'en avons facilité l'accès en l'exprimant dans ta langue que pour qu'ils réfléchissent.",
                            "verse 44:59": "Sois donc vigilant, car eux aussi sont vigilants !"
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 44:1": "Ha, Mim.",
                            "verse 44:2": "Par le Livre (le Coran) explicite",
                            "verse 44:3": "Nous l’avons fait descendre en une nuit bénie, Nous sommes en vérité Celui qui avertit,",
                            "verse 44:4": "durant laquelle est décidé tout ordre sage,",
                            "verse 44:5": "c’est là un commandement venant de Nous. C’est Nous qui envoyons [les Messagers],",
                            "verse 44:6": "à titre de miséricordieux de la part de ton Seigneur, car c’est Lui l’Audient, l’Omniscient,",
                            "verse 44:7": "Seigneur des cieux et de la terre et de ce qui est entre eux, si seulement vous pouviez en avoir la conviction.",
                            "verse 44:8": "Point de divinité à part Lui. Il donne la vie et donne la mort, et Il est votre Seigneur et le Seigneur de vos premiers ancêtres.",
                            "verse 44:9": "Mais ces gens-là, dans le doute, s’amusent.",
                            "verse 44:10": "Et bien, attends le jour où le ciel apportera une fumée visible",
                            "verse 44:11": "qui couvrira les gens. Ce sera un châtiment douloureux.",
                            "verse 44:12": "«Seigneur, éloigne de nous le châtiment. Car [à présent] nous croyons».",
                            "verse 44:13": "D’où leur vient cette prise de conscience alors qu’un Messager explicite leur est déjà venu,",
                            "verse 44:14": "Puis ils s’en détournèrent en disant : «C’est un homme instruit [par d’autres], un possédé».",
                            "verse 44:15": "Nous dissiperons le châtiment pour peu de temps; car vous récidiverez.",
                            "verse 44:16": "Le jour où Nous userons de la plus grande violence et Nous Nous vengerons.",
                            "verse 44:17": "Et avant eux, Nous avons déjà éprouvé le peuple de Pharaon, quand un noble Messager leur était venu ,",
                            "verse 44:18": "[leur disant]: «Livrez-moi les serviteurs de Dieu ! Je suis pour vous un Messager digne de confiance.",
                            "verse 44:19": "Ne vous montrez pas hautains vis-à-vis de Dieu, car je vous apporte une preuve évidente.",
                            "verse 44:20": "Et je cherche protection auprès de mon Seigneur et votre Seigneur, pour que vous ne me lapidiez pas.",
                            "verse 44:21": "Si vous ne voulez pas croire en moi, éloignez-vous de moi».",
                            "verse 44:22": "Il invoqua alors son Seigneur : «Ce sont des gens criminels».",
                            "verse 44:23": "«Voyage de nuit avec Mes serviteurs; vous serez poursuivis .",
                            "verse 44:24": "Laisse la mer calme; [telle que tu l’as franchie] ce sont, des armées [voués] à la noyade».",
                            "verse 44:25": "Que de jardins et de sources ils laissèrent [derrière eux]",
                            "verse 44:26": "que de champs et de superbes résidences,",
                            "verse 44:27": "que de délices au sein desquels ils réjouissaient.",
                            "verse 44:28": "Il en fut ainsi et Nous fîmes qu’un autre peuple en hérita.",
                            "verse 44:29": "Ni le ciel ni la terre ne les pleurèrent et ils n’eurent aucun délai.",
                            "verse 44:30": "Et certes, Nous sauvâmes les Enfants d’Israël du châtiment avilissant",
                            "verse 44:31": "de Pharaon qui était hautain et outrancier.",
                            "verse 44:32": "A bon escient Nous les choisîmes parmi tous les peuples de l’univers ,",
                            "verse 44:33": "et leur apportâmes des miracles de quoi les mettre manifestement à l’épreuve.",
                            "verse 44:34": "Ceux-là (les Mecquois) disent :",
                            "verse 44:35": "«Il n’y a pour nous qu’une mort, la première. Et nous ne seront pas ressuscités.",
                            "verse 44:36": "Faites donc revenir nos ancêtres, si vous êtes véridiques».",
                            "verse 44:37": "Sont-ils les meilleurs ou le peuple de Tubbaa et ceux qui les ont précédés ? Nous les avons fait périr parce que vraiment ils étaient criminels.",
                            "verse 44:38": "Ce n’est pas par divertissement que Nous avons créé les cieux et la terre et ce qui est entre eux.",
                            "verse 44:39": "Nous ne les avons créés qu’en toute vérité. Mais la plupart d’entre eux ne savent pas.",
                            "verse 44:40": "En vérité, le Jour de la Décision sera leur rendez-vous à tous,",
                            "verse 44:41": "Le jour où un allié ne sera d’aucune utilité à un [autre] allié; et ils ne seront point secourus non plus,",
                            "verse 44:42": "sauf celui qui Dieu fera miséricorde. Car c’est Lui, le Puissant, le Très Miséricordieux.",
                            "verse 44:43": "Certes l’arbre de Zakkoum",
                            "verse 44:44": "sera la nourriture du grand pécheur.",
                            "verse 44:45": "Comme du métal en fusion; il bouillonnera dans les ventres",
                            "verse 44:46": "comme le bouillonnement de l’eau surchauffée.",
                            "verse 44:47": "Qu’on le saisisse et qu’on l’emporte en plein dans la fournaise;",
                            "verse 44:48": "qu’on verse ensuite sur sa tête de l’eau bouillante comme châtiment.",
                            "verse 44:49": "Goûte ! Toi [qui prétendait être] le puissant, le noble.",
                            "verse 44:50": "Voilà ce dont vous doutiez.",
                            "verse 44:51": "Les pieux seront dans une demeure sûre,",
                            "verse 44:52": "parmi les jardins et des sources,",
                            "verse 44:53": "Ils porteront des vêtements de satin et de brocart et seront placés face à face.",
                            "verse 44:54": "54. C’est ainsi ! Et Nous leur donnerons pour épouses des houris aux grands yeux.",
                            "verse 44:55": "Ils y demanderont en toute quiétude toutes sortes de fruits.",
                            "verse 44:56": "Ils n’y goûteront pas à la mort sauf leur mort première. Et [Dieu] les protégera du châtiment de la Fournaise,",
                            "verse 44:57": "c’est là une grâce de ton Seigneur. Et c’est là l’énorme succès.",
                            "verse 44:58": "Nous ne l’avons facilité dans ta langue, qu’afin qu’ils se rappellent !",
                            "verse 44:59": "Attends donc. Eux aussi attendent."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Há Mím.",
                            "verse 44:2": "Bei dem deutlichen Buch,",
                            "verse 44:3": "Wahrlich, Wir offenbarten es in einer gesegneten Nacht, - wahrlich, Wir haben immer gewarnt -,",
                            "verse 44:4": "In der jegliche weise Sache bis ins einzelne erklärt wird",
                            "verse 44:5": "Gemäß Unserem Befehl. Wahrlich, Wir haben stets Gesandte geschickt",
                            "verse 44:6": "Als eine Barmherzigkeit von deinem Herrn -, Er ist der Allhörende, der Allwissende -,",
                            "verse 44:7": "Dem Herrn der Himmel und der Erde und alles dessen, was zwischen beiden ist, wenn ihr Gewißheit im Glauben hättet.",
                            "verse 44:8": "Es gibt keinen Gott außer Ihm. Er gibt Leben und Tod - euer Herr und der Herr eurer Vorväter.",
                            "verse 44:9": "Und doch sind sie im Zweifel, treiben Spiel.",
                            "verse 44:10": "Du aber erwarte den Tag, an dem der Himmel einen sichtbaren Rauch hervorbringt,",
                            "verse 44:11": "Der die Menschen einhüllen wird. Das wird eine schmerzliche Qual sein.",
                            "verse 44:12": "«Unser Herr, nimm von uns die Pein; wir wollen glauben.»",
                            "verse 44:13": "Wie können sie lernen, wenn ein aufklärender Gesandter zu ihnen gekommen ist,",
                            "verse 44:14": "Und sie haben sich von ihm abgewandt und gesprochen: «Ein Unterrichteter, ein Besessener»?",
                            "verse 44:15": "«Wir werden die Strafe für ein weniges hinwegnehmen, ihr aber werdet rückfällig sein.",
                            "verse 44:16": "An dem Tage, wo Wir (euch) streng anfassen werden, werden Wir vergelten »",
                            "verse 44:17": "Und Wir haben schon das Volk Pharaos vor ihnen geprüft, und es kam zu ihnen ein ehrenwerter Gesandter,",
                            "verse 44:18": "(Der sprach:) «Übergebt mir die Diener Allahs. Ich bin euch ein vertrauenswürdiger Gesandter.",
                            "verse 44:19": "Und überhebt euch nicht gegen Allah. Ich komme zu euch mit offenkundigem Beweis.",
                            "verse 44:20": "Und ich nehme meine Zuflucht bei meinem Herrn und eurem Herrn, auf daß ihr mich nicht steinigt.",
                            "verse 44:21": "Und wenn ihr mir nicht glaubt, so haltet euch fern von mir.»",
                            "verse 44:22": "Dann betete er zu seinem Herrn (und sprach): «Diese sind ein sündhaftes Volk.»",
                            "verse 44:23": "(Gott sprach:) «Nimm Meine Diener des Nachts hinfort; ihr werdet verfolgt werden.",
                            "verse 44:24": "Und verlasse das Meer (wenn es) reglos ist. Sie sind ein Heer, sie werden ertränkt.»",
                            "verse 44:25": "Wie zahlreich waren die Gärten und die Quellen, die sie zurückließen!",
                            "verse 44:26": "Und die Kornfelder und die ehrenvollen Stätten!",
                            "verse 44:27": "Und die Annehmlichkeiten, die sie genossen!",
                            "verse 44:28": "So geschah's. Und Wir gaben diese Dinge einem andern Volk zum Erbe.",
                            "verse 44:29": "Und Himmel und Erde weinten nicht über sie, noch ward ihnen Frist gegeben.",
                            "verse 44:30": "Und Wir erretteten die Kinder Israels vor der schimpflichen Pein",
                            "verse 44:31": "Vor Pharao; denn er war hochmütig, einer der Maßlosen.",
                            "verse 44:32": "Und Wir erwählten sie, auf Grund (Unseres) Wissens, vor den Völkern.",
                            "verse 44:33": "Und Wir gaben ihnen eines der Zeichen, in welchem eine offenkundige Prüfung war.",
                            "verse 44:34": "Fürwahr, diese behaupten:",
                            "verse 44:35": "«Es gibt nur unseren ersten Tod, und wir werden nicht wiedererweckt werden.",
                            "verse 44:36": "So bringt doch unsere Väter (zurück), wenn ihr die Wahrheit redet!»",
                            "verse 44:37": "Sind sie besser oder das Volk da Tubba und jene, die vor ihnen waren? Wir vertilgten sie, denn sie waren Sünder.",
                            "verse 44:38": "Und Wir schufen die Himmel und die Erde, und was zwischen beiden ist, nicht im Spiel.",
                            "verse 44:39": "Wir erschufen sie allein in Weisheit, jedoch die meisten von ihnen verstehen es nicht.",
                            "verse 44:40": "Der Tag der Entscheidung ist die festgesetzte Zeit für sie alle,",
                            "verse 44:41": "Der Tag, an dem der Freund dem Freunde nichts nützen kann, noch sollen sie Hilfe finden,",
                            "verse 44:42": "Die ausgenommen, deren Allah Sich erbarmt; denn Er ist der Allmächtige, der Barmherzige.",
                            "verse 44:43": "Siehe, der Baum Saqqüm",
                            "verse 44:44": "Ist die Speise des Sünders.",
                            "verse 44:45": "Wie geschmolzenes Erz wird er brodeln in (ihren) Bäuchen,",
                            "verse 44:46": "Wie das Brodeln kochenden Wassers.",
                            "verse 44:47": "«Ergreift ihn und zerrt ihn in die Mitte des flammenden Feuers;",
                            "verse 44:48": "Dann gießet auf sein Haupt die Pein des siedenden Wassers.",
                            "verse 44:49": "Koste! Du hieltest dich für den Mächtigen, den Angesehenen.",
                            "verse 44:50": "Siehe, dies ist nun das, woran ihr zu zweifeln pflegtet.»",
                            "verse 44:51": "Wahrlich, die Rechtschaffenen werden in einer Stätte der Sicherheit sein,",
                            "verse 44:52": "Unter Gärten und Quellen:",
                            "verse 44:53": "Gekleidet in feine Seide und schweren Brokat, einander gegenüber sitzend.",
                            "verse 44:54": "So (wird es sein). Und Wir werden sie mit holdseligen Mädchen vermählen, die große, herrliche Augen haben.",
                            "verse 44:55": "Sie werden dort nach Früchten jeder Art rufen, in Frieden und Sicherheit.",
                            "verse 44:56": "Den Tod werden sie dort nicht kosten, außer dem ersten Tod. Und Er wird sie vor der Strafe des flammenden Feuers bewahren,",
                            "verse 44:57": "Als eine Gnade von deinem Herrn. Das ist die höchste Glückseligkeit.",
                            "verse 44:58": "Wir haben ihn (den Koran) leicht gemacht in deiner Zunge, damit sie sich ermahnen lassen.",
                            "verse 44:59": "Warte drum; auch sie warten."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "gk ehe",
                            "verse 44:2": "okt+s, o jkS’ku fdrkc ¼dq+jku½ dh d+le",
                            "verse 44:3": "geus bldks eqckjd jkr ¼Ócs d+nz½ esa ukft+y fd;k cs’kd ge ¼vt+kc ls½ Mjkus okys Fks",
                            "verse 44:4": "blh jkr dks reke nqfu;k ds fgd+er o elysgr ds ¼lky Hkj ds½ dke Q+Slys fd;s tkrs gSa",
                            "verse 44:5": ";kfu gekjs ;gk¡ ls gqDe gksdj ¼cs’kd½ ge gh ¼iSx+Ecjksa ds½ Hkstus okys gSa",
                            "verse 44:6": ";s rqEgkjs ijojfnxkj dh esgjckuh gS] og cs’kd cM+k lquus okyk okfd+Q+dkj gS",
                            "verse 44:7": "lkjs vkleku o t+ehu vkSj tks dqN bu nksuksa ds njfe;ku gS lcdk ekfyd",
                            "verse 44:8": "vxj rqeesa ;d+hu djus dh lykfg;r gS ¼rks djks½ mlds flok dksbZ ekcwn ugha & ogh ftykrk gS ogh ekjrk gS rqEgkjk ekfyd vkSj rqEgkjs ¼vxys½ cki nknkvksa dk Hkh ekfyd gS",
                            "verse 44:9": "ysfdu ;s yksx rks Ód esa iM+s [ksy jgs gSa",
                            "verse 44:10": "rks rqe ml fnu dk bUrst+kj djks fd vkleku ls t+kfgj c t+kfgj /kqvk¡ fudysxk",
                            "verse 44:11": "¼vkSj½ yksxksa dks <k¡d ysxk ;s nnZukd vt+kc gS",
                            "verse 44:12": "dq¶+Q+kj Hkh ?kcjkdj dgsaxs fd ijojfnxkj gels vt+kc dks nwj nQ+k dj ns ge Hkh bZeku ykrs gSa",
                            "verse 44:13": "¼ml oD+r½ Hkyk D;k mudks ulhgr gksxh tc muds ikl iSx+Ecj vk pqds tks lkQ+ lkQ+ c;ku dj nsrs Fks",
                            "verse 44:14": "bl ij Hkh mu yksxksa us mlls eq¡g Qsjk vkSj dgus yxs ;s rks ¼fl[kk;k½ i<+k;k gqvk nhokuk gS",
                            "verse 44:15": "¼vPNk [k+Sj½ ge FkksM+s fnu ds fy, vt+kc dks Vky nsrs gSa exj ge tkurs gSa rqe t+:j fQj dqÝ djksxs",
                            "verse 44:16": "ge cs’kd ¼muls½ iwjk cnyk rks cl ml fnu ysxsa ftl fnu l[+r idM+ idM+saxs",
                            "verse 44:17": "vkSj muls igys geus d+kSes fQjvkÅu dh vkt+ekb’k dh vkSj muds ikl ,d vkyh d+nj iSx+Ecj ¼ewlk½ vk,",
                            "verse 44:18": "¼vkSj dgk½ fd [+kqnk ds cUnksa ¼cuh bljkbZy½ dks esjs gokys dj nks eSa ¼[+kqnk dh rjQ ls½ rqEgkjk ,d vekurnkj iSx+Ecj gw¡",
                            "verse 44:19": "vkSj [+kqnk ds lkeus ljd’kh u djks eSa rqEgkjs ikl okt+s, o jkS’ku nyhysa ys dj vk;k gw¡",
                            "verse 44:20": "vkSj bl ckr ls fd rqe eq>s laxlkj djks eSa vius vkSj rqEgkjs ijojfnxkj ¼[+kqnk½ dh iukg ekaxrk gw¡",
                            "verse 44:21": "vkSj vxj rqe eq> ij bZeku ugha yk, rks rqe eq>ls vyx gks tkvks",
                            "verse 44:22": "¼exj og lqukus yxs½ rc ewlk us vius ijojfnxkj ls nqvk dh fd ;s cM+s Ójhj yksx gSa",
                            "verse 44:23": "rks [+kqnk us gqDe fn;k fd rqe esjs cUnksa ¼cuh bljkbZy½ dks jkrksa jkr ysdj pys tkvks vkSj rqEgkjk ihNk Hkh t+:j fd;k tk,xk",
                            "verse 44:24": "vkSj nfj;k dks viuh gkyr ij Bgjk gqvk NksM+ dj ¼ikj gks½ tkvks ¼rqEgkjs ckn½ mudk lkjk y’kdj Mqcks fn;k tk,xk",
                            "verse 44:25": "og yksx ¼[+kqnk tkus½ fdrus ckx+ vkSj p’esa vkSj [ksfr;k¡",
                            "verse 44:26": "vkSj uQhl edkukr vkSj vkjke dh pht+sa",
                            "verse 44:27": "ftuesa og ,s’k vkSj pSu fd;k djrs Fks NksM+ x;s ;w¡ gh gqvk",
                            "verse 44:28": "vkSj mu reke pht+ksa dk nwljs yksxksa dks ekfyd cuk fn;k",
                            "verse 44:29": "rks mu yksxksa ij vkleku o t+ehu dks Hkh jksuk u vk;k vkSj u mUgsa eksgyr gh nh x;h",
                            "verse 44:30": "vkSj geus cuh bljkbZy dks ft+Yyr ds vt+kc ls fQjvkÅu ¼ds iUts½ ls utkr nh",
                            "verse 44:31": "og cs’kd ljd’k vkSj gn ls ckgj fudy x;k Fkk",
                            "verse 44:32": "vkSj geus cuh bljkbZy dks le> cw> dj lkjs tgkWu ls cjxqt+hnk fd;k Fkk",
                            "verse 44:33": "vkSj geus mudks ,slh fu’kkfu;k¡ nh Fkha ftuesa ¼mudh½ ljhgh vkt+ekb’k Fkh",
                            "verse 44:34": ";s ¼dq¶+Q+kjs eDdk½ ¼eqlyekuksa ls½ dgrs gSa",
                            "verse 44:35": "fd gesa rks flQZ ,d ckj ejuk gS vkSj fQj ge nksckjk ¼ft+Unk djds½ mBk, u tk,¡xs",
                            "verse 44:36": "rks vxj rqe lPps gks rks gekjs cki nknkvksa dks ¼ft+Unk djds½ ys vkvks",
                            "verse 44:37": "Hkyk ;s yksx ¼d+wor esa½ vPNs gSa ;k rqCck dh d+kSe vkSj og yksx tks muls igys gks pqds geus mu lcdks gykd dj fn;k ¼D;ksafd½ og t+:j xqukgxkj Fks",
                            "verse 44:38": "vkSj geus lkjs vkleku o t+ehu vkSj tks pht+s mu nksuksa ds njfe;ku esa gSa mudks [ksyrs gq, ugha cuk;k",
                            "verse 44:39": "bu nksuksa dks geus cl Bhd ¼elygr ls½ iSnk fd;k exj muesa ds cgqrsjs yksx ugha tkurs",
                            "verse 44:40": "cs’kd Q+Slyk ¼d+;ker½ dk fnu mu lc ¼ds nksckj ft+Unk gksus½ dk eqd+jZj oD+r gS",
                            "verse 44:41": "ftl fnu dksbZ nksLr fdlh nksLr ds dqN dke u vk,xk vkSj u mu dh enn dh tk,xh",
                            "verse 44:42": "exj ftu ij [+kqnk jge Qjek, cs’kd og ¼[+kqnk½ lc ij x+kfyc cM+k jge djus okyk gS",
                            "verse 44:43": "¼vk[+ksjr esa½ FkksgM+ dk nj[+r",
                            "verse 44:44": "t+:j xqusgxkj dk [kkuk gksxk",
                            "verse 44:45": "tSls fi?kyk gqvk rkack og isVksa esa bl rjg mcky [kk,xk",
                            "verse 44:46": "tSls [kkSyrk gqvk ikuh mcky [kkrk gS",
                            "verse 44:47": "¼Qfj’rksa dks gqDe gksxk½ bldks idM+ks vkSj ?klhVrs gq, nkst+[k+ ds chpksa chp esa ys tkvks",
                            "verse 44:48": "fQj mlds lj ij [kkSyrs gq, ikuh dk vt+kc Mkyks fQj mlls rkvkuu dgk tk,xk vc et+k p[kks",
                            "verse 44:49": "cs’kd rw rks cM+k bT+t+r okyk ljnkj gS",
                            "verse 44:50": ";s ogh nkst+[+k rks gS ftlesa rqe yksx Ód fd;k djrs Fks",
                            "verse 44:51": "cs’kd ijgst+xkj yksx vEku dh txg",
                            "verse 44:52": "¼;kfu½ ckx+ksa vkSj p’eksa esa gksaxs",
                            "verse 44:53": "js’ke dh dHkh ckjhd+ vkSj dHkh ncht+ iks’kkdsa igus gq, ,d nwljs ds vkeus lkeus cSBs gksaxs",
                            "verse 44:54": ",slk gh gksxk vkSj ge cM+h cM+h vk¡[kksa okyh gwjksa ls muds tksM+s yxk nsaxs",
                            "verse 44:55": "ogk¡ bResuku ls gj fdLe ds esos eaxok dj [kk;saxs",
                            "verse 44:56": "ogk¡ igyh nQ+k dh ekSr ds flok mudks ekSr dh ry[k+h p[+kuh gh u iM+sxh vkSj [+kqnk mudks nkst+[k+ ds vt+kc ls egQwt+ j[ksxk",
                            "verse 44:57": "¼;s½ rqEgkjs ijojfnxkj dk Qt+y gS ;gh rks cM+h dke;kch gS",
                            "verse 44:58": "rks geus bl d++qjku dks rqEgkjh t+cku esa ¼blfy,½ vklku dj fn;k gS rkfd ;s yksx ulhgr idM+sa rks",
                            "verse 44:59": "¼urhts ds½ rqe Hkh eqUrft+j jgks ;s yksx Hkh eqUrft+j gSa"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Haa Miim.",
                            "verse 44:2": "Demi Kitab (Al Qur'an) yang menjelaskan,",
                            "verse 44:3": "sesungguhnya Kami menurunkannya pada suatu malam yang diberkahi dan sesungguhnya Kami-lah yang memberi peringatan.",
                            "verse 44:4": "Pada malam itu dijelaskan segala urusan yang penuh hikmah,",
                            "verse 44:5": "(yaitu) urusan yang besar dari sisi Kami. Sesungguhnya Kami adalah Yang mengutus rasul-rasul,",
                            "verse 44:6": "sebagai rahmat dari Tuhanmu. Sesungguhnya Dialah Yang Maha Mendengar lagi Maha Mengetahui,",
                            "verse 44:7": "Tuhan Yang memelihara langit dan bumi dan apa yang ada di antara keduanya, jika kamu adalah orang yang meyakini.",
                            "verse 44:8": "Tidak ada Tuhan (yang berhak disembah) melainkan Dia, Yang menghidupkan dan Yang mematikan. (Dialah) Tuhanmu dan Tuhan bapak-bapakmu yang terdahulu.",
                            "verse 44:9": "Tetapi mereka bermain-main dalam keragu-raguan.",
                            "verse 44:10": "Maka tunggulah hari ketika langit membawa kabut yang nyata,",
                            "verse 44:11": "yang meliputi manusia. Inilah azab yang pedih.",
                            "verse 44:12": "(Mereka berdoa): \"Ya Tuhan kami, lenyapkanlah dari kami azab itu. Sesungguhnya kami akan beriman.\"",
                            "verse 44:13": "Bagaimanakah mereka dapat menerima peringatan, padahal telah datang kepada mereka seorang rasul yang memberi penjelasan,",
                            "verse 44:14": "kemudian mereka berpaling daripadanya dan berkata: \"Dia adalah seorang yang menerima ajaran (dari orang lain) lagi pula seorang yang gila.",
                            "verse 44:15": "Sesungguhnya (kalau) Kami akan melenyapkan siksaan itu agak sedikit sesungguhnya kamu akan kembali (ingkar).",
                            "verse 44:16": "(Ingatlah) hari (ketika) Kami menghantam mereka dengan hantaman yang keras. Sesungguhnya Kami adalah Pemberi balasan.",
                            "verse 44:17": "Sesungguhnya sebelum mereka telah Kami uji kaum Firaun dan telah datang kepada mereka seorang rasul yang mulia,",
                            "verse 44:18": "(dengan berkata): \"Serahkanlah kepadaku hamba-hamba Allah (Bani Israel yang kamu perbudak). Sesungguhnya aku adalah utusan (Allah) yang dipercaya kepadamu,",
                            "verse 44:19": "dan janganlah kamu menyombongkan diri terhadap Allah. Sesungguhnya aku datang kepadamu dengan membawa bukti yang nyata.",
                            "verse 44:20": "Dan sesungguhnya aku berlindung kepada Tuhanku dan Tuhanmu, dari keinginanmu merajamku,",
                            "verse 44:21": "dan jika kamu tidak beriman kepadaku maka biarkanlah aku (memimpin Bani Israil)\".",
                            "verse 44:22": "Kemudian Musa berdoa kepada Tuhannya: \"Sesungguhnya mereka ini adalah kaum yang berdosa (segerakanlah azab kepada mereka)\".",
                            "verse 44:23": "(Allah berfirman): \"Maka berjalanlah kamu dengan membawa hamba-hamba-Ku pada malam hari, sesungguhnya kamu akan dikejar,",
                            "verse 44:24": "dan biarkanlah laut itu tetap terbelah. Sesungguhnya mereka adalah tentara yang akan ditenggelamkan.",
                            "verse 44:25": "Alangkah banyaknya taman dan mata air yang mereka tinggalkan,",
                            "verse 44:26": "dan kebun-kebun serta tempat-tempat yang indah-indah,",
                            "verse 44:27": "dan kesenangan-kesenangan yang mereka menikmatinya,",
                            "verse 44:28": "demikianlah. Dan Kami wariskan semua itu kepada kaum yang lain.",
                            "verse 44:29": "Maka langit dan bumi tidak menangisi mereka dan mereka pun tidak diberi tangguh.",
                            "verse 44:30": "Dan sesungguhnya telah Kami selamatkan Bani Israel dari siksaan yang menghinakan,",
                            "verse 44:31": "dari (azab) Fir’aun. Sesungguhnya dia adalah orang yang sombong, salah seorang dari orang-orang yang melampaui batas.",
                            "verse 44:32": "Dan sesungguhnya telah Kami pilih mereka dengan pengetahuan (Kami) atas bangsa-bangsa.",
                            "verse 44:33": "Dan Kami telah memberikan kepada mereka di antara tanda-tanda kekuasaan (Kami) sesuatu yang di dalamnya terdapat ni’mat yang nyata.",
                            "verse 44:34": "Sesungguhnya mereka (kaum musyrik) itu benar-benar berkata,",
                            "verse 44:35": "\"Tidak ada kematian selain kematian di dunia ini. Dan kami sekali-kali tidak akan dibangkitkan.",
                            "verse 44:36": "maka datangkanlah (kembali) bapak-bapak kami jika kamu memang orang-orang yang benar\".",
                            "verse 44:37": "Apakah mereka (kaum musyrikin) yang lebih baik ataukah kaum Tubba’ dan orang orang yang sebelum mereka. Kami telah membinasakan mereka karena sesungguhnya mereka adalah orang-orang yang berdosa.",
                            "verse 44:38": "Dan Kami tidak menciptakan langit dan bumi dan apa yang ada antara keduanya dengan bermain-main.",
                            "verse 44:39": "Kami tidak menciptakan keduanya melainkan dengan hak, tetapi kebanyakan mereka tidak mengetahui.",
                            "verse 44:40": "Sesungguhnya hari keputusan (hari kiamat) itu adalah waktu yang dijanjikan bagi mereka semuanya,",
                            "verse 44:41": "yaitu hari yang seorang karib tidak dapat memberi manfaat kepada karibnya sedikitpun, dan mereka tidak akan mendapat pertolongan,",
                            "verse 44:42": "kecuali orang yang diberi rahmat oleh Allah. Sesungguhnya Dialah Yang Maha Perkasa lagi Maha Penyayang.",
                            "verse 44:43": "Sesungguhnya pohon zaqqum itu,",
                            "verse 44:44": "makanan orang yang banyak berdosa.",
                            "verse 44:45": "(Ia) sebagai kotoran minyak yang mendidih di dalam perut,",
                            "verse 44:46": "seperti mendidihnya air yang sangat panas.",
                            "verse 44:47": "Peganglah dia kemudian seretlah dia ke tengah-tengah neraka.",
                            "verse 44:48": "Kemudian tuangkanlah di atas kepalanya siksaan (dari) air yang amat panas.",
                            "verse 44:49": "Rasakanlah, sesungguhnya kamu orang yang perkasa lagi mulia.",
                            "verse 44:50": "Sesungguhnya ini adalah azab yang dahulu selalu kamu meragu-ragukannya.",
                            "verse 44:51": "Sesungguhnya orang-orang yang bertakwa berada dalam tempat yang aman,",
                            "verse 44:52": "(yaitu) di dalam taman-taman dan mata-air-mata-air;",
                            "verse 44:53": "mereka memakai sutera yang halus dan sutera yang tebal, (duduk) berhadap-hadapan,",
                            "verse 44:54": "demikianlah. Dan Kami berikan kepada mereka bidadari.",
                            "verse 44:55": "Di dalamnya mereka meminta segala macam buah-buahan dengan aman (dari segala kekhawatiran),",
                            "verse 44:56": "mereka tidak akan merasakan mati di dalamnya kecuali mati di dunia. Dan Allah memelihara mereka dari azab neraka,",
                            "verse 44:57": "sebagai karunia dari Tuhanmu. Yang demikian itu adalah keberuntungan yang besar.",
                            "verse 44:58": "Sesungguhnya Kami mudahkan Al Qur'an itu dengan bahasamu supaya mereka mendapat pelajaran.",
                            "verse 44:59": "Maka tunggulah; sesungguhnya mereka itu menunggu (pula)."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Hâ', Mîm .",
                            "verse 44:2": "Per il Libro esplicito.",
                            "verse 44:3": "Lo abbiamo fatto scendere in una notte benedetta , - in verità siamo Noi ad ammonire-",
                            "verse 44:4": "durante la quale è stabilito ogni saggio decreto,",
                            "verse 44:5": "decreto che emana da Noi. Siamo Noi ad inviare [i messaggeri],",
                            "verse 44:6": "[segno della] misericordia del tuo Signore: Egli è audiente, sapiente,",
                            "verse 44:7": "il Signore dei cieli, della terra e di quel che vi è frammezzo. Se solo ne foste convinti!",
                            "verse 44:8": "Non c'è dio all'infuori di Lui, Colui che dà la vita e dà la morte, il vostro Signore e il Signore dei vostri più lontani antenati.",
                            "verse 44:9": "Ma quella gente invece dubita e scherza!",
                            "verse 44:10": "Ebbene, aspetta il Giorno in cui il cielo recherà un fumo ben visibile ,",
                            "verse 44:11": "che avvolgerà gli uomini. Ecco un castigo doloroso!",
                            "verse 44:12": "[Diranno]: « Signore, allontana da noi il castigo, perché [ora] crediamo».",
                            "verse 44:13": "Da dove viene questa loro coscienza? Già giunse loro un messaggero esplicito,",
                            "verse 44:14": "e gli voltarono le spalle dicendo: « E' un neofita invasato» .",
                            "verse 44:15": "Se, per un istante, allontanassimo il castigo da voi, certamente sareste recidivi.",
                            "verse 44:16": "Il Giorno in cui li afferreremo con implacabile stretta, Ci vendicheremo.",
                            "verse 44:17": "Prima di loro mettemmo alla prova il popolo di Faraone, quando giunse loro un nobilissimo messaggero",
                            "verse 44:18": "[che disse]: « Datemi i servi di Allah! Io sono per voi un messagero affidabile!",
                            "verse 44:19": "Non siate insolenti nei confronti di Allah! In verità vengo a voi con evidente autorità.",
                            "verse 44:20": "Mi rifugio in Colui che è mio Signore e vostro Signore, affinché voi non mi lapidiate.",
                            "verse 44:21": "Se non volete credere in me, almeno non siatemi ostili .",
                            "verse 44:22": "Invocò poi il suo Signore: «In verità sono un popolo di malvagi».",
                            "verse 44:23": "[Disse il Signore]: «Fai viaggiare di notte i Miei servi: sarete inseguiti.",
                            "verse 44:24": "Lascerai il mare aperto: sarà un'armata di annegati».",
                            "verse 44:25": "Quanti giardini e sorgenti abbandonarono,",
                            "verse 44:26": "e campi, e comode residenze,",
                            "verse 44:27": "e il benessere di cui si deliziavano!",
                            "verse 44:28": "Così fu: demmo tutto ciò in eredità ad altro popolo.",
                            "verse 44:29": "Non li piansero né il cielo né la terra e non fu concessa loro dilazione alcuna.",
                            "verse 44:30": "Salvammo i Figli di Israele dall'umiliante tormento,",
                            "verse 44:31": "da Faraone che era tiranno e prevaricatore.",
                            "verse 44:32": "Con conoscenza di causa ne facemmo degli eletti tra creature.",
                            "verse 44:33": "Demmo loro segni che contenevano una prova palese.",
                            "verse 44:34": "Ora questi dicono :",
                            "verse 44:35": "«Non avremo altro che la prima morte e non saremo risuscitati.",
                            "verse 44:36": "Fate risorgere i nostri avi, se siete veritieri».",
                            "verse 44:37": "Son essi migliori, o il popolo di Tubba' o coloro che li precedettero ? Li annientammo perché in verità erano malvagi.",
                            "verse 44:38": "Non creammo i cieli e la terra e quel che vi sta frammezzo per gioco,",
                            "verse 44:39": "non li creammo che secondo verità. Ma la maggior parte di loro non lo sa.",
                            "verse 44:40": "Invero il Giorno del Verdetto è fissato per tutti quanti,",
                            "verse 44:41": "il Giorno in cui nessun alleato darà rifugio al suo alleato in alcunché e non saranno soccorsi,",
                            "verse 44:42": "eccetto chi avrà la misericordia di Allah. In verità Egli è l'Eccelso, il Misericordioso.",
                            "verse 44:43": "In verità l'albero di Zaqqûm .",
                            "verse 44:44": "è il cibo del peccatore.",
                            "verse 44:45": "Ribollirà nel [suo] ventre come metallo liquefatto,",
                            "verse 44:46": "come bolle l'acqua bollente.",
                            "verse 44:47": "« Afferratelo e trascinatelo nel fondo della Fornace",
                            "verse 44:48": "e gli si versi sul capo il castigo dell'acqua bollente.",
                            "verse 44:49": "Gusta [questo]: sei forse tu l'eccelso, il nobile?».",
                            "verse 44:50": "Ecco quello di cui dubitavate!",
                            "verse 44:51": "I timorati avranno asilo sicuro,",
                            "verse 44:52": "tra giardini e sorgenti,",
                            "verse 44:53": "Saranno vestiti di seta e broccato e staranno gli uni di fronte agli altri.",
                            "verse 44:54": "Sarà così e daremo loro in spose fanciulle dai grandi occhi.",
                            "verse 44:55": "Colà chiederanno senza timore ogni tipo di frutto.",
                            "verse 44:56": "E non proveranno altra morte oltre a quella prima morte [terrena]. [Allah] li ha preservati dal tormento della Fornace,",
                            "verse 44:57": "per grazia del tuo Signore: questa è la più grande beatitudine.",
                            "verse 44:58": "Abbiamo reso facile questo [Corano], nel tuo idioma, affinché riflettano.",
                            "verse 44:59": "Aspetta dunque, ché anche loro aspettano."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "ハー・ミーム。",
                            "verse 44:2": "（事物を）明瞭にする，この啓典にかけて（誓う）。",
                            "verse 44:3": "本当にわれは，祝福された夜，これを下して，（悪に対して不断に）警告を与え（ようとす）るものであろ。",
                            "verse 44:4": "その（夜）には，英知に就いて凡ての事が明確にされる。",
                            "verse 44:5": "わが許からの命令である。本当にわれが何時も使徒を）遣わすのは，",
                            "verse 44:6": "あなたの主からの慈悲である。本当にかれは，全聴にして全知であられ，",
                            "verse 44:7": "天と地，そしてその間の凡てのものの主である。もしあなたがた（の信仰）が確かならば。",
                            "verse 44:8": "かれの外に神はなく，生を授け死を授けられる。あなたがたの主，またあなたがたの祖先の主であられる。",
                            "verse 44:9": "それなのにかれらは疑って，戯れている。",
                            "verse 44:10": "待っていなさい，天が明瞭な煙霧を起す日まで。",
                            "verse 44:11": "（それは）人びとを包む。（かれらは言う）。「これは痛ましい懲罰です。」",
                            "verse 44:12": "「主よ，わたしたちからこの懲罰を免じて下さい。本当に信仰いたします。」",
                            "verse 44:13": "どうして（再び）かれらに訓示があろう。かれらには公明な使徒が確かに来たのに，",
                            "verse 44:14": "かれらはかれ（使徒）から背き去って，「他人に入れ智恵された者，(ほ?)かれた者です。」と言ったではないか。",
                            "verse 44:15": "われが暫くの間，懲罰を解除すると，あなたがたは必ず（不信心に）戻る。",
                            "verse 44:16": "われが猛襲する（審判の）日，本当にわれは，（厳正に）報復する。",
                            "verse 44:17": "かれら以前にも，われはフィルアウンの民を試みた。その時かれらに尊い使徒（ムーサー）が来て，",
                            "verse 44:18": "（言った。）「アッラーのしもべたち（イスラエルの子孫）を，わたしに返しなさい。本当にわたしは，あなたがたの許にやって来た誠実な使徒です。",
                            "verse 44:19": "アッラーに対して，高慢であってはなりません。本当にわたしは明白な権威をもって，あなたがたの所にやって来たのです。",
                            "verse 44:20": "あなたがたが（わたしを）石撃ちにするなら，わたしそしてあなたがたの主でもある御方に，救いを求めます。",
                            "verse 44:21": "もしあなたがたが，わたしを信じないならば，わたしには構わないでください。」",
                            "verse 44:22": "そこで，かれは主に祈っ（て言っ）た。「これらは罪深い人びとです。」",
                            "verse 44:23": "（主の御答えがあった。）「あなたは夜の中に，わがしもべと共に旅立て。必ずあなたがたに追っ手がかかろう。",
                            "verse 44:24": "そして海は（渡った後）分けたままにして置け。本当にかれらは，溺れてしまうことであろう。」",
                            "verse 44:25": "かれらは，如何に多くの園と泉を残したか。",
                            "verse 44:26": "また（豊かな）穀物の畑と，幸福な住まいを，",
                            "verse 44:27": "またかれらがそこで享楽していた良い物を（残したか。）",
                            "verse 44:28": "（かれらの最後は）こうであった。そしてわれは，外の民に（それらを）継がせた。",
                            "verse 44:29": "かれらのために，天も地も泣かず，かれらに猶予も与えられなかった。",
                            "verse 44:30": "われは，イスラエルの子孫を屈辱の懲罰から救い，",
                            "verse 44:31": "フィルアウンから（救い出した）。本当にかれは，高慢で無法者であった。",
                            "verse 44:32": "われは思うところにより，かれらを諸民族の上に選んだ。",
                            "verse 44:33": "そして明白な試練を含む，数々の印を与えた。",
                            "verse 44:34": "さてこれら（マッカの偶像信者）は（愚かにも）言う。",
                            "verse 44:35": "「わたしたちは最初死ねば（2度と）起こされない。",
                            "verse 44:36": "もしあなたがた（の言葉）が真実なら，わたしたちの祖先を連れ戻してみなさい。」",
                            "verse 44:37": "かれら（マッカの偶像信者）はトッバウの民か，またそれ以前の者たちより優れているのか。われはかれら（諸民族）を滅ぼしたのである。本当にかれらは罪を犯した者であった。",
                            "verse 44:38": "われは天と地，そしてその間にある凡てのものを，戯れに創ったのではない。",
                            "verse 44:39": "われは，天地とその間の凡てのものを，只真理のために創った。だが，かれらの多くは理解しない。",
                            "verse 44:40": "本当に（善悪の）選別の日は，凡てのものに定められた日である。",
                            "verse 44:41": "その日，友はその友のために何も役立てず，またかれらは援助も得られない。",
                            "verse 44:42": "だがアッラーの御慈悲を被むった者たちは別である。本当にかれは偉力ならびなく慈悲深くあられる。",
                            "verse 44:43": "本当にアッ・ザックームの木こそは，",
                            "verse 44:44": "罪ある者の糧である。",
                            "verse 44:45": "それは溶けた銅のように内臓の中で沸騰しよう，",
                            "verse 44:46": "熱湯が滾りかえるように。",
                            "verse 44:47": "（声がして言われよう。）「かれを捕えよ，燃えさかる炎の只中に，引きずり込め。",
                            "verse 44:48": "それから，かれの頭の上に沸騰する湯の痛苦を浴びせよ。",
                            "verse 44:49": "あなたは（これを）味わうがいい。本当にあなたは，力のある尊貴な者であった。",
                            "verse 44:50": "これこそあなたがたが，疑っていたものである。」",
                            "verse 44:51": "本当に，主を畏れた者は，安泰な所にいる。",
                            "verse 44:52": "園と泉の間に，",
                            "verse 44:53": "絹や錦を纒い，互いに向かい合って，",
                            "verse 44:54": "このようにわれは，輝いた大きい目の乙女たちをかれらの配偶者にするであろう。",
                            "verse 44:55": "かれらはそこで平安に，凡ての果実を求められ，",
                            "verse 44:56": "最初の死の外に，そこで（再び）死を味わうことはなく，燃える炎の責め苦から守護されよう。",
                            "verse 44:57": "あなたの主からの賜物，それこそは至福の成就であろ。",
                            "verse 44:58": "われはこの（クルアーン）を，あなたの言葉（アラビア語）で（下し）分りやすくした。かれらは，理解し諭されるかもしれない。",
                            "verse 44:59": "だからしばらく待って様子を見なさい。本当にかれらの方も様子を伺っているのだから。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "하 밈",
                            "verse 44:2": "사실을 밝혀주는 이 성서에맹세하며",
                            "verse 44:3": "하나님은 그것을 축복받은 밤에 계시했나니 그것으로 경고하 고자 함이라",
                            "verse 44:4": "그날 밤 모든 지헤로운 일들 이 명백하여지니",
                            "verse 44:5": "하나님의 명령이라 실로 그분께서 선지자들을 보냈노라",
                            "verse 44:6": "그것은 주님으로부터의 자비 라 실로 하나님은 들으시고 아시 는 분이시라",
                            "verse 44:7": "너희가 확실한 믿음을 가질 때 그분은 하늘과 대지 그리고 그사이에 있는 만물의 주님이시라",
                            "verse 44:8": "그분 외에는 신이 없으며 생 명을 주시고 생명을 앗아 가시는 분도 그분으로 너희의 주님이요 또한 너희 조상의 주님이시라",
                            "verse 44:9": "그러나 그들은 의심하며 조롱 하니",
                            "verse 44:10": "하늘이 짙은 연기로 가득 차는 그날을 그대는 지켜보리라",
                            "verse 44:11": "연기가 사람들을 덮어 가리 우니 고통스러운 벌이라",
                            "verse 44:12": "불신자들은 주여 저희에게 이 벌을 거두어 주소서 저희가 믿 겠나이다",
                            "verse 44:13": "그 교훈이 그들에게 유용하 겠느뇨 진리를 밝혀주는 선지자가 그들에게 이미 임하셨도다",
                            "verse 44:14": "그러나 그들은 그로부터 등 을 돌리며 그가 미친자라 말하더 라",
                            "verse 44:15": "하나님께서 잠시 응벌을 거 두어 주면 너희는 다시 사악함으 로 돌아갈 것이라",
                            "verse 44:16": "가장 격렬한 응벌이 있을 그날 하나님은 고통스러온 벌을 가 하리라",
                            "verse 44:17": "하나님은 그들 이전의 파라 오 백성을 시험하였으니 훌륭한 선지자가 그들에게 임하여",
                            "verse 44:18": "하나님의 종들을 내게 넘겨 주오 실로 나는 너희에게 온 믿음 의 선지자라 말하더라",
                            "verse 44:19": "하나님께 거역하며 오만하지말라 실로 내가 분명한 능력을 너 희에게 보여 주리라",
                            "verse 44:20": "너희가 나를 해치려 할 때 나는 나의 주님이며 너희 주님인 하나님께 구원을 청하리라",
                            "verse 44:21": "너희가 나를 믿지 아니한다 면 나를 홀로 두라",
                            "verse 44:22": "실로 이들은 죄지은 백성입 니다 라고 주님께 기도하더라",
                            "verse 44:23": "이에 대답이 있었으매 너희 가 추적을 당하리니 나의 종들과 더불어 밤에 떠나라",
                            "verse 44:24": "바다는 갈라진 채로 두어라 그들은 익사하게 될 무리들이라",
                            "verse 44:25": "그들이 남긴 과수원과 우물 들이 얼마나 많으뇨",
                            "verse 44:26": "전답과 훌륭한 휴식처와",
                            "verse 44:27": "향락에 탐닉했던 그 풍요로 운 재물도",
                            "verse 44:28": "그렇게 하여 끝이 나고 하 나님은 이것들을 다른 백성에게 상속케 했노라",
                            "verse 44:29": "그들을 위해 하늘도 땅도 눈물을 흘리지 아니했으며 그들에게 는 유예도 없었노라",
                            "verse 44:30": "하나님은 굴욕의 재앙으로 부터 이스라엘 백성을 구하였으니",
                            "verse 44:31": "파라오로 부터라 실로 그는 오만한 죄인이라",
                            "verse 44:32": "하나님은 지혜로써 여러 민 족중에서 그들을 선택해서",
                            "verse 44:33": "그들에게 예증들을 부여하 였으니 그 안에는 분명한 시험이 었노라",
                            "verse 44:34": "이들은 말하도다",
                            "verse 44:35": "우리가 한번 죽으면 다시 부활되지 않노라",
                            "verse 44:36": "그러므로 너희가 진실이라면우리 선조들을 되돌려 주라 하니",
                            "verse 44:37": "그들은 투바의 백성과 이전 의 백성들 보다 강하다 생각하느 뇨 하나님은 그들이 낳은 죄악으 로 말미암아 그들을 멸망케 했노 라",
                            "verse 44:38": "하나님께서 천지를 창조하고그 사이에 있는 모든 것을 창조한 것은 단순한 오락이 아니라",
                            "verse 44:39": "그것들을 진리로 창조하였으되 그들 대다수는 이해하지 못하 노라",
                            "verse 44:40": "실로 심판의 날은 그들 모두 를 위해 정하여진 날이니",
                            "verse 44:41": "그날은 친구가 그의 친구에 게 유용하지 아니하고 도움도 받 을 수 없는 날이라",
                            "verse 44:42": "그러나 하나님께서 은혜를 베푼 자는 제외라 실로 하나님은 권능과 자비로 충만하심이라",
                            "verse 44:43": "실로 자꾸무 나무가",
                            "verse 44:44": "죄인들의 음식이 되어",
                            "verse 44:45": "녹은 쇳물처럼 되어 그들의 위 속에서 끊어 오르니",
                            "verse 44:46": "들끓는 뜨거운 물과 같더라",
                            "verse 44:47": "그때 음성이 들려오니 그를 데려가 타오르는 불지옥으로 넣으라",
                            "verse 44:48": "그리고 그의 머리 위에는 들끓는 물이 부어지며",
                            "verse 44:49": "이것을 맛보라 실로 너야말 로 훌룡하고 힘이 센 자라",
                            "verse 44:50": "실로 이것이 네가 의심했던 것이라",
                            "verse 44:51": "그러나 의로운 자들은 안전 한 곳에 있게 되나니",
                            "verse 44:52": "낙원과 우물들이 있는 곳이라",
                            "verse 44:53": "섬세한 실크와 비단 옷을 걸치고 서로의 얼굴을 맛보게 되리 라",
                            "verse 44:54": "그렇듯 은혜를 베플고 아름 답고 눈이 큰 배우지를 결합시켜 주니",
                            "verse 44:55": "그들은 그곳에서 온갖 과일 을 평화롬게 즐기도다",
                            "verse 44:56": "그들은 한번의 죽음 외에는 다시 죽음을 맛보지 아니하며 하 나님은 타오르는 불지옥의 벌로부터 그들을 보호하여 주시니라",
                            "verse 44:57": "이것이 그대 주님의 은혜요 최고의 승리라",
                            "verse 44:58": "하나님은 꾸란을 그대의 언 어로 계시했거늘 이로 하여 그들 이 교훈을 얻도록 함이라",
                            "verse 44:59": "그러므로 그대는 기다리며 지켜보라 그들도 역시 기다리고 있노라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "سه‌رنجی سه‌ره‌تای سووره‌تی (الشوری) بده‌",
                            "verse 44:2": "سوێند به‌م قورئانه ڕوون و ئاشکرایه‌.",
                            "verse 44:3": "به‌ڕاستی ئێمه له شه‌وێکی به فه‌ڕو پیرۆزدا (که شه‌وی قه‌دره‌) دامانبه‌زاندووه‌ته خواره‌وه‌، بێگومان ئێمه هه‌میشه بێدارکه‌ره‌ره‌ی به‌نده‌کانمانین.",
                            "verse 44:4": "له‌و شه‌وه‌دا هه‌موو کارو کرده‌وه و به‌رنامه‌یه‌کی پڕ له حیکمه‌ت و دانایی له یه‌ك جیا ده‌کرێته‌وه‌.",
                            "verse 44:5": "ئه‌مه‌ش فه‌رمان و بڕیارێکه له‌لایه‌ن ئێمه‌وه‌، بێگومان ئێمه‌یش پێغه‌مبه‌ران ده‌نێرین.",
                            "verse 44:6": "ڕه‌وانه کردنی ئه‌م قورئانه‌، ڕه‌حمه‌تی په‌روه‌ردگاری تۆیه بۆ ئاده‌میزاد، تا له سه‌رگه‌ردانی ڕزگاری ببێت، به‌ڕاستی هه‌ر ئه‌ویشه که بیسه‌رو زانایه به هه‌موو شتێك.",
                            "verse 44:7": "ئه‌و زاته که په‌روه‌ردگاری ئاسمانه‌کان و زه‌وی و هه‌موو ئه‌و شتانه‌ی که له نێوانیاندایه‌، ئه‌گه‌ر ئێوه دڵنیان و باوه‌ڕتان هه‌یه‌.",
                            "verse 44:8": "هیچ خوایه‌ك نی یه جگه له‌و زاته‌، ده‌ژێنێ و ده‌مرێنێت، په‌روه‌ردگاری ئێوه‌ش و باوو باپیرانی دێرینیشتانه‌.",
                            "verse 44:9": "له‌گه‌ڵ ئه‌م هه‌موو به‌ڵگه و نیشانه گه‌وره و گرنگانه‌دا، خوانه‌ناسان له گومان و دوودڵیدا ڕۆچوون و سه‌رگه‌رمی گه‌مه‌و یارین.",
                            "verse 44:10": "(ئه‌وانه هه‌روا به‌سه‌ریانه‌وه ناچێت) چاوه‌ڕێی ڕۆژێك بکه که دوکه‌ڵێکی ئاشکرا به‌ری ئاسمان ده‌گرێت.",
                            "verse 44:11": "هه‌موو خه‌ڵکی داده‌گرێته‌، بۆیه به ترسه‌وه ده‌ڵێن: ئه‌مه سزاو ئازارێکی به ئێشه (وا ڕووی تێ کردووین).",
                            "verse 44:12": "به‌ناچاری دان به‌ده‌سه‌ڵاتی خوادا ده‌نێن و ده‌ڵێن: په‌روه‌ردگارا تۆ ئه‌م سزاو ئازاره‌مان له کۆڵ بکه‌ره‌وه‌، بێگومان ئێمه باوه‌ڕدارین!!",
                            "verse 44:13": "(تازه به‌سه‌رچوو!! که‌ی بێداربوونه‌وه و ئیمان هێنانی ناچاری سوودی هه‌یه بۆیان)، چۆن و له‌کوێ ئامۆژگاری وه‌رده‌گرن، له‌کاتێکدا پێغه‌مبه‌رێکی ئاشکرایان بۆ ڕه‌وانه کرابوو.",
                            "verse 44:14": "پاشان پشتیان تێکرد و وتیان: فێرکراوێکی شێته‌!!",
                            "verse 44:15": "ئێمه چاك ده‌تانناسین، هه‌ر که‌مێك سزاو ئازارتان لێ دوور بخه‌نه‌وه، بێگومان ده‌چنه‌وه دۆخی جاران.",
                            "verse 44:16": "ڕۆژێك دێت هه‌ڵمه‌تی گه‌وره‌ی خۆمان بۆ تاوانباران ده‌به‌ین و ئێمه به‌دڵنیایی یه‌وه تۆڵه‌سێنه‌رین له سته‌مکاران.",
                            "verse 44:17": "سوێند به‌خوا به‌ڕاستی ئێمه پێش ئه‌مان قه‌وم و هۆزی فیرعه‌ونمان تاقیکرده‌وه‌، پێغه‌مبه‌رێکی به‌ڕێز و میهره‌بانیان بۆ هات.",
                            "verse 44:18": "به فیرعه‌ون و داروده‌سته‌که‌ی وت: که به‌نده‌کانی خوا به من بسپێرن، چونکه به‌ڕاستی من پێغه‌مبه‌رێکی ئه‌مین و دڵسۆزم بۆ هه‌مووتان.",
                            "verse 44:19": "خۆشتان به‌گه‌وره دامه‌نێن له به‌رامبه‌ر خوای به‌رزو به‌ده‌سه‌ڵاته‌وه‌، بێگومان من به‌ڵگه و نیشانه‌ی گرنگ و به‌هێز و ئاشکرام هێناوه بۆتان.",
                            "verse 44:20": "من په‌نا ده‌گرم به په‌روه‌ردگاری خۆم، که په‌روه‌ردگاری ئێوه‌شه له‌وه‌ی که به‌ردبارانم بکه‌ن.",
                            "verse 44:21": "خۆ ئه‌گه‌ر هه‌ر باوه‌ڕم پێ ناکه‌ن وازم لێ بهێنن و کارتان به‌منه‌وه نه‌بێت.",
                            "verse 44:22": "به‌هۆی ئه‌وه‌ی که وازیان لێ نه‌هێنا، هاناو هاواری بردووه بۆ په‌روه‌ردگاری: په‌روه‌ردگارا، به‌ڕاستی ئه‌مانه کۆمه‌ڵێکی تاوانبارن.",
                            "verse 44:23": "ئه‌وسا ئیتر خوا فه‌رمانی بۆ نارد که شه‌و ڕه‌وی بکه به‌به‌نده‌کانم و شار چۆڵ بکه‌ن، بێگومان ئه‌وانه به دواتاندا دێن.",
                            "verse 44:24": "جاکه خۆت و ئیمانداران له ده‌ریا په‌ڕینه‌وه ده‌ریا به‌جێ بهێڵه به‌واڵا کراوی چونکه به‌ڕاستی ئه‌وانه سوپایه‌کی خنکێنراون تیایدا...",
                            "verse 44:25": "ئه‌وانه چه‌نده‌ها باخ و باخات و کانیاوی سازگاری زۆریان به‌جێهێشت...",
                            "verse 44:26": "چه‌نده‌ها کێڵگه و بێستان و جێگه و ڕێگه‌ی خۆشیان له دوا به‌جێما...",
                            "verse 44:27": "جۆره‌ها نازو نیعمه‌تی تریش که ژیانیان به خۆشی تیایدا ده‌برده سه‌ر...",
                            "verse 44:28": "ئا به‌و شێوه‌یه له‌وانمان سه‌نده‌وه و کردمانه میراتی خه‌ڵکانێکی تر...",
                            "verse 44:29": "جا نه ئاسمان بۆیان گریا و نه زه‌ویش، ساته وه‌ختێکیش مۆڵه‌تیان نه‌درا...",
                            "verse 44:30": "پاشان ئێمه نه‌وه‌ی ئیسرائیلمان له سزای چه‌وسێنه‌ره‌وه‌ی فیرعه‌ون ڕزگارکرد...",
                            "verse 44:31": "به‌ڵێ، له‌ده‌ست فیرعه‌ون که زۆر خۆی به‌گه‌وره ده‌زانی و به‌ته‌واوی له‌سنووری ده‌رچوو بوو...",
                            "verse 44:32": "ئێمه ئه‌و کاته نه‌وه‌ی ئیسرائیلمان هه‌ڵبژارد له ڕووی ئاگایی و زانیاریه‌وه و ڕێزی ئه‌وانماندا به‌سه‌ر هه‌موو خه‌ڵکی ئه‌و سه‌رده‌مه‌دا...",
                            "verse 44:33": "ئێمه به‌ڵگه و نیشانه‌ی ئاشکرای زۆرمان پێبه‌خشین و به‌جۆره‌ها شێوه‌ی ئاشکراو ڕوون تاقیمانکردنه‌وه‌.",
                            "verse 44:34": "به‌ڕاستی ئه‌وانه (بت په‌رستان) ده‌ڵێن....",
                            "verse 44:35": "ژیانمان ته‌نها یه‌ك جاره و زیندوو ناکرێینه‌وه‌.",
                            "verse 44:36": "ئه‌گه‌ر زیندوووبوونه‌وه حه‌قیقه‌ته‌، باو و باپیرانمان که مردوون بیانهێننه‌وه ئه‌گه‌ر ئێوه ڕاست ده‌که‌ن؟!!",
                            "verse 44:37": "ئایا ئه‌مانه چاکترن یان قه‌ومی _تبع_ (که قه‌ومێکی ده‌سه‌ڵاتدار بوون له پێش ئیسلامدا، قوڕه‌یش ده‌نگوباسی ئازایه‌تیانی بیستبوو)، هه‌روه‌ها ئه‌وانه‌ی پێشیان، ئێمه هه‌موانیانمان له‌ناوبرد، به‌ڕاستی هه‌رهه‌موویان تاوانبار بوون.",
                            "verse 44:38": "خۆ ئێمه ئاسمانه‌کان و زه‌وی و ئه‌و شتانه‌ی نێوانیانمان به‌گاڵته و بێ هووده دروست نه‌کردووه‌.",
                            "verse 44:39": "(به‌ڵکو هه‌مووی) له‌سه‌ر بنچینه‌ی حه‌ق و ڕاستی نه‌بێت دروستمان نه‌کردوون، به‌ڵام زۆربه‌یان له‌م ڕاستیه نازانن.",
                            "verse 44:40": "بێگومان دوارۆژ که ڕۆژی جیاکردنه‌وه‌یه‌، واده‌ی هه‌مووانیانه سه‌رجه‌م.",
                            "verse 44:41": "ڕۆژێکه هیچ گه‌وره‌یه‌ك فریای بچوکی خۆی ناکه‌وێت و هیچیشیان پشتگیری ناکرێن له‌لایه‌ن که‌سێکه‌وه‌.",
                            "verse 44:42": "مه‌گه‌ر که‌سێك به‌زه‌یی خوا گرتبێتیه‌وه به ڕاستی ته‌نها ئه‌و خوایه باڵاده‌ست و میهره‌بانه.",
                            "verse 44:43": "به‌ڕاستی دره‌ختی ژه‌قنه‌بووت (دره‌ختێکه له ناخی دۆزه‌خدا، له‌ناو ئاگردا، خوای به‌ده‌سه‌ڵات ڕوواندوویه‌تی و لق و په‌لکه‌کانی به ناویدا بڵاو بۆته‌وه‌).",
                            "verse 44:44": "به‌رو بوومه‌که‌ی خۆراکی تاوانبارانه‌.",
                            "verse 44:45": "هه‌روه‌ك کانزای تواوه له‌ناو ورگ و ڕیخۆڵه‌کاندا ده‌کوڵێت.",
                            "verse 44:46": "وه‌ك کوڵانی ئاوی یه‌کجار گه‌رم.",
                            "verse 44:47": "فه‌رمان ده‌درێت: ئه‌و تاوانباره بگرن و به‌رزی بکه‌نه‌وه به‌سه‌ر ناوه‌ڕاستی دۆزه‌خداو به‌ری بده‌نه‌وه‌.",
                            "verse 44:48": "له‌وه‌ودوا ئاگرو ئاوی زۆر له‌کوڵ بکه‌ن به‌سه‌ریدا.",
                            "verse 44:49": "ئه‌وسا پێی ده‌وترێت: ده‌بچێژه بێگومان تۆ زۆر خۆتت به‌شت ده‌زانی و خۆشت زۆر به‌ماقووڵ ده‌خسته به‌رچاو.",
                            "verse 44:50": "به‌ڕاستی ئا ئه‌مه ئه‌و دۆزه‌خه‌یه کاتی خۆی گومانتان لێی هه‌بوو، مووجاده‌له‌تان له‌سه‌ری ده‌کرد.",
                            "verse 44:51": "(له‌ولاشه‌وه له به‌هه‌شدا له سایه‌ی میهره‌بانی په‌روه‌ردگارا): به‌ڕاستی ئه‌وانه‌ی که پارێزگارو دیندارن، له جێگه و شوێنێکی زۆر ئارامدا ژیان ده‌به‌نه سه‌ر.",
                            "verse 44:52": "له باخچه و باخه‌کانی به‌هه‌شتدا، له پاڵ کارێز و کانی و تاڤگه‌کاندا ده‌ژین (هه‌میشه له سه‌یران و خۆشیدان).",
                            "verse 44:53": "ده‌پۆشن له ئاوریشمی ته‌نك و ئه‌ستوور، له‌و کاته‌دا، خۆشه‌ویستان به‌رامبه‌ر یه‌ك داده‌نیشن و (به‌ڕووی خۆشه‌وه بۆ یه‌کتر ده‌ڕوانن و گفتوگۆی خۆش و به‌تام ده‌که‌ن).",
                            "verse 44:54": "هه‌روه‌ها حوری چاوگه‌ش و گوڵئه‌نداممان کردووه به هاوسه‌ریان.",
                            "verse 44:55": "بانگ ده‌که‌ن تیایدا بۆ هه‌موو جۆره میوه‌یه‌ك، بێ ئه‌وه‌ی بترسن له ته‌واو بوون و، نه‌خۆش که‌وتن و له‌به‌رچاو که‌وتن.",
                            "verse 44:56": "له هه‌مووی خۆشتر ئه‌وه‌یه که هه‌رگیز تاڵی مردن ناچێژن تیایدا جگه له‌و مردنه‌ی یه‌که‌مجار و په‌روه‌ردگاریان له سزای دۆزه‌خیش به دووری گرتوون و پاڕاستوونی.",
                            "verse 44:57": "جا ئه‌مه ڕێزو فه‌زڵێکی تایبه‌تیه له‌لایه‌ن په‌روه‌ردگاری تووه ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم، ئه‌ی ئیماندار، به‌ڕاستی ته‌نها ئه‌وه‌یه سه‌رکه‌وتنی گه‌وره‌و بێ سنوور.",
                            "verse 44:58": "ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم، که‌واته بۆیه به‌زمانی تۆ ئه‌م قورئانه‌مان به‌ڕوونی و ئاسانی ڕه‌وانه‌کردووه‌، بۆ ئه‌وه‌ی یاداوه‌ری و ئامۆژگاری وه‌ربگرن و دابچڵه‌کێن.",
                            "verse 44:59": "که‌واته تۆ ئیتر چاوه‌ڕێی پێش هاتنی به‌ڵێنه‌کانی ئێمه بکه له دنیا و قیامه‌تدا، چونکه بێگومان ئه‌وانیش چاوه‌ڕێن!!"
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Haa, Miim.",
                            "verse 44:2": "Demi Al-Quran Kitab yang menerangkan kebenaran.",
                            "verse 44:3": "Sesungguhnya Kami telah menurunkan Al-Quran itu pada malam yang berkat; (Kami berbuat demikian) kerana sesungguhnya Kami sentiasa memberi peringatan dan amaran (jangan hamba-hamba Kami ditimpa azab).",
                            "verse 44:4": "(Kami menurunkan Al-Quran pada malam yang tersebut, kerana) pada malam yang berkat itu, dijelaskan (kepada malaikat) tiap-tiap perkara yang mengandungi hikmat serta tetap berlaku, (tidak berubah atau bertukar).",
                            "verse 44:5": "Iaitu perkara-perkara yang terbitnya dari hikmat kebijaksanaan Kami; sesungguhnya telah menjadi adat Kami mengutus Rasul.",
                            "verse 44:6": "(Untuk menyampaikan) rahmat dari Tuhanmu (kepada umat manusia); sesungguhnya Allah Jualah Yang Maha Mendengar, lagi Maha Mengetahui (akan segala keadaan hamba-hambaNya).",
                            "verse 44:7": "Tuhan (yang mencipta dan mentadbirkan keadaan) langit dan bumi serta segala yang ada di antara keduanya; kalau betul kamu orang-orang yang yakin (akan hakikat itu, maka terimalah sahaja apa yang diutuskan kepada kamu).",
                            "verse 44:8": "Tiada Tuhan yang berhak disembah melainkan Dia; Dialah Yang menghidupkan dan Yang mematikan; (Dialah jua) Tuhan kamu dan Tuhan datuk nenek kamu yang telah lalu.",
                            "verse 44:9": "(Mereka tidak meyakini kebenaran yang dijelaskan kepada mereka), bahkan mereka masih tenggelam dalam keraguan sambil bermain-main dengan perkara agama.",
                            "verse 44:10": "Oleh itu tunggulah (wahai Muhammad) semasa langit membawa asap kemarau yang jelas nyata (yang menyebabkan kebuluran yang dahsyat),",
                            "verse 44:11": "Yang akan menimpa seluruh keadaan manusia (yang kafir itu, sehingga mereka akan berkata: Ini adalah azab yang sungguh menyakitkan.",
                            "verse 44:12": "(Pada saat itu mereka akan merayu dengan berkata): Wahai Tuhan kami! Hapuskanlah azab ini dari kami, sesungguhnya kami akan beriman!.",
                            "verse 44:13": "Bagaimana mereka dapat beringat (menyempurnakan janji mereka hendak beriman itu)? Pada hal mereka telah pun didatangi seorang Rasul yang memberi keterangan-keterangan (yang cukup untuk mereka beriman)!",
                            "verse 44:14": "Sekalipun demikian, mereka juga berpaling ingkar daripada menerima keterangannya sambil berkata (sesama sendiri): Dia seorang yang diajar (oleh bangsa asing), dia juga seorang yang gila!",
                            "verse 44:15": "Sesungguhnya (kalaulah) kami hapuskan azab itu barang sedikitpun, sudah tentu kamu akan kembali (kufur ingkar).",
                            "verse 44:16": "(Ingatlah! Kalau kamu ulangi keingkaran kamu, kamu akan dibinasakan) semasa Kami timpakan (kamu dengan) paluan yang besar (dari pihak lawan kamu); sesungguhnya Kami tetap akan menyeksa (dengan azab yang seberat-beratnya).",
                            "verse 44:17": "Dan demi Sesungguhnya! Sebelum mereka, Kami telah menguji kaum Firaun dan merekapun telah didatangi oleh seorang Rasul (Nabi Musa) Yang mulia;",
                            "verse 44:18": "(Yang memberitahu kepada mereka dengan katanya): Berikanlah kepadaku wahai hamba-hamba Allah (apa-apa yang menandakan kamu menerima kerasulanku); sesungguhnya aku ini seorang Rasul yang amanah, yang diutuskan kepada kamu.",
                            "verse 44:19": "Dan janganlah kamu berlaku sombong takbur terhadap Allah; sesungguhnya aku ada membawa kepada kamu mukjizat yang jelas nyata.",
                            "verse 44:20": "Dan sesungguhnya aku telah memohon perlindungan kepada Tuhanku dan Tuhan kamu, daripada kamu merejam (atau menyakiti) daku.",
                            "verse 44:21": "Dan sekiranya kamu tidak juga mahu berimankan kerasulanku, maka putuskanlah perhubungan kamu denganku (janganlah mengganggu daku).",
                            "verse 44:22": "(Setelah Nabi Musa berputus asa daripada iman mereka), maka dia pun merayu kepada Tuhannya lalu berkata: Sesungguhnya orang-orang ini adalah kaum yang berdosa, (yang telah sebati dengan kekufurannya dan berhaklah mereka menerima balasan yang seburuk-buruknya).",
                            "verse 44:23": "Lalu (diperintahkan kepadanya): Bawalah hamba-hambaku (pengikut-pengikutmu) keluar pada waktu malam, kerana sesungguhnya kamu akan dikejar (oleh Firaun dan orang-orangnya).",
                            "verse 44:24": "Dan tinggalkanlah laut itu dalam keadaan tenang terbelah, kerana sesungguhnya mereka (yang mengejarmu itu) ialah tentera yang akan ditenggelamkan (sehingga binasa).",
                            "verse 44:25": "Banyak sungguh kebun-kebun dan mata air, mereka tinggalkan,",
                            "verse 44:26": "Dan juga berbagai jenis tanaman serta tempat-tempat kediaman yang indah mulia,",
                            "verse 44:27": "Dan juga kemewahan hidup, yang mereka sekian lama menikmatinya.",
                            "verse 44:28": "Demikianlah keadaannya (hukum Kami ke atas orang-orang yang derhaka) dan Kami jadikan semua peninggalan Firaun dan orang-orangnya: Milik kaum yang lain (kaum Bani Israil).",
                            "verse 44:29": "Mereka (ketika dibinasakan) itu tidak ditangisi oleh langit dan bumi (atau penduduk keduanya) dan mereka pula tidak diberi tempoh lagi.",
                            "verse 44:30": "Dan demi sesungguhnya! Kami telah selamatkan kaum Bani Israil, dari azab yang menghina;",
                            "verse 44:31": "Dari penindasan Firaun, sesungguhnya dia adalah seorang yang sombong takbur lagi terbilang dari orang-orang yang melampaui batas (dalam keganasan dan kekejamannya).",
                            "verse 44:32": "Dan demi sesungguhnya! Kami telah memilih mereka dengan berdasarkan pengetahuan (Kami) menjadi lebih pangkatnya dari penduduk dunia (pada zaman itu),",
                            "verse 44:33": "Dan Kami berikan kepada mereka (melalui Nabi Musa) berbagai mukjizat yang mengandungi ujian yang jelas nyata (untuk melahirkan sikap mereka).",
                            "verse 44:34": "(Berbalik kepada kisah kaum musyrik penduduk Mekah, Allah berfirman): Sesungguhnya mereka ini akan berkata (kepadamu wahai Muhammad dan kepada pengikut-pengikutmu):",
                            "verse 44:35": "Mati, hanyalah mati kita yang pertama (di dunia) dan kita tidak sekali-kali akan dibangkitkan hidup lagi (sesudah itu);",
                            "verse 44:36": "(Jika tidak) maka bawakanlah datuk nenek kami (yang telah mati) kalau betul kamu orang-orang yang benar!",
                            "verse 44:37": "(Mengapa mereka masih berdegil dalam kekufurannya?) Adakah mereka yang lebih kekuatan dan kehandalannya atau \"kaum Tubba'\" dan orang-orang yang terdahulu dari mereka? Orang-orang itu semuanya Kami telah binasakan, kerana sesungguhnya mereka adalah orang-orang yang berdosa.",
                            "verse 44:38": "Dan tidaklah Kami menciptakan langit dan bumi serta segala yang ada di antara keduanya, secara main-main;",
                            "verse 44:39": "Tidaklah Kami menciptakan keduanya (serta segala yang ada di antaranya) melainkan kerana menzahirkan perkara-perkara yang benar; akan tetapi kebanyakan mereka tidak mengetahui (hakikat itu).",
                            "verse 44:40": "Sesungguhnya hari pemutusan hukum untuk memberi balasan, ialah masa untuk mereka semua berhimpun;",
                            "verse 44:41": "Iaitu hari seseorang kerabat atau sahabat karib tidak dapat memberikan sebarang perlindungan kepada seseorang kerabat atau sahabat karibnya dan mereka pula tidak akan diberikan pertolongan (untuk menghapuskan azab itu),",
                            "verse 44:42": "Kecuali orang yang telah diberi rahmat oleh Allah; sesungguhnya Allah jualah yang Maha Kuasa, lagi Maha Mengasihani.",
                            "verse 44:43": "(Ingatlah), sesungguhnya pokok Zaqqum;",
                            "verse 44:44": "(Buahnya) menjadi makanan bagi orang yang berdosa (dalam Neraka).",
                            "verse 44:45": "(Makanan ini pula panas) seperti tembaga cair, mendidih dalam perut;",
                            "verse 44:46": "Seperti mendidihnya air yang meluap-luap panasnya.",
                            "verse 44:47": "(Lalu diperintahkan kepada malaikat penjaga Neraka): Renggutlah orang yang berdosa itu dan seretlah dia ke tengah-tengah Neraka.",
                            "verse 44:48": "Kemudian curahkanlah di atas kepalanya (azab seksa) dari air panas yang menggelegak.",
                            "verse 44:49": "(Serta dikatakan kepadanya secara mengejek): Rasalah azab seksa, sebenarnya engkau adalah orang yang berpengaruh dan terhormat (dalam kalangan masyarakatmu)",
                            "verse 44:50": "(Kemudian dikatakan kepada ahli Neraka umumnya): Sesungguhnya inilah dia (azab seksa) yang kamu dahulu ragu-ragu terhadapnya!",
                            "verse 44:51": "Sesungguhnya orang-orang yang bertakwa (akan ditempatkan) di tempat tinggal yang aman sentosa.",
                            "verse 44:52": "Dia itu di dalam beberapa taman Syurga, dengan mata air-mata air terpancar padanya,",
                            "verse 44:53": "Mereka memakai pakaian dari kain sutera yang halus dan kain sutera tebal yang bersulam; (mereka duduk di tempat perhimpunan) sentiasa berhadap-hadapan (di atas pelamin masing-masing).",
                            "verse 44:54": "Demikianlah keadaannya dan Kami jadikan kawan teman mereka bidadari-bidadari yang putih melepak, lagi luas cantik matanya.",
                            "verse 44:55": "Mereka meminta di dalam Syurga itu tiap-tiap jenis buah-buahan (yang mereka ingini), dalam keadaan aman sentosa.",
                            "verse 44:56": "Mereka tidak merasai kematian dalam Syurga itu selain daripada mati yang mereka rasai (di dunia) dahulu dan Allah selamatkan mereka dari azab Neraka;",
                            "verse 44:57": "(Mereka diberikan semuanya itu) sebagai limpah kurnia dari Tuhanmu (wahai Muhammad); yang demikian itulah kemenangan yang besar.",
                            "verse 44:58": "Maka sesungguhnya tujuan Kami memudahkan Al-Quran dengan bahasamu (wahai Muhammad), ialah supaya mereka (yang memahaminya) beringat dan insaf (untuk beriman dan mematuhinya).",
                            "verse 44:59": "(Kiranya mereka tidak berbuat demikian) maka tunggulah (wahai Muhammad akan kesudahan mereka), sesungguhnya mereka juga menunggu (akan kesudahanmu)."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "حم",
                            "verse 44:2": "سوگند به اين كتاب روشنگر،",
                            "verse 44:3": "كه ما آن را در شبى پر بركت نازل كرديم; ما همواره انذاركننده بوده‏ايم!",
                            "verse 44:4": "در آن شب هر امرى بر اساس حكمت (الهى) تدبير و جدا مى‏گردد",
                            "verse 44:5": "(آرى، نزول ) فرمانى بود از سوى ما; ما (محمد (ص) را) فرستاديم!",
                            "verse 44:6": "اينها همه بخاطر رحمتى است از سوى پروردگارت، كه شنونده و داناست!",
                            "verse 44:7": "(همان) پروردگار آسمانها و زمين و آنچه در ميان آنهاست، اگر اهل يقين هستيد!",
                            "verse 44:8": "هيچ معبودى جز او نيست; زنده مى‏كند و مى‏ميراند; او پروردگار شما و پروردگار پدران نخستين شماست!",
                            "verse 44:9": "ولى آنها در شكند و (با حقايق) بازى مى‏كنند",
                            "verse 44:10": "پس منتظر روزى باش كه آسمان دود آشكارى پديد آورد",
                            "verse 44:11": "كه همه مردم را فرامى‏گيرد; اين عذاب دردناكى است!",
                            "verse 44:12": "(مى‏گويند:) پروردگارا! عذاب را از ما برطرف كن كه ايمان مى‏آوريم",
                            "verse 44:13": "چگونه: و از كجا متذكر مى‏شوند با اينكه رسول روشنگر (با معجزات و منطق روشن) به سراغشان آمد!",
                            "verse 44:14": "سپس از او روى گردان شدند و گفتند: «او تعليم يافته‏اى ديوانه است!»",
                            "verse 44:15": "ما عذاب را كمى برطرف مى‏سازيم، ولى باز به كارهاى خود بازمى‏گرديد!",
                            "verse 44:16": "(ما از آنها انتقام مى‏گيريم) در آن روز كه آنها را با قدرت خواهيم گرفت; آرى ما انتقام گيرنده‏ايم!",
                            "verse 44:17": "ما پيش از اينها قوم فرعون را آزموديم و رسول بزرگوارى به سراغشان آمد،",
                            "verse 44:18": "(و به آنان گفت: امور) بندگان خدا را به من واگذاريد كه من فرستاده امينى براى شما هستم!",
                            "verse 44:19": "و در برابر خداوند تكبر نورزيد كه من براى شما دليل روشنى آورده‏ام!",
                            "verse 44:20": "و من به پروردگار خود و پروردگار شما پناه مى‏برم از اينكه مرا متهم كنيد!",
                            "verse 44:21": "و اگر به من ايمان نمى‏آوريد، از من كناره‏گيرى كنيد (و مانع ايمان آوردن مردم نشويد)!",
                            "verse 44:22": "(آنها هيچ يك از اين پندها را نپذيرفتند، و موسى) به پيشگاه پروردگارش عرضه داشت: اينها قومى مجرمند!",
                            "verse 44:23": "(به او دستور داده شد:) بندگان مرا شبانه حركت ده كه شما تعقيب مى‏شويد!",
                            "verse 44:24": "(هنگامى كه از دريا گذشتيد) دريا را آرام و گشاده بگذار (و بگذر) كه آنها لشكرى غرق‏شده خواهند بود!",
                            "verse 44:25": "(سرانجام همگى نابود شدند و) چه بسيار باغها و چشمه‏ها كه از خود به جاى گذاشتند،",
                            "verse 44:26": "و زراعتهاو قصرهاى زيبا و گرانقيمت،",
                            "verse 44:27": "و نعمتهاى فراوان ديگر كه در آن (غرق) بودند!",
                            "verse 44:28": "اينچنين بود ماجراى آنان! و ما (اموال و حكومت) اينها را ميراث براى اقوام ديگرى قرار داديم!",
                            "verse 44:29": "نه آسمان بر آنان گريست و نه زمين، و نه به آنها مهلتى داده شد!",
                            "verse 44:30": "ما بنى اسرائيل را از عذاب ذلت‏بار رهايى بخشيديم;",
                            "verse 44:31": "از فرعون كه مردى متكبر و از اسرافكاران بود!",
                            "verse 44:32": "ما آنها را با علم (خويش) بر جهانيان برگزيديم و برترى داديم،",
                            "verse 44:33": "و آياتى (از قدرت خويش) را به آنها داديم كه آزمايش آشكارى در آن بود (ولى آنان كفران كردند و مجازات شدند)!",
                            "verse 44:34": "اينها ( مشركان) مى‏گويند:",
                            "verse 44:35": "«مرگ ما جز همان مرگ اول نيست و هرگز برانگيخته نخواهيم شد!",
                            "verse 44:36": "اگر راست مى‏گوييد پدران ما را (زنده كنيد و) بياوريد (تا گواهى دهند)!»",
                            "verse 44:37": "آيا آنان بهترند يا قوم «تبع‏» و كسانى كه پيش از آنها بودند؟! ما آنان را هلاك كرديم، چرا كه مجرم بودند!",
                            "verse 44:38": "ما آسمانها و زمين و آنچه را كه در ميان اين دو است به بازى (و بى‏هدف) نيافريديم!",
                            "verse 44:39": "ما آن دو را جز بحق نيافريديم; ولى بيشتر آنان نمى‏دانند!",
                            "verse 44:40": "روز جدايى (حق از باطل) وعده‏گاه همه آنهاست!",
                            "verse 44:41": "روزى كه هيچ دوستى كمترين كمكى به دوستش نمى‏كند، و از هيچ‏سو يارى نمى‏شوند;",
                            "verse 44:42": "مگر كسى كه خدا او را مورد رحمت قرار داده، چرا كه او عزيز و رحيم است!",
                            "verse 44:43": "مسلما درخت زقوم",
                            "verse 44:44": "غذاى گنهكاران است،",
                            "verse 44:45": "همانند فلز گداخته در شكمها مى‏جوشد;",
                            "verse 44:46": "جوششى همچون آب سوزان!",
                            "verse 44:47": "(آنگاه به ماموران دوزخ خطاب مى‏شود:) اين كافر مجرم را بگيريد و به ميان دوزخ پرتابش كنيد!",
                            "verse 44:48": "سپس بر سر او از عذاب جوشان بريزيد!",
                            "verse 44:49": "(به او گفته مى‏شود:) بچش كه (به پندار خود) بسيار قدرتمند و محترم بودى!",
                            "verse 44:50": "اين همان چيزى است كه پيوسته در آن ترديد مى‏كرديد!",
                            "verse 44:51": "(ولى) پرهيزگاران در جايگاه امنى قرار دارند،",
                            "verse 44:52": "در ميان باغها و چشمه‏ها;",
                            "verse 44:53": "آنها لباسهايى از حرير نازك و ضخيم مى‏پوشند و در مقابل يكديگر مى‏نشينند;",
                            "verse 44:54": "اينچنين‏اند بهشتيان; و آنها را با «حور العين‏» تزويج مى‏كنيم!",
                            "verse 44:55": "آنها در آنجا هر نوع ميوه‏اى را بخواهند در اختيارشان قرارمى‏گيرد، و در نهايت امنيت به سر مى‏برند!",
                            "verse 44:56": "هرگز مرگى جز همان مرگ اول (كه در دنيا چشيده‏اند) نخواهند چشيد، و خداوند آنها را از عذاب دوزخ حفظ مى‏كند;",
                            "verse 44:57": "اين فضل و بخششى است از سوى پروردگارت، اين همان رستگارى بزرگ است!",
                            "verse 44:58": "ما آن ( ) را بر زبان تو آسان ساختيم، شايد آنان متذكر شوند!",
                            "verse 44:59": "(اما اگر نپذيرفتند) منتظر باش، آنها نيز منتظرند (تو منتظر پيروزى الهى و آنها منتظر عذاب و شكست)!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Ha, Mim.",
                            "verse 44:2": "Pelo Livro lúcido.",
                            "verse 44:3": "Nós o revelamos durante uma noite bendita, pois somos Admoestador,",
                            "verse 44:4": "Na qual se decreta todo o assunto prudente.",
                            "verse 44:5": "Por ordem Nossa, porque enviamos (a revelação).",
                            "verse 44:6": "Como misericórdia do teu Senhor, sabe que Ele é o Oniouvinte, o Sapientíssimo.",
                            "verse 44:7": "Senhor dos céus e da terra e de tudo quanto existe entre ambos, se estais persuadidos.",
                            "verse 44:8": "Não há mais divindade além d’Ele! Dá a vida e a morte, é o vosso Senhor e o de vossos antepassados.",
                            "verse 44:9": "Porém, estão na dúvida, absortos.",
                            "verse 44:10": "Aguarda, pois, o dia em que do céu descerá uma fumaça visível.",
                            "verse 44:11": "Que envolverá o povo: Será um doloroso castigo!",
                            "verse 44:12": "(Então dirão): Ó Senhor nosso, livra-nos do castigo, porque somos fiéis!",
                            "verse 44:13": "Como se não se recordassem de quando lhes chegou um elucidativo Mensageiro,",
                            "verse 44:14": "E o rechaçaram, dizendo: Ele foi ensinado (por outros), e é um energúmeno.",
                            "verse 44:15": "Em verdade, ainda que vos atenuássemos transitoriamente o castigo, seguramente reincidiríeis.",
                            "verse 44:16": "Recorda-lhes o dia em que desfecharemos o golpe decisivo; então, os puniremos.",
                            "verse 44:17": "Antes deles, provamos o povo do Faraó, ao ser-lhes apresentado um honorável mensageiro.",
                            "verse 44:18": "(Que lhes disse): Entregai-me os servos de Deus, porque sou um fidedigno mensageiro, para vós.",
                            "verse 44:19": "E não vos rebeleis contra Deus, porque vos trago uma autoridade evidente.",
                            "verse 44:20": "E me amparo em meu Senhor e vosso, se quereis apedrejar-me.",
                            "verse 44:21": "E se não credes em mim, afastei-vos, então, de mim.",
                            "verse 44:22": "(Moisés) exclamou, então, para o seu Senhor: Este é um povo pecador!",
                            "verse 44:23": "(Ordenou, então, o Senhor): Marcha, pois, com os Meus servos, durante a noite, porque sereis perseguidos.",
                            "verse 44:24": "E deixa o mar como um sulco, para que o exército dos incrédulos nele se afogue!",
                            "verse 44:25": "Quantos jardins e mananciais abandonaram;",
                            "verse 44:26": "Semeaduras e suntuosas residências.",
                            "verse 44:27": "E riquezas com as quais se regozijavam!",
                            "verse 44:28": "E foi assim que demos aquilo tudo em herança a outro povo!",
                            "verse 44:29": "Nem o céu, nem a terra verterão lágrimas por eles, nem tampouco lhes foi dada tolerância.",
                            "verse 44:30": "Sem dúvida que livramos os israelitas do castigo afrontoso,",
                            "verse 44:31": "Infligido pelo Faraó; em verdade, ele foi um déspota, e se contava entre os transgressores.",
                            "verse 44:32": "E os escolhemos propositadamente, entre os seus contemporâneos.",
                            "verse 44:33": "E os agraciamos com certas sinais que continham uma verdadeira prova.",
                            "verse 44:34": "Em verdade, estes (os coraixitas) dizem:",
                            "verse 44:35": "Não há mais morte do que a nossa primeira, e jamais seremos ressuscitados!",
                            "verse 44:36": "Fazei, então, voltar os nossos pais, se estiverdes certos!",
                            "verse 44:37": "Quê! Acaso, são eles preferíveis ao povo de Tubba e seus antepassados? Nós os aniquilamos, por haverem sido pecadores.",
                            "verse 44:38": "E não criamos os céus e a terra e tudo quanto existe entre ambos para Nos distrairmos.",
                            "verse 44:39": "Não os criamos senão com prudência; porém, a maioria o ignora.",
                            "verse 44:40": "Sabei que o dia fixado para todos será o dia da Discriminação,",
                            "verse 44:41": "Dia esse em que nenhum protetor poderá advogar, em nada, por outro, nem serão socorridos (os incrédulos).",
                            "verse 44:42": "Salvo aquele de quem Deus se apiedar, porque Ele é o Poderoso, o Misericordiosíssimo.",
                            "verse 44:43": "Sabei que a árvore de zacum",
                            "verse 44:44": "Será o alimento do pecador.",
                            "verse 44:45": "Com metal fundido que lhe ferverá nas entranhas.",
                            "verse 44:46": "Como a borbulhante água fervente.",
                            "verse 44:47": "(E será dito aos guardiãos): Agarrai o pecador e arrastai-o até ao centro da fogueira!",
                            "verse 44:48": "Então, atormentai-o, derramado sobre a sua cabeça água fervente.",
                            "verse 44:49": "Prova o sofrimento, já que tu és o poderoso, o honorável!",
                            "verse 44:50": "Certamente, há aqui aquilo de que vós duvidáveis.",
                            "verse 44:51": "Todavia, os tementes estarão em lugar seguro,",
                            "verse 44:52": "Entre jardins e mananciais.",
                            "verse 44:53": "Vestir-se-ão de tafetá e brocado, recostados frente a frente.",
                            "verse 44:54": "Assim será! E os casaremos com huris de maravilhosos olhos.",
                            "verse 44:55": "Aí pedirão toda a espécie de frutos, em segurança.",
                            "verse 44:56": "Lá não experimentarão a morte, além da primeira, e Ele os preservará do tormento da fogueira,",
                            "verse 44:57": "Como uma graça do teu Senhor. Tal é o magnífico benefício!",
                            "verse 44:58": "Em verdade, temos-te facilitado (o Alcorão) em tua língua, para que meditem.",
                            "verse 44:59": "Aguarda, pois, porque eles também aguardarão, igualmente."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 44:1": "Ha', Mim.",
                            "verse 44:2": "Pe Cartea cea limpede!",
                            "verse 44:3": "Noi am trimis-o într-o noapte binecuvântatã - cãci Noi am fost cu adevãrat prevenitori -,",
                            "verse 44:4": "În care se hotãrãsc toate rânduielile înțelepte,",
                            "verse 44:5": "Printr-o poruncã de la Noi, cãci Noi suntem Cel care trimite ,",
                            "verse 44:6": "Ca îndurare de la Domnul tãu Cel Care Aude Totul [și este] Atoate-știutor [As-Sami', Al-'Alim],",
                            "verse 44:7": "Stãpânul cerurilor și al pãmântului și al celor ce sunt între ele, dacã voi sunteți cu credințã.",
                            "verse 44:8": "Nu existã altã divinitate afarã de El; El dã viațã și dã moarte și El este Stãpânul vostru și Stãpânul pãrinților voștri cei dintâi.",
                            "verse 44:9": "Însã ei sunt în îndoialã și râd .",
                            "verse 44:10": "Deci, așteaptã o zi în care cerul va veni cu un fum învederat ,",
                            "verse 44:11": "Care-i va învãlui pe oameni. Aceasta va fi o osândã dureroasã.",
                            "verse 44:12": "“Doamne, îndepãrteazã osânda de la noi, cãci noi credem!”",
                            "verse 44:13": "De unde le-a venit lor aceastã îndemnare, când a venit la ei unTrimis limpede,",
                            "verse 44:14": "Iar ei s-au întors de la el și au zis: \"El este om învãțat [de cãtre alții], un nebun!\"",
                            "verse 44:15": "Noi vom îndepãrta puțin osânda, iar voi veți reveni [tot așa] .",
                            "verse 44:16": "Dar într-o Zi vom lovi cu asprimea cea mai mare și atunci NoiNe vom rãzbuna.",
                            "verse 44:17": "Mai înainte de ei am încercat Noi neamul lui Faraon, când a venit la ei un trimis nobil",
                            "verse 44:18": "[Și le-a zis lor]: \"Aduceți-i la mine pe robii lui Allah, cãci eu sunt un trimis vrednic de încredere",
                            "verse 44:19": "Și nu vã ridicați cu semeție împotriva lui Allah, cãci eu vã aduc dovadã limpede",
                            "verse 44:20": "Și eu caut apãrare la Domnul meu și Domnul vostru pentru ca voi sã nu mã loviți cu pietre, [pentru a mã ucide],",
                            "verse 44:21": "Iar dacã nu voiți sã mã credeți, stați departe de mine!\"",
                            "verse 44:22": "Și L-a chemat el pe Domnul lui, [zicând]: \"Aceștia sunt un neam de oameni nelegiuiți!\"",
                            "verse 44:23": "\"Deci, purcede noaptea împreunã cu robii Mei! Însã voi veți fi urmãriți!",
                            "verse 44:24": "Și lasã marea liniștitã! Ei sunt oșteni sortiți înecului!\"",
                            "verse 44:25": "Câte grãdini și izvoare au lãsat [în urma lor] ,",
                            "verse 44:26": "Câte ogoare și locuri minunate",
                            "verse 44:27": "Și câte plãceri de care s-au bucurat ei!",
                            "verse 44:28": "Așa! Și am lãsat Noi un alt neam care sã-i moșteneascã,",
                            "verse 44:29": "Și nu i-au plâns pe ei nici cerul, nici pãmântul și nu li s-a dat lor nici un rãgaz .",
                            "verse 44:30": "Și i-am mântuit Noi pe fiii lui Israel de osânda cea umilitoare ,",
                            "verse 44:31": "De Faraon care era îngâmfat și întrecea mãsura.",
                            "verse 44:32": "Și Noi i-am ales pe ei cu bunã științã peste [toate] lumile",
                            "verse 44:33": "Și le-am dat lor semne în care s-a aflat încercare limpede ,",
                            "verse 44:34": "Iar aceștia zic:",
                            "verse 44:35": "\"Nu este pentru noi decât prima noastrã moarte și nu vom mai fi noi readuși la viațã;",
                            "verse 44:36": "Aduceți-i [înapoi] pe pãrinții noștri, dacã grãiți voi adevãr!\"",
                            "verse 44:37": "Oare sunt ei mai buni sau neamul lui Tubba' și cei de dinainte de ei? Noi i-am fãcut sã piarã, pentru cã ei au fost nelegiuiți.",
                            "verse 44:38": "Și nu am fãcut Noi cerurile și pãmântul și cele ce se aflã între ele, jucându-ne .",
                            "verse 44:39": "Nu le-am fãcut Noi decât întru adevãr, însã cei mai mulți dintre ei nu știu.",
                            "verse 44:40": "Ziua despãrțirii este timpul hotãrât pentru ei toți,",
                            "verse 44:41": "O Zi în care un aliat nu va putea fi de nici un folos unui [alt] aliatși în care ei nu vor fi ajutați,",
                            "verse 44:42": "Afarã de acela cãruia Allah îi va arãta îndurare, cãci El estePuternic și Îndurãtor [Al-'Aziz, Ar-Rahim].",
                            "verse 44:43": "Fãrã îndoialã cã pomul Zaqqum",
                            "verse 44:44": "Va fi hrana pãcãtosului.",
                            "verse 44:45": "Ca smoala topitã va fierbe în pântece,",
                            "verse 44:46": "Ca apa clocotitã.",
                            "verse 44:47": "\"Apucați-l și cãrați-l pe el în mijlocul Iadului!",
                            "verse 44:48": "Apoi turnați asupra capului sãu din chinul apei fierbinți!”",
                            "verse 44:49": "[Și i se va zice]: \"Gustã! Tu [care pretindeai cã ești] puter nic și nobil!",
                            "verse 44:50": "Aceasta este aceea de care vã îndoiați!\"",
                            "verse 44:51": "Cei cu fricã [de Allah] se vor afla într-un loc sigur,",
                            "verse 44:52": "În grãdini și printre izvoare,",
                            "verse 44:53": "Vor purta straie de mãtase și brocart, șezând fațã în fațã.",
                            "verse 44:54": "Întocmai așa! Și le vom da Noi ca soațe hurii cu ochii mari.",
                            "verse 44:55": "Și în ele vor cere în deplinã liniște tot felul de fructe.",
                            "verse 44:56": "Nu vor gusta în ele moartea, afarã de moartea cea dintâi . ȘiAllah îi va feri pe ei de chinul Iadului.",
                            "verse 44:57": "Aceasta este ca îndurare de la Domnul tãu și aceasta este marea izbândã.",
                            "verse 44:58": "Și Noi l-am fãcut ușor [Coranul], în limba ta, astfel încât ei sã ia aminte!",
                            "verse 44:59": "Așteaptã și ia seama, așadar, fiindcã și ei așteaptã și iau seama !"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 44:1": "Ha. Mim.",
                            "verse 44:2": "Pe Cartea cea desluşită!",
                            "verse 44:3": "Noi am pogorât-o într-o noapte binecuvântată. Noi suntem Cei care predicăm!",
                            "verse 44:4": "În noaptea aceea, va fi lămurită fiece Poruncă înţeleaptă!",
                            "verse 44:5": "Cu Poruncă de la Noi, o vom trimite",
                            "verse 44:6": "ca milostivenie de la Domnul tău. El este Auzitorul, Ştiutorul.",
                            "verse 44:7": "El este Domnul cerurilor şi al pământului şi a ceea ce se află între ele. Dacă credeţi cu tărie!",
                            "verse 44:8": "Nu este dumnezeu afară de El. El dăruieşte viaţa. El dăruieşte moartea. El este Domnul vostru şi Domnul strămoşilor voştri dintâi.",
                            "verse 44:9": "Ei stau însă la îndoială, jucându-se.",
                            "verse 44:10": "Pândeşte Ziua când cerul va aduce un fum gros",
                            "verse 44:11": "care va învălui oamenii: aceasta este o osândă dureroasă",
                            "verse 44:12": "“Domnul nostru! Îndepărtează de la noi osânda, căci noi suntem credincioşi!”",
                            "verse 44:13": "Cum de au amintirea? Un profet cu vorba limpede a venit la ei.",
                            "verse 44:14": "Ei i-au întors însă spatele, spunând: “Este un însemnat, un îndrăcit!”",
                            "verse 44:15": "Vom îndepărta osânda puţin, însă voi vă veţi întoarce (la ce aţi fost).",
                            "verse 44:16": "În Ziua când îi vom zdrobi de tot, atunci ne vom răzbuna.",
                            "verse 44:17": "Înaintea lor, Noi am pus la încercare poporul lui Faraon şi a venit la ei un trimis cinstit.",
                            "verse 44:18": "“Aduceţi la mine pe robii lui Dumnezeu! Eu vă sunt vouă trimis vrednic de încredere!",
                            "verse 44:19": "Nu vă ridicaţi împotriva lui Dumnezeu! Eu vin la voi cu o împuternicire desluşită.",
                            "verse 44:20": "Eu caut izbăvire la Domnul meu şi Domnul vostru ca voi să nu mă ucideţi cu pietre.",
                            "verse 44:21": "Lăsaţi-mă singur, dacă nu aveţi încredere în mine.”",
                            "verse 44:22": "El îl chemă pe Domnul său: “Aceşti oameni sunt nelegiuiţi.”",
                            "verse 44:23": "“Pleacă cu robii Mei noaptea! Veţi fi urmăriţi...",
                            "verse 44:24": "Lasă marea să se despice! Ei vor fi o oştire înecată”",
                            "verse 44:25": "Câte grădini şi izvoare au părăsit,",
                            "verse 44:26": "şi semănături şi loc îmbelşugat,",
                            "verse 44:27": "şi plăceri în care se desfătau!",
                            "verse 44:28": "Aceasta, căci Noi am lăsat aceste bunuri moştenire unui alt popor.",
                            "verse 44:29": "N-au plâns după ei nici cerul, nici pământul şi nici nu au fost aşteptaţi.",
                            "verse 44:30": "Noi i-am mântuit pe fiii lui Israel de osânda umilitoare,",
                            "verse 44:31": "de Faraon care era trufaş peste măsură.",
                            "verse 44:32": "Noi cu ştiinţă i-am ales dintre lumi.",
                            "verse 44:33": "Le-am adus semne cu o dovadă vădită.",
                            "verse 44:34": "Aceşti oameni spuneau:",
                            "verse 44:35": "“Nu este decât moartea noastră dintâi, iar după aceea nu vom mai fi sculaţi.",
                            "verse 44:36": "Aduceţi-i pe taţii noştri, dacă spuneţi adevărul!”",
                            "verse 44:37": "Oare sunt ei mai buni decât poporul lui Tubba’ ori decât cei dinaintea lor pe care i-am nimicit fiindcă erau nelegiuiţi?",
                            "verse 44:38": "Noi nu am creat în joacă nici cerurile, nici pământul şi nici ceea ce se află între ele.",
                            "verse 44:39": "Noi le-am creat întru Adevăr, însă cei mai mulţi nu ştiu!",
                            "verse 44:40": "Ziua Cumpenei va fi sorocul adunării tuturor,",
                            "verse 44:41": "ziua când nimeni nu va putea oblădui pe nimeni şi când oamenii nu vor mai fi ajutaţi,",
                            "verse 44:42": "afară de cei pe care Dumnezeu îi va milui. El este Puternicul, Milostivul.",
                            "verse 44:43": "Copacul Zaqqum",
                            "verse 44:44": "este hrana păcătosului",
                            "verse 44:45": "ce îi va fierbe în pântece precum argintul topit,",
                            "verse 44:46": "precum apa clocotindă.",
                            "verse 44:47": "“Luaţi-l şi târâţi-l în fundul Iadului!",
                            "verse 44:48": "Turnaţi-i pe cap, ca osândă, apă clocotindă...”",
                            "verse 44:49": "“Gustă! Tu eşti puternicul, mărinimosul!?”",
                            "verse 44:50": "Aceasta este cea de care vă îndoiaţi!",
                            "verse 44:51": "Cei temători vor sta într-un loc tihnit,",
                            "verse 44:52": "în grădini, la izvoare.",
                            "verse 44:53": "Vor fi înveşmântaţi în mătase şi brocart şi aşezaţi faţă în faţă.",
                            "verse 44:54": "Noi le vom dărui drept soţii hurii cu ochii mari.",
                            "verse 44:55": "Acolo, vor cere în tihnă fructe de tot soiul.",
                            "verse 44:56": "Ei nu vor mai gusta moartea, după moartea lor dintâi, căci Dumnezeu i-a ferit de osânda Iadului.",
                            "verse 44:57": "Har Domnului tău! Aceasta este fericirea cea mare!",
                            "verse 44:58": "Noi l-am făcut lesne de înţeles în limba ta. Poate îşi vor aminti!",
                            "verse 44:59": "Pândeşte-i, căci şi ei te pândesc pe tine!"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Ха– — Ми–м",
                            "verse 44:2": "В знак Ясной Книги!",
                            "verse 44:3": "Мы ниспослали ее (вам)Одной благословенной ночью2101.Поистине, увещевающие Мы(против греха)! 2102",
                            "verse 44:4": "В ту ночь находят разрешеньеВсе мудрые дела (мирские)",
                            "verse 44:5": "По повелению от Нас;Поистине, Мы — посылающие (вамСвоих пророков)",
                            "verse 44:6": "По милосердию Владыки твоего;Поистине, Он слышит все и знаетобо всем! —",
                            "verse 44:7": "Владыки неба и земли,(А также) и того, что между ними, —Коль в (своей) вере непреклонны вы.",
                            "verse 44:8": "Нет божества, кроме Него, —Он и живит, и умертвляет, —Господь и ваш, и ваших праотцев.",
                            "verse 44:9": "И все ж, в сомнении об этом,Они2103 утехам предаются.",
                            "verse 44:10": "(Ты) подожди тот День,В который небо изведетДым, ясно зримый,",
                            "verse 44:11": "Что (пеленой) окутает сей люд,И будет это тяжкой карой,",
                            "verse 44:12": "И взмолят они: «Господь наш!Ты эту кару отврати от нас, —Мы веруем!»",
                            "verse 44:13": "Так чем же было увещание для них,Коль к ним пришел посланник явный?",
                            "verse 44:14": "Они же отвратились от негои говорили:«Наученный (другими)! Одержимый!»",
                            "verse 44:15": "Мы вашу кару нанемного отвратим,Но вы ведь, истинно, опять(к неверию) вернетесь!",
                            "verse 44:16": "Наступит День,Когда Мы схватим (вас) великойхваткой, —Тогда Мы отомстим!",
                            "verse 44:17": "Мы испытали тех людей,Что были с Фараоном:Пришел посланник2104 досточтимыйк ним",
                            "verse 44:18": "(И так сказал):«Верните мне служителей Господних.Поистине, я к вам от Господапосланник верный.",
                            "verse 44:19": "Над Господом не возноситесь2105, —Ведь я иду к вам с явной властью.",
                            "verse 44:20": "Ищу спасенья я у моего и вашегоВладыки,Чтоб не побили вы меня камнями.",
                            "verse 44:21": "А коль не верите вы мне,То отделитесь от меня!»",
                            "verse 44:22": "[Но Фараон не внял ему и былковарен].Тогда воззвал он к своему Владыке:«Это, поистине, народ, предавшийсягреху».",
                            "verse 44:23": "[Ему ответом было]:«Ты ночью выведи служителей Моих.За вами будет (послана) погоня.",
                            "verse 44:24": "Ты борозду на море за собой оставь.Поистине, им быть тем войском,Которое (велением Аллаха)потопленным пребудет».",
                            "verse 44:25": "О, сколько же оставили ониСадов и родниковых вод,",
                            "verse 44:26": "Засеянных полей,Величественных зданий",
                            "verse 44:27": "И изобилие, в котором забавлялись!",
                            "verse 44:28": "Таким (был их конец)!И это все Мы отдали в наследиедругому люду.",
                            "verse 44:29": "О них не плакали ни небо, ни земля.Им больше не было дано отсрочки,",
                            "verse 44:30": "И Мы сынов Исраиля спаслиОт унизительного наказанья —",
                            "verse 44:31": "От Фараона,Кто был надменнейшимиз преступивших(Пределы, установленные Богом).",
                            "verse 44:32": "И Мы избрали их над прочим людомПо ведению Своему;",
                            "verse 44:33": "И Мы представили знаменья им,В которых явным было испытание(для них).",
                            "verse 44:34": "А эти2106 говорят:",
                            "verse 44:35": "«Есть первая2107,Одна-единственная смерть для нас,И (никогда) не будем мы воскрешены!",
                            "verse 44:36": "(Вы) возвратите нам наших отцов,Коль вы (в своих словах) правдивы».",
                            "verse 44:37": "Неужто они лучшеНарода Тубба2108 или тех, кто былдо них?Мы потому их погубили,Что были они все виновны.",
                            "verse 44:38": "И Мы не для забавы сотворилинебеса, и землю,И все, что суще между ними.",
                            "verse 44:39": "Мы сотворили их,Чтобы явить (вам) Истину (Свою),Но большинство из них не разумеет.",
                            "verse 44:40": "Поистине, День Разделения есть срок,Назначенный для всех, —",
                            "verse 44:41": "Тот День,Когда никто (из покровителеймирских)Ни от чего другого не избавит,И не найти им помощи нигде,",
                            "verse 44:42": "Помимо тех, кого помилует Аллах, —Ведь Он могуч и милосерд!",
                            "verse 44:43": "Плоды заккума",
                            "verse 44:44": "Будут пищею для грешного(неверца)2109,",
                            "verse 44:45": "И, как расплавленная медь,Она будет кипеть в их чреве,",
                            "verse 44:46": "Точно бурлящий кипяток.",
                            "verse 44:47": "И голос прозвучит:«Схватить егоИ бросить в огненное сердце Ада!",
                            "verse 44:48": "Пролейте кару огненного кипяткаНа голову его!»",
                            "verse 44:49": "Вкуси же этого, —Ведь ты могуч и знатен2110.",
                            "verse 44:50": "Вот то, в чем сомневался ты.",
                            "verse 44:51": "Поистине, благочестивым бытьв надежном месте,",
                            "verse 44:52": "Среди Садов и родниковых вод.",
                            "verse 44:53": "Одетые в атлас и шелк,Они друг против друга (разместятся).",
                            "verse 44:54": "Так (будет)! Мы им дадим напарницС большими лучезарными глазами.",
                            "verse 44:55": "Там к их услугам всякие плодыВ усладе безопасной.",
                            "verse 44:56": "Им не вкусить там смерть, помимопервой2111.Он их от мук Огня избавит —",
                            "verse 44:57": "По щедрости Владыки твоего.Сие есть величайшее признание(Аллаха)!",
                            "verse 44:58": "Поистине, Мы облегчили этот(Аль Кор’ан),(Послав его) на языке твоем,Чтобы могли они понять.",
                            "verse 44:59": "59.А потому ты жди, —Ведь они тоже ждут2112."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "hm.",
                            "verse 44:2": "¡Por la Escritura clara!",
                            "verse 44:3": "¡La hemos revelado en una noche bendita! ¡Hemos advertido!",
                            "verse 44:4": "En ella se decide todo asunto sabiamente,",
                            "verse 44:5": "como cosa venida de Nosotros. Mandamos a enviados",
                            "verse 44:6": "como misericordia venida de tu Señor. Él es Quien todo lo oye, Quien todo lo sabe,",
                            "verse 44:7": "Señor de los cielos, de la tierra y de lo que entre ellos está. Si estuvierais convencidos...",
                            "verse 44:8": "No hay más dios que Él. Él da la vida y da la muerte. Vuestro Señor y Señor de vuestros antepasados.",
                            "verse 44:9": "Pero ¡no! Ellos dudan y no lo toman en serio.",
                            "verse 44:10": "¡Espera, pues, el día que el cielo traiga un humo visible,",
                            "verse 44:11": "que cubra a los hombres! Será un castigo doloroso.",
                            "verse 44:12": "«¡Señor! ¡Aparta de nosotros el castigo! ¡Creemos!»",
                            "verse 44:13": "¿De qué les servirá la amonestación, si ha venido a ellos un Enviado que habla claro",
                            "verse 44:14": "y se han apartado de él y dicho: «¡Es uno a quien se ha instruido, un poseso!»?",
                            "verse 44:15": "«Vamos a apartar de vosotros el castigo por algún tiempo. Pero reincidiréis».",
                            "verse 44:16": "El día que hagamos uso del máximo rigor, Nos vengaremos.",
                            "verse 44:17": "Antes que a ellos, habíamos probado al pueblo de Faraón. Un enviado noble vino a ellos:",
                            "verse 44:18": "«¡Entregadme a los siervos de Alá! Tenéis en mí a un enviado digno de confianza.",
                            "verse 44:19": "¡No os mostréis altivos con Alá! Vengo a vosotros con autoridad manifiesta.",
                            "verse 44:20": "Me refugio en mi Señor y Señor vuestro contra vuestro intento de lapidarme.",
                            "verse 44:21": "Si no os fiáis de mí, ¡dejadme!»",
                            "verse 44:22": "Entonces, invocó a su Señor. «¡Ésta es gente pecadora!»",
                            "verse 44:23": "«¡Sal de noche con Mis siervos! Os perseguirán.",
                            "verse 44:24": "¡Deja el mar en calma! Son un ejército que será anegado»",
                            "verse 44:25": "¡Cuántos jardines y fuentes abandonaron,",
                            "verse 44:26": "cuántos campos cultivados, cuántas suntuosas residencias,",
                            "verse 44:27": "cuánto bienestar, en el que vivían felices!",
                            "verse 44:28": "Así fue y se lo dimos en herencia a otro pueblo.",
                            "verse 44:29": "Ni el cielo ni la tierra les lloraron. No se les concedió prórroga.",
                            "verse 44:30": "Y salvamos a los Hijos de Israel del humillante castigo,",
                            "verse 44:31": "de Faraón. Era altivo, de los inmoderados.",
                            "verse 44:32": "Les elegimos conscientemente de entre todos los pueblos.",
                            "verse 44:33": "Les dimos signos con los que les pusimos claramente a prueba.",
                            "verse 44:34": "Éstos dicen, sí:",
                            "verse 44:35": "«No moriremos más que una sola vez y no seremos resucitados.",
                            "verse 44:36": "¡Haced, pues, volver a nuestros padres, si es verdad lo que decís!»",
                            "verse 44:37": "¿Eran mejores ellos que el pueblo de Tubba y que sus antecesores? Les hicimos perecer, eran pecadores.",
                            "verse 44:38": "No hemos creado los cielos, la tierra y lo que entre ellos está por puro juego.",
                            "verse 44:39": "No los creamos sino con un fin, pero la mayoría no saben.",
                            "verse 44:40": "El día del Fallo se darán todos cita.",
                            "verse 44:41": "Día en que nadie podrá proteger nada a nadie, nadie será auxiliado,",
                            "verse 44:42": "salvo aquél de quien Alá se apiade. Él es el Poderoso, el Misericordioso.",
                            "verse 44:43": "El árbol de Zaqqum",
                            "verse 44:44": "es el alimento del pecador.",
                            "verse 44:45": "Es como metal fundido, hierve en las entrañas",
                            "verse 44:46": "como agua hirviente.",
                            "verse 44:47": "«¡Cogedle y llevadle en medio del fuego de la gehena!",
                            "verse 44:48": "¡Castigadle, luego, derramando en su cabeza agua muy caliente!»",
                            "verse 44:49": "«¡Gusta! ¡Tú eres 'el poderoso', 'el generoso'!»",
                            "verse 44:50": "¡Esto es aquello de que dudabais!",
                            "verse 44:51": "Los que teman a Alá estarán, en cambio, en lugar seguro,",
                            "verse 44:52": "entre jardines y fuentes,",
                            "verse 44:53": "vestidos de satén y de brocado, unos enfrente de otros.",
                            "verse 44:54": "Así será. Y les daremos por esposas a huríes de grandes ojos.",
                            "verse 44:55": "Pedirán allí en seguridad, toda clase de frutas.",
                            "verse 44:56": "No gustarán alli otra muerte que la primera y Él les preservará del castigo del fuego de la gehena,",
                            "verse 44:57": "como favor de tu Señor. ¡Ése es el éxito grandioso!",
                            "verse 44:58": "En verdad, lo hemos hecho fácil en tu lengua. Quizás, así, se dejen amonestar.",
                            "verse 44:59": "¡Observa, pues! Ellos observan...."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "ஹா, மீம்.",
                            "verse 44:2": "தெளிவான இவ்வேதத்தின் மீது சத்தியமாக!",
                            "verse 44:3": "நிச்சயமாக, நாம் அதனை பாக்கியமுள்ள இரவிலே இறக்கினோம்; நிச்சயமாக (அதன் மூலம்) அச்சமூட்டி எச்சரித்துக் கொண்டே இருக்கின்றோம்.",
                            "verse 44:4": "அதில் முக்கியமான ஒவ்வொரு விஷயங்களும் தீர்மானிக்கப்படுகிறது.",
                            "verse 44:5": "அக்கட்டளை நம்மிடமிருந்து வந்ததாகும்; நாம் நிச்சயமாக (தூதர்களை) அனுப்புபவர்களாக இருந்தோம்.",
                            "verse 44:6": "(அது) உம்முடைய இறைவனிடமிருந்து வந்துள்ள ரஹ்மத்தாகும்; நிச்சயமாக, அவன் (யாவற்றையும்) செவியேற்பவன்; நன்கறிபவன்.",
                            "verse 44:7": "நீங்கள் உறுதியுடையவர்களாயிருப்பின், வானங்கள், பூமி, இவ்விரண்டிற்கு மிடையிலுள்ளவை ஆகியவற்றிற்கு அவனே இறைவன் (என்பதைக் காண்பீர்கள்).",
                            "verse 44:8": "அவனையன்றி (வேறு) நாயன் இல்லை. அவன் உயிர்ப்பிக்கிறான்; அவனே மரிக்கச் செய்கிறான்; அவனே உங்கள் இறைவனாகவும் முன் சென்ற உங்கள் மூதாதையரின் இறைவனாகவும் இருக்கின்றான்.",
                            "verse 44:9": "ஆனால், அவர்கள் சந்தேகத்தில் விளையாடிக் கொண்டிருக்கிறார்கள்.",
                            "verse 44:10": "ஆகவே, வானம் ஒரு தெளிவான புகையைக் கொண்டு வரும் நாளை நீர் எதிர் பார்ப்பீராக.",
                            "verse 44:11": "(அப்புகை) மனிதர்களைச் சூழ்ந்து கொள்ளும்; \"இது நோவினை செய்யும் வேதனையாகும்.\"",
                            "verse 44:12": "\"எங்கள் இறைவனே! நீ எங்களை விட்டும் இந்த வேதனையை நீக்குவாயாக! நிச்சயமாக நாங்கள் முஃமின்களாக இருக்கிறோம்\" (எனக் கூறுவர்).",
                            "verse 44:13": "நினைவுறுத்தும் நல்லுபதேசம் அவர்களுக்கு எவ்வாறு (அந்நேரம்) பயனளிக்கும்? (முன்னமேயே சத்தியத்தை) விளக்குபவரான தூதர் அவர்களிடம் வந்திருக்கின்றார்.",
                            "verse 44:14": "அவர்கள் அவதை விட்டுப் பின் வாங்கிக் கொண்டு (மற்றவர்களால் இவர்) \"கற்றுக் கொடுக்கப்பட்டவர்; பைத்தியக்காரர்\" எனக் கூறினர்.",
                            "verse 44:15": "நிச்சயமாக நாம் வேதனையைச் சிறிது (காலத்திற்காக) விலக்குவோம்; (ஆனால், பின்னரும்) நீங்கள் நிச்சயமாகத் (தீமையின் பக்கம்) திரும்புபவர்களே.",
                            "verse 44:16": "ஒருநாள் நாம் (உங்களைப்) பெரும் பிடியாகப் பிடிப்போம்; நிச்சயமாக (அந்நாளில்) நாம் பழி தீர்ப்போம்.",
                            "verse 44:17": "அன்றியும், நாம் இவர்களுக்கு முன்னரே ஃபிர்அவ்னுடைய சமூகத்தவரை நிச்சயமாகச் சோதித்தோம்; கண்ணியமான தூதரும் அவர்களிடம் வந்தார்.",
                            "verse 44:18": "அவர் (கூறினார்;) \"என்னிடம் நீங்கள் அல்லாஹ்வின் அடியார்களை ஒப்படைத்து விடுங்கள்; நிச்சயமாக நான் உங்களுக்கு நம்பிக்கைக்குரிய (இறை) தூதனாவேன்.",
                            "verse 44:19": "அன்றியும், \"நீங்கள் அல்லாஹ்வுக்கு எதிராக உங்களை உயர்த்திக் கொள்ளாதீர்கள்; நிச்சயமாக நான் உங்களிடம் தெளிவான சான்றுகளுடன் வந்திருக்கின்றேன்.",
                            "verse 44:20": "அன்றியும், \"என்னை நீங்கள் கல்லெறிந்து கொல்லாதிருக்கும் பொருட்டு நான், என்னுடைய இறைவனும் உங்களுடைய இறைவனுமாகிய அவனிடமே நிச்சயமாகப் பாதுகாவல் தேடுகிறேன்.",
                            "verse 44:21": "\"மேலும், நீங்கள் என் மீது நம்பிக்கை கொள்ளவில்லையாயின் என்னை விட்டு விலகிக் கொள்ளங்கள்\" (என்று மூஸா கூறினார்).",
                            "verse 44:22": "(அவர்கள் வரம்பு மீறியவர்களாகவே இருந்தார்கள்). \"நிச்சயமாக இவர்கள் குற்றவாளிகளான சமூகத்தாராகவே இருக்கிறார்கள்\" என்று தம் இறைவனிடம் பிரார்த்தித்துக் கூறினார்.",
                            "verse 44:23": "\"என் அடியார்களை (அழைத்து)க் கொண்டு, இரவில் நீர் (வேறிடம்) செல்க நிச்சயமாக நீங்கள பின் தொடரப்படுவீர்கள்\" (என்று இறைவன் கூறினான்.)",
                            "verse 44:24": "அன்றியும். அக்கடலைப் பிளவுள்ளதாகவே விட்டுச் செல்லும், நிச்சயமாக அவர்கள் (அதில்) மூழ்கடிக்கப்பட வேண்டிய படையினராகவே இருக்கின்றார்கள் (எனக் கூறி\" இறைவன் ஃபிர்அவ்னையும் அவன் படையினரையும் மூழ்கடித்தான்).",
                            "verse 44:25": "எத்தனை தோட்டங்களையும், நீர் ஊற்றுக்களையும் அவர்கள் விட்டுச் சென்றார்கள்?",
                            "verse 44:26": "இன்னும் (எத்தனையோ) விளைநிலங்களையும் நேர்த்தியான மாளிகைகளையும் (விட்டுச் சென்றார்கள்).",
                            "verse 44:27": "இன்னும் அவர்கள் இன்பமாக அனுபவித்துக் கொண்டிருந்த சுகானுபவங்களையும் (விட்டுச் சென்றார்கள்).",
                            "verse 44:28": "அவ்வாறே (முடிவு ஏற்பட்டதும்) அவற்றிற்கு வேறு சமூகத்தாரை வாரிசாக நாம் ஆக்கினோம்.",
                            "verse 44:29": "ஆகவே, அவர்களுக்காக வானமும் பூமியும் அழவுமில்லை (தப்பித்துக் கொள்ள) அவகாசமும் கொடுக்கப்பட்டவர்களாகவும் அவர்களில்லை.",
                            "verse 44:30": "நாம் இஸ்ராயீலின் சந்ததியை இழிவு தரும் வேதனையிலிருந்தும் திட்டமாகக் காப்பாற்றினோம்;",
                            "verse 44:31": "ஃபிர்அவ்னை விட்டும் (காப்பாற்றினோம்) நிச்சயமாக அவன் ஆணவம் கொண்டவனாக, வரம்பு மீறியவனாக இருந்தான்.",
                            "verse 44:32": "நிச்சயமாக, நாம் நன்கு தெரிந்தே அவர்களை உலக மக்களிலிருந்து தேர்ந்தெடுத்தோம்.",
                            "verse 44:33": "அன்றியும், நாம் அவர்களுக்கு அத்தாட்சிகளை கொடுத்தோம்; அவற்றில் துலக்கமான சோதனை இருந்தது.",
                            "verse 44:34": "நிச்சயமாக அவர்கள் (மக்கா காஃபிர்கள்) கூறுகிறார்கள்;",
                            "verse 44:35": "\"எங்களுக்கு முதலில் ஏற்படும் மரணத்தைத் தவிர வேறு எதுவுமில்லை நாங்கள் மீண்டும் எழுப்படுபவர்கள் அல்லர்.\"",
                            "verse 44:36": "\"நீங்கள் உண்மையாளர்களாக இருந்தால், எங்கள் மூதாதையரை (திரும்பக்) கொண்டு வாருங்கள்.\"",
                            "verse 44:37": "இவர்களும் மேலா? அல்லது 'துப்பஉ சமூகத்தார்களும், அவர்களுக்கு முன்னருந்தவர்களுமா? நிச்சயமாக அவர்கள் பாவம் செய்பவர்களாகவே இருந்தார்கள்; (ஆகவே) அவர்களை நாம் அழித்தோம்.",
                            "verse 44:38": "மேலும், வானங்களையும் பூமியையும் இவ்விரண்டிற்கும் இடையே உள்ளவற்றையும் விளையாட்டிற்காக நாம் படைக்கவில்லை.",
                            "verse 44:39": "இவ்விரண்டையும், சத்தியத்தைக் கொண்டேயன்றி நாம் படைக்கவில்லை. எனினும் அவர்களில் பெரும்பாலோர் (இதை) அறியமாட்டார்கள்.",
                            "verse 44:40": "நிச்சயமாக (நியாயத்) தீர்ப்பு நாள்தாம் அவர்கள் யாவருக்கும் குறிப்பிட்ட தவணையாகும்.",
                            "verse 44:41": "ஒரு நண்பன் மற்றொரு நண்பனுக்கு எவ்விதப் பயனும் அளிக்க முடியாத நாள்; அன்றியும் (அந்நாளில்) அவர்கள் உதவி செய்யப்படவும் மாட்டார்கள்.",
                            "verse 44:42": "(எவர்கள் மீது) அல்லாஹ் கிருபை செய்கிறானோ, அவர்களைத் தவிர - நிச்சயமாக அவன் (யாவரையும்) மிகைத்தவன்; மிக்க கிருபையுடையவன்.",
                            "verse 44:43": "நிச்சயமாக, ஜக்கூம் (கள்ளி) மரம் (அதுவே).",
                            "verse 44:44": "பாவிகளுக்குரிய உணவு",
                            "verse 44:45": "அது உருக்கப்பட்ட செம்பு போல் இருக்கும்; வயிறுகளில் அது கொதிக்கும்.",
                            "verse 44:46": "வெந்நீர் கொதிப்பதைப் போல்.",
                            "verse 44:47": "\"அவனைப்பிடித்துக் கொழுந்து விட்டெரியும் நரகத்தின் மையத்திற்கு இழுத்துச் செல்லுங்கள்.",
                            "verse 44:48": "\"பின்னர், அவனது தலைக்கு மேல் வேதனை கொடுக்கும் கொதிக்கும் நீரை ஊற்றுங்கள்.",
                            "verse 44:49": "\"நீ (இதைச்) சுவைத்துப்பார்! நிச்சயமாக நீ வல்லமை சாலியாகவும், சங்கையுடையவனாகவும் இருந்தாய்!",
                            "verse 44:50": "\"நிச்சயமாக இதுதான் நீங்கள் சந்தேகித்துக் கொண்டிருந்தீர்களே அதுவாகும்\" (என்று அவர்களிடம் சொல்லப்படும்).",
                            "verse 44:51": "பயபக்தியுடையவர்கள் நிச்சயமாக (அவர்கள்) அச்சமற்ற, இடத்தில் இருப்பார்கள்.",
                            "verse 44:52": "சுவனச் சோலைகளிலும், நீர் ஊற்றுகளிலும் (இருப்பார்கள்).",
                            "verse 44:53": "ஸுன்துஸ், இஸ்தப்ரக் (ஆகிய அழகிய பட்டாடைகள், பீதாம்பரங்கள்) அணிந்து ஒருவரை ஒருவர் முகம் நோக்கி இருப்பார்கள்.",
                            "verse 44:54": "இவ்வாறே (அங்கு நடைபெறும்) மேலும் அவர்களுக்கு ஹூருல் ஈன்களை நாம் மண முடித்து வைப்போம்.",
                            "verse 44:55": "அச்சமற்றவர்களாக, சகல விதக்கனிவகைகளையும், அங்கு கேட்டு(ப் பெற்றுக்) கொண்டுமிருப்பார்கள்.",
                            "verse 44:56": "முந்திய மரணத்தைத் தவிர, அங்கு மரணத்தை அவர்கள் அனுபவிக்கமாட்டார்கள்; மேலும் (இறைவன்) அவர்களை நரகத்தின் வேதனையை விட்டும் காப்பாற்றிவிட்டான்.",
                            "verse 44:57": "(இதுவே) உம்முடைய இறைவனின் அருள் கொடையும்; இதுவே மிகப் பெரிய வெற்றியமாகும்.",
                            "verse 44:58": "அவர்கள் (அறிந்து) நல்லுபதேசம் பெறுவதற்காக, இதை நாம் உம்முடைய மொழியில் எளிதாக்கினோம்.",
                            "verse 44:59": "ஆகவே, நீரும் எதிர்பார்ப்பீராக! அவர்களும் எதிர்பார்த்துக் கொண்டுதான் இருக்கிறார்கள்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "ฮามีม",
                            "verse 44:2": "ขอสาบานด้วยคัมภีร์อันชัดแจ้ง",
                            "verse 44:3": "แท้จริงเราได้ประทานอัลกุรอานลงมาในคืนอันจำเริญ แท้จริงเราเป็นผู้ตักเตือน",
                            "verse 44:4": "ในคืนนั้นทุก ๆ กิจการที่สำคัญถูกจำแนกไว้แล้ว",
                            "verse 44:5": "โดยทางบัญชามาจากเรา แท้จริงเราเป็นผู้ส่งมา",
                            "verse 44:6": "เป็นความเมตตาจากพระเจ้าของเจ้า แท้จริงพระองค์เป็นผู้ทรงได้ยิน ผู้ทรงรอบรู้",
                            "verse 44:7": "พระเจ้าแห่งชั้นฟ้าทั้งหลาย และแผ่นดินและสิ่งที่อยู่ระหว่างทั้งสอง หากพวกเจ้าเป็นผู้เชื่อมั่น",
                            "verse 44:8": "ไม่มีพระผู้เป็นเจ้าอื่นใดอีกนอกจากพระองค์ ผู้ทรงให้เป็นและผู้ทรงให้ตาย พระเจ้าของพวกเจ้าและพระเจ้าแห่งบรรพบุรุษของพวกเจ้าในสมัยก่อน ๆ",
                            "verse 44:9": "แต่ทว่าพวกเขากังวลอยู่ในการสงสัย",
                            "verse 44:10": "ดังนั้น เจ้าจงคอยเฝ้าดูวันที่ชั้นฟ้าจะนำไอหมอกออกมาซึ่งจะเห็นได้ชัด",
                            "verse 44:11": "ซึ่งจะครอบคลุมผู้คน นี่คือการลงโทษอันเจ็บปวด",
                            "verse 44:12": "(พวกเขาจะกล่าวว่า) ข้าแต่พระเจ้าของข้าพระองค์ได้ทรงปลดเปลื้องการลงโทษนี้ ให้พ้นจากข้าพระองค์ แท้จริงพวกเราเป็นผู้ศรัทธา",
                            "verse 44:13": "ข้อตักเตือนนั้นจะเป็นผลแก่พวกเขาได้อย่างไร ทั้ง ๆ ที่ได้มีร่อซู้ลผู้ชี้แจงอย่างแจ้งชัดมายังพวกเขาแล้ว",
                            "verse 44:14": "แล้วพวกเขาก็ผินหลังออกไปจากเขา และพวกเขากล่าวว่าเขา (มุฮัมมัด) เป็นคนบ้าที่ได้รับการเสี้ยมสอน",
                            "verse 44:15": "แน่นอนเราจะปลดเปลื้องการลงโทษนั้นให้พ้นไป (จากพวกเจ้า) ชั่วขณะหนึ่ง แล้วพวกเจ้าก็จะกลับไปสู่สภาพเดิม",
                            "verse 44:16": "วันที่เราจะปราบพวกเขาด้วยการปราบครั้งยิ่งใหญ่ แน่นอนเราเป็นผู้ตอบแทนอย่างสาสม",
                            "verse 44:17": "และโดยแน่นอน เราได้ทดสอบหมู่ชนของฟิรเอาน์ก่อนหน้าพวกเขา และได้มีร่อซู้ล (มูซา) ผู้มีเกียรติมายังพวกเขา",
                            "verse 44:18": "(โดยกล่าวว่า) จงมอบปวงบ่าวของอัลลอฮ์ให้แก่ฉัน แท้จริงฉันคือร่อซู้ลผู้ซื่อสัตย์สำหรับพวกท่าน",
                            "verse 44:19": "และพวกท่านอย่ายกตนเหนืออัลลอฮ์ แท้จริงฉันมาหาพวกท่านพร้อมด้วยหลักฐานอันชัดแจ้ง",
                            "verse 44:20": "และแท้จริงฉันขอความคุ้มครองต่อพระเจ้าของฉัน และพระเจ้าของพวกท่านมิให้พวกท่านทำร้ายฉัน",
                            "verse 44:21": "และถ้าหากพวกท่านไม่เชื่อฉันก็จงถอยห่างไปจากฉัน",
                            "verse 44:22": "แล้วเขาก็วิงวอนขอต่อพระเจ้าของเขาว่า ชนเหล่านี้เป็นหมู่ชนผู้กระทำความผิด",
                            "verse 44:23": "ดังนั้น จงเดินทางในเวลากลางคืนพร้อมด้วยปวงบ่าวของข้า เพราะพวกเจ้าจะถูกติดตามอย่างแน่นอน",
                            "verse 44:24": "และจงปล่อยทะเลให้สงบนิ่ง (เหมือนเดิม) เพราะแท้จริงพวกเขาเป็นไพร่พลที่ถูกจมน้ำตาย",
                            "verse 44:25": "กี่มากน้อยที่พวกเขาได้ทิ้งสวนหลากหลาย และน้ำพุหลายแห่ง",
                            "verse 44:26": "และเรือกสวนไร่นา และอาคารระโหฐานอันมีเกียรติ",
                            "verse 44:27": "และความสะดวกสะบายที่พวกเขาสนุกสนานร่าเริง",
                            "verse 44:28": "เช่นนั้นแหละ เราได้ให้หมู่ชนอื่นรับมรดกครอบครองมัน",
                            "verse 44:29": "และชั้นฟ้า และแผ่นดินมิได้ร่ำไห้เพราะ (เสียดาย) พวกเขาและพวกเขาจะไม่ถูกประวิงเวลา",
                            "verse 44:30": "และโดยแน่นอน เราได้ให้วงศ์วานของอิสราเอลรอดพ้นจากการทรมานที่น่าอดสู",
                            "verse 44:31": "จากฟิรเอาน์แท้จริงเขาเป็นผู้โอหังที่มาจากผู้ฝ่าฝืน",
                            "verse 44:32": "และโดยแน่นอนเราได้เลือกพวกเขาเหนือประชาชาติทั้งหลายในยุคนั้น เนื่องด้วยความรอบรู้ของเรา",
                            "verse 44:33": "และเราได้ประทานสัญญาณต่าง ๆ แก่พวกเขา ซึ่งในนั้นมีข้อทดสอบอย่างชัดแจ้ง",
                            "verse 44:34": "แท้จริงชนเหล่านั้น แน่นอนพวกเขาจะกล่าวว่า",
                            "verse 44:35": "มันเป็นเพียงความตายครั้งแรกของเรา และเราจะไม่ถูกให้ฟื้นคืนชีพขึ้นมาอีก",
                            "verse 44:36": "ดังนั้น จงนำบรรพบุรุษของเรากลับมาอีกซิ หากพวกท่านเป็นผู้ซื่อสัตย์จริง",
                            "verse 44:37": "พวกเขา (กุฟฟารมักกะฮ์) ดีกว่า หรือว่าหมู่ชนแห่งตุบบะอ์ (ชาวสะบะอ์แห่งเยเมน) และบรรดาหมู่ชนก่อนหน้าพวกเขาเราได้ทำลายล้างพวกเขา เพราะพวกเขาเหล่านั้นเป็นผู้กระทำความผิด",
                            "verse 44:38": "และเรามิได้สร้างชั้นฟ้าทั้งหลาย และแผ่นดิน และสิ่งที่อยู่ระหว่างทั้งสองอย่าง อย่างไร้สาระ",
                            "verse 44:39": "เรามิได้สร้างทั้งสอง (ดังกล่าวนั้น) เพื่ออื่นใดนอกจากเพื่อความจริง แต่ว่าส่วนมากของพวกเขาไม่รู้",
                            "verse 44:40": "แท้จริงวันแห่งการตัดสินนั้นเป็นเวลาที่ถูกกำหนดไว้สำหรับพวกเขาทั้งหมด",
                            "verse 44:41": "วันที่ญาติสนิทจะไม่อำนวยประโยชน์อันใดให้แก่ญาติสนิทอีกคนหนึ่งได้ และพวกเขาเองก็จะไม่ได้รับความช่วยเหลือ",
                            "verse 44:42": "เว้นแต่ผู้ที่อัลลอฮ์ทรงมีเมตตา แท้จริงพระองค์เป็นผู้ทรงอำนาจ ผู้ทรงเมตตาเสมอ",
                            "verse 44:43": "แท้จริงต้นซักกูม",
                            "verse 44:44": "จะเป็นอาหารของผู้ทำบาปมาก",
                            "verse 44:45": "เช่นทองแดงที่ถูกหลอมเดือด มันจะต้มเดือดอยู่ในท้อง",
                            "verse 44:46": "เช่นการเดือดพล่านของน้ำร้อน",
                            "verse 44:47": "(มีเสียงกล่าวแก่ยามเฝ้านรกว่า) จงจับเขาไปและลากเขาไปสู่กลางไฟที่ลุกโชน",
                            "verse 44:48": "แล้วจงราดลงบนหัวของเป็นการลงโทษแห่งน้ำเดือด",
                            "verse 44:49": "จงลิ้มรสการลงโทษซิ แท้จริงเจ้า (เคยพูดว่า) เป็นผู้มีอำนาจ ผู้มีเกียรติ",
                            "verse 44:50": "แท้จริง นี้คือสิ่งที่พวกเจ้าเคยสงสัยไว้",
                            "verse 44:51": "แท้จริงบรรดาผู้ยำเกรงจะอยู่ในสถานที่อันสงบปลอดภัย",
                            "verse 44:52": "ท่ามกลางสวนสวรรค์หลากหลาย และน้ำพุหลายแห่ง",
                            "verse 44:53": "พวกเขาจะสวมอาภรณ์ทำด้วยผ้าไหมละเอียด และผ้าไหมหยาบ หันหน้าเข้าหากัน",
                            "verse 44:54": "เช่นนั้นแหละเราจะให้พวกเขามีคู่ครอง เป็นหญิงสาววัยรุ่นมีดวงตาสวยงาม",
                            "verse 44:55": "พวกเขาจะเรียกเอาผลไม้ทุกชนิดที่อยู่ในสวนสวรรค์นั้นอย่างปลอดภัย",
                            "verse 44:56": "ในสวนสวรรค์นั้น พวกเขาจะไม่ได้ลิ้มรสความตาย นอกจากความตายครั้งแรก (ในโลกดุนยา) และพระองค์จะทรงคุ้มครองพวกเขาให้พ้นจากการลงโทษแห่งไฟนรก",
                            "verse 44:57": "เป็นความโปรดปรานจากพระเจ้าของเจ้า นั่นคือความสำเร็จอันใหญ่หลวง",
                            "verse 44:58": "ดังนั้นแท้จริงเราได้ทำให้อัลกุรอานเป็นที่ง่ายดายในภาษาของเจ้า (อาหรับ) เพื่อพวกเขาจะได้ใคร่ครวญ",
                            "verse 44:59": "ฉะนั้น จงคอยดูเถิด แท้จริงพวกเขาก็จะเป็นผู้คอยเช่นกัน"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Hâ. Mîm.",
                            "verse 44:2": "Apaçık olan Kitab'a andolsun ki,",
                            "verse 44:3": "[44.3]Biz onu (Kur'an'ı) mübarek bir gecede indirdik. Kuşkusuz biz uyarıcıyızdır.",
                            "verse 44:4": "[44.4]Her hikmetli işe o gecede hükmedilir.",
                            "verse 44:5": "[44.5](Yani)katımızdan (verilen her) emir. Çünkü biz, peygamberler göndermekteyiz.",
                            "verse 44:6": "[44.6]Senin Rabb'inin acıması gereği olarak (gönderdiyimiz elçilere o gece emirlerimizi bir bir açıklar,vahiylerimizi bildiririz) .Doğrusu o işitendir ,bilendir.",
                            "verse 44:7": "Eğer kesin olarak inanıyorsanız (bilin ki Allah), göklerin, yerin ve ikisi arasında bulunanların Rabbidir.",
                            "verse 44:8": "O'ndan başka ilâh yoktur. (Her şeyi O) diriltir ve öldürür. Sizin de Rabbiniz, önceki atalarınızın da Rabbidir.",
                            "verse 44:9": "Fakat onlar, şüphe içinde eğlenip duruyorlar.",
                            "verse 44:10": "Şimdi sen, göğün, açık bir duman çıkaracağı günü gözetle.",
                            "verse 44:11": "Duman insanları bürüyecektir. Bu, elem verici bir azaptır.",
                            "verse 44:12": "(İşte o zaman insanlar:) Rabbimiz! Bizden azabı kaldır. Doğrusu biz artık inanıyoruz (derler).",
                            "verse 44:13": "Nerede onlarda öğüt almak? Oysa kendilerine gerçeği açıklayan bir elçi gelmişti.",
                            "verse 44:14": "Sonra ondan yüz çevirdiler ve: Bu, öğretilmiş bir deli! dediler.",
                            "verse 44:15": "Biz azabı birazcık kaldıracağız, ama siz yine (eski halinize) döneceksiniz.",
                            "verse 44:16": "Fakat biz büyük bir şiddetle yakalayacağımız gün, kesinlikle intikamımızı alırız.",
                            "verse 44:17": "Andolsun, kendilerinden önce biz, Firavun'un kavmini de imtihan etmiştik. Onlara şerefli bir elçi geldi.(Şöyle diyerek)",
                            "verse 44:18": "[44.18]\"Allah'ın kulları! Bana gelin! Çünkü ben size (gönderilmiş) güvenilir bir resûlüm\"",
                            "verse 44:19": "Allah'a karşı ululuk taslamayın. Çünkü ben size apaçık bir delil getiriyorum.",
                            "verse 44:20": "Ben, beni taşlamanızdan, benim ve sizin Rabbiniz olan Allah'a sığındım.",
                            "verse 44:21": "Eğer bana inanmazsanız, hiç değilse yanımdan uzaklaşın.",
                            "verse 44:22": "Bunun üzerine Musa: Bunlar suç işleyen bir toplumdur, diye Rabbine arzetti.",
                            "verse 44:23": "Allah, O halde kullarımı geceleyin yola çıkar. Çünkü takip edileceksiniz, buyurdu.",
                            "verse 44:24": "Denizi açık halde bırak. Çünkü onlar boğulacak bir ordudur.",
                            "verse 44:25": "Onlar geride nice şeyler bıraktılar; bahçeler,çeimeler,",
                            "verse 44:26": "[44.26]Ekinler, güzel konaklar,",
                            "verse 44:27": "Ve zevkü sefa sürdükleri nice nimetler!",
                            "verse 44:28": "İşte böylece biz de onları başka bir topluma miras bıraktık.",
                            "verse 44:29": "Gök ve yer onların ardından ağlamadı; onlara mühlet de verilmedi.",
                            "verse 44:30": "Andolsun biz, İsrailoğullarını o alçaltıcı azaptan kurtardık.",
                            "verse 44:31": "Yani Firavun'dan. Çünkü o bir zorba idi, aşırı gidenlerdendi.",
                            "verse 44:32": "Andolsun biz İsrailoğullarına, bilerek, (kendi zamanlarında) âlemlerin üstünde bir imtiyaz verdik.",
                            "verse 44:33": "Onlara, içinde açık bir imtihan bulunan işaretler verdik.",
                            "verse 44:34": "Onlar (müşrikler) diyorlar ki:",
                            "verse 44:35": "[44.35]\"İlk ölümümüzden sonra bir şey yoktur. Biz diriltilecek değiliz.\"",
                            "verse 44:36": "[44.36]\" Doğru söylüyorsanız, atalarımızı getirin.\"",
                            "verse 44:37": "Bunlar mı daha hayırlı, yoksa Tübba' kavmi ile onlardan öncekiler mi? Onları yok ettik, çünkü onlar suçlu idiler.",
                            "verse 44:38": "Biz gökleri, yeri ve bunlar arasında bulunanları, oyun ve eğlence olsun diye yaratmadık.",
                            "verse 44:39": "Onları sadece gerçek bir sebeple yarattık. Fakat onların çoğu bilmiyorlar.",
                            "verse 44:40": "Şüphesiz (hakkı bâtıldan ayıran) hüküm günü, hepsinin bir arada buluşacağı gündür.",
                            "verse 44:41": "O gün, dostun dosta hiçbir faydası olmaz, kendilerine yardım da edilmez.",
                            "verse 44:42": "Ancak Allah'ın merhamet ettiği kimseler böyle değildir. Şüphesiz O, üstündür, merhametlidir.",
                            "verse 44:43": "Şüphesiz zakkum ağacı,",
                            "verse 44:44": "[44.44]Günahkârların yemeğidir.",
                            "verse 44:45": "O, karınlarda maden eriyiği kaynar.",
                            "verse 44:46": "[44.46]Sıcak suyun kaynaması gibi .",
                            "verse 44:47": "(Allah zebânilere emreder): Tutun onu! Cehennemin ortasına sürükleyin!",
                            "verse 44:48": "Sonra başına azap olarak kaynar su dökün!",
                            "verse 44:49": "(Ve deyin ki:) Tat bakalım. Hani sen kendince üstündün, şerefliydin!",
                            "verse 44:50": "[44.50]İşte bu, şüphelenip durduğunuz şeydir.",
                            "verse 44:51": "Müttakîler ise hakikaten güvenilir bir makamdadırlar.",
                            "verse 44:52": "Bahçelerde ve pınar başlarındadırlar.",
                            "verse 44:53": "İnce ipekten ve parlak atlastan giyerek karşılıklı otururlar.",
                            "verse 44:54": "İşte böyle. Bunun yanısıra biz onları, iri gözlü hûrilerle evlendiririz.",
                            "verse 44:55": "Orada, güven içinde (canlarının çektiği) her meyveyi isterler.",
                            "verse 44:56": "İlk tattıkları ölüm dışında, orada artık ölüm tatmazlar. Ve Allah onları cehennem azabından korumuştur (sürekli hayata kavuşmuşlardır).",
                            "verse 44:57": "(Bunlar) Rabbinden bir lütuf olarak (verilmiştir). İşte büyük kurtuluş budur.",
                            "verse 44:58": "Biz onu (Kur'an'ı), öğüt alalar diye senin dilinde indirerek kolayca anlaşılmasını sağladık.",
                            "verse 44:59": "(Yine de inanmayanların başlarına gelecekleri) bekle; onlar da beklemektedirler. l. Hâ. Mîm."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 44:1": "Ҳа-а. Мийм.",
                            "verse 44:2": "Очиқ-ойдин Китобга қасам.",
                            "verse 44:3": "Албатта, Биз уни муборак кечада нозил қилдик. Албатта, Биз огоҳлантиргувчи бўлдик. (Ушбу оятда зикр этилаётган, Қуръон нозил қилинган кеча муборак Рамазон ойининг кечаларидан бири бўлмиш «Лайлатул қадр»дир. Бу кеча, дунё тарихидаги энг муборак кечадир. Чунки, бу кечада Аллоҳ таолонинг охирги, баркамол ва бутун инсониятга қиёмат кунигача саодат йўлини кўрсатиб берувчи китоби туша бошлаган.)",
                            "verse 44:4": "Ўша(кеча)да ҳар бир ҳикматли иш ажратилиб, ҳал қилинур.",
                            "verse 44:5": "Биз томонимиздан бўлган амрга биноан. Албатта, Биз Пайғамбар юборгувчи бўлдик.",
                            "verse 44:6": "Роббинг томонидан (кўрсатилган) раҳматдир. Албатта, Унинг Ўзи ўта эшитгувчи, ўта билгувчи зотдир.",
                            "verse 44:7": "Осмонлару ернинг ва уларнинг орасидаги нарсаларнинг Роббидир. Гар ишонгувчи бўлсангиз.",
                            "verse 44:8": "Ундан ўзга ибодатга сазовор зот йўқ. У тирилтирур ва ўлдирур. У сизнинг Роббингиз ва ота- боболарингизнинг Роббидир.",
                            "verse 44:9": "Йўқ! Улар шак-шубҳада, ўйнамоқдалар.",
                            "verse 44:10": "Бас, осмон аниқ тутунни келтирадиган кунни кут.",
                            "verse 44:11": "У одамларни ўраб олур. Бу аламли азобдир.",
                            "verse 44:12": "Эй Роббимиз! Биздан азобни кушойиш қил! Албатта, Биз иймон келтиргувчидирмиз.",
                            "verse 44:13": "Уларга қаёқдан ҳам эслатма бўлсин. Ҳолбуки, уларга очиқ-ойдин Пайғамбар келган эди.",
                            "verse 44:14": "Сўнгра ундан юз ўгирдилар ва: «Бу ўргатилган мажнун», дедилар.",
                            "verse 44:15": "Албатта, Биз азобни озгина кушойиш қилгувчимиз. Албатта, сизлар қайтгувчисизлар. (Биз сиздан азобни озгина кушойиш қиламиз. Аммо сиз бундан ибрат олмайсиз, яна куфрга қайтасиз.)",
                            "verse 44:16": "Катта ушлаш ила ушлаганимиз куни, албатта, Биз интиқом олгувчимиз. (Бу ушлаш ва интиқом олиш қиёмат кунидадир.)",
                            "verse 44:17": "Батаҳқиқ, улардан олдин Фиръавн қавмини синадик. Уларга карамли Пайғамбар келди.",
                            "verse 44:18": "«Сизлар менга Аллоҳнинг бандаларини беринглар. Албатта, мен сизларга ишончли Пайғамбарман.",
                            "verse 44:19": "Ва Аллоҳга мутакаббирлик қилманг. Албатта, мен сизга очиқ-ойдин ҳужжат келтирурман.",
                            "verse 44:20": "Ва, албатта, мен ўзимнинг Роббим ва сизнинг Роббингиздан мени тошбўрон қилишингиздан паноҳ сўрадим.",
                            "verse 44:21": "Ва агар менга иймон келтирмасангиз, мендан четланинг», деб.",
                            "verse 44:22": "Бас, у(Мусо) Роббига: «Албатта, анавилар жиноятчи қавмдир», деб дуо қилди.",
                            "verse 44:23": "Бас, бандаларим ила кечаси юриб кет. Албатта, сиз изингиздан қувилурсиз. (Бани Исроилни олиб, кечаси Мисрдан чиқиб кет. Душман, албатта, сизларнинг изингиздан тушади.)",
                            "verse 44:24": "Ва денгизни сокин ҳолида қўй, албатта, улар ғарқ қилинадиган қўшиндир. (Дарҳақиқат, Фиръавн ва унинг аскарлари ҳам тўхтаб турган денгиз сари тушдилар. Ҳаммалари денгизда очилган йўлга тушиб бўлганларидан кейин шу дамгача иккига бўлиниб сокин турган сув ҳаракатга келди ва уларни ғарқ қилди.)",
                            "verse 44:25": "Улар ортларидан қанчадан-қанча боғу роғларни ва булоқларни.",
                            "verse 44:26": "Экинзорларни ва яхши жойларни.",
                            "verse 44:27": "Ва ўзлари ичида маза қилаётган нозу неъматларни қолдирдилар.",
                            "verse 44:28": "Мана шундай! Биз у(нарса)ларни бошқа қавмларга мерос қилиб бердик.",
                            "verse 44:29": "Бас, уларга осмон ҳам, ер ҳам йиғламади ва улар муҳлат берилганлардан ҳам бўлмадилар.",
                            "verse 44:30": "Батаҳқиқ, Бани Исроилга хорловчи азобдан.",
                            "verse 44:31": "Фиръавндан нажот бердик. Албатта, у мутакаббир ва ҳаддидан ошганлардан эди. (Фиръавн ва қавмини ҳалок қилиш билан биз Бани Исроилни азобдан озод этдик. Улар унинг қавми қўл остида азоб чекар эдилар.)",
                            "verse 44:32": "Батаҳқиқ, Биз уларни билиб туриб, оламлар ичидан танлаб олдик.",
                            "verse 44:33": "Ва уларга оят-мўъзижалардан ичида очиқ-ойдин синов бор нарсаларни бердик. (Аллоҳ таоло Бани Исроилга турли оят-мўъжизалар юборди. Уларда синов бор эди.)",
                            "verse 44:34": "Албатта, анавилар дерлар:",
                            "verse 44:35": "«Биринчи ўлимимиздан бошқа ҳеч қандай ўлим йўқ ва биз қайта тирилтирилувчи эмасмиз.",
                            "verse 44:36": "Агар ростгўй бўлсангиз, ота-боболаримизни келтиринглар».",
                            "verse 44:37": "Улар яхшироқми ёки Туббаъ қавмию улардан олдин ўтганларми?! Биз уларни ҳалок қилдик. Албатта, улар жиноятчи бўлган эдилар. (« Туббаъ» Яман подшоҳларининг лақабидир. Араблар ичида уларнинг довруғи кенг тарқалган эди.)",
                            "verse 44:38": "Осмонлару ерни ва уларнинг орасидаги нарсаларни ўйнаб яратганимиз йўқ!",
                            "verse 44:39": "Биз уларни фақат ҳақ ила яратдик, лекин кўплари билмаслар.",
                            "verse 44:40": "Албатта, ажратиш куни барчалари учун белгиланган вақтдир. («Ажратиш куни» қиёматнинг номларидан бири. У кунда ҳақ ботилдан, мўминни кофирдан, яхши ёмондан ажратилади. Шунинг учун ҳам « ажратиш куни « деб номланган. Ана ўша кун ҳамманинг қайта тирилиши ва тўпланиши учун белгиланган вақтдир.)",
                            "verse 44:41": "У кунда дўст дўстга бирон нарсада асқотмас ва уларга ёрдам ҳам берилмас.",
                            "verse 44:42": "Магар кимга Аллоҳ раҳм қилсагина (ёрдам берилур). Албатта, У азиз ва ўта раҳмли зотдир. (Азиз ва раҳимли сифати ила мўмин-мусулмон, тақводор бандаларига раҳм қилади, ёрдам беради.)",
                            "verse 44:43": "Албатта, Заққум дарахти.",
                            "verse 44:44": "Гуноҳкорлар таомидир.",
                            "verse 44:45": "У худди эритилган маъдандек қоринларда қайнайдир.",
                            "verse 44:46": "Қайноқ сувнинг қайнашига ўхшайдир. (Дўзахилар қоринлари очса, нима ейишади? Уларга қоринлари очганида таом учун Заққум дарахтининг меваси берилади. Заққум аччиқлиги ва заҳарлилиги билан оғизларда зарбулмасал бўлиб кетган. Ана ўша заҳар гуноҳкорларга таом бўлади, қоринларида эритилган маъдан, темир ёки мисдек ёхуд доғ қилинаётган ёғдек қайнаб туради. У худди сувдек қайнайди.)",
                            "verse 44:47": "Уни тутиб, жаҳиймнинг ўртасига судраб олиб боринглар!",
                            "verse 44:48": "Сўнгра боши устидан қайноқ сув азобини қуйинглар!",
                            "verse 44:49": "Тотиб кўр! Албатта, сен ўзинг «азизу мукаррамсан»!",
                            "verse 44:50": "Албатта, бу сиз (бўлишида) шубҳа қилиб юрган нарсадир!",
                            "verse 44:51": "Албатта, тақводорлар омонлик жойида.",
                            "verse 44:52": "Боғу роғлар ва булоқларда бўлурлар.",
                            "verse 44:53": "Улар шойи ипак киюрлар, бир-бирларига юзма-юз ҳолда (ўлтирурлар).",
                            "verse 44:54": "Ана шундай! Ва Биз уларни ҳури ийнларга уйлантирдик.",
                            "verse 44:55": "Улар у ерда омонлик ҳолларида турли меваларни чақирурлар.",
                            "verse 44:56": "Улар у ерда биринчи ўлимдан бошқа ўлимни тотмаслар. У зот уларни жаҳийм азобидан сақлар. (Яъни, тақводорлар бу дунёдан у дунёга ўтишда тотган ўлимдан бошқа ўлимни тотмайдилар, жаннатда абадий тирик қоладилар. Ҳамда Аллоҳ таоло уларни дўзах азобидан сақлайди.)",
                            "verse 44:57": "Бу Роббингдан бўлган фазлдир. Ана шу улкан ютуқдир.",
                            "verse 44:58": "Бас, албатта, Биз у(Қуръон)ни сенинг тилинг ила осонлаштирдик. Шоядки эсласалар.",
                            "verse 44:59": "Бас, кутиб тур. Улар ҳам кутгувчидирлар."
                        }
                    }
                }
            }
        }
    }
}