{
    "id": 50,
    "name_simple": "Qaf",
    "revelation_place": "makkah",
    "revelation_order": 34,
    "bismillah_pre": true,
    "verses_count": 45,
    "short_text": "The Surah derives its name from the initial letter Qaf, thereby implying that it is the Surah which opens with the alphabetic letter Qaf.",
    "text": [
        "\n",
        "The Surah derives its name from the initial letter Qaf, thereby implying that it is the Surah which opens with the alphabetic letter Qaf.",
        "\n",
        "Period of Revelation",
        "\n",
        "There is no authentic tradition to show as to when exactly this Surah was sent down. A study of the subject matter, however, reveals that its period of revelation is the second stage of the Holy Prophet's life at Makkah, which lasted from the third year of the Prophethood till the fifth year. We have given the characteristics of this period in the Introduction to the Surah Al-An'am. In view of those characteristics it can be said that this Surah might have been sent down in about the 5th year, when the antagonism of the disbelievers had become quite intense but had not yet assumed tyrannical proportions.",
        "\n",
        "Theme and Topics",
        "\n",
        "Authentic traditions show that the Holy Prophet used to recite this Surah generally in the Prayer on the Eid days. A woman named Umm Hisham bin Harithah, who was a neighbor of the Holy Prophet, says that she was able to commit Surah Qaf to memory only because she often heard it from the Holy Prophet in the Friday sermons. According to some other traditions he often recited it in the Fajr Prayer. This makes it abundantly clear that this was an important Surah in the sight of the Holy Prophet. That is why he made sure that its contents reached as many people as possible over and over again.",
        "\n",
        "This reason for this importance can be easily understood by a careful study of the Surah. The theme of the entire Surah is the Hereafter. When the Holy Prophet started preaching his message in Makkah what surprised the people most was the news that people would be resurrected after death, and they would have to render an account of their deeds. They said that that was impossible; human mind could not believe that that would happen. After all, how could it be possible that when the body had disintegrated into dust the scattered particles would be reassembled after hundreds of thousands of years to make up the same body once again and raised up as a living body, Allah in response sent down this discourse. In it, on the one hand, arguments have been given for the possibility and occurrence of the Hereafter in a brief way, in short sentences, and, on the other, the people have been warned, as if to say: \"Whether you express wonder and surprise, or you regard it as something remote\nfrom reason, or deny it altogether, in any case it cannot change the truth. The absolute, un-alterable truth is that Allah knows the whereabouts of each and every particle of your body that has scattered away in the earth, and knows where and in what state it is. Allah's one signal is enough to make all the scattered particles gather together again and to make you rise up once again as you had been made in the first instance. Likewise, your this idea that you have been created and left free to yourselves in the world and that you have not been made answerable to anyone, is no more than a misunderstanding. The fact is that not only is Allah Himself directly aware of each act and word of yours, even of the ideas that pass in your mind, but His angels also are attached to each one of you, who are preserving the record of whatever you do and utter. When the time comes, you will come out of your graves at one call just as young shoots of vegetable sprout up from the earth on the first\nshower of the rain. Then this heedlessness which obstructs your vision will be removed and you will see with your own eyes all that you are denying today. At that time you will realize that you had not been created to be irresponsible in this world but accountable to all your deeds the meeting out of the rewards and punishments, the Hell and Heaven, which you regard as impossible and imaginary things, will at that time become visible realities for you in consequence of your enmity and opposition to the Truth you will be cast into the same Hell which you regard as remote from reason today and the ones who fear the Merciful God and return to the path of righteousness, will be admitted to the same Paradise at whose mention you now express wonder and surprise.",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that opens with the single discrete Arabic letter Qāf. It deals predominantly with the Resurrection and the Day of Judgement. Reference is made to previous generations of disbelievers (verse 12 .), both to warn the disbelievers in Mecca and to reassure the Prophet. Creation is cited as an indication of God’s ability to bring the dead to life again (verse 3 .), and emphasis is placed on the powerlessness of man on the Day of Resurrection (verse 20). The surah both opens and closes with mention of the Quran.",
    "name_translation": "Qāf",
    "name_complex": "Qâf",
    "surah_name_ar": "ق",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 50:1": "Kâf. Pasha Kur’anin e madhërueshëm,",
                            "verse 50:2": "Po, ata janë çuditur që nga mesi i tyre u ka ardhur një paralajmërues, e mohuesit thonë: “Kjo gjë është e çuditshme”.",
                            "verse 50:3": "Vallë, a pasi të vdesin e të bëhemi dhé (do të ringjallemi)? Ai kthim është i largët!”",
                            "verse 50:4": "Na dimë çka do t’ua mungojë toka atyre (pasi të vdesin), te Ne është Libri që i ruan të gjitha.",
                            "verse 50:5": "Aq më tepër, ta e mohuan të Vërtetën kur u erdhi dhe ata janë në gjendje të luhatshme (në çështjen e profetnisë).",
                            "verse 50:6": "A, nuk e kanë shikuar ata qiellin që qëndron mbi ta, si e kemi ndërtuar dhe zbukuruar, e i cili nuk ka kurrfarë të mete (çrregullimi)!",
                            "verse 50:7": "E, Tokën e kemi shtruar dhe në të kemi shpërndarë male të palëvizshme dhe kemi bërë që nga ajo të mbijnë gjithfarë lloj bimësh të bukur,",
                            "verse 50:8": "për t’u menduar dhe këshilluar çdo rob që i drjtohet Zotit të vet.",
                            "verse 50:9": "Ne nga qielli lëshojmë ujin (shiun) e bekuar dhe bëjmë që me të, të ujiten kopshtijet dhe drithërat që korren.",
                            "verse 50:10": "Dhe palmet e hurmës së lartë me kalavesh njëri mbi tjetrin,",
                            "verse 50:11": "ushqim për robërit (njerëzit), dhe Ne me shi e ringjallim tokën (visin) e vdekur; e kështu do të jetë edhe dalja (prej tokës – ringjallja).",
                            "verse 50:12": "Pas tyre, kanë mohuar populli i Nuhut, edhe banorët e Ressit dhe Themudi,",
                            "verse 50:13": "dhe Adi dhe Faraoni, dhe vëllezërit (populli) e Lutit,",
                            "verse 50:14": "edhe banorët e Ejkës dhe populli i Tubbas; të gjithë ata i kanë përgënjeshtruar pejgamberët dhe ndaj tyre u sendërtua dënimi Im.",
                            "verse 50:15": "E, vallë, mos jemi lodhur Ne gjatë krijimit të parë? Jo, por ata dyshojnë në krijimin e sërishëm.",
                            "verse 50:16": "Na e kemi krijuar njeriun dhe Na dimë çka i pëshpërit shpirti atij, se Ne (me dijeninë Tonë) jemi më afër se damari i tij i qafës,",
                            "verse 50:17": "(dhe nga të dy engjëjt) të cilët i rrinë atij nga ana e djathtë dhe e majtë,",
                            "verse 50:18": "dhe ai nuk e thotë asnjë fjalë e që pranë tij të mos jetë ai që mbikëqyrë.",
                            "verse 50:19": "Mundimet e vdekjes do të arrijnë me siguri – kësaj nuk mund t’i ikësh",
                            "verse 50:20": "dhe do të fryhet në Sur – kjo është Dita e premtimit –",
                            "verse 50:21": "dhe çdonjëri do të vijë, e me të ka grahës dhe dëshmitar.",
                            "verse 50:22": "Ti, me të vërtetë, ke qenë i pakujdesshëm për këtë (momentin e vdekjes), andaj ta kemi ngritur perden (e syve), dhe shikimi yt sot është i prehtë.",
                            "verse 50:23": "E, shoku i tij do të thotë: “Ky pranë meje, është i gatshëm”",
                            "verse 50:24": "(u thuhet): “Hidheni në zjarr çdo mohues inatçi,",
                            "verse 50:25": "pengues i të mirave, që kalon (kufirin) dhe i cili dyshon (në fé),",
                            "verse 50:26": "i cili, pos Perëndisë, beson në zot tjetër – andaj hidhe atë në dënimin më të rëndë!”",
                            "verse 50:27": "E, shoku i tij do të thotë: “O Zoti ynë, unë nuk e kam mashtruar atë, por ai vet ka qenë në humbje të madhe”.",
                            "verse 50:28": "Atyre (Perëndia) do t’ju thotë: “Mos u grindni para Meje, Unë ju kam lajmëruar premtimin (dënimin),",
                            "verse 50:29": "Fjala Ime nuk ndryshohet dhe Unë nuk jam zullumqar i robërve të Mi”.",
                            "verse 50:30": "Në Ditën kur do ta pyesin xhehennemin: “A u mbushe?” e ai, përgjigjet: “A ka edhe më?”",
                            "verse 50:31": "E, xhenneti do t’u afrohet besimtarëve, jo larg.",
                            "verse 50:32": "Kjo ju është premtuar, çdokujt që është penduar dhe ruajtur (nga kalimi i kufirit),",
                            "verse 50:33": "i cili frikohet prej Perëndisë edhe atëhrë kur nuk e sheh kush dhe i cili vie me zemër të kthyer kah Perëndia”.",
                            "verse 50:34": "(U thuhet atyre): “Hyni në të (në xhennet), në qetësi (e mirësi), kjo është Dita e përhershme!”",
                            "verse 50:35": "Në të do të kenë çka të duan – e prej Nesh edhe më shumë.",
                            "verse 50:36": "E, sa gjenerata i kemi shkatërruar par tyre, duke qenë ata më të fortë (se Kurejshit) dhe ata bredhnin nëpër Tokë. – E, a kanë mund të gjejnë strehim?!",
                            "verse 50:37": "Me të vërtetë, për të gjitha këto ka këshillë për atë që ka mend ose që dëgjon, e që është i përqëndruar.",
                            "verse 50:38": "Ne, kemi krijuar qiejt dhe Tokën dhe çdo gjë që gjendet mes tyre për gjashtë ditë (periudha kohore), dhe nuk na përshkoi kurrëfarë lodhje.",
                            "verse 50:39": "Andaj, duroje atë që e thonë ata dhe madhëroje Zotin tënd, dhe falenderoje Atë para lindjes së diellit dhe para muzgut,",
                            "verse 50:40": "dhe madhëroje Atë në një pjesë të natës dhe pas kryerjes së namazit.",
                            "verse 50:41": "Dhe përgjoje ti! Ditën kur thërritësi (engjëlli) thërret prej vendit të afërt,",
                            "verse 50:42": "Ditën kur ata do ta dëgjojnë zërin e vërtetë, ajo do të jetë Dita e daljes (ringjalljes).",
                            "verse 50:43": "Na, me të vërtetë, japim gjallëri dhe japim vdekje dhe te Ne është kthimi!",
                            "verse 50:44": "E, në Ditën kur toka do të çahet e të dalin ata me nxitim; kjo është ringjallja, për Ne (kjo) është lehtë.",
                            "verse 50:45": "Na dimë mirë çka thonë ata; e ti nuk je ai që i shtrëngon ata (të besojnë), por këshilloje me Kur’an atë që i druan premtimit (dënimit) Tim!"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Qaf! (Ya Peyğəmbər!) Şanlı Qur'ana and olsun (ki, Məkkə müşrikləri sənə iman gətirmədilər)!",
                            "verse 50:2": "Bəli! ?zlərindən (Onları Allahın əzabı ilə) qorxudan bir peyğəmbər gəldiyinə təəccüb etdilər. Kafirlər dedilər:\" Bu əcaba bir şeydir! (İnsandan da peyğəmbər olarmı?! Ancaq mələk peyğəmbər ola bilər!)",
                            "verse 50:3": "Məgər biz ölüb torpaq olduqdan sonra (yenidən diriləcəyik)? Bu, (həqiqətən) uzaq (qeyri-mümkün) bir qayıdışdır!\"",
                            "verse 50:4": "Həqiqətən, Biz yerin onlardan nəyi əskiltdiyini (onların tədriclə necə çürüdüb məhv etdiyini) bilirik. Dərgahımızda (hər şeyi) hifz edən bir Kitab (lövhi-məhfuz) vardır!",
                            "verse 50:5": "Lakin onlara haqq (Qur'an) gəldikdə onu yalan saydılar. İndi onlar dolaşıqlıq (təşvış) içindədirlər (sənə gah şair, gah sehrbaz, gah da kahin deyirlər).",
                            "verse 50:6": "Məgər onlar başlarının üstündəki göyə baxıb onu necə yaratdığımızı, necə bəzədiyimizi və orada heç bir yarıq olmadığını görmürlərmi?!",
                            "verse 50:7": "Eləcə də yeri necə döşədiyimizi (hamarlayıb düzəltdiyimizi), orada möhkəm duran dağlar yaratdığımızı, hər cür gözəl növdən (meyvə) yetişdirdiyimizi görmürlərmi?!",
                            "verse 50:8": "(Bütün bunlar Rəbbinə tərəf) dönüb qayıdan hər bir bəndə üçün ibrət dərsi və öyüd-nəsihət olsun deyə etdik.",
                            "verse 50:9": "Biz göydən bərəkətli su endirdik, sonra onunla bağlar və (arpa, buğda və s. kimi) biçilən taxıl dənələri yetişdirdik.",
                            "verse 50:10": "Həm də tumurcuqları (salxım-salxım) bir-birinin üstünə düzülmüş, hündür xurma ağacları (bitirdik) -",
                            "verse 50:11": "Bəndələrə ruzi olsun deyə! Biz onunla (o su ilə) ölü bir məmləkəti cana gətirdik. (Qəbirlərdən dirilib) çıxmaq da belədir!",
                            "verse 50:12": "Onlardan (Məkkə müşriklərindən) əvvəl Nuh tayfası, Rəss əhli, Səmud (qövmü peyğəmbərləri) təkzib etmişdi.",
                            "verse 50:13": "Ad (qövmü), Fir'on (əhli), Lut qardaşları;",
                            "verse 50:14": "Əykə əhli və Tübbə' qövmü - bunların hamısı peyğəmbərləri təkzib etdi və Mənim də onlara və'd etdiyim (əzab) gerçəkləşdi.",
                            "verse 50:15": "Məgər Biz ilk yaradılışdan acizmi qaldıq?! Xeyr! (Eləcə də qiyamət günü ölüləri diriltməkdən aciz qalmayacağıq!) Onlar yeni yaradılış (təkrar dirilmə) barəsində şəkk-şübhə içindədirlər!",
                            "verse 50:16": "And olsun ki, insanı Biz yaratdıq və nəfsinin ona nə vəsvəsə etdiyini də Biz bilirik. Biz ona şah damarından da yaxınıq! (İnsanın adi hərəkətlərindən tutmuş ürəyindən keçən ən gizli hisslər, duyğular belə Allaha mə'lumdur!)",
                            "verse 50:17": "Xatırla ki, (insanın) sağında və solunda (onun bütün əməllərini) təsbit edən (qeydə alan) iki mələk oturmuşdur!",
                            "verse 50:18": "Dediyi hər sözü (yazmaq üçün) onun yanında hazır durub gözləyən (iki mələk) vardır!",
                            "verse 50:19": "?lüm (ölüm bihuşluğu), həqiqətən, gələcəkdir. (Ey insan!) Bu sənin qorxub qaçdığın (cürbəcür vasitələrlə canını qurtarmaq istədiyin) şeydir!",
                            "verse 50:20": "(?ləndən sonra yenidən dirilmək üçün) sur çalınacaqdır. Bu və'd olunmuş gündür (əzab günüdür)!",
                            "verse 50:21": "Hər bir kəs (Rəbbinin hüzuruna) bir sürüyən (sürüyüb məhşərə gətirən) və bir də şahidlə (iki mələklə) gələcəkdir.",
                            "verse 50:22": "(Ona belə deyiləcəkdir: ) \"Sən (dünyada) bundan (bu müdhiş günə uğrayacağından) qafil idin. Artıq bu gün gözündən pərdəni götürdük. Sən bu gün sərrast görürsən!\"",
                            "verse 50:23": "Yoldaşı (ona təhkim olunmuş mələk) deyəcəkdir: \"Bu yanımdakı (Cəhənnəm üçün) hazırdır!\"",
                            "verse 50:24": "(Allah o iki mələyə buyuracaqdır: ) \"Atın Cəhənnəmə hər bir inadcıl kafiri;",
                            "verse 50:25": "Xeyrə mane olanı, (zülm etməklə, günah törətməklə) həddi aşanı, (Allahın birliyinə) şəkk edəni!",
                            "verse 50:26": "O kimsəni ki, Allahla yanaşı özünə başqa bir tanrı qəbul etdi. Atın onu şiddətli əzabın içinə!\"",
                            "verse 50:27": "Yoldaşı (Şeytan və ya öz nəfsi) deyəcəkdir: \"Ey Rəbbimiz! Onu mən azdırmadım. Fəqət o özü haqq yoldan çox azmışdı!\"",
                            "verse 50:28": "(Allah) buyuracaqdır: \"Mənim hüzurumda mübahisə etməyin. Mən sizə (dünyada peyğəmbər vasitəsilə) bu əzabı bildirmişdim.",
                            "verse 50:29": "Mənim hüzurumda söz güləşdirməyin. Mən bəndələrə (əbəs yerə) zülm edən deyiləm!\"",
                            "verse 50:30": "O gün Biz Cəhənnəmə: \"Doldunmu?\" - deyəcək, o isə: \"Yenə varmı?\" - deyə cavab verəcəkdir.",
                            "verse 50:31": "Cənnət də müttəqilər üçün yaxın bir yerə gətiriləcəkdir.",
                            "verse 50:32": "(Onlara deyiləcəkdir: ) \"Bu, və'd olunduğunuz (Cənnətdir). O, hər bir (tövbə edib Allaha tərəf) qayıdan, (nəfsini haramdan, özünü günahdan) qoruyan;",
                            "verse 50:33": "Rəhmandan (Onu) görmədən qorxan və (Rəbbinin hüzuruna) haqqa dönmüş qəlblə gələn bəndə üçündür!",
                            "verse 50:34": "Ora sağlıqla (əmin-amanlıqla) daxil olun. Bu, əbədiyyət günüdür!\"",
                            "verse 50:35": "Orada onlar üçün istədikləri hər şey vardır. Dərgahımızda isə ondan artığı (mö'minlərin təsəvvür edə bilmədikləri ne'mətlər, Allahın rizasını və s.) mövcuddur!",
                            "verse 50:36": "Biz onlardan (Məkkə müşriklərindən) əvvəl özlərindən daha qüvvətli neçə-neçə nəsilləri məhv etdik. (Onlar: ) \"Görəsən, (ölümdən qaçıb) can qurtarmağa bir yer varmı?\" (deyərək) ölkə-ölkə gəzib dolaşmışdılar.",
                            "verse 50:37": "Şübhəsiz ki, bunda qəlb (ağıl) sahibi, yaxud (moizə edildiyi zaman bütün varlığı ilə) hazır olub (ona cani-dildən) qulaq asan kimsə üçün öyüd-nəsihət vardır!",
                            "verse 50:38": "And olsun ki, Biz göyləri, yeri və onların arasında olanları altı gündə yaratdıq və Bizə heç bir yorğunluq da üz vermədi.",
                            "verse 50:39": "(Ya Peyğəmbər!) Artıq onların dediklərinə (batil sözlərinə) səbr et. Gün doğmamışdan əvvəl, batmamışdan əvvəl Rəbbini təqdis edib şə'ninə təriflər de!",
                            "verse 50:40": "Gecənin bir vaxtında və səcdələrdən sonra da (Onu şükr-səna ilə təqdis et)!",
                            "verse 50:41": "(Ya Peyğəmbər!) Carçının yaxın bir yerdən car çəkəcəyi gün (deyilən sözü, surun səsini) dinlə! (O gün İsrafil uca səslə: \"Ey köhnəlmiş sümüklər, ey bir-birindən ayrılmış oynaqlar, ey əprimiş ətlər, ey dağılmış saçlar! Allah sizə haqq-hesab gününə gəlmək üçün yenidən birləşməyi buyurur!\" - deyəcək və suru ikinci dəfə üfürəcəkdir).",
                            "verse 50:42": "O gün (bütün yaranmışlar) dəhşətli (tükürpədici) səsi doğrudan-doğruya eşidəcəklər. O gün (qəbirlərdən) çıxma günüdür!",
                            "verse 50:43": "Şübhəsiz ki, dirildən də, öldürən də Bizim. (Axır) dönüş də Bizim hüzurumuzadır!",
                            "verse 50:44": "O gün yer onlardan ayrılıb parçalanacaq, onlar sür'ətlə (torpağın altından, qəbirlərindən çıxacaqlar). O bizim üçün asan olan həşrdir (Bütün yaranmışların bir yerə toplanacaqları məhşər günüdür).",
                            "verse 50:45": "Biz onların nə dediklərini çox gözəl bilirik. (Ya Peyğəmbər!) Sən onlara zor edən (onları zorla imana gətirən) deyilsən. Sən Mənim təhdidimdən (əzabımdan) qorxablara Qur'anla öyüd-nəsihət ver!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Kaf. Tako Mi Kur’ana slavnog,",
                            "verse 50:2": "oni se čude što im je došao jedan od njih da ih opominje, pa, nevjernici, govore: \"To je čudna stvar:",
                            "verse 50:3": "zar kad pomremo i zemlja postanemo...? Nezamisliv je to povratak!\"",
                            "verse 50:4": "Mi znamo šta će od njih zemlja oduzeti, u nas je Knjiga u kojoj se sve čuva.",
                            "verse 50:5": "Oni, međutim, poriču Istinu koja im dolazi i smeteni su.",
                            "verse 50:6": "A zašto ne pogledaju nebo iznad sebe? - kako smo ga sazdali i ukrasili i kako u njemu nema nereda!",
                            "verse 50:7": "A Zemlju smo rasprostrli i po njoj nepomična brda pobacali i dali da iz nje niče raznovrsno prekrasno bilje,",
                            "verse 50:8": "da bi razmislio i opomenuo se svaki rob koji se Gospodaru svome obraća.",
                            "verse 50:9": "Mi s neba spuštamo vodu kao blagoslov, i činimo da, uz pomoć njenu, niču vrtovi i žito koje se žanje",
                            "verse 50:10": "i visoke palme u kojih su zameci nagomilani jedni iznad drugih,",
                            "verse 50:11": "kao hranu robovima, i Mi njome oživljavamo mrtav predjel; takvo će biti i oživljenje.",
                            "verse 50:12": "Prije njih poricali su narod Nuhov, i stanovnici Ressa, i Semud",
                            "verse 50:13": "i Ad, i narod faraonov, i narod Lutov,",
                            "verse 50:14": "i stanovnici Ejke i narod Tubba; svi su oni poslanike lažnim smatrali i kaznu Moju zaslužili.",
                            "verse 50:15": "Pa zar smo prilikom prvog stvaranja malaksali? Ne, ali oni u ponovno stvaranje sumnjaju.",
                            "verse 50:16": "Mi stvaramo čovjeka i znamo šta mu sve duša njegova haje, jer Mi smo njemu bliži od vratne žile kucavice.",
                            "verse 50:17": "Kad se dvojica sastanu i sjednu jedan s desne, a drugi s lijeve strane,",
                            "verse 50:18": "on ne izusti ni jednu riječ, a da pored njega nije prisutan Onaj koji bdije.",
                            "verse 50:19": "Smrtne muke će zbilja doći - to je nešto od čega ne možeš pobjeći",
                            "verse 50:20": "i u rog će se puhnuti - to je Dan kojim se prijeti -",
                            "verse 50:21": "i svako će doći, a s njim i vodič i svjedok.",
                            "verse 50:22": "Ti nisi mario za ovo, pa smo ti skinuli koprenu tvoju, danas ti je oštar vid.",
                            "verse 50:23": "A drug njegov će reći:",
                            "verse 50:24": "Baci u Džehennem svakog nezahvalnika, inadžiju,",
                            "verse 50:25": "koji je branio da se čine dobra djela i koji je nasilnik i podozriv bio,",
                            "verse 50:26": "koji je pored Allaha u drugog boga vjerovao - zato ga baci u patnju najtežu!\"",
                            "verse 50:27": "A drug njegov će reći: \"Gospodaru naš, ja ga nisam silom zaveo, sam je u velikoj zabludi bio.\"",
                            "verse 50:28": "Ne prepirite se preda Mnom! - reći će On - \"još davno sam vam zaprijetio,",
                            "verse 50:29": "Moja Riječ se ne mijenja i Ja nisam prema robovima svojim nepravičan.\"",
                            "verse 50:30": "Na dan kada upitamo Džehennem: \"Jesi li se napunio?\" - on će odgovoriti: \"Ima li još?\"",
                            "verse 50:31": "A Džennet će biti primaknut čestitima, neće biti ni od jednog daleko -",
                            "verse 50:32": "Ovo je ono što vam je obećano, svakome onome koji se kajao i čuvao,",
                            "verse 50:33": "koji se Milostivoga bojao, iako Ga nije vidio, i koji je srce odano donio.",
                            "verse 50:34": "Uđite u nj, u miru, ovo je Dan vječni!\"",
                            "verse 50:35": "U njemu će imati što god zažele - a od Nas i više.",
                            "verse 50:36": "A koliko smo naroda prije ovih uništili, koji su moćniji od njih bili, pa su po svijetu utočište tražili - od propasti spasa ima li?!",
                            "verse 50:37": "U tome je, zaista, pouka za onoga ko razum ima ili ko sluša, a priseban je.",
                            "verse 50:38": "Mi smo stvorili nebesa i Zemlju i ono što je između njih - za šest vremenskih razdoblja, i nije Nas ophrvao nikakav umor.",
                            "verse 50:39": "Zato strpljivo podnosi ono što oni govore i veličaj Gospodara svoga i zahvaljuj Mu prije sunčeva izlaska i prije zalaska,",
                            "verse 50:40": "i veličaj Ga noću i poslije obavljanja molitvi.",
                            "verse 50:41": "I osluškuj! Dan kada će glasnik pozvati iz mjesta koje je blizu,",
                            "verse 50:42": "Dan kada će oni čuti istinit glas - to će biti Dan oživljenja.",
                            "verse 50:43": "Mi, zaista, dajemo život i dajemo smrt, i sve će se Nama vratiti!",
                            "verse 50:44": "A na Dan kada će nad njima zemlja popucati oni će žurno izići; biće to oživljenje, za Nas lahko.",
                            "verse 50:45": "Mi dobro znamo što oni govore; ti ih ne možeš prisiliti, nego podsjeti Kur’anom onoga koji se prijetnje Moje boji!"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "ক্বাফ! সম্মানিত কোরআনের শপথ;",
                            "verse 50:2": "বরং তারা তাদের মধ্য থেকেই একজন ভয় প্রদর্শনকারী আগমন করেছে দেখে বিস্ময় বোধ করে। অতঃপর কাফেররা বলেঃ এটা আশ্চর্যের ব্যাপার।",
                            "verse 50:3": "আমরা মরে গেলে এবং মৃত্তিকায় পরিণত হয়ে গেলেও কি পুনরুত্থিত হব? এ প্রত্যাবর্তন সুদূরপরাহত।",
                            "verse 50:4": "মৃত্তিকা তাদের কতটুকু গ্রাস করবে, তা আমার জানা আছে এবং আমার কাছে আছে সংরক্ষিত কিতাব।",
                            "verse 50:5": "বরং তাদের কাছে সত্য আগমন করার পর তারা তাকে মিথ্যা বলছে। ফলে তারা সংশয়ে পতিত রয়েছে।",
                            "verse 50:6": "তারা কি তাদের উপরস্থিত আকাশের পানে দৃষ্টিপাত করে না আমি কিভাবে তা নির্মাণ করেছি এবং সুশোভিত করেছি? তাতে কোন ছিদ্রও নেই।",
                            "verse 50:7": "আমি ভূমিকে বিস্তৃত করেছি, তাতে পর্বতমালার ভার স্থাপন করেছি এবং তাতে সর্বপ্রকার নয়নাভিরাম উদ্ভিদ উদগত করেছি।",
                            "verse 50:8": "এটা জ্ঞান আহরণ ও স্মরণ করার মত ব্যাপার প্রত্যেক অনুরাগী বান্দার জন্যে।",
                            "verse 50:9": "আমি আকাশ থেকে কল্যাণময় বৃষ্টি বর্ষণ করি এবং তদ্বারা বাগান ও শস্য উদগত করি, যেগুলোর ফসল আহরণ করা হয়।",
                            "verse 50:10": "এবং লম্বমান খর্জুর বৃক্ষ, যাতে আছে গুচ্ছ গুচ্ছ খর্জুর,",
                            "verse 50:11": "বান্দাদের জীবিকাস্বরূপ এবং বৃষ্টি দ্বারা আমি মৃত জনপদকে সঞ্জীবিত করি। এমনিভাবে পুনরুত্থান ঘটবে।",
                            "verse 50:12": "তাদের পূর্বে মিথ্যাবাদী বলেছে নূহের সম্প্রদায়, কুপবাসীরা এবং সামুদ সম্প্রদায়।",
                            "verse 50:13": "আদ, ফেরাউন, ও লূতের সম্প্রদায়,",
                            "verse 50:14": "বনবাসীরা এবং তোব্বা সম্প্রদায়। প্রত্যেকেই রসূলগণকে মিথ্যা বলেছে, অতঃপর আমার শাস্তির যোগ্য হয়েছে।",
                            "verse 50:15": "আমি কি প্রথমবার সৃষ্টি করেই ক্লান্ত হয়ে পড়েছি? বরং তারা নতুন সৃষ্টির ব্যাপারে সন্দেহ পোষন করেছে।",
                            "verse 50:16": "আমি মানুষ সৃষ্টি করেছি এবং তার মন নিভৃতে যে কুচিন্তা করে, সে সম্বন্ধেও আমি অবগত আছি। আমি তার গ্রীবাস্থিত ধমনী থেকেও অধিক নিকটবর্তী।",
                            "verse 50:17": "যখন দুই ফেরেশতা ডানে ও বামে বসে তার আমল গ্রহণ করে।",
                            "verse 50:18": "সে যে কথাই উচ্চারণ করে, তাই গ্রহণ করার জন্যে তার কাছে সদা প্রস্তুত প্রহরী রয়েছে।",
                            "verse 50:19": "মৃত্যুযন্ত্রণা নিশ্চিতই আসবে। এ থেকেই তুমি টালবাহানা করতে।",
                            "verse 50:20": "এবং শিঙ্গায় ফুঁৎকার দেয়া হবে এটা হবে ভয় প্রদর্শনের দিন।",
                            "verse 50:21": "প্রত্যেক ব্যক্তি আগমন করবে। তার সাথে থাকবে চালক ও কর্মের সাক্ষী।",
                            "verse 50:22": "তুমি তো এই দিন সম্পর্কে উদাসীন ছিলে। এখন তোমার কাছ থেকে যবনিকা সরিয়ে দিয়েছি। ফলে আজ তোমার দৃষ্টি সুতীক্ষ্ন।",
                            "verse 50:23": "তার সঙ্গী ফেরেশতা বলবেঃ আমার কাছে যে, আমলনামা ছিল, তা এই।",
                            "verse 50:24": "তোমরা উভয়েই নিক্ষেপ কর জাহান্নামে প্রত্যেক অকৃতজ্ঞ বিরুদ্ধবাদীকে,",
                            "verse 50:25": "যে বাধা দিত মঙ্গলজনক কাজে, সীমালঙ্ঘনকারী, সন্দেহ পোষণকারীকে।",
                            "verse 50:26": "যে ব্যক্তি আল্লাহর সাথে অন্য উপাস্য গ্রহণ করত, তাকে তোমরা কঠিন শাস্তিতে নিক্ষেপ কর।",
                            "verse 50:27": "তার সঙ্গী শয়তান বলবেঃ হে আমাদের পালনকর্তা, আমি তাকে অবাধ্যতায় লিপ্ত করিনি। বস্তুতঃ সে নিজেই ছিল সুদূর পথভ্রান্তিতে লিপ্ত।",
                            "verse 50:28": "আল্লাহ বলবেনঃ আমার সামনে বাকবিতন্ডা করো না আমি তো পূর্বেই তোমাদেরকে আযাব দ্বারা ভয় প্রদর্শন করেছিলাম।",
                            "verse 50:29": "আমার কাছে কথা রদবদল হয় না এবং আমি বান্দাদের প্রতি জুলুমকারী নই।",
                            "verse 50:30": "যেদিন আমি জাহান্নামকে জিজ্ঞাসা করব; তুমি কি পূর্ণ হয়ে গেছ? সে বলবেঃ আরও আছে কি?",
                            "verse 50:31": "জান্নাতকে উপস্থিত করা হবে খোদাভীরুদের অদূরে।",
                            "verse 50:32": "তোমাদের প্রত্যেক অনুরাগী ও স্মরণকারীকে এরই প্রতিশ্রুতি দেয়া হয়েছিল।",
                            "verse 50:33": "যে না দেখে দয়াময় আল্লাহ তা’আলাকে ভয় করত এবং বিনীত অন্তরে উপস্থিত হত।",
                            "verse 50:34": "তোমরা এতে শান্তিতে প্রবেশ কর। এটাই অনন্তকাল বসবাসের জন্য প্রবেশ করার দিন।",
                            "verse 50:35": "তারা তথায় যা চাইবে, তাই পাবে এবং আমার কাছে রয়েছে আরও অধিক।",
                            "verse 50:36": "আমি তাদের পূর্বে বহু সম্প্রদায়কে ধ্বংস করেছি, তারা এদের অপেক্ষা অধিক শক্তিশালী ছিল এবং দেশে-বিদেশে বিচরণ করে ফিরত। তাদের কোন পলায়ন স্থান ছিল না।",
                            "verse 50:37": "এতে উপদেশ রয়েছে তার জন্যে, যার অনুধাবন করার মত অন্তর রয়েছে। অথবা সে নিবিষ্ট মনে শ্রবণ করে।",
                            "verse 50:38": "আমি নভোমন্ডল, ভূমন্ডল ও এতদুভয়ের মধ্যবর্তী সবকিছু ছয়দিনে সৃষ্টি করেছি এবং আমাকে কোনরূপ ক্লান্তি স্পর্শ করেনি।",
                            "verse 50:39": "অতএব, তারা যা কিছু বলে, তজ্জন্যে আপনি ছবর করুন এবং, সূর্যোদয় ও সূর্যাস্তের পূর্বে আপনার পালনকর্তার সপ্রশংস পবিত্রতা ঘোষণা করুন।",
                            "verse 50:40": "রাত্রির কিছু অংশে তাঁর পবিত্রতা ঘোষণা করুন এবং নামাযের পশ্চাতেও।",
                            "verse 50:41": "শুন, যে দিন এক আহবানকারী নিকটবর্তী স্থান থেকে আহবান করবে।",
                            "verse 50:42": "যেদিন মানুষ নিশ্চিত সেই ভয়াবহ আওয়াজ শুনতে পাবে, সেদিনই পুনরত্থান দিবস।",
                            "verse 50:43": "আমি জীবন দান করি, মৃত্যু ঘটাই এবং আমারই দিকে সকলের প্রত্যাবর্তন।",
                            "verse 50:44": "যেদিন ভূমন্ডল বিদীর্ণ হয়ে মানুষ ছুটাছুটি করে বের হয়ে আসবে। এটা এমন সমবেত করা, যা আমার জন্যে অতি সহজ।",
                            "verse 50:45": "তারা যা বলে, তা আমি সম্যক অবগত আছি। আপনি তাদের উপর জোরজবরকারী নন। অতএব, যে আমার শাস্তিকে ভয় করে, তাকে কোরআনের মাধ্যমে উপদেশ দান করুন।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 50:1": "Каф. Кълна се в славния Коран.",
                            "verse 50:2": "Да, учудиха се, че им се яви предупредител измежду тях. И рекоха неверниците: Това е чудно нещо.",
                            "verse 50:3": "Нима след като умрем и станем на пръст [ще бъдем възкресени]? Такова завръщане е невероятно.",
                            "verse 50:4": "Знаем Ние какво земята отнема от тях и имаме съхраняваща Книга.",
                            "verse 50:5": "Ала те взеха за лъжа истината, когато дойде при тях и са в недоумение.",
                            "verse 50:6": "Нима не виждат небето над тях, как Ние го изградихме и го украсихме, и е без процепи?",
                            "verse 50:7": "И земята разпростряхме, и положихме по нея непоклатими планини, и сторихме от нея да поникнат всякакви прекрасни видове -",
                            "verse 50:8": "поука и напомняне за всеки покайващ се раб.",
                            "verse 50:9": "И изсипваме от небето благословена вода, и сторваме да израстват чрез нея градини и зърно за жътва,",
                            "verse 50:10": "и високи палми с гроздове, скупчени един връз друг -",
                            "verse 50:11": "препитание за рабите. И съживяваме с нея мъртва земя. Така ще бъде и възкресението.",
                            "verse 50:12": "Преди тях смятаха, че е лъжа и народът на Нух, и обитателите на ар-Рас, и самудяните,",
                            "verse 50:13": "и адитите, и Фараонът, и братята на Лут,",
                            "verse 50:14": "и обитателите на Горичката, и народът на Туббаа. Всички смятаха за лъжци пратениците и се изпълни Моето обещание.",
                            "verse 50:15": "Нима Ни затрудни първото сътворяване? Ала се съмняват те в новото сътворяване.",
                            "verse 50:16": "Сътворихме Ние човека и знаем какво му нашепва неговата душа. Ние сме по-близо до него, отколкото вената на шията .",
                            "verse 50:17": "Отдясно и отляво на него стоят два записващи ангела,",
                            "verse 50:18": "не изрича и една дума, без да има готов надзорник при него.",
                            "verse 50:19": "И смъртната агония ще донесе истината: Това е, което си избягвал.",
                            "verse 50:20": "И ще се протръби с Рога. Това е Денят на обещанието!",
                            "verse 50:21": "И с всеки човек ще дойде водач и свидетел [от ангелите].",
                            "verse 50:22": "[И ще му се каже:] Ти нехаеше за това. Но снехме от теб покривалото и твоят поглед Днес е проницателен.",
                            "verse 50:23": "А съпътствалият го [ангел] ще каже: Готово е това, което е у мен.",
                            "verse 50:24": "Хвърлете в Ада всеки упорстващ неверник,",
                            "verse 50:25": "възпиращ доброто, престъпващ, съмняващ се,",
                            "verse 50:26": "който прие за бог друг заедно с Аллах! Затова го хвърлете в суровото мъчение!",
                            "verse 50:27": "Съпътствалият го [сатана] ще каже: Господи наш, не аз го накарах да престъпва, а сам той бе в дълбока заблуда.",
                            "verse 50:28": "Ще каже [Аллах]: Не се карайте пред Мен! Аз ви предупреждавах.",
                            "verse 50:29": "Не се променя Моето Слово. И не съм угнетител на рабите.",
                            "verse 50:30": "В този Ден ще кажем на Ада: Напълни ли се? А той ще рече: Има ли още?",
                            "verse 50:31": "И не след дълго Раят ще бъде приближен за богобоязливите.",
                            "verse 50:32": "Това е, което ви бе обещано - за всеки покайващ се, спазващ ,",
                            "verse 50:33": "който и в уединение се бои от Всемилостивия, и идва със сърце, молещо за прошка.",
                            "verse 50:34": "Влезте тук в мир! Това е Денят на вечността!",
                            "verse 50:35": "Ще имат там, каквото пожелаят, а при Нас има повече.",
                            "verse 50:36": "И колко поколения преди тях погубихме, а бяха по-силни от тях и обикаляха по земята! Но има ли избавление?",
                            "verse 50:37": "Наистина в това се съдържа поука за всеки, който има сърце или се вслушва и е свидетел.",
                            "verse 50:38": "Сътворихме Ние небесата и земята, и всичко между тях в шест дни, без да Ни засегне умора.",
                            "verse 50:39": "Бъди търпелив към това, което казват, и прославяй с възхвала своя Господ преди изгрева на слънцето и преди залеза!",
                            "verse 50:40": "И през нощта Го прославяй, и след поклоните!",
                            "verse 50:41": "И вслушвай се в Деня, когато прогласяващият ще прогласи от близко място!",
                            "verse 50:42": "В този Ден ще чуят Вика с истината. Това е Денят на възкресението.",
                            "verse 50:43": "Ние съживяваме и Ние умъртвяваме, и при Нас е завръщането.",
                            "verse 50:44": "В този Ден земята ще се разцепи над тях - забързани. Това е събиране, лесно за Нас.",
                            "verse 50:45": "Най-добре Ние знаем какво изричат. А ти не си за тях принудител. И поучавай с Корана всеки, който се страхува от Моето предупреждение!"
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "戛弗。以尊嚴的《古蘭經》盟誓，",
                            "verse 50:2": "難道他們因同族的警告者來臨他們而惊訝嗎？不信道的人們說：「這是奇事！",
                            "verse 50:3": "難道我們既死之後，已變塵土，還要還原嗎？那太不近情理了。」",
                            "verse 50:4": "我確己知道大地對於他們的剝蝕，我這裡有一本被保護的天經。",
                            "verse 50:5": "他們否認已降示他們的真理，所以他們陷於混亂的狀態中。",
                            "verse 50:6": "難道他們沒有仰觀天體嗎？我是怎樣建造它，點綴它，使它沒有缺陷的？",
                            "verse 50:7": "我曾展開大地，並將許多山岳投在上面，還使各種美麗的植物生長出來，",
                            "verse 50:8": "為的是啟發和教誨每個歸依的僕人。",
                            "verse 50:9": "我從雲中降下吉祥的雨水，就借它而生長許多果樹和五穀，",
                            "verse 50:10": "並生長扶疏的海棗樹，它有累累的果實，",
                            "verse 50:11": "用作眾僕的給養。我借雨水而使它已死的地方復活。死人的復活也是這樣的。",
                            "verse 50:12": "在他們之前否認使者的人，在努哈的宗族、蘭斯的居民、賽莫德人、",
                            "verse 50:13": "阿德人、法老、魯特的同胞、",
                            "verse 50:14": "叢林的居民和圖白的百姓，統統都否認過使者，故我所警告的刑罰，是必然降臨的。",
                            "verse 50:15": "我曾因創造而疲倦嗎？不然，他們對於再造，是在疑惑中的。",
                            "verse 50:16": "我確已創造人，我知道他心中的妄想；我比他的命脈還近於他。",
                            "verse 50:17": "當坐在右邊和左邊的兩個記錄的天神記錄各人的言行的時候，",
                            "verse 50:18": "他每說一句話，他面前都有天神當場監察。",
                            "verse 50:19": "臨死的昏迷，將昭示真理。這是你一向所逃避的。",
                            "verse 50:20": "號角將吹響，那是警告實現之日。",
                            "verse 50:21": "每個人都要到來，驅逐的天神和見証的天神，將與他同行。",
                            "verse 50:22": "你確忽視此事，現在我已揭開你的蒙蔽，所以你今日的眼光是銳利的。",
                            "verse 50:23": "他的伙伴將說：「這在我面前是現成的。」",
                            "verse 50:24": "你們倆所應當投入火獄的，是每個孤負者、頑固者、",
                            "verse 50:25": "慳吝者、過分者、懷疑者、",
                            "verse 50:26": "以別的神靈與真主同受崇拜者；你們倆將他投入嚴厲的刑罰吧！",
                            "verse 50:27": "他的伙伴將說：「我的主啊！我沒有使他放蕩，但他自陷於不近情理的迷誤中。」",
                            "verse 50:28": "主將說：「你們不要在我面前爭論，我確已預先警告你們了。",
                            "verse 50:29": "我的判詞，是不可變更的，我絕不是虧枉眾僕的。」",
                            "verse 50:30": "在那日，我將對火獄說：「你已填滿了嗎？」它將說：「還有增加的嗎？」",
                            "verse 50:31": "樂園將被移到敬畏者的附近，離得不遠。",
                            "verse 50:32": "這是你們所被應許的，這是賞賜每個歸依的守禮者的。",
                            "verse 50:33": "秘密敬畏至仁主，且帶歸依的心而來者，",
                            "verse 50:34": "你們平安地進入樂園吧！這是永居開始之日。",
                            "verse 50:35": "他們在樂園裡，將有他們意欲的；而且我在那裡還有加賜。",
                            "verse 50:36": "在他們之前，我毀滅了許多比他們更強悍的世代！他們曾在各地旅行，難道有什麼避死的地方嗎？",
                            "verse 50:37": "對於有心靈者，或專心靜聽者，此中確有一種教訓。",
                            "verse 50:38": "我在六日內確已創造了天地萬物，我沒有感覺一點疲倦。",
                            "verse 50:39": "故你應當忍受他們所說的讕言。在日出和日落之前，你應當讚頌你的主；",
                            "verse 50:40": "在夜間和叩頭後，你應當讚頌他。",
                            "verse 50:41": "你應當傾聽，在喊叫者從近處喊叫之日，",
                            "verse 50:42": "在他們聽見包含真理的吶喊之日，那是從墳中出來之日。",
                            "verse 50:43": "我確是使人生、使人死的，我確是最後的歸宿。",
                            "verse 50:44": "在大地破裂而他們迅速走出墳墓之日，那集合的事對於我是容易的。",
                            "verse 50:45": "我全知他們所說的讕言，你不能強制他們，故你應當以《古蘭經》教誨畏懼我的警告的人們。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Qáf. Při Koránu oslavovaném!",
                            "verse 50:2": "Ba naopak, oni se diví, že k nim přišel varovatel z jejich středu; a hovoří nevěřící: \"To je věc podivná!",
                            "verse 50:3": "Jak to, že až zemřeme a staneme se prachem...? To bude ale návrat z daleka!\"",
                            "verse 50:4": "My dobře víme, které z nich země pohltila, neboť máme knihu, jež záznamy střeží.",
                            "verse 50:5": "A naopak za lež pravdu prohlašovali, když přišla k nim, a jsou teď v zamotaném postavení.",
                            "verse 50:6": "Což se nepodívali na nebe nad sebou, jak jsme je zbudovali a ozdobili a že není na něm žádných trhlin?",
                            "verse 50:7": "A zemi jsme rozprostřeli a po ní pevně stojící hory rozhodili a na ní vyrůst jsme dali druhům všem překrásných rostlin",
                            "verse 50:8": "pro potěchu očí i jako připomenutí pro každého služebníka kajícného.",
                            "verse 50:9": "A seslali jsme z nebe vodu požehnanou, z níž dali jsme vyrůst zahradám i zrní, jež dává úrodu",
                            "verse 50:10": "a palmám ztepilým, jež v řadách nesou trsy plodů,",
                            "verse 50:11": "jako obživu služebníkům Našim. A vodou oživujeme i mrtvou zem, a takové bude i vaše vzkříšení.",
                            "verse 50:12": "A již před nimi to vše za lež prohlašoval lid Noemův, obyvatelé ar-Rassu i Thamúdovci,",
                            "verse 50:13": "´Ádovci, Faraón i Lotovi soukmenovci,",
                            "verse 50:14": "lidé Houštin i národ tubba´ů - ti všichni posly za lháře prohlásili, však uskutečnila se hrozba nad nimi.",
                            "verse 50:15": "Cožpak jsme byli prvním stvořením zmoženi? A přece oni pochybují o novém stvoření!",
                            "verse 50:16": "My stvořili jsme člověka a dobře víme, co duše jeho mu našeptává. Vždyť blíže jsme mu než jeho tepna krční,",
                            "verse 50:17": "když přijímají jeho slova dva andělé, zprava i zleva sedící.",
                            "verse 50:18": "A člověk nevyřkne slovo jediné, aniž je vedle něho připraven dohlížitel.",
                            "verse 50:19": "A pak dostaví se smrti opilost jako skutečnost a tohle je to, čemu ses vyhnout chtěl!",
                            "verse 50:20": "A bude na pozoun zatroubeno - a to bude den trestu slíbeného!",
                            "verse 50:21": "A každá duše se dostaví majíc s sebou průvodce a svědka jednoho.",
                            "verse 50:22": "Dosud lhostejný jsi byl k tomuto dni, ale sňali jsme ti roušku tvou, takže zrak tvůj se dnes zaostřil.",
                            "verse 50:23": "A řekne jeho věrný druh: \"Tady je to, co jsem u sebe ze svědectví připravil!\"",
                            "verse 50:24": "Vy dva do pekla vhoďte každého nevěřícího zarputilého,",
                            "verse 50:25": "bránícího dobrému, nepřátelského a pochybovačného,",
                            "verse 50:26": "který vedle Boha jiná božstva postavil! Vhoďte jej do trestu strašného!\"",
                            "verse 50:27": "A řekne jeho věrný druh: \"Pane náš, já jsem ho nesváděl, to on sám v dalekém bloudění byl.\"",
                            "verse 50:28": "I řekne Bůh: \"Nehádejte se tu přede mnou, vždyť jsem vás již dříve o své hrozbě uvědomil!",
                            "verse 50:29": "Slovo Mé je nezměnitelné a já neukřivdím žádnému svému služebníku",
                            "verse 50:30": "v den, kdy pekla se zeptáme:, Jsi již naplněno?? a ono odpoví:, Je ještě přírůstek nějaký?? \"",
                            "verse 50:31": "A přiblížen bude bohabojným ráj nedaleký",
                            "verse 50:32": "a bude řečeno: \"Toto je to, co vám bylo slíbeno... všem kajícníkům zákonů dbalým,",
                            "verse 50:33": "kteří v tajnosti se Milosrdného obávají a přicházejí se srdcem pokorným.",
                            "verse 50:34": "Vstupte tam v míru, toto je den nesmrtelnosti!\"",
                            "verse 50:35": "A čehokoliv se jim tam zachce, budou mít, a u Nás je ještě přídavek v hojnosti!",
                            "verse 50:36": "A kolik jsme již zahubili před nimi pokolení, jež mocnější než oni byla silou! Hledejte tedy v zemích všech, zda naleznete útočiště!",
                            "verse 50:37": "V tom věru je připomenutí pro toho, kdo ruce má či uši nastavuje a je sám svědkem očitým.",
                            "verse 50:38": "Stvořili jsme nebesa a zemi a to, co je mezi nimi, v šesti dnech, aniž se nás dotkla únava.",
                            "verse 50:39": "Snášej trpělivě jejich řeči a před slunce východem a západem oslavuj chválu svého Pána",
                            "verse 50:40": "a v noci též Jej oslavuj i na konci každého padnutí na zem!",
                            "verse 50:41": "A naslouchej dni, kdy hlasatel zavolá z místa blízkého;",
                            "verse 50:42": "ten den, kdy zaslechnou křik skutečně, to bude den vzkříšení.",
                            "verse 50:43": "My věru život i smrt dáváme a u Nás je cíl konečný.",
                            "verse 50:44": "V den, kdy se země rozpoltí, vyvrhne je se spěchem a bude pro nás toto shromáždění činem snadným;",
                            "verse 50:45": "my nejlépe známe, co hovoří, a ty nejsi ustanoven, abys je nutil násilím. Připomínej tedy pomocí Koránu těm, kdo hrozby Mé se obávají."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Qaaf. Bij de glorierijke Koran.",
                            "verse 50:2": "Maar zij verwonderen zich dat er uit e hun midden een waarschuwer tot hen kwam. En de ongelovigen zeggen: \"Dit is een zonderling iets!",
                            "verse 50:3": "Zullen wij in het leven worden geroepen wanneer wij dood gaan en stof zijn geworden? Zulk een terugkeer is onmogelijk.\"",
                            "verse 50:4": "Wij weten wat de aarde van hen verteert en bij Ons is een Boek dat alles bewaart.",
                            "verse 50:5": "Neen, zij hebben de Waarheid verloochend toen deze tot hen kwam, derhalve zijn zij in een verwarde toestand geraakt.",
                            "verse 50:6": "Zien zij niet naar de hemel boven hen hoe Wij deze hebben opgericht en versierd en dat dezelve geen gebreken heeft?",
                            "verse 50:7": "En de aarde - Wij hebben haar uitgespreid en stevige bergen er op gevestigd en Wij hebben er elk prachtig gewas op doen groeien.",
                            "verse 50:8": "Als inzicht en les voor iedere dienaar die zich er toe wendt.",
                            "verse 50:9": "En Wij zenden water vol zegeningen uit de hemel neder en Wij brengen daarmee tuinen en graan voort waarvan kan worden geoogst",
                            "verse 50:10": "En hoge palmbomen met bloeikolve over elkander gegroeid",
                            "verse 50:11": "Als voorziening voor Onze dienaren en Wij verkwikken daarmee een dood land. - Zo zal ook de Opstanding zijn.",
                            "verse 50:12": "Vóór hen verloochende ook het volk van Noach, de mensen van de Bron en het volk van Samoed,",
                            "verse 50:13": "Het volk van Aad, en Pharao en de broeders van Lot eveneens,",
                            "verse 50:14": "En de Bosbewoners, en het volk van Tobba, elk hunner verloochende de boodschapper. Daarom ging de bedreiging in vervulling.",
                            "verse 50:15": "Zijn Wij dan uitgeput door de eerste schepping? Neen, zij zijn in twijfel omtrent de nieuwe schepping.",
                            "verse 50:16": "En voorzeker, Wij hebben de mens geschapen en Wij weten alles wat zijn Ik hem toefluistert. En Wij zijn nader tot hem dan zijn halsader.",
                            "verse 50:17": "Wanneer de twee (engelen) die te boek stellen, schrijven, zit de een aan de rechter-, de andere aan de linkerzijde.",
                            "verse 50:18": "Hij uit geen woord of er is een bewaker bij hem, die altijd klaar staat.",
                            "verse 50:19": "En de bezwijming des doods komt waarlijk. \"Dit is hetgeen gij wildet ontvrluchten.\"",
                            "verse 50:20": "En er zal op de bazuin worden geblazen. \"Dit is de Dag der Bedreiging.\"",
                            "verse 50:21": "En iedere ziel zal tezamen komen met een geleider en een getuige.",
                            "verse 50:22": "Er zal worden gezegd: \"Gij waart hieromtrent achteloos. Nu hebben Wij uw sluier van u weggenomen en uw oog ziet deze Dag scherp.\"",
                            "verse 50:23": "En zijn metgezel zal zeggen: \"Dit is hetgeen bij mij gereed is.\"",
                            "verse 50:24": "\"Werpt, werpt in de hel elke ondankbare vijand.",
                            "verse 50:25": "\"Die het goede belette, de overtreder, de twijfelaar,",
                            "verse 50:26": "\"Die een andere God naast God oprichtte, doet hem de strenge marteling ondergaan.\"",
                            "verse 50:27": "Zijn metgezel zal zeggen: \"O, onze Heer, ik maakte hem niet opstandig maar hij was te ver afgedwaald.\"",
                            "verse 50:28": "God zal antwoorden: \"Redetwist niet in Mijn tegenwoordigheid, terwijl Ik u de waarschuwing vooraf heb gezonden.",
                            "verse 50:29": "Het vonnis door Mij geveld kan niet worden veranderd en Ik ben in het geheel niet onrechtvaardig jegens Mijn dienaren.\"",
                            "verse 50:30": "Op die Dag zullen Wij tot de hel zeggen: \"Zijt gij gevuld?\" En zij zal antwoorden: \"Is er nog iets?\"",
                            "verse 50:31": "En de Hemel zal dicht bij de rechtvaardigen worden gebracht en niet ver verwijderd.",
                            "verse 50:32": "Dit is hetgeen was beloofd voor een ieder die zich bekeerde en die waakzaam was,",
                            "verse 50:33": "Die de Barmhartige in het verborgene vreesde en met een berouwvol hart tot Hem kwam.",
                            "verse 50:34": "Gaat hier in vrede binnen. Dit is de Dag der Eeuwigheid.",
                            "verse 50:35": "Voor hen zal daarin zijn wat zij wensen en bij Ons is nog meer.",
                            "verse 50:36": "Maar hoevele geslachten hebben Wij (niet) vóór hen vernietigd, die machtiger in gezag waren dan dezen! Zij trokken door het land, maar was er een toevluchtsoord voor hen?",
                            "verse 50:37": "Daarin is voorwaar een vermaning voor hem die een hart heeft of die luistert en oplettend is.",
                            "verse 50:38": "En voorwaar, Wij schiepen de hemelen en de aarde en alles wat er tussen is in zes dagen en geen vermoeidheid raakte Ons.",
                            "verse 50:39": "Heb dus geduld met wat zij zeggen en verheerlijk uw Heer met de lof die Hem toekomt, vóór zonsop- en ondergang.",
                            "verse 50:40": "En verheerlijk Hem ’s nachts en na de gebeden.",
                            "verse 50:41": "En luister! De Dag, waarop de omroeper vanuit een dichtbijzijnde plaats zal roepen,",
                            "verse 50:42": "De Dag, waarop zij de kreet in werkelijkheid zullen horen, dat zal de Tijd zijn van het voor den dag komen.",
                            "verse 50:43": "Voorwaar, Wij zijn het die leven geven en de dood veroorzaken, en tot Ons is de terugkeer.",
                            "verse 50:44": "De Dag, waarop de aarde onder hen vaneen zal splijten, is het verzamelen gemakkelijk voor Ons.",
                            "verse 50:45": "Wij weten het beste wat zij zeggen en gij zijt er niet om hen te dwingen. Vermaan dus met de Koran hem die Mijn bedreiging vreest."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 50:1": "Qaf. By the Glorious Qur’an,",
                            "verse 50:2": "Nay, but they marvel that a warner of their own hath come unto them; and the disbelievers say: This is a strange thing:",
                            "verse 50:3": "When we are dead and have become dust (shall we be brought back again) ? That would be a far return!",
                            "verse 50:4": "We know that which the earth taketh of them, and with Us is a recording Book.",
                            "verse 50:5": "Nay, but they have denied the truth when it came unto them, therefor they are now in troubled case.",
                            "verse 50:6": "Have they not then observed the sky above them, how We have constructed it and beautified it, and how there are no rifts therein ?",
                            "verse 50:7": "And the earth have We spread out, and have flung firm hills therein, and have caused of every lovely kind to grow thereon,",
                            "verse 50:8": "A vision and a reminder for every penitent slave.",
                            "verse 50:9": "And We send down from the sky blessed water whereby We give growth unto gardens and the grain of crops,",
                            "verse 50:10": "And lofty date-palms with ranged clusters,",
                            "verse 50:11": "Provision (made) for men; and therewith We quicken a dead land. Even so will be the resurrection of the dead.",
                            "verse 50:12": "The folk of Noah denied (the truth) before them, and (so did) the dwellers at Ar-Rass and (the tribe of) Thamud,",
                            "verse 50:13": "And (the tribe of) A’ad, and Pharaoh, and the brethren of Lot,",
                            "verse 50:14": "And the dwellers in the wood, and the folk of Tubb’a: every one denied their messengers, therefor My threat took effect.",
                            "verse 50:15": "Were We then worn out by the first creation ? Yet they are in doubt about a new creation.",
                            "verse 50:16": "We verily created man and We know what his soul whispereth to him, and We are nearer to him than his jugular vein.",
                            "verse 50:17": "When the two Receivers receive (him), seated on the right hand and on the left,",
                            "verse 50:18": "He uttereth no word but there is with him an observer ready.",
                            "verse 50:19": "And the agony of death cometh in truth. (And it is said unto him): This is that which thou wast wont to shun.",
                            "verse 50:20": "And the trumpet is blown. This is the threatened Day.",
                            "verse 50:21": "And every soul cometh, along with it a driver and a witness.",
                            "verse 50:22": "(And unto the evil-doer it is said): Thou wast in heedlessness of this. Now We have removed from thee thy covering, and piercing is thy sight this day.",
                            "verse 50:23": "And (unto the evil-doer) his comrade saith: This is that which I have ready (as testimony).",
                            "verse 50:24": "(And it is said): Do ye twain hurl to hell each rebel ingrate,",
                            "verse 50:25": "Hinderer of good, transgressor, doubter,",
                            "verse 50:26": "Who setteth up another god along with Allah. Do ye twain hurl him to the dreadful doom.",
                            "verse 50:27": "His comrade saith: Our Lord! I did not cause him to rebel, but he was (himself) far gone in error.",
                            "verse 50:28": "He saith: Contend not in My presence, when I had already proffered unto you the warning.",
                            "verse 50:29": "The sentence that cometh from Me cannot be changed, and I am in no wise a tyrant unto the slaves.",
                            "verse 50:30": "On the day when We say unto hell: Art thou filled ? and it saith: Can there be more to come ?",
                            "verse 50:31": "And the Garden is brought nigh for those who kept from evil, no longer distant.",
                            "verse 50:32": "(And it is said): This is that which ye were promised. (It is) for every penitent and heedful one,",
                            "verse 50:33": "Who feareth the Beneficent in secret and cometh with a contrite heart.",
                            "verse 50:34": "Enter it in peace. This is the day of immortality.",
                            "verse 50:35": "There they have all that they desire, and there is more with Us.",
                            "verse 50:36": "And how many a generation We destroyed before them, who were mightier than these in prowess so that they overran the lands! Had they any place of refuge (when the judgment came) ?",
                            "verse 50:37": "Lo! therein verily is a reminder for him who hath a heart, or giveth ear with full intelligence.",
                            "verse 50:38": "And verily We created the heavens and the earth, and all that is between them, in six Days, and naught of weariness touched Us.",
                            "verse 50:39": "Therefor (O Muhammad) bear with what they say, and hymn the praise of thy Lord before the rising and before the setting of the sun;",
                            "verse 50:40": "And in the night-time hymn His praise, and after the (prescribed) prostrations.",
                            "verse 50:41": "And listen on the day when the crier crieth from a near place,",
                            "verse 50:42": "The day when they will hear the (Awful) Cry in truth. That is the day of coming forth (from the graves).",
                            "verse 50:43": "Lo! We it is Who quicken and give death, and unto Us is the journeying.",
                            "verse 50:44": "On the day when the earth splitteth asunder from them, hastening forth (they come). That is a gathering easy for Us (to make).",
                            "verse 50:45": "We are Best Aware of what they say, and thou (O Muhammad) art in no wise a compeller over them. But warn by the Qur’an him who feareth My threat."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 50:1": "Qaf: By the Glorious Qur’an (Thou art God’s Apostle).",
                            "verse 50:2": "But they wonder that there has come to them a Warner from among themselves. So the Unbelievers say: \"This is a wonderful thing!",
                            "verse 50:3": "\"What! When we die and become dust, (shall we live again?) That is a (sort of) return far (from our understanding).\"",
                            "verse 50:4": "We already know how much of them the earth takes away: With Us is a record guarding (the full account).",
                            "verse 50:5": "But they deny the Truth when it comes to them: so they are in a confused state.",
                            "verse 50:6": "Do they not look at the sky above them?- How We have made it and adorned it, and there are no flaws in it?",
                            "verse 50:7": "And the earth- We have spread it out, and set thereon mountains standing firm, and produced therein every kind of beautiful growth (in pairs)-",
                            "verse 50:8": "To be observed and commemorated by every devotee turning (to God).",
                            "verse 50:9": "And We send down from the sky rain charted with blessing, and We produce therewith gardens and Grain for harvests;",
                            "verse 50:10": "And tall (and stately) palm-trees, with shoots of fruit-stalks, piled one over another;-",
                            "verse 50:11": "As sustenance for (God’s) Servants;- and We give (new) life therewith to land that is dead: Thus will be the Resurrection.",
                            "verse 50:12": "Before them was denied (the Hereafter) by the People of Noah, the Companions of the Rass, the Thamud,",
                            "verse 50:13": "The ’Ad, Pharaoh, the brethren of Lut,",
                            "verse 50:14": "The Companions of the Wood, and the People of Tubba’; each one (of them) rejected the apostles, and My warning was duly fulfilled (in them).",
                            "verse 50:15": "Were We then weary with the first Creation, that they should be in confused doubt about a new Creation?",
                            "verse 50:16": "It was We Who created man, and We know what dark suggestions his soul makes to him: for We are nearer to him than (his) jugular vein.",
                            "verse 50:17": "Behold, two (guardian angels) appointed to learn (his doings) learn (and noted them), one sitting on the right and one on the left.",
                            "verse 50:18": "Not a word does he utter but there is a sentinel by him, ready (to note it).",
                            "verse 50:19": "And the stupor of death will bring Truth (before his eyes): \"This was the thing which thou wast trying to escape!\"",
                            "verse 50:20": "And the Trumpet shall be blown: that will be the Day whereof Warning (had been given).",
                            "verse 50:21": "And there will come forth every soul: with each will be an (angel) to drive, and an (angel) to bear witness.",
                            "verse 50:22": "(It will be said:) \"Thou wast heedless of this; now have We removed thy veil, and sharp is thy sight this Day!\"",
                            "verse 50:23": "And his Companion will say: \"Here is (his Record) ready with me!\"",
                            "verse 50:24": "(The sentence will be:) \"Throw, throw into Hell every contumacious Rejecter (of God)!-",
                            "verse 50:25": "\"Who forbade what was good, transgressed all bounds, cast doubts and suspicions;",
                            "verse 50:26": "\"Who set up another god beside God: Throw him into a severe penalty.\"",
                            "verse 50:27": "His Companion will say: \"Our Lord! I did not make him transgress, but he was (himself) far astray.\"",
                            "verse 50:28": "He will say: \"Dispute not with each other in My Presence: I had already in advance sent you Warning.",
                            "verse 50:29": "\"The Word changes not before Me, and I do not the least injustice to My Servants.\"",
                            "verse 50:30": "One Day We will ask Hell, \"Art thou filled to the full?\" It will say, \"Are there any more (to come)?\"",
                            "verse 50:31": "And the Garden will be brought nigh to the Righteous,- no more a thing distant.",
                            "verse 50:32": "(A voice will say:) \"This is what was promised for you,- for every one who turned (to God) in sincere repentance, who kept (His Law),",
                            "verse 50:33": "\"Who feared (God) Most Gracious Unseen, and brought a heart turned in devotion (to Him):",
                            "verse 50:34": "\"Enter ye therein in Peace and Security; this is a Day of Eternal Life!\"",
                            "verse 50:35": "There will be for them therein all that they wish,- and more besides in Our Presence.",
                            "verse 50:36": "But how many generations before them did We destroy (for their sins),- stronger in power than they? Then did they wander through the land: was there any place of escape (for them)?",
                            "verse 50:37": "Verily in this is a Message for any that has a heart and understanding or who gives ear and earnestly witnesses (the truth).",
                            "verse 50:38": "We created the heavens and the earth and all between them in Six Days, nor did any sense of weariness touch Us.",
                            "verse 50:39": "Bear, then, with patience, all that they say, and celebrate the praises of thy Lord, before the rising of the sun and before (its) setting.",
                            "verse 50:40": "And during part of the night, (also,) celebrate His praises, and (so likewise) after the postures of adoration.",
                            "verse 50:41": "And listen for the Day when the Caller will call out from a place quiet near,-",
                            "verse 50:42": "The Day when they will hear a (mighty) Blast in (very) truth: that will be the Day of Resurrection.",
                            "verse 50:43": "Verily it is We Who give Life and Death; and to Us is the Final Goal-",
                            "verse 50:44": "The Day when the Earth will be rent asunder, from (men) hurrying out: that will be a gathering together,- quite easy for Us.",
                            "verse 50:45": "We know best what they say; and thou art not one to overawe them by force. So admonish with the Qur’an such as fear My Warning!"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 50:1": "Qaf. By the glorious Koran!",
                            "verse 50:2": "Nay, but they marvel that a warner has come to them from among them; and the unbelievers say, ’This is a marvellous thing!",
                            "verse 50:3": "What, when we are dead and become dust? That is a far returning!’",
                            "verse 50:4": "We know what the earth diminishes of them; with Us is a book recording.",
                            "verse 50:5": "Nay, but they cried lies to the truth when it came to them, and so they are in a case confused.",
                            "verse 50:6": "What, have they not beheld heaven above them, how We have built it, and decked it out fair, and it has no cracks?",
                            "verse 50:7": "And the earth -- We stretched it forth, and cast on it firm mountains, and We caused to grow therein of every joyous kind",
                            "verse 50:8": "for an insight and a reminder to every penitent servant.",
                            "verse 50:9": "And We sent down out of heaven water blessed, and caused to grow thereby gardens and grain of harvest",
                            "verse 50:10": "and tall palm-trees with spathes compact,",
                            "verse 50:11": "a provision for the servants, and thereby We revived a land that was dead. Even so is the coming forth.",
                            "verse 50:12": "Cried lies before them the people of Noah and the men of Er-Rass, and Thamood,",
                            "verse 50:13": "and Ad and Pharaoh, the brothers of Lot,",
                            "verse 50:14": "the men of the Thicket, the people of Tubba’. Every one cried lies to the Messengers, and My threat came true.",
                            "verse 50:15": "What, were We wearied by the first creation? No indeed; but they are in uncertainty as to the new creation.",
                            "verse 50:16": "We indeed created man; and We know what his soul whispers within him, and We are nearer to him than the jugular vein.",
                            "verse 50:17": "When the two angels meet together, sitting one on the right, and one on the left,",
                            "verse 50:18": "not a word he utters, but by him is an observer ready.",
                            "verse 50:19": "And death’s agony comes in truth; that is what thou wast shunning!",
                            "verse 50:20": "And the Trumpet shall be blown; that is the Day of the Threat.",
                            "verse 50:21": "And every soul shall come, and with it a driver and a witness.",
                            "verse 50:22": "’Thou wast heedless of this; therefore We have now removed from thee thy covering, and so thy sight today is piercing.’",
                            "verse 50:23": "And his comrade shall say, ’This is what I have, made ready.’",
                            "verse 50:24": "’Cast, you twain, into Gehenna every froward unbeliever,",
                            "verse 50:25": "every hinderer of the good, transgressor, disquieter,",
                            "verse 50:26": "who set up with God another god; therefore, you twain, cast him into the terrible chastisement.’",
                            "verse 50:27": "And his comrade shall say, ’Our Lord, I made him not insolent, but he was in far error.’",
                            "verse 50:28": "He shall say, ’Dispute not before Me! For I sent you beforehand -- the threat.",
                            "verse 50:29": "The Word is not changed with Me; I wrong not My servants.’",
                            "verse 50:30": "Upon the day We shall say unto Gehenna, ’Art thou filled?’ And it shall say, ’Are there any more to come?’",
                            "verse 50:31": "And Paradise shall be brought forward to the godfearing, not afar:",
                            "verse 50:32": "’This is that you were promised; it is for every mindful penitent.’",
                            "verse 50:33": "Whosoever fears the All-merciful in the Unseen, and comes with a penitent heart:",
                            "verse 50:34": "’Enter it in peace! This is the Day of Eternity.’",
                            "verse 50:35": "Therein they shall have whatever they will; and with Us there is yet more.",
                            "verse 50:36": "How many a generation We destroyed before them that was stronger in valour than they, then they searched about in the land; was there any asylum?",
                            "verse 50:37": "Surely in that there is a reminder to him who has a heart, or will give ear with a present mind.",
                            "verse 50:38": "We created the heavens and the earth, and what between them is, in six days, and no weariness touched Us.",
                            "verse 50:39": "So be thou patient under what they say, and proclaim thy Lord’s praise before the rising of the sun, and before its setting,",
                            "verse 50:40": "and proclaim thy Lord’s praise in the night, and at the ends of the prostrations.",
                            "verse 50:41": "And listen thou for the day when the caller shall call from a near place.",
                            "verse 50:42": "On the day they hear the Cry in truth, that is the day of coming forth.",
                            "verse 50:43": "It is We who give life, and make to die, and to Us is the homecoming.",
                            "verse 50:44": "Upon the day when the earth is split asunder from about them as they hasten forth; that is a mustering easy for Us.",
                            "verse 50:45": "We know very well what they say; thou art not a tyrant over them. Therefore remind by the Koran him who fears My threat."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 50:1": "Qāf. CONSIDER this sublime Qur’ān!",
                            "verse 50:2": "But nay – they deem it strange that a warner should have come unto them from their own midst; and so these deniers of the truth are saying, \"A strange thing is this!",
                            "verse 50:3": "Why -[how could we be resurrected] after we have died and become mere dust? Such a return seems far-fetched indeed!\"",
                            "verse 50:4": "Well do We know how the earth consumes their bodies, for with Us is a record unfailing.",
                            "verse 50:5": "Nay, but they [who refuse to believe in resurrection] have been wont to give the lie to this truth whenever it was proffered to them; and so they are in a state of confusion.",
                            "verse 50:6": "Do they not look at the sky above them – how We have built it and made it beautiful and free of all faults?",
                            "verse 50:7": "And the earth – We have spread it wide, and set upon it mountains firm, and caused it to bring forth plants of all beauteous kinds,",
                            "verse 50:8": "thus offering an insight and a reminder unto every human being who willingly turns unto God.",
                            "verse 50:9": "And We send down from the skies water rich in blessings, and cause thereby gardens to grow, and fields of grain,",
                            "verse 50:10": "and tall palm-trees with their thickly-clustered dates,",
                            "verse 50:11": "as sustenance apportioned to men; and by [all] this We bring dead land to life: [and] even so will be [man’s] coming-forth from death.",
                            "verse 50:12": "[Long] before those [who now deny resurrection] did Noah’s people give the lie to this truth, and [so did] the folk of Ar-Rass, and [the tribes of] Thamūd",
                            "verse 50:13": "and ’ād, and Pharaoh, and Lot’s brethren,",
                            "verse 50:14": "and the dwellers of the wooded dales [of Madyan], and the people of Tubba’: they all gave the lie to the apostles – and thereupon that whereof I had warned [them] came true.",
                            "verse 50:15": "Could We, then, be [thought of as being] worn out by the first creation? Nay – but some people are [still] lost in doubt about [the possibility of] a new creation!",
                            "verse 50:16": "NOW, VERILY, it is We who have created man, and We know what his innermost self whispers within him: for We are closer to him than his neck-vein.",
                            "verse 50:17": "[And so,] whenever the two demands [of his nature] come face to face, contending from the right and from the left,",
                            "verse 50:18": "not even a word can he utter but there is a watcher with him, ever-present.",
                            "verse 50:19": "And [then,] the twilight of death brings with it the [full] truth – that [very thing, O man,] from which thou wouldst always look away! –",
                            "verse 50:20": "and [in the end] the trumpet [of resurrection] will be blown: that will be the Day of a warning fulfilled.",
                            "verse 50:21": "And every human being will come forward with [his erstwhile] inner urges and [his] conscious mind,",
                            "verse 50:22": "[and will be told:] \"Indeed, unmindful hast thou been of this [Day of Judgment]; but now We have lifted from thee thy veil, and sharp is thy sight today!\"",
                            "verse 50:23": "And one part of him will say: \"This it is that has been ever-present with me!\"",
                            "verse 50:24": "[Whereupon God will command:] \"Cast, cast into hell every [such] stubborn enemy of the truth,",
                            "verse 50:25": "[every] withholder of good [and] sinful aggressor [and] fomenter of distrust [between man and man – everyone]",
                            "verse 50:26": "who has set up another deity beside God: cast him, then, cast him into suffering severe!\"",
                            "verse 50:27": "Man’s other self will say: \"O our Sustainer! It was not I that led his conscious mind into evil – [nay,] but it had gone far astray [of its own accord]!\"",
                            "verse 50:28": "[And] He will say: \"Contend not before Me, [O you sinners,] for I gave you a forewarning [of this Day of Reckoning].",
                            "verse 50:29": "The judgment passed by Me shall not be altered; but never do I do the least wrong unto My creatures!\"",
                            "verse 50:30": "On that Day We will ask hell, \"Art thou filled?\" – and it will answer, \"[Nay,] is there yet more [for me]?\"",
                            "verse 50:31": "And [on that Day] paradise will be brought within the sight of the God-conscious, and will no longer be far away; [and they will be told:]",
                            "verse 50:32": "\"This is what you were promised – [promised] unto everyone who was wont to turn unto God and to keep Him always in mind",
                            "verse 50:33": "[everyone] who stood in awe of the Most Gracious although He is beyond the reach of human perception, and who has come [unto Him] with a heart full of contrition.",
                            "verse 50:34": "Enter this [paradise] in peace; this is the Day on which life abiding begins!\"",
                            "verse 50:35": "In that [paradise] they shall have whatever they may desire – but there is yet more with Us.",
                            "verse 50:36": "AND HOW MANY a generation have We destroyed before those [who now deny the truth] – people of greater might than theirs – but [when Our chastisement befell them,] they became wanderers on the face of the earth, seeking no more than a place of refuge.",
                            "verse 50:37": "In this, behold, there is indeed a reminder for everyone whose heart is wide-awake – that is, [everyone who] lends ear with a conscious mind",
                            "verse 50:38": "and [who knows that] We have indeed created the heavens and the earth and all that is between them in six aeons, and [that] no weariness could ever touch Us.",
                            "verse 50:39": "HENCE, [O believer,] bear thou with patience whatever they may say, and extol thy Sustainer’s limitless glory and praise before the rising of the sun and before its setting;",
                            "verse 50:40": "and in the night, too, extol His glory, and at every prayer’s end.",
                            "verse 50:41": "And [always] listen for the day when He who issues the call [of death] shall call [thee] from close-by;",
                            "verse 50:42": "[and bethink thyself, too, of] the Day on which all [human beings] will in truth hear the final blast – that Day of [their] coming-forth [from death].",
                            "verse 50:43": "Verily, it is We who grant life and deal death; and with Us will be all journeys’ end",
                            "verse 50:44": "on the Day when the earth is riven asunder all around them as they hasten forth [towards God’s judgment]: that gathering will be easy for Us [to encompass].",
                            "verse 50:45": "Fully aware are We of what they [who deny resurrection] do say; and thou canst by no means force them [to believe in it]. Yet none the less, remind, through this Qur’ān, all such as may fear My warning."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 50:1": "Qāf . (I swear) by the glorious Qur’ān, (you are sent as a messenger.)",
                            "verse 50:2": "But they wonder that a warner has come to them from among themselves; so the disbelievers said, “This is something strange.",
                            "verse 50:3": "Is it when we die and become dust (that we will be brought to life again?) That is a return, far (from understanding).”",
                            "verse 50:4": "We know very well how much of them is diminished by the earth, and We have a Book that Preserves every thing.",
                            "verse 50:5": "Rather, they rejected the truth when it came to them; so they are in a confused state.",
                            "verse 50:6": "Did they not, then, look to the sky above them, how We have built it and beautified it, and it has no cracks?",
                            "verse 50:7": "As for the earth, We have spread it out, and cast on it firm hills, and caused to grow therein every kind of delightful things,",
                            "verse 50:8": "as a source of vision and as a lesson to every servant (of Allah) who turns (to Him for guidance).",
                            "verse 50:9": "And We sent down blessed water from the sky, and caused to grow therewith gardens and grain of harvest,",
                            "verse 50:10": "and towering date palms that have spadices, put one upon another,",
                            "verse 50:11": "as a provision to the servants (of Allah). And We gave life with it to a dead land. Similar will be the exit (of the dead from their graves).",
                            "verse 50:12": "It (resurrection) was rejected before them by the people of NūH, and the people of Rass and Thamūd,",
                            "verse 50:13": "and ‘Ād, and Fir’aun (Pharaoh), and the brothers of LūT,",
                            "verse 50:14": "and dwellers of Aaikah, and the people of Tubba’. Each one of them rejected the messengers; so My threat came true.",
                            "verse 50:15": "Is it, then, that We were worn out by the first creation? No, but they are still in confusion about the new creation.",
                            "verse 50:16": "Indeed We have created man, and We know whatever thoughts his inner self develops, and We are closer to him than (his) jugular vein,",
                            "verse 50:17": "when the two receiving angels receive (every human act to record it), seated (one) on the right and (one) on the left.",
                            "verse 50:18": "Not a single word is uttered by one but there is a watcher near him, ready (to record).",
                            "verse 50:19": "The daze of death has (to) come with truth. That is what you tried to escape.",
                            "verse 50:20": "And the Horn will be blown. That will be the day of (which) threat (was given).",
                            "verse 50:21": "And everybody will come, along with one (angel) to drive (him to the field of reckoning) and one (angel) to testify (about his deeds).",
                            "verse 50:22": "“You were heedless of this. Now We have removed your veil from you; so your sight today is sharp.”",
                            "verse 50:23": "And his companion (i.e. the angel who recorded his deeds) will say, “This is what I have with me, ready (to be presented as his record of deeds).”",
                            "verse 50:24": "(Then it will be said,) “Cast, (O two angels,) into Jahannam (Hell) every obstinate disbeliever",
                            "verse 50:25": "who used to prevent (others) from good (behavior), who transgressed all bounds, who cast doubts (in true faith),",
                            "verse 50:26": "who set up another god along with Allah. So cast him (O angels) in the painful punishment.”",
                            "verse 50:27": "His (evil) companion (i.e. the Satan) will say, “O our Lord, I did not cause him to rebel, but he was himself (involved) in straying far from the track.”",
                            "verse 50:28": "He (Allah) will say, “Do not quarrel before Me, while I had sent to you My threat well in advance.",
                            "verse 50:29": "The Word is not changed with Me, and I Am not so unjust to My servants.”",
                            "verse 50:30": "(Remind them of) the Day when We will say to Jahannam (Hell), “Are you filled up?” and it will say, “Are there some more?”",
                            "verse 50:31": "And the Jannah (Paradise) will be brought close for the God-fearing, no longer distant.",
                            "verse 50:32": "(And it will be said,) “This is what you were promised for everyone who was oft-returning to Allah, vigilant (against sins),",
                            "verse 50:33": "the one who feared the RaHmān (The All-Merciful Allah), without seeing Him, and came up with a heart oriented towards Him.",
                            "verse 50:34": "Enter it in peace. That is the Day of Eternity.”",
                            "verse 50:35": "They will have in it whatever they wish, and with Us there are things even more than that.",
                            "verse 50:36": "And how many a generation We have destroyed before them who were stronger than these in their grip on power, and they searched out the cities. Was there any place (for them) to escape?",
                            "verse 50:37": "Indeed, there is a lesson in all this for him who has a heart and gives ear (to the truth) attentively.",
                            "verse 50:38": "We created the heavens and the earth and all that is between them in six days, and no weariness even touched Us.",
                            "verse 50:39": "So, (O Prophet,) endure with patience what they say, and proclaim His purity, along with your Lord’s praise, before sunrise and before sunset.",
                            "verse 50:40": "And in hours of night, proclaim His purity, and at the ends of prostration.",
                            "verse 50:41": "And listen: The Day when the caller will call out from a near place,",
                            "verse 50:42": "the Day they will hear the Cry in reality- that will be the Day of Resurrection.",
                            "verse 50:43": "Surely We alone give life and bring death, and to Us is the final return",
                            "verse 50:44": "on the Day when the earth will burst apart exposing them, while they will be hurrying up (to come out). That is an assembly, so easy for Us (to muster).",
                            "verse 50:45": "We know well what they say, and you are not (sent) as one who compels them. So exhort, through the Qur’ān, the one who fears My warning."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 50:1": "Qāf. By the glorious Qur’ān.",
                            "verse 50:2": "Nay, but they consider it odd that there should have come to them a warner from among themselves. So the disbelievers say, ‘This is an odd thing!",
                            "verse 50:3": "What! When we are dead and have become dust? That is a far-fetched return!’",
                            "verse 50:4": "We know what the earth diminishes of them, and with Us is a preserving Book.",
                            "verse 50:5": "Nay, but they denied the truth, when it came to them and so they are [now] in a confounded situation.",
                            "verse 50:6": "Have they not then looked at the heaven above them, how We have built it, and adorned it, and how there are no cracks in it?",
                            "verse 50:7": "And the earth We have spread it out, and cast in it firm mountains, and caused every delightful kind to grow in it,",
                            "verse 50:8": "as an insight and a reminder for every penitent servant.",
                            "verse 50:9": "And We send down from the heaven blessed water with which We cause to grow gardens and the grain that is harvested,",
                            "verse 50:10": "and the date-palms that stand tall with piled spathes,",
                            "verse 50:11": "as provision for [Our] servants; and with it We revive a dead land. So shall be the rising.",
                            "verse 50:12": "The people of Noah denied before them and [so did] the dwellers at al-Rass and Thamūd,",
                            "verse 50:13": "and ‘ād, and Pharaoh, the brethren of Lot,",
                            "verse 50:14": "and the dwellers in the wood, and the people of Tubba’. Each denied the messengers, and so My threat became due.",
                            "verse 50:15": "Were We then wearied by the first creation? Nay, yet they are in doubt about a new creation.",
                            "verse 50:16": "And verily We created man and We know what his soul whispers to him, and We are nearer to him than his jugular vein.",
                            "verse 50:17": "When the two Receivers receive, seated on the right and on the left,",
                            "verse 50:18": "he does not utter a word but that there is beside him a watcher, [who is] ready.",
                            "verse 50:19": "And the agony of death arrives with the truth. That is what you used to shun.",
                            "verse 50:20": "And the Trumpet will be blown. That is the Day of the Promised Threat.",
                            "verse 50:21": "And every soul will come, accompanied by a driver, and a witness:",
                            "verse 50:22": "‘Verily, you were oblivious of this: So [now] We have removed from you your covering, and so your sight on this day is acute’.",
                            "verse 50:23": "And his companion will say, ‘This is what I have ready with me [as testimony]’:",
                            "verse 50:24": "‘Cast into Hell every obdurate disbeliever,",
                            "verse 50:25": "hinderer of good, transgressor, skeptic,",
                            "verse 50:26": "who has set up alongside God another god! Cast him then into the severe chastisement’.",
                            "verse 50:27": "And his companion will say, ‘Our Lord! I did not make him a rebel, but he [himself] was in extreme error’.",
                            "verse 50:28": "He will say, ‘Do not dispute in My presence, for I had already given you the threat.",
                            "verse 50:29": "The word [that comes] from Me cannot be altered, and I am not unjust to servants’",
                            "verse 50:30": "on the day when We will say to Hell, ‘Are you [now] full?’ and it will say: ‘Are there any more?’",
                            "verse 50:31": "And Paradise will be brought near for the God-fearing, not far .",
                            "verse 50:32": "‘This is what you were promised — [it is] for every penitent one, who is mindful,",
                            "verse 50:33": "who fears the Compassionate One [while He is] in the Unseen, and comes with a penitent heart’.",
                            "verse 50:34": "‘Enter it in peace! That is the day of immortality’.",
                            "verse 50:35": "Therein they will have whatever they wish; and with Us there is yet more.",
                            "verse 50:36": "And how many a generation We destroyed before them, who were mightier than these in prowess, and [who] then searched throughout the land [wondering]: is there any escape?",
                            "verse 50:37": "Assuredly there is in that a reminder for him who has a heart, or gives ear in [full] witness.",
                            "verse 50:38": "And verily We created the heavens and the earth, and all that is between them, in six days, and no weariness touched Us.",
                            "verse 50:39": "So endure [patiently] what they say, and glorify with praise of your Lord before the rising of the sun and before the sunset;",
                            "verse 50:40": "and glorify Him at [some part of the] night and after prostrations.",
                            "verse 50:41": "And listen on the day when the caller calls out from a place that is near.",
                            "verse 50:42": "On the day when they hear the Call of truth; that is the day of coming forth.",
                            "verse 50:43": "Indeed it is We Who give life and bring death, and to Us is the journey’s end.",
                            "verse 50:44": "On the day when the earth is split asunder from them, [they will come] hastening forth. That is an easy gathering for Us.",
                            "verse 50:45": "We know best what they say, and you are not [to be] a coercer of them. So admonish by the Qur’ān those who fear My threat."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 50:1": "Qaf. (Only Allah and the Messenger [blessings and peace be upon him] know the real meaning.) By the Glorious Qur’an,",
                            "verse 50:2": "But they wondered that a Warner had come to them from amongst themselves. So the disbelievers say: ‘This is strange!",
                            "verse 50:3": "Is it that when we are dead and have become dust (then we shall become alive again)? This return is far (from understanding and perception).’",
                            "verse 50:4": "Definitely, We know how much the earth (eats up and) consumes their (bodies), and We have a Book wherein everything is preserved.",
                            "verse 50:5": "But (strange and far from understanding is this that) they denied the truth (i.e., the Messenger and the Qur’an) when it came to them. So they have themselves stepped into anxiety and confusion.",
                            "verse 50:6": "Have they not looked at the sky above them how We made it and (how) We adorned it, and there is no crack in it?",
                            "verse 50:7": "And (in the same way) We spread out the earth and We placed in it heavy mountains and produced in it every kind of beautiful plants.",
                            "verse 50:8": "All that is (a source of) insight, direction and guidance for every servant who turns (to Allah in repentance).",
                            "verse 50:9": "And We showered blessed water from the sky and then produced with it gardens and (also) the grain of harvests,",
                            "verse 50:10": "And date-palms soaring high with layers of spathes.",
                            "verse 50:11": "(This all is done as) sustenance for the servants, and We gave life with this (water) to the dead earth. In like manner is (your) coming forth from the graves.",
                            "verse 50:12": "Before these (disbelievers of Mecca), the people of Nuh (Noah) and the people of the blind well (al-Rass in al-Yamama) and Thamud (the people of Salih, in the town of al-Hijr near Tabuk on the Medina-Syria road),",
                            "verse 50:13": "And ‘Ad (the people of Hud in Ahqaf valley of Yemen situated between Oman and the al-Mahra) and Pharaoh (the ruler of Egypt) and the people of Lut [Lot] (living in Sodom and ‘Amura [Gomorrah] in Palestine),",
                            "verse 50:14": "And the inhabitants of al-Ayka (the wood in Madyan, the people of Shu‘ayb), and the people of Tubba‘ (the people of As‘ad Abu Kurib al-Himyari, the King of Yemen)—(in sum) all (of them) rejected the Messengers. So My promise of punishment (against them) proved true.",
                            "verse 50:15": "So are We tired by the first creation? (Nay!) In fact, it is they who are in doubt about the new creation.",
                            "verse 50:16": "And assuredly, We created man and We know (also) the doubts which his (ill-commanding) self puts (into his heart and mind). And We are nearer to him than his jugular vein.",
                            "verse 50:17": "When the two receivers receive (the recording angels write down his every communication and work), sitting on the right and on the left,",
                            "verse 50:18": "Not a word does he utter but a watcher is there beside him ready (to write it).",
                            "verse 50:19": "And the stupor of death comes with the truth. (O man,) that is what you were running away from!",
                            "verse 50:20": "And the Trumpet will be blown. It is (this torment) the Day of Warning.",
                            "verse 50:21": "And every soul will appear (before Our presence), one (angel) forcing it forward and (the other) a witness (to its actions).",
                            "verse 50:22": "The truth is that you were negligent of this (Day), so We have removed your veil (of negligence) and Today your sight is sharp.",
                            "verse 50:23": "And his close companion (angel) will say: ‘That is what I have ready (for you).’",
                            "verse 50:24": "(It will be commanded:) ‘Both of you hurl into Hell every (such) ungrateful rebel,",
                            "verse 50:25": "That hinders from good, exceeds the limits, doubts and puts into doubt,",
                            "verse 50:26": "That had set up another god besides Allah. So hurl him into a fierce torment.’",
                            "verse 50:27": "(Now) his (other) companion (Satan) will say: ‘O our Lord, I did not misguide him. In fact, he was himself suffering from misguidance of extreme degree.’",
                            "verse 50:28": "Allah will say: ‘Do not dispute in My presence whilst I have already sent you the warning (of punishment).",
                            "verse 50:29": "The command is never changed in My presence. Nor do I wrong the servants.’",
                            "verse 50:30": "That Day We shall ask Hell: ‘Are you filled up?’ And it will say: ‘Is there any more?’",
                            "verse 50:31": "And Paradise will be brought close to the pious; it will not be distant at all.",
                            "verse 50:32": "(And it will be said to them:) ‘This is what you were promised; (it is meant) for everyone who turns to Allah in repentance and who guards (his Din [Religion] and faith),",
                            "verse 50:33": "Who fears the Most Kind (Lord) unseen, and comes (before the presence of Allah) with a heart turned in repentance.",
                            "verse 50:34": "Enter it in peace; this is the Day of Eternity.’",
                            "verse 50:35": "All those blessings which they will long for will be there for them in that (Paradise), and there is still another blessing with Us (or much more; so the lovers will be enchanted).",
                            "verse 50:36": "And how many generations We destroyed before them (the disbelievers and idolaters of Mecca) who were far stronger in power and might than they! So they searched the cities (of the world) to run away somewhere for refuge (from death or torment).",
                            "verse 50:37": "There is indeed sure warning and admonition in it for him who has a heart (vigilant and awake, far from negligence,) or listens with active attention (i.e., focuses attention having no contact with anyone other than Allah) and is in a state of (spiritual) vision (i.e., remains lost in the effulgent disclosures of Allah’s absolute beauty).",
                            "verse 50:38": "And surely, We have created the heavens and the earth and that (universe) which is between the two in six periods and no fatigue has touched Us.",
                            "verse 50:39": "So be patient with what they say and glorify your Lord with praise before sunrise and before sunset.",
                            "verse 50:40": "And also glorify Him during some hours of the night and after the Prayers as well.",
                            "verse 50:41": "And listen attentively (of the Day) when a caller will call from a near place,",
                            "verse 50:42": "The Day when people will assuredly hear a mighty roar. That will be the Day of coming out from the graves.",
                            "verse 50:43": "Surely, it is We Who give life, and it is We Who cause death, and to Us is the return.",
                            "verse 50:44": "The Day when the earth will split apart from above them, they will come out in haste. This raising them alive (i.e., gathering the people once again) is quite easy for Us.",
                            "verse 50:45": "We know best what they say, and you are not the one to coerce them. So advise by means of the Qur’an anyone who fears My threat of punishment."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Kaikkivoipa Jumala ja ylevä Koraani.",
                            "verse 50:2": "He ihmettelevät, että heille on tullut varoittaja heidän omasta keskuudestaan, ja epäuskoiset sanovat: »Olisi ihmeellistä,",
                            "verse 50:3": "että kuoltuamme ja muututtuamme tomuksi jälleen ylösnousisimme. Se olisi ihmeellinen paluu.»",
                            "verse 50:4": "Mehän tiedämme, minkä verran heistä jää maan omaksi, sillä meillä on kirjoitus, joka sisältää kaiken.",
                            "verse 50:5": "Ei, he hylkäsivät totuuden, kun se tuli heille, niin että he nyt ovat sekasorron tilassa.",
                            "verse 50:6": "Eivätkö he siis katso ylös taivaaseen nähdäkseen, miten Me olemme sen rakentanut ja koristanut, niin että siinä ei ole mitään vajaata?",
                            "verse 50:7": "Ja maan Me olemme avartanut sekä sijoittanut siihen vuoria ja kasvattanut siinä kaikenlaisia kauniita kasveja",
                            "verse 50:8": "antaaksemme ymmärryksen ja kehoituksen jokaiselle Jumalan puoleen kääntyvälle palvelijalle.",
                            "verse 50:9": "Me lähetämme myös pilvistä siunatun sateen ja sillä kasvatamme puutarhat ja viljan, joka korjataan,",
                            "verse 50:10": "kookkaat palmut, hedelmäkimput oksissa toinen toisensa yläpuolella",
                            "verse 50:11": "ravinnoksi palvelijoilleni, ja siten annamme elämän kuivaneelle maalle. Sellainen on ylösnousemus.",
                            "verse 50:12": "Ennen heitä Nooan kansa, Ar-Rassin asukkaat, Tamuud,",
                            "verse 50:13": "Aad, Farao ja Lootin veljet hylkäsivät profeetat;",
                            "verse 50:14": "ja viidakon asukkaat sekä Tuuban kansa; kaikki he hylkäsivät sananjulistajani, mutta silloin uhkaukseni kävi toteen.",
                            "verse 50:15": "Väsyimmekö ensimmäisessä luomisessa? Kuitenkin he epäilevät uutta luomista.",
                            "verse 50:16": "Totisesti Me olemme luonut ihmisen ja tiedämme, mitä hänen sielunsa hänelle kuiskaa, ja olemme lähempänä häntä kuin hänen oma elinsuonensa.",
                            "verse 50:17": "On kaksi kuuntelijaa, jotka istuvat oikealla ja vasemmalla puolella kuunnellen.",
                            "verse 50:18": "Eikä ihminen lausu sanaakaan hänen lähettyvillään olevan tarkkaajan kuulematta.",
                            "verse 50:19": "Ja kuoleman hourailu on tuleva ilmaisten totuuden: »Tämä oli se päivä, jota kavahditte.»",
                            "verse 50:20": "Ja pasuunaan puhalletaan; se on uhkausten ja lupauksen päivä.",
                            "verse 50:21": "Ja joka sielu on tuleva seurassaan kiihoittaja ja todistaja.",
                            "verse 50:22": "»Totisesti et ole tästä päivästä välittänyt, mutta nyt olemme poistanut verhon silmiltäsi, niin että näkösi tänään on tarkka.»",
                            "verse 50:23": "Ja hänen seuralaisensa sanoo: »Tässä on se, mitä minulla on valmiina.»",
                            "verse 50:24": "»Heittäkää alas helvettiin jokainen kiittämätön ja kapinallinen,",
                            "verse 50:25": "hyvän kieltäjä, rajain ylittäjä, epäilijä,",
                            "verse 50:26": "joka asettaa muita Jumalan rinnalle! Heittäkää hänet kauheaan kidutukseen!»",
                            "verse 50:27": "Hänen seuralaisensa sanoo: »Herra, en ole vietellyt häntä, vaan hän itse oli suuresti eksynyt.»",
                            "verse 50:28": "Hän vastaa: »Älkää kiistelkö Minun luonani! Olen totisesti varoittanut teitä etukäteen.»",
                            "verse 50:29": "Minun sanani ei muutu, enkä Minä tee vääryyttä palvelijoilleni.»",
                            "verse 50:30": "Sinä päivänä Me sanomme helvetille: »Oletko täynnä?» ja se vastaa: »Tuleeko vielä lisää?»",
                            "verse 50:31": "Ja paratiisi lähestyy niitä, jotka pahaa karttavat.",
                            "verse 50:32": "Tämä on se, mitä teille luvattiin, jokaiselle, joka usein kääntyy Jumalan puoleen ja pitää Hänen käskynsä,",
                            "verse 50:33": "joka pelkää laupiasta Jumalaa salaisestikin ja lähestyy Häntä katuvaisin sydämin.",
                            "verse 50:34": "Astukaa sisään rauhassa! Tämä on ikuisuuden päivä.»",
                            "verse 50:35": "He saavat siellä mitä toivovat ja Meidän luonamme vielä enemmän.",
                            "verse 50:36": "Kuinka monet sukupolvet ennen heitä tuhosimmekaan, sukupolvet, jotka olivat mahtavampia kuin he. Kiertäkää maita, niin näette, onko mitään turvapaikkaa minun kostoltani.",
                            "verse 50:37": "Totisesti tämä on riittävä muistutus sille, jolla on ymmärtäväinen sydän ja joka käyttää kuuloaan ja näkee omilla silmillään.",
                            "verse 50:38": "Totisesti Me olemme kuudessa päivässä luonut taivaat ja maan ja mitä on niiden välillä, eikä väsymys vähääkään vaivannut meitä.",
                            "verse 50:39": "Kestä sentähden kärsivällisesti, mitä he sanovat, ja ylistä ja kiitä Herraa ennen sekä auringon nousua että sen laskua.",
                            "verse 50:40": "Ylistä Häntä yöllä ja rukouksen jälkeen,",
                            "verse 50:41": "ja kuunnelkaa sinä päivänä, jolloin kutsuja kutsuu lähellänne,",
                            "verse 50:42": "päivänä, jolloin he kuulevat totuuden huudon. Se on ylösnousemuksen päivä.",
                            "verse 50:43": "Totisesti, Meistä on elämä ja kuolema lähtöisin ja Meidän luoksemme kaikki palaa.",
                            "verse 50:44": "Päivänä, jolloin maa repeää heidän allaan, he kiirehtivät; silloin tapahtuu kokoaminen, mikä on Meille helppoa.",
                            "verse 50:45": "Me tiedämme parhaiten, mitä he sanovat, ja sinä et ole heidän hallitsijansa. Muistuta siis Koraanin avulla sitä, joka pelkää uhkaustani."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 50:1": "Qâf. Par le Coran sublime !",
                            "verse 50:2": "Ils s'étonnent que leur soit venu un avertisseur issu d'entre eux. Et les mécréants de s'exclamer : \" C'est là chose bien étrange !",
                            "verse 50:3": "Se pourrait-il qu'une fois morts et devenus poussière nous allions revivre ? Ce sera revenir de loin ! \"",
                            "verse 50:4": "Nous savons bien lesquels d'entre eux la terre reprend, et il y a auprès de Nous un Livre où tout se consigne.",
                            "verse 50:5": "Mais non ! Ils ont nié la Vérité lorsqu'elle est venue à eux, et les voilà dans une situation très difficile.",
                            "verse 50:6": "Ne regardent-ils pas le firmament au-dessus d'eux et ne voient-ils pas comment Nous l'avons édifié et orné, sans qu'il comporte la moindre fissure ?",
                            "verse 50:7": "Et la terre ! Nous l'avons étendue, Nous y avons jeté des montagnes et Nous y avons fait pousser toutes sortes d'espèces admirables,",
                            "verse 50:8": "comme un appel à la clairvoyance et un rappel pour tout serviteur repentant.",
                            "verse 50:9": "Nous avons fait descendre du ciel une eau bénie grâce à laquelle Nous avons fait croître des jardins, le grain de la moisson",
                            "verse 50:10": "et les palmiers élancés, porteurs de régimes bien ordonnés qui sont une nourriture pour",
                            "verse 50:11": "Nos serviteurs. Par cette eau Nous avons rendu la vie à une contrée morte. Telle sera la Résurrection !",
                            "verse 50:12": "D'autres, avant eux, avaient crié au mensonge : le peuple de Noé, les habitants d'Ar- Rass, les Thamoud,",
                            "verse 50:13": "les 'Ad, Pharaon, les frères de Loth,",
                            "verse 50:14": "les habitants d'al-Aïka, le peuple de Tubba'. Tous ont traité les envoyés d'imposteurs et Ma menace s'est alors réalisée.",
                            "verse 50:15": "Aurions-Nous été fatigué par la première création ? Que non ! Et pourtant, ils sont dans le doute au sujet d'une nouvelle création !",
                            "verse 50:16": "Nous avons créé l'homme et Nous savons ce que son âme lui susurre. Nous sommes plus proches de lui que sa veine jugulaire.",
                            "verse 50:17": "Lorsque les deux anges envoyés à sa rencontre se sont assis à sa droite et à sa gauche,",
                            "verse 50:18": "l'homme ne profère aucune parole sans que se tienne auprès de lui un observateur prêt à inscrire.",
                            "verse 50:19": "L'ivresse de la mort survient en vérité : voilà ce à quoi tu voulais échapper !",
                            "verse 50:20": "On soufflera dans la trompette. Voici le jour de la menace !",
                            "verse 50:21": "Chaque âme sera accompagnée d'un conducteur et d'un témoin.",
                            "verse 50:22": "Tu restais insouciant à cela ; mais Nous avons levé ton voile de sorte que ta vue aujourd'hui est perçante !",
                            "verse 50:23": "Son compagnon dira : \" Voilà ce que je tiens prêt ! \"",
                            "verse 50:24": "Vous deux, jetez dans la Géhenne tout négateur endurci, qui s'oppose au bien,",
                            "verse 50:25": "qui transgresse, qui doute.",
                            "verse 50:26": "Celui qui plaçait une divinité à côté de Dieu, jetez-le dans le terrible châtiment !",
                            "verse 50:27": "Son compagnon dira : \" Notre Seigneur ! Je ne l'ai pas incité à la révolte, mais il était dans un profond égarement \".",
                            "verse 50:28": "Dieu dira : \" Ne vous querellez pas devant Moi ! Je vous avais bien prévenus de la menace.",
                            "verse 50:29": "La Parole, chez Moi, ne varie pas, et Je ne suis pas un tyran pour Mes serviteurs \".",
                            "verse 50:30": "Un jour Nous dirons à la Géhenne : \" Es-tu remplie ? \" et elle répondra : \" En viendra-til davantage ? \"",
                            "verse 50:31": "Le Jardin sera tout proche de ceux qui craignent Dieu :",
                            "verse 50:32": "\" Voici ce qui vous a été promis, comme à tous ceux qui se repentent et observent la loi divine,",
                            "verse 50:33": "qui redoutent le Miséricordieux en Son mystère et viennent à Lui avec un cœur contrit.",
                            "verse 50:34": "Entrez ici en paix : voici venu le Jour de l'éternité \".",
                            "verse 50:35": "Ils y trouveront tout ce qu'ils désirent, et bien davantage encore auprès de Nous.",
                            "verse 50:36": "Combien de générations n'avons-Nous pas anéanties avant eux, qui étaient plus puissantes qu'eux ! Parcourez donc la terre ; y trouverez-vous un abri ?",
                            "verse 50:37": "Certes, il y a là un rappel pour qui possède un cœur, ou pour qui prête l'oreille et assiste en témoin.",
                            "verse 50:38": "Nous avons créé les cieux, la terre et ce qui se trouve entre les deux en six jours, sans que la fatigue Nous atteigne.",
                            "verse 50:39": "Supporte patiemment ce qu'ils disent et célèbre les louanges de ton Seigneur, avant le lever du soleil et avant son coucher ;",
                            "verse 50:40": "glorifie-Le aussi durant une partie de la nuit et après la prosternation.",
                            "verse 50:41": "Prête l'oreille le Jour où le crieur appellera d'un lieu proche,",
                            "verse 50:42": "le Jour où ils entendront le cri : ce sera le Jour de la Résurrection !",
                            "verse 50:43": "Certes, c'est Nous qui donnons la vie et qui donnons la mort, et c'est à Nous que tout retourne.",
                            "verse 50:44": "Le Jour où la terre se fendra soudain devant eux : ce sera un rassemblement facile pour Nous.",
                            "verse 50:45": "Nous savons parfaitement ce qu'ils disent, et toi tu n'as pas à les contraindre. Avertis donc par le Coran celui qui redoute Ma menace."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 50:1": "Qaf. Par le Coran glorieux !",
                            "verse 50:2": "Mais ils s’étonnent que l’un des leurs leur vint comme avertisseur; et les mécréants dirent : «Ceci est une chose étonnante».",
                            "verse 50:3": "Quoi ! Quand nous serons morts et réduits en poussière... ? Ce serait revenir de loin» !",
                            "verse 50:4": "Certes, Nous savons ce que la terre rongera d’eux [de leurs corps]; et Nous avons un Livre où tout est conservé.",
                            "verse 50:5": "Plutôt, ils traitent de mensonge la vérité qui leur est venue : les voilà donc dans une situation confuse.",
                            "verse 50:6": "N’ont-ils donc pas observé le ciel au-dessus d’eux, comment Nous l’avons bâti et embelli; et comment il est sans fissures ?",
                            "verse 50:7": "Et la terre, Nous l’avons étendue et Nous y avons enfoncé fermement des montagnes et y avons fait pousser toutes sortes de magnifiques couples de ,",
                            "verse 50:8": "à titre d’appel à la clairvoyance et un rappel pour tout serviteur repentant.",
                            "verse 50:9": "Et Nous avons fait descendre du ciel une eau bénie, avec laquelle Nous avons fait pousser des jardins et le grain qu’on moissonne,",
                            "verse 50:10": "ainsi que les hauts palmiers aux régimes superposés,",
                            "verse 50:11": "comme subsistance pour les serviteurs. Et par elle (l’eau) Nous avons redonné la vie à une contrée morte. Ainsi se fera la résurrection.",
                            "verse 50:12": "Avant eux, le peuple de Noé, les gens d’Ar-Rass et les Tamud crièrent au mensonge,",
                            "verse 50:13": "de même que les Aad et Pharaon et les frères de Lot,",
                            "verse 50:14": "et les gens d’Al-Aïka et le peuple de Tubbaa. Tous traitèrent les Messagers de menteurs. C’est ainsi que Ma menace se justifia.",
                            "verse 50:15": "Quoi ? Avons-Nous été fatigué par la première création ? Mais ils sont dans la confusion [au sujet] d’une création nouvelle.",
                            "verse 50:16": "Nous avons effectivement créé l’homme et Nous savons ce que son âme lui suggère et Nous sommes plus près de lui que sa veine jugulaire",
                            "verse 50:17": "quand les deux recueillants, assis à droite et à gauche, recueillent .",
                            "verse 50:18": "Il ne prononce pas une parole sans avoir auprès de lui un observateur prêt à l’inscrire.",
                            "verse 50:19": "L’agonie de la mort fait apparaître la vérité : «Voilà ce dont tu t’écartais».",
                            "verse 50:20": "Et l’on soufflera dans la Trompe : Voilà le jour de la Menace.",
                            "verse 50:21": "Alors chaque âme viendra accompagnée d’un conducteur et d’un témoin.",
                            "verse 50:22": "«Tu restais indifférent à cela. Et bien, Nous ôtons ton voile; ta vue est perçante aujourd’hui.",
                            "verse 50:23": "Et son compagnon dira : «Voilà ce qui est avec moi, tout prêt». .",
                            "verse 50:24": "«Vous deux, jetez dans l’Enfer tout mécréant endurci et rebelle ,",
                            "verse 50:25": "acharné à empêcher le bien, transgresseur, douteur,",
                            "verse 50:26": "celui qui plaçait à côté de Dieu une autre divinité. Jetez-le donc dans le dur châtiment».",
                            "verse 50:27": "Son camarade (le Diable) dira : «Seigneur, ce n’est pas moi qui l’ai fait transgresser; mais il était déjà dans un profond égarement».",
                            "verse 50:28": "Alors [Dieu] dira : «Ne vous disputez pas devant moi ! Alors que Je vous ai déjà fait part de la menace.",
                            "verse 50:29": "Chez moi, la parole ne change pas; et Je n’opprime nullement les serviteurs».",
                            "verse 50:30": "Le jour où Nous dirons à l’Enfer; «Es-tu rempli ? » Il dira : «Y en a-t-il encore» ?",
                            "verse 50:31": "Le Paradis sera rapproché à proximité des pieux.",
                            "verse 50:32": "«Voilà ce qui vous a été promis, [ainsi qu’] à tout homme plein de repentir et respectueux [des prescriptions divines]",
                            "verse 50:33": "qui redoute le Tout Miséricordieux bien qu’il ne Le voit pas , et qui vient [vers Lui] avec un coeur porté à l’obéissance.",
                            "verse 50:34": "Entrez-y en toute sécurité». Voilà le jour de l’éternité !",
                            "verse 50:35": "Il y aura là pour eux tout ce qu’ils voudront. Et auprès de Nous il y a davantage encore.",
                            "verse 50:36": "combien avons-Nous fait périr, avant eux, de générations bien plus fortes qu’eux. Ils avaient parcouru les contrées, cherchant [vainement] où fuir.",
                            "verse 50:37": "Il y a bien là un rappel pour quiconque a un coeur, prête l’oreille tout en étant témoin.",
                            "verse 50:38": "En effet, Nous avons créé les cieux et la terre et ce qui existe entre eux en six jours, sans éprouver la moindre lassitude.",
                            "verse 50:39": "Endure donc ce qu’ils disent : et célèbre la louange de ton Seigneur avant le lever du soleil et avant [son] coucher;",
                            "verse 50:40": "et célèbre Sa gloire, une partie de la nuit et à la suite des prosternations .",
                            "verse 50:41": "Et sois à l’écoute, le jour où le Crieur criera d’un endroit proche,",
                            "verse 50:42": "le jour où ils entendront en toute vérité le Cri. Voilà le Jour de la Résurrection.",
                            "verse 50:43": "C’est Nous qui donnons la vie et donnons la mort, et vers Nous sera la destination,",
                            "verse 50:44": "le jour où la terre se fendra, les [rejetant] précipitamment. ce sera un rassemblement facile pour Nous.",
                            "verse 50:45": "Nous savons mieux ce qu’ils disent. Tu n’as pas pour mission d’exercer sur eux une contrainte. Rappelle donc, par le Coran celui qui craint Ma menace."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Qáf. Beim hocherhabenen Koran!",
                            "verse 50:2": "Aber sie staunen, daß zu ihnen ein Warner gekommen ist aus ihrer Mitte. Und die Ungläubigen sprechen: «Das ist eine wunderliche Sache.",
                            "verse 50:3": "Wie! wenn wir tot sind und zu Staub geworden (sollen wir wieder zum Leben erweckt werden)? Das ist eine Wiederkehr von weither.»",
                            "verse 50:4": "Wir wissen wohl, was die Erde von ihnen verzehrt, und bei Uns ist ein Buch, das alles aufbewahrt.",
                            "verse 50:5": "Nein, sie verwarfen die Wahrheit, als sie zu ihnen kam, und nun sind sie in einem Zustand der Verwirrung.",
                            "verse 50:6": "Haben sie nicht zum Himmel über ihnen emporgeschaut, wie Wir ihn erbaut und geschmückt und wie makellos er ist?",
                            "verse 50:7": "Und die Erde - Wir haben sie ausgebreitet und feste Berge darauf gesetzt; und Wir ließen auf ihr von jeglicher schönen Art Paare hervorsprießen,",
                            "verse 50:8": "Zur Aufklärung und Ermahnung für jeden Diener, der sich bekehrt.",
                            "verse 50:9": "Und vom Himmel senden Wir Wasser hernieder, das voll des Segens ist, und bringen damit Gärten hervor und Korn - Ernten zum Einheimsen -",
                            "verse 50:10": "Und schlanke Palmen mit übereinander stehenden Fruchtknöpfen",
                            "verse 50:11": "Als eine Versorgung für die Diener; und Wir beleben damit ein totes Land. Also wird die Auferstehung sein.",
                            "verse 50:12": "Schon vor ihnen leugneten das Volk Noahs und das Volk des Brunnens und die Thamüd,",
                            "verse 50:13": "Und die Àd, und Pharao und die Brüder des Lot,",
                            "verse 50:14": "Und die Waldbewohner und das Volk von Tubba. Alle diese verwarfen die Gesandten. Darum ward Meine Drohung wirksam.",
                            "verse 50:15": "Sind Wir denn durch die erste Schöpfung ermüdet? Nein, aber sie sind in Unklarheit über die neue Schöpfung.",
                            "verse 50:16": "Wahrlich, Wir erschufen den Menschen, und Wir wissen alles, was sein Fleisch ihm zuflüstert; denn Wir sind ihm näher als die Halsader.",
                            "verse 50:17": "Wenn die zwei aufnehmenden (Engel) niederschreiben, zur Rechten sitzend und zur Linken,",
                            "verse 50:18": "Kein Wort bringt er hervor, ohne daß neben ihm ein Wächter wäre, stets bereit (es aufzuzeichnen).",
                            "verse 50:19": "Und die Trunkenheit des Todes wird sicherlich kommen: «Das ist's, dem du zu entrinnen suchtest.»",
                            "verse 50:20": "Und es wird in die Posaune gestoßen werden: «Dies ist der Tag der Drohung.»",
                            "verse 50:21": "Und jede Seele wird kommen, mit ihr wird ein Treiber sein und ein Zeuge.",
                            "verse 50:22": "«Du warst dessen achtlos; nun haben Wir deinen Schleier von dir genommen, und scharf ist dein Blick heute.»",
                            "verse 50:23": "Und sein Gefährte wird sprechen: «Hier, was ich (von dem Verzeichnis) bereit habe.»",
                            "verse 50:24": "«Werfet, ihr beide, in die Hölle einen jeden undankbaren Feind (der Wahrheit),",
                            "verse 50:25": "Den Behindrer des Guten, den Übertreter, den Zweifler,",
                            "verse 50:26": "Der einen andern Gott setzte neben Allah. Werfet denn, ihr beide, ihn in die schreckliche Pein!»",
                            "verse 50:27": "Sein Gefährte wird sprechen: «O unser Herr, ich verführte ihn nicht zur Empörung, sondern er selbst ging zu weit in die Irre.»",
                            "verse 50:28": "Er wird sprechen: «Streitet nicht vor Mir, wo Ich euch die Warnung im voraus gesandt hatte.",
                            "verse 50:29": "Das Wort wird bei Mir nicht abgeändert, und Ich bin in nichts ungerecht gegen die Diener.»",
                            "verse 50:30": "An jenem Tage werden Wir zur Hölle sprechen: «Bist du angefüllt?», und sie wird antworten: «Gibt es noch mehr?»",
                            "verse 50:31": "Und das Paradies wird den Gerechten nahe gebracht werden, nicht länger fern.",
                            "verse 50:32": "«Das ist's, was euch verheißen ward - für jeden, der stets (Gott) zugewandt und wachsam war,",
                            "verse 50:33": "Der den Gnadenreichen fürchtete im geheimen und mit reuigem Herzen (zu Ihm) kam.",
                            "verse 50:34": "Gehet darin ein in Frieden. Dies ist der Tag der Ewigkeit.»",
                            "verse 50:35": "Sie werden darin haben, was immer sie begehren, und bei Uns ist noch weit mehr.",
                            "verse 50:36": "Doch wie so manche Völker haben Wir schon vor ihnen vertilgt, die stärker waren als sie an Macht! (Als die Strafe kam) suchten sie rings in den Landen. War da ein Zufluchtsort?",
                            "verse 50:37": "Hierin ist wahrlich eine Ermahnung für den, der ein Herz hat oder der Gehör gibt und aufmerksam ist.",
                            "verse 50:38": "Wahrlich, Wir erschufen die Himmel und die Erde und das, was zwischen beiden ist, in sechs Zeiten, und keine Ermüdung rührte Uns an.",
                            "verse 50:39": "Ertrage drum in Geduld, was sie sprechen, und verherrliche deinen Herrn mit Seiner Lobpreisung vor Aufgang der Sonne und vor dem Untergang;",
                            "verse 50:40": "Auch in einem Teile der Nacht lobpreise Ihn, und nach jedem Gebet.",
                            "verse 50:41": "Und höre zu! der Tag, wenn der Rufer rufen wird von naher Stätte,",
                            "verse 50:42": "Der Tag, wenn sie in Wahrheit den Posaunenstoß hören werden, das wird der Tag des Hervorkommens (aus den Gräbern) sein.",
                            "verse 50:43": "Wahrlich, Wir Selbst geben Leben und Tod, und zu Uns ist die Heimkehr.",
                            "verse 50:44": "An dem Tage, wenn sich die Erde ihretwegen spalten wird (und sie hervorgehen werden) in Hast - das wird ein Versammeln sein. ganz leicht für Uns.",
                            "verse 50:45": "Wir wissen am besten, was sie sprechen; und du bist nicht (berufen), sie irgend zu zwingen. Ermahne drum durch den Koran den, der Meine Drohung fürchtet."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "d+kQ+ d+qjku ethn dh d+le ¼eksgEen iSx+Ecj gSa½",
                            "verse 50:2": "ysfdu bu ¼dkfQjksa½ dks rkTtqc gS fd mu gh esa ,d ¼vt+kc ls½ Mjkus okyk ¼iSx+Ecj½ muds ikl vk x;k rks dq¶+Q+kj dgus yxs ;s rks ,d vthc ckr gS",
                            "verse 50:3": "Hkyk tc ge ej tk,¡xs vkSj ¼lM+ xy dj½ feVVh gks tk,¡xs rks fQj ;s nksckj ft+Unk gksuk ¼vD+y ls½ cbZn ¼ckr gS½",
                            "verse 50:4": "muds ftLeksa ls t+ehu ftl pht+ dks ¼[kk [kk dj½ de djrh gS og gedks ekywe gS vkSj gekjs ikl rks rgjhjh ;knnk’r fdrkc ykSgs egQwt+ ekStwn gS",
                            "verse 50:5": "exj tc muds ikl nhu ¼gd+½ vk igq¡pk rks mUgksus mls >qByk;k rks og yksx ,d ,slh ckr esa my>s gq, gSa ftls d+jkj ugha",
                            "verse 50:6": "rks D;k bu yksxksa us vius Åij vkleku dh ut+j ugha dh fd geus mldks D;ksa dj cuk;k vkSj mldks dSlh t+hur nh vkSj muls dgha f’kxk¶+r rd ugha",
                            "verse 50:7": "vkSj t+ehu dks geus QSyk;k vkSj ml ij cks>y igkM+ j[k fn;s vkSj blesa gj rjg dh [+kq’kuqek pht+sa mxkbZ rkfd reke :tw ykus okys",
                            "verse 50:8": "¼cUns½ fgnk;r vkSj bcjr gkfly djsa",
                            "verse 50:9": "vkSj geus vkleku ls cjdr okyk ikuh cjlk;k rks mlls ckx+ ¼ds nj[+r½ mxk, vkSj [ksrh dk vukt vkSj yEch yEch [ktwjsa",
                            "verse 50:10": "ftldk ckSj ckge xqFkk gqvk gS",
                            "verse 50:11": "¼;s lc dqN½ cUnksa dh jkst+h nsus ds fy, ¼iSnk fd;k½ vkSj ikuh gh ls geus eqnkZ Ógj ¼mQ+rknk t+ehu½ dks ft+Unk fd;k",
                            "verse 50:12": "blh rjg ¼d+;ker esa eqnksZa dks½ fudyuk gksxk muls igys uwg dh d+kSe vkSj [+kUnd+ okyksa vkSj ¼d+kSe½ lewn us vius vius iSx+Ecjksa dks >qByk;k",
                            "verse 50:13": "vkSj ¼d+kSe½ vkn vkSj fQjvkÅu vkSj ywr dh d+kSe",
                            "verse 50:14": "vkSj cu ds jgus okyksa ¼d+kSe Óq,sc½ vkSj rqCck dh d+kSe vkSj ¼mu½ lcus vius ¼vius½ iSx+Ecjksa dks >qByk;k rks gekjk ¼vt+kc dk½ ok;nk iwjk gks dj jgk",
                            "verse 50:15": "rks D;k ge igyh ckj iSnk djds Fkd x;s gSa ¼gjfxt+ ugha½ exj ;s yksx vt+ ljs ukS ¼nksckjk½ iSnk djus dh fuLcr Ód esa iM+s gSa",
                            "verse 50:16": "vkSj cs’kd ge gh us bUlku dks iSnk fd;k vkSj tks [+;kykr mlds fny esa xqt+jrs gSa ge mudks tkurs gSa vkSj ge rks mldh Ógjx ls Hkh T+;knk d+jhc gSa",
                            "verse 50:17": "tc ¼og dksbZ dke djrk gSa rks½ nks fy[kus okys ¼dsjkeu d+krschu½ tks mlds nkfgus ck,a cSBs gSa fy[k ysrs gSa",
                            "verse 50:18": "dksbZ ckr mldh t+cku ij ugha vkrh exj ,d fuxsgcku mlds ikl rS;kj jgrk gS",
                            "verse 50:19": "ekSr dh csgks’kh ;d+huu rkjh gksxh ¼tks ge crk nsaxs fd½ ;gh rks og ¼gkykr gS½ ftlls rw Hkkxk djrk Fkk",
                            "verse 50:20": "vkSj lwj Qw¡dk tk,xk ;gh ¼vt+kc½ ds ok;ns dk fnu gS vkSj gj Ó[+l ¼gekjs lkeus½ ¼bl rjg½ gkft+j gksxk",
                            "verse 50:21": "fd mlds lkFk ,d ¼Qfj’rk½ gWdk ykus okyk gksxk",
                            "verse 50:22": "vkSj ,d ¼vkeky dk½ xokg mlls dgk tk,xk fd ml ¼fnu½ ls rw x+Q+yr esa iM+k Fkk rks vc geus rsjs lkeus ls insZ dks gVk fn;k rks vkt rsjh fuxkg cM+h rst+ gS",
                            "verse 50:23": "vkSj mldk lkFkh ¼Q+fj’rk½ dgsxk ;s ¼mldk vey½ tks esjs ikl gS",
                            "verse 50:24": "¼rc gqDe gksxk fd½ rqe nksuksa gj ljd’k uk’kqØs dks nkst+[k+ esa Mky nks",
                            "verse 50:25": "tks ¼okftc gqdwd ls½ eky esa cq[+y djus okyk gn ls c<+us okyk ¼nhu esa½ Ód djus okyk Fkk",
                            "verse 50:26": "ftlus [+kqnk ds lkFk nwljs ekcwn cuk j[ks Fks rks vc rqe nksuksa bldks l[+r vt+kc esa Mky gh nks",
                            "verse 50:27": "¼ml oD+r½ mldk lkFkh ¼ÓSrku½ dgsxk ijojfnxkj geus bldks xqejkg ugha fd;k Fkk cfYd ;s rks [+kqn l[+r xqejkgh esa eqfCryk Fkk",
                            "verse 50:28": "bl ij [+kqnk Q+jek,xk gekjs lkeus >xM+s u djks eSa rks rqe yksxksa dks igys gh ¼vt+kc ls½ Mjk pqdk Fkk",
                            "verse 50:29": "esjs ;gk¡ ckr cnyk ugha djrh vkSj u eSa cUnksa ij ¼t+jkZ cjkcj½ t+qYe djus okyk gw¡",
                            "verse 50:30": "ml fnu ge nkst+[k+ ls iwNsaxs fd rw Hkj pqdh vkSj og dgsxh D;k dqN vkSj Hkh gSa",
                            "verse 50:31": "vkSj csfg’r ijgst+xkjksa ds fcydqy djhc dj nh tk,xh",
                            "verse 50:32": ";gh rks og csfg’r gS ftldk rqeesa ls gj ,d ¼[+kqnk dh rjQ+½ :tw djus okys ¼gqnwn dh½ fgQkt+r djus okys ls ok;nk fd;k tkrk gS",
                            "verse 50:33": "rks tks Ó[+l [+kqnk ls cs ns[ks Mjrk jgk vkSj [+kqnk dh rjQ+ :tw djus okyk fny ysdj vk;k",
                            "verse 50:34": "¼mldks gqDe gksxk fd½ blesa lgh lyker nkf[+ky gks tkvks ;gha rks ges’kk jgus dk fnu gS",
                            "verse 50:35": "blesa ;s yksx tks pkgsaxs muds fy, gkft+j gS vkSj gekjs ;gkW rks blls Hkh T+;knk gS",
                            "verse 50:36": "vkSj geus rks buls igys fdruh mEersa gykd dj Mkyh tks buls d+wor esa dgha c<+ dj Fkha rks mu yksxksa us ¼ekSr ds [+kkSQ ls½ reke Ógjksa dks Nku ekjk fd Hkyk dgha Hkh Hkkxus dk fBdkuk gS",
                            "verse 50:37": "blesa Ód ugha fd tks Ó[+l ¼vkxkg½ fny j[krk gS ;k dku yxkdj gqt+wjs d+Yc ls lqurk gS mlds fy, blesa ¼dkQ+h½ ulhgr gS",
                            "verse 50:38": "vkSj geus gh ;d+huu lkjs vkleku vkSj t+ehu vkSj tks dqN mu nksuksa ds chp esa gS Ng% fnu esa iSnk fd, vkSj Fkdku rks gedks Nqdj Hkh ugha x;h",
                            "verse 50:39": "rks ¼,s jlwy½ tks dqN ;s ¼dkfQ+j½ yksx fd;k djrs gSa ml ij rqe lcz djks vkSj vkQ+rkc ds fudyus ls igys vius ijojfnxkj ds gEn dh rLchg fd;k djks",
                            "verse 50:40": "vkSj FkksM+h nsj jkr dks Hkh vkSj uekt+ ds ckn Hkh mldh rLchg djks",
                            "verse 50:41": "vkSj dku yxk dj lqu j[kks fd ftl fnu iqdkjus okyk ¼bljkQ+hy½ ut+nhd gh txg ls vkokt+ nsxk",
                            "verse 50:42": "¼fd mBks½ ftl fnu yksx ,d l[+r ph[+k dks ck[+kwch lqu ysxsa ogh fnu ¼yksxksas½ ds dczksa ls fudyus dk gksxk",
                            "verse 50:43": "cs’kd ge gh ¼yksxksa dks½ ft+Unk djrs gSa vkSj ge gh ekjrs gSa",
                            "verse 50:44": "vkSj gekjh gh rjQ fQj dj vkuk gS ftl fnu t+ehu ¼muds Åij ls½ QV tk,xh vkSj ;s >V iV fudy [kM+s gksaxs ;s mBkuk vkSj tek djuk",
                            "verse 50:45": "vkSj ge ij cgqr vklku gS ¼,s jlwy½ ;s yksx tks dqN dgrs gSa ge ¼mls½ [+kwc tkurs gSa vkSj rqe mu ij tcz rks nsrs ugha gks rks tks gekjs ¼vt+kc ds½ ok;ns ls Mjs mldks rqe d+qjku ds t+fj, ulhgr djrs jgks"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Qaaf Demi Al Qur’an yang sangat mulia.",
                            "verse 50:2": "(Mereka tidak menerimanya) bahkan mereka tercengang karena telah datang kepada mereka seorang pemberi peringatan dari (kalangan) mereka sendiri, maka berkatalah orang-orang kafir: \"Ini adalah suatu yang amat ajaib\".",
                            "verse 50:3": "Apakah kami setelah mati dan setelah menjadi tanah (kami akan kembali lagi)?, itu adalah suatu pengembalian yang tidak mungkin.",
                            "verse 50:4": "Sesungguhnya Kami telah mengetahui apa yang dihancurkan oleh bumi dari (tubuh-tubuh) mereka, dan pada sisi Kamipun ada kitab yang memelihara (mencatat).",
                            "verse 50:5": "Sebenarnya, mereka telah mendustakan kebenaran tatkala kebenaran itu datang kepada mereka, maka mereka berada dalam keadaan kacau balau.",
                            "verse 50:6": "Maka apakah mereka tidak melihat akan langit yang ada di atas mereka, bagaimana Kami meninggikannya dan menghiasinya dan langit itu tidak mempunyai retak-retak sedikit pun?",
                            "verse 50:7": "Dan Kami hamparkan bumi itu dan Kami letakkan padanya gunung-gunung yang kokoh dan Kami tumbuhkan padanya segala macam tanaman yang indah dipandang mata,",
                            "verse 50:8": "untuk menjadi pelajaran dan peringatan bagi tiap-tiap hamba yang kembali (mengingat Allah).",
                            "verse 50:9": "Dan Kami turunkan dari langit air yang banyak manfa’atnya lalu Kami tumbuhkan dengan air itu pohon-pohon dan biji-biji tanaman yang diketam,",
                            "verse 50:10": "dan pohon kurma yang tinggi-tinggi yang mempunyai mayang yang bersusun-susun,",
                            "verse 50:11": "untuk menjadi rezki bagi hamba-hamba (Kami), dan Kami hidupkan dengan air itu tanah yang mati (kering). Seperti itulah terjadinya kebangkitan.",
                            "verse 50:12": "Sebelum mereka telah mendustakan (pula) kaum Nuh dan penduduk Rass dan Tsamud,",
                            "verse 50:13": "dan kaum ’Aad, kaum Fir’aun dan kaum Luth,",
                            "verse 50:14": "dan penduduk Aikah serta kaum Tubba’, semuanya telah mendustakan rasul-rasul maka sudah semestinyalah mereka mendapat hukuman yang sudah diancamkan.",
                            "verse 50:15": "Maka apakah Kami letih dengan penciptaan yang pertama? Sebenarnya mereka dalam keadaan ragu-ragu tentang penciptaan yang baru.",
                            "verse 50:16": "Dan sesungguhnya Kami telah menciptakan manusia dan mengetahui apa yang dibisikkan oleh hatinya, dan Kami lebih dekat kepadanya daripada urat lehernya,",
                            "verse 50:17": "(yaitu) ketika dua orang malaikat mencatat amal perbuatannya, seorang duduk di sebelah kanan dan yang lain duduk di sebelah kiri.",
                            "verse 50:18": "Tiada suatu ucapanpun yang diucapkannya melainkan ada di dekatnya malaikat pengawas yang selalu hadir.",
                            "verse 50:19": "Dan datanglah sakaratulmaut dengan sebenar-benarnya. Itulah yang kamu selalu lari daripadanya.",
                            "verse 50:20": "Dan ditiuplah sangkakala. Itulah hari terlaksananya ancaman.",
                            "verse 50:21": "Dan datanglah tiap-tiap diri, bersama dengan dia seorang malaikat penggiring dan seorang malaikat penyaksi.",
                            "verse 50:22": "Sesungguhnya kamu berada dalam keadaan lalai dari (hal) ini, maka Kami singkapkan dari padamu tutup (yang menutupi) matamu, maka penglihatanmu pada hari itu amat tajam.",
                            "verse 50:23": "Dan yang menyertai dia berkata: \"Inilah (catatan amalnya) yang tersedia pada sisiku\".",
                            "verse 50:24": "Allah berfirman: \"Lemparkanlah olehmu berdua ke dalam neraka semua orang yang sangat ingkar dan keras kepala,",
                            "verse 50:25": "yang sangat enggan melakukan kebajikan, melanggar batas lagi ragu-ragu,",
                            "verse 50:26": "yang menyembah sembahan yang lain beserta Allah, maka lemparkanlah dia ke dalam siksaan yang sangat\".",
                            "verse 50:27": "Yang menyertai dia berkata (pula): \"Ya Tuhan kami, aku tidak menyesatkannya tetapi dialah yang berada dalam kesesatan yang jauh\".",
                            "verse 50:28": "Allah berfirman: \"Janganlah kamu bertengkar di hadapan-Ku, padahal sesungguhnya Aku dahulu telah memberikan ancaman kepadamu\".",
                            "verse 50:29": "Keputusan di sisi-Ku tidak dapat diubah dan Aku sekali-kali tidak menganiaya hamba-hamba-Ku.",
                            "verse 50:30": "(Dan ingatlah akan) hari (yang pada hari itu) Kami bertanya kepada Jahannam: \"Apakah kamu sudah penuh?\" Dia menjawab: \"Masih adakah tambahan?\"",
                            "verse 50:31": "Dan didekatkanlah surga itu kepada orang-orang yang bertakwa pada tempat yang tiada jauh (dari mereka).",
                            "verse 50:32": "Inilah yang dijanjikan kepadamu, (yaitu) kepada setiap hamba yang selalu kembali (kepada Allah) lagi memelihara (semua peraturan-peraturan-Nya).",
                            "verse 50:33": "(Yaitu) orang yang takut kepada Tuhan Yang Maha Pemurah sedang Dia tidak kelihatan (olehnya) dan dia datang dengan hati yang bertobat,",
                            "verse 50:34": "masukilah surga itu dengan aman, itulah hari kekekalan.",
                            "verse 50:35": "Mereka di dalamnya memperoleh apa yang mereka kehendaki; dan pada sisi Kami ada tambahannya.",
                            "verse 50:36": "Dan berapa banyaknya umat-umat yang telah Kami binasakan sebelum mereka yang mereka itu lebih besar kekuatannya daripada mereka ini, maka mereka (yang telah dibinasakan itu) telah pernah menjelajah di beberapa negeri. Adakah (mereka) mendapat tempat lari (dari kebinasaan)?",
                            "verse 50:37": "Sesungguhnya pada yang demikian itu benar-benar terdapat peringatan bagi orang-orang yang mempunyai hati atau yang menggunakan pendengarannya, sedang dia menyaksikannya.",
                            "verse 50:38": "Dan sesungguhnya telah Kami ciptakan langit dan bumi dan apa yang ada antara keduanya dalam enam masa, dan Kami sedikit pun tidak ditimpa keletihan.",
                            "verse 50:39": "Maka bersabarlah kamu terhadap apa yang mereka katakan dan bertasbihlah sambil memuji Tuhanmu sebelum terbit matahari dan sebelum terbenam (nya).",
                            "verse 50:40": "Dan bertasbihlah kamu kepada-Nya di malam hari dan setiap selesai sembahyang.",
                            "verse 50:41": "Dan dengarkanlah (seruan) pada hari penyeru (malaikat) menyeru dari tempat yang dekat.",
                            "verse 50:42": "(Yaitu) pada hari mereka mendengar teriakan dengan sebenar-benarnya, itulah hari keluar (dari kubur).",
                            "verse 50:43": "Sesungguhnya Kami menghidupkan dan mematikan dan hanya kepada Kami-lah tempat kembali (semua makhluk).",
                            "verse 50:44": "(Yaitu) pada hari bumi terbelah-belah menampakkan mereka (lalu mereka keluar) dengan cepat. Yang demikian itu adalah pengumpulan yang mudah bagi Kami.",
                            "verse 50:45": "Kami lebih mengetahui tentang apa yang mereka katakan, dan kamu sekali-kali bukanlah seorang pemaksa terhadap mereka. Maka beri peringatanlah dengan Al Qur’an orang yang takut kepada ancaman-Ku."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Qâf . Per il glorioso Corano!",
                            "verse 50:2": "E invece si stupiscono che sia giunto loro un ammonitore della loro gente. Dicono i miscredenti: «Questa è una cosa strana!",
                            "verse 50:3": "Ma come, quando saremo morti e ridotti in polvere... ? Sarebbe tornare da lontano! ».",
                            "verse 50:4": "Ben sappiamo quel che la terra divorerà , presso di Noi c'è un Libro che conserva [ogni cosa].",
                            "verse 50:5": "E invece tacciano di menzogna la verità che è giunta loro, ed ecco che sono in grande confusione.",
                            "verse 50:6": "Non osservano il cielo sopra di loro, come lo abbiamo edificato e abbellito e senza fenditura alcuna?",
                            "verse 50:7": "E la terra l'abbiamo distesa, vi infiggemmo le montagne e vi facemmo crescere ogni specie di meravigliosa vegetazione:",
                            "verse 50:8": "invito [questo] alla riflessione e monito per ogni servo penitente.",
                            "verse 50:9": "Abbiamo fatto scendere dal cielo un'acqua benedetta, per mezzo della quale abbiamo fatto germogliare giardini e il grano delle messi,",
                            "verse 50:10": "e palme slanciate dalle spate sovrapposte,",
                            "verse 50:11": "sostentamento dei [Nostri] servi. Per suo tramite rivivifichiamo una terra che era morta, e in egual maniera [avverrà] la Resurrezione.",
                            "verse 50:12": "Prima di loro tacciarono di menzogna [i Nostri segni] il popolo di Noè e quelli di ar - Rass , i Thamûd",
                            "verse 50:13": "e gli 'Âd e Faraone e i fratelli di Lot",
                            "verse 50:14": "e le genti di al-'Aykah e il popolo di Tubba' : tutti quanti accusarono di menzogna i messaggeri. La Mia minaccia dunque si realizzò.",
                            "verse 50:15": "Saremmo forse spossati dalla prima creazione? No, sono invece loro ad essere confusi [a proposito] della nuova creazione .",
                            "verse 50:16": "In verità siamo stati Noi ad aver creato l'uomo e conosciamo ciò che gli sussurra l'animo suo. Noi siamo a lui più vicini della sua vena giugulare .",
                            "verse 50:17": "Quando i due che registrano seduti alla sua destra e alla sua sinistra, raccoglieranno [il suo dire],",
                            "verse 50:18": "[l'uomo] non pronuncerà nessuna parola senza che presso di lui ci sia un osservatore solerte.",
                            "verse 50:19": "L'agonia della morte farà apparire la verità: ecco da cosa fuggivi.",
                            "verse 50:20": "Sarà soffiato nel corno. Ecco il Giorno della minaccia!",
                            "verse 50:21": "Ogni anima verrà accompagnata da una guida e da un testimone .",
                            "verse 50:22": "[Uno dirà]: « Davvero trascuravi tutto ciò: [ora] abbiamo sollevato il tuo velo e quindi oggi la tua vista è acuta ».",
                            "verse 50:23": "E dirà il suo compagno : « Ecco quello che ho pronto».",
                            "verse 50:24": "« O voi due, gettate nell'Inferno ogni miscredente testardo,",
                            "verse 50:25": "nemico del bene, trasgressore e scettico,",
                            "verse 50:26": "che pose, a fianco di Allah, un'altra divinità: gettatelo nell'orrendo castigo».",
                            "verse 50:27": "Dirà il suo compagno : « Signore, non sono stato io ad incitarlo alla ribellione, già era profondamente traviato».",
                            "verse 50:28": "Dirà [Allah]: « Non polemizzate al Mio cospetto: già vi resi nota la minaccia.",
                            "verse 50:29": "Di fronte a Me la sentenza non cambia, né sono ingiusto verso i Miei servi ».",
                            "verse 50:30": "Il Giorno in cui diremo all'Inferno: « Sei pieno?» esso risponderà: «C'è altro [da aggiungere]?».",
                            "verse 50:31": "Il Giardino sarà avvicinato ai timorati,",
                            "verse 50:32": "«Ecco quel che vi è stato promesso, a [voi e a] chi è pentito, a chi si preserva [dal peccato],",
                            "verse 50:33": "a chi teme il Compassionevole nell'invisibile e ritorna [a Lui] con cuore contrito.",
                            "verse 50:34": "Entratevi in pace». Questo è il Giorno della perpetuità;",
                            "verse 50:35": "colà avranno tutto quel che vorranno e presso di Noi c'è ancora di più .",
                            "verse 50:36": "Quante generazioni sterminammo prima di loro, che pure erano più potenti di loro e che inutilmente cercarono, percorrendo le contrade, di sfuggire [al castigo]!",
                            "verse 50:37": "In ciò vi è un monito per chi ha un cuore, per chi presta attenzione e testimonia.",
                            "verse 50:38": "Già creammo i cieli, la terra e quel che vi è frammezzo in sei giorni, senza che Ci cogliesse fatica alcuna.",
                            "verse 50:39": "Sopporta dunque con pazienza quel che ti dicono e glorifica il tuo Signore prima che si levi il sole e prima che tramonti ;",
                            "verse 50:40": "glorificaLo in una parte della notte e dopo la prosternazione.",
                            "verse 50:41": "Ascolta: il Giorno in cui l'Araldo chiamerà da un luogo vicino,",
                            "verse 50:42": "il Giorno in cui davvero sentiranno il Grido, quello sarà il Giorno della Resurrezione.",
                            "verse 50:43": "Siamo Noi che diamo la vita e che diamo la morte. A Noi ritorna ogni cosa.",
                            "verse 50:44": "Il Giorno in cui la terra si spaccherà all'improvviso , Ci sarà facile radunarli.",
                            "verse 50:45": "Ben conosciamo quello che dicono: tu non sei tiranno nei loro confronti ! Ammonisci dunque con il Corano chi non teme la Mia minaccia."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "カーフ。栄光に満ちたクルアーンによって誓う。",
                            "verse 50:2": "いや，かれらは自分たちの間から一人の警告者が現われたことに驚き，そこで不信心な者たちは言う。「これは全く不思議なことである。",
                            "verse 50:3": "わたしたちが死んで塵になって（また甦るの）か。それは（理解出来ない）とんでもない甦りである。」",
                            "verse 50:4": "われは大地が，かれらを如何に蝕み去るかを知っている。またわが手許には，（凡ゆる始終の）記録の帳簿がある。",
                            "verse 50:5": "真理が訪れた時，それを虚偽としたので，かれらは混乱状態に陥った。",
                            "verse 50:6": "かれらは頭上の天を見ないのか。われが如何にそれを創造し，如何にそれを飾ったか。そしてそれには，少しの傷もないと言うのに。",
                            "verse 50:7": "また，われは大地をうち広げ，その上に山々を据え，様々の種類の美しい（草木）を，生い茂らせる。",
                            "verse 50:8": "（それらは）悔悟して（主の御許に）返る凡てのしもべが，よく観察すべきことであり，教訓である。",
                            "verse 50:9": "われはまた，祝福する雨を天から降らせて，果樹園や収穫の穀物を豊かに生長させる。",
                            "verse 50:10": "びっしりと実を付けた丈の高いナツメヤシの木は，",
                            "verse 50:11": "（アッラーの）しもべたちの食料。またそれ（雨）でわれは死んだ大地を甦らせる。呼出し（復活）にしても同じようなこと。",
                            "verse 50:12": "かれら以前も，（使徒を）嘘付き呼ばわりした者があった。ヌーフの民も，ラッスの仲間もサムードも，",
                            "verse 50:13": "またアードの民も，フィルアウンも，ルートの同胞も，",
                            "verse 50:14": "また森の仲間またトッバウの民も皆使徒を嘘付き呼ばわりした。だから（われの）警告は確実に実現されてしまった。",
                            "verse 50:15": "最初の創造のために，われが疲れたというのか。いや，かれらは新しい創造に就いて疑いを抱いている。",
                            "verse 50:16": "本当にわれは人間を創った。そしてその魂が囁くことも知っている。われは（人間の）脛動脈よりも人間に近いのである。",
                            "verse 50:17": "見よ，右側にまた左側に坐って，2人の（守護の天使の）監視者が監視する。",
                            "verse 50:18": "かれがまだ一言も言わないのに，かれの傍の看守は（記録の）準備を整えている。",
                            "verse 50:19": "そして実際に死の昏睡が訪れる。これはあなたが避けてきたもの。",
                            "verse 50:20": "そしてラッパが吹かれる。これはあの約束された日である。",
                            "verse 50:21": "そして各々の魂は，追手と証言者に伴われて来る。そして各々の魂は，（羊の群を追い立てるように）追手（の天使）一人と（現世の諸行を証言するための）証言（の天使）一人に伴われてやって来る。",
                            "verse 50:22": "（その時，言われよう。）「あなたは，この（審判の日）に就いて実際注意しなかった。われは今，あなたから覆を取り除く。今日は，あなたの視覚は鋭敏である。」",
                            "verse 50:23": "かれの同伴の仲間は言う。「これが，わたしの準備したものです。」",
                            "verse 50:24": "（その時主は仰せられよう。）「あなたがた両名，反逆した頑迷な者を凡て，地獄に投げ込め。",
                            "verse 50:25": "正しい道を妨げた者，� を破った者，（真理に）疑いを抱いた者，",
                            "verse 50:26": "アッラーと同位に外の神を立てた者，あなたがた両名は，これらを厳しい懲罰の中に投げ込め。」",
                            "verse 50:27": "かれの仲間は言う。「主よ，わたしがかれを背かせたのではありません。かれが（自ら）遠く迷い込んでしまったのです。」",
                            "verse 50:28": "かれは仰せられよう。「われの前で議論してはならない。われは即にあなたがたに警告したのである。",
                            "verse 50:29": "われは言ったことを変えることはない。またわれのしもべたちに対し，決して不正ではないのである。」",
                            "verse 50:30": "その日われが地獄に，「満員になったか。」と問うと，「なお多くの（入る）者がおりますか。」と答える。",
                            "verse 50:31": "主を畏れる者には，楽園が近づいてくる。直ぐ近くに。",
                            "verse 50:32": "これは悔悟して常に（アッラーに）帰り（主の� を）守る凡ての者のために約束されていたものであり，",
                            "verse 50:33": "目に見えない慈悲深き御方を畏れ，心の底から悔悟して（主に）帰った者たちのため（のものである）。",
                            "verse 50:34": "「安んじてそれに入れ。これは永遠の日である。」",
                            "verse 50:35": "かれらのためにはそこに，欲しいものは何でもあり，またわが許からもっと追加があろう。",
                            "verse 50:36": "われはかれら以前に，如何に多くの世代を滅ぼしたことか。かれらは，これら（マッカの多神教徒）よりも力においてもっと勇猛であったではないか。それでかれらは諸都市を巡り歩いたが，何処に避難所があろうか。",
                            "verse 50:37": "本当にこの中には心ある者，また耳を傾ける者，注視する者への教訓がある。",
                            "verse 50:38": "われは天と地，またその間にある凡てのものを6日の間に創造した。しかしわれは少しの疲れも感じることはなかった。",
                            "verse 50:39": "それであなたはかれらの言うことを忍び，主の栄光を誉め讃えなさい。太陽が登る前と沈む前に。",
                            "verse 50:40": "また夜も，かれを讃えて唱念しなさい，また礼拝の終りにも。",
                            "verse 50:41": "耳を傾けなさい。召集者が直ぐ近い所から呼ぶ日に（備えて）。",
                            "verse 50:42": "その日，かれらは真実の一声を聞こう。それは（墓場から）出て行く日である。",
                            "verse 50:43": "本当にわれは生を授け，また死を与える。われに（凡てのものの）帰着所がある。",
                            "verse 50:44": "その日，大地はかれら（の所）から裂け，かれらは急いで出て行く。これこそが召集で，われにとっては容易な業である。",
                            "verse 50:45": "われはかれらの言うことを良く承知している。あなたはかれらに強制してはならない。わが警告を恐れる者たちに，クルアーンによって訓戒しなさい。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "까프 이 영광스런 꾸란으로 맹세하사 그대는 하나님의 선지자라",
                            "verse 50:2": "그러나 그들 가운데서 한 경 고자가 그들에게 나타나니 그들 은 놀라며 이것은 신기한 일이라 고 그들 불신자들은 말하더라",
                            "verse 50:3": "죽어 흙이 된 후 다시 우리가소생한단 말이뇨 그것은 이해될 수 없는 불가능한 것이라",
                            "verse 50:4": "그들중에 얼마나 많은 무리를대지가 앗아갈 것인지 하나님은 알고 있으니 그분에게 보존된 기 록이 있노라",
                            "verse 50:5": "그러나 그들은 진리가 그들 에게 도래하였을 때 그것을 부인 했으니 실로 그들은 혼돈속에 있 노라",
                            "verse 50:6": "그들은 그들위에 하늘을 쳐다보고 하나님이 어떻게 그것을 창 조하고 장식하되 그 안에 한점의 결함이 없게 하였는가를 그들은 숙고하지 아니 하느뇨",
                            "verse 50:7": "대지를 넓게 두사 그 안에 확고한 산들을 두고 그 안에서 아름다운 초목이 자웅으로 성장케 하 심을 숙고하지 아니 하느뇨",
                            "verse 50:8": "이로하여 하나님께 귀의하는 모든 종들로 하여금 지켜보고 찬 미하도록 함이라",
                            "verse 50:9": "하나님은 하늘로부터 축복받 은 비를 내리게 하사 이로 하여 과수원을 가꾸고 곡식을 수확하도 록 함이라",
                            "verse 50:10": "높은 종려나무에 주렁주렁 겹치게 열매를 주시어",
                            "verse 50:11": "하나님의 종들을 위한 양식 으로 하사 죽은 대지에 생명을 주 시었으니 부활도 이와 같노라",
                            "verse 50:12": "그들 이전에도 내세를 부인 한 자 있었으니 노아의 백성과 라 쓰와 사무드와",
                            "verse 50:13": "아드와 파라오와 롯의 형 제들과",
                            "verse 50:14": "숲속의 동료들과 투바의 백성들이었으니 이들 백성들은 선 지자들을 거역하여 하나님의 경고 가 그들에게 수행되었노라",
                            "verse 50:15": "하나님이 최초에 창조할 때 부족함이 있었느뇨 그렇지 아니함 이라 그들이 새로운 창조에 관하 여 혼돈하여 의심하고 있노라",
                            "verse 50:16": "하나님은 인간을 창조하사 인간의 마음속에 속삭이고 있는 것을 알고 있으며 인간의 목에 있 는 혈관보다 내가 더 인간에게 가 까이 있노라",
                            "verse 50:17": "두명이 임명되어 우측과 좌 측에 앉아 인간의 행위를 관찰하 고 있노라",
                            "verse 50:18": "인간이 말할 때마다 함께 있던 천사에 의하여 감시되고 기록 되며",
                            "verse 50:19": "진리에 따라 죽음에 이르니 그것이 바로 너희가 피하려 노력 했던 것이라 말하여지며",
                            "verse 50:20": "나팔이 울리니 그것이 바로 경고받은 경고의 날이라",
                            "verse 50:21": "그때 모든 인간은 그를 인도할 천사와 증언할 천사가 그와 함께 오니",
                            "verse 50:22": "너희가 오늘을 무관심했나니이제 우리가 그 베일을 거두어 주리라 그리하여 오늘을 보리라",
                            "verse 50:23": "그의 동반자가 여기에 준비 된 그의 기록이 저와 함께 있나이다 라고 말하노라",
                            "verse 50:24": "하나님을 거역했던 오만한 모든 자들을 지옥으로 던지라",
                            "verse 50:25": "그들은 선을 실천함에 방해 하고 의심으로 죄악을 낳는 자들 이며",
                            "verse 50:26": "하나님 아닌 다른 신들을 숭배했던 자들이니 참혹한 고통 속 으로 던지라",
                            "verse 50:27": "그의 동반자가 주여 제가 그를 죄악으로 유혹하지 아니했으며그 스스로 크게 방황하였나이다",
                            "verse 50:28": "하나님이 말씀하사 내 앞에 서 서로가 논쟁하지 말라 이미 내가 너희에게 경고했노라",
                            "verse 50:29": "내가 내린 선고는 변경되지 않노라 내가 내 종들에게 부당하 지 않을 것이라",
                            "verse 50:30": "어느날 하나님께서 만원인가라고 지옥에 물으니 아직 더하여 을 자가 있나이까 라고 말하더라",
                            "verse 50:31": "그러나 의로운 자들에게는 친국이 멀지 아니 했으니",
                            "verse 50:32": "이것은 참회하여 하나님께 귀의하고 그분의 율법을 준수하는의로운 자들에게 약속된 것이며",
                            "verse 50:33": "보이지 아니하며 자애로우신하나님을 두려워 하며 그분께 헌 신하는 자들을 위한 것이니",
                            "verse 50:34": "편안히 그리고 안전하게 그 곳에 들어가라 이것이 영생의 날 이라",
                            "verse 50:35": "그곳에는 그들이 원하는 모 든 것이 있으며 하나님 곁에는 더많은 것이 있노라",
                            "verse 50:36": "하나님은 그들 이전 그들 보다 강하였던 세대들을 그들의 죄 악으로 말미암아 얼마나 많이 멸 망케 하였느뇨 그때 그들은 지상 을 방황하였으나 그들이 피할 곳 이 있었더뇨",
                            "verse 50:37": "실로 이 안에는 마음을 가 진자와 귀를 기울인 자와 그리고 진실되게 관찰하는 자를 위한 교 훈이 있노라",
                            "verse 50:38": "하나님은 하늘과 대지와 그 들 사이의 모든 것을 육일간에 창조하심에 조금도 피곤하지 아니했노라",
                            "verse 50:39": "그러므로 그들이 말하는 것 에 그대는 인내하라 그리고 해가 뜨기전에 그리고 해가 지기전에 그대 주님을 찬양하라",
                            "verse 50:40": "밤중에도 그리고 예배를 드 린 후에도 하나님을 찬양하라",
                            "verse 50:41": "그리고 멀지 않는 곳으로 부터 있을 천사의 부름에 귀를 기 울이라",
                            "verse 50:42": "그들이 진리의 소리를 듣게 될 그날이 바로 부활의 날이 되 리라",
                            "verse 50:43": "하나님이 생명을 주사 생명 을 앗아가니 최후의 목적지는 그 분이시라",
                            "verse 50:44": "대지가 갈라지는 날 그들은 서둘러 나와 다함께 모이나니 그것이 하나님께 쉬운 것이라",
                            "verse 50:45": "하나님은 그들이 말하는 모든 것을 알고 있나니 그대는 그들에게 강요하는 자 아니라 그러 므로 하나님의 경고를 두려워 하 는 자들에게 이 꾸란을 낭송하라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "چه‌ند پیتێک له‌سه‌ره‌تای هه‌ندێ له‌سووره‌ته‌کانی قورئاندا هاتوون ژماره‌یان (14) پیته‌، نیوه‌ی کۆی پیته‌کانی زمانی عه‌ره‌بین، بۆ سه‌لماندنی (اعجاز) و مه‌زنی و گرنگی قورئان که‌له‌توانای هیچ که‌سدانیه به‌و پیتانه کتێبێکی ئاوا بێوێنه دابنێت به‌راده‌یه‌ک هه‌تا هه‌موو گرۆی ئاده‌میزاد و په‌ری کۆ ببنه‌وه‌بۆ ئه‌و مه‌به‌سته‌، بێگومان چه‌نده‌ها نهێنی تریشی تیایه‌، زاناکان له‌هه‌ندێکی دواون، هه‌ندێکیشیان وتویانه‌: هه‌ر خوا خۆی زانایه به‌نهێنی ئه‌و پیتانه. سوێند به‌م قورئانه که‌خاوه‌نی ڕێز و شکۆمه‌ندی یه (تۆ ئه‌ی محمد (صلى الله عليه وسلم) نێردراوی له‌لایه خواوه‌)",
                            "verse 50:2": "خه‌ڵکی، باوه‌ڕیان نه‌کرد، به‌ڵکو سه‌رسام بوون له‌وه‌ی که‌یه‌کێک له‌خۆیان نێردراوه تادایان بچڵه‌کێنێت و بێداریان بکاته‌وه‌، جا کافران وتیان: ئه‌مه‌شتێکی سه‌یرو سه‌رسوڕهێنه‌ره‌، بۆیه وتیان:",
                            "verse 50:3": "ئایا کاتێک مردین و بووینه خاک زیندوو ده‌بینه‌وه؟! دوای مردن گه‌ڕانه‌وه ئه‌سته‌مه‌! (په‌روه‌ردیگاریش له‌وه‌ڵامیاندا ده‌فه‌رموێت):",
                            "verse 50:4": "به‌ڕاستی ئێمه زانیوومانه کاتێک که‌مردن، زه‌وی چۆن به‌ره‌به‌ره‌لاشه‌یان داده‌ڕزێنێت و ده‌یکاته‌وه به‌خاک، ئێمه تۆمارگه‌ی تایبه‌تیمان هه‌یه‌، که‌هه‌موو شتێکی تێدا تۆماره و هیچ شتێک له‌بارنی ئه‌وانه‌وه‌له‌ئێمه شاراوه‌و بزر نیه.",
                            "verse 50:5": "به‌ڵام ئه‌مانه‌دژی ڕاستین و بڕوایان پێ نه‌هێناوه‌کاتێک بۆیان هات، به‌هۆی ئه‌وه‌وه‌ئه‌وانه‌له‌سه‌رگه‌ردانی و سه‌رلێشێواوییه‌کی ئاڵۆزدا ده‌ژین (هه‌ر ڕۆژه‌ی قسه‌یه‌ک ده‌که‌ن).",
                            "verse 50:6": "ئایا ورد نه‌بوونه‌ته‌وه‌له‌و ئاسمانه‌ی که‌به‌راسه‌ریانه‌وه‌یه‌: چۆنمان دروست کردووه‌و ڕازاندوومانه‌ته‌وه‌به‌جۆرێک هیچ که‌م و کووڕی و که‌لێنێکی تێدا نی یه؟!",
                            "verse 50:7": "هه‌روه‌ها زه‌ویمان ڕاخستووه‌و بڵاومان کردۆته‌وه و کژو کێومان له‌سه‌ری دامه‌زراندووه‌و له‌هه‌موو جۆره ڕوه‌کێکی جوان و ڕازاوه‌مان تیادا ڕواندووه‌.",
                            "verse 50:8": "ئه‌مانه‌هه‌ر هه‌مووی بۆ ڕۆشنکردنه‌وه‌ی دڵ و یادخستنه‌وه‌یه بۆ هه‌موو ئه‌و به‌ندانه‌ی که‌به‌لای ئێمه‌دا دێنه‌وه و ڕه‌زامه‌ندی ئێمه‌یان مه‌به‌سته‌.",
                            "verse 50:9": "له‌ئاسمانه‌وه‌ئاوێکی به‌پیت و به‌ره‌که‌تمان هه‌رده‌م دابه‌زاندووه‌جا به‌هۆی ئه‌وه‌وه‌چه‌نده‌ها باخ و دانه‌وێڵه‌ی ئه‌و کشتوکاڵانه‌ی که‌دره‌و ده‌کرێن ئه‌روێنین.",
                            "verse 50:10": "هه‌روه‌ها دارخورمای قه‌شه‌نگ و بڵند سه‌ری هه‌ڵدا، که‌هێشووه خورمای جوان و له‌سه‌ر یه‌ک و ڕیزکراو ده‌گرێت.",
                            "verse 50:11": "ئه‌مه‌ش بۆ ئه‌وه‌ی ببێته ڕزق و ڕۆزی بۆ به‌نده‌کان... هه‌ر به‌و ئاوو بارانه‌شوێنه مردووه‌کان زیندووده‌که‌ینه‌وه‌، هه‌ر ئاوه‌هایش له‌دوای مردن ئێوه له‌خاک دێنه ده‌ره‌وه.",
                            "verse 50:12": "پێش ئه‌مانیش، قه‌ومی نوح، پێغه‌مبه‌ره‌که‌یان به‌درۆزانی... هه‌روه‌ها خاون بیره‌کان و هۆزی تمود یش.",
                            "verse 50:13": "هه‌روه‌ها قه‌ومی هود و فیرعه‌ون و براکانی لوط، (واته‌: قه‌ومه‌که‌ی).",
                            "verse 50:14": "خاوه‌ن باخه‌چڕه‌کان و قه‌ومه‌که‌ی تبع یش، (که‌یه‌کێک بووه‌له‌پاشاکانی ده‌وڵه‌تی حمیه‌ری لم یه‌مه‌ن)... هه‌ر یه‌کێک له‌وان باوه‌ڕیان به‌پێغه‌مبه‌ره‌کانیان نه‌کرد، به‌هۆی ئه‌وه‌وه‌شایسته‌ی پێشهاتنی هه‌ڕه‌شه‌ی ئێمه بوون.",
                            "verse 50:15": "ئایا ئێمه له‌سه‌ره‌تا و یه‌که‌م جاردا که‌ئه‌و خه‌ڵکه‌مان دروست کرد ماندوو بووین و گیروگرفت هاته‌رێمان؟! نه‌خێر ماندوو نه‌بووین، به‌ڵکو ئه‌وان له‌گوماندا به‌رامبه‌ر به دروست بوونه‌وه‌یه‌کی تازه‌.",
                            "verse 50:16": "سوێند به‌خوا بێگومان ئێمه ئاده‌میزادمان دروست کردووه‌و ده‌زانین چی به‌دڵ و ده‌روونیدا دێت... ئێمه له‌شاڕه‌گی دڵی لێی نزیکترین.",
                            "verse 50:17": "کاتێک دوو فریشته چاودێره‌که‌ی ئاده‌میزاد که‌له‌لای ڕاست و چه‌پیه‌وه دانیشتوون، (هه‌موو گوفتارو کردارێکی تۆمار ده‌که‌ن به‌ده‌زگای زۆر پێشکه‌وتوو).",
                            "verse 50:18": "هه‌ر قسه‌یه‌کی له‌ده‌م ده‌رده‌چێت خێرا چاودێرێکی ئاماده‌، تۆماری ده‌کات.",
                            "verse 50:19": "ئه‌ی ئینسان، ته‌نگانه‌ی مردن و ئازاره‌کانی هات، هاوڕێ له‌گه‌ڵ ڕاستییه‌کاندا، ئه‌وسا پێت ده‌وترێت: ئا ئه‌وه‌به‌سه‌رهات و ڕووداوه‌یه که‌خۆتت لێ لاده‌داو په‌نات لێ ده‌گرت.",
                            "verse 50:20": "له‌وه‌ودوا فوو ده‌کرێت به‌چوردا، ئیتر ئه‌وه‌رۆژی پێشهاتنی هه‌ڕه‌شه‌وو ئاگادار کردنه‌وه‌کانه‌.",
                            "verse 50:21": "ڕۆژی قیامه‌ت دێت و هه‌موو که‌سێک دوو که‌سی له‌گه‌ڵدایه‌، یه‌کێکیان ده‌یگه‌یه‌نێت و ئه‌وه‌ی تریشیان شایه‌ته به‌سه‌ریه‌وه.",
                            "verse 50:22": "به‌یه‌که‌یه‌که‌ی بێ باوه‌ڕان ده‌وتڕێت: سوێند به‌خوا به‌ڕاستی تۆ له‌م به‌سه‌رهاتانه‌نا ئاگابوویت و گوێی خۆتت لێ خه‌واندبوو، ئێستا ئێمه په‌رده‌مان له‌سه‌ر چاوه‌کانت لاداوه‌و هه‌موو شتێک وه‌کو خۆی ده‌بینیت و ئه‌مرۆ چاوه‌کانت تیژه...",
                            "verse 50:23": "فریشته‌ی هاوه‌ڵ و چاودێری ڕوو به‌په‌روه‌ردگار ده‌ڵێت: هه‌رچی کاروکرده‌وه‌ی ئه‌م ئاده‌می یه هه‌یه هه‌مووی ئه‌وه‌ته‌لای من و یاداشت و تۆمارم کردووه‌.",
                            "verse 50:24": "(دوای لێپرسینه‌وه‌، خوا فه‌رمان ده‌دات به‌دوو فریشته‌که‌) هه‌رچی کافرو بێ باوه‌ڕێکی سه‌رکه‌ش و بوغزن هه‌یه فڕێی بده‌نه‌ناو ئاگری دۆزه‌خه‌وه...",
                            "verse 50:25": "ئه‌وه‌ی که‌هه‌میشه به‌توندی قه‌ده‌غه‌ی هه‌موو خێرو چاکه‌یه‌کی ده‌کرد، مافی خه‌ڵکی پێشێل ده‌کرد، خۆی به‌گومان بوو، خه‌ڵکیشی ده‌خسته‌گومانه‌وه‌....",
                            "verse 50:26": "ئه‌وه‌بوو که‌هاوه‌ڵ و شه‌ریکی بۆ خوا به‌ڕه‌وا ده‌زانی... که‌واته‌ئێوه هه‌ردووکتان ئه‌و ئاده‌می یه فڕێ بده‌نه‌ناو سزای سه‌خته‌وه‌.",
                            "verse 50:27": "هاوه‌ڵه شه‌یتانه‌که‌شی پاکانه‌ده‌کات و ده‌ڵێت: په‌روه‌ردگارا، خۆ من له‌خشته‌م نه‌بردووه‌، من سه‌رکه‌شم نه‌کردووه‌، خۆی تاوانباره‌، به‌ڵام خۆی له‌نێو گومڕایی و سه‌رلێشێواویه‌کی دووردا نقووم بوو بوو.",
                            "verse 50:28": "(جا ئه‌وکاته‌ی شه‌یتان و ئاده‌میزاد لای خوادا ده‌بێته کێشه‌یان، خوا بێ ده‌نگیان ده‌کات) ده‌فه‌رموێت: شه‌ڕه ده‌مێ له‌لای مندا مه‌که‌ن، به‌ڕاستی من پێشتر هه‌ڕه‌شه‌ی هاتنی ئه‌م ڕۆژه‌م خستبووه‌به‌رچاوتان و، پێم ڕاگه‌یاندبوون.",
                            "verse 50:29": "ئیتر قسه‌و بڕیاری من ناگۆڕێت و هه‌ڵناوه‌شێته‌وه.... من هێچ کات سته‌مکاریش نیم له‌به‌نده‌کانم.",
                            "verse 50:30": "ڕۆژێک دێت به‌دۆزه‌خ ده‌ڵێین: ئایا پڕ بوویت؟ ئه‌ویش له‌وه‌ڵامدا ده‌ڵێت: ئایا که‌سی تر ماوه‌خه‌ڵکی زیاتر نیه؟!",
                            "verse 50:31": "له‌ولایشه‌وه به‌هه‌شت نزیک خراوه‌ته‌وه‌له‌خواناس و پارێزکارو باوه‌ڕداران، بێ ئه‌وه‌ی دوور بێت لێیان، ده‌وترێت...",
                            "verse 50:32": "ئه‌مه‌ئه‌و به‌ڵێنه بوو پێتان درابوو، بۆ هه‌موو ئه‌و که‌سانه‌ی که‌زۆر ته‌وبه‌کارو خۆپارێزن له‌گوناهو نافه‌رمانی خوا.",
                            "verse 50:33": "هه‌ر که‌س له‌خوای میهره‌بان بترسێت و له‌په‌نهاندا خۆی له‌گوناه بپارێزێت و به‌دڵێکی به‌ئاگا و ته‌وبه‌کاره‌وه‌بۆ باره‌گای خوا بگه‌ڕێته‌وه... (جا به‌و به‌خته‌وه‌ڕانه ده‌وترێت):",
                            "verse 50:34": "بفه‌رموون بچنه ناو به‌هه‌شته‌وه له‌گه‌ڵ ئاشتی و ئارامی وهێمنیدا، ئا ئه‌وه‌ئیتر ڕۆژی نه‌مریی و نه‌بڕاوه‌یه.",
                            "verse 50:35": "هه‌رچیش داوای ده‌که‌ن و حه‌زی لێ ده‌که‌ن بۆیان ئاماده‌یه تیایدا، زۆر له‌وه‌ش زیاترمان لایه.",
                            "verse 50:36": "خۆ ئێمه چه‌نده‌ها هۆزو نه‌ته‌وه‌ی پێش ئه‌وانمان له‌ناو برد، که‌ئه‌وان له‌مان به‌ده‌سه‌ڵاتترو به‌تواناتر بوون... خۆ ئه‌وان به‌شاره‌کان و شوێنه‌واره‌کاندا گه‌ڕاوان و تێپه‌ر بوون، ئایا هیچ ده‌ربازبوونێک له‌سزاکانیان به‌دی کرد؟!",
                            "verse 50:37": "به‌ڕاستی ئا له‌و به‌سه‌رهاتانه‌دا یاده‌وه‌ری هه‌یه بۆ که‌سێک دڵێکی زیندووی هه‌نێت، یاخود گوێ بۆ قورئان ڕادێرێت، له‌کاتێکدا ئاماده‌بێت بۆ فه‌رمانبه‌رداریی و کردنی هه‌موو کارێکی دروست.",
                            "verse 50:38": "به‌ڕاستی ئێمه ئاسمانه‌کان و زه‌وی و هه‌رچی له‌نێوانیاندا هه‌یه به‌شه‌ش ڕۆژ دروستمان کردوون، هیچ ماندویه‌تیه‌کیش ڕوی تێ نه‌کردین.",
                            "verse 50:39": "جا تۆ ئه‌ی پێغه‌مبه‌ر (صلى الله عليه وسلم) دان به‌خۆتا بگره‌له‌به‌رامبه‌ر ئه‌و هه‌موو ناحه‌قی و نادروستیانه‌وه که‌ده‌یڵێن و دێته ڕێت، (بۆ به‌رگه‌گرتنی ئه‌و گیروگرفتانه‌ی که‌بۆت پێش ده‌هێنن)، پێش خۆر هه‌ڵاتن و پێش ئاوابوونی ته‌سبیحات و سوپاس و ستایشی په‌روه‌ردیگارت بکه‌.",
                            "verse 50:40": "له‌شه‌وگاریشدا ته‌سبیحات و ستایشی خوا بکه‌، هه‌روه‌ها له‌دوای نوێژه‌کانیش.",
                            "verse 50:41": "گوێش به‌چاکی ڕابگره‌!! ڕۆژێک دێت بانگ وێژێک بانگ ده‌کات له‌شوێنێکی نزیکه‌وه‌...",
                            "verse 50:42": "ئه‌و ڕۆژه ده‌نگێکی زۆر به‌رز و سامناک به‌ڕاستیی ده‌بیستن، دیاره که‌ئه‌وه‌رۆژی هاتنه‌ده‌ره‌وه‌یه له‌توێی خاکدا.",
                            "verse 50:43": "به‌ڕاستی هه‌ر ئێمه ژیان ده‌به‌خشین و ده‌شیان مرێنین، گه‌ڕانه‌وه‌ش هه‌ر بۆ لای ئێمه‌یه.",
                            "verse 50:44": "ڕۆژێک دێت زه‌وی له‌ئاستی ئه‌وان شه‌ق ده‌بات و خه‌ڵکی له‌گۆڕه‌کانیان به‌گورجی دێنه ده‌ره‌وه‌.... ئا ئه‌وه‌کۆ کردنه‌وه‌یه‌که لای ئێمه کارێکی زۆر ئاسانه (بۆ لێپرسینه‌وه‌).",
                            "verse 50:45": "ئه‌ی محمد (صلى الله عليه وسلم) ئێمه چاک ئاگادارین به‌وه‌ی که‌ده‌یڵێن و چۆن دژایه‌تی ئه‌م ڕاستی یه ده‌که‌ن!... خۆ تۆ زۆردارنیت به‌سه‌ریانه‌وه تا باوه‌ڕیان به‌سه‌ردا بسه‌پێنیت.. که‌واته‌تۆ ته‌نها ئه‌وه‌ت له‌سه‌ره‌که‌به‌قورئان یاداوه‌ریی ئه‌و که‌سانه‌بکه‌یت که‌له‌هه‌ڕه‌شه‌کانی ئێمه ده‌ترسن."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Qaaf. Demi Al-Quran yang melimpah-limpah kemuliaan dan kebaikannya (bahawa sesungguhnya Muhammad adalah Rasul yang diutus memberi peringatan dan amaran).",
                            "verse 50:2": "(Kaum musyrik Mekah bukan sahaja mengingkari kerasulannya) bahkan mereka merasa hairan kerana datang kepada mereka, dari kalangan mereka sendiri, seorang Rasul pemberi peringatan dan amaran (mengenai perkara hidup semula sesudah mati); lalu orang-orang yang kafir itu berkata: Ini adalah satu perkara yang menakjubkan!",
                            "verse 50:3": "Adakah (kita akan kembali hidup) sesudah kita mati dan menjadi tanah? Itu adalah cara kembali yang jauh (dari kemungkinan, kerana jasad yang telah hancur tidak dapat diketahui lagi).",
                            "verse 50:4": "(Apa yang mereka katakan itu tidaklah benar, kerana) Kami sedia mengetahui apa yang dimakan oleh bumi sedikit demi sedikit dari (tubuh orang mati) mereka, serta ada di sisi Kami sebuah Kitab yang menyimpan (catitan segala perkara yang berlaku).",
                            "verse 50:5": "(Mereka tidak mahu berfikir betul) bahkan mereka (terburu-buru) mendustakan kebenaran apabila sahaja sampainya kepada mereka; oleh sebab itu, mereka berada dalam keadaan yang serba kacau.",
                            "verse 50:6": "(Kalaulah mereka menyangka Kami tidak berkuasa mengembalikan mereka hidup semula) maka tidakkah mereka memandang ke langit yang ada di sebelah atas mereka (dengan tidak bertiang) bagaimana Kami membinanya (dengan rapi) serta Kami menghiasinya (dengan bintang-bintang) dan dengan keadaan tidak ada padanya retak-renggang?",
                            "verse 50:7": "Dan juga (keadaan) bumi ini, (bagaimana) Kami bentangkan ia sebagai hamparan, dan Kami letakkan padanya gunung-ganang yang terdiri kukuh, serta Kami tumbuhkan padanya pelbagai jenis tanaman yang indah subur?",
                            "verse 50:8": "(Kami adakan semuanya itu) untuk menjadi perhatian dan peringatan, (yang menunjukkan jalan kebenaran), kepada tiap-tiap seorang hamba Allah yang mahu kembali kepadaNya (dengan taat dan berbakti).",
                            "verse 50:9": "Dan juga Kami telah menurunkan dari langit air (hujan) yang banyak faedahnya, lalu Kami tumbuhkan dengan air itu pokok-pokok tanaman (buah-buahan) dan biji-bijian yang dituai;",
                            "verse 50:10": "Serta pohon-pohon kurma yang tinggi menjulang, yang mengeluarkan mayang, berlapis-lapis, lagi lebat putiknya;",
                            "verse 50:11": "(Semuanya itu) sebagai rezeki bagi hamba-hamba Kami dan lagi Kami telah hidupkan dengan air itu bumi yang mati; demikianlah pula keadaan keluarnya (orang-orang yang mati dari kubur setelah dibangkitkan hidup semula).",
                            "verse 50:12": "Sebelum mereka (yang menentang Nabi Muhammad) itu kaum Nabi Nuh dan \"Ashaabur-Rassi\" serta Thamud (kaum Nabi Soleh), telah juga mendustakan Rasul masing-masing,",
                            "verse 50:13": "Dan juga Aad (kaum Nabi Hud) dan Firaun, serta kaum Nabi Lut,",
                            "verse 50:14": "Dan juga penduduk \"Aikah\", serta kaum \"Tubba'\"; tiap-tiap satu kaum itu telah mendustakan Rasul-rasul (yang diutus kepadanya), lalu mereka ditimpa azab yang Aku janjikan.",
                            "verse 50:15": "(Setelah mereka melihat dan memerhatikan makhluk-makhluk yang Kami ciptakan itu) maka adakah Kami telah lemah dengan ciptaan yang pertama itu (sehingga Kami tidak dapat mengadakannya semula? Tidak! Dan merekapun tidak mengingkari kekuasaan Kami). Bahkan mereka berada dalam keadaan keliru dan ragu-ragu tentang ciptaan makhluk-makhluk (hidup semula) dalam bentuk yang baru.",
                            "verse 50:16": "Dan demi sesungguhnya, Kami telah mencipta manusia dan Kami sedia mengetahui apa yang dibisikkan oleh hatinya, sedang (pengetahuan) Kami lebih dekat kepadanya daripada urat lehernya,",
                            "verse 50:17": "Semasa dua malaikat (yang mengawal dan menjaganya) menerima dan menulis segala perkataan dan perbuatannya; yang satu duduk di sebelah kanannya dan yang satu lagi di sebelah kirinya.",
                            "verse 50:18": "Tidak ada sebarang perkataan yang dilafazkannya (atau perbuatan yang dilakukannya) melainkan ada di sisinya malaikat pengawas yang sentiasa sedia (menerima dan menulisnya).",
                            "verse 50:19": "Dan (apabila sampai ajal seseorang) datanglah \"Sakaratulmuat\" membawa kebenaran (yang telah dijanjikan, serta dikatakan kepada yang mengingkarinya sebelum itu): Inilah perkara yang engkau selalu mengelak diri daripadanya!",
                            "verse 50:20": "Dan lagi (apabila sampai saat yang ditentukan) ditiuplah sangkakala (untuk menghidupkan semula makhluk-makhluk yang telah mati); saat itu ialah hari berlakunya amaran yang telah diberikan.",
                            "verse 50:21": "Dan (setelah itu) datanglah tiap-tiap orang (ke Padang Mahsyar), disertai (dua malaikat: Yang satu menjadi) pembawa dan (yang satu lagi menjadi) saksi;",
                            "verse 50:22": "(Serta dikatakan kepadanya): Demi sesungguhnya! Engkau di dunia dahulu berada dalam keadaan lalai tentang (perkara hari) ini, maka kami hapuskan kelalaian yang menyelubungimu itu, lalu pandanganmu pada hari ini menjadi tajam (dapat menyaksikan dengan jelasnya perkara-perkara hari akhirat).",
                            "verse 50:23": "Dan berkatalah malaikat yang sentiasa ada bersama-samanya: Inilah (Kitab catitan iman dan amal) orang yang terletak dalam jagaanku, siap sedia (untuk dibicarakan).",
                            "verse 50:24": "(Setelah tiap-tiap orang dibicarakan, Allah berfirman kepada kedua malaikat yang menjadi pembawa dan saksi itu): Humbankanlah oleh kamu berdua, ke dalam Neraka Jahannam tiap-tiap orang yang tetap degil dalam kekufurannya; -",
                            "verse 50:25": "Yang sering menghalangi jenis kebajikan, yang melanggar hukum agama, lagi yang meragukan kebenaran,",
                            "verse 50:26": "Yang menyembah benda yang lain bersama-sama Allah; maka humbankanlah oleh kamu berdua akan dia ke dalam azab seksa yang seberat-beratnya.",
                            "verse 50:27": "(Semasa dia dihumbankan ke dalam Neraka Jahannam, dia mendakwa bahawa Syaitanlah yang menjadikan dia sesat; pada saat itu) Syaitan yang sentiasa menyertainya (di dunia dahulu) berkata: Wahai Tuhan kami, aku tidak menyesatkannya tetapi sememangnya dia sendiri berada di dalam kesesatan yang jauh terpesong.",
                            "verse 50:28": "Allah berfirman: Janganlah kamu berbalah lagi di hadapanKu, (tidak ada gunanya berbalah pada masa Aku membuat keputusan); padahal (kamu sedia mengetahui bahawa) Aku dahulu telah memberi amaran kepada kamu (akan menyeksa orang-orang yang bersalah).",
                            "verse 50:29": "KeputusanKu itu tidak dapat diubah atau ditukar ganti dan Aku tidak sekali-kali berlaku zalim kepada hambaKu.",
                            "verse 50:30": "(Peringatkanlah manusia) akan hari Kami bertanya kepada Neraka Jahannam: Adakah engkau sudah penuh? Dia menjawab: Adakah lagi sebarang tambahan?",
                            "verse 50:31": "Dan (ingatkanlah pula hari) didekatkan Syurga bagi orang-orang yang bertakwa, di tempat yang tidak jauh (dari mereka).",
                            "verse 50:32": "(Serta dikatakan kepada mereka): Inilah yang dijanjikan kepada kamu, kepada tiap-tiap hamba yang sentiasa kembali (kepada Allah dengan mengerjakan ibadat), lagi yang sangat memelihara dengan sebaik-baiknya (segala hukum dan peraturan Allah);",
                            "verse 50:33": "(Iaitu) orang yang takut (melanggar perintah Allah) Yang Maha Pemurah, semasa tidak dilihat orang dan semasa dia tidak melihat azab Allah, serta dia datang (kepada Allah) dengan hati yang tunduk taat.",
                            "verse 50:34": "(Mereka dipersilakan oleh malaikat dengan berkata): Masuklah kamu ke dalam Syurga dengan selamat sejahtera; hari ini ialah hari (bermulanya) kehidupan yang kekal.",
                            "verse 50:35": "Mereka beroleh apa yang mereka kehendaki di situ dan di sisi Kami ada lagi tambahan (limpah kurnia yang tidak terlintas di hati mereka).",
                            "verse 50:36": "Dan berapa banyak kaum-kaum (yang ingkar) yang terdahulu daripada orang-orang musyrik Mekah itu Kami telah binasakan. Kaum-kaum itu lebih kekuatannya (dan kehandalannya) daripada mereka, lalu kaum-kaum itu keluar mencari perlindungan di merata-rata negeri. (Meskipun demikian keadaannya) dapatkah (mereka) menyelamatkan diri?",
                            "verse 50:37": "Sesungguhnya (keterangan-keterangan dan peristiwa-peristiwa) yang tersebut itu, tidak syak lagi mengandungi pengajaran bagi sesiapa yang mempunyai hati (yang sedar pada masa membacanya) atau yang menggunakan pendengarannya dengan bersungguh-sungguh (kepada pengajaran itu) dengan menumpukan hati dan fikiran kepadanya.",
                            "verse 50:38": "Dan demi sesungguhnya! Kami telah menciptakan langit dan bumi serta segala yang ada di antara keduanya dalam enam masa dan Kami tidak mengalami sebarang susah payah.",
                            "verse 50:39": "Oleh itu bersabarlah (wahai Muhammad) akan apa yang dikatakan oleh mereka (yang menentangmu itu) dan bertasbihlah sambil memuji Tuhanmu (terutama) sebelum terbit matahari dan sebelum matahari terbenam.",
                            "verse 50:40": "Serta bertasbihlah kepadaNya pada malam hari dan sesudah mengerjakan sembahyang.",
                            "verse 50:41": "Dan dengarlah (apa yang diterangkan kepadamu sekarang ini mengenai hari kiamat), hari (malaikat yang menjadi) penyeru, menyeru (makhluk-makhluk yang telah mati) dari tempat yang dekat yang dapat didengar oleh semuanya),",
                            "verse 50:42": "Iaitu hari mereka mendengar pekikan seruan yang menyatakan perkara yang benar; hari seruan itu ialah hari masing-masing keluar dari kubur.",
                            "verse 50:43": "Sesungguhnya Kami menghidupkan dan mematikan dan kepada Kamilah sahaja tempat kembali (sekalian makhluk).",
                            "verse 50:44": "Pada hari bumi terbelah-belah untuk mereka segera keluar (daripadanya). Perbuatan (menghidupkan dan) menghimpunkan mereka di Padang Mahsyar itu, mudah bagi Kami melaksanakannya.",
                            "verse 50:45": "Kami lebih mengetahui apa yang mereka katakan (dari berbagai tuduhan terhadapmu wahai Muhammad) dan engkau bukanlah seorang yang berkuasa memaksa mereka (supaya masing-masing beriman). Oleh itu, berilah peringatan dengan Al-Quran ini kepada orang yang takutkan janji azabKu."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "ق، سوگند به مجيد (كه قيامت و رستاخيز حق است)!",
                            "verse 50:2": "آنها تعجب كردند كه پيامبرى انذارگر از ميان خودشان آمده; و كافران گفتند: «اين چيز عجيبى است!",
                            "verse 50:3": "آيا هنگامى كه مرديم و خاك شديم (دوباره به زندگى بازمى‏گرديم)؟! اين بازگشتى بعيد است!; س‏ذللّه",
                            "verse 50:4": "ولى ما مى‏دانيم آنچه را زمين از بدن آنها مى‏كاهد; و نزد ما كتابى است كه همه چيز در آن محفوظ است!",
                            "verse 50:5": "آنها حق را هنگامى كه به سراغشان آمد تكذيب كردند; از اين رو پيوسته در كار پراكنده خود متحيرند!",
                            "verse 50:6": "آيا آنان به آسمان بالاى سرشان نگاه نكردند كه چگونه ما آن را بنا كرده‏ايم، و چگونه آن را (بوسيله ستارگان) زينت بخشيده‏ايم و هيچ شكاف و شكستى در آن نيست؟!",
                            "verse 50:7": "و زمين را گسترش داديم و در آن كوه‏هائى عظيم و استوار افكنديم و از هر نوع گياه بهجت‏انگيز در آن رويانديم،",
                            "verse 50:8": "تا وسيله بينايى و يادآورى براى هر بنده توبه كارى باشد!",
                            "verse 50:9": "و از آسمان، آبى پربركت نازل كرديم، و بوسيله آن باغها و دانه‏هايى را كه درو مى‏كند رويانديم،",
                            "verse 50:10": "و نخلهاى بلندقامت كه ميوه‏هاى متراكم دارند;",
                            "verse 50:11": "همه اينها براى روزى‏بخشيدن به بندگان است و بوسيله باران سرزمين مرده را زنده كرديم; (آرى) زنده‏شدن مردگان نيز همين گونه است!",
                            "verse 50:12": "پيش از آنان قوم نوح و «اصحاب الرس‏» ( قومى كه در يمامه زندگى مى‏كردند و پيامبرى به نام حنظله داشتند) و قوم ثمود (پيامبرانشان را) تكذيب كردند،",
                            "verse 50:13": "و همچنين قوم عاد و فرعون و قوم لوط،",
                            "verse 50:14": "و «اصحاب الايكه‏» ( قوم شعيب) و قوم تبع (كه در سرزمين يمن زندگى مى‏كردند)، هر يك از آنها فرستادگان الهى را تكذيب كردند و وعده عذاب درباره آنان تحقق يافت!",
                            "verse 50:15": "آيا ما از آفرينش نخستين عاجز مانديم (كه قادر بر آفرينش رستاخيز نباشيم)؟! ولى آنها (با اين همه دلايل روشن) باز در آفرينش جديد ترديد دارند!",
                            "verse 50:16": "ما انسان را آفريديم و وسوسه‏هاى نفس او را مى‏دانيم، و ما به او از رگ قلبش نزديكتريم!",
                            "verse 50:17": "(به خاطر بياوريد) هنگامى را كه دو فرشته راست و چپ كه ملازم انسانند اعمال او را دريافت مى‏دارند;",
                            "verse 50:18": "انسان هيچ سخنى را بر زبان نمى‏آورد مگر اينكه همان دم، فرشته‏اى مراقب و آماده براى انجام ماموريت (و ضبط آن) است!",
                            "verse 50:19": "و سرانجام، سكرات (و بيخودى در آستانه) مرگ بحق فرامى‏رسد (و به انسان گفته مى‏شود:) اين همان چيزى است كه تو از آن مى‏گريختى!",
                            "verse 50:20": "و در «صور» دميده مى‏شود; آن روز، روز تحقق وعده وحشتناك است!",
                            "verse 50:21": "هر انسانى وارد محشر مى‏گردد در حالى كه همراه او حركت دهنده و گواهى است!",
                            "verse 50:22": "(به او خطاب مى‏شود:) تو از اين صحنه (و دادگاه بزرگ) غافل بودى و ما پرده را از چشم تو كنار زديم، و امروز چشمت كاملا تيزبين است!",
                            "verse 50:23": "فرشته همنشين او مى‏گويد: «اين نامه اعمال اوست كه نزد من حاضر و آماده است!»",
                            "verse 50:24": "(خداوند فرمان مى‏دهد:) هر كافر متكبر لجوج را در جهنم افكنيد!",
                            "verse 50:25": "آن كسى كه به شدت مانع خير و متجاوز و در شك و ترديد است (حتى ديگران را به ترديد مى افكند);",
                            "verse 50:26": "همان كسى كه معبود ديگرى با خدا قرار داده، (آرى) او را در عذاب شديد بيفكنيد!",
                            "verse 50:27": "و همنشينش (از شياطين) مى‏گويد: «پروردگارا! من او را به طغيان وانداشتم، لكن او خود در گمراهى دور و درازى بود!»",
                            "verse 50:28": "(خداوند) مى‏گويد: «نزد من جدال و مخاصمه نكنيد; من پيشتر به شما هشدار داده‏ام (و اتمام حجت كرده‏ام)!",
                            "verse 50:29": "سخن من تغيير ناپذير است، و من هرگز به بندگان ستم نخواهم كرد!»",
                            "verse 50:30": "(به خاطر بياوريد) روزى را كه به جهنم مى‏گوييم: «آيا پر شده‏اى؟» و او مى‏گويد: «آيا افزون بر اين هم هست؟!»",
                            "verse 50:31": "(در آن روز) بهشت را به پرهيزگاران نزديك مى‏كنند، و فاصله‏اى از آنان ندارد!",
                            "verse 50:32": "اين چيزى است كه به شما وعده داده مى‏شود، و براى كسانى است كه بسوى خدا بازمى‏گردند و پيمانها و احكام او را حفظ مى‏كنند،",
                            "verse 50:33": "آن كس كه از خداوند رحمان در نهان بترسد و با قلبى پرانابه در محضر او حاضر شود!",
                            "verse 50:34": "(به آنان گفته مى‏شود:) بسلامت وارد بهشت شويد، امروز روز جاودانگى است!",
                            "verse 50:35": "هر چه بخواهند در آنجا براى آنها هست، و نزد ما نعمتهاى بيشترى است (كه به فكر هيچ كس نمى‏رسد)!",
                            "verse 50:36": "چه بسيار اقوامى را كه پيش از آنها هلاك كرديم، اقوامى كه از آنان قويتر بودند و شهرها (و كشورها) را گشودند; آيا راه فرارى (از عذاب الهى) وجود دارد!",
                            "verse 50:37": "در اين تذكرى است براى آن كس كه عقل دارد، يا گوش دل فرادهد در حالى كه حاضر باشد!",
                            "verse 50:38": "ما آسمانها و زمين و آنچه را در ميان آنهاست در شش روز ( شش دوران) آفريديم، و هيچ گونه رنج و سختى به ما نرسيد! (با اين حال چگونه زنده‏كردن مردگان براى ما مشكل است؟!)",
                            "verse 50:39": "در برابر آنچه آنها مى‏گويند شكيبا باش، و پيش از طلوع آفتاب و پيش از غروب تسبيح و حمد پروردگارت را بجا آور،",
                            "verse 50:40": "و در بخشى از شب او را تسبيح كن، و بعد از سجده‏ها!",
                            "verse 50:41": "و گوش فرا ده و منتظر روزى باش كه منادى از مكانى نزديك ندا مى‏دهد،",
                            "verse 50:42": "روزى كه همگان صيحه رستاخيز را بحق مى‏شنوند; آن روز، روز خروج (از قبرها) است!",
                            "verse 50:43": "ماييم كه زنده مى‏كنيم و مى‏ميرانيم، و بازگشت تنها بسوى ماست!",
                            "verse 50:44": "روزى كه زمين به سرعت از روى آنها شكافته مى‏شود و (از قبرها) خارج مى‏گردند; و اين جمع كردن براى ما آسان است!",
                            "verse 50:45": "ما به آنچه آنها مى‏گويند آگاهتريم، و تو مامور به اجبار آنها (به ايمان) نيستى; پس بوسيله ، كسانى را كه از عذاب من مى‏ترسند متذكر ساز (وظيفه تو همين است)!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Caf. Pelo Alcorão glorioso (que tu és o Mensageiro de Deus).",
                            "verse 50:2": "Qual ! Admiram-se de que lhes tenha surgido um admoestador de sua estirpe. E os incrédulos dizem: Isto é algo assombroso.",
                            "verse 50:3": "Acaso, quando morrermos e formos convertidos em pó, (seremos ressuscitados)? Tal retorno será impossível!",
                            "verse 50:4": "Nós já sabemos a quantos deles tem devorado a terra, porque possuímos um Livro de registros.",
                            "verse 50:5": "Não obstante, desmentem a verdade quando esta lhes chega, e, ei-los aí em estado caótico.",
                            "verse 50:6": "Porém, não reparam, acaso, no céu que está acima deles? Como o construímos e o adornamos, sem abertura aparente?",
                            "verse 50:7": "E dilatamos a terra, fixando nela (firmes) montanhas, produzindo aí toda a formosa espécie, em pares,",
                            "verse 50:8": "Para a observação e recordação de todo o servo contrito.",
                            "verse 50:9": "E enviamos do céu a água bendita, mediante a qual produzimos jardins e cereais para a colheita.",
                            "verse 50:10": "E também as frondosas tamareiras, cujos cachos estão carregados de frutos em simetria,",
                            "verse 50:11": "Como sustento para os servos; e fazemos reviver, com ela, (a água) uma terra árida. Assim será a ressurreição!",
                            "verse 50:12": "Antes deles, desmentiram os mensageiros o povo de Noé, os moradores de Arrass e o povo de Samud.",
                            "verse 50:13": "O povo de Ad, o Faraó, os irmãos de Lot,",
                            "verse 50:14": "Os habitantes da floresta e o povo de Tubba todos desmentiram os mensageiros e todos mereceram a Minha advertência.",
                            "verse 50:15": "Porventura, exaurimo-nos com a primeira criação? Qual! Estão em dúvida acerca da nova criação.",
                            "verse 50:16": "Criamos o homem e sabemos o que a sua alma lhe confidencia, porque estamos mais perto dele do que a (sua) artéria jugular.",
                            "verse 50:17": "Eis que dois (anjos da guarda), são apontados para anotarem (suas obras), um sentado à sua direita e o outro à esquerda.",
                            "verse 50:18": "Não pronunciará palavra alguma, sem que junto a ele esteja presente uma sentinela pronta (para a anotar).",
                            "verse 50:19": "E a hora da morte trará a verdade: Eis do que tentáveis escapar!",
                            "verse 50:20": "E a trombeta soará. Eis aí o dia da advertência.",
                            "verse 50:21": "E cada alma comparecerá, acompanhada de um anjo, como guia, e outro, como testemunha.",
                            "verse 50:22": "(Ser-lhe-á dito): Estavas descuidado a respeito disto; porém, agora removemos o teu véu; tua vista será penetrante, nesse dia.",
                            "verse 50:23": "E seu acompanhante dirá: Aí está (o registro dos teus atos) completo comigo.",
                            "verse 50:24": "(Depois da sentença será dito aos anjos da guarda) : Precipitai no inferno todo o incrédulo obstinado,",
                            "verse 50:25": "Que obstruirá o bem, era profanador, dubitável,",
                            "verse 50:26": "Que atribuía a Deus outras divindades. Arrojai-o, pois, no severo tormento!",
                            "verse 50:27": "Seu acompanhante (sedutor) dirá: Ó Senhor nosso, eu não o fiz transgredir; porém, ele é que estava em um erro profundo.",
                            "verse 50:28": "Dir-lhes-á (Deus): Não disputeis em Minha presença, uma vez que nos enviei antecipadamente a advertência.",
                            "verse 50:29": "A palavra é insubstituível perante Mim, e jamais sou injusto para com os Meus servos.",
                            "verse 50:30": "Naquele dia perguntaremos ao inferno: Estás já repleto? E responderá: Há alguém mais?",
                            "verse 50:31": "E o Paraíso, para os tementes, estará preparado, não longe dali.",
                            "verse 50:32": "Eis aqui o que se promete a todo o arrependido, observante (dos preceitos),",
                            "verse 50:33": "Que teme intimamente o Clemente e comparece, com um coração contrito.",
                            "verse 50:34": "Entrai nele (o Paraíso), em paz! Eis aqui o Dia da Eternidade!",
                            "verse 50:35": "Lá terão tudo quanto desejarem, e mais ainda, em Nossa presença.",
                            "verse 50:36": "E quantas gerações, anteriores a eles e mais poderosas do que eles, temos aniquilado! Conquanto percorressem a terra, tiveram porventura, alguma escapatória?",
                            "verse 50:37": "Em verdade, nisto há uma mensagem para aquele que tem coração, que escuta atentamente e é testemunha (da verdade).",
                            "verse 50:38": "Criamos os céus e a terra e, quanto existe entre ambos, em seis dias, e jamais sentimos fadiga alguma.",
                            "verse 50:39": "Tolera, pois, tudo quanto te dizem, e celebra os louvores do teu Senhor, antes do nascer do sol e antes do acaso.",
                            "verse 50:40": "E glorifica-O ao anoitecer e no fim das prostrações.",
                            "verse 50:41": "E aguarda o dia em que o convocador fizer a chamada, de um lugar próximo.",
                            "verse 50:42": "Dia esse em que ouvirão verdadeiramente o estrondo; tal será o dia da Ressurreição!",
                            "verse 50:43": "Somos Nós que damos a vida e a morte, e a Nós será o retorno.",
                            "verse 50:44": "Tal acontecerá, no dia em que a terra se fender acima deles (e eles saírem) apressadamente (dos sepulcros): isso será a congregação, fácil para Nós.",
                            "verse 50:45": "Nós bem sabemos tudo quanto dizem, e tu não és o seu incitador. Admoesta, pois, mediante o Alcorão, a quem tema a Minha ameaça!"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 50:1": "Qaf. Pe Coranul cel glorios!",
                            "verse 50:2": "Însã ei se mirã cã le vine ca prevenitor unul dintre ei și cei necre- dincioși zic: \"Acesta este lucru ciudat!",
                            "verse 50:3": "Oare dupã ce am murit noi și ne-am fãcut țãrânã [vom mai fi noi readuși la viațã]? Aceasta este o întoarcere depãrtatã!\"",
                            "verse 50:4": "Noi știm ce mistuie pãmântul din ei. Noi avem o carte pãstrã-toare .",
                            "verse 50:5": "Însã ei au socotit Adevãrul drept minciunã, când a venit la ei. Șiei sunt într-o stare încurcatã.",
                            "verse 50:6": "Oare nu se uitã ei spre cerul de deasupra lor cum l-am înãlțatNoi și l-am înfrumusețat și cum nu are el nici un fel de crãpãturi?",
                            "verse 50:7": "Iar pãmântul l-am întins Noi și am aruncat pe el munți neclintiți și am fãcut sã creascã pe el din fiecare soi minunat,",
                            "verse 50:8": "Spre dovadã și îndemnare pentru fiecare rob care se cãiește.",
                            "verse 50:9": "Și Noi trimitem din cer apã binecuvântatã cu care facem sã creascã grãdini și grâne pentru seceriș.",
                            "verse 50:10": "Și palmieri semeți, cu ciorchini rânduiți unii peste alții,",
                            "verse 50:11": "Ca hranã pentru robi. Și cu ea Noi dãm viațã unui ținut mort . Astfel va fi și ieșirea [din morminte].",
                            "verse 50:12": "Înainte de ei , au învinuit de minciunã neamul lui Noe, locuitorii din ar-Rass, Thamud ,",
                            "verse 50:13": "’Ad , Faraon, frații lui Lot,",
                            "verse 50:14": "Locuitorii din Al-Ayka și neamul lui Tubba' . Toți i-au învinuit pe trimiși de minciunã și amenințarea Mea s-a adeverit.",
                            "verse 50:15": "Oare am ostenit Noi la creația cea dintâi? Însã ei sunt în îndoialã cu privire la o nouã creație .",
                            "verse 50:16": "Noi l-am creat pe om și Noi știm ce-i șoptește sufletul sãu , cãciNoi suntem mai aproape de el decât vâna gâtului,",
                            "verse 50:17": "Când cei doi primitori primesc, stând [unul] în dreapta și[celãlalt] în stânga,",
                            "verse 50:18": "Și el nu va rosti nici un cuvânt, fãrã sã aibã lângã el un supraveghetor pregãtit [sã scrie] .",
                            "verse 50:19": "Și vine agonia morții cu adevãrat: \"Aceasta este cea de care tu te-ai ferit!\"",
                            "verse 50:20": "Se va sufla în trâmbițã : Aceasta este Ziua amenințãrii .",
                            "verse 50:21": "Și va veni fiecare suflet împreunã cu un mânãtor și un martor.",
                            "verse 50:22": "\"Tu ai fost nepãsãtor fațã de aceasta. Și Noi am îndepãrtat vãlul tãu și privirea ta este astãzi pãtrunzãtoare\"",
                            "verse 50:23": "Și însoțitorul sãu va zice: \"Iatã ce se aflã la mine pregãtit!\"",
                            "verse 50:24": "Aruncați în Gheena pe tot necredinciosul îndârjit,",
                            "verse 50:25": "Care împiedicã binele , nelegiuit și bãnuitor ,",
                            "verse 50:26": "Care a așezat alãturi de Allah și un alt dumnezeu! . Aruncați-l peel la chinul cel aspru!”",
                            "verse 50:27": "Însoțitorul sãu va zice: \"Doamne, eu nu l-am oropsit, ci el s-a aflat în rãtãcire adâncã!\".",
                            "verse 50:28": "El le va zice: \"Nu vã certați în fața Mea! Eu v-am trimis amenințarea mai înainte!",
                            "verse 50:29": "La Mine vorba nu se schimbã și Eu nu sunt nedrept cu robii!\"",
                            "verse 50:30": "În Ziua aceea, îi vom zice Gheenei: \"Te-ai umplut?\" Iar ea va rãs- punde: \"Mai sunt încã [de venit]?\"",
                            "verse 50:31": "Și va fi Raiul adus aproape de cei care se tem [de Allah].",
                            "verse 50:32": "\"Aceasta este ceea ce s-a fãgãduit fiecãrui om care se cãiește, pãzitor al legãmântului,",
                            "verse 50:33": "Care a fost cu teamã de Cel Milostiv [Ar-Rahman], fãrã ca el sã-Lvadã, și care a venit [cãtre El] cu inima plinã de cãințã.",
                            "verse 50:34": "Intrați în el cu pace! \" Aceasta este Ziua veșniciei!",
                            "verse 50:35": "În el vor avea tot ceea ce vor voi. Și la Noi este și mai mult .",
                            "verse 50:36": "Și câte neamuri am nimicit Noi mai înainte de ei , care erau și mai puternice decât ei. Și au purces ei prin țarã, [cãutând]. Oare este vreo scãpare?",
                            "verse 50:37": "Întru aceasta este o îndemnare pentru cel care are inimã sau ascultã și este martor.",
                            "verse 50:38": "Am creat Noi cerurile și pãmântul și ceea ce se aflã între ele înșase zile și nu Ne-a cuprins pe Noi nici cea mai micã ostenealã!",
                            "verse 50:39": "Deci rabdã ceea ce spun ei și preamãrește-L cu laudã peStãpânul tãu, înainte de rãsãritul soarelui și înainte de asfințit;",
                            "verse 50:40": "Și în timpul unei pãrți din noapte laudã-L pe El! Și dupã prosternãri !",
                            "verse 50:41": "Și ascultã în Ziua în care cel care cheamã va chema dintr-un loc apropiat,",
                            "verse 50:42": "În Ziua când vor auzi strigãtul cu adevãrat! Aceasta va fi Ziua ieșirii [din morminte].",
                            "verse 50:43": "Noi dãm viațã și dãm moarte și la Noi va fi întoarcerea ,",
                            "verse 50:44": "În Ziua când se va crãpa pãmântul [lãsându-i] pe ei [sã iasã]grãbiți! Aceasta este o adunare ușoarã pentru Noi.",
                            "verse 50:45": "Noi știm bine ce spun ei . Tu nu ești pus siluitor peste ei. Și îndeamnã-l prin Coran pe acela care se teme de amenințarea Mea!"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 50:1": "Qaf. Pe Coranul cel slăvit!",
                            "verse 50:2": "Ba nu! Ei se miră că a venit la ei un predicator dintre ei. Cei tăgăduitori spun: “Este un lucru de mirare ca atunci",
                            "verse 50:3": "când vom muri şi vom fi ţărână, va mai fi o întoarcere de departe?”",
                            "verse 50:4": "Noi ştim ceea ce pământul înghite din ei, căci avem o Carte păstrătoare.",
                            "verse 50:5": "Ba nu! Ei socotesc Adevărul minciună când vine la ei şi sunt în încurcătură.",
                            "verse 50:6": "Oare nu văd deasupra lor cerul cum l-am zidit şi l-am împodobit şi nici o crăpătură nu are?",
                            "verse 50:7": "Pământul! Noi l-am întins şi am aruncat pe el munţii, am făcut să crească pe el fiece soi de bucurie aducător,",
                            "verse 50:8": "ca prevedere şi amintire pentru fiece rob care se căieşte.",
                            "verse 50:9": "Noi facem să cadă din cer o apă binecuvântată cu care facem să crească grădini şi grâne de secerat,",
                            "verse 50:10": "precum şi curmalii falnici cu ciorchini bine rânduiţi",
                            "verse 50:11": "ca înzestrare a robilor noştri. Noi dăm astfel viaţă unui ţinut mort. Şi aşa va fi şi Ieşirea!",
                            "verse 50:12": "Şi alţii înaintea lor au hulit: poporul lui Noe, oamenii din Ar-Rass, tamudiţii,",
                            "verse 50:13": "adiţii, Faraon, fraţii lui Lot,",
                            "verse 50:14": "oamenii din Al-Aika, poporul lui Tubba’. Toţi i-au hulit pe trimişi şi atunci ameninţarea Mea s-a împlinit.",
                            "verse 50:15": "Oare Noi am obosit la creaţia dintâi? Ba nu! Ei stau însă la îndoială asupra unei noi creaţii!",
                            "verse 50:16": "Noi am creat omul şi ştim ispitele la care-l împinge sufletul său, căci Noi suntem mai aproape de el decât vena gâtului său.",
                            "verse 50:17": "Când cei doi trimişi la întâlnire se aşează de-a dreapta şi de-a stânga Sa,",
                            "verse 50:18": "el nu va rosti nici un cuvânt fără ca un păzitor să nu fie gata!",
                            "verse 50:19": "Beţia morţii aduce Adevărul de la care tu te-ai îndepărtat!",
                            "verse 50:20": "Când se va sufla în trâmbiţă, aceasta va fi Ziua Ameninţării!",
                            "verse 50:21": "Fiece suflet va veni cu un îmbolditor şi cu un martor.",
                            "verse 50:22": "Tu ai fost în nepăsare faţă de aceasta, însă Noi ţi-am dat la o parte vălul şi privirea ta este pătrunzătoare astăzi!",
                            "verse 50:23": "Însoţitorul său va zice: “Ceea ce am este gata!”",
                            "verse 50:24": "Aruncaţi-l, amândoi, în Gheenă pe fiece tăgăduitor încăpăţânat,",
                            "verse 50:25": "potrivnic al binelui, călcător de lege şi neîncrezător.",
                            "verse 50:26": "Aruncaţi-l în osânda cea înfricoşătoare pe cel care-I alătură lui Dumnezeu un alt dumnezeu!",
                            "verse 50:27": "Însoţitorul său va spune: “Domnul nostru! Nu eu l-am ticăloşit, ci el era deja într-o rătăcire adâncă.”",
                            "verse 50:28": "Dumnezeu va spune: “Nu vă certaţi înaintea Mea! Eu v-am trimis înainte ameninţarea!",
                            "verse 50:29": "La Mine, cuvântul nu se schimbă. Eu nu sunt nedrept cu robii Mei.”",
                            "verse 50:30": "În Ziua când vom spune Gheenei: “Te-ai umplut?”, ea va spune: “Mai sunt încă?”",
                            "verse 50:31": "Grădina va fi adusă nu departe de cei temători",
                            "verse 50:32": "“Aceasta este ceea ce vi s-a făgăduit, vouă, fiecăruia ce se întoarce (către Dumnezeu) şi Îi păzeşte (poruncile),",
                            "verse 50:33": "şi se teme de Milostivul în Taina Sa şi vine cu inima plecată.",
                            "verse 50:34": "Intraţi în pace: “Aceasta este Ziua veşniciei.”",
                            "verse 50:35": "Ei vor avea acolo ceea ce vor şi la Noi vor avea mai mult.",
                            "verse 50:36": "Câte leaturi am nimicit înaintea lor? Şi erau mult mai de temut decât ei. Străbateţi ţinuturile! Este oare vreun adăpost?",
                            "verse 50:37": "Întru aceasta este o amintire pentru cel care are o inimă, pentru cel care îşi apleacă urechea, pentru cel care mărturiseşte.",
                            "verse 50:38": "Noi am creat în şase zile cerurile, pământul şi ceea ce se află între ele, iar osteneala nu Ne-a ajuns!",
                            "verse 50:39": "Rabdă ceea ce spun! Preamăreşte lauda Domnului tău înainte de ivirea soarelui şi înainte de asfinţit!",
                            "verse 50:40": "Preamăreşte lauda Sa în noapte şi după rugăciuni!",
                            "verse 50:41": "Ascultă!... În Ziua când Chemătorul va chema dintr-un loc apropiat,",
                            "verse 50:42": "în Ziua când vor auzi Strigătul întru Adevăr, aceea va fi Ziua Ieşirii!",
                            "verse 50:43": "Noi suntem Cei care dăruim viaţa şi Cei care dăruim moartea. Întru Noi este devenirea.",
                            "verse 50:44": "În Ziua când pământul se va despica deasupra lor, vom face lesne adunarea.",
                            "verse 50:45": "Noi ştim mai bine ceea ce spun. Tu nu eşti asupra lor un despot. Adu-i aminte de Coran celui ce se teme de ameninţarea Mea!"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Ка–ф2166.В знак славного Корана.",
                            "verse 50:2": "Их удивило, что пришел к нимувещатель,Который был одним из них,И потому неверные сказали:«Какая удивительная вещь!",
                            "verse 50:3": "Когда умрем и станем прахом мы,(Ужель вернут нам жизнь опять)?Поистине, такой возврат далек(от пониманья)».",
                            "verse 50:4": "Известно Нам, какая доляОт них оторвана землей.У Нас та Книга, что хранит(Содеянное вами в жизни ближней),",
                            "verse 50:5": "Но отвергают Истину они,Когда она приходит к ним,И потому находятся в смятенье.",
                            "verse 50:6": "Ужель на небо над собой онине взглянут —Как Мы воздвигли и украсили егоИ нет в нем никаких изъянов?",
                            "verse 50:7": "На землю,Что (ковром) Мы постелили,И прочно горы возвели на ней,И в парах поросль прекраснуювзрастили",
                            "verse 50:8": "Для созерцанья праведным —В напоминанье тем,Кто к Богу (всей душою) обратился, —",
                            "verse 50:9": "Мы с неба льем благословенныйдождьИ с ним все злаки и садыпроизрастаем",
                            "verse 50:10": "И пальмы статныеС рядами густо восседающих плодов",
                            "verse 50:11": "В надел Господних слуг;И этим землю мертвую Мы к жизнивозвращаем, —Таков исход!",
                            "verse 50:12": "Еще до них считали ложью (СудныйДень)И люди Ну –ха,И обитатели Ар-Расса, и Саму –д,",
                            "verse 50:13": "И А–д, и Фараон, и братья Лута,",
                            "verse 50:14": "И обитатели Зеленой Рощи,И люди Тубба, — все ониПосланников Моих отвергли,И вот на них сбылось Моепредупреждение (о каре).",
                            "verse 50:15": "Ужель Мы так изнемогли в первичномсотворенье,Что их сомнения терзают касательнотворений новых?",
                            "verse 50:16": "Мы сотворили человека и ведаем,К каким намекам темнымвлечет его душа, —Ведь к человеку ближе Мы стоим,Чем вена югулярис2167.",
                            "verse 50:17": "(И помните):По праву и по леву сторону при васНаходятся два стража2168Для записи (поступков ваших).",
                            "verse 50:18": "И нет ни одного промолвленногослова,Что не отмечено приставленным2169к нему.",
                            "verse 50:19": "И (погружение в) бесчувственнуюсмерть, поистине, настанет, —А это то, чего вам так хотелосьизбежать!",
                            "verse 50:20": "Раздастся трубный глас:Настанет День, что был обещан.",
                            "verse 50:21": "И двинутся все души,И с каждою — погонщики свидетель2170.",
                            "verse 50:22": "(И прозвучит): «Ты в небреженииоб этом был;Теперь же сняли Мы покров с тебя,И острым стал твой взор сегодня».",
                            "verse 50:23": "И здесь собрат твой2171 скажет:«Здесь у меня готов отчет того,Что он свершил».",
                            "verse 50:24": "(И будет приговор):«В Огонь! В Огонь повергнутьвсякого негодного упрямца!",
                            "verse 50:25": "Кто добродетель запретилИ преступил дозволенные граниИ кто сомненья (средь собратьев) сеял",
                            "verse 50:26": "И измышлял других богов к Аллаху, —Предать его жестокой каре!»",
                            "verse 50:27": "И здесь собрат твой скажет:«Владыка наш! Я не склонял егок грехам —Он сам блуждал в невежествеглубоком!»",
                            "verse 50:28": "(Аллах) ответит:«В Моем присутствии не пререкайтесь,Я вам до этого послал предупрежденье,",
                            "verse 50:29": "И Мое Слово неизменно.И к Моим слугам никогда Яне позволюМалейшую несправедливость».",
                            "verse 50:30": "В тот ДеньМы Ад воспросим:«Сполна ль наполнен ты?»Ответит он:«А есть ли кто-нибудь еще?(Готов всегда принять я)».",
                            "verse 50:31": "И вот для праведных приближенбудет РайИ перестанет быть далеким.",
                            "verse 50:32": "(И голос прозвучит):«Вот то, что (в жизни ближней)Было обещано для тех,Кто (к Богу) обратился в искреннемсмиреньеИ соблюдал (Его заветы);",
                            "verse 50:33": "Для тех, кто Господа страшится втайнеИ свое сердце отдал в поклонение Ему.",
                            "verse 50:34": "Войдите с миром (в Рай),И пусть для вас День этотНачалом вечной жизни будет!»",
                            "verse 50:35": "И там они найдут все то, что пожелают,И нечто большее,Что восполняется присутствиемГосподним.",
                            "verse 50:36": "А сколько и до них Мы поколенийпогубили,Кто мощью их превосходил!И вот потом, в своих мытарствахпо земле,Смогли ль они найти себе упокоенье?",
                            "verse 50:37": "Здесь, истинно, (Господне)назидание — для тех,В ком разуменье есть, (чтобы его)услышать,Кто может осознать его и внять(Господнему призыву).",
                            "verse 50:38": "Мы сотворили небеса и землюИ все, что между ними,за шесть (небесных) дней2171а,И не коснулась Нас усталость.",
                            "verse 50:39": "С терпеньем отнесись к тому,что говорят они.Воздай хвалу АллахуИ в час предшествия восхода солнца,И в час предшествия его заката.",
                            "verse 50:40": "И ночью прославляй Его,И славь в послемолитвенныхраздумьях.",
                            "verse 50:41": "Прислушайся в тот День,Когда раздастся гласс близрасположенного места.",
                            "verse 50:42": "В тот День,Когда они, воистину, услышат вскрик,И День наступит Воскресенья.",
                            "verse 50:43": "Поистине, лишь Мы даруем жизньи смерть,И к Нам ведет последний ваш приход.",
                            "verse 50:44": "В тот День,Когда расколется земля,Людей спешащих (на поверхностьизвергая), —Такое собирание (людей)Совсем труда Нам не составит.",
                            "verse 50:45": "Мы знаем лучше все их разговоры2172,Но ты, (о Мухаммад!), не тот,Кто должен принуждать их (к вере).А потому ты увещай Кораномтолько тех,Кто устрашается Моихпредупреждений."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "q. ¡Por el glorioso Corán!",
                            "verse 50:2": "Pero se asombran de que uno salido de ellos haya venido a advertirles. Y dicen los infieles: «¡Esto es algo asombroso!",
                            "verse 50:3": "¿Es que cuando muramos y seamos tierra...? Es volver de lejos...»",
                            "verse 50:4": "Ya sabemos qué es lo que de ellos consume la tierra. Tenemos una Escritura que conserva.",
                            "verse 50:5": "Pero han desmentido la Verdad cuando ha venido a ellos y se encuentran en un estado de confusión.",
                            "verse 50:6": "¿No ven el cielo que tienen encima, cómo lo hemos edificado y engalanado y no se ha agrietado?",
                            "verse 50:7": "Hemos extendido la tierra, colocado en ella firmes montañas y hecho crecer en ella toda especie primorosa,",
                            "verse 50:8": "como ilustración y amonestación para todo siervo arrepentido.",
                            "verse 50:9": "Hemos hecho bajar del cielo agua bendita, mediante la cual hacemos que crezcan jardines y el grano de la cosecha,",
                            "verse 50:10": "esbeltas palmeras de apretados racimos,",
                            "verse 50:11": "para sustento de los siervos. Y, gracias a ella, devolvemos la vida a un país muerto. Así será la Resurrección.",
                            "verse 50:12": "Antes de ello, ya habían desmentido el pueblo de Noé, los habitantes de ar-Ras, los tamudeos,",
                            "verse 50:13": "los aditas, Faraón, los hermanos de Lot,",
                            "verse 50:14": "los habitantes de la Espesura y el pueblo de Tubba. Todos ellos desmintieron a los enviados. Y se cumplió Mi amenaza.",
                            "verse 50:15": "¿Es que Nos cansó la primera creación? Pues ellos dudan de una nueva creación.",
                            "verse 50:16": "Sí, hemos creado al hombre. Sabemos lo que su mente le sugiere. Estamos más cerca de él que su misma vena yugular.",
                            "verse 50:17": "Cuando los dos encargados de recoger recojan, sentados el uno a la derecha y el otro a la izquierda,",
                            "verse 50:18": "no pronunciará ninguna palabra que no tenga siempre a su lado a un observador preparado.",
                            "verse 50:19": "La agonía del moribundo traerá la Verdad: «¡Ahí tienes lo que rehuías!»",
                            "verse 50:20": "Se tocará la trompeta. Ése es el día de la Amenaza.",
                            "verse 50:21": "Cada uno vendrá acompañado de un conductor y de un testigo.",
                            "verse 50:22": "«Estas cosas te traían sin cuidado. Te hemos quitado el velo y, hoy, tu vista es penetrante».",
                            "verse 50:23": "Su compañero dirá: «Esto es lo que tengo preparado».",
                            "verse 50:24": "«¡Arrojad a la gehena a todo infiel pertinaz, desviado,",
                            "verse 50:25": "adversario del bien, violador de la ley, escéptico,",
                            "verse 50:26": "que ponía, junto con Alá, a otro dios! ¡Arrojadlo al castigo severo!»",
                            "verse 50:27": "Su compañero dirá: «¡Señor! No soy yo quien le hizo rebelarse, sino que él estaba ya profundamente extraviado».",
                            "verse 50:28": "Dirá: «¡No discutáis ante Mí! Ya os amenacé por anticipado.",
                            "verse 50:29": "Mi sentencia es inmutable. Yo no soy injusto con Mis siervos».",
                            "verse 50:30": "El día que digamos a la gehena: «¿Estás ya llena?», ella dirá: «¿Aún hay más?»",
                            "verse 50:31": "Y el Jardín será acercado a quienes hayan temido a Alá, bien cerca:",
                            "verse 50:32": "«Esto es lo que se os había prometido, a todo hombre sinceramente arrepentido, observador,",
                            "verse 50:33": "que tiene miedo secreto al Compasivo y viene con corazón contrito.",
                            "verse 50:34": "¡Entrad en él en paz! ¡Éste es el día de la Eternidad!»",
                            "verse 50:35": "Tendrán allí cuanto deseen y aún dispondremos de más.",
                            "verse 50:36": "¡A cuántas generaciones hemos hecho antes perecer, más temibles que ellos y que recorrieron el país en busca de escape.",
                            "verse 50:37": "Hay en ello, sí, una amonestación para quien tiene entendimiento, para quien aguza el oído y es testigo.",
                            "verse 50:38": "Creamos los cielos, la tierra y lo que entre ellos está en seis días, sin sufrir cansancio.",
                            "verse 50:39": "¡Ten paciencia, pues, con lo que dicen y celebra las alabanzas de tu Señor antes de la salida del sol y de su puesta!",
                            "verse 50:40": "¡Glorifícale durante la noche y después de la azalá!",
                            "verse 50:41": "¡Estate atento al día que el pregonero llame de cerca,",
                            "verse 50:42": "al día que se oiga, de verdad, el Grito! Ése será el día de la Resurrección.",
                            "verse 50:43": "Somos Nosotros Quienes damos la vida y damos la muerte. Somos Nosotros el fin de todo.",
                            "verse 50:44": "El día que la tierra se abra despidiéndolos, rápidos..., Ésa es una reunión fácil para Nosotros.",
                            "verse 50:45": "Sabemos bien lo que dicen... ¡No debes tú forzarles! ¡Amonesta, más bien, por el Corán a quien tema Mi amenaza!"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "காஃப், கண்ணியமிக்க இக் குர்ஆன் மீது சத்தியமாக!",
                            "verse 50:2": "எனினும்; அவர்களிலிருந்தே, அவர்களுக்கு அச்சமூட்டி எச்சரிக்கை செய்யும் ஒருவர் வந்ததைப் பற்றி அவர்கள் ஆச்சரியப்படுகின்றனர்; ஆகவே, காஃபிர்கள் கூறுகிறார்கள்; \"இது ஓர் ஆச்சரியமான விஷயமேயாகும்.\"",
                            "verse 50:3": "\"நாம் மரணமடைந்து மண்ணாகி விட்டாலு(ம் உயிர் கொடுத்து எழுப்பப்படுவோ)மா? இப்படி மீள்வது (சாத்தியமில்லாத) தொலைவானது\" (என்றும் அவர்கள் கூறுகின்றனர்).",
                            "verse 50:4": "(மரணத்திற்குப் பின்) அவர்களிலிருந்து (அவர்கள் உடலை) பூமி எந்த அளவு குறைத்திருக்கின்றதோ அதைத் திட்டமாக நாம் அறிந்திருக்கின்றோம்; நம்மிடம் (யாவும் பதிக்கப் பெற்று) பாதுகாக்கப்பட்ட ஏடு இருக்கிறது.",
                            "verse 50:5": "இருப்பினும், சத்திய (வேத)த்தை -அது தம்மிடம் வந்த போது பொய்ப்பிக்(க முற்படு)கிறார்கள்; அதனால், அவர்கள் குழப்பமான நிலையிலேயே இருக்கின்றனர்.",
                            "verse 50:6": "அவர்களுக்கு மேலிருக்கும் வானத்தை நாம் எவ்வாறு அதை (ஒரு கட்டுக் கோப்பாக) அமைத்து, அதை அழகு செய்து, அதில் எவ்வித வெடிப்புகளும் இல்லாமல் (ஆக்கியிருக்கின்றோம்) என்பதை அவர்கள் பார்க்கவில்லையா?",
                            "verse 50:7": "மேலும் நாம் பூமியை நீட்டி விரிவாக்கி, அதில் உறுதியான மலைகளை அதை;துள்ளோம்; மேலும் அதில் அழகிய புற்பூண்டுகளை (ஆண், பெண் வகையுள்ள) ஜோடியாக முளைப்பிக்கவும் செய்திருக்கின்றோம்.",
                            "verse 50:8": "(இது இறைவன் பக்கம்) திரும்பும் அடியார்கள் எல்லோருக்கும் (அகப்) பார்வை அளிப்பதாகவும், (நினைவூட்டும்) நல்லுபதேசமாகவும் உள்ளது.",
                            "verse 50:9": "அன்றியும், வானத்திலிருந்து மிக்க பாக்கியமுள்ள தண்ணீரை (மழையை) நாம் இறக்கி வைத்து, அதைக் கொண்டு தோட்டங்களையும், அறுவடை செய்யப்படும் தானியங்களையும் முளைப்பிக்கிறோம்.",
                            "verse 50:10": "அடுக்கடுக்கான பாளைகளைக் கொண்ட (குலைகளையுடைய) நெடிய பேரீச்ச மரங்களையும் (உண்டாக்கினோம்).",
                            "verse 50:11": "(அவற்றின் கனிகளை) அடியார்களுக்கு உணவாக (அளிக்கிறோம்), மேலும், அதைக் கொண்டு இறந்து கிடந்த ஊரை (பூமியை) நாம் உயிர்ப்பிக்கிறோம், இவ்விதமே, (இறந்தவர்கள் உயிர்ப்பிக்கப் பெற்று) வெளியேறுதலும் இருக்கிறது.",
                            "verse 50:12": "இவர்களுக்கு முன்னர் இருந்த நூஹுடைய சமூகத்தாரும், ரஸ்ஸு (கிணற்று) வாசிகளும், ஸமூது மக்களும் (இவ்வாறு மறுமையை) மறுத்தார்கள்.",
                            "verse 50:13": "'ஆது' (சமூகத்தாரும்) ஃபிர்அவ்னும் லூத்தின் சகோதரர்களும் (மறுத்தனர்).",
                            "verse 50:14": "(அவ்வாறே மத்யன்) தோப்புவாசிகளும், துப்பவுடைய கூட்டத்தாரும் ஆக எல்லோரும் (நம்) தூதர்களைப் பொய்ப்பிக்க முற்பட்டனர்; எனவே (அவர்களைப் பற்றிய) என்னுடைய எச்சரிக்கை உண்மையாயிற்று.",
                            "verse 50:15": "எனவே, (எல்லாவற்றையும்) முதலாவதாகப் படைப்பதில் நாம் சோர்வடைந்து விட்டோமா? இல்லை. எனினும், இ(க்காஃபிரான)வர்கள் (நாம்) புதிதாக படைப்பதைப் பற்றி சந்தேகத்தில் இருக்கின்றனர்.",
                            "verse 50:16": "மேலும் நிச்சயமாக நாம் மனிதனைப் படைத்தோம், அவன் மனம் அவனிடம் என்ன பேசுகிறது என்பதையும் நாம் அறிவோம்; அன்றியும், (அவன்) பிடரி(யிலுள்ள உயிர்) நரம்பை விட நாம் அவனுக்கு சமீபமாகவே இருக்கின்றோம்.",
                            "verse 50:17": "(மனிதனின்) வலப்புறத்திலும், இடப்புறத்திலும் அமர்ந்து எடுத்தெழுதும் இரு(வான)வர் எடுத்தெழுதும் போது-",
                            "verse 50:18": "கண்காணித்து எழுதக்கூடியவர் அவனிடம் (மனிதனிடம்) இல்லாமல் எந்த சொல்லையும் அவன் மொழிவதில்லை.",
                            "verse 50:19": "மரண வேதனை சத்தியத்தைக் கொண்டு (மெய்யாகவே) வருகின்றது (அப்போது அவனிடம்) எதை விட்டும் விரண்டோடிக் கொண்டிருந்தாயோ அது தான் (இந்நிலை என்று கூறப்படும்)",
                            "verse 50:20": "மேலும் ஸூர் (எக்காளம்) ஊதப்படும். அதுதான் அச்சறுத்தி எச்சரிக்கப்பட்ட நாளாகும்.",
                            "verse 50:21": "அன்றியும், (அந்நாளில்) ஒவ்வோர் ஆன்மாவும் தன்னை அழைத்து வருபவர், சாட்சியாளர் ஆகியோருடன் வரும்.",
                            "verse 50:22": "\"நீ இதைப் பற்றி அலட்சியத்தில் இருந்தாய்; (இப்பொழுது) உன் (பார்வையை) விட்டு உனது திரையை நாம் அகற்றி விட்டோம். எனவே, இன்று உன் பார்வை கூர்மையாக இருக்கிறது.\" (என்று கூறப்படும்).",
                            "verse 50:23": "அப்போது அவனுடன் இருப்பவர் (மலக்கு) \"இதோ (இம்மனிதனின் ஏடு) என்னிடம் சித்தமாக இருக்கிறது\" என்று கூறுவார்.",
                            "verse 50:24": "\"மனமுரண்டாக நிராகரித்துக் கொண்டிருந்தோர் எல்லோரையும் நீங்கள் இருவரும் நரகில் போடுங்கள்.",
                            "verse 50:25": "\"(அவன்) நன்மையை தடுத்துக் கொண்டேயிருந்தவன்; (இந்நாளைப் பற்றி) சந்தேகிப்பவனாக, வரம்பு மீறிக் கொண்டும் இருந்தான்.",
                            "verse 50:26": "ஆகவே நீங்களிருவரும் இவனை மிகக் கடுமையான வேதனையில் போட்டு விடுங்கள்\" (என்றுங் கூறப்படும்).",
                            "verse 50:27": "(அப்போது ஷைத்தானாகிய) அவனுடைய கூட்டாளி கூறுவான்; \"எங்கள் இறைவா! நான் இவனை வழி கெடுக்கவில்லை ஆனால், அவனே தூரமான வழி கேட்டில் தான் இருந்தான்-\"",
                            "verse 50:28": "\"என் முன்னிலையில் நீங்கள் வாக்குவாதம் செய்யாதீர்கள்; (இதைப்பற்றி என் அச்சுறுத்தலை முன்னரே விடுத்திருக்கிறேன்\" என்று (அல்லாஹ்) கூறுவான்.",
                            "verse 50:29": "(எனவே என்னுடைய) அச்சொல் \"என்னிடத்தில் மாற்றப்படுவதில்லை - நான் அடியார்களுக்கு அநியாயம் செய்பவனல்லன்\" (என்றும் அல்லாஹ் கூறுவான்).",
                            "verse 50:30": "நரகத்தை நோக்கி, \"நீ நிறைந்து விட்டாயா? என்று நாம் கேட்டு, அதற்கு அது \"இன்னும் அதிகமாக ஏதும் இருக்கின்றதா?\" என்று கேட்கும் அந்நாளை (நபியே! நீர் நினைவுறுத்துவீராக)!",
                            "verse 50:31": "(அன்றியும் அந்நாளில்) பயபக்தியுடையவர்களுக்கு சுவர்க்கம் தொலைவில்லாத நிலையில் மிகவும் சமீபமாக்கப்படும்.",
                            "verse 50:32": "\"இது தான் உங்களுக்கு வாக்களிக்கப்பட்டதா(ன சுவர்க்கமா)கும்; எப்பொழுதும் இறைவனையே நோக்கி, (பாவத்தை தவிர்த்துப்) பேணி நடந்த ஒவ்வொருவருக்கும் (இது உரியது).\"",
                            "verse 50:33": "எவர்கள், மறைவிலும் அர்ரஹ்மானை அஞ்சி நடந்து கொண்டிருக்கிறார்களோ அவர்களுக்கும் (அவனையே) முற்றிலும் நோக்கிய இதயத்துடன் வருவோருக்கும் (இது வாக்களிக்கப்பட்டிருக்கிறது).",
                            "verse 50:34": "\"ஸலாமுடன் - சாந்தியுடன் - இ(ச் சுவர்க்கத்)தில் பிரவேசியுங்கள்; இதுதான் நித்தியமாக நீங்க்ள தங்கியிருக்கும் நாளாகும்\" (என்று கூறப்படும்).",
                            "verse 50:35": "அவர்கள் விரும்பியதெல்லாம், அதில் அவர்களுக்கு இருக்கிறது இன்னும் (அதற்கு) அதிகமும் நம்மிடம் இருக்கிறது.",
                            "verse 50:36": "அன்றியும், (நிராகரிப்போரான) அவர்களைவிட பலசாளிகளாக இருந்த எத்தனையோ தலைமுறையினரை அவர்களுக்கு முன்னர் நாம் அழித்திருக்கின்றோம்; அவர்கள் (அழிவிலிருந்து தப்பித்துக் கொள்ள) பல ஊர்களிலிரும் (துளைத்துச்) சென்றனர்; ஆனால் அவர்கள் தப்பித்துக் கொள்ள புகலிடம் இருந்ததா?",
                            "verse 50:37": "எவருக்கு (நல்ல) இதயம் இருக்கிறதோ, அல்லது எவர் ஓர்மையுடன் செவிதாழ்த்திக் கேட்கிறாரோ அ(த்தகைய)வருக்கு நிச்சயமாக இதில் நினைவுறுத்தலும் (படிப்பினையும்) இருக்கிறது.",
                            "verse 50:38": "நிச்சயமாக நாம் தாம் வானங்களையும், பூமியையும் அவ்விரண்டிற்குமிடையே உள்ளவற்றையும் ஆறு நாட்களில் படைத்தோம்; (அதனால்) எத்தகைய களைப்பும் நம்மைத் தீண்டவில்லை.",
                            "verse 50:39": "எனவே (நபியே!) அவர்கள் கூறுவதைப் பற்றிப் பொறுமையோடிருப்பீராக இன்னும், சூரிய உதயத்திற்கு முன்னரும், (அது) அஸ்தமிப்பதற்கு முன்னரும் உம்முடைய இறைவனின் புகழைக் கொண்டு நீர் தஸ்பீஹு செய்வீராக.",
                            "verse 50:40": "இன்னும் இரவிலிருந்தும், ஸுஜூதுக்குப் பின்னரும் அவனைத் தஸ்பீஹு செய்வீராக.",
                            "verse 50:41": "மேலும், சமீபமான இடத்திலிருந்து கூவி அழைப்பவர் அழைக்கும் நாளை(ப் பற்றி நபியே!) நீர் செவிமடுப்பீராக.",
                            "verse 50:42": "அந்நாளில், உண்மையைக் கொண்டு ஒலிக்கும் பெரும் சப்தத்தை அவர்கள் கேட்பார்கள். அதுதான் (மரித்தோர்) வெளியேறும் நாளாகும்.",
                            "verse 50:43": "நிச்சயமாக நாமே உயிர் கொடுக்கிறோம்; நாமே மரிக்கும்படிச் செய்கிறோம் - அன்றியும் நம்மிடமே (எல்லோரும்) மீண்டு வர வேண்டியிருக்கிறது.",
                            "verse 50:44": "பூமி பிளந்து, அவர்கள் வேகமாக (வெளியே) வரும் நாள்; இவ்வாறு (அவர்களை) ஒன்று சேர்ப்பது நமக்கு எளிதானதாகும்.",
                            "verse 50:45": "அவர்கள் கூறுவதை நாம் நன்கறிவோம் - நீர் அவர்கள் மீது நிர்ப்பந்தம் செய்பவரல்லர், ஆகவே (நம்) அச்சுறுத்தலை பயப்படுவோருக்கு, இந்த குர்ஆனை கொண்டு நல்லபதேசம் செய்வீராக."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "ก็อฟ ขอสาบานด้วยอัลกุรอานอันทรงเกียรติ",
                            "verse 50:2": "แต่ว่าพวกเขาประหลาดใจที่มีผู้ตักเตือนคนหนึ่งจากหมู่พวกเขามายังพวกเขา ดังนั้นพวกปฏิเสธศรัทธาจึงกล่าวว่า นี่มันเป็นเรื่องประหลาดจริง ๆ",
                            "verse 50:3": "เมื่อเราตายและกลายเป็นฝุ่นดินไปแล้ว จะกลับมีชีวิตอีกกระนั้นหรือ? นั่นเป็นการกลับที่ไกลเหลือเกิน",
                            "verse 50:4": "แน่นอนเรารู้ดีว่า กี่มากน้อยแล้วที่แผ่นดินทำให้พวกเขามีจำนวนลดน้อยลง และ ณ ที่เรานั้นมีบันทึกรักษาไว้",
                            "verse 50:5": "เปล่าเลย! พวกเขาปฏิเสธความจริงต่างหาก เมื่อมันได้มีมายังพวกเขา ดังนั้นพวกเขาจึงอยู่ในภาวะที่สับสน",
                            "verse 50:6": "พวกเขามิได้มองไปยังฟากฟ้าเหนือพวกเขาดอกหรือ ว่าเราได้สร้างมันและประดับมันไว้อย่างไร และมันไม่มีรอยร้าวหรือช่องโหว่เลย",
                            "verse 50:7": "และแผ่นดินนั้นเราได้แผ่ให้มันกว้างออกไปและในแผ่นดินเราได้ปักภูเขาไว้อย่างมั่นคง และในแผ่นดินนั้นเราให้พฤกษชาติทุกชนิดงอกเงยออกมาเป็นคู่ ๆ อย่างสวยงาม",
                            "verse 50:8": "เพื่อให้เป็นที่สังเกตและเป็นการเตือนให้รำลึกแก่บ่าวทุกคนผู้สำนึกผิด",
                            "verse 50:9": "และเราได้ให้น้ำฝนหลั่งลงมาจากฟากฟ้าเป็นที่จำเริญแล้วด้วยน้ำนั้น เราได้ให้งอกเงยออกมาเป็นสวนอันหลากหลาย และเมล็ดพืชสำหรับเก็บเกี่ยว",
                            "verse 50:10": "และต้นอินทผลัม อย่างสูงตระหง่าน ลำต้นของมันมีพวงย้อยลงมามีผลซ้อนกันเป็นตับ",
                            "verse 50:11": "เพื่อเป็นปัจจัยยังชีพแก่ปวงบ่าว และด้วยน้ำนั้นเราทำให้ดินแดนที่แห้งแล้งมีชีวิตชีวาขึ้นใหม่ เช่นนั้นแหละการฟื้นคืนชีพ",
                            "verse 50:12": "หมู่ชนของนูหได้ปฏิเสธมาก่อนหน้าพวกเขาแล้ว และชาวร็อส (บ่อน้ำ) และษะมูด",
                            "verse 50:13": "และอ๊าด และฟิรเอาน์:และพี่น้องของลู๊ฎ",
                            "verse 50:14": "และชาวป่าทึบ และหมู่ชนของตุ๊บบะอ:พวกเหล่านั้นทั้งหมดได้ปฏิเสธบรรดาร่อซู้ล ดังนั้นสัญญาของเราจึงเหมาะสมคู่ควรแก่พวกเขา",
                            "verse 50:15": "เราได้เหน็ดเหนื่อยต่อการสร้างครั้งแรกกระนั้นหรือ? เปล่าเลย! แต่ว่าพวกเขาอยู่ในการสงสัยต่อการสร้างครั้งใหม่ต่างหาก",
                            "verse 50:16": "และโดยแน่นอน เราได้บังเกิดมนุษย์มา และเรารู้ดียิ่งที่จิตใจของเขากระซิบกระซาบแก่เขา และเรานั้นใกล้ชิดเขายิ่งกว่าเส้นเลือดชีวิตของเขาเสียอีก",
                            "verse 50:17": "จงรำลึกขณะที่มาะลาอิกะฮ์ผู้บันทึกสองท่านบันทึก ท่านหนึ่งนั่งทางข้างขวา และอีกท่านหนึ่งนั่งทางข้างซ้าย",
                            "verse 50:18": "ไม่มีคำพูดคำใดที่เขากล่าวออกมา เว้นแต่ใกล้ ๆ เขานั้นมี (มะลัก) ผู้เฝ้าติดตาม ผู้เตรียมพร้อม (ที่จะบันทึก)",
                            "verse 50:19": "และอาการมึนงงแห่งความตายได้ปรากฏขึ้นอย่างประจักษ์แจ้ง และนั่นคือสิ่งที่เจ้าจะหลีกเลี่ยงจากมันไปไม่ได้",
                            "verse 50:20": "และสังข์จะถูกเป่าขึ้น นั่นคือวันแห่งการสัญญา",
                            "verse 50:21": "และทุก ๆชีวิตจะมาพร้อมกับเขาคือมะลักผู้นำทาง และมะลักผู้เป็นพยาน",
                            "verse 50:22": "โดยแน่นอนเจ้าไม่สนใจต่อเรื่องนี้ นั้นเราจึงเปิดสิ่งที่ปกคลุมเจ้าอยู่ให้ออกไปจากเจ้า วันนี้สายตาของเจ้าจึงเฉียบขาด",
                            "verse 50:23": "มะลักผู้ถูกมอบหมายกล่าวว่า นี่คือสิ่งที่เตรียมไว้อยู่ที่ข้าพระองค์",
                            "verse 50:24": "เจ้าทั้งสองจงโยนทุกคนที่ปฏิเสธศรัทธา และดื้อรั้น",
                            "verse 50:25": "ผู้ขัดขวางการทำดี ผู้ฝ่าฝืน ผู้สงสัย",
                            "verse 50:26": "ซึ่งตั้งพระเจ้าอื่นใดคู่เคียงกับอัลลอฮ์ดังนั้นเจ้าทั้งสองจงโยนเขาสู่การลงโทษอันสาหัส",
                            "verse 50:27": "(ชัยตอน) สหายของเขากล่าวว่า ข้าแต่พระเจ้าของเรา ข้าพระองค์มิได้ทำให้เขาหลงผิดดอกแต่ทว่าเขาได้อยู่ในการหลงผิดมาก่อนแล้ว",
                            "verse 50:28": "พระองค์ตรัสว่า พวกเจ้าอย่ามาโต้เถียงต่อหน้าข้าเลย และแน่นอนข้าได้เตือนพวกเจ้าก่อนหน้านี้แล้ว",
                            "verse 50:29": "พระดำรัสของข้า จะไม่ถูกเปลี่ยนแปลง ณ บัดนี้ และข้าก็มิได้เป็นผู้ยุติธรรมต่อปวงบ่าวของข้าเลย",
                            "verse 50:30": "วันซึ่งเราจะกล่าวแก่นรกญะฮันนัมว่า เจ้าเต็มแล้วหรือ และมันจะกล่าวว่า ยังมีเพิ่มอีกไหม",
                            "verse 50:31": "และสวนสวรรค์ก็ถูกนำให้มาใกล้แก่บรรดาผู้ยำเกรงมันมิได้อยู่ไกลเลย",
                            "verse 50:32": "นี่คือสิ่งที่พวกเจ้าได้ถูกสัญญาไว้สำหรับทุกคนที่สำนึกผิด (หันหน้าเข้าหาอัลลอฮ์) ผู้รักษาบัญญัติ (ของอัลลอฮ์)",
                            "verse 50:33": "ผู้ที่เกรงกลัวพระผู้ทรงกรุณาปรานีโดยทางลับ และมาหา (พระองค์) ด้วยจิตใจที่สำนึกผิดกลับเนื้อกลับตัว",
                            "verse 50:34": "พวกเจ้าจงเข้าไปในสวนสวรรค์ด้วยความศานติ นั่นคือวันแห่งการพำนักอยู่ตลอดกาล",
                            "verse 50:35": "สำหรับพวกเขาจะได้รับสิ่งที่พวกเขาพึงประสงค์ในสวนสวรรค์ และ ณที่เรานั้นยังมีอีกมากมาย",
                            "verse 50:36": "เราได้ทำลายผู้คนไปกี่มากน้อยแล้วก่อนหน้าพวกเขาทั้ง ๆ ที่เขาทั้งหลายมีความเข้มแข็งทางสมรรถภาพกว่าพวกเจ้า แล้วพวกเขาได้ออกเดินทางไปตามเมืองต่าง ๆ (พวกเขาเหล่านั้น) มีทางหนีรอดหรือ?",
                            "verse 50:37": "แท้จริงในการนั้น แน่นอนย่อมเป็นข้อตักเตือนแก่ผู้มีหัวใจ หรือรับฟังโดยที่เขามีความตั้งใจจริง",
                            "verse 50:38": "และโดนแน่นอน เราได้สร้างชั้นฟ้าทั้งหลายและแผ่นดิน และสิ่งที่อยู่ระหว่างมันทั้งสองในเวลา 6 วัน และไม่มีความเหน็ดเหนื่อยใด ๆ มาสัมผัสเรา",
                            "verse 50:39": "ดังนั้น เจ้าจงอดทนต่อสิ่งที่พวกเขากล่าวถึง และจงแซ่ซ้องด้วยการสรรเสริญพระเจ้าของเจ้าก่อนการขึ้นของดวงอาทิตย์และก่อนการตก (ของมัน)",
                            "verse 50:40": "และระหว่างเวลากลางคืน ก็จงสดุดีพระองค์ด้วย และหลังเวลาสุญูด",
                            "verse 50:41": "และเจ้าจงฟังวันที่ผู้เรียกร้องจะร้องเรียกจากสถานที่ใกล้ๆ",
                            "verse 50:42": "วันที่พวกเขาจะได้ยินเสียงเป่าสังข์อย่างแท้จริง นั่นคือวันแห่งการฟื้นคืนชีพ",
                            "verse 50:43": "เรารู้ดียิ่งในสิ่งที่พวกเขากล่าว และเราเป็นผู้ให้ (เขา) ตายและยังเราคือการกลับไป",
                            "verse 50:44": "วันที่แผ่นดินจะแยกออกจากพวกเขา (และพวกเขาจะ) ออกมาอย่างรีบเร่ง นั่นการชุมนุมที่ง่ายดายแก่เรา",
                            "verse 50:45": "เรารู้ดียิ่งถึงสิ่งที่พวกเขากล่าว และเจ้ามิได้เป็นผู้ทรงมีอำนาจเหนือพวกเขา ดังนั้นเจ้าจงตักเตือนด้วยอัลกุรอานนี้แก่ผู้กลัวต่อสัญญาร้ายของข้า"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Kaf. Şerefli Kur'an'a andolsun.",
                            "verse 50:2": "Aralarından bir uyarıcının gelmesine şaştılar da, kâfirler şöyle dediler: \"Bu şaşılacak bir şeydir.\"",
                            "verse 50:3": "\"Biz öldüğümüz ve toprak olduğumuz zaman mı (dirileceğiz)? Bu, akla uzak bir dönüştür.\"",
                            "verse 50:4": "Biz, toprağın onlardan neleri eksilttiğini kesinlikle bilmekteyiz. Yanımızda o bilgileri koruyan bir kitap vardır.",
                            "verse 50:5": "Bilakis onlar, hak kendilerine gelince yalanladılar. Şimdi onlar şaşırmış bir haldedirler.",
                            "verse 50:6": "Üstlerindeki göğe bakmazlar mı ki, onu nasıl bina etmiş ve nasıl donatmışız! Onda hiçbir çatlak da yok.",
                            "verse 50:7": "Yeryüzünü de döşedik ve ona sabit dağlar koyduk. Orada gönül açan her türden (bitkiler) yetiştirdik.",
                            "verse 50:8": "Allah'a yönelen her kula gönül gözünü açmak ve ibret vermek için (bütün bunları yaptık).",
                            "verse 50:9": "Gökten bereketli bir su indirdik, onunla bahçeler ve biçilecek daneler bitirdik.",
                            "verse 50:10": "Kullara rızık olması için birbirine girmiş, küme küme tomurcukları olan uzun boylu hurma ağaçları yetiştirdik. Ve o su ile ölü toprağa can verdik. İşte hayata yeniden çıkış da böyledir.",
                            "verse 50:11": "Kullara rızık olması için birbirine girmiş, küme küme tomurcukları olan uzun boylu hurma ağaçları yetiştirdik. Ve o su ile ölü toprağa can verdik. İşte hayata yeniden çıkış da böyledir.",
                            "verse 50:12": "Onlardan önce Nuh kavmi, Res halkı ve Semûd da yalanlamıştı.",
                            "verse 50:13": "Ad ve Firavun ile Lût'un kardeşleri de (yalanladılar).",
                            "verse 50:14": "Eyke halkı ve Tübba' kavmi de. Bütün bunlar peygamberleri yalanladılar da tehdidim gerçekleşti!",
                            "verse 50:15": "İlk yaratmada âcizlik mi gösterdik? Hayır, onlar yeni bir yaratma hususunda şüphe içindedirler.",
                            "verse 50:16": "Andolsun, insanı biz yarattık ve nefsinin kendisine fısıldadıklarını biliriz ve biz ona şah damarından daha yakınız.",
                            "verse 50:17": "İki melek (insanın) sağında ve solunda oturarak yaptıklarını yazmaktadırlar.",
                            "verse 50:18": "İnsan hiçbir söz söylemez ki, yanında gözetleyen yazmaya hazır bir melek bulunmasın.",
                            "verse 50:19": "Ölüm sarhoşluğu gerçekten gelir de: İşte (ey insan) bu, senin öteden beri kaçtığın şeydir, denir.",
                            "verse 50:20": "Sûr'a üfürülür; işte bu, geleceği vâdedilen gündür.",
                            "verse 50:21": "Herkes, yanında bir sürücü ve bir de şahitle beraber gelir.",
                            "verse 50:22": "Andolsun sen bundan gaflette idin; derhal biz senin perdeni kaldırdık. Bugün artık gözün keskindir (denir).",
                            "verse 50:23": "Yanındaki arkadaşı: \"İşte yanımdaki hazır\" dedi.",
                            "verse 50:24": "[50.24](İki meleğe şu emir verilir:) \"Haydi ikiniz her inatçı kâfiri, cehenneme atın!\"",
                            "verse 50:25": "[50.25]\"Hayra bütün gücüyle engel olanı, azgın şüpheciyi\"",
                            "verse 50:26": "[50.26]\"O ki Allah ile beraber başka ilâh edindi,bundan dolayı onu şiddetli azaba birlikte atın!\"",
                            "verse 50:27": "Müşrikin arkadaşı (şeytan) der ki: Rabbimiz! Ben onu azdırmadım. Fakat kendisi derin bir sapıklık içindeydi.",
                            "verse 50:28": "O esnada (Allah) buyurur: Huzurumda çekişmeyin! Ben size daha önce uyarı göndermiştim!",
                            "verse 50:29": "Benim huzurumda söz değiştirilmez ve ben kullara asla zulmedici değilim.",
                            "verse 50:30": "O gün cehenneme \"Doldun mu?\" deriz. O da \"Daha var mı?\" der.",
                            "verse 50:31": "Cennet de takvâ sahiplerine yaklaştırılır; (onlardan) uzakta olmayacaktır.",
                            "verse 50:32": "İşte size vâdedilen cennet! Ki o, daima Allah'a yönelen,(O'nun buyruklarını)koruyan,",
                            "verse 50:33": "Görmeden Rahmân'a saygı gösteren ve(Allah'a) dönük bir kalp getiren herkesin (mükâfatı budur).",
                            "verse 50:34": "Oraya selâmetle girin. İşte bu, ebedî yaşamanın başladığı gündür",
                            "verse 50:35": "Orada kendileri için diledikleri her şey vardır. Katımızda dahası da vardır.",
                            "verse 50:36": "Biz, onlardan önce kendilerinden daha güçlü olan, diyar diyar dolaşan nice nesilleri helâk etmişizdir. Kurtuluş var mı!",
                            "verse 50:37": "Şüphesiz ki bunda aklı olan veya hazır bulunup kulak veren kimseler için bir öğüt vardır.",
                            "verse 50:38": "Andolsun biz, gökleri, yeri ve ikisi arasında bulunanları altı günde yarattık. Bize hiçbir yorgunluk çökmedi.",
                            "verse 50:39": "(Resûlüm!) Onların dediklerine sabret. Güneşin doğuşundan önce de, batışından önce de Rabbini hamd ile tesbih et.",
                            "verse 50:40": "Gecenin bir bölümünde ve secdelerin ardından da O'nu tesbih et.",
                            "verse 50:41": "Seslenenin yakın bir yerden sesleneceği güne kulak ver.",
                            "verse 50:42": "O gün insanlar bu sesi gerçekten işiteceklerdir. İşte bu, çıkış günüdür.",
                            "verse 50:43": "Şüphesiz biz diriltir ve öldürürüz. Dönüş de ancak bizedir.",
                            "verse 50:44": "O gün yer yarılır, onların üzerinden süratle yarılıp açılır. Bu, bize göre kolay olan bir haşirdir.",
                            "verse 50:45": "Biz onların dediklerini çok iyi biliriz. Sen onların üzerinde bir zorlayıcı değilsin. Tehdidimden korkanlara Kur'an’ la öğüt ver."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 50:1": "Қоф. Улуғ Қуръон ила қасам.",
                            "verse 50:2": "Балки уларга ўзларидан огоҳлантирувчи келганидан ажабландилар ва кофирлар: «Бу ажиб нарса-ку?! (Мушриклар Муҳаммад алайҳиссаломнинг Пайғамбар бўлиб келганлигидан ажабландилар.)",
                            "verse 50:3": "Ўлиб, тупроқ бўлганимиздан кейин ҳам-а? Бу қайтиш (ақлдан) узоқ-ку?!» дедилар.",
                            "verse 50:4": "Ҳақиқатда Биз уларни ер камайтираётганини билдик ва Бизнинг ҳузуримизда сақловчи китоб бор. (Ўлик кўмилгандан кейин аста- секин чириб, камайиб тупроққа қўшила боради.)",
                            "verse 50:5": "Балки уларга ҳақ келганда, уни ёлғонга чиқардилар. Улар изтиробли ишдадирлар. (Улар ҳақни инкор қилганлар. Буни олдида бошқа нарсаларни инкор қилиш ҳач гап эмас.)",
                            "verse 50:6": "Устиларидаги осмонга назар солмайдиларми? Уни қандай бино қилибмиз, зийнатлабмиз ва унинг тешиклари ҳам йўқ?!",
                            "verse 50:7": "Ва ерни чўзиб қўйдик, унга тоғларни ташладик ва унда турли гўзал жуфтларни ўстирдик.",
                            "verse 50:8": "(Роббисига) қайтувчи ҳар бир бандага кўргазма ва эслатма қилиб.",
                            "verse 50:9": "Ва осмондан барака сувини туширдик, ҳамда у билан боғ-роғларни ва дон ҳосилини ўстирдик.",
                            "verse 50:10": "Ва зич мевали шингиллари бор хурмоларни ҳам.",
                            "verse 50:11": "Бандаларга ризқ қилиб. Ва у (ёмғир) билан ўлган шаҳарни тирилтирдик. (Қабрдан) чиқиш ҳам шундай бўладир. (Ўсимликлари қуриб, худди ўлик ҳолига келиб қолган шаҳарларни ёмғир ила ўстириб-тирилтиришни эслатиш орқали инсон худди шу тарзда қайта тирилиши осон эканлигини таъкидламоқда.)",
                            "verse 50:12": "Улардан аввал Нуҳ қавми, қудуқ соҳиблари ва Самуд ёлғонга чиқарганлар.",
                            "verse 50:13": "Од, Фиръавн, Лут биродарлари.",
                            "verse 50:14": "Ва дарахтзор эгалари ва Туббаъ қавми — барчалари Пайғамбарларни ёлғонга чиқарганлар. Бас, (азоб) ваъдам ҳақ бўлди. (Бу ояти каримада кофирлар фақат Муҳаммад алайҳиссаломнигина ёлғончига чиқаришмагани, балки бу қадимий одати эканлиги эслатилмоқда.)",
                            "verse 50:15": "Аввалги яратишга ожиз бўлдикми? Йўқ! Улар янгидан яратилишига шубҳададирлар.",
                            "verse 50:16": "Албатта, инсонни Биз яратганмиз ва унинг нафси нимани васваса қилишини ҳам биламиз. Ва Биз унга жон томиридан ҳам яқинмиз.",
                            "verse 50:17": "Зотан икки кутиб олувчи ўнгда ва чапда ўтирган ҳолларида кутиб олурлар.",
                            "verse 50:18": "У бирор сўз айтмас, магар ҳузурида (фаришта) ҳозиру нозир.",
                            "verse 50:19": "Ўлимнинг мастлиги (талвасаси) ҳақиқат бўлиб келди. Сен қочиб юрган нарса шулдир.",
                            "verse 50:20": "Ва сур ҳам чалинди. Бу қўрқитилган кундир.",
                            "verse 50:21": "Ва ҳар бир жон ҳайдагувчи ва гувоҳлик берувчи билан келди. (Яъни, қиёматда ҳар бир жон билан уни маҳшаргоҳга ҳайдовчи фаришта ва бу дунёда қилган ишларга гувоҳлик берувчи фаришта бирга келади. Эҳтимол, бу дунёда унга вакил қилинган икки фаришта шулардир.)",
                            "verse 50:22": "Албатта, сен бундан ғафлатда эдинг. Бас, Биз сенинг пардангни очдик ва бугун кўзинг ўткирдир.",
                            "verse 50:23": "Ва унинг «яқини»: «Мана, бу мендаги тайёр нарса», деди.",
                            "verse 50:24": "Ҳар бир қайсарни, кофирни жаҳаннамга ташланг!",
                            "verse 50:25": "Яхшиликни ман қилувчини, тажовузкорни, шак келтирувчини!",
                            "verse 50:26": "Аллоҳ билан бирга бошқани илоҳ қилиб олганни шиддатли азобга ташланг!",
                            "verse 50:27": "Унинг «яқини»: «Роббимиз, уни мен туғёнга кетгазганим йўқ, лекин унинг ўзи узоқ залолатда бўлди», дер.",
                            "verse 50:28": "У зот: «Менинг ҳузуримда тортишманглар, сизларга азоб ваъдасини тақдим қилувдим.",
                            "verse 50:29": "Менинг ҳузуримда гап ўзгармас ва Мен бандаларга зулм қилгувчи эмасман», деди.",
                            "verse 50:30": "«Бугун жаҳаннамга тўлдингми?» десак, у: « яна қўшимча борми?» дер.",
                            "verse 50:31": "Ва жаннат тақводорларга узоқ бўлмаган жойга яқинлаштирилди.",
                            "verse 50:32": "Бу сизга ваъда қилинган нарсадир. Ҳар бир сертавбага ва сақловчига.",
                            "verse 50:33": "Роҳмандан ғоибдан қўрққан ва саломат қалб ила келган кимсасага.",
                            "verse 50:34": "Унга саломат бўлган ҳолда кирингиз. Бу мангулик кунидир» (дейилди).",
                            "verse 50:35": "У ерда нима хоҳласалар, уларникидир. Ва ҳузуримизда зиёдаси бор. (Имом Аҳмад ривоят қилган ҳадисда Пайғамбар алайҳиссалом: »Агар мўмин киши жаннатда фарзанд хоҳласа, унинг ҳомиласи, туғилиши, ўсиши бир соатда бўлади», деганлар. «Ва ҳузуримизда зиёдаси бор»— Аллоҳ таолонинг жамолига назар солиш бахтидир, деган ривоят ҳам бор.)",
                            "verse 50:36": "Улардан аввал, улардан кўра кучлироқ асрларнинг қанчасини ҳалок қилдик. «Қочадиган жой борми?» деб юртма-юрт кезиб чиқдилар. (Ҳалокатга учраган ўша аввалги кофирлар авлодлари ҳозиргилардан кўра қувватлироқ эдилар. Аммо чора топа олмай ҳалок бўлдилар.)",
                            "verse 50:37": "Албатта, бунда қалби борларга ва зеҳн билан қулоқ осганларга эслатма бордир.",
                            "verse 50:38": "Албатта, осмонлару ерни ва уларнинг орасидаги нарсаларни олти кунда яратдик. Ва Бизни чарчоқ тутмади. (Аллоҳнинг ҳузуридаги кунлар биз ўрганиб қолган кунларнинг айниси эмас. Бизнинг кунларимиз дунё яратилганидан сўнг, ер курасини айланиши ҳолати ва вақтига мувофиқ яратилган. Табиийки, бу олти куннинг масофаси ва миқдорини ёлғиз Аллоҳ таоло билади.)",
                            "verse 50:39": "Уларнинг айтаётганларига сабр қил ва Роббингга қуёш чиқиши ва ботишидан аввал ҳамду тасбиҳ айт.",
                            "verse 50:40": "Кечасида ҳам Унга тасбиҳ айт. Ва саждадан кейин ҳам. (Тасбеҳ айтишнинг маъноси Аллоҳни поклаб ёд этишдир. Кўпроқ «Субҳоналлоҳи» калимасини айтиш билан бўлади.)",
                            "verse 50:41": "Нидо қилувчи яқин жойдан нидо қилган кунда, қулоқ ос. («Нидо қилувчи — фаришта Исрофил алайҳиссаломдир.)",
                            "verse 50:42": "У кунда қичқириқни ҳақ ила эшитурлар. Ана ўша чиқиш кунидир. («Чиқиш куни»— қабрлардан чиқиш куни, яъни, қиёмат кунидир.)",
                            "verse 50:43": "Албатта, Биз тирилтирамиз, ўлдирурмиз. Ва қайтиш ҳам Бизгадир.",
                            "verse 50:44": "У кунда устларидаги ер ёрилиб, шошиб чиқурлар. Ана ўша Биз учун осон тўплашдир.",
                            "verse 50:45": "Уларнинг айтганларини Биз билувчимиз. Сен уларнинг устидаги жаббор эмассан. Бас, Қуръон ила азоб ваъдамдан қўрққанларни огоҳлантир."
                        }
                    }
                }
            }
        }
    }
}