{
    "id": 57,
    "name_simple": "Al-Hadid",
    "revelation_place": "madinah",
    "revelation_order": 94,
    "bismillah_pre": true,
    "verses_count": 29,
    "short_text": "The Surah takes its title from the sentence, Wa anzalna' l-hadida, of verse 25.",
    "text": [
        "\n",
        "The Surah takes its title from the sentence, Wa anzalna' l-hadida, of verse 25.",
        "\n",
        "Period of Revelation",
        "\n",
        "This is unanimously a Madani Surah, and a study of its subject matter shows that it was probably sent down some time during the interval between the Battle of Uhud and the Truce of Hudaibiyah. This was the time when the tiny Islamic State of Madinah had been hemmed in by the disbelievers and the handful of the ill equipped Muslims were entrenched against the combined power of entire Arabia. In this state Islam not only stood in need of the sacrifice of Life from its followers, but it also needed monetary help and assistance. In this Surah a forceful appeal has been made for the same. This view is further strengthened by verse 10 in which Allah has addressed the believers to the effect \"Those of you who would spend and fight after the victory can never be equal to those who have spent and fought before the victory.\" And the same is supported by the traditions that Ibn Marduyah has related on the authority of Hadrat Anas. In respect of the verse: Alam ya'n-i lilladhina aamanu\r\nan takhsha'a qulubu- hum li-dhikrillah-i, he says that 17 years after the commencement of the revelation of the Qur'an this verse was sent down to arouse the believers to action. Reckoned thus the period of the revelation of this Surah falls between the 4th and the 5th year after the hijrah.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "The theme of this Surah is to exhort the Muslims to spend in the cause of Allah. At the most critical juncture of the history of Islam when it was engaged in a life and death struggle against Arab paganism, this Surah was revealed to persuade the Muslim's to make monetary sacrifices in particular, and to make them realize that Islam did not merely consist in verbal affirmation and some outward practices but its essence and spirit is sincerity towards Allah and His Religion. The faith of the one who was devoid of this spirit and who regarded his own self and wealth as dearer to himself than Allah and His Religion, was hollow and therefore of little worth in the sight of Allah.",
        "\n",
        "For this object, first the attributes of Allah Almighty have been mentioned so that the listeners may fully realize as to Who is addressing them. Then, the following themes have been expressed in sequence:",
        "\n",
        "\n\nThe inevitable demand of the Faith is that one should not shirk spending one's wealth for the sake of Allah. This would not only be contrary to the Faith but also wrong realistically. For the wealth indeed belongs to Allah, on which man has been given proprietary rights only as His vicegerent. Yesterday this wealth was in other people's possession today it is with one particular man, and tomorrow it will pass into some one else's hand. Ultimately, it will go back to Allah, Who is the inheritor of everything in the universe. Only that much of this wealth will be of any use to a man, which he spends in the cause of Allah during the period it is in his possession.\n\n\nAlthough making sacrifices for the sake of Allah is commendable in any case, the true worth of these sacrifices is determined by the nature of the occasion. There is an occasion when the power of paganism is overwhelming and there is a danger that it might subdue and overcome Islam completely; there is another occasion when Islam is in a stronger position in its struggle against un-Islam and the believers are attaining victories. Both these states are not equal as regards their respective importance. Therefore, the sacrifices that are made in these different states would also not be equal. Those who sacrifice their lives and expend their wealth to further promote the cause of Islam when it is already strong cannot attain to the rank of those who struggled with their lives and their wealth to promote and uphold the cause of Islam when it was weak.\n\n\nWhatever is spent for the cause of the Truth is a loan on Allah, and Allah will not only return it increasing it manifold but will also give from Himself the best reward for it.\n\n\nIn the Hereafter the Light shall be bestowed only on those believers who would have spent their wealth in the cause of Allah. As for the hypocrites who watched and served only their own interests in the world, and who least bothered whether the Truth or falsehood prevailed will be segregated from the believers in the Hereafter although they might have lived in close association with them in the world. They will be deprived of the Light, and they will be counted among the disbelievers.\n\n\nThe Muslims should not behave like those followers of the earlier Books, whose lives have been. spent in the worship of the world and whose hearts have become hardened due to negligence with the passage of time. He cannot be a believer whose heart does not melt at the remembrance of Allah and does not bow to the Truth sent down by Him.\n\n\nThe sincere upholders of the Truth and the true witnesses of the Faith in the sight of Allah are only those believers who spend their wealth in His way sincerely, without any desire of show.\n\n\nThe life of this world is only a short lived spring and a means of pride and show. Its sports and pastimes, its adornments and decorations, its pride of place, its wealth and possessions, for which the people try to vie with one another, are transient. Its likeness is of the crop which flourishes and blooms, then turns pale and then finally is reduced to chaff. The everlasting life is the life hereafter when results of great consequence will be announced. Therefore, if one has to vie with another for something, one should strive for Paradise.\n\n\nWhatever good man meets with and whatever hardship he suffers in the world, are pre-ordained by Allah. A true believer is he who does not lose heart in affliction and is not puffed up with pride in good times. It is the character of a hypocrite and disbeliever that he is puffed up with pride when Allah favors him with His blessings, behaved boastfully and shows stinginess when called upon to spend in the cause of the same God Who blessed him, and also counsels others to be stingy like himself.\n\n\nAllah sent His Messengers with clear signs and the Book and the Law of Justice so that the people may adhere to justice; besides, He sent down iron also so that power may be used to establish the Truth and vanquish falsehood. Thus, Allah likes to see as to who from among the people would rise to support and succor His true Religion even at the risk of their lives. These opportunities Allah has created for man's own advantage and development; otherwise Allah does not stand in need of others for His works.\n\n\nProphets came from Allah in the past, and by their preaching some people adopted the Right Path, but most of them persisted in wickedness. Then the Prophet Jesus came, whose teachings brought about many moral improvements in the lives of the people, but his community invented monasticism. Now Allah has sent the Prophet Muhammad (upon whom be His peace and blessings). Those who affirm faith in him and pass their life fearing Allah's accountability, will be given by Allah a double share of His mercy and He will bless them with the Light by which they will see and walk the straight path among the crooked paths met with at every step in the life of this world. Although the followers of the earlier revelation regard themselves as the monopolists of Allah's bounties, the fact remains that Allah Himself controls His bounties He may bless with these whomever He pleases.\n\n",
        ";\r\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that mentions the heavy metallic element Iron as being sent down by God form the heavens to endow the earth itself with mighty force, and humanity with the many benefits of its malleable and structural strength, and all the great tests of faith that arise from this. It takes its name from verse 25, which mentions iron (ḥadīd). The surah urges the believers to spend in God’s cause and uphold justice. The all pervasiveness of God’s power, knowledge, control, and glory is airmed to encourage the believers to right action, and the fate of the hypocrites is described. Previous prophets are mentioned (verse 26 .), especially Noah, Abraham, and Jesus, showing the response they received. The surah closes with a reference to the People of the Book.",
    "name_translation": "Iron",
    "name_complex": "Al-Hadîd",
    "surah_name_ar": "الحديد",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 57:1": "Perëndinë e falenderon çdo gjë që është në qiej dhe në Tokë, e Ai është i Plotëfuqishëm dhe i Gjithëdijshëm.",
                            "verse 57:2": "Pushteti i Tij është në qiej dhe në Tokë; jeta dhe vdekja janë vepër e Tij, dhe Ai është i pushtetshëm për çdo gjë.",
                            "verse 57:3": "Ai është i Pari dhe i Mbrami, edhe i Dukshmi edhe i Padukshmi, dhe Ai është i dijshëm për çdo gjë!",
                            "verse 57:4": "Ai ka krijuar qiejt dhe Tokën për gjashtë ditë (periudha kohore), dhe pastaj mbisundoi Arshin (Gjithësinë); Ai di se çka hyn në Tokë dhe çka del prej saj, çka zbret prej qiellit dhe çka ngritet kah ai. Ai është me ju (u sheh) kudo që gjendeni, dhe çkado që punoni, Perëndia i sheh (të gjitha) çka punoni.",
                            "verse 57:5": "Pushteti i Tij ësht ënë qiej dhe në Tokë, dhe te Perndia do të kthehen të gjitha!",
                            "verse 57:6": "Ai e shtie natën në ditë dhe ditën në natë, dhe ai e di mendimin e çdokujt!",
                            "verse 57:7": "Besoni Perëndinë dhe të Dërguarin e Tij dhe shpenzoni nga ato çka Ai ju ka lënë në dispozicion juve, se ata që kanë besuar nga ju dhe kanë shpenzuar (për të mirë), për ta ka shpërblim të madh!",
                            "verse 57:8": "Cka keni që nuk besoni në Perëndinë? E i Dërguari i Tij ju fton që ta besoni Zotin tuaj, kurse ai prej jush ka marrë obligimin – nëse dëshroni të jeni besimtarë.",
                            "verse 57:9": "Ai, robit të Vet i ka zbritur fakte të qarta për t’ju nxjerrë nga errësira në dritë – e Perëndia ndaj jush, me të vërtetë, është i mirë dhe i mëshirshëm.",
                            "verse 57:10": "Dhe, ç’keni që nuk shpenzoni në rrugën e Perëndisë, pasi që qiejt dhe Toka i mbetën trashëgim Perëndisë? Nuk janë të barabartë ata që kanë shpenzuar dhe luftuan para fitores – dhe ata që kanë luftuar dhe shpenzuar pastaj. Këtu, dallimi është në një shkallë të lartë; mirëpo, Perëndia të gjithëve u premton dhuntinë. – Perëndia di mirë atë që punoni ju.",
                            "verse 57:11": "Kush do t’i jap vullnetarisht Perëndisë hua – të mirë – që Ai pastaj t’ia kthejë shumëfish, e madje, për të ka shpërblim fisnik.",
                            "verse 57:12": "në Ditën që do të shohish besimtarët dhe besimtaret, që para tyre dhe në të djahtë ecë dritë e tyre (e ju thuhet): “Gëzim (ka) sot për ju: kopshtet e xhennetit nëpër të cilët rrjedhin lumenjtë, në të cilët do të banoni përgjithmonë. Ky është sukses i madh!",
                            "verse 57:13": "Në Ditën kur hipokritët dhe hipokritet do t’u flasin besimtarëve: “Pritna neve, që të shpërblehemi me dritën tuaj!” – u përgjigjet (atyre): “Kthehuni prapa, e kërkoni tjetër dritë!” Dhe, ndërmjet tyre do të vendose barriera (pengesa) që ka derë; brenda saj ka mëshirë, kurse jashtë saj ka vuajtje.",
                            "verse 57:14": "A nuk kemi qenë me ju? – thërrasin ata. – “Po” – përgjigjen, - por ju e keni komprometuar veten dhe keni pritur, edhe keni dyshuar, dhe dëshirat e kota ju kanë mashtruar, përderisa ka arritur urdhëri i Perëndisë, e djalli u ka mashtruar ndaj Perëndisë!",
                            "verse 57:15": "Sot, prej jush nuk pranohet kurrfarë kompensimi, e as prej atyre që nuk kanë besuar: zjarri është vendbanimi juaj, ai është për ju, e sa vendbanim i tmerrshëm që është ai!”",
                            "verse 57:16": "A nuk është koha që besimtarëve t’u zbutet zemra, kur përmendet Perëndia dhe e Vërteta (Kur’ani) që është reveluar (shpallur), dhe mos të bëhen ata sikur atyre që qysh më parë iu është dhënë Libri, por zemrat e tyre, me kalimin e një kohe të gjatë – u forcuan (në të keqe), dhe shumë prej tyre janë mëkatarë.",
                            "verse 57:17": "Dijeni, se Perëndia, me të vërtetë, e ngjallë tokën pas vdekjes së saj! Na ju sqarojmë argumentet për të kuptuar ju!",
                            "verse 57:18": "At dhe ato që japin lëmoshë dhe vullnetarisht i japin hua Perëndisë, do t’u kthehet shumëfish dhe për ta ka shpërblim fisnik.",
                            "verse 57:19": "Ata që besojnë Perëndinë dhe profetët e Tij, ata janë njerëz të drejtë dhe dëshmitarë te Zoti i tyre dhe do të shpërblehen dhe do të kenë dritë. Kurse, ata që nuk janë besimtarë dhe i mohojnë argumentet Tona, do të jenë banorë të zjarrit!",
                            "verse 57:20": "Dijeni që jeta në këtë botë nuk është kurrgjë tjeër veçse lojë dhe dëfrim, dhe zbukurim (stolisje) dhe mburrje ndërmjet jush dhe vrapim kah pasuria dhe numri i fëmijëve! Kjo i shembëllen bimës, e cila pas hiut rritet dhe entuziazmon bujqit, e ajo pastaj gufon, po më vonë e sheh të zverdhur (vyshkur), që më në fund (të shkatërrohet). Kurse, në botën tjetër ka vuajtje të mëdha dhe amnesti nga Perëndia dhe kënaqësi nga Ai; jeta në këtë botë është vetëm kënaqësi e mashtruar.",
                            "verse 57:21": "Bëni gara që te Perëndia i juaj të meritoni amnestinë parajsën e gjerë sa qielli dhe Toka, që është e përgatitur për ata që i kanë besuar Perëndisë dhe profetëve të Tij. Ajo është dhurata e Perëndisë që ia jep Ai kujt të dojë; e Perëndia është pronar i dhuntisë së madhe!",
                            "verse 57:22": "S’ka mjerim (fatkeqësi) që e godet Tokën dhe juve, përveç asaj që ëshë shënur më parë në Libër, - kjo për Perëndinë, me të vërtetë, është lehtë!",
                            "verse 57:23": "Për të mos u dëshpëruar për atë që ju ka kaluar, por edhe për të mos u gëzuar së tepërmi për atë që Ai ju ka dhënë juve, Perëndia nuk i don lavdëruesit dhe vetmburrësit,",
                            "verse 57:24": "ata që janë koprracë dhe nxisin edhe të tjerët në koprraci. E ata që i shmangën urdhërit, me të vërtetë, Perëndia është i pavarur (i pasur) dhe i lavdërueshëm.",
                            "verse 57:25": "Me të vërtetë, Ne i kemi dërguar profetët Tonë me argumente të qarta dhe me ta u kemi dhënë librin dhe terezitë, (drejtësinë): që njerëzit të veprojnë drejt; kurse hekurin e kemi krijuar, se, në atë ka tmerr të madh, po edhe dobi për njerëzit dhe që Perëndia të dëftojë ata që ndihmojnë besimin e Tij dhe të dërguarit e Tij – pa i parë. Me të vërtetë, Perëndia është i fuqishëm dhe i madhërueshëm.",
                            "verse 57:26": "Me të vërtetë, e kemi dërguar Nuhun dhe Ibrahimin dhe disa trashëgimtarë të tyre, që iu kemi shpallur profetninë dhe iu kemi dërguar Librin. Disa prej tyre kanë qenë në rrugë të drejtë, kurse shumica prej tyre kanë qenë ngatërrestarë.",
                            "verse 57:27": "Pastaj pas gjurmëve të tyre – ju kemi dërguar profetët Tonë, dhe pastaj kemi dërguar Isanë, të birin e Merjemës, të cilit ia dhamë Inxhilin, kurse në zemrat e ithtarëve të tij kemi mbjellë (frymëzuar) butësi dhe mëshirë, ndërsa, ata vetë e kanë trilluar jetën (lutëse – të tërhequr prej shoqërisë dhe jetës normale), për të arritur kënaqësinë e Perëndisë. Ne nuk i kemi obliguar ata për këtë, por ata nuk u kujdesën për atë si duhet. Ata të cilët kanë besuar si duhet – i shpërblejmë, e shumë prej tyre janë ngatërrestarë.",
                            "verse 57:28": "O ju besimtarë, - ruajuni Perëndisë dhe besoni Profetin e Tij, Ai do t’ju dhurojë mëshirë të dyfishtë, dhe do t’u japë dritë me ndihmën e së cilës do të ecni dhe do t’ju falë (gabimet); Perëndia është falës dhe mëshirues –",
                            "verse 57:29": "dhe le ta dinë ithtarët e Librit, se ata, kurrfarë dhuntie të Perëndisë nuk do të fitojnë (marrin), pasi që dhuntia është vetëm në dorën e Perëndisë – Ai ia dhuron kujt të dojë. E Perëndia është pronar i mirësisë së madhe."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Göylərdə və yerdə nə varsa, (hamısı) Allahı təqdis edib şə'ninə tə'riflər deməkdədir. O, yenilməz qüvvət sahibi, hikmət sahibidir!",
                            "verse 57:2": "Göylərin və yerin hökmü Onun əlindədir. Dirildən də, öldürən də Odur. O, hər şeyə qadirdir!",
                            "verse 57:3": "Əvvəl də, axır da, zahir də, batin də Odur. O, hər şeyi biləndir! (Allah ?z əzəli elmi və qüdrəti ilə hər şeyi görüb bildiyi halda, ?zü görünməz, dərkolunmazdır. Allahın varlığı aşkar, mahiyyəti isə tamamilə gizlidir).",
                            "verse 57:4": "Göyləri və yeri altı gündə xəlq edən, sonra ərşi yaradıb hökmü altına alan Odur. O, yerə girəni də, (yerdən) çıxanı da, göydən enəni də, (göyə) qalxanı da bilir. Siz harada olsanız, O sizinlədir. Allah sizin nə etdiklərinizi görəndir!",
                            "verse 57:5": "Göylərin və yerin hökmü Onun əlindədir. (Bütün) işlər (axırda) ancaq Allaha tərəf qaytarılacaqdır!",
                            "verse 57:6": "Gecəni gündüzə, gündüzü də gecəyə qatan Odur. O, ürəklərdə olanları biləndir!",
                            "verse 57:7": "(Ey insanlar!) Allaha və Peyğəmbərinə iman gətirin. Sizi varis etdiyi maldan (Onun yolunda) xərcləyin. Sizdən iman gətirib (mal-dövlətini Allah yolunda) sərf edənləri böyük bir mükafat gözləyir!",
                            "verse 57:8": "Peyğəmbər sizi Rəbbinizə iman gətirməyə çağırdığı halda, sizə nə olub ki, Allaha iman gətirmirsiniz? Hələ bundan da əvvəl (Allah sizi ulu babanız Adəmin belində, yaxud ruhlar aləmində olduğunuz zaman yalnız Ona iman gətirəcəyiniz barəsində) sizdən əhd almışdı. Əgər (əvvəl-axır) iman gətirəcəksinizsə, (elə indidən gətirin - bu sizin üçün daha yaxşıdır!)",
                            "verse 57:9": "Sizi zülmətlərdən nura (küfrdən imana) çıxartmaq üçün ?z bəndəsinə (Muhəmməd əleyhissəlama) açıq-aşkar ayələr nazil edən Odur. Allah sizə şəfqətlidir, mərhəmətlidir!",
                            "verse 57:10": "(Ey insanlar!) Sizə nə olub ki, (mal-dövlətinizi) Allah yolunda xərcləmirsiniz? Halbuki göylərin və yerin mirası (bütün sərvəti, eləcə də siz öləndən sonra qoyub gedəcəyiniz malın hamısı) ancaq Allahındır. Sizlərdən (mal-dövlətini) fəthdən (Məkkənin fəthindən) əvvəl (Allah yolunda) sərf edənlər və (müşriklərə qarşı) vuruşanlar (başqaları ilə) eyni deyillər. Onlar (mallarını Allah yolunda) fəthdən sonra sərf edib döyüşənlərdən dərəcə e'tibarilə daha üstündürlər. Bununla belə, Allah onların hamısına (həm birincilərə, həm də ikincilərə) ən gözəl mükafat (Cənnət) və'd buyurmuşdur. Allah sizin nə etdiklərinizdən xəbərdardır!",
                            "verse 57:11": "Kimdir o kəs ki, Allah yolunda könül xoşluğu ilə borc versin, O da onun əvəzini qat-qat (birə on, yaxud birə yeddi yüz) artırsın?! Onu həm də çox qiymətli bir mükafat (Cənnət) gözləyir!",
                            "verse 57:12": "O gün (qiyamət günü, ya Peyğəmbər!) mö'min kişilərin və qadınların (səmimi e'tiqadları və dünyada etdikləri yaxşı əməllər müqabilində nail olduqları iman) nurunun onların önlərindən və sağ tərəflərindən axıb şö'lə saçdığını (qıl körpüsü üstündə onlara yol göstərdiyini) görəcəksən. (Mələklər onlara deyəcəklər: ) \"Bu gün sizin müjdəniz (ağacları) altından çaylar axan cənnətlərdir. Siz orada əbədi qalacaqsınız!\" Bu, böyük qurtuluşdur (uğurdur)!",
                            "verse 57:13": "O gün münafiq kişi və qadınlar iman gətirənlərə: \"(Bizi bir az) gözləyin ki, nurunuzdan bir qədər işıq alaq!\" - deyəcəklər. (Onlara istehza ilə) belə cavab veriləcəkdir: \"Geriyə dönüb işıq axtarın!\" (Bu sözlərdən sonra) onların (mö'minlərlə münafiqlərin) arasına qapısının içəri tərəfində mərhəmət və bayır tərəfində əzab olan bir sədd çəkiləcəkdir.",
                            "verse 57:14": "(Münafiqlər divarın içəri tərəfində olan mö'minləri) səsləyib deyəcəklər: \"Məgər biz (dünyada) sizinlə birlikdə deyildikmi?!\" (Mö'minlər) belə cavab verəcəklər: \"Bəli (bizimlə birlikdə idiniz). Lakin siz özünüzü (nifaqla, ikiüzlülüklə) fitnəyə saldınız (fitnəyə salıb məhvə düçar etdiniz), siz (mö'minlərin başına bir fəlakət gəlməsini) gözləyirdiniz və (Allahın birliyinə, Muhəmməd əleyhissəlamın peyğəmbərliyinin həqiqiliyinə) şəkk edirdiniz. Allahın əmri (ölümünüz) gəlib çatanadək sizi xam xəyallar (tamah) aldatdı. Sizi Allah barəsində (Allah rəhmlidir, bütün günahlarınızdan keçər, sizə heç bir cəza verməz deyə) o tovlayan (Şeytan) tovladı!",
                            "verse 57:15": "(Ey münafiqlər!) Bu gün artıq nə sizdən, nə də kafirlərdən (günahlarınızın bağışlanması üçün) heç bir fidyə qəbul olunmaz. Məskəniniz Cəhənnəmdir. Sizə yaraşan odur. Ora necə də pis sığınacaqdır!\"",
                            "verse 57:16": "İman gətirənlərin qəlblərinin Allahın zikri və haqdan nazil olan (Qur'an) üçün yumşalması vaxtı gəlib çatmadımı?! Onlar özlərindən əvvəl kitab verilən kimsələr (yəhudilər və xaçpərəstlər) kimi olmasınlar. Onlarla (öz peyğəmbərləri arasında) uzun bir müddət keçmiş və (öyüd-nəsihəti unutduqları üçün) qəlbləri sərtləşmişdir. Onların çoxu (Allaha asi olan) fasiqlərdir!",
                            "verse 57:17": "(Ey insanlar!) Bilin ki, Allah torpağa öldükdən sonra təzədən can verir. Biz ayələri sizə belə müfəssəl izah etdik ki, bəlkə, ağlınız başınıza gəlsin!",
                            "verse 57:18": "Şübhəsiz ki, sədəqə verən kişi və qadınlar, Allah yolunda gözəl (könül xoşluğu ilə) borc verənlər üçün (əməllərinin savabı) qat-qat artırılacaqdır. Onları həm də cox qiymətli bir mükafat (Cənnət) gözləyir!",
                            "verse 57:19": "Allaha və peyğəmbərinə iman gətirənlər - məhz onlar öz Rəbbi dərgahında olan siddiqlər (özündə-sözündə doğru olanlar) və şəhidlərdir. Onların (qiyamət günü) öz mükafatları və (qıl körpüsü üstündə onlara yol göstərəcək) öz nurları vardır. Kafir olub ayələrimizi yalan sayanlara gəldikdə isə, onlar cəhənnəmlikdirlər.",
                            "verse 57:20": "(Ey insanlar!) Bilin ki, dünya həyatı oyun-oyuncaq, bər-bəzək, bir-birinizin qarşısında öyünmək və mal-dövləti, oğul-uşağı çoxaltmaqdan ibarətdir. Bu elə bir yağışa bənzəyir ki, onun yetişdirdiyi bitki (məhsul) əkinçilərin xoşuna gələr. Sonra o quruyar və sən onun saralıb-solduğunu, daha sonra çör-çöpə döndüyünü görərsən. (Dünya malına aldananları) axirətdə şiddətli əzab, (dünya malına uymayanları isə) Allahdan bağışlanma və razılıq gözləyir. Dünya həyatı aldanışdan (yalandan) başqa bir şey deyildir.",
                            "verse 57:21": "(Ey insanlar!) Rəbbiniz tərəfindən bağışlanmağa və genişliyi yerlə göyün genişliyi qədər olan, Allaha və Onun peyğəmbərlərinə iman gətirənlərdən ötrü hazırlanmış Cənnətə nail olmaq üçün (yaxşı əməllər etməkdə) bir-birinizi ötüb keçməyə çalışın. Bu, Allahın dilədiyi kimsəyə əta etdiyi lütfdür (mərhəmətdir). Allah çox böyük lütf (mərhəmət) sahibidir!",
                            "verse 57:22": "Yer üzündə baş verən və sizin öz başınıza gələn elə bir müsibət yoxdur ki, Biz onu yaratmamışdan əvvəl o, bir kitabda (lövhi-məhfuzda) yazılmamış olsun. Bu, Allah üçün çox asandır!",
                            "verse 57:23": "Bu sizin əlinizdən çıxana kədərlənməməyiniz və sizə də verilənə sevinib qürrələnməməyiniz üçündür. Allah özünü bəyənən, (özü ilə) fəxr edən heç bir kəsi sevməz!",
                            "verse 57:24": "O kəslər ki, həm özləri xəsislik edər, həm də xalqa xəsis olmağı əmr edərlər. Kim (Allahın əmrlərindən, öyüd-nəsihətindən) üz döndərsə (ancaq özünə zərər edər). Həqiqətən, Allah ehtiyacsızdır, şükrə (və tə'rifə) layiqdir! (Onun bütün əməlləri bəyəniləndir!)",
                            "verse 57:25": "And olsun ki, Biz peyğəmbərlərimizi açıq-aşkar dəlillərlə (mö'cüzələrlə) göndərdik. Biz onlara birlikdə (Allahın hökmlərini bildirən səmavi) kitab və ədalət tərəzisi (şəriət) nazil etdik ki, insanlar (bir-biri ilə) ədalətlə rəftar etsinlər. Biz həddindən artıq möhkəm olan və insanlara fayda verən dəmiri də icad (nazil) etdik (mə'dənlərdən çıxartdıq) ki, Allah (?zünü) görmədən Ona (onun dininə) və peyğəmbərlərinə kömək göstərənləri (dəmirdən düzəlmiş silahlarla kafirlərə qarşı vuruşan mücahidləri) bəlli etsin. Həqiqətən, Allah yenilməz qüvvət sahibi, qüdrət sahibidir!",
                            "verse 57:26": "And olsun ki, Biz Nuhu və İbrahimi (peyğəmbər) göndərdik, peyğəmbərliyi və kitabı (Tövratı, Zəburu, İncili və Qur'anı) onların nəslinə verdik. Onlardan doğru yolda olan da vardır, çoxu isə (Allahın itaətindən çıxmış) fasiqlərdir!",
                            "verse 57:27": "Sonra onların ardınca (Musa, İlyas, Davud, Süleyman, Yunis və başqa) peyğəmbərlərimizi yolladıq. (Onlardan sonra) Məryəm oğlu İsanı göndərib ona İncil verdik. Onun ardınca gedənlərin qəlblərində bir-birinə şəfqət, mərhəmət oyatdıq. Onlar özlərindən rahiblik (tərki-dünyalıq) icad etdilər. Biz onu (rahibliyi) onlara vacib buyurmamışdıq. Onlar bunu Allah rizasını qazanmaq üçün etdilər, lakin ona layiqincə əməl (riayət) etmədilər (İncili təhrif edib İsanı Allah bildilər, Muhəmməd əleyhissəlamın peyğəmbərliyini dandılar). Biz onlardan iman gətirənlərin mükafatlarını verdik. Onların çoxu isə (Allaha asi olan) fasiqlərdir.",
                            "verse 57:28": "Ey iman gətirənlər! Allahdan qorxun və Onun peyğəmbərinə iman gətirin ki, (Allah) sizə ?z mərhəmətindən iki pay versin, sizə (qıl körpüsü üstündə) getməyiniz üçün nur bəxş etsin və sizi bağışlasın. Allah bağışlayandır, rəhm edəndir!",
                            "verse 57:29": "(Muhəmməd əleyhissəlama iman gətirməyən) kitab əhli bilsin ki, onlar Allahın lütfünə (mərhəmətinə, dilədiyi kimsəyə peyğəmbərlik əta etməsinə) heç bir vəchlə mane ola bilməzlər. Şübhəsiz ki, lütf (mərhəmət, ne'mət) Allahın əlindədir, onu istədiyinə bəxş edər. Allah çox böyük lütf (kərəm) sahibidir! [Və ya: kitab əhli Allahın lütfündən heç bir şeyə nail olmayacaqlarını, həqiqətən, lütfün (mərhəmətin) Allahın əlində olduğunu, Allahın da onu istədiyi kimsəyə bəxş etdiyini bilmədikləri üçünmü küfrdə israr edib dururlar? Halbuki bunu çox ə'la bilirlər]."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Allaha hvali sve što je na nebesima i na Zemlji, i On je Silni i Mudri.",
                            "verse 57:2": "Njegova je vlast na nebesima i na Zemlji; On život i smrt daje, i On sve može.",
                            "verse 57:3": "On je Prvi i Posljednji, i Vidljivi i Nevidljivi; i On zna sve!",
                            "verse 57:4": "U šest vremenskih razdoblja On je nebesa i Zemlju stvorio, i onda svemirom zavladao; On zna šta u zemlju ulazi i šta iz nje izlazi i šta s neba silazi i šta se prema njemu diže, on je s vama gdje god bili, i sve što radi",
                            "verse 57:5": "Njegova je vlast na nebesima i na Zemlji, i Allahu će se sve vratiti!",
                            "verse 57:6": "On uvodi noć u dan i dan u noć, i On zna svačije misli.",
                            "verse 57:7": "Vjerujte u Allaha i Poslanika Njegova i udjeljujte iz onoga što vam On stavlja na raspolaganje, jer one od vas koji budu vjerovali i udjeljivali čeka nagrada velika.",
                            "verse 57:8": "Šta vam je pa ne vjerujete u Allaha? Poslanik vas zove da vjerujete u Gospodara svoga - a On je od vas već zavjet uzeo - ako želite biti vjernici.",
                            "verse 57:9": "On robu Svome objavljuje jasne ajete da bi vas iz tmina na svjetlo izveo - a Allah je, uistinu, prema vama dobar i milostiv.",
                            "verse 57:10": "I šta vam je pa odbijate da trošite na Allahovu putu kada će Allah nebesa i Zemlju naslijediti? Nisu jednaki među vama koji su davali priloge prije pobjede i lično se borili - oni su na višem stupnju od onih koji su poslije d",
                            "verse 57:11": "Ko će Allahu drage volje zajam dati da bi mu ga On mnogostruko vratio, a uz to i nagradu plemenitu dobio",
                            "verse 57:12": "na Dan kada budeš vidio kako se pred vjernicima i vjernicama, i s desne strane njihove, svjetlo njihovo bude kretalo: \"Blago vama danas: džennetske bašče kroz koje teku rijeke u kojima ćete vječno boraviti - to je veliki uspj",
                            "verse 57:13": "na Dan kada će licemjeri i licemjerke vjernicima govoriti: \"Pričekajte nas da se svjetlom vašim poslužimo!\" \"Vratite se natrag, pa drugo svjetlo potražite!\" - reći će se. I između njih će se pregrada postaviti",
                            "verse 57:14": "Zar nismo s vama bili? - dozivaće ih. \"Jeste\" - odgovaraće - \"ali ste se pritvornošću upropastili, i iščekivali ste, i sumnjali ste, i puste želje su vas zavaravale, dok nije došla Allahova odredba, a šejtan va",
                            "verse 57:15": "Nikakva otkupnina se danas od vas neće primiti, a ni od onih koji nisu vjerovali; vatra će biti prebivalište vaše, ona baš vama odgovara, a užasno je ona boravište!\"",
                            "verse 57:16": "Zar nije vrijeme da se vjernicima srca smekšaju kad se Allah i Istina koja se objavljuje spomene, i da oni ne budu kao oni kojima je još davno data Knjiga, pa su srca njihova, zato što je proteklo mnogo vremena, postala nemilosrdna, i mnogi",
                            "verse 57:17": "Znajte da Allah daje život već mrtvoj zemlji! Mi vam objašnjavamo dokaze da biste razumjeli.",
                            "verse 57:18": "Onima koji milostinju budu udjeljivali i onima koje je budu udjeljivale, i koji drage volje Allahu budu zajam davali - mnogostruko će se vratiti i njih čeka nagrada plemenita.",
                            "verse 57:19": "Oni koji u Allaha i poslanike Njegove budu vjerovali imaće u Gospodara svoga stepen pravednika i mučenika i dobiće nagradu kao i oni i svjetlo kao i oni; a oni koji ne budu vjerovali i dokaze Naše budu poricali biće stanovnici u v",
                            "verse 57:20": "Znajte da život na ovome svijetu nije ništa drugo do igra, i razonoda, i uljepšavanje, i međusobno hvalisanje i nadmetanje imecima i brojem djece! Primjer za to je bilje čiji rast poslije kiše oduševljava nevjernike, ono",
                            "verse 57:21": "Nedmećite se da u Gospodara svoga zaslužite oprost i Džennet, prostran koliko su nebo i Zemlja prostrani, i pripremljen za one koji u Allaha i poslanike Njegove vjeruju. To je Allahova blagodat koju će dati onome kome On hoće; a u",
                            "verse 57:22": "Nema nevolje koja zadesi Zemlju i vas, a koja nije, prije nego što je damo, zapisana u Knjizi - to je Allahu, uistinu, lahko -",
                            "verse 57:23": "da ne biste tugovali za onim što vam je promaklo, a i da se ne biste previše radovali onome što vam On dade. Allah ne voli nikakve razmetljivce, hvalisavce,",
                            "verse 57:24": "koji škrtare i od ljudi škrtost traže. A onaj ko neće da udjeljuje - pa, Allah je, uistinu, nezavisan i dostojan hvale.",
                            "verse 57:25": "Mi smo izaslanike naše s jasnim dokazima slali i po njima knjige i terazije objavljivali, da bi ljudi pravedno postupali - a gvožđe smo stvorili, u kome je velika snaga i koje ljudima koristi - i da bi Allah ukazao na one koji pomažu v",
                            "verse 57:26": "Mi smo Nuha i Ibrahima poslali i nekima od potomaka njihovih vjerovjesništvo i objavu dali; neki od potomaka njihovih su na Pravome putu, a mnogi od njih su nevjernici.",
                            "verse 57:27": "Zatim smo, poslije njih, jednog za drugim naše poslanike slali, dok nismo Isaa, sina Merjemina, poslali, kojem smo Indžil dali, a u srca sljedbenika njegovih smo blagost i samilost ulili, dok su monaštvo oni sami, kao novotariju, uveli - Mi",
                            "verse 57:28": "O vi koji vjerujete, Allaha se bojte i u Poslanika Njegova vjerujte, On će vam dvostruku milost Svoju darovati, i daće vam svjetlo pomoću kog ćete ići, i oprostiće vam - jer Allah prašta, i samilostan je -",
                            "verse 57:29": "i neka sljedbenici Knjige znaju da oni nikakvu Allahovu blagodat neće dobiti, jer je blagodat samo u Allahovoj ruci - daje je onome kome On hoće; a u Allaha je blagodat najveća."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "নভোমন্ডল ও ভূমন্ডলে যা কিছু আছে, সবাই আল্লাহর পবিত্রতা ঘোষণা করে। তিনি শক্তিধর; প্রজ্ঞাময়।",
                            "verse 57:2": "নভোমন্ডল ও ভূমন্ডলের রাজত্ব তাঁরই। তিনি জীবন দান করেন ও মৃত্যু ঘটান। তিনি সবকিছু করতে সক্ষম।",
                            "verse 57:3": "তিনিই প্রথম, তিনিই সর্বশেষ, তিনিই প্রকাশমান ও অপ্রকাশমান এবং তিনি সব বিষয়ে সম্যক পরিজ্ঞাত।",
                            "verse 57:4": "তিনি নভোমন্ডল ও ভূ-মন্ডল সৃষ্টি করেছেন ছয়দিনে, অতঃপর আরশের উপর সমাসীন হয়েছেন। তিনি জানেন যা ভূমিতে প্রবেশ করে ও যা ভূমি থেকে নির্গত হয় এবং যা আকাশ থেকে বর্ষিত হয় ও যা আকাশে উত্থিত হয়। তিনি তোমাদের সাথে আছেন তোমরা যেখানেই থাক। তোমরা যা কর, আল্লাহ তা দেখেন।",
                            "verse 57:5": "নভোমন্ডল ও ভূমন্ডলের রাজত্ব তাঁরই। সবকিছু তাঁরই দিকে প্রত্যাবর্তন করবে।",
                            "verse 57:6": "তিনি রাত্রিকে দিবসে প্রবিষ্ট করেন এবং দিবসকে প্রবিষ্ট করেন রাত্রিতে। তিনি অন্তরের বিষয়াদি সম্পর্কেও সম্যক জ্ঞাত।",
                            "verse 57:7": "তোমরা আল্লাহ ও তাঁর রসূলের প্রতি বিশ্বাস স্থাপন কর এবং তিনি তোমাদেরকে যার উত্তরাধিকারী করেছেন, তা থেকে ব্যয় কর। অতএব, তোমাদের মধ্যে যারা বিশ্বাস স্থাপন করে ও ব্যয় করে, তাদের জন্যে রয়েছে মহাপুরস্কার।",
                            "verse 57:8": "তোমাদের কি হল যে, তোমরা আল্লাহর প্রতি বিশ্বাস স্থাপন করছ না, অথচ রসূল তোমাদেরকে তোমাদের পালনকর্তার প্রতি বিশ্বাস স্থাপন করার দাওয়াত দিচ্ছেন? আল্লাহ তো পূর্বেই তোমাদের অঙ্গীকার নিয়েছেন-যদি তোমরা বিশ্বাসী হও।",
                            "verse 57:9": "তিনিই তাঁর দাসের প্রতি প্রকাশ্য আয়াত অবতীর্ণ করেন, যাতে তোমাদেরকে অন্ধকার থেকে আলোকে আনয়ন করেন। নিশ্চয় আল্লাহ তোমাদের প্রতি করুণাময়, পরম দয়ালু।",
                            "verse 57:10": "তোমাদেরকে আল্লাহর পথে ব্যয় করতে কিসে বাধা দেয়, যখন আল্লাহই নভোমন্ডল ও ভূমন্ডলের উত্তরাধিকারী? তোমাদের মধ্যে যে মক্কা বিজয়ের পূর্বে ব্যয় করেছে ও জেহাদ করেছে, সে সমান নয়। এরূপ লোকদের মর্যদা বড় তাদের অপেক্ষা, যার পরে ব্যয় করেছে ও জেহাদ করেছে। তবে আল্লাহ উভয়কে কল্যাণের ওয়াদা দিয়েছেন। তোমরা যা কর, আল্লাহ সে সম্পর্কে সম্যক জ্ঞাত।",
                            "verse 57:11": "কে সেই ব্যক্তি, যে আল্লাহকে উত্তম ধার দিবে, এরপর তিনি তার জন্যে তা বহুগুণে বৃদ্ধি করবেন এবং তার জন্যে রয়েছে সম্মানিত পুরস্কার।",
                            "verse 57:12": "যেদিন আপনি দেখবেন ঈমানদার পুরুষ ও ঈমানদার নারীদেরকে, তাদের সম্মুখ ভাগে ও ডানপার্শ্বে তাদের জ্যোতি ছুটোছুটি করবে বলা হবেঃ আজ তোমাদের জন্যে সুসংবাদ জান্নাতের, যার তলদেশে নদী প্রবাহিত, তাতে তারা চিরকাল থাকবে। এটাই মহাসাফল্য।",
                            "verse 57:13": "যেদিন কপট বিশ্বাসী পুরুষ ও কপট বিশ্বাসিনী নারীরা মুমিনদেরকে বলবেঃ তোমরা আমাদের জন্যে অপেক্ষা কর, আমরাও কিছু আলো নিব তোমাদের জ্যোতি থেকে। বলা হবেঃ তোমরা পিছনে ফিরে যাও ও আলোর খোঁজ কর। অতঃপর উভয় দলের মাঝখানে খাড়া করা হবে একটি প্রাচীর, যার একটি দরজা হবে। তার অভ্যন্তরে থাকবে রহমত এবং বাইরে থাকবে আযাব।",
                            "verse 57:14": "তারা মুমিনদেরকে ডেকে বলবেঃ আমরা কি তোমাদের সাথে ছিলাম না? তারা বলবেঃ হঁ্যা কিন্তু তোমরা নিজেরাই নিজেদেরকে বিপদগ্রস্ত করেছ। প্রতীক্ষা করেছ, সন্দেহ পোষণ করেছ এবং অলীক আশার পেছনে বিভ্রান্ত হয়েছ, অবশেষে আল্লাহর আদেশ পৌঁছেছে। এই সবই তোমাদেরকে আল্লাহ সম্পর্কে প্রতারিত করেছে।",
                            "verse 57:15": "অতএব, আজ তোমাদের কাছ থেকে কোন মুক্তিপন গ্রহণ করা হবে না। এবং কাফেরদের কাছ থেকেও নয়। তোমাদের সবার আবাস্থল জাহান্নাম। সেটাই তোমাদের সঙ্গী। কতই না নিকৃষ্ট এই প্রত্যাবর্তন স্থল।",
                            "verse 57:16": "যারা মুমিন, তাদের জন্যে কি আল্লাহর স্মরণে এবং যে সত্য অবর্তীর্ণ হয়েছে, তার কারণে হৃদয় বিগলিত হওয়ার সময় আসেনি? তারা তাদের মত যেন না হয়, যাদেরকে পূর্বে কিতাব দেয়া হয়েছিল। তাদের উপর সুদীর্ঘকাল অতিক্রান্ত হয়েছে, অতঃপর তাদের অন্তঃকরণ কঠিন হয়ে গেছে। তাদের অধিকাংশই পাপাচারী।",
                            "verse 57:17": "তোমরা জেনে রাখ, আল্লাহই ভূ-ভাগকে তার মৃত্যুর পর পুনরুজ্জীবিত করেন। আমি পরিস্কারভাবে তোমাদের জন্যে আয়াতগুলো ব্যক্ত করেছি, যাতে তোমরা বোঝ।",
                            "verse 57:18": "নিশ্চয় দানশীল ব্যক্তি ও দানশীলা নারী, যারা আল্লাহকে উত্তমরূপে ধার দেয়, তাদেরকে দেয়া হবে বহুগুণ এবং তাদের জন্যে রয়েছে সম্মানজনক পুরস্কার।",
                            "verse 57:19": "আর যারা আল্লাহ ও তাঁর রসূলের প্রতি বিশ্বাস স্থাপন করে তারাই তাদের পালনকর্তার কাছে সিদ্দীক ও শহীদ বলে বিবেচিত। তাদের জন্যে রয়েছে পুরস্কার ও জ্যোতি এবং যারা কাফের ও আমার নিদর্শন অস্বীকারকারী তারাই জাহান্নামের অধিবাসী হবে।",
                            "verse 57:20": "তোমরা জেনে রাখ, পার্থিব জীবন ক্রীড়া-কৌতুক, সাজ-সজ্জা, পারস্পরিক অহমিকা এবং ধন ও জনের প্রাচুর্য ব্যতীত আর কিছু নয়, যেমন এক বৃষ্টির অবস্থা, যার সবুজ ফসল কৃষকদেরকে চমৎকৃত করে, এরপর তা শুকিয়ে যায়, ফলে তুমি তাকে পীতবর্ণ দেখতে পাও, এরপর তা খড়কুটা হয়ে যায়। আর পরকালে আছে কঠিন শাস্তি এবং আল্লাহর ক্ষমা ও সন্তুষ্টি। পার্থিব জীবন প্রতারণার উপকরণ বৈ কিছু নয়।",
                            "verse 57:21": "তোমরা অগ্রে ধাবিত হও তোমাদের পালনকর্তার ক্ষমা ও সেই জান্নাতের দিকে, যা আকাশ ও পৃথিবীর মত প্রশস্ত। এটা প্রস্তুত করা হয়েছে আল্লাহ ও তাঁর রসূলগণের প্রতি বিশ্বাসস্থাপনকারীদের জন্যে। এটা আল্লাহর কৃপা, তিনি যাকে ইচ্ছা, এটা দান করেন। আল্লাহ মহান কৃপার অধিকারী।",
                            "verse 57:22": "পৃথিবীতে এবং ব্যক্তিগতভাবে তোমাদের উপর কোন বিপদ আসে না; কিন্তু তা জগত সৃষ্টির পূর্বেই কিতাবে লিপিবদ্ধ আছে। নিশ্চয় এটা আল্লাহর পক্ষে সহজ।",
                            "verse 57:23": "এটা এজন্যে বলা হয়, যাতে তোমরা যা হারাও তজ্জন্যে দুঃখিত না হও এবং তিনি তোমাদেরকে যা দিয়েছেন, তজ্জন্যে উল্লসিত না হও। আল্লাহ কোন উদ্ধত অহংকারীকে পছন্দ করেন না,",
                            "verse 57:24": "যারা কৃপণতা করে এবং মানুষকে কৃপণতার প্রতি উৎসাহ দেয়, যে মুখ ফিরিয়ে নেয়, তার জানা উচিত যে, আল্লাহ অভাবমুক্ত, প্রশংসিত।",
                            "verse 57:25": "আমি আমার রসূলগণকে সুস্পষ্ট নিদর্শনসহ প্রেরণ করেছি এবং তাঁদের সাথে অবতীর্ণ করেছি কিতাব ও ন্যায়নীতি, যাতে মানুষ ইনসাফ প্রতিষ্ঠা করে। আর আমি নাযিল করেছি লৌহ, যাতে আছে প্রচন্ড রণশক্তি এবং মানুষের বহুবিধ উপকার। এটা এজন্যে যে, আল্লাহ জেনে নিবেন কে না দেখে তাঁকে ও তাঁর রসূলগণকে সাহায্য করে। আল্লাহ শক্তিধর, পরাক্রমশালী।",
                            "verse 57:26": "আমি নূহ ও ইব্রাহীমকে রসূলরূপে প্রেরণ করেছি এবং তাদের বংশধরের মধ্যে নবুওয়ত ও কিতাব অব্যাহত রেখেছি। অতঃপর তাদের কতক সৎপথপ্রাপ্ত হয়েছে এবং অধিকাংশই হয়েছে পাপাচারী।",
                            "verse 57:27": "অতঃপর আমি তাদের পশ্চাতে প্রেরণ করেছি আমার রসূলগণকে এবং তাদের অনুগামী করেছি মরিয়ম তনয় ঈসাকে ও তাকে দিয়েছি ইঞ্জিল। আমি তার অনুসারীদের অন্তরে স্থাপন করেছি নম্রতা ও দয়া। আর বৈরাগ্য, সে তো তারা নিজেরাই উদ্ভাবন করেছে; আমি এটা তাদের উপর ফরজ করিনি; কিন্তু তারা আল্লাহর সন্তুষ্টি লাভের জন্যে এটা অবলম্বন করেছে। অতঃপর তারা যথাযথভাবে তা পালন করেনি। তাদের মধ্যে যারা বিশ্বাসী ছিল, আমি তাদেরকে তাদের প্রাপ্য পুরস্কার দিয়েছি। আর তাদের অধিকাংশই পাপাচারী।",
                            "verse 57:28": "মুমিনগণ, তোমরা আল্লাহকে ভয় কর এবং তাঁর রসূলের প্রতি বিশ্বাস স্থাপন কর। তিনি নিজে অনুগ্রহের দ্বিগুণ অংশ তোমাদেরকে দিবেন, তোমাদেরকে দিবেন জ্যোতি, যার সাহায্যে তোমরা চলবে এবং তোমাদেরকে ক্ষমা করবেন। আল্লাহ ক্ষমাশীল, দয়াময়।",
                            "verse 57:29": "যাতে কিতাবধারীরা জানে যে, আল্লাহর সামান্য অনুগ্রহের উপর ও তাদের কোন ক্ষমতা নেই, দয়া আল্লাহরই হাতে; তিনি যাকে ইচ্ছা, তা দান করেন। আল্লাহ মহা অনুগ্রহশীল।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 57:1": "Всичко на небесата и всичко на земята прославя Аллах. Той е Всемогъщия, Премъдрия.",
                            "verse 57:2": "Негова е властта на небесата и на земята. Той съживява и Той умъртвява. Той за всяко нещо има сила.",
                            "verse 57:3": "Той е Изначалния и Безкрайния, и Явния, и Скрития. Той всяко нещо знае.",
                            "verse 57:4": "Той е, Който сътвори небесата и земята в шест дни, после се въздигна [безподобен] Той на Трона. Той знае какво прониква в земята и какво излиза от нея, и какво пада от небето, и какво се издига на него. Той е с вас, където и да сте. Аллах съзира вашите де",
                            "verse 57:5": "Негово е владението на небесата и на земята. При Аллах ще бъдат върнати делата.",
                            "verse 57:6": "Той въвежда нощта в деня и въвежда деня в нощта. И знае съкровеното в сърцата.",
                            "verse 57:7": "Вярвайте в Аллах и в Неговия Пратеник, и раздавайте от онова, на което ви стори Той наследници! За онези от вас, които вярват и раздават, за тях ще има голяма награда.",
                            "verse 57:8": "И какво ви е, защо да не повярвате в Аллах, когато Пратеника ви зове да повярвате във вашия Господ, и Той вече получи вашия обет, ако сте вярващи?",
                            "verse 57:9": "Той е, Който низпослава на Своя раб ясни знамения, за да ви изведе от тъмнините към светлината. Аллах към вас е състрадателен, милосърден.",
                            "verse 57:10": "И какво ви е, защо да не раздавате по пътя на Аллах? На Аллах принадлежи наследството на небесата и на земята. Онези от вас, които раздаваха преди завземането [на Мека] и се сражаваха, не са равни [с останалите]. Те са на по-високо стъпало от онези, които",
                            "verse 57:11": "На онзи, който дава хубав заем [по пътя] на Аллах Той ще му го умножи и за него ще има щедра награда.",
                            "verse 57:12": "В Деня, когато видиш вярващите мъже и жени с тяхната светлина, устремена пред тях, и в десниците им [тогава ще им се каже:] Радостната вест за вас Днес са Градините, сред които реки текат. В тях ще пребивавате вечно. Това е великото спасение.",
                            "verse 57:13": "В този Ден лицемерите и лицемерките ще кажат на вярващите: Почакайте ни, за да придобием от вашата светлина! Ще им бъде казано: Върнете се назад и търсете светлина! И ще се въздигне между тях стена с врата. Отвътре ще е милостта, а от външната страна",
                            "verse 57:14": "Ще им се прогласи: Не бяхме ли с вас? Ще кажат [вярващите]: Да, наистина, ала ви изкусиха вашите души и дебнехте, и се съмнявахте, и ви подмамиха вашите мечти, докато се яви повелята на Аллах. Измамникът [сатана] ви измами за Аллах.",
                            "verse 57:15": "Днес не ще бъде взет откуп нито от вас, нито от онези, които не повярваха. Вашето обиталище е Огънят. Той най-добре ви подхожда. И колко лоша е тази участ!",
                            "verse 57:16": "Не е ли настъпило за вярващите време сърцата им да се смирят при споменаването на Аллах и пред истината, която бе низпослана, и да не станат като дарените с Писанието преди, за които срокът бе дълъг, и закоравяха сърцата им, и мнозина от тях бяха нечестив",
                            "verse 57:17": "Знайте, че Аллах съживява земята след нейната смърт! Разясняваме ви знаменията, за да проумеете!",
                            "verse 57:18": "На раздаващите милостиня мъже и жени, които дават хубав заем на Аллах, ще им бъде умножено и ще има за тях щедра награда.",
                            "verse 57:19": "Онези, които вярват в Аллах и в Неговите пратеници, те са всеправдивите и мъчениците. При техния Господ ще имат награда и светлина. А онези, които не вярват и взимат за лъжа Нашите знамения, те са обитателите на Огъня.",
                            "verse 57:20": "Знайте, че земният живот е само игра и забава, и украса, и хвалба между вас, и умножаване на имотите и децата, подобно на растения след дъжд - възхищават сеячите, после изсъхват и ги виждаш пожълтели, после стават на съчки. А в отвъдния живот има сурово",
                            "verse 57:21": "Надпреварвайте се към опрощение от вашия Господ и към Градината с ширина, колкото ширината на небето и на земята, приготвена за онези, които повярваха в Аллах и в Неговите пратеници! Това е благодатта на Аллах. Дава я Той комуто пожелае. Аллах е Господаря",
                            "verse 57:22": "Не се случва беда, преди да сме я породили, нито на земята, нито с вас самите, без да е [записана] в Книга. За Аллах това е лесно.",
                            "verse 57:23": "За да не страдате за онова, което ви се е изплъзнало и да не ликувате за онова, което ви е дошло. Аллах не обича горделивите, самохвалците,",
                            "verse 57:24": "които се скъпят и повеляват на хората скъперничество. А който се отвърне - Аллах е Пребогатия, Всеславния.",
                            "verse 57:25": "Изпратихме Нашите пратеници с ясните знаци и низпослахме заедно с тях Книгата и везната, за да постъпват хората справедливо. И създадохме желязото. В него има огромна сила и облаги за хората, и за да изпита Аллах кой дори в уединение помага на Него [в рел",
                            "verse 57:26": "И изпратихме Нух и Ибрахим, и отредихме сред тяхното потомство да бъдат пророчеството и Писанието. Някои от тях са на правия път, но мнозина от тях са нечестивци.",
                            "verse 57:27": "Сетне проводихме по стъпките им Нашите пратеници, и проводихме след тях Иса, сина на Мариам, и му дадохме Евангелието, и вложихме в сърцата на онези, които го последваха, състрадание и милосърдие. Но монашеството го измислиха те, не сме им го предписали Н",
                            "verse 57:28": "О, вярващи, бойте се от Аллах и вярвайте в Неговия Пратеник! Той ще ви даде двоен дял от Своята милост. И ще стори за вас светлина, с която ще вървите. И ще ви опрости. Аллах е опрощаващ, милосърден.",
                            "verse 57:29": "За да узнаят хората на Писанието, че нямат власт над нищо от благодатта на Аллах и че благодатта е в Ръката на Аллах. Дава я Той комуто пожелае. Аллах е Владетелят на великата благодат."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "天地萬物，都讚頌真主超絕萬物，他確是萬能的，確是至睿的。",
                            "verse 57:2": "天地的國權，歸他所有；他能使人生，能使人死；他對於萬事，是全能的。",
                            "verse 57:3": "他是前無始後無終的，是極顯著極隱微的，他是全知萬物的。",
                            "verse 57:4": "他是在六日內創造天地，然後升上寶座的。他知道潛入地中的，和從地中生出的，與從天空降下的，和升上天空的。無論你們在哪裡，他是與你們同在的；他是鑒察你們的行為的。",
                            "verse 57:5": "天地的國權，歸他所有；萬事只歸於真主。",
                            "verse 57:6": "他使黑夜侵入白晝，使白晝侵入黑夜；他是全知心事的。",
                            "verse 57:7": "你們應當信仰真主和使者，你們應當分捨他所委你們代管的財產，你們中信道而且施捨者，將受重大的服酬。",
                            "verse 57:8": "你們怎麼不信仰真主呢？使者號召你們去信仰你們的主，而你們的主，確已和你們締約，如果你們要信道，就趕快信吧！",
                            "verse 57:9": "他降示他的僕人許多明証，以便他使你們從重重黑暗走入光明。真主對於你們，確是仁愛的，確是至慈的。",
                            "verse 57:10": "你們怎麼不為真主而施捨呢？天地的遺產，只是真主的。你們中在勝利之前施捨而且參戰者，與在勝利之後施捨而且參戰者，不是平等的，前者比後者品級更高。真主以最優的報酬應許每派人，真主是徹知你們的行為的。",
                            "verse 57:11": "誰以善債借給真主呢？真主將加倍償還他，他還受優厚的報酬。",
                            "verse 57:12": "在那日，你將看見男女信士們，他們的光輝，在他們的前面和右邊奔馳，有人將對他們說：「你們今日的佳音，是下臨諸河的樂園；你們將永居其中，那確是偉大的成功。」",
                            "verse 57:13": "在那日，偽信的男女，將對信道的男女說：「請你們等候我們，讓我們借你們的一點光輝！」有人將要對他們說：「你們轉回去尋求光輝吧！」於是，彼此之間，築起了一堵隔壁來，隔壁上有一道門，門內有恩惠，門外有刑罰。",
                            "verse 57:14": "他們將喊叫信道的人們說：「難道我們與你們不是同道嗎？」他們說：「不然，你們自欺、觀望、懷疑正道，種種妄想，欺騙你們，直到真主的命令來臨，猾賊曾以真主的優容欺騙你們。",
                            "verse 57:15": "故今日你們與不信道者的罰金，都不被接受，你們的歸宿是火獄，那對於你們是更相宜的，那歸宿真惡劣！」",
                            "verse 57:16": "難道信士們以為時間還未到，故他們的心不為真主的教誨和他所降示的真理而柔和嗎？他們不可以像以前曾奉天經的人們那樣，經過長時期後，他們的心就變硬了，他們中有許多人是犯罪的。",
                            "verse 57:17": "你們應當知道真主是使已死的大地復活的，我確已為你們解釋了許多蹟象，以便你們明理。",
                            "verse 57:18": "施財的士女，和以善債借給真主的士女，他必定加倍償還他們，他們將受優厚的報酬。",
                            "verse 57:19": "信仰真主和使者的人們，在主那裡，是虔誠者，是見証者，他們將有他們的報酬和光明。不信正道並且否認我的蹟象的人們，是火獄的居民。",
                            "verse 57:20": "你們應當知道：今世生活，只是游戲、娛樂、點綴、矜誇、以財產和子孫的富庶相爭勝；譬如時雨，使田苗滋長，農夫見了非常高興，嗣後，田苗枯槁，你看它變成黃色的，繼而零落。在後世，有嚴厲的刑罰，也有從真主發出的赦宥和喜悅；今世生活，只是欺騙人的享受。",
                            "verse 57:21": "你們應當爭取從你們的主發出的赦宥，和與天地一樣廣闊的樂園——為信仰真主和眾使者的人們而準備的樂園——那是真主的恩典，他將它賞賜他所意欲者。真主是有宏恩的。",
                            "verse 57:22": "大地上所有的災難，和你們自己所遭的禍患，在我創造那些禍患之前，無不記錄在天經中；這事對於真主確是容易的，",
                            "verse 57:23": "以免你們為自己所喪失的而悲傷，為他所賞賜你們的而狂喜。真主是不喜愛一切傲慢者、矜誇者的。",
                            "verse 57:24": "他們自己吝嗇，還教別人吝嗇。規避義務的人們，真主確是無求於他們的，確是可頌的。",
                            "verse 57:25": "我確已派遣我的眾使者，去傳達我的許多明証，並降示天經和公平，以便眾人謹守公道。我曾創造鋼鐵，其中有嚴厲的刑罰，對於眾人，有許多裨益；以便真主知道在秘密中相助他和他的眾使者的人。真主確是至剛的，確是萬能的。",
                            "verse 57:26": "我確已派遣努哈和易卜拉欣，我以預言和天經賞賜他們倆的後裔；他們中有遵循正道的，他們中有許多人是悖逆的。",
                            "verse 57:27": "在他們之後，我曾繼續派遣我的眾使者，我又繼續派遣麥爾彥之子爾撒，我賞賜他《引支勒》，我使他的信徒們心懷仁愛和慈憫。他們自創出家制——我未曾以出家為他們的定制——他們創設此制，以求真主的喜悅；但他們未曾切實的遵守它，故我把報酬賞賜他們中的信道者。他們中有許多人是悖逆的。",
                            "verse 57:28": "信仰爾撒的人們啊！你們應當敬畏真主，應當信仰他的使者，他就把他的恩惠加倍賞賜你們，他就為你們創造一道光明；你們將借那道光明而行走，他就赦宥你們。真主是至赦的，是至慈的。",
                            "verse 57:29": "以便曾受天經的人們知道，他們簡直不能操縱真主的恩典，並且知道，凡恩典都在真主的掌握中，他要賞賜誰，就賞賜誰，真主是有宏恩的。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Chválí Boha vše, co na nebesích je i na zemi - a On mocný je i moudrý.",
                            "verse 57:2": "Jemu náleží království nebes i země a On život i smrt dává a On všech věcí je mocný.",
                            "verse 57:3": "On počátkem je i koncem, zjevný i skrytý; On o každé věci je vševědoucí.",
                            "verse 57:4": "On je ten, jenž stvořil nebesa i zemi v šesti dnech a potom se na trůnu Svém usadil. On zná, co vniká do země a co z ní vychází, co sestupuje z nebe a co na ně vystupuje, a ať jste kdekoliv, On s vámi je a vše, co děláte, zří.",
                            "verse 57:5": "Jemu náleží království nebes i země a k Bohu se rozkazy všechny navracejí.",
                            "verse 57:6": "On dává přejít noci v den a dni v noc a On dobře zná vše, co v hrudích se skrývá.",
                            "verse 57:7": "Věřte v Boha a posla Jeho a rozdávejte z toho, v čem učinil vás posledními vlastníky! Těm z vás, kdož uvěřili a almužnu rozdávali, je určena odměna veliká.",
                            "verse 57:8": "Co je s vámi, že nechcete v Boha uvěřit, když posel Jeho vás vyzývá, abyste uvěřili v Pána svého, a když již On s vámi uzavřel smlouvu - jste-li vskutku věřící?",
                            "verse 57:9": "On je ten, jenž seslal služebníku Svému znamení jasná, aby vás vyvedl z temnot ke světlu. A Bůh je vůči vám shovívavý, slitovný.",
                            "verse 57:10": "Co je s vámi, že nechcete rozdávat na cestě Boží, když Bohu přece připadne dědictví nebes a země? Ti z vás, kdož rozdávali a bojovali ještě před vítězstvím, nejsou stejní jako ti, kdož vyčkávali; ti první jsou mnohem výše na stupních než ti, kdo rozdávali a bojovali až po něm. Však obojím Bůh přislíbil odměnu překrásnou a Bůh je dobře zpraven o všem, co děláte.",
                            "verse 57:11": "Kdo tedy bude tím, jenž poskytne Bohu krásnou půjčku, aby mu ji Bůh dvojnásobně splatil a dostalo se mu odměny veliké?",
                            "verse 57:12": "V den, kdy spatříš, jak před věřícími muži a ženami a po pravici jejich poběží světlo jejich, bude jim řečeno: \"Radostná zpráva pro vás: dnes vstoupíte do zahrad, pod nimiž řeky tekou a v nichž nesmrtelní budete!\" A to věru bude úspěch nesmírný.",
                            "verse 57:13": "V ten den řeknou pokrytci, muži i ženy, těm, kdož uvěřili:,, Počkejte na nás, abychom si mohli vzít něco ze světla vašeho!\" A bude jim řečeno: \"Vraťte se nazpět a hledejte světlo jinde!\" A bude mezi nimi postavena zeď, v níž bude brána: uvnitř bude milosrdenství a zvnějška, naproti nim, bude trest.",
                            "verse 57:14": "A zavolají na ně pokrytci: \"Cožpak jsme nebyli s vámi?\" Odpovědí: \"Ano, avšak vy sami sebe jste v pokušení uvedli, číhali jste, pochybovali jste a zmámily vás vaše tužby pozemské, až přišel rozkaz Boží a byli jste oklamáni ohledně Boha tím, kdo mámí.",
                            "verse 57:15": "A nebude proto dnes přijato výkupné ani od vás, ani od těch, kdož nevěřili; útulkem vaším bude oheň pekelný a bude i vaším pánem. Jak hnusný je to cíl konečný!\"",
                            "verse 57:16": "Což nepřišel čas pro ty, kdož uvěřili, aby srdce jejich se pokořila před připomenutím Božím a před tím, co seslal z pravdy? Nechť nejsou jako ti, jimž zdál se - když dostalo se jim předtím Písma - čas příliš dlouhý; i zatvrdila se srdce jejich a většina z nich byli hanebníci.",
                            "verse 57:17": "Vězte, že Bůh oživuje zemi po smrti její; a již jsme vám vysvětlili znamení - snad budete rozumní!",
                            "verse 57:18": "Těm, kdož rozdávají almužnu, mužům i ženám, a těm, kdož poskytují Bohu krásnou půjčku, těm bude splacena dvojnásobně a dostane se jim odměny štědré.",
                            "verse 57:19": "Věru ti, kdož uvěřili v Boha a posly Jeho, jsou spravedliví a svědky před Pánem svým; jim dostane se jejich odměny a jejich světla. Ti však, kdož znamení Naše za lež prohlašovali, ti budou plamene pekelného obyvateli.",
                            "verse 57:20": "Vězte, že život pozemský je pouze hra a zábava, marná okrasa, vzájemné vychloubání mezi vámi a soupeření v rozmnožování majetku a dětí. A podobá se dešti: nevěřícím se líbí rostlinstvo, jež z něho vyrůstá, avšak potom vadne a vidíš je zežloutlé, až nakonec se stane slámou suchou. A v životě budoucím je jednak trest přísný, avšak i odpuštění a zalíbení se Bohu. A život pozemský není leč užívání klamavé.",
                            "verse 57:21": "Předstihujte se tedy, abyste dosáhli odpuštění Pána svého a zahrady, jejíž šíře se rovná nebi i zemi, připravené pro ty, kdož v Boha a posly Jeho uvěřili. A toto je přízeň Boží, kterou On uštědřuje, komu chce, vždyť Bůh vládcem je přízně nesmírné.",
                            "verse 57:22": "A nepostihne žádné neštěstí zemi ani osoby vaše, aby nebylo zaneseno v Knize dříve, než jsme je stvořili - a to věru je pro Boha nadmíru snadné.",
                            "verse 57:23": "A jedná tak, abyste si nezoufali nad tím, co vám uniklo, a abyste se neradovali příliš z toho, čeho se vám dostalo. Bůh nemiluje žádného domýšlivce vychloubačného",
                            "verse 57:24": "ani ty, kdož lakotí a lidem lakotu doporučují. A ten, kdo zády se obrátí... vždyť Bůh věru je soběstačný, chvályhodný.",
                            "verse 57:25": "A vyslali jsme již posly s důkazy jasnými a seslali jsme s nimi Písmo a váhu, aby lidé jednali poctivě a seslali jsme také železo, v němž nebezpečí je strašné i užitek pro lidi - aby Bůh poznal ty, kdož pomáhají Jemu i poslům Jeho v tajnosti. A Bůh silný je i mocný.",
                            "verse 57:26": "A vyslali jsme již Noema a Abrahama a vložili jsme do potomstva jejich prorocké poslání i Písmo; a někteří z nich byli na cestě správné, avšak mnozí z nich byli hanebníci.",
                            "verse 57:27": "A potom jsme vypravili v jejich stopách jiné posly své a vypravili jsme Ježíše, syna Mariina, a dali jsme mu Evangelium a vložili do srdcí těch, kdož jej následovali, mírnost a slitování; a mnišství si oni zavedli jako novotu - a nepředepsali jsme jim je - usilujíce zalíbit se Bohu. Avšak oni to nedodrželi vhodným dodržováním. A dali jsme těm z nich, kdož uvěřili, odměnu jejich, avšak mnozí z nich byli hanebníci.",
                            "verse 57:28": "Vy, kteří věříte! Bojte se Boha a věřte v posla Jeho! On dá vám dva podíly z milosrdenství Svého a uštědří vám světlo, s nímž půjdete, a odpustí vám - vždyť Bůh je odpouštějící, slitovný,",
                            "verse 57:29": "aby poznali vlastníci Písma, že nemají moci nad ničím z přízně Boží a že přízeň je jedině v rukou Božích; z ní dává, komu chce. A Bůh vládcem je přízně nesmírné."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Wat er ook in de hemelen en op aarde is, verheerlijkt God; Hij is de Almachtige, de Alwijze.",
                            "verse 57:2": "Van Hem is het koninkrijk der hemelen en der aarde. Hij doet sterven en leven en Hij heeft macht over alle dingen.",
                            "verse 57:3": "Hij is de Eerste en de Laatste, de Zich Manifesterende en de Verborgene, en Hij heeft kennis van alle dingen.",
                            "verse 57:4": "Hij is het Die de hemelen en de aarde in zes dagen schiep; daarna zette Hij zich op de Troon neder. Hij weet wat de aarde ingaat en wat er uit voortkomt, en wat van de hemelen nederkomt en wat er naar toe opstijgt. Hij is met u waar gij ook zijn moogt, want God ziet alles wat gij doet.",
                            "verse 57:5": "Van Hem is het koninkrijk der hemelen en der aarde en naar God worden alle dingen teruggebracht.",
                            "verse 57:6": "Hij laat de nacht in de dag overgaan en de dag in de nacht: en Hij is de Kenner van het innerlijk.",
                            "verse 57:7": "Gelooft in God en Zijn boodschapper en geeft weg van datgene waarvan Hij u erfgenamen heeft gemaakt. En zij onder u die geloven en besteden (als weldaad) zullen een grote beloning ontvangen.",
                            "verse 57:8": "Wat scheelt u dat gij niet in God gelooft, terwijl de boodschapper u roept om in uw Heer te geloven en Hij een verbond met u heeft gesloten, indien gij gelovig zijt?",
                            "verse 57:9": "Hij is het Die duidelijke tekenen nederzendt aan Zijn dienaar om u van de Duisternissen in het Licht te brengen en voorwaar, God is Liefderijk Genadevol.",
                            "verse 57:10": "Waarom geeft gij niet terwille van God, terwijl aan God de erfenis van de hemelen en de aarde behoort? Degenen onder u die (geld) besteedden en streden vóór de overwinning zijn niet gelijk maar hoger in rang dan degenen die nadien (geld) besteedden en streden. En God heeft aan allen het goede beloofd. En God is op de hoogte van hetgeen gij doet.",
                            "verse 57:11": "Ieder die met God een goede lening sluit - Hij zal deze voor hem vermenigvuldigen en hem zal bovendien een voortreffelijke beloning ten deel vallen.",
                            "verse 57:12": "En de Dag waarop gij de gelovige mannen en vrouwen zult zien, hun licht vóór hen en aan hun rechter handen uitstralende; verblijdend nieuws is er voor u op deze Dag! Tuinen waar doorheen rivieren stromen, waarin gij zult vertoeven. Dat is de opperste zegepraal.",
                            "verse 57:13": "Op de Dag, waarop huichelaars en huichelaarsters tot de gelovigen zullen zeggen: \"Laat ons iets van uw licht nemen,\" zal er gezegd worden: \"Gaat terug en zoekt licht.\" Dan zal er tussen hen een muur worden opgericht met een poort er in. Aan de binnenkant zal barmhartigheid zijn en aan de buitenkant zal straf zijn.",
                            "verse 57:14": "(De huichelaars zullen tot de gelovigen) roepen: \"Waren wij niet met u?\" Zij zullen antwoorden: \"Ja, maar gij hebt uzelf in verzoeking laten brengen en gewacht en getwijfeld en uw begeerte bedroog u, totdat de verordening van God kwam. En de bedrieger bedroog u ten opzichte van God.",
                            "verse 57:15": "Derhalve zal op deze Dag geen losgeld van u worden aangenomen, noch van degenen die ongelovig waren. Uw tehuis zal het Vuur zijn; dat is uw vriend en het is een slechte bestemming!\"",
                            "verse 57:16": "Is voor de gelovigen de tijd nog niet aangebroken dat hun hart nederig worde om God gedachtig te zijn en de Waarheid (op te nemen), die nedergedaald is? En laten zij niet worden zoals zij die het Boek vóórdien ontvingen - voor dezen was de termijn (te) lang geworden waardoor hun hart werd verhard en velen van hen ongehoorzaam werden.",
                            "verse 57:17": "Weet, dat God de aarde doet herleven na haar dood. Wij hebben de tekenen duidelijk voor u verklaard, opdat gij begrijpen moogt.",
                            "verse 57:18": "De mannen en vrouwen die aalmoezen geven en degenen die met God een goede lening sluiten - deze zal voor hen vermenigvuldigd worden, bovendien zullen zij een eervolle beloning ontvangen.",
                            "verse 57:19": "En zij, die in God en Zijn boodschappers geloven, zijn de waarachtigen en de martelaren in de ogen van hun Heer; zij zullen hun beloning en hun licht ontvangen. Maar zij die Onze boodschappen verwierpen en verloochenden, zullen de bewoners der hel zijn.",
                            "verse 57:20": "Weet, dat het wereldse leven, alleen spel, vermaak, praalvertoon, pochelij onder elkander, wedijver in vermeerdering van rijkdom en kinderen, is als de regen waardoor het plantenleven de kwekers verblijdt. Dan droogt het op, gij ziet het geel worden en vergaan. En in het Hiernamaals is er een strenge straf en God’s vergiffenis en welbehagen. En het leven dezer wereld is niets anders dan een zaak van begoocheling.",
                            "verse 57:21": "Wedijvert om vergiffenis van uw Heer (te verkrijgen) en voor het paradijs, waarvan de breedte gelijk is aan de breedte tussen hemel en aarde, bereid voor degenen, die in God en Zijn boodschappers geloven. Dat is de genade van God. Hij schenkt deze aan wie Hij wil en God is de Heer van grote genade.",
                            "verse 57:22": "Er gebeurt geen ongeluk op aarde of aan uzelf zonder dat het is opgetekend in het Boek voordat Wij het openbaren. Voorzeker - dat is gemakkelijk voor God -",
                            "verse 57:23": "Opdat gij niet moogt treuren over hetgeen gij verloren hebt noch juichen over hetgeen Hij u heeft gegeven, want God heeft geen pocher of opschepper lief",
                            "verse 57:24": "(Noch degenen,) die vrekkig zijn en de mensen aansporen vrekkig te worden en wie zich van Hem afwendt; voorzeker God is Zichzelf-genoeg, Geprezen.",
                            "verse 57:25": "Voorwaar, Wij zonden Onze boodschappers met duidelijke bewijzen en openbaarden hun het Boek en de Weegschaal opdat het mensdom rechtvaardig moge zijn. Wij hebben ijzer nedergezonden, waardoor grote strijd doch ook grote voordelen voor het mensdom ontstaan, opdat God degenen moge onderscheiden, die in het ongeziene Hem en Zijn boodschappers helpen. Zeker, God is Sterk, Almachtig.",
                            "verse 57:26": "En Wij zonden Noach en Abraham, en Wij plaatsten in hun nageslacht het profetenambt en het Boek. En enigen van hen waren op het rechte pad, maar de meesten hunner waren overtreders.",
                            "verse 57:27": "Dan deden Wij Onze boodschappers in hun voetsporen treden en Wij deden Jezus, de zoon van Maria, opvolgen en Wij gaven hem het Evangelie. En Wij legden zachtmoedigheid en barmhartigheid in het hart zijner volgelingen. Doch het kloosterleven schreven Wij hun niet voor, maar zij vonden dit zelf uit om God’s welbehagen te zoeken. Zij namen dit echter niet in acht zoals het behoorde. Toen gaven Wij de gelovigen onder hen een beloning, maar velen onder hen waren overtreders.",
                            "verse 57:28": "O gij gelovigen, vreest God en gelooft in Zijn boodschapper. Hij zal u een dubbel aandeel van Zijn barmhartigheid geven en u een licht verschaffen waarin gij wandelen zult en Hij zal u vergeven: - Voorwaar, God is Vergevensgezind, Genadevol.",
                            "verse 57:29": "Opdat de mensen van het Boek mogen weten, dat zij geen macht hebben over de genade van God - Voorzeker de genade is in God’s handen, Hij geeft deze aan wie Hij wil. En God is de Heer van grote genade."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 57:1": "All that is in the heavens and the earth glorifieth Allah; and He is the Mighty, the Wise.",
                            "verse 57:2": "His is the Sovereignty of the heavens and the earth; He quickeneth and He giveth death; and He is Able to do all things.",
                            "verse 57:3": "He is the First and the Last, and the Outward and the Inward; and He is Knower of all things.",
                            "verse 57:4": "He it is Who created the heavens and the earth in six Days; then He mounted the Throne. He knoweth all that entereth the earth and all that emergeth therefrom and all that cometh down from the sky and all that ascendeth therein; and He is with you wheresoever ye may be. And Allah is Seer of what ye do.",
                            "verse 57:5": "His is the Sovereignty of the heavens and the earth, and unto Allah (all) things are brought back.",
                            "verse 57:6": "He causeth the night to pass into the day, and He causeth the day to pass into the night, and He is knower of all that is in the breasts.",
                            "verse 57:7": "Believe in Allah and His messenger, and spend of that whereof He hath made you trustees; and such of you as believe and spend (aright), theirs will be a great reward.",
                            "verse 57:8": "What aileth you that ye believe not in Allah, when the messenger calleth you to believe in your Lord, and He hath already made a covenant with you, if ye are believers ?",
                            "verse 57:9": "He it is Who sendeth down clear revelations unto His slave, that He may bring you forth from darkness unto light; and lo! for you, Allah is Full of Pity, Merciful.",
                            "verse 57:10": "And what aileth you that ye spend not in the way of Allah when unto Allah belongeth the inheritance of the heavens and the earth ? Those who spent and fought before the victory are not upon a level (with the rest of you). Such are greater in rank than those who spent and fought afterwards. Unto each hath Allah promised good. And Allah is Informed of what ye do.",
                            "verse 57:11": "Who is he that will lend unto Allah a goodly loan, that He may double it for him and his may be a rich reward ?",
                            "verse 57:12": "On the day when thou (Muhammad) wilt see the believers, men and women, their light shining forth before them and on their right hands, (and wilt hear it said unto them): Glad news for you this day: Gardens underneath which rivers flow, wherein ye are immortal. That is the supreme triumph.",
                            "verse 57:13": "On the day when the hypocritical men and the hypocritical women will say unto those who believe: Look on us that we may borrow from your light! it will be said: Go back and seek for light! Then there will separate them a wall wherein is a gate, the inner side whereof containeth mercy, while the outer side thereof is toward the doom.",
                            "verse 57:14": "They will cry unto them (saying): Were we not with you ? They will say: Yea, verily; but ye tempted one another, and hesitated, and doubted, and vain desires beguiled you till the ordinance of Allah came to pass; and the deceiver deceived you concerning Allah;",
                            "verse 57:15": "So this day no ransom can be taken from you nor from those who disbelieved. Your home is the Fire; that is your patron, and a hapless journey’s end.",
                            "verse 57:16": "Is not the time ripe for the hearts of those who believe to submit to Allah’s reminder and to the truth which is revealed, that they become not as those who received the scripture of old but the term was prolonged for them and so their hearts were hardened, and many of them are evil-livers.",
                            "verse 57:17": "Know that Allah quickeneth the earth after its death. We have made clear Our revelations for you, that haply ye may understand.",
                            "verse 57:18": "Lo! those who give alms, both men and women, and lend unto Allah a goodly loan, it will be doubled for them, and theirs will be a rich reward.",
                            "verse 57:19": "And those who believe in Allah and His messengers, they are the loyal, and the martyrs are with their Lord; they have their reward and their light; while as for those who disbelieve and deny Our revelations, they are owners of hell-fire.",
                            "verse 57:20": "Know that the life of the world is only play, and idle talk, and pageantry, and boasting among you, and rivalry in respect of wealth and children; as the likeness of vegetation after rain, whereof the growth is pleasing to the husbandman, but afterward it drieth up and thou seest it turning yellow, then it becometh straw. And in the Hereafter there is grievous punishment, and (also) forgiveness from Allah and His good pleasure, whereas the life of the world is but matter of illusion.",
                            "verse 57:21": "Race one with another for forgiveness from your Lord and a Garden whereof the breadth is as the breadth of the heavens and the earth, which is in store for those who believe in Allah and His messengers. Such is the bounty of Allah, which He bestoweth upon whom He will, and Allah is of Infinite Bounty.",
                            "verse 57:22": "Naught of disaster befalleth in the earth or in yourselves but it is in a Book before we bring it into being - Lo! that is easy for Allah -",
                            "verse 57:23": "That ye grieve not for the sake of that which hath escaped you, nor yet exult because of that which hath been given. Allah loveth not all prideful boasters,",
                            "verse 57:24": "Who hoard and who enjoin upon the people avarice. And whosoever turneth away, still Allah is the Absolute, the Owner of Praise.",
                            "verse 57:25": "We verily sent Our messengers with clear proofs, and revealed with them the Scripture and the Balance, that mankind may observe right measure; and He revealed iron, wherein is mighty power and (many) uses for mankind, and that Allah may know him who helpeth Him and His messengers, though unseen. Lo! Allah is Strong, Almighty.",
                            "verse 57:26": "And We verily sent Noah and Abraham and placed the prophethood and the scripture among their seed, and among them there is he who goeth right, but many of them are evil-livers.",
                            "verse 57:27": "Then We caused Our messengers to follow in their footsteps; and We caused Jesus, son of Mary, to follow, and gave him the Gospel, and placed compassion and mercy in the hearts of those who followed him. But monasticism they invented - We ordained it not for them - only seeking Allah’s pleasure, and they observed it not with right observance. So We give those of them who believe their reward, but many of them are evil-livers.",
                            "verse 57:28": "O ye who believe! Be mindful of your duty to Allah and put faith in His messenger. He will give you twofold of His mercy and will appoint for you a light wherein ye shall walk, and will forgive you. Allah is Forgiving, Merciful;",
                            "verse 57:29": "That the People of the Scripture may know that they control naught of the bounty of Allah, but that the bounty is in Allah’s hand to give to whom He will. And Allah is of Infinite Bounty."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 57:1": "Whatever is in the heavens and on earth,- let it declare the Praises and Glory of God: for He is the Exalted in Might, the Wise.",
                            "verse 57:2": "To Him belongs the dominion of the heavens and the earth: It is He Who gives Life and Death; and He has Power over all things.",
                            "verse 57:3": "He is the First and the Last, the Evident and the Immanent: and He has full knowledge of all things.",
                            "verse 57:4": "He it is Who created the heavens and the earth in Six Days, and is moreover firmly established on the Throne (of Authority). He knows what enters within the earth and what comes forth out of it, what comes down from heaven and what mounts up to it. And He is with you wheresoever ye may be. And God sees well all that ye do.",
                            "verse 57:5": "To Him belongs the dominion of the heavens and the earth: and all affairs are referred back to God.",
                            "verse 57:6": "He merges Night into Day, and He merges Day into Night; and He has full knowledge of the secrets of (all) hearts.",
                            "verse 57:7": "Believe in God and His apostle, and spend (in charity) out of the (substance) whereof He has made you heirs. For, those of you who believe and spend (in charity),- for them is a great Reward.",
                            "verse 57:8": "What cause have ye why ye should not believe in God?- and the Apostle invites you to believe in your Lord, and has indeed taken your Covenant, if ye are men of Faith.",
                            "verse 57:9": "He is the One Who sends to His Servant Manifest Signs, that He may lead you from the depths of Darkness into the Light and verily God is to you most kind and Merciful.",
                            "verse 57:10": "And what cause have ye why ye should not spend in the cause of God?- For to God belongs the heritage of the heavens and the earth. Not equal among you are those who spent (freely) and fought, before the Victory, (with those who did so later). Those are higher in rank than those who spent (freely) and fought afterwards. But to all has God promised a goodly (reward). And God is well acquainted with all that ye do.",
                            "verse 57:11": "Who is he that will Loan to God a beautiful loan? for (God) will increase it manifold to his credit, and he will have (besides) a liberal Reward.",
                            "verse 57:12": "One Day shalt thou see the believing men and the believing women- how their Light runs forward before them and by their right hands: (their greeting will be): \"Good News for you this Day! Gardens beneath which flow rivers! to dwell therein for aye! This is indeed the highest Achievement!\"",
                            "verse 57:13": "One Day will the Hypocrites- men and women - say to the Believers: \"Wait for us! Let us borrow (a Light) from your Light!\" It will be said: \"Turn ye back to your rear! then seek a Light (where ye can)!\" So a wall will be put up betwixt them, with a gate therein. Within it will be Mercy throughout, and without it, all alongside, will be (Wrath and) Punishment!",
                            "verse 57:14": "(Those without) will call out, \"Were we not with you?\" (The others) will reply, \"True! but ye led yourselves into temptation; ye looked forward (to our ruin); ye doubted (God’s Promise); and (your false) desires deceived you; until there issued the Command of God. And the Deceiver deceived you in respect of God.",
                            "verse 57:15": "\"This Day shall no ransom be accepted of you, nor of those who rejected God.\" Your abode is the Fire: that is the proper place to claim you: and an evil refuge it is!\"",
                            "verse 57:16": "Has not the Time arrived for the Believers that their hearts in all humility should engage in the remembrance of God and of the Truth which has been revealed (to them), and that they should not become like those to whom was given Revelation aforetime, but long ages passed over them and their hearts grew hard? For many among them are rebellious transgressors.",
                            "verse 57:17": "Know ye (all) that God giveth life to the earth after its death! already have We shown the Signs plainly to you, that ye may learn wisdom.",
                            "verse 57:18": "For those who give in Charity, men and women, and loan to God a Beautiful Loan, it shall be increased manifold (to their credit), and they shall have (besides) a liberal reward.",
                            "verse 57:19": "And those who believe in God and His apostles- they are the Sincere (lovers of Truth), and the witnesses (who testify), in the eyes of their Lord: They shall have their Reward and their Light. But those who reject God and deny Our Signs,- they are the Companions of Hell-Fire.",
                            "verse 57:20": "Know ye (all), that the life of this world is but play and amusement, pomp and mutual boasting and multiplying, (in rivalry) among yourselves, riches and children. Here is a similitude: How rain and the growth which it brings forth, delight (the hearts of) the tillers; soon it withers; thou wilt see it grow yellow; then it becomes dry and crumbles away. But in the Hereafter is a Penalty severe (for the devotees of wrong). And Forgiveness from God and (His) Good Pleasure (for the devotees of God). And what is the life of this world, but goods and chattels of deception?",
                            "verse 57:21": "Be ye foremost (in seeking) Forgiveness from your Lord, and a Garden (of Bliss), the width whereof is as the width of heaven and earth, prepared for those who believe in God and His apostles: that is the Grace of God, which He bestows on whom he pleases: and God is the Lord of Grace abounding.",
                            "verse 57:22": "No misfortune can happen on earth or in your souls but is recorded in a decree before We bring it into existence: That is truly easy for God:",
                            "verse 57:23": "In order that ye may not despair over matters that pass you by, nor exult over favours bestowed upon you. For God loveth not any vainglorious boaster,-",
                            "verse 57:24": "Such persons as are covetous and commend covetousness to men. And if any turn back (from God’s Way), verily God is Free of all Needs, Worthy of all Praise.",
                            "verse 57:25": "We sent aforetime our apostles with Clear Signs and sent down with them the Book and the Balance (of Right and Wrong), that men may stand forth in justice; and We sent down Iron, in which is (material for) mighty war, as well as many benefits for mankind, that God may test who it is that will help, Unseen, Him and His apostles: For God is Full of Strength, Exalted in Might (and able to enforce His Will).",
                            "verse 57:26": "And We sent Noah and Abraham, and established in their line Prophethood and Revelation: and some of them were on right guidance. But many of them became rebellious transgressors.",
                            "verse 57:27": "Then, in their wake, We followed them up with (others of) Our apostles: We sent after them Jesus the son of Mary, and bestowed on him the Gospel; and We ordained in the hearts of those who followed him Compassion and Mercy. But the Monasticism which they invented for themselves, We did not prescribe for them: (We commanded) only the seeking for the Good Pleasure of God; but that they did not foster as they should have done. Yet We bestowed, on those among them who believed, their (due) reward, but many of them are rebellious transgressors.",
                            "verse 57:28": "O ye that believe! Fear God, and believe in His Apostle, and He will bestow on you a double portion of His Mercy: He will provide for you a Light by which ye shall walk (straight in your path), and He will forgive you (your past): for God is Oft-Forgiving, Most Merciful.",
                            "verse 57:29": "That the People of the Book may know that they have no power whatever over the Grace of God, that (His) Grace is (entirely) in His Hand, to bestow it on whomsoever He wills. For God is the Lord of Grace abounding."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 57:1": "All that is in the heavens and the earth magnifies God; He is the All-mighty, the All-wise.",
                            "verse 57:2": "To Him belongs the Kingdom of the heavens and the earth; He gives life, and He makes to die, and He is powerful over everything.",
                            "verse 57:3": "He is the First and the Last, the Outward and the Inward; He has knowledge of everything.",
                            "verse 57:4": "It is He that created the heavens and the earth in six days then seated Himself upon the Throne. He knows what penetrates into the earth, and what comes forth from it, -- what comes down from heaven, and what goes up unto it. He is with you wherever you are; and God sees the things you do.",
                            "verse 57:5": "To Him belongs the Kingdom of the heavens and the earth; and unto Him all matters are returned.",
                            "verse 57:6": "He makes the night to enter into the day and makes the day to enter into the night. He knows the thoughts within the breasts.",
                            "verse 57:7": "Believe in God and His Messenger, and expend of that unto which He has made you successors. And those of you who believe and expend shall have a mighty wage.",
                            "verse 57:8": "How is it with you, that you believe not in God seeing that the Messenger is calling you to believe in your Lord, and He has taken compact with you, if you are believers?",
                            "verse 57:9": "It is He who sends down upon His servant signs, clear signs, that He may bring you forth from the shadows into the light. Surely God is to you All-gentle, All-compassionate.",
                            "verse 57:10": "How is it with you, that you expend not in the way of God, and to God belongs the inheritance of the heavens and the earth? Not equal is he among you who spent, and who fought before the victory; those are mightier in rank than they who spent and fought afterwards; and unto each God has promised the reward most fair; and God is aware of the things you do.",
                            "verse 57:11": "Who is he that will lend to God a good loan, and He will multiply it for him, and his shall be a generous wage?",
                            "verse 57:12": "Upon the day when thou seest the believers, men and women, their light running before them, and on their right hands. ’Good tidings for you today! Gardens underneath which rivers flow, therein to dwell for ever; that is indeed the mighty triumph.’",
                            "verse 57:13": "Upon the day when the hypocrites, men and women, shall say to those who have believed, ’Wait for us, so that we may borrow your light!’ It shall be said, ’Return you back behind, and seek for a light!’ And a wall shall be set up between them, having a door in the inward whereof is mercy, and against the outward thereof is chastisement.",
                            "verse 57:14": "They shall be calling unto them, ’Were we not with you?’ They shall say, ’Yes indeed; but you tempted yourselves, and you awaited, and you were in doubt, and fancies deluded you, until God’s commandment came, and the Deluder deluded you concerning God.",
                            "verse 57:15": "Therefore today no ransom shall be taken from you, neither from those who disbelieved. Your refuge is the Fire, that is your master -- an evil homecoming!’",
                            "verse 57:16": "Is it not time that the hearts of those who believe should be humbled to the Remembrance of God and the Truth which He has sent down, and that they should not be as those to whom the Book was given aforetime, and the term seemed over long to them, so that their hearts have become hard, and many of them are ungodly?",
                            "verse 57:17": "Know that God revives the earth after it was dead. We have indeed made clear for you the signs, that haply you will understand.",
                            "verse 57:18": "Surely those, the men and the women, who make freewill offerings and have lent to God a good loan, it shall be multiplied for them, and theirs shall be a generous wage.",
                            "verse 57:19": "And those who believe in God and His Messengers -- they are the just men and the martyrs in their Lord’s sight; they have their wage, and their light. But the unbelievers, who have cried lies to Our signs, they are the inhabitants of Hell.",
                            "verse 57:20": "Know that the present life is but a sport and a diversion, an adornment and a cause for boasting among you, and a rivalry in wealth and children. It is as a rain whose vegetation pleases the unbelievers; then it withers, and thou seest it turning yellow, then it becomes broken orts. And in the world to come there is a terrible chastisement, and forgiveness from God and good pleasure; and the present life is but the joy of delusion.",
                            "verse 57:21": "Race to forgiveness from your Lord, and a Garden the breadth whereof is as the breadth of heaven and earth, made ready for those who believe in God and His Messengers. That is the bounty of God; He gives it unto whomsoever He will; and God is of bounty abounding.",
                            "verse 57:22": "No affliction befalls in the earth or in yourselves, but it is in a Book, before We create it; that is easy for God;",
                            "verse 57:23": "that you may not grieve for what escapes you, nor rejoice in what has come to you; God loves not any man proud and boastful,",
                            "verse 57:24": "such as are niggardly, and bid men to be niggardly. And whosoever turns away, God is the All-sufficient, the All-laudable.",
                            "verse 57:25": "Indeed, We sent Our Messengers with the clear signs, and We sent down with them the Book and the Balance so that men might uphold justice. And We sent down iron, wherein is great might, and many uses for men, and so that God might know who helps Him, and His Messengers, in the Unseen. Surely God is All-strong, All-mighty.",
                            "verse 57:26": "And We sent Noah, and Abraham, and We appointed the Prophecy and the Book to be among their seed; and some of them are guided, and many of them are ungodly.",
                            "verse 57:27": "Then We sent, following in their footsteps, Our Messengers; and We sent, following, Jesus son of Mary, and gave unto him the Gospel. And We set in the hearts of those who followed him tenderness and mercy. And monasticism they invented -- We did not prescribe it for them -- only seeking the good pleasure of God; but they observed it not as it should be observed. So We gave those of them who believed their wage; and many of them are ungodly.",
                            "verse 57:28": "O believers, fear God, and believe in His Messenger, and He will give you a twofold portion of His mercy; and He will appoint for you a light whereby you shall walk, and forgive you; God is All-forgiving, All-compassionate;",
                            "verse 57:29": "that the People of the Book may know that they have no power over anything of God’s bounty, and that bounty is in the hand of God; He gives it unto whomsoever He will; and God is of bounty abounding."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 57:1": "ALL THAT IS in the heavens and on earth extols God’s limitless glory: for He alone is almighty, truly wise!",
                            "verse 57:2": "His is the dominion over the heavens and the earth; He grants life and deals death; and He has the power to will anything.",
                            "verse 57:3": "He is the First and the Last, and the Outward as well as the Inward: and He has full knowledge of everything.",
                            "verse 57:4": "He it is who has created the heavens and the earth in six aeons, and is established on the throne of His almightiness.He knows all that enters the earth, and all that comes out of it, as well as all that descends from the skies, and all that ascends to them.And He is with you wherever you may be; and God sees all that you do.",
                            "verse 57:5": "His is the dominion over the heavens and the earth; and all things go back unto God [as their source].",
                            "verse 57:6": "He makes the night grow longer by shortening the day, and makes the day grow longer by shortening the night; and He has full knowledge of what is in the hearts [of men].",
                            "verse 57:7": "BELIEVE in God and His Apostle, and spend on others out of that of which He has made you trustees: for those of you who have attained to faith and who spend freely [in God’s cause] shall have a great reward.",
                            "verse 57:8": "And why should you not believe in God, seeing that the Apostle calls you to believe in [Him who is] your Sustainer, and [seeing that] He has taken a pledge from you? [Why should you not believe in Him] if you are able to believe [in anything]?",
                            "verse 57:9": "It is He who bestows from on high clear messages unto [this] His servant, to lead you out of the deep darkness into the light: for, behold, God is most compassionate towards you, a dispenser of grace.",
                            "verse 57:10": "AAnd why should you not spend freely in the cause of God, seeing that God’s [alone] is the heritage of the heavens and the earth?Not equal are those of you who spent and fought [in God’s cause] before the Victory [and those who did not do so]: they are of a higher rank than those who would spend and fight [only] after it – although God has promised the ultimate good to all [who strive in His cause]. And God is aware of all that you do.",
                            "verse 57:11": "WHO IS IT that will offer up unto God a goodly loan, which He will amply repay?For such [as do so] shall have a noble reward",
                            "verse 57:12": "on the Day when thou shalt see all believing men and believing women, with their light spreading rapidly before them and on their right, [and with this welcome awaiting them:] \"A glad tiding for you today gardens through which running waters flow, therein to abide! This, this is the triumph supreme!\"",
                            "verse 57:13": "On that Day shall the hypocrites, both men and women, speak [thus] unto those who have attained to faith: \"Wait for us! Let us have a [ray of] light from your light!\" [But] they will be told: \"Turn back, and seek a light [of your own]!\"And thereupon a wall will be raised between them [and the believers], with a gate in it: within it will be grace and mercy, and against the outside thereof, suffering.",
                            "verse 57:14": "They [who will remain without] will call out to those [within], \"Were we not with you? – [to which]; the others will answer: \"So it was! But you allowed yourselves to succumb to temptation, and you were hesitant [in your faith], and you were doubtful [of resurrection]; and your wishful thinking beguiled you until God’s command came to pass: for, [indeed, your own] deceptive thoughts about God deluded you!",
                            "verse 57:15": "\"And so, no ransom shall be accepted today from you, and neither from those who were [openly] bent on denying the truth. Your goal is the fire: it is your [only] refuge – and how evil a journey’s end!\"",
                            "verse 57:16": "IS IT NOT time that the hearts of all who have attained to faith should feel humble at the remembrance of God and of all the truth that has been bestowed [on them] from on high, lest they become like those who were granted revelation aforetime, and whose hearts have hardened with the passing of time so that many of them are [now] depraved?",
                            "verse 57:17": "[But] know that God gives life to the earth after it has been lifeless!We have indeed made Our messages clear unto you, so that you might use your reason.",
                            "verse 57:18": "Verily, as for the men and women who accept the truth as true, and who [thus] offer up unto God a goodly loan, they will be amply repaid, and shall have a noble reward [in the life to come].",
                            "verse 57:19": "For they who have attained to faith in God and His apostles – it is they, they who uphold the truth, and they who bear witness [thereto] before their Sustainer: [and so] they shall have their reward and their light!But as for those who are bent on denying the truth and on giving the lie to Our messages – it is they who are destined for the blazing fire!",
                            "verse 57:20": "KNOW [O men] that the life of this world is but a play and a passing delight, and a beautiful show, and [the cause of] your boastful vying with one another, and [of your] greed for more and more riches and children.Its parable is that of [life-giving] rain: the herbage which it causes to grow delights the tillers of the soil; but then it withers, and thou canst see it turn yellow; and in the end it crumbles into dust.But [the abiding truth of man’s condition will become fully apparent] in the life to come: [either] suffering severe, or God’s forgiveness and His goodly acceptance: for the life of this world is nothing but an enjoyment of self-delusion.",
                            "verse 57:21": "[Hence,] vie with one another in seeking to attain to your Sustainer’s forgiveness, and [thus] to a paradise as vast as the heavens and the earth, which has been readied for those who have attained to faith in God and His apostles: such is the bounty of God which He grants unto whomever He wills – for God is limitless in His great bounty.",
                            "verse 57:22": "NO CALAMITY can ever befall the earth, and neither your own selves, unless it be [laid down] in Our decree before We bring it into being: verily, all this is easy for God",
                            "verse 57:23": "[Know this,] so that you may not despair over whatever [good] has escaped you nor exult [unduly] over whatever [good] has come to you: for God does not love any of those who, out of self-conceit, act in a boastful manner –",
                            "verse 57:24": "those who are niggardly [with God’s bounty] and bid others to be niggardly!And he who turns his back [on this truth ought to know that], verily, God alone is self-sufficient, the One to whom all praise is due!",
                            "verse 57:25": "Indeed, [even aforetime] did We send forth Our apostles with all evidence of [this] truth; and through them We bestowed revelation from on high, and [thus gave you] a balance [wherewith to weigh right and wrong], so that men might behave with equity; and We bestowed [upon you] from on high [the ability to make use of] iron, in which there is awesome power as well as [a source of] benefits for man: and [all this was given to you] so that God might mark out those who would stand up for Him and His apostles, even though He [Himself] is beyond the reach of human perception.Verily, God is powerful, almighty!",
                            "verse 57:26": "And, indeed, [to the same end] We sent forth Noah and Abraham [as Our message-bearers], and established prophethood and revelation among their descendants; and some of them were on the right way, but many were iniquitous",
                            "verse 57:27": "And thereupon We caused [other of] Our apostles to follow in their footsteps; and [in the course of time] We caused them to be followed by Jesus, the son of Mary, upon whom We bestowed the Gospel; and in the hearts of those who [truly] followed him We engendered compassion and mercy. But as for monastic asceticism – We did not enjoin it upon them: they invented it themselves out of a desire for God’s goodly acceptance. But then, they did not [always] observe it as it ought to have been observed: and so We granted their recompense unto such of them as had [truly] attained to faith, whereas many of them became iniquitous.",
                            "verse 57:28": "O YOU who have attained to faith! Remain conscious of God, and believe in His Apostle, [and] He will grant you doubly of His grace, and will light for you a light wherein you shall walk, and will forgive you [your past sins]: for God is much-forgiving, a dispenser of grace.",
                            "verse 57:29": "And the followers of earlier revelation should know that they have no power whatever over any of God’s bounty, seeing that all bounty is in God’s hand [alone]: He grants it unto whomever He wills – for God is limitless in His great bounty."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 57:1": "All that is in the heavens and the earth proclaims Allah’s purity, and He is the Mighty, the Wise.",
                            "verse 57:2": "To Him belongs the Kingdom of the heavens and the earth. He gives life and brings death, and He is Powerful to do any thing.",
                            "verse 57:3": "He is the First and the Last, and the Manifest and the Hidden, and He is All-Knowing about every thing.",
                            "verse 57:4": "He is the One who created the heavens and the earth in six days, then He positioned Himself on the Throne. He knows whatever goes into the earth and whatever comes out from it, and whatever descends from the sky, and whatever ascends thereto. He is with you wherever you are, and Allah is watchful of whatever you do.",
                            "verse 57:5": "To Him belongs the kingdom of the heavens and the earth, and to Allah all matters are returned.",
                            "verse 57:6": "He makes the night enter into the day, and makes the day enter into the night, and He is All-Knowing about whatever lies in the hearts.",
                            "verse 57:7": "Believe in Allah and His Messenger, and spend out of that (wealth) in which He has appointed you as deputies. So, for those of you who have believed and spent (in Allah’s way), there is a big reward.",
                            "verse 57:8": "What is wrong with you that you do not believe in Allah, while the Messenger invites you to believe in your Lord, and He has taken your covenant, if you are to believe?",
                            "verse 57:9": "He is the One who reveals clear verses to His servant, so that He brings you out from layers of darkness into the light. And to you, Allah is Very-Kind indeed, Very-Merciful.",
                            "verse 57:10": "And what is wrong with you that you should not spend in the way of Allah, while to Allah belongs the inheritance of the heavens and the earth? Those who spent before the Conquest (of Makkah) and fought are not at par (with others). Those are much greater in rank than those who spent later and fought, though Allah has promised the good (reward) for each. Allah is well aware of what you do.",
                            "verse 57:11": "Who is there to advance a loan, a good loan, to Allah so that He multiplies it for him, and he may have a noble reward?",
                            "verse 57:12": "On the Day when you will see the believing men and the believing women, their light proceeding in front of them and to their right hands, (it will be said to them,) “Good news for you today! Gardens beneath which rivers flow, to live therein forever! That is the great achievement,",
                            "verse 57:13": "- the Day when the hypocrite men and hypocrite women will say to those who believe, “Wait for us, so that we may have a share from your light.”It will be said (to them), “Go back to your rear, and search for light.” Then a wall will be placed between them, which will have a gate. In its inner side, there will be the divine mercy, while towards its outer side, there will be the divine punishment.",
                            "verse 57:14": "They (the hypocrites) will call out to them (the believers), “Were we not with you?” They will say, “Yes, (you were,) but you led your souls to a wrong way, and kept waiting (for an evil end to the Muslims), and remained in doubt, and were deluded by fancies, until Allah’s command came to pass, and you were deceived about Allah by the Big Deceiver (Iblīs).",
                            "verse 57:15": "So, no ransom will be accepted from you today, nor from those who disbelieved (openly). Your abode is the Fire, and it is an evil end.”",
                            "verse 57:16": "Has the time not yet come for those who believe that their hearts should be humble for the remembrance of Allah and for the truth that has descended (through revelation)? They must not be like those to whom the Book was given before, but a long period passed on them (in which they did not repent), therefore their hearts became hard, and (thus) many of them are sinners.",
                            "verse 57:17": "Know well that Allah revives the land after its death. We have made the signs clear for you, so that you may understand.",
                            "verse 57:18": "Surely those men who give Sadaqah (alms) and those women who give Sadaqah and have advanced a good loan to Allah, for them it will be multiplied, and for them there is a noble reward.",
                            "verse 57:19": "And those who believed in Allah and His messengers, - those are the Siddīqs (the most righteous after prophets) and the Shuhadā’ (martyrs) in the sight of your Lord. For them shall be their reward and their light. As for those who disbelieved and rejected Our verses, they are the inmates of Hell.",
                            "verse 57:20": "Know well that the worldly life is but a play and an amusement, and a show of beauty, and exchange of boastful claims between you, and a competition of increase in riches and children. (All this is) like a rain, the growth of which attracts the farmers, then it withers, and you see it turning yellow, then it becomes straw. And in the Hereafter there is a severe punishment (for the disbelievers), and forgiveness from Allah and (Allah’s) pleasure (for the believers and the righteous). The worldly life is nothing but a material of delusion.",
                            "verse 57:21": "Compete each other in proceeding towards forgiveness from your Lord and to Paradise the width of which is like the width of the sky and the earth. It has been prepared for those who believe in Allah and His messengers. That is the bounty of Allah; He gives it to whomsoever He Wills and Allah is the Lord of the great bounty.",
                            "verse 57:22": "No calamity befalls the earth or your own selves, but it is (pre-destined) in a Book before We bring it into being, -Indeed it is easy for Allah.",
                            "verse 57:23": "- so that you may neither grieve on what has escaped you, nor over-exult on what He has given to you. And Allah does not love any self-admirer, over-proud,",
                            "verse 57:24": "-those who are miserly and bid others to be miserly. And whoever turns away, then Allah is the All-Independent, the Ever-Praised.",
                            "verse 57:25": "We have indeed sent Our messengers with clear proofs, and sent down with them the Book and the Balance, so that people may uphold equity. And We sent down iron in which there is strong power, and benefits for the people; and (We did it) so that Allah knows the one who helps Him and His messengers without seeing (Him). Surely Allah is Strong, Mighty.",
                            "verse 57:26": "Indeed We sent NūH and Ibrāhīm, and kept the Book and prophet-hood (continuing) in their progeny. So, some of those (to whom they were sent) were on the right path, and many of them were sinners.",
                            "verse 57:27": "Then We made Our messengers follow them one after the other, then We sent after them ‘Īsā, the son of Maryam (Jesus, son of Mary), and gave him the Injīl, and placed compassion and mercy in the hearts of his followers. As for monasticism, it was invented by them; We did not ordain it for them, but (they adopted it) to seek Allah’s pleasure, then could not observe it as was due. So We gave the believers from among them their reward. And many of them are sinners.",
                            "verse 57:28": "O you who believe, fear Allah, and believe in His Messenger, and He will give you two shares (of reward) out of His mercy, and will make for you a light whereby you will walk, and will forgive you- And Allah is Most-Forgiving, Very-Merciful.",
                            "verse 57:29": "- so that the People of the Book may know that they have no control over any thing from Allah’s bounty, and that bounty is in Allah’s hand; He gives it to whom He wills, and Allah is the Lord of the great bounty."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 57:1": "All that is in the heavens and the earth glorifies God; and He is the Mighty, the Wise.",
                            "verse 57:2": "To Him belongs the kingdom of the heavens and the earth; He gives life and He brings death, and He has power over all things.",
                            "verse 57:3": "He is the First and the Last, and the Manifest and the Hidden and He has knowledge of all things.",
                            "verse 57:4": "It is He Who created the heavens and the earth in six days, then presided upon the Throne. He knows what enters the earth, and what issues from it, and what comes down from the heaven. And He is with you wherever you may be; and God is Seer of what you do.",
                            "verse 57:5": "To Him belongs the kingdom of the heavens and the earth, and to Him [all] matters are returned.",
                            "verse 57:6": "He makes the night pass into the day, and makes the day pass into the night. And He is Knower of what is in the breasts.",
                            "verse 57:7": "Believe in God and His Messenger, and expend out of that over which He has made you successors. For those of you who believe and expend will have a great reward.",
                            "verse 57:8": "And why should you not believe in God when the Messenger is calling you to believe in your Lord, and a pledge has been taken from you if you are believers?",
                            "verse 57:9": "It is He Who sends down upon His servant clear signs that He may bring you forth from the darkness to the light. For truly God is Kind, Merciful to you.",
                            "verse 57:10": "And why should you not expend in the way of God when to God belongs the heritage of the heavens and the earth. Not equal [to the rest of you] are those of you who expended and fought before the victory. Such are greater in rank than those who expended and fought afterwards. Yet to each God has promised the best reward. And God is Aware of what you do.",
                            "verse 57:11": "Who is it that will lend God a goodly loan so that He may multiply it for him, and [so that] there may be for him a generous reward.",
                            "verse 57:12": "The day when you will see the believing men and believing women with their light shining forth before them and on their right: ‘Good tidings for you on this day: Gardens underneath which rivers flow, wherein you will abide. That is the great success’.",
                            "verse 57:13": "The day when the hypocrites, men and women, will say to those who believe, ‘Look at us that we may glean something of your light!’ It will be said: ‘Step back and seek light!’ Then there will be set up between them a wall with a gate, the inner side of which contains mercy, and the outer side of which faces toward the chastisement.",
                            "verse 57:14": "They will call out to them, ‘Did we not use to be with you?’ They will say, ‘Yes, indeed! But you caused your souls to fall into temptation, and you awaited, and you doubted, and [false] hopes deceived you until God’s ordinance came; and the Deceiver deceived you concerning God.",
                            "verse 57:15": "So on this day no ransom will be taken from you nor from those who disbelieved. Your abode will be the Fire: it will be your guardian, and an evil destination!’",
                            "verse 57:16": "Is it not time for those who believe that their hearts should be humbled to the remembrance of God and [to] what has been revealed of the truth, and that they should not be like those who were given the Scripture before? For the stretch of time was too long for them and so their hearts became hardened, and many of them are immoral.",
                            "verse 57:17": "Know that God revives the earth after its death. We have certainly made clear for you the signs that perhaps you may understand.",
                            "verse 57:18": "Indeed men who give voluntary alms and women who give voluntary alms and [those of them] who have lent God a goodly loan, it will be multiplied for them and they will have a generous reward.",
                            "verse 57:19": "And those who believe in God and His messengers — they are the truthful, and the witnesses with their Lord; they will have their reward and their light. But those who disbelieve and deny Our signs, they will be the inhabitants of Hell-fire.",
                            "verse 57:20": "Know that the life of this world is merely play and diversion and glitter, and mutual vainglory in respect of wealth and children; as the likeness of rain whose vegetation the disbelievers admire; [but] then it withers, and you see it turn yellow, then it becomes chaff. And in the Hereafter there is a severe chastisement and forgiveness from God and beatitude; and the life of this world is but the comfort of delusion.",
                            "verse 57:21": "Vie with one another for forgiveness from your Lord and a garden the breadth of which is as the breadth of the heaven and the earth, prepared for those who believe in God and His messengers. That is the bounty of God, which He gives to whomever He will, and God is [dispenser] of tremendous bounty.",
                            "verse 57:22": "No affliction befalls in the earth, or in yourselves, but it is in a Book before We bring it about — that is indeed easy for God,",
                            "verse 57:23": "so that you may not grieve for what escapes you, nor exult at what He has given you. For God does not like any swaggering braggart;",
                            "verse 57:24": "such as are niggardly and bid people to be niggardly. And whoever turns away, still God, He is indeed the Independent, the Praiser.",
                            "verse 57:25": "We have verily sent Our messengers with clear signs, and We revealed with them the Scripture and the Balance, so that mankind may uphold justice. And We sent down iron, wherein is great might, and [many] uses for mankind, and so that God may know those who help Him and His messengers through the Unseen. Assuredly God is Strong, Mighty.",
                            "verse 57:26": "And verily We sent Noah and Abraham and We ordained among their seed prophethood and the Scripture; and some of them are [rightly] guided, and many of them are immoral.",
                            "verse 57:27": "Then We sent to follow in their footsteps Our messengers, and We sent to follow, Jesus son of Mary, and We gave him the Gospel, and We placed in the hearts of those who followed him kindness and mercy. But [as for] monasticism, they invented it — We had not prescribed it for them — only seeking God’s beatitude. Yet they did not observe it with due observance. So We gave those of them who believed their reward; but many of them are immoral.",
                            "verse 57:28": "O you who believe, fear God and believe in His Messenger, and He will give you a twofold portion of His mercy; and He will assign for you a light by which you will walk and forgive you; for God is Forgiving, Merciful;",
                            "verse 57:29": "So that the People of the Scripture may know that they have no power over anything of God’s bounty, and that [all] bounty is in God’s hand; He gives it to whomever He will; and God is [dispenser] of tremendous bounty."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 57:1": "All those who are in the heavens and the earth glorify Allah alone, and only He is the Lord of Honour, Most Wise.",
                            "verse 57:2": "His is the kingdom of the heavens and the earth. He is the One Who gives life and causes death, and He wields Absolute Power over everything.",
                            "verse 57:3": "He is the One Who is the First (of all) and the Last (of all). And He is Manifest (as for His Power) and Hidden (as goes His Essence). And He knows everything full well.",
                            "verse 57:4": "He is the One Who created the heavens and the earth in six periods, then unveiled His Might taking the Throne of sovereignty of the universe (i.e., organized the whole universe under His command befitting His Glory). He knows what goes into the earth and what comes out of it, and what descends (or comes forth) from the heavenly bodies or what ascends to (or goes into) them. Wherever you are, He is with you. And Allah monitors best what you do.",
                            "verse 57:5": "His is the entire kingdom of the heavens and the earth, and to Him are returned all the affairs.",
                            "verse 57:6": "He is the One Who makes the night pass into the day and the day pass into the night. And He is also Well Aware of the (hidden) contents of the hearts.",
                            "verse 57:7": "Believe in Allah and His Messenger (blessings and peace be upon him) and spend (in His cause) out of that (wealth) in which He has made you His vicegerents (and trustees). So those of you who believe and spend (in His way), for them is mighty reward.",
                            "verse 57:8": "And what is the matter with you that you do not believe in Allah whilst the Messenger (blessings and peace be upon him) is giving you the call to believe in your Lord? And surely, Allah has already taken a firm covenant from you if you are believers.",
                            "verse 57:9": "He is the One Who sends down clear signs to His (exalted) servant so that He may bring you out of the darkness into the light. Surely, Allah is the Most Clement, Ever-Merciful towards you.",
                            "verse 57:10": "And what is the matter with you that you do not spend in the way of Allah, whereas the ownership of the heavens and the earth belongs to Allah alone (you are merely His vicegerents)? Those of you who spent (their wealth in the way of Allah before Meccan Victory) and fought (in their defence), they (and you) cannot be equal. They are far higher in rank than those who spent their wealth afterwards and fought. But Allah has promised the most pleasing end (i.e., Paradise) to all in the Hereafter. And Allah is Well Aware of what you do.",
                            "verse 57:11": "Who will make a good loan to Allah so that He may increase it (the loan) for him manifold? And a generous reward awaits him.",
                            "verse 57:12": "(O Beloved!) The Day when you will see the believing men and the believing women (of your Umma [Community]) with their light heading fast in front of them and on their right (it will be said to them:) ‘Good news to you. Today there are Gardens for you with streams flowing under them. (You) will live in them forever. That is but a great success.’",
                            "verse 57:13": "The Day when the hypocritical men and the hypocritical women will say to the believers: ‘Look towards us (also a little considerately) so that we may take some of your light,’ it will be said to them: ‘Go back and look for light (there where you used to deny the light).’ So a wall will be raised between them (just then) with a door in it. Inside it will be mercy, and outside it will be torment from that direction.",
                            "verse 57:14": "They (the hypocrites) will call out those (believers), saying: ‘Were we not in your company (in the world)?’ They will say: ‘Yes indeed! But you troubled yourselves with the disruption (of hypocrisy) and used to wait (for our woe and destruction). And you doubted (the Prophethood of Muhammad [blessings and peace be upon him] and the Din [Religion of Islam]), and your false hopes deceived you till the command of Allah (i.e., death) reached, and the Arch-Deceiver (Satan) kept deluding you about Allah.",
                            "verse 57:15": "So T oday, (O hypocrites,) no recompense will be accepted from you or from those who disbelieved. Hell is the abode for you (all). And it is this (abode) which is your mawla (companion). And quite an evil resort is that (because you denied accepting those as mawla from whom the charity of the light of faith and forgiveness is obtained).",
                            "verse 57:16": "Has the time not (yet) come for the believers that their hearts get humbled with tenderness for the remembrance of Allah, and for that truth (as well) which has been sent down, and that they do not become like those who were given the Book before this, then a long time passed over them and their hearts hardened? And many of them are disobedient.",
                            "verse 57:17": "Know that Allah alone brings the earth to life after it is dead. And surely, We have made signs clear for you so that you may put your reason to work.",
                            "verse 57:18": "Surely, both the men and the women who give charity and those who lend a goodly loan to Allah, the (reward of charity) will be increased for them manifold, and there will be most honourable reward for them.",
                            "verse 57:19": "And those who believe in Allah and His Messengers are al-siddiqun (the champions of truth) and al-shuhada’ (the faithful witnesses) in the sight of their Lord. For them is their reward and their light (as well), and those who disbelieved and denied Our Revelations, it is they who are the inmates of Hell.",
                            "verse 57:20": "Know that the life of the world is nothing but a sport and pastime, and superficial beauty, and mutual boasting and self-praise, and ambition to excel in wealth and children over one another. Its similitude is rain whose produce pleases the farmers. Then it dries up. Then you see it turning yellow and then it becomes bits of stubble. And there is severe torment (for the disobedient) in the Hereafter, and forgiveness and great pleasure from Allah (for the obedient). And the life of the world is nothing but belongings that deceive.",
                            "verse 57:21": "(O servants!) Race in pursuit of forgiveness from your Lord and towards Paradise (also) which is as wide as the vast expanse of the heaven and the earth, prepared for those who believe in Allah and His Messengers. This is Allah’s bounty which He gives to whom He wills. And Allah is the Lord of infinite bounty.",
                            "verse 57:22": "No calamity occurs in the earth or in your lives but it is in a Book (al-Lawh al-Mahfuz, the station of Allah’s pre-eternal knowledge,) before We make it happen. Surely, this (all-encompassing and perfect knowledge) is very easy for Allah,",
                            "verse 57:23": "So that you may not grieve over what goes out of your hands, nor gloat in pride over what He grants you. And Allah does not like anyone arrogant and proud—",
                            "verse 57:24": "They who are (themselves) miserly and (also) urge others to be miserly. And he who turns away from (Allah’s injunctions), then surely Allah is (also) Self-Sufficient, Most Praiseworthy.",
                            "verse 57:25": "Verily, We sent Our Messengers with clear signs, and We sent down with them the Book and the balance of justice so that people might grow firm and stable in justice. And (of minerals) We brought forth iron in which there is a fierce force (for weapons and defence) and which has (multiple other) benefits for people (in industrial development). And (the purpose is) that Allah may bring to light the one who helps Him and His Messengers (i.e., the Din [Religion of Islam]) without seeing. Surely, Allah is (Himself) the All-Powerful, the Almighty.",
                            "verse 57:26": "And indeed, We sent Nuh (Noah) and Ibrahim (Abraham), and We placed Prophethood and the revealed Book amongst their children. So (some) of them are rightly guided and most of them are disobedient.",
                            "verse 57:27": "Then in the footsteps of these Messengers, We sent (other) Messengers and We sent ‘Isa, the son of Maryam (Jesus, the son of Mary) after them and gave him the Injil (the Gospel). And We created kindness and mercy in the hearts of those who were (the true) followers (of ‘Isa [Jesus]). And they themselves invented the innovation of monasticism. We did not prescribe it for them. But they (introduced this innovation of monasticism) merely to seek Allah’s pleasure. Then they could not practically keep and maintain that check which was its due (i.e., could not continue its spirit and discipline). So We paid those of them who believed (and continued the innovation of monasticism to seek the pleasure of Allah) their reward. And most of them (who left it and changed their ways) are disobedient.",
                            "verse 57:28": "O believers! Become Godfearing and believe in His (Esteemed) Messenger (blessings and peace be upon him). He will bless you with two portions of His mercy and will bring about light for you to walk in (in the world and in the Hereafter) and will forgive you. And Allah is Most Forgiving, Ever-Merciful.",
                            "verse 57:29": "(The purpose of this exposition is) that the People of the Book may know that they have no control over Allah’s bounty, and that the entire bounty is in the Mighty Hand of Allah alone. He gives it to whom He likes, and Allah is the Lord of infinite bounty, Most Great."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Kaikki taivaassa ja maan päällä julistaa Jumalan kunniaa, sillä Hän on kaikkivoipa, kaikkitietävä.",
                            "verse 57:2": "Hänen on valta taivaassa ja maan päällä, Hän antaa elämän ja Hän säätää kuoleman; Hän voi tehdä kaiken, mitä tahtoo.",
                            "verse 57:3": "Hän on ensimmäinen ja viimeinen, näkyvä ja näkymätön, sillä Hän tietää kaikki.",
                            "verse 57:4": "Hän on luonut taivaat ja maan kuutena päivänä ja sitten asettunut valtaistuimelle. Hän tietää, mitä painuu maan sisään ja mitä siitä versoo esiin, mitä tulee ylhäältä ja mitä nousee ylös. Hän on kanssanne, missä tahansa olettekin, sillä Jumala näkee, mitä teette.",
                            "verse 57:5": "Hänen on taivaiden ja maan valtakunta, ja Jumalan luokse kaikki palaa.",
                            "verse 57:6": "Hän käskee yön valjeta päiväksi, Hän vajottaa päivän yöhön, ja Hän tuntee svdäntemme salat.",
                            "verse 57:7": "Uskokaa Jumalaan ja Hänen sananjulistajaansa ja antakaa almuja siitä, minkä haltijaksi Me olemme teidät asettanut, sillä niitä teistä, jotka uskovat ja jakelevat, odottaa suuri palkinto.",
                            "verse 57:8": "Miksi epäilisitte? Kehoittaahan Hänen sananjulistajansa teitä uskomaan Herraanne; onhan Hän todellakin tehnyt liiton kanssanne, jos olette uskovaisia.",
                            "verse 57:9": "Hän lähettää selvät merkit palvelijalleen, jotta tämä voisi johtaa teitä pimeydestä valoon; sillä totisesti Jumala rakastaa teitä ja on teille armollinen.",
                            "verse 57:10": "Ja miksi ette uhraisi mitään Jumalan asian hyväksi, sillä Jumalalle kuuluu taivaitten ja maan perintöosuus. Ne teistä, jotka uhrasivat varojaan ennen voittoa ja taistelivat, ovat toisenlaisia kuin ne, jotka eivät niin tehneet. He ovat korkeammassa asemassa kuin ne, jotka uhrasivat vasta jälkeenpäin, vaikka taistelivatkin. Itse kullekin heistä on Jumala luvannut hyvää, ja Jumala tietää, mitä te teette.",
                            "verse 57:11": "Sille, joka antaa Jumalalle uhrin, Hän korvaa sen kaksin verroin. Hänen palkkansa on ihana",
                            "verse 57:12": "sinä päivänä, jolloin olet näkevä uskolliset miehet ja naiset, valo edessään ja oikealla puolellaan - »hyvä sanoma lupaa teille sinä päivänä puutarhoja, joita virrat vilvoittavat, teidän asuaksenne niissä; tämä on suurin autuus» -",
                            "verse 57:13": "sinä päivänä tekopyhät miehet ja naiset sanovat niille, jotka uskovat: »Odottakaa meitä, jotta saamme valoa teidän valostanne.» Silloin sanotaan: »Kääntykää takaisin ja etsikää valoa!» Ja heidän välilleen kohoaa erottava muuri, jossa on portti. Muurin sisäpuolella on armo, mutta sen ulkopuolella odottaa kuritus.",
                            "verse 57:14": "Ja he huutavat: »Emmekö me olleet teidän kanssanne?» Nämä vastaavat: »Kyllä, mutta te saatoitte sielunne kiusaukseen, odotitte ja epäröitte, ja turhat halunne pettivät teitä siihen saakka, kunnes Jumalan tuomio koitti; ja suuri viettelijä sai teidät tottelemattomiksi Jumalaa kohtaan,",
                            "verse 57:15": "niin että tänä päivänä ei oteta vastaan lunnaita teiltä eikä niiltä, jotka valitsivat epäuskon. Teidän on oltava tulessa, se on oleva seuralaisenne; kurja on olinpaikkanne.",
                            "verse 57:16": "Eikö ole aika niiden, jotka uskovat, nöyrtyä sydämissään, muistaa Jumalaa ja Hänen lähettämäänsä totuutta, jotta heidän ei kävisi kuin niiden, joille Kirjoitus annettiin aikaisemmin, niin että heidän aikansa näytti pidennetyltä, mutta jotka paaduttivat sydämensä ja joista useimmista tuli lainrikkojia.",
                            "verse 57:17": "Tietäkää, että Jumala elvyttää maan sen kuihtumuksesta. Me olemme totisesti kirkastaneet teille tunnusmerkit ymmärtääksenne.",
                            "verse 57:18": "Armeliaille miehille ja naisille ja niille, jotka kantavat Jumalalle hyvän uhrin, Hän korvaa sen kaksin verroin, ja heidän palkkansa on oleva ihana.",
                            "verse 57:19": "Ne, jotka uskovat Jumalaan ja Hänen sananjulistajiinsa, ovat todistajia Herransa edessä; he saavat palkkansa ja valonsa; mutta ne, jotka valitsevat epäuskon ja väittävät merkkejämme valheeksi, joutuvat helvetin asukkaiksi.",
                            "verse 57:20": "Tietäkää, että tämän maailman elämä on vain leikkiä, ajanvietettä, koreilua ja keskinäistä kerskailua, rikkauden ja perheen kartuttamista. Se on kuin sadekuuro, jonka aiheuttama vihanta kasvullisuus ilahduttaa viljelijöitä, mutta tämä sitten kuihtuukin, ja sinä näet sen kellastuvan ja lakastuvan. Tulevassa elämässä on kuritus ankara, mutta Jumalan luona myös anteeksianto ja mielisuosio; niin, maallinen elämä on pelkkää pettävää nautintoa.",
                            "verse 57:21": "Kiiruhtakaa kilvan saavuttaaksenne Herranne anteeksiannon ja Paratiisin, jonka avaruus on maan ja taivaan suuruinen ja joka on valmistettu niille, jotka uskovat Jumalaan ja Hänen sananjulistajiinsa! Tämä on Jumalan armo. Hän antaa sen kenelle haluaa, sillä Hän on Herra, jonka armo on suuri.",
                            "verse 57:22": "Mitään ei tapahdu maailmassa eikä teissä itsessänne, jota ei ole merkitty Pyhään kirjaan, ennenkuin Me annamme sen tulla ilmi. Tämä on totisesti helppoa Jumalalle.",
                            "verse 57:23": "Älkää siis murehtiko sitä, mitä olette menettäneet, älkääkä myöskään kerskuko sen perusteella, mitä Hän on teille antanut, sillä Jumala ei rakasta röyhkeätä ja kerskailevaa ihmistä;",
                            "verse 57:24": "ei liioin niitä, jotka ovat kitsaita ja kehoittavat muita ahneuteen. Ja jos joku kääntyy pois, niin totisesti Jumala ei häntä eikä mitään kaipaa.",
                            "verse 57:25": "Olemmehan lähettänyt sanansaattajamme selvin todistein ja heidän mukanaan olemme lähettänyt Pyhän kirjan ja mittaperusteet, jotta ihmiskunta saattaisi noudattaa oikeutta; Me olemme myös antanut raudan, johon on kätketty suuri voima ja josta on hyötyä ihmiskunnalle, jotta Jumala tuntisi ne, jotka sydämestään auttavat Häntä ja Hänen sananjulistajiaan. Totisesti, Jumala on voimakas, mahtava.",
                            "verse 57:26": "Totisesti olemme lähettänyt Nooan ja Aabrahamin ja antanut heidän jälkeläisilleen profeetankutsumuksen ja Pyhän kirjan. Heidän joukossaan on muutamia, jotka vaeltavat vanhurskaasti, mutta useimmat heistä ovat käskyjen rikkojia.",
                            "verse 57:27": "Sitten lähetimme sanansaattajia seuraamaan heidän jälkiään, ja myöhemmin Me lähetimme Jeesuksen, Marian pojan, ja Me annoimme hänelle evankeliumin. Me istutimme myös rakkauden ja armeliaisuuden niiden sydämiin, jotka seuraavat häntä. Luostarilaitoksen he ovat itse keksineet, - Me emme ole antanut heille muuta määräystä kuin että he etsisivät Jumalan mielisuosiota, mutta he eivät noudattaneet sitä niin kuin olisi pitänyt. Silloin annoimme palkkansa niille heistä, jotka uskoivat, mutta useimmat heistä ovat lainrikkojia.",
                            "verse 57:28": "Te, jotka uskotte, pelätkää Jumalaa ja uskokaa Hänen sananjulistajaansa; Hän jakaa teille armoaan kaksin kerroin ja Hän antaa teille valkeuden, jossa voitte vaeltaa; Hän on antava teille anteeksi, sillä Jumala on laupias ja anteeksiantavainen.",
                            "verse 57:29": "Näin on, jotta nekin, jotka ovat saaneet Kirjan, tietäisivät, etteivät he pane rajoja Jumalan armolle, koska Jumalan armo on Hänen kädessään, Hän sulkee siihen kenet tahtoo; niin, Jumala on valtavan armon Herra."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 57:1": "Tout ce qui est dans les cieux et sur la terre glorifie Dieu, et Il est le Tout-Puissant, le Sage.",
                            "verse 57:2": "A Lui appartient le Royaume des cieux et de la terre. Il fait vivre et Il fait mourir, et Il est puissant sur toute chose.",
                            "verse 57:3": "Il est le Premier et le Dernier, l'Apparent et l'Occulte, et Il est connaissant de toute chose.",
                            "verse 57:4": "C'est Lui qui a créé les cieux et la terre en six jours. Il s'est ensuite assis en majesté sur le Trône. Il sait ce qui pénètre dans la terre et ce qui en sort, ce qui descend du ciel et ce qui y monte. Et Il est avec vous où que vous soyez. Et Dieu voit parfaitement tout ce que vous faites.",
                            "verse 57:5": "A Lui appartient le Royaume des cieux et de la terre. Toutes choses retournent à Dieu.",
                            "verse 57:6": "Il fait pénétrer la nuit dans le jour et fait pénétrer le jour dans la nuit. Et Il connaît parfaitement le tréfonds des cœurs.",
                            "verse 57:7": "Croyez en Dieu et en Son Envoyé ! Dépensez en aumônes une partie de ce dont Il vous a fait les légataires. Car ceux de vous qui auront cru et fait l'aumône recevront une grande récompense.",
                            "verse 57:8": "Pourquoi ne croiriez-vous pas en Dieu, alors que l'Envoyé vous appelle à croire en votre Seigneur et qu'il a passé un pacte avec vous à condition que vous soyez croyants ?",
                            "verse 57:9": "C'est Lui qui révèle à Son serviteur des versets évidents pour vous faire sortir des ténèbres vers la lumière. Dieu, certes, est compatissant, clément envers vous !",
                            "verse 57:10": "Pourquoi ne dépenseriez-vous pas [de vos biens] dans le chemin de Dieu, alors que c'est à Dieu que revient l'héritage des cieux et de la terre ? Vous n'êtes pas tous égaux : il y en a parmi vous qui ont dépensé leurs biens et combattu avant la victoire ; ceux-là occupent un rang plus élevé que ceux qui n'ont dépensé leurs biens et n'ont combattu que plus tard. Mais Dieu a promis à tous la très belle récompense ; et Dieu est instruit de tout ce que vous faites.",
                            "verse 57:11": "Lequel d'entre vous fera à Dieu un beau prêt afin que Dieu le lui rende au double et qu'il reçoive une généreuse récompense ?",
                            "verse 57:12": "Un Jour tu verras les croyants et les croyantes avec leur lumière qui brillera devant eux et à leur droite. \" Voici une bonne nouvelle pour vous, aujourd'hui : des Jardins sous lesquels coulent les fleuves et où vous demeurerez à jamais. C'est là le bonheur suprême ! \"",
                            "verse 57:13": "Ce Jour-là, les hypocrites, hommes et femmes, diront aux croyants : \" Attendez-nous, afin que nous empruntions de votre lumière ! \". On leur dira : \" Retournez sur vos pas chercher de la lumière ! \" Entre eux sera dressée une muraille percée d'une porte dont l'intérieur contiendra la miséricorde tandis que l'extérieur sera tourné vers le châtiment.",
                            "verse 57:14": "Les hypocrites crieront aux croyants : \" N'étions-nous pas avec vous ? \" Ceux-ci répondront : \" Si fait ! , mais vous êtes tombés dans la tentation, vous avez tergiversé et douté ; les vains désirs vous ont aveuglés jusqu'à ce que s'accomplisse le Décret divin ; et le séducteur vous a trompés sur Dieu. \"",
                            "verse 57:15": "En ce Jour il n'est plus accepté de rançon, ni de vous, ni de ceux qui ont mécru. Votre demeure est le Feu ; c'est lui qui est votre seigneur et maître ! Quelle misérable fin ! \"",
                            "verse 57:16": "Le moment n'est-il pas venu pour que les cœurs des croyants s'humilient en s'adonnant au souvenir de Dieu et de ce qui leur a été révélé de la Vérité, et pour qu'ils ne ressemblent pas à ceux qui avaient reçu le Livre avant eux ? Ceux-ci avaient vu passer le temps avec langueur, leurs cœurs s'étaient endurcis et beaucoup d'entre eux étaient devenus pervers.",
                            "verse 57:17": "Sachez que Dieu fait revivre la terre lorsqu'elle est morte. Nous vous avons explicité les signes pour que vous puissiez raisonner.",
                            "verse 57:18": "Aux hommes et aux femmes qui s'acquittent de l'aumône, à ceux qui font à Dieu un beau prêt, Dieu le rendra au double, et ils recevront une généreuse récompense.",
                            "verse 57:19": "Ceux qui croient en Dieu et en Ses envoyés, ceux-là sont les vrais fidèles ; ils seront les témoins auprès de leur Seigneur, dotés de leur récompense et de leur lumière. Quant à ceux qui auront mécru et traité Nos signes de mensonges, ils seront les hôtes de la Fournaise.",
                            "verse 57:20": "Sachez que la vie de ce monde n'est que jeu, frivolité, vaine parure, assaut de vanité entre vous et désir de multiplier à l'envi vos richesses et vos enfants. Elle est semblable à une ondée : les mécréants s'émerveillent des plantes qu'elle fait pousser ; puis elles se fanent, tu les vois jaunir et elles deviennent de la paille sèche. Dans l'autre monde, il y a un châtiment terrible et un pardon de Dieu avec Sa satisfaction. La vie de ce monde, elle, n'est qu'une jouissance illusoire.",
                            "verse 57:21": "Elancez-vous vers le pardon de votre Seigneur et vers un Jardin dont la largeur égale celle du ciel et de la terre, destiné à ceux qui ont cru en Dieu et en Ses envoyés. Telle est la grâce de Dieu ! Il la donne à qui Il veut. Dieu est le Maître de la grâce infinie !",
                            "verse 57:22": "Aucune calamité ne survient sur la terre ou en vous-mêmes sans avoir été inscrite dans un Livre avant que Nous la manifestions. C'est vraiment là chose facile pour Dieu !",
                            "verse 57:23": "Donc, ne soyez pas désespérés à cause de ce qui vous échappe et ne vous réjouissez pas outre mesure de ce qui vous est donné. Dieu n'aime pas l'insolent outrecuidant,",
                            "verse 57:24": "ni les avares qui ordonnent l'avarice aux hommes. Que celui qui se détourne sache que Dieu est le Riche, Celui qui est digne de toute louange !",
                            "verse 57:25": "Nous avons envoyé Nos messagers avec des preuves évidentes. Nous avons fait descendre avec eux le Livre et la balance afin que les hommes observent l'équité. Nous avons aussi fait descendre le fer, qui est source d'une puissance terrible et de commodités pour les hommes, ceci pour que Dieu sache qui L'assiste, Lui et Ses prophètes, dans le secret. Certes, Dieu est fort, puissant !",
                            "verse 57:26": "Nous avons envoyé Noé et Abraham et Nous avons établi chez leurs descendants la prophétie et le Livre. Parmi eux, certains ont été bien dirigés, mais beaucoup se sont montrés pervers.",
                            "verse 57:27": "Plus tard, Nous avons fait suivre leurs traces par Nos envoyés, dont Jésus, fils de Marie. A lui, Nous avons donné l'Evangile, et Nous avons mis dans le cœur de ceux qui le suivent la mansuétude, la compassion et le goût de la vie monastique. Ils l'ont instaurée - Nous ne la leur avions pas prescrite - dans le seul but d'obtenir la satisfaction de Dieu, mais ils ne l'ont pas observée comme elle aurait dû l'être. A ceux d'entre eux qui ont cru, Nous avons donné leur récompense, mais beaucoup d'entre eux ont été pervers.",
                            "verse 57:28": "O vous qui croyez, craignez Dieu et faites confiance à Son Envoyé ! Il vous attribuera une double part de Sa miséricorde, Il vous donnera une lumière avec laquelle vous marcherez et Il vous accordera Son pardon - Dieu est pardonneur, clément -,",
                            "verse 57:29": "afin que les Gens du Livre sachent qu'ils ne peuvent en rien disposer de la grâce de Dieu et que la grâce est dans la main de Dieu. Il la donne à qui Il veut, et Dieu est Celui qui détient la grâce infinie !"
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 57:1": "Tout ce qui est dans les cieux et la terre glorifie Dieu. Et c’est Lui le Puissant, le Sage.",
                            "verse 57:2": "A Lui appartient la souveraineté des cieux et de la terre. Il fait vivre et il fait mourir, et Il est Omnipotent.",
                            "verse 57:3": "C’est Lui le Premier et le Dernier, l’Apparent et le Caché et Il est Omniscient.",
                            "verse 57:4": "C’est Lui qui a créé les cieux et la terre en six jours puis Il S’est établi sur le Trône; Il sait ce qui pénètre dans la terre et ce qui en sort, et ce qui descend du ciel et ce qui y monte, et Il est avec vous où que vous soyez. Et Dieu observe parfaitement ce que vous faites.",
                            "verse 57:5": "A Lui appartient la souveraineté des cieux et de la terre. Et à Dieu tout est ramené.",
                            "verse 57:6": "Il fait pénétrer la nuit dans le jour et fait pénétrer le jour dans la nuit, et Il sait parfaitement le contenu des poitrines.",
                            "verse 57:7": "Croyez en Dieu et en Son Messager, et dépensez de ce dont Il vous a donné la lieutenance. Ceux d’entre vous croient et dépensent [pour la cause de Dieu] auront une grande récompense.",
                            "verse 57:8": "Et qu’avez-vous à ne pas croire en Dieu, alors que le Messager vous appelle à croire en votre Seigneur ? Et [Dieu] a déjà pris [acte] de votre engagement si vous êtes [sincères] dans votre foi.",
                            "verse 57:9": "C’est Lui qui fait descendre sur Son serviteur des versets claires, afin qu’il vous fasse sortir des ténèbres à la lumière; et assurément Dieu est Compatissant envers vous, et Très Miséricordieux.",
                            "verse 57:10": "Et qu’avez-vous à ne pas dépenser dans le chemin de Dieu, alors que c’est à Dieu que revient l’héritage des cieux et de la terre ? On ne peut comparer cependant celui d’entre vous qui a donné ses biens et combattu avant la conquête... ces derniers sont plus hauts en hiérarchie que ceux qui ont dépensé et ont combattu après. Or, à chacun, Dieu a promis la plus belle récompense, et Dieu est Grand-Connaisseur de ce que vous faites.",
                            "verse 57:11": "Quiconque fait à Dieu un prêt sincère , Dieu le Lui multiplie, et il aura une généreuse récompense.",
                            "verse 57:12": "Le jour où tu verras les croyants et les croyantes, leur lumière courant devant eux et à leur droite; (on leur dira) : «Voici une bonne nouvelle pour vous aujourd’hui : des Jardins sous lesquels coulent les ruisseaux pour y demeurer éternellement». Tel est l’énorme succès.",
                            "verse 57:13": "Le jour où les hypocrites, hommes et femmes, diront à ceux qui croient : «Attendez que nous empruntions [un peu]: de votre lumières». Il sera dit : «Revenez en arrière, et cherchez de la lumière». C’est alors qu’on éleva entre eux une muraille ayant une porte dont l’intérieur contient la miséricorde, et dont la face apparente a devant elle le châtiment",
                            "verse 57:14": "«N’étions-nous pas avec vous ? » leur crieront-ils. «Oui, répondront [les autres] mais vous vous êtes laissés tenter, vous avez comploté (contre les croyants) et vous avez douté et de vains espoirs vous ont trompés, jusqu’à ce que vînt l’ordre de Dieu . Et le séducteur [Le diable]: vous a trompés au sujet de Dieu.",
                            "verse 57:15": "Aujourd’hui donc, on n’acceptera de rançon ni de vous ni de ceux qui ont mécru. Votre asile est le Feu : c’est lui qui est votre compagnon inséparable. Et quelle mauvaise destination !",
                            "verse 57:16": "Le moment n’est-il pas venu pour ceux qui ont cru, que leurs coeurs s’humilient à l’évocation de Dieu et devant ce qui est descendu de la vérité [le Coran] ? Et de ne point être pareils à ceux qui ont reçu le Livre avant eux . Ceux-ci trouvèrent le temps assez long et leurs coeurs s’endurcirent, et beaucoup d’entre eux sont pervers.",
                            "verse 57:17": "Sachez que Dieu redonne la vie à la terre une fois morte. Certes, Nous vous avons exposé les preuves clairement afin que vous raisonniez.",
                            "verse 57:18": "Ceux et celles qui font la charité et qui ont fait à Dieu un prêt sincère, cela leur sera multiplié et ils auront une généreuse récompense.",
                            "verse 57:19": "Ceux qui ont cru en Dieu et en Ses messagers ceux-là sont les grands véridiques et les témoins auprès de Dieu . Ils auront leur récompense et leur lumière, tandis que ceux qui ont mécru et traité de mensonges Nos signes, ceux-là seront les gens de la Fournaise.",
                            "verse 57:20": "Sachez que la vie présente n’est que jeu, amusement, vaine parure, une course à l’orgueil entre vous et une rivalité dans l’acquisition des richesses et des enfants. Elle est en cela pareille à une pluie : la végétation qui en vient émerveille les cultivateurs, puis elle se fane et tu la vois donc jaunie; ensuite elle devient des débris. Et dans l’au-delà, il y a un dur châtiment, et aussi pardon et agrément de Dieu. Et la vie présente n’est que jouissance trompeuse.",
                            "verse 57:21": "Hâtez-vous vers un pardon de votre Seigneur ainsi qu’un Paradis aussi large que le ciel et la terre, préparé pour ceux qui ont cru en Dieu et en Ses Messagers. Telle est la grâce de Dieu qu’Il donne à qui Il veut. Et Dieu est le Détenteur de l’énorme grâce.",
                            "verse 57:22": "Nul malheur n’atteint la terre ni vos personnes, qui ne soit enregistré dans un Livre avant que Nous ne l’ayons créé; et cela est certes facile à Dieu,",
                            "verse 57:23": "afin que vous ne vous tourmentiez pas au sujet de ce qui vous a échappé, ni n’exultiez pour ce qu’Il vous a donné. Et Dieu n’aime point tout présomptueux plein de gloriole.",
                            "verse 57:24": "Ceux qui sont avares et ordonnent aux gens l’avarice. et quiconque se détourne... Dieu Se suffit alors à Lui-même et Il est Digne de louange.",
                            "verse 57:25": "Nous avons effectivement envoyé Nos Messagers avec des preuves évidentes, et fait descendre avec eux le Livre et la balance, afin que les gens établissent la justice. Et Nous avons fait descendre le fer, dans lequel il y a une force redoutable, aussi bien que des utilités pour les gens, et pour que Dieu reconnaisse qui, dans l’Invisible, défendra Sa cause et celle de Ses Messagers. Certes, Dieu est Fort et Puissant.",
                            "verse 57:26": "Nous avons effectivement envoyé Noé et Abraham et accordé à leur descendance la prophétie et le Livre. Certains d’entre eux furent bien-guidés, tandis que beaucoup d’entre eux furent pervers.",
                            "verse 57:27": "Ensuite, sur leurs traces, Nous avons fait suivre Nos [autres] messagers, et Nous les avons fait suivre de Jésus fils de Marie et lui avons apporté l’évangile, et mis dans les coeurs de ceux qui le suivirent douceur et mansuétude. Le monachisme qu’ils inventèrent, Nous ne le leur avons nullement prescrit. [Ils devaient] seulement rechercher l’agrément de Dieu. Mais ils ne l’observèrent pas (ce monachisme) comme il se devait. Nous avons donné leur récompense à ceux d’entre eux qui crurent. Mais beaucoup d’entre eux furent des pervers.",
                            "verse 57:28": "ô Vous qui avez cru ! Craignez de Dieu et croyez en Son messager pour qu’Il vous accorde deux parts de Sa miséricorde, et qu’Il vous assigne une lumière à l’aide de laquelle vous marcherez, et qu’Il vous pardonne, car Dieu est Pardonneur et Très Miséricordieux.",
                            "verse 57:29": "Cela afin que les gens du Livre sachent qu’ils ne peuvent en rien disposer de la grâce de Dieu et que la grâce est dans la main de Dieu; Il la donne à qui Il veut, et Dieu est le Détenteur de la grâce immense."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Was in den Himmeln und was auf Erden ist, verkündet die Herrlichkeit Allahs, und Er ist der Allmächtige, der Allweise.",
                            "verse 57:2": "Sein ist das Königreich der Himmel und der Erde. Er gibt Leben und Tod, und Er vermag alle Dinge zu tun.",
                            "verse 57:3": "Er ist der Erste und der Letzte, der Sichtbare und der Verborgene, und Er ist der Wisser aller Dinge.",
                            "verse 57:4": "Er ist es, Der die Himmel und die Erde erschuf in sechs Zeiten, dann setzte Er Sich auf den Thron. Er weiß, was in die Erde eingeht und was aus ihr hervorkommt, was vom Himmel niederkommt und was zu ihm aufsteigt. Und Er ist mit euch, wo immer ihr sein mögt. Und Allah sieht alles, was ihr tut.",
                            "verse 57:5": "Sein ist das Königreich der Himmel und der Erde; und zu Allah werden alle Dinge zurückgebracht.",
                            "verse 57:6": "Er läßt die Nacht eintreten in den Tag und den Tag eintreten in die Nacht; und Er ist der Kenner all dessen, was in den Herzen ist.",
                            "verse 57:7": "Glaubet an Allah und Seinen Gesandten und spendet von dem, wovon Er euch zu Erben gemacht hat. Und jenen unter euch, die glauben und spenden, wird großer Lohn.",
                            "verse 57:8": "Was ist euch, daß ihr nicht an Allah glaubt, obwohl der Gesandte euch aufruft, an euren Herrn zu glauben, und Er hat bereits von euch ein Versprechen abgenommen, wenn ihr Gläubige seid?",
                            "verse 57:9": "Er ist es, Der deutliche Zeichen hinabsendet auf Seinen Diener, damit Er euch aus den Finsternissen ins Licht führe. Und fürwahr, Allah ist gegen euch gütig, barmherzig.",
                            "verse 57:10": "Was ist euch, daß ihr nicht spendet in Allahs Sache, obwohl die Erbschaft der Himmel und der Erde Allah gehört? Die unter euch, die spendeten und kämpften vor dem Sieg, sind nicht gleich. Sie sind höher an Rang als jene, die erst nachher spendeten und kämpften. Allen aber verhieß Allah Gutes. Und Allah ist wohl kundig dessen, was ihr tut.",
                            "verse 57:11": "Wer ist es, der Allah ein stattliches Darlehen geben will? Er wird es ihm um ein Vielfaches mehren, und ihm wird ein großzügiger Lohn.",
                            "verse 57:12": "Und (gedenke) des Tags, da du die gläubigen Männer und die gläubigen Frauen sehen wirst, indes (die Strahlen) ihres Lichts vor ihnen und zu ihrer Rechten hervorbrechen: «Frohe Botschaft euch heute! - Gärten, durch die Ströme fließen, darin ihr weilen werdet. Das ist die höchste Glückseligkeit.»",
                            "verse 57:13": "Am Tage, wenn die Heuchler und die Heuchlerinnen zu den Gläubigen sagen werden: «Wartet auf uns! Wir wollen ein wenig von eurem Licht borgen», da wird (zu ihnen) gesprochen werden: «Kehret zurück und suchet (dort) Licht.» Dann wird zwischen ihnen eine Mauer errichtet werden mit einem Tor darin. Ihre Innenseite wird Barmherzigkeit sein und ihre Außenseite Strafe.",
                            "verse 57:14": "Sie werden jenen (Gläubigen) zurufen: «Waren wir nicht mit euch?» Jene werden antworten: «Doch, aber ihr versuchtet euch selber und wartetet und zweifeltet, und die eitlen Wünsche betörten euch, bis Allahs Befehl kam. Und der Betrüger belog euch über Allah.",
                            "verse 57:15": "So soll heute kein Lösegeld von euch angenommen werden, noch von den Ungläubigen. Euer Aufenthalt ist das Feuer; das ist euer Hort. Und eine schlimme Bestimmung ist es!»",
                            "verse 57:16": "Ist nicht für die Gläubigen die Zeit gekommen, daß ihre Herzen sich demütigen vor der Ermahnung Allahs und vor der Wahrheit, die herabkam, und daß sie nicht würden wie jene, denen zuvor die Schrift gegeben und deren Frist verlängert ward, doch ihre Herzen waren verstockt und viele von ihnen wurden ungehorsam?",
                            "verse 57:17": "Wisset, daß Allah die Erde belebt nach ihrem Tode. Wir haben euch die Zeichen klar gemacht, auf daß ihr begreifet.",
                            "verse 57:18": "Fürwahr, die mildtätigen Männer und die mildtätigen Frauen und jene, die Allah ein stattliches Darlehen geben - es wird ihnen um ein Vielfaches gemehrt werden, und ihr Lohn wird ein würdiger sein.",
                            "verse 57:19": "Und die an Allah und Seine Gesandten glauben, das sind die Wahrhaftigen und die Blutzeugen vor ihrem Herrn; sie werden ihren Lohn und ihr Licht empfangen. Die aber ungläubig sind und Unsere Zeichen leugnen, das sind die Insassen der Hölle.",
                            "verse 57:20": "Wisset, daß das Leben in dieser Welt nur ein Spiel und ein Tand ist und ein Gepränge und Geprahle unter euch, und ein Wettrennen um Mehrung an Gut und Kindern. Es gleicht dem Regen (der Pflanzen hervorbringt), deren Wachstum den Bebauer erfreut. Dann verdorren sie, und du siehst sie vergilben; dann zerbröckeln sie in Staub. Und im Jenseits ist strenge Strafe und Vergebung und Wohlgefallen Allahs. Und das Leben in dieser Welt ist nur eine Sache der Täuschung.",
                            "verse 57:21": "Wetteifert denn miteinander um die Vergebung eures Herrn und den Garten, dessen Wert gleich dem Werte des Himmels und der Erde ist, bereitet denen, die an Allah und Seine Gesandten glauben. Das ist Allahs Huld; Er gewährt sie, wem Er will. Und Allah ist der Eigner großer Huld.",
                            "verse 57:22": "Es geschieht kein Unheil auf Erden oder an euch, das nicht in einem Buch wäre, bevor Wir es ins Dasein rufen - fürwahr, das ist Allah ein leichtes -,",
                            "verse 57:23": "Auf daß ihr euch nicht betrübet um das, was euch entging, noch euch überhebet über das, was Er euch gegeben hat. Und Allah liebt keinen der eingebildeten Prahler,",
                            "verse 57:24": "Die geizig sind und die Menschen zum Geiz anhalten. Und wer da den Rücken wendet - siehe, Allah ist gewiß dann der Sich Selbst Genügende, der Preiswürdige.",
                            "verse 57:25": "Wahrlich, Wir schickten Unsere Gesandten mit klaren Beweisen und sandten mit ihnen das Buch und das Maß herab, auf daß die Menschen Gerechtigkeit üben möchten. Und Wir schufen das Eisen, worin (Kraft zu) gewaltigem Krieg wie auch zu (vielerlei anderen) Nutzen für die Menschheit ist, damit Allah die bezeichne, die Ihm und Seinen Gesandten beistehen, wenngleich ungesehen. Fürwahr, Allah ist stark, allmächtig.",
                            "verse 57:26": "Wir entsandten ja auch Noah und Abraham und gaben ihren Nachkommen das Prophetentum und die Schrift. Einige unter ihnen waren auf dem rechten Weg, doch viele unter ihnen waren Empörer.",
                            "verse 57:27": "Dann ließen Wir Unsere Gesandte ihren Spuren folgen; und Wir ließen Jesus, den Sohn der Maria, (ihnen) folgen, und Wir gaben ihm das Evangelium. Und in die Herzen derer, die ihm folgten, legten Wir Güte und Barmherzigkeit. Das Mönchstum jedoch, das sie sich erfanden - das schrieben Wir ihnen nicht vor - um das Trachten nach Allahs Wohlgefallen; doch sie befolgten es nicht auf richtige Art. Dennoch gaben Wir denen unter ihnen, die gläubig waren, ihren Lohn, aber viele unter ihnen waren ruchlos.",
                            "verse 57:28": "O die ihr glaubt, fürchtet Allah und glaubet an Seinen Gesandten! Er wird euch einen doppelten Anteil von Seiner Barmherzigkeit geben und wird euch ein Licht bereiten, darin ihr wandeln werdet, und wird euch verzeihen - und Allah ist allverzeihend, barmherzig -,",
                            "verse 57:29": "Damit das Volk der Schrift nicht wähne, daß sie (die Muslims) nicht imstande sind, die Huld Allahs zu erlangen. Die Huld ist in Allahs Hand, auf daß Er sie verleihe, wem Er will. Und Allah ist der Eigner großer Huld."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "tks tks pht+ lkjs vkleku o t+ehu essa gS lc [+kqnk dh rlchg djrh gS vkSj ogh x+kfyc fgder okyk gS",
                            "verse 57:2": "lkjs vkleku o t+ehu dh ckn’kkgh mlh dh gS ogh ftykrk gS ogh ekjrk gS vkSj ogh gj pht+ ij dkfnj gS",
                            "verse 57:3": "ogh lcls igys vkSj lcls vkf[+kj gS vkSj ¼viuh d+worksa ls½ lc ij t+kfgj vkSj ¼fuxkgksa ls½ iks’khnk gS vkSj ogh lc pht+ksa dks tkurk",
                            "verse 57:4": "og ogh rks gS ftlus lkjs vkleku o t+ehu dks Ng% fnu esa iSnk fd, fQj v’kZ ¼ds cukus½ ij vkeknk gqvk tks pht+ t+ehu esa nkf[ky gksrh gS vkSj tks mlls fudyrh gS vkSj tks pht+ vkleku ls ukft+y gksrh gS vkSj tks mldh rjQ p<+rh gS ¼lc½ mldks ekywe gS vkSj rqe ¼pkgs½ tgk¡ dgha jgks og rqEgkjs lkFk gS vkSj tks dqN Hkh rqe djrs gks [+kqnk mls ns[k jgk gS",
                            "verse 57:5": "lkjs vkleku o t+ehu dh ckn’kkgh [k+kl mlh dh gS vkSj [+kqnk gh dh rjQ dqy mewj dh :tw gksrh gS",
                            "verse 57:6": "ogh jkr dks ¼?kVk dj½ fnu esa nkf[ky djrk gS rks fnu c<+ tkrk gS vkSj fnu ¼?kVkdj½ jkr esa nkf[+ky djrk gS ¼rks jkr c<+ tkrh gS½ vkSj fnyksa ds Hksnksa rd ls [+kwc okfd+Q gS",
                            "verse 57:7": "¼yksxksa½ [+kqnk vkSj mlds jlwy ij bZeku ykvks vkSj ftl ¼eky½ esa mlus rqedks viuk uk;c cuk;k gS mlesa ls ls dqN ¼[+kqnk dh jkg esa½ [k+pZ djks rks rqe esa ls tks yksx bZeku yk, vkSj ¼jkgs [+kqnk esa½ [+kpZ djrs jgsa muds fy, cM+k vtz gS",
                            "verse 57:8": "vkSj rqEgsa D;k gks x;k gS fd [+kqnk ij bZeku ugha ykrs gks gkykWfd jlwy rqEgsa cqyk jgsa gSa fd vius ijojfnxkj ij bZeku ykvks vkSj vxj rqedks ckoj gks rks ¼;d+hu djks fd½ [+kqnk rqe ls ¼bldk½ bd+jkj ys pqdk",
                            "verse 57:9": "ogh rks gS tks vius cUns ¼eksgEen½ ij okt+s, o jkS’ku vk;rsa ukft+y djrk gS rkfd rqe yksxksa dks ¼dqÝ+ dh½ rkfjd+h;ksa ls fudky dj ¼bZeku dh½ jkS’kuh esa ys tk, vkSj cs’kd [+kqnk rqe ij cM+k esgjcku vkSj fugk;r jge okyk gS",
                            "verse 57:10": "vkSj rqedks D;k gks x;k fd ¼viuk eky½ [+kqnk dh jkg esa [+kpZ ugha djrs gkykWfd lkjs vkleku o t+ehu dk ekfyd o okfjl [+kqnk gh gS rqeesa ls ftl Ó[+l us Qrsg ¼eDdk½ ls igys ¼viuk eky½ [+kpZ fd;k vkSj tsgkn fd;k ¼vkSj ftlus ckn esa fd;k½ og cjkcj ugha mudk ntkZ mu yksxksa ls dgha c<+ dj gS ftUgksaus ckn esa [+kpZ fd;k vkSj tsgkn fd;k vkSj ¼;w¡ rks½ [+kqnk us usdh vkSj lokc dk ok;nk rks lcls fd;k gS vkSj tks dqN rqe djrs gks [+kqnk mlls [+kwc okfd+Q+ gS",
                            "verse 57:11": "dkSu ,slk gS tks [+kqnk dks [+kkfyl fu;r ls dts+Z gluk ns rks [+kqnk mlds fy, ¼vtz dks½ nwuk dj ns vkSj mlds fy, cgqr eqvT+ft+t+ flyk ¼tUur½ rks gS gh",
                            "verse 57:12": "ftl fnu rqe eksfeu enZ vkSj eksfeu vkSjrksa dks ns[kksxs fd mu ¼ds bZeku½ dk uwj muds vkxs vkxs vkSj nkfgus rjQ py jgk gksxk rks muls dgk ¼tk,xk½ rqedks c’kkjr gks fd vkt rqEgkjs fy, og ckx+ gS ftuds uhps ugjsa tkjh gSa ftuesa ges’kk jgksxs ;gh rks cM+h dke;kch gS",
                            "verse 57:13": "ml fnu equkfQ+d enZ vkSj equkfQ+d vkSjrsa bZekunkjksa ls dgsaxs ,d ut+j ¼’kQ+D+d+r½ gekjh rjQ+ Hkh djks fd ge Hkh rqEgkjs uwj ls dqN jkS’kuh gkfly djsa rks ¼muls½ dgk tk,xk fd rqe vius ihNs ¼nqfu;k esa½ ykSV tkvks vkSj ¼ogh½ fdlh vkSj uwj dh ryk’k djks fQj muds chp esa ,d nhokj [kM+h dj nh tk,xh ftlesa ,d njokt+k gksxk ¼vkSj½ mlds vUnj dh tkfuc rks jger gS vkSj ckgj dh rjQ vt+kc rks equkfQ+d+hu eksfeuhu ls iqdkj dj dgsaxs",
                            "verse 57:14": "¼D;ksa HkkbZ½ D;k ge dHkh rqEgkjs lkFk u Fks rks eksfeuhu dgsaxs Fks rks t+:j exj rqe us rks [+kqn vius vkidks cyk esa Mkyk vkSj ¼gekjs gd+ esa xfnZ’kksa ds½ eqUrft+j gSa vkSj ¼nhu esa½ Ód fd;k fd, vkSj rqEgsa ¼rqEgkjh½ reUukvksa us /kks[ks esa j[kk ;gk¡ rd fd [+kqnk dk gqDe vk igq¡pk vkSj ,d cM+s nx+kckt+ ¼ÓSrku½ us [+kqnk ds ckjs esa rqedks Q+jsc fn;k",
                            "verse 57:15": "rks vkt u rks rqels dksbZ eqvkot+k fy;k tk,xk vkSj u dkfQ+jksa ls rqe lcdk fBdkuk ¼cl½ tgUuqe gS ogh rqEgkjs okLrs lt+kokj gS vkSj ¼D;k½ cqjh txg gS",
                            "verse 57:16": "D;k bZekunkjksa ds fy, vHkh rd bldk oD+r ugha vk;k fd [+kqnk dh ;kn vkSj d+qjku ds fy, tks ¼[+kqnk dh rjQ ls½ ukft+y gqvk gS muds fny uje gksa vkSj og mu yksxksa ds ls u gks tk,¡ ftudks mu ls igys fdrkc ¼rkSjsr] bUthy½ nh x;h Fkh rks ¼tc½ ,d t+ekuk njkt+ xqt+j x;k rks muds fny l[+r gks x, vkSj buesa ls cgqrsjs cndkj gSa",
                            "verse 57:17": "tku j[kks fd [+kqnk gh t+ehu dks mlds ejus ¼mQ+rknk gksus½ ds ckn ft+Unk ¼vkckn½ djrk gS geus rqels viuh ¼d+qnjr dh½ fu’kkfu;k¡ [kksy [kksy dj c;ku dj nh gSa rkfd rqe le>ks",
                            "verse 57:18": "cs’kd [+kSjkr nsus okys enZ vkSj [+kSjkr nsus okyh vkSjrsa vkSj ¼tks yksx½ [+kqnk dh uh;r ls [+kkfyl dt+Z nsrs gSa mudks nksxquk ¼vtz½ fn;k tk,xk vkSj mudk cgqr eqvft+t+ flyk ¼tUur½ rks gS gh",
                            "verse 57:19": "vkSj tks yksx [+kqnk vkSj mlds jlwyksa ij bZeku yk, ;gh yksx vius ijojfnxkj ds ut+nhd fln~nhd+ksa vkSj Óghnksa ds njts esa gksaxs muds fy, mUgh ¼fln~nhdksa vkSj Óghnksa½ dk vtz vkSj mUgha dk uwj gksxk vkSj ftu yksxksa us dqÝ fd;k vkSj gekjh vk;rksa dks >qByk;k ogh yksx tgUuqeh gSa",
                            "verse 57:20": "tku j[kks fd nqfu;koh ft+Unxh egt+ [ksy vkSj rek’kk vkSj t+kfgjh t+hur ¼o vklkb’k½ vkSj vkil esa ,d nwljs ij Q+[kz+ djuk vkSj eky vkSj vkSykn dh ,d nwljs ls T+;knk [+okfg’k gS ¼nqu;koh ft+Unxh dh felky rks½ ckfj’k dh lh felky gS ftl ¼dh otg½ ls fdlkuksa dh [ksrh ¼ygygkrh vkSj½ mudks [+kq’k dj nsrh Fkh fQj lw[k tkrh gS rks rw mldks ns[krk gS fd t+nZ gks tkrh gS fQj pwj pwj gks tkrh gS vkSj vkf[+kjr esa ¼dq¶Qkj ds fy,½ l[+r vt+kc gS vkSj ¼eksfeuksa ds fy,½ [+kqnk dh rjQ ls cf[+’k’k vkSj [+kq’kuwnh vkSj nqu;koh ft+Unxh rks cl Q+jsc dk lkt+ks lkeku gS",
                            "verse 57:21": "rqe vius ijojfnxkj ds ¼lcc½ cf[+’k’k dh vkSj csfg’r dh rjQ yid ds vkxs c<+ tkvks ftldk vt+Z vkleku vkSj t+ehu ds vt+Z ds cjkcj gS tks mu yksxksa ds fy, rS;kj dh x;h gS tks [+kqnk ij vkSj mlds jlwyksa ij bZeku yk, gSa ;s [+kqnk dk Qt+y gS ftls pkgs vrk djs vkSj [+kqnk dk Qt+y ¼o d+je½ rks cgqr cM+k gS",
                            "verse 57:22": "ftruh eqlhcrsa :, t+ehu ij vkSj [+kqn rqe yksxksa ij ukft+y gksrh gSa ¼og lc½ d+Cy blds fd ge mUgsa iSnk djsa fdrkc ¼ykSg egQwt+½ esa ¼fy[kh gq;h½ gSa cs’kd ;s [+kqnk ij vklku gS",
                            "verse 57:23": "rkfd tc dksbZ pht+ rqels tkrh jgs rks rqe mldk jat u fd;k djks vkSj tc dksbZ pht+ ¼usver½ [+kqnk rqedks ns rks ml ij u brjk;k djks vkSj [+kqnk fdlh brjkus okys Ós[+kh ckt+ dks nksLr ugha j[krk",
                            "verse 57:24": "tks [+kqn Hkh cq[+y djrs gSa vkSj nwljs yksxksa dks Hkh cq[+y djuk fl[kkrs gSa vkSj tks Ó[+l ¼bu ckrksa ls½ :xjnkuh djs rks [+kqnk Hkh csijok lt+kokjs gEnksluk gS",
                            "verse 57:25": "geus ;d+huu vius iSx+Ecjksa dks okt+s o jkS’ku eksftt+s nsdj Hkstk vkSj muds lkFk fdrkc vkSj ¼bUlkQ+ dh½ rjkt+w ukft+y fd;k rkfd yksx bUlkQ+ ij d+k;e jgs vkSj ge gh us yksgs dks ukft+y fd;k ftlds t+fj, ls l[+r yM+kbZ vkSj yksxksa ds cgqr ls uQs ¼dh ckrsa½ gSa vkSj rkfd [+kqnk ns[k ys fd csns[ks Hkkys [+kqnk vkSj mlds jlwyksa dh dkSu enn djrk gS cs’kd [+kqnk cgqr t+cjnLr x+kfyc gS",
                            "verse 57:26": "vkSj cs’kd ge gh us uwg vkSj bcjkghe dks ¼iSx+Ecj cukdj½ Hkstk vkSj mugh nksuksa dh vkSykn esa ucwor vkSj fdrkc eqd+jZj dh rks muesa ds ckt+ fgnk;r ;k¶+rk gSa vkSj mu ds cgqrsjs cndkj gSa",
                            "verse 57:27": "fQj muds ihNs gh muds d+ne c d+ne vius vkSj iSx+Ecj Hksts vkSj muds ihNs efj;e ds csVs bZlk dks Hkstk vkSj mudks bUthy vrk dh vkSj ftu yksxksa us mudh iSjoh dh muds fnyksa esa ÓQ+D+d+r vkSj esgjckuh Mky nh vkSj jgckfu;r ¼yT+t+kr ls fdukjkd’kh½ mu yksxksa us [+kqn ,d u;h ckr fudkyh Fkh geus mudks mldk gqD+e ugha fn;k Fkk exj ¼mu yksxksa us½ [+kqnk dh [+kq’kuwnh gkfly djus dh x+jt+ ls ¼[+kqn bZtkn fd;k½ rks mldks Hkh tSlk cukuk pkfg, Fkk u cuk lds rks tks yksx muesa ls beku yk, mudks geus mudk vtz fn;k muesa ds cgqrsjs rks cndkj gh gSa",
                            "verse 57:28": ",s bZekunkjksa [+kqnk ls Mjks vkSj mlds jlwy ¼eksgEen½ ij bZeku ykvks rks [+kqnk rqedks viuh jger ds nks fgLls vtz vrk Qjek,xk vkSj rqedks ,slk uwj buk;r Q+jek,xk ftl ¼dh jkS’kuh½ esa rqe pyksxs vkSj rqedks c[+’k Hkh nsxk vkSj [+kqnk rks cM+k c[+’kus okyk esgjcku gS",
                            "verse 57:29": "¼;s blfy, dgk tkrk gS½ rkfd ,gys fdrkc ;s u le>sa fd ;s eksfeuhu [+kqnk ds Qt+y ¼o d+je½ ij dqN Hkh dqnjr ugha j[krs vkSj ;s rks ;d+huh ckr gS fd Qt+y [+kqnk gh ds dCt+s esa gS og ftldks pkgs vrk Qjek, vkSj [+kqnk rks cM+s Qt+y ¼o d+je½ dk ekfyd gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Semua yang berada di langit dan yang berada di bumi bertasbih kepada Allah (menyatakan kebesaran Allah). Dan Dialah Yang Maha Perkasa lagi Maha Bijaksana.",
                            "verse 57:2": "Kepunyaan-Nyalah kerajaan langit dan bumi, Dia menghidupkan dan mematikan, dan Dia Maha Kuasa atas segala sesuatu.",
                            "verse 57:3": "Dialah Yang Awal dan Yang Akhir, Yang Zhahir dan Yang Bathin; dan Dia Maha Mengetahui segala sesuatu.",
                            "verse 57:4": "Dialah yang menciptakan langit dan bumi dalam enam hari; Kemudian Dia bersemayam di atas ’Arsy. Dia mengetahui apa yang masuk ke dalam bumi dan apa yang keluar daripadanya dan apa yang turun dari langit dan apa yang naik kepadanya. Dan Dia bersama kamu di mana saja kamu berada. Dan Allah Maha Melihat apa yang kamu kerjakan.",
                            "verse 57:5": "Kepunyaan-Nya-lah kerajaan langit dan bumi. Dan kepada Allah-lah dikembalikan segala urusan.",
                            "verse 57:6": "Dialah yang memasukkan malam ke dalam siang dan memasukkan siang ke dalam malam. Dan Dia Maha Mengetahui segala isi hati.",
                            "verse 57:7": "Berimanlah kamu kepada Allah dan Rasul-Nya dan nafkahkanlah sebagian dari hartamu yang Allah telah menjadikan kamu menguasainya (4). Maka orang-orang yang beriman di antara kamu dan menafkahkan (sebagian) dari hartanya memperoleh pahala yang besar.",
                            "verse 57:8": "Dan mengapa kamu tidak beriman kepada Allah padahal Rasul menyeru kamu supaya kamu beriman kepada Tuhanmu. Dan sesungguhnya Dia telah mengambil perjanjianmu jika kamu adalah orang-orang yang beriman.",
                            "verse 57:9": "Dialah yang menurunkan kepada hamba-Nya ayat-ayat yang terang (Al Qur’an) supaya Dia mengeluarkan kamu dari kegelapan kepada cahaya. Dan sesungguhnya Allah benar-benar Maha Penyantun lagi Maha Penyayang terhadapmu.",
                            "verse 57:10": "Dan mengapa kamu tidak menafkahkan (sebagian hartamu) pada jalan Allah, padahal Allah-lah yang memusakai (mempunyai) langit dan bumi? Tidak sama di antara kamu orang yang menafkahkan (hartanya) dan berperang sebelum penaklukan (Mekah). Mereka lebih tinggi derajatnya daripada orang-orang yang menafkahkan (hartanya) dan berperang sesudah itu. Allah menjanjikan kepada masing-masing mereka (balasan) yang lebih baik. Dan Allah mengetahui apa yang kamu kerjakan.",
                            "verse 57:11": "Siapakah yang mau meminjamkan kepada Allah pinjaman yang baik, maka Allah akan melipat-gandakan (balasan) pinjaman itu untuknya, dan dia akan memperoleh pahala yang banyak,",
                            "verse 57:12": "(yaitu) pada hari ketika kamu melihat orang mu’min laki-laki dan perempuan, sedang cahaya mereka bersinar di hadapan dan di sebelah kanan mereka, (dikatakan kepada mereka): \"Pada hari ini ada berita gembira untukmu, (yaitu) surga yang mengalir di bawahnya sungai-sungai yang kamu kekal di dalamnya. Itulah keberuntungan yang banyak.",
                            "verse 57:13": "Pada hari ketika orang-orang munafik laki-laki dan perempuan berkata kepada orang-orang yang beriman: \"Tunggulah kami supaya kami dapat mengambil sebahagian dari cahayamu\". Dikatakan (kepada mereka): \"Kembalilah kamu ke belakang dan carilah sendiri cahaya (untukmu)\". Lalu diadakan di antara mereka dinding yang mempunyai pintu. Di sebelah dalamnya ada rahmat dan di sebelah luarnya dari situ ada siksa.",
                            "verse 57:14": "Orang-orang munafik itu memanggil mereka (orang-orang mu’min) seraya berkata: \"Bukankah kami dahulu bersama-sama dengan kamu?\" Mereka menjawab: \"Benar, tetapi kamu mencelakakan dirimu sendiri dan menunggu (kehancuran kami) dan kamu ragu-ragu serta ditipu oleh angan-angan kosong sehingga datanglah ketetapan Allah; dan kamu telah ditipu terhadap Allah oleh (syaitan) yang amat penipu.",
                            "verse 57:15": "Maka pada hari ini tidak diterima tebusan dari kamu dan tidak pula dari orang-orang kafir. Tempat kamu ialah neraka. Dialah tempat berlindungmu. Dan dia adalah sejahat-jahat tempat kembali.",
                            "verse 57:16": "Belumkah datang waktunya bagi orang-orang yang beriman, untuk tunduk hati mereka mengingat Allah dan kepada kebenaran yang telah turun (kepada mereka), dan janganlah mereka seperti orang-orang yang sebelumnya telah diturunkan Al Kitab kepadanya, kemudian berlalulah masa yang panjang atas mereka lalu hati mereka menjadi keras. Dan kebanyakan di antara mereka adalah orang-orang yang fasik.",
                            "verse 57:17": "Ketahuilah olehmu bahwa sesungguhnya Allah menghidupkan bumi sesudah matinya. Sesungguhnya Kami telah menjelaskan kepadamu tanda-tanda kebesaran (Kami) supaya kamu memikirkannya.",
                            "verse 57:18": "Sesungguhnya orang-orang yang bersedekah baik laki-laki maupun perempuan dan meminjamkan kepada Allah pinjaman yang baik, niscaya akan dilipat gandakan (pembayarannya) kepada mereka; dan bagi mereka pahala yang banyak.",
                            "verse 57:19": "Dan orang-orang yang beriman kepada Allah dan Rasul-Nya, mereka itu orang-orang Shiddiqiin dan orang-orang yang menjadi saksi di sisi Tuhan mereka. Bagi mereka pahala dan cahaya mereka. Dan orang-orang yang kafir dan mendustakan ayat-ayat Kami, mereka itulah penghuni-penghuni neraka.",
                            "verse 57:20": "Ketahuilah, bahwa sesungguhnya kehidupan dunia itu hanyalah permainan dan suatu yang melalaikan, perhiasan dan bermegah-megah antara kamu serta berbangga-bangga tentang banyaknya harta dan anak, seperti hujan yang tanam-tanamannya mengagumkan para petani; kemudian tanaman itu menjadi kering dan kamu lihat warnanya kuning kemudian menjadi hancur. Dan di akhirat (nanti) ada azab yang keras dan ampunan dari Allah serta keridhaan-Nya. Dan kehidupan dunia ini tidak lain hanyalah kesenangan yang menipu.",
                            "verse 57:21": "Berlomba-lombalah kamu kepada (mendapatkan) ampunan dari Tuhanmu dan surga yang luasnya seluas langit dan bumi, yang disediakan bagi orang-orang yang beriman kepada Allah dan Rasul-rasul-Nya. Itulah karunia Allah, diberikan-Nya kepada siapa yang dikehendaki-Nya. Dan Allah mempunyai karunia yang besar.",
                            "verse 57:22": "Tiada suatu bencanapun yang menimpa di bumi dan (tidak pula) pada dirimu sendiri melainkan telah tertulis dalam kitab (Lauh Mahfuzh) sebelum Kami menciptakannya. Sesungguhnya yang demikian itu adalah mudah bagi Allah.",
                            "verse 57:23": "(Kami jelaskan yang demikian itu) supaya kamu jangan berduka cita terhadap apa yang luput dari kamu, dan supaya kamu jangan terlalu gembira terhadap apa yang diberikan-Nya kepadamu. Dan Allah tidak menyukai setiap orang yang sombong lagi membanggakan diri,",
                            "verse 57:24": "(yaitu) orang-orang yang kikir dan menyuruh manusia berbuat kikir. Dan barangsiapa yang berpaling (dari perintah-perintah Allah) maka sesungguhnya Allah Dia-lah Yang Maha Kaya lagi Maha Terpuji.",
                            "verse 57:25": "Sesungguhnya Kami telah mengutus rasul-rasul Kami dengan membawa bukti-bukti yang nyata dan telah Kami turunkan bersama mereka Al Kitab dan neraca (keadilan) supaya manusia dapat melaksanakan keadilan. Dan Kami ciptakan besi yang padanya terdapat kekuatan yang hebat dan berbagai manfa’at bagi manusia, (supaya mereka mempergunakan besi itu) dan supaya Allah mengetahui siapa yang menolong (agama) Nya dan rasul-rasul-Nya padahal Allah tidak dilihatnya. Sesungguhnya Allah Maha Kuat lagi Maha Perkasa.",
                            "verse 57:26": "Dan sesungguhnya Kami telah mengutus Nuh dan Ibrahim dan Kami jadikan kepada keturunan keduanya kenabian dan Al Kitab, maka di antara mereka ada yang menerima petunjuk dan banyak di antara mereka fasik.",
                            "verse 57:27": "Kemudian Kami iringkan di belakang mereka rasul-rasul Kami dan Kami iringkan (pula) ’Isa putera Maryam; dan Kami berikan kepadanya Injil dan Kami jadikan dalam hati orang-orang yang mengikutinya rasa santun dan kasih sayang. Dan mereka mengada-adakan rahbaniyyah padahal Kami tidak mewajibkannya kepada mereka tetapi (mereka sendirilah yang mengada-adakannya) untuk mencari keridhaan Allah, lalu mereka tidak memeliharanya dengan pemeliharaan yang semestinya. Maka Kami berikan kepada orang-orang yang beriman di antara mereka pahalanya dan banyak di antara mereka orang-orang fasik.",
                            "verse 57:28": "Hai orang-orang yang beriman (kepada para rasul), bertakwalah kepada Allah dan berimanlah kepada Rasul-Nya, niscaya Allah memberikan rahmat-Nya kepadamu dua bagian, dan menjadikan untukmu cahaya yang dengan cahaya itu kamu dapat berjalan dan Dia mengampuni kamu. Dan Allah Maha Pengampun lagi Maha Penyayang,",
                            "verse 57:29": "(Kami terangkan yang demikian itu) supaya ahli Kitab mengetahui bahwa mereka tiada mendapat sedikitpun akan karunia Allah (jika mereka tidak beriman kepada Muhammad), dan bahwasanya karunia itu adalah di tangan Allah. Dia berikan karunia itu kepada siapa yang dikehendaki-Nya. Dan Allah mempunyai karunia yang besar."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Glorifica Allah ciò che è nei cieli e nella terra. Egli è l'Eccelso, il Saggio.",
                            "verse 57:2": "Appartiene a Lui la sovranità dei cieli e della terra, dà vita e dà morte, Egli è l'Onnipotente.",
                            "verse 57:3": "Egli è il Primo e l'Ultimo, il Palese e l'Occulto, Egli è l'Onnisciente .",
                            "verse 57:4": "Egli è Colui che in sei giorni ha creato i cieli e la terra, poi Si è innalzato sul trono. Egli conosce ciò che penetra nella terra e ciò che ne esce, quel che scende dal cielo e quel che vi ascende; Egli è con voi ovunque voi siate. Allah osserva ciò che fate.",
                            "verse 57:5": "Appartiene a Lui la sovranità dei cieli e della terra. Ad Allah tutte le cose saranno ricondotte.",
                            "verse 57:6": "Fa penetrare la notte nel giorno e il giorno nella notte e conosce perfettamente quel che nascondono i petti.",
                            "verse 57:7": "Credete in Allah e nel Suo Messaggero e date [una parte] di ciò di cui Allah vi ha fatto vicari . Per coloro che credono e saranno generosi, ci sarà ricompensa grande.",
                            "verse 57:8": "Perché mai non credete in Allah, nonostante che il Messaggero vi esorti a credere nel vostro Signore? Egli ha accettato il vostro patto , [rispettatelo] se siete credenti.",
                            "verse 57:9": "Egli è Colui che ha fatto scendere sul Suo servo segni evidenti, per trarvi dalle tenebre alla luce; in verità Allah è dolce e misericordioso nei vostri confronti.",
                            "verse 57:10": "Perché non siete generosi per la causa di Allah, quando ad Allah [appartie ne] l'eredità dei cieli e della terra? Non sono eguali coloro di voi che sono generosi e che hanno combattuto prima della Vittoria essi godranno di un livello più alto - e quelli che saranno generosi e combatteranno dopo. Comunque, a ciascuno di loro Allah ha promesso il meglio. Allah è ben informato di quello che fate.",
                            "verse 57:11": "Quanto a chi fa ad Allah un prestito bello, Egli glielo raddoppia e gli concederà generosa ricompensa.",
                            "verse 57:12": "Un Giorno vedrai i credenti e le credenti circondati dalla loro luce: «Oggi vi è data la lieta novella di Giardini nei quali scorrono i ruscelli, dove rimarrete in perpetuo: questo è davvero l'immenso successo».",
                            "verse 57:13": "Il Giorno in cui gli ipocriti e le ipocrite diranno ai credenti: « Aspettateci, ché possiamo attingere della vostra luce». Sarà risposto loro: « Tornate indietro a cercare la luce». Fra di loro, sarà poi eretta una muraglia dotata di una porta: al suo interno la misericordia , all'esterno, di fronte, il castigo.",
                            "verse 57:14": "«Non eravamo con voi?» grideranno. « Sì, risponderanno - ma seduceste voi stessi , indugiaste e dubitaste, e vi lasciaste ingannare dalle vostre passioni finché non si realizzò il Decreto di Allah. Vi ingannò a proposito di Allah l'Ingannatore ».",
                            "verse 57:15": "Quest'oggi non sarà accettato riscatto né da voi né da coloro che non credettero. Vostro rifugio sarà il Fuoco: questo è il vostro inseparabile compagno. Qual triste rifugio!",
                            "verse 57:16": "Non è forse giunto, per i credenti, il momento in cui rendere umili i loro cuori nel ricordo di Allah e nella verità che è stata rivelata, e di differenziarsi da quelli che ricevettero la Scrittura in precedenza e che furono tollerati a lungo [da Allah] ? I loro cuori si indurirono e molti di loro divennero perversi.",
                            "verse 57:17": "Sappiate che Allah ravviva la terra morta! Invero vi abbiamo esplicitato i segni affinché riflettiate.",
                            "verse 57:18": "Coloro che fanno la carità, uomini o donne, concedono un bel prestito ad Allah; lo riscuoteranno raddoppiato e avranno generoso compenso.",
                            "verse 57:19": "Coloro che credono in Allah e nei Suoi Messaggeri, essi sono i veridici, i testimoni presso Allah: avranno la loro ricompensa e la loro luce. Coloro che invece non credono e tacciano di menzogna i Nostri segni, questi sono i compagni della Fornace.",
                            "verse 57:20": "Sappiate che questa vita non è altro che gioco e svago, apparenza e reciproca iattanza, vana contesa di beni e progenie. [Essa è] come una pioggia: la vegetazione che suscita conforta i seminatori, poi appassisce, la vedi ingiallire e quindi diventa stoppia. Nell'altra vita c'è un severo castigo, ma anche perdono e compiacimento da parte di Allah. La vita terrena non è altro che godimento effimero.",
                            "verse 57:21": "Affrettatevi al perdono del vostro Signore e al Giardino vasto come il cielo e la terra, preparato per coloro che credono in Allah e nei Suoi messaggeri. Questa è la grazia di Allah, che Egli dà a chi vuole. Allah possiede immensa grazia.",
                            "verse 57:22": "Non sopravviene sventura né alla terra né a voi stessi, che già non sia scritta in un Libro prima ancora che [Noi] la produciamo; in verità ciò è facile per Allah.",
                            "verse 57:23": "E ciò affinché non abbiate a disperarvi per quello che vi sfugge e non esultiate per ciò che vi è stato concesso. Allah non ama i superbi vanagloriosi",
                            "verse 57:24": "[e] gli avari che impongono agli altri l'avarizia. Quanto a chi volge le spalle, [sappia che] Allah basta a Se stesso, è il Degno di lode.",
                            "verse 57:25": "Invero inviammo i Nostri messaggeri con prove inequivocabili, e facemmo scendere con loro la Scrittura e la Bilancia, affinché gli uomini osservassero l'equità. Facemmo scendere il ferro , strumento terribile e utile per gli uomini, affinché Allah riconosca chi sostiene Lui e i Suoi messaggeri in ciò che è invisibile . Allah è forte, eccelso.",
                            "verse 57:26": "Invero inviammo Noè e Abramo e concedemmo ai loro discendenti la profezia e la Scrittura. Alcuni di loro furono ben diretti, ma la maggior parte fu empia.",
                            "verse 57:27": "Mandammo poi sulle loro orme i Nostri messaggeri e mandammo Gesù figlio di Maria, al quale demmo il Vangelo. Mettemmo nel cuore di coloro che lo seguirono dolcezza e compassione; il monachesimo, invece, lo istituirono da loro stessi, soltanto per ricercare il compiacimento di Allah. Non fummo Noi a prescriverlo. Ma non lo rispettarono come avrebbero dovuto. Demmo la loro ricompensa a quanti fra loro credettero, ma molti altri furono empi .",
                            "verse 57:28": "O credenti, temete Allah e credete nel Suo Messaggero, affinché Allah vi dia due parti della Sua misericordia, vi conceda una luce nella quale camminerete e vi perdoni. Allah è perdonatore, misericordioso.",
                            "verse 57:29": "La gente della Scrittura sappia che non ha alcun potere sulla Grazia di Allah. In verità la Grazia è nella mano di Allah ed Egli la concede a chi vuole. Allah possiede immensa Grazia."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "天にあり地にある凡てのものは，アッラーを讃えろ。本当にかれは偉力ならびなく英明であられる。",
                            "verse 57:2": "天と地の大権は，かれの有である。かれは生を授け，また死を授ける。かれは凡てに就いて全能であられる。",
                            "verse 57:3": "かれは最初の方で，また最後の方で，外に現われる方でありまた内在なされる方である。かれは凡ての事物を熟知なされる。",
                            "verse 57:4": "かれこそは天地を6日の間に創造なされ，それから玉座に鎮座なされる方である。かれは地に入るもの，そこから出るもの，また天から下るもの，そこに上るものを知り尽される。あなたがたが何処にいようとも，かれはあなたがたと共にあられる。アッラーはあなたがたの行う凡てのことを御存知であられる。",
                            "verse 57:5": "天と地の大権は，かれの有である。（一切の）事物は，アッラーの御許に帰される。",
                            "verse 57:6": "かれは夜を昼の中に没入させ，また昼を夜の中に没入なされる。また胸に秘めることを熟知なされる。",
                            "verse 57:7": "アッラーとその使徒を信じ，かれがあなたがたに継がせられたものの中から，（主の道のために）施しなさい。あなたがたの中で信仰して（財産や技能や労力を）使用する者，かれらには偉大な報奨があろう。",
                            "verse 57:8": "どんな訳であなたがたは，アッラーを信仰しないのか。使徒は，あなたがたの主を信仰するよう呼びかけている。もしあなたがたが信者なら，かれは既にあなたがたの誓約を受け入れられたのである。",
                            "verse 57:9": "かれこそは，あなたがたを暗黒から光明に連れ出すために，そのしもべに明瞭な印を下された方である。アッラーは，あなたがたに親切で慈悲深くあられる。",
                            "verse 57:10": "どんな訳であなたがたは，アッラーの道のため施さないのか。本当に天地の遺産の相続は，アッラーに属する。あなたがたの中，勝利の前に（財を）施し戦闘する者と，後からそうする者と同じではない。これらの者は，（勝利の）後に施して戦闘する者よりも高位である。だがアッラーは，凡ての者に善（き報奨）を約束された。本当にアッラーは，あなたがたの行うことを熟知なされる。",
                            "verse 57:11": "アッラーに良い貸を，貸付ける者は誰か。かれはそれを倍にされ，（その外に）気前のよい報奨を授けるであろう。",
                            "verse 57:12": "その日あなたは，信者の男と信者の女の，前の方や右側に，かれらの光が走るのを見るであろう。（かれらには言われよう。）「今日は，あなたがたへの吉報がある。川が下を流れる楽園のことである。永遠にその中に住むのである。それこそは，本当に偉大な幸福の成就である。」",
                            "verse 57:13": "その日，偽信者の男女は，信者に言うであろう。「わたしたちを待ってくれ，あなたがたから光を借りたい。」（だがかれらには）言われよう。「後ろに引き返せ，そして光を求めなさい。」そこでかれらの間に壁が設けられる。そこに一つの門があるが，その内側には慈悲が，その外側には懲罰がある。",
                            "verse 57:14": "かれら（偽信者）は，「わたしたちは，あなたがたと一緒ではないか。」と叫ぶであろう。かれら（信者）は言うであろう。「そうだ，だがあなたがたは自分の誘惑に任せ，（わたしたちの没落を）待ち望み，（主の約束に）疑いを抱き，虚しい望みに欺かれているうちに，アッラーの命令がやって来るに至った。欺瞞者が，アッラーに就いてあなたがたを欺いたのである。",
                            "verse 57:15": "今日となっては，あなたがたの身代金は受け入れられないであろう。また（明らさまな）不信者たちはなおのこと。あなたがたの住まいは地獄の業火である。それはあなたがたの友だ。何と悪い帰り所であることよ。」",
                            "verse 57:16": "（本当に）信仰するならば，アッラーの教訓に，また，啓示された真理に，心を虚しくして順奉する時がまだやって来ないのか。以前に啓典を授っていながら，（寛容の時が）延ばされて，心が頑固になった者のようであってはならないのではないか。かれらの多くはアッラーの� に背く者たちである。",
                            "verse 57:17": "あなたがたは，一度死んだ大地をアッラーが甦らされることを知れ。われは種々の印をあなたがたのために明示した。恐らくあなたがたは悟るであろう。",
                            "verse 57:18": "施しをする男と施しをする女とアッラーに善い貸を，貸付けする者には，かれはそれを倍にされ，（その外に）気前のよい報奨を授けるであろう。",
                            "verse 57:19": "アッラーとその使徒を信じる者，これらの者は（真理を愛する）真実な者であり，主の御目には実証者である。かれらには報奨と光明があろう。だが信じない者またわが種々の印を嘘であるという者，これらの者は，業火の住人であろう。",
                            "verse 57:20": "あなたがたの現世の生活は遊び戯れに過ぎず，また虚飾と，たがいの間の誇示であり，財産と子女の張り合いに過ぎないことを知れ。（現世の生活を）例えれば慈雨のようなもので，（作物は）生長して不信心者（農夫）を喜ばせる。やがてそれは枯れて黄色に変り，次いで粉々になり果てるのをあなたがたは見るであろう。だが来世においては（不義の徒に）厳しい懲罰があり，また（正義の徒には）アッラーから寛容と善賞を授かろう。本当に現世の生活は，虚しい欺時の享楽に過ぎない。",
                            "verse 57:21": "あなたがたは主からの寛容（を請うため）に，相競って努力しなさい。それは天地の広さ程の広大な楽園で，アッラーと使徒を信じる者のために準備されている。これはアッラーの恩恵で御心に叶う者にそれを授ける。本当にアッラーは，偉大な恩恵の主であられる。",
                            "verse 57:22": "地上において起ころ災危も，またあなたがたの身の上に下るものも，一つとしてわれがそれを授ける前に，書冊の中に記されていないものはない。それはアッラーにおいては，容易な業である。",
                            "verse 57:23": "それはあなたがたが失ったために悲しまず，与えられたために，慢心しないためである。本当にアッラーは，自惚れの強い高慢な者を御好みになられない。",
                            "verse 57:24": "こんな者は物惜しみであるから，人びとにも物惜しみを勧める。仮令誰か（主の道から）背き去っても，アッラーは元々満ち足られる御方であり，讃美すべき御方である。",
                            "verse 57:25": "実にわれは明証を授けて使徒たちを遣わし，またかれらと一緒に，啓典と（正邪の）秤を下した。それは人びとが正義を行うためである。またわれは鉄を下した。それには偉大な力があり，また人間のために種々の便益を供する。それはアッラーが，密にかれを助ける者，また使徒たちを助ける者を，知っておられるためである。本当にアッラーは強大にして偉力ならびなき方であられる。",
                            "verse 57:26": "われは，以前，ヌーフとイブラーヒームを遣わした。またわれは両者の子孫に預言の天分と啓典を授けた。それでかれらの或る者は導かれた。だが，多くの者はアッラーの� に背く者たちであった。",
                            "verse 57:27": "それからわが使徒を，かれらの足跡に従わせ，更にマルヤムの子イーサーを遣わし，福音を授け，またかれらに従う者の胸に博愛と慈悲の情を持たせた。だが禁欲の修道院制は，かれらが自分で作ったもので，われがかれらにそれを指示してはいない。アッラーの喜びを得たいばかりにしたことだが，かれらはそれも守らねばならないようには守っていなかった。それでわれは，かれらの中の信仰する者には報奨を与えた。だがかれらの多くの者はアッラーの� に背く者たちであった。",
                            "verse 57:28": "あなたがた信仰する者よ，アッラーを畏れ，かれの使徒を信じなさい。かれは倍の慈悲を授け，また光明をあなたがたのために設け，それで（正しい道を）歩ませ，またあなたがた（の過去の罪業）を赦される。本当にアッラーは寛容にして慈悲深くあられる。",
                            "verse 57:29": "アッラーの恩恵をかれらが少しも左右出来ないことを，また恩恵はアッラーの御手の中にあるということを啓典の民は知るがいい。かれの御心に適う者は，それを授かる。本当にアッラーは偉大な恩恵の主である。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "천지의 모든 것들이 하나님을찬미하나니 실로 그분은 권능과 지혜로 충만하심이라",
                            "verse 57:2": "천지의 왕국이 하나님 안에 있어 생명을 주시고 생명을 앗아 가시는 분은 그분이시라 실로 그 분은 모든 일에 전지전능하심이라",
                            "verse 57:3": "그분은 태초에도 계셨고 마 지막에도 계시며 현존해 계시되 나타나지 아니하시나 모든 것을 알고 계시니라",
                            "verse 57:4": "그분은 하늘과 대지를 엿새 동안에 창조한 후 권좌로 오르셨 나니 대지 속에 들어가는 것과 그곳에서 나오는 것과 하늘에서 내려오는 것과 그곳으로 을라가 는 것 모두를 알고 계시며 너희 가 있는 곳에 항상 함께 하시매 너희가 행하는 모든 것을 지켜보 고 계시니라",
                            "verse 57:5": "하늘과 대지가 하나님 안에 있으며 모든 것이 하나님께로 귀 의하노라",
                            "verse 57:6": "그분은 밤을 낮으로 바꾸시고 낮을 밤으로 바꾸시며 심중에 있 는 모든 것을 아시노라",
                            "verse 57:7": "그러므로 하나님과 그분의 선 지자를 믿고 그분께서 너희로 하 여금 상속케 한 재물을 바치라 믿 음으로 재물을 바치는 자들 위에 큰 보상이 있을 것이라",
                            "verse 57:8": "너희가 하나님을 믿지 아니한 이유가 무엇이뇨 선지자께서 주님 을 믿으라 촉구하였고 너희가 믿는자들이라면 그분께서 너희와 성약 을 맺으셨노라",
                            "verse 57:9": "그분께서 그분의 종에게 말 씀을 보내사 너희를 암흑에서 광 명으로 구제하고자 함이니 실로 하나님은 인자하시고 자애로우시 니라",
                            "verse 57:10": "하나님의 사업을 위해 재물 을 바치지 아니한 이유가 무엇이 뇨 하늘과 대지에 있는 재물은 모 두 하나님의 것으로 재물을 바치 고 성전하여 승리한 자와 그렇지 아니한 자가 같을 수 있느뇨 승 리하기 전에 베풀며 성전하는 자 가 승리한 후에 베풀며 성전하는 자보다 큰 보상을 받노라 모두에 게 보상을 약속하셨으며 너희가 행하는 모든 것을 지켜보고 계시 니라",
                            "verse 57:11": "하나님을 위해 대부하매 그분께서 그것을 두배로 증가하여 주시니 훌륭한 보상을 받는 자 누구이뇨",
                            "verse 57:12": "그날이 되면 너희는 믿음으로 충실한 남녀를 보리니 빛이 그들 앞에서 그리고 그들의 우편에 서 비추니 그것이 오늘의 너희를 위한 기쁜 소식으로 강물이 흐르 는 천국이라 그러므로 그곳에서 영생하라 그것이 가장 큰 승리라",
                            "verse 57:13": "그날에는 남녀 위선자들이 믿음으로 충실한 자들에게 말하리라 잠깐만 기다려 주소서 저희도 광명을 찾고자 합니다 광명을 찾 으라고 하니 돌아가라는 말이 들 리더라 그때 그들 사이가 분리되 고 문이 하나밖에 없는 벽이 생기니 그 안에 있는 자들에게는 그 안의 은혜가 있을 것이요 밖에 있는 자에게는 응벌이 있으리라",
                            "verse 57:14": "위선자들이 믿는 자들에게 고함쳐 부르리니 저희도 여러분과함께 있었지 않느뇨 라고 하매 믿는 자들이 사실이라 그러나 너희 는 너희 스스로 유혹에 빠지고 주저하였으며 의심하였으니 무익한 욕망이 너희를 기만하여 하나님 의 응벌이 너희에게 이르렀노라 기만하는 자가 하나님에 관하여 너희를 유혹했노라",
                            "verse 57:15": "그리하여 오늘의 너희 보상금은 수락되지 아니하며 불신자들의 것도 그러하매 너희의 거주지 는 볼지옥으로 그곳이 너의 보호 자요 사악한 목적지라",
                            "verse 57:16": "믿는 자들이 하나님을 염원하는 마음으로 그리고 계시된 진 리에 겸허한 마음을 가질 때가 되지 않했느뇨 그들이 이전에 성서 를 받았으나 시간이 흐르매 마 음이 굳어져 그들 대다수가 사악 해졌더라",
                            "verse 57:17": "하나님께서 죽은 대지에 생명을 주시어 너희에게 예증을 보 였나니 너희가 이해하도록 함이라",
                            "verse 57:18": "자선을 베푸는 남녀에게 그리고 하나님을 위해 재산을 바치 는 그들을 위해 두배의 보상이 더하여 지니 그들은 훌륭한 보상을 받으리라",
                            "verse 57:19": "하나님과 그분의 선지자를 믿는 자들이 진리를 사랑하는 자 들이며 주님 앞에서 증언할 증인 들로 그들이 보상과 광명을 받을 자들이라 그러나 하나님과 예증을거역한 자들에게는 볼지옥에 거처가 정해지니라",
                            "verse 57:20": "실로 현세는 유희와 오락에 불과하며 허식과 권세도 풍성한 재산과 자손도 그러하거늘 그것을비유하사 식물을 성장케 하여 농 부를 기쁘게 한 후 비가 내려 시 들어 누렇게 되고 메말라 부스러 지고 지푸라기가 된 것과 같더라 그러나 내세에서는 사악한 자들에게 가혹한 응벌이 있으되 하나님 께 헌신한 자 하나님의 관용과 기쁨을 받노라 실로 현세의 삶은 현흑된 향락에 불과하니라",
                            "verse 57:21": "그러므로 서둘러 주님께 용 서를 구하고 서둘러 천국으로 들 라 그곳은 하늘과 대지의 넓이로 이는 하나님과 그분의 선지자를 믿는 자들을 위해 준비된 곳이며 하나님의 은혜가 있는 곳이라 그 분은 그분이 원하는 자에게 그것 을 베푸시나니 하나님은 위대한 은혜의 주님이시라",
                            "verse 57:22": "지상에서 일어나는 재난과 너희에게 일어나는 것은 하나님 이 그것을 드러내기 전에 이미 기록된 것이라 실로 그것은 하나님 께 쉬운 일이라",
                            "verse 57:23": "이는 너희로 하여금 지나간 일들에 관하여 슬퍼하지 아니하 고 너희에게 베푼 은혜에 관하여 자만하지 아니하도록 함이라 실로 하나님은 오만하고 자만하는 자를 사랑하지 아니 하시니라",
                            "verse 57:24": "스스로 인색하며 또 타인에 게도 인색하라 종용하는 자와 외 면하는 자들이 있으되 하나님은 스스로 충만하시고 찬미받는 분이 시라",
                            "verse 57:25": "실로 하나님은 분명한 예증 과 더불어 그분의 선지자들을 보 냈으며 또한 사람들이 공평하게 스스로를 인도할 성서와 균형을 함께 보내셨노라 그리고 하나님은 강한 힘을 상징하고 여러가지로 유용한 무쇠를 보냈나니 이로하 여 하나님께서 그분과 그분의 선 지자와 보이지 않는 것을 믿는 신 도를 돕는자를 시험코자 함이라 실로 하나님은 강하심과 권능으로충만하심이라",
                            "verse 57:26": "하나님은 노아와 아브라함을 보냈고 후손을 두어 예언자의 자 격과 성서를 주었나니 그들 중에 는 바른 길로 인도받은 자 있었으 나 그들 대다수는 사악한 자들이 었더라",
                            "verse 57:27": "하나님은 그분의 선지자들로하여금 그들의 발자취를 따르도록 하였으니 마리아의 아들 예수를 보내어 그에게 신약을 주었고 그 를 따르는 모든 자들의 심중에 사 랑과 자비를 주었노라 그러나 그 들은 하나님이 묘사하지 아니한 그들만을 위한 수도 생활을 창안 하였으나 하나님은 그분의 기쁨만 을 추구하라 했을 뿐이라 그러나 그들은 그들이 해야 할 것을 준수 하지 못했더라 그리하여 하나님은 믿는 자들에게 그들의 보상을 주 었으나 그들 대다수는 사악한 자 중에 있었노라",
                            "verse 57:28": "믿는 자들이여 하나님을 두 려워하고 그분의 선지자를 믿으라 그리하면 그분께서 너희 위에 그 분의 은헤를 두배로 더하여 주실 것이며 너희가 걸어갈 길에 빛을 주실 것이며 너희에게 관용을 베 푸시나니 실로 하나님은 관용과 자비로 충만하시니라",
                            "verse 57:29": "성서의 백성들은 하나님의 은혜를 제지할 수 없다는 것을 알 것이라 그분의 은혜는 그분 안에 있어 그분이 원하는 자에게 부여 하시나니 하나닝은 위대한 은혜의주님이시라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "هه‌رچی له‌ئاسمانه‌کان و زه‌ویدا هه‌یه ته‌سبیحات و ستایشی خوا ده‌کات، ئه‌ویش زاتێکی باڵاده‌ست و دانایه‌",
                            "verse 57:2": "هه‌رچی له‌ئاسمانه‌کان و زه‌ویدا هه‌یه هه‌ر ئه‌و خاوه‌نیانه‌، ده‌ژینێ و ده‌مرێنێ، هه‌ر خۆی ده‌سه‌ڵاتی به‌سه‌ر هه‌موو شتێکدا هه‌یه‌",
                            "verse 57:3": "ئه‌و خوایه یه‌که‌مینه و له‌سه‌ره‌تاوه‌هه‌ر هه‌بووه‌و که‌س پێش ئه‌و نه‌بووه‌، دواهه‌مینه و کۆتایه‌، که‌س دوای ئه‌و نامێنێت، (به‌ڵام ئه‌و هه‌ر ده‌مێنێت)، هه‌روه‌ها ئه‌و زاته‌دیاره و هه‌موو شت به‌ڵگه‌یه له‌سه‌ر بوونی، له‌هه‌مان کاتدا زاتی خۆی نادیاره و (به‌چاوی سه‌ر نابینرێت، به‌ڵام به‌بینایی بیروهۆش و دڵ و ده‌روون ئاشکرایه‌)، هه‌ر خۆیشی زانایه به‌هه‌موو شتێک",
                            "verse 57:4": "هه‌ر ئه‌و زاته‌خۆی، ئاسمانه‌کان و زه‌وی له‌شه‌ش ڕۆژدا دروست کردووه‌، له‌وه‌ودوا له‌سه‌ر ته‌ختی فه‌رمانڕه‌وایی خۆی پایه‌دارکرد (ئه‌ڵبه‌ته چۆنیه‌تی وه‌ستان و ته‌ختی فه‌رمانڕه‌وایه‌تی و گه‌لێ شتی له‌و بابه‌تانه‌له‌راده‌ی بۆچوونی ئێمه به‌ده‌ره‌، ته‌فسیری ئه‌م ئایه‌ته‌یان له‌پێشه‌وا مالێک پرسیوه له‌وه‌ڵامدا وتوویه‌تی: وه‌ستانه‌که‌حه‌قیقه‌تی هه‌یه‌، چۆنیه‌تیه‌که‌ی شاراوه‌یه‌، پرسیارکردن ده‌رباره‌ی بیدعه‌یه‌، باوه‌ڕ بوون پێی واجبه‌)، هه‌ر خۆی ده‌زانێت چی ده‌چێت به‌ناخی زه‌ویدا و چیشی لێ دێته ده‌ره‌وه‌، چی له‌ئاسمان دێته خواره‌وه‌و چی پیادا سه‌رده‌که‌وێت، جا له‌هه‌ر شوێنێک دابن ئه‌وزاته‌له‌گه‌ڵتاندایه و پێتان ده‌زانێت، دڵنیابن که‌خوا به‌هه‌موو ئه‌و کارو کرده‌وانه‌ی ئه‌نجامی ده‌ده‌ن بینایه",
                            "verse 57:5": "هه‌رچی له‌ئاسمانه‌کان و زه‌ویدا هه‌یه ئه‌و زاته‌خاوه‌نیانه‌، هه‌موو شتێکیش بۆ لای خوا ده‌برێته‌وه‌",
                            "verse 57:6": "شه‌و تێهه‌ڵکێشی ڕۆژ ده‌کات و ڕۆژ تێهه‌ڵکێشی شه‌و ده‌کات (به‌درێژ بوونی لایه‌کیان له‌سه‌ر حسابی ئه‌وی تریان، یان له‌به‌ره‌به‌یان و ئێواراندا تێهه‌ڵکێش ده‌بن)، ئه‌و زاته‌زانایه به‌هه‌رچی له‌دڵ و ده‌روون و سینه‌کاندایه",
                            "verse 57:7": "خه‌ڵکینه ئیمان و باوه‌ڕی دامه‌زراو بهێنن به‌خواو پێغه‌مبه‌ره‌که‌ی، له‌و ماڵ و سامانه‌ی که‌خستویه‌تیه ژێر ده‌ستان و جێنشینن تیایدا، ببه‌خشن، بێگومان ئه‌وانه‌ی که‌باوه‌ڕیان هێناوه له‌ئێوه و ماڵ و سامان ده‌به‌خشن پاداشتی گه‌وره‌چاوه‌ڕێیانه‌",
                            "verse 57:8": "جا ئه‌وه‌چیتانه و بۆچی باوه‌ڕ ناهێنن به‌خوا له‌کاتێکدا پێغه‌مبه‌ر بانگتان ده‌کات: که‌باوه‌ڕ بهێنن به‌په‌روه‌ردگارتان، خۆ ئه‌و بێگومان په‌یمانیشی لێ وه‌رگرتن، ئه‌گه‌ر ئێوه ئیماندارن",
                            "verse 57:9": "خوا ئه‌و زاته‌یه ئایه‌ت ڕوون و ئاشکراکانی قورئان داده‌به‌زێنێت بۆ سه‌ر به‌نده‌ی خۆی، تا له‌تاریکایی یه‌کان ده‌رتان بهێنێت و بتانخاته‌ناو نوور و ڕوناکیه‌وه‌، به‌ڕاستی ئنو خوایه به‌سۆزو میهره‌بانه بۆتان",
                            "verse 57:10": "جا ئیتر ئه‌وه‌چیتانه‌و بۆچی ماڵ و سامانتان نابه‌خشین له‌رێگه‌ی خوادا، خۆ هه‌رچی له‌ئاسمانه‌کان و زه‌ویدا هه‌یه بۆ خوا ده‌مێنێته‌وه‌، بێگومان چوونیه‌ک نین ئه‌وانه‌تان که‌پێش ڕزگاری مه‌ککه‌، یاخود پێش سه‌رکه‌وتن، ماڵ و سامانی به‌خشیووه‌و جه‌نگاوه‌، چونکه‌ئه‌وانه‌پله‌و پایه‌یان زۆر به‌رزتره‌له‌وانه‌ی که‌دوای ڕزگاری مه‌ککه‌و به‌ده‌ست هێنانی سه‌رکه‌وتن ماڵ و سامانیان به‌خشیووه و جه‌نگاون، به‌هه‌ردوولاشیان خوا به‌ڵێنی به‌هه‌شتی به‌خشیووه‌، بێگومان ئه‌و خوایه ئاگایه به‌کاروکرده‌وه‌تان",
                            "verse 57:11": "ئایا کێ یه ئه‌وه‌ی قه‌رزی چاک ده‌دات به‌خواو ماڵ و سامانی ده‌به‌خشێت له‌پێناوی به‌ده‌ستهێنانی ڕه‌زامه‌ندی خوادا، ئینجا خوایش پاداشتی بێ سنووری ده‌داتێ و بۆی چه‌ند به‌رابه‌ر ده‌کات، هه‌روه‌ها پاداشتی به‌رێزو به‌نرخی بۆ ئاماده‌کردووه‌",
                            "verse 57:12": "ڕۆژێک دێت که‌ده‌بینیت پیاوانی ئیماندارو ژنانی ئیماندار به‌ره‌و به‌هه‌شت به‌ڕێ ده‌کرێن، نوورو ڕوناکایه‌کی ئاشکرا له‌به‌رده‌م و له‌لای ڕاستیانه‌وه ده‌ڕوا، فریشته‌کان پێیان ده‌ڵێن: مژده‌ی ئێوه ئه‌مرۆ باخه‌کانی به‌هه‌شته‌که‌چه‌نده‌ها ڕوبار به‌ناویاندا ده‌ڕوات، هاوڕێ له‌گه‌ڵ ژیانی هه‌میشه‌یی و نه‌بڕاوه تیایدا، ئا ئه‌وه‌یه سه‌رکه‌وتن و سه‌رفرازی گه‌وره‌و بێ سنوور",
                            "verse 57:13": "(ئا له‌و ڕۆژه‌دا که‌ئیمانداران به‌ره‌و به‌هه‌شت به‌ڕێ ده‌کرێن) پیاوان و ژنانی دووڕوو ده‌هێنرێنه سه‌ر ڕێیان، به‌غه‌مبارییه‌وه بۆ ئیمانداران ده‌ڕوانن، ئیماندارانیش هیچ لایان لێ ناکه‌نه‌وه‌، بۆیه به‌غه‌مو په‌ژاره‌یه‌کی زۆره‌وه پێیان ده‌ڵێن: ده ته‌ماشایه‌کمان بکه‌ن با له‌نووری ڕووخسارتان به‌هره‌وه‌ر ببین، به‌ڵام پێیان ده‌وترێت بگه‌رێنه‌وه دواوه‌، خۆتان به‌شوێن نوورو ڕوناکیدا بگه‌ڕێن، ده‌ستبه‌جێ دیوارێک دروست ده‌کرێت له‌نێوان ئیمانداران و دووڕووه‌کاندا ده‌روازه‌یه‌کیشی تێدایه‌، دیوی ناوه‌وه که‌رووی له‌ئیماندارانه ڕووی له‌ره‌حمه‌ت و به‌هه‌شته‌و دیوی ده‌ره‌وه‌، که‌رووی له‌دووڕووه‌کانه ڕووی له‌سزاو دۆزه‌خه",
                            "verse 57:14": "ئینجا دووڕووه‌کان هاوار له‌ئیمانداران ده‌که‌ن، ئایا ئێمه هاوڕێی ئێوه نه‌بووین؟!، ئێمه هاوکاری ئێوه نه‌بووین؟! ئیمانداران ده‌ڵێن: به‌ڵێ وایه‌، به‌ڵام ئێوه خۆتان تووشی دووڕوویی و پیلانگێڕیی کرد، خۆتان مه‌ڵاس دابوو، بۆ فرسه‌ت ده‌گه‌ڕان که‌زه‌ره‌ر بده‌ن له‌ئیمانداران، هه‌میشه له‌گومان و دوودڵیدا ده‌ژیان و بڵاویشتان دکرده‌وه‌، هیواو ئاواتی بێ جێ سه‌ری لێ تێک دابوون، هه‌تا ویستی خوا یه‌خه‌ی پێگرتن و کۆتایی به‌ژیانتان هات، شه‌یتانیش غه‌ڕاو گومڕای کردبوون به‌میهره‌بانی خوا و له‌رێبازه‌که‌ی وێڵی کردبوون",
                            "verse 57:15": "ئه‌مڕۆ ئیتر هیچ جۆره پاکانه‌و بارامته‌یه‌ک له‌ئێوه و له‌وانه‌ش که‌بێ باوه‌ڕ بوون وه‌رناگیرێت، شوێنه‌وار و مه‌نزڵگای هه‌مووتان ئاگری دۆزه‌خه‌، هه‌ر ئه‌وه‌ش شایسته‌تانه‌، ئای چ سه‌ره‌نجامێکی خراپ و ناله‌باره‌",
                            "verse 57:16": "ئایا ئیتر ئه‌وه‌نه‌هاتووه بۆ ئه‌وانه‌ی که‌باوه‌ڕیان هێناوه‌، دڵه‌کانیان به‌نوری ئیمان ملکه‌چ ورو‌ناک بۆته‌ووه‌، ترسی خوای تێدا بڕوێنن به‌هۆی یادی به‌رده‌وامی خواو ئه‌و قورئانه‌ی که‌ره‌وانه‌کراوه‌، وه‌ک ئه‌و که‌سانه‌نه‌بن که‌کتێبی ئاسمانییان بۆ ڕه‌وانه‌کرا، به‌ڵام دوای تێپه‌ر بوونی ماوه‌یه‌کی دوورو درێژ، دڵیان ڕه‌ق و ڕه‌ش بوو، زۆربه‌شیان یاخی و سه‌رکه‌ش و ناله‌بار ده‌رچوون",
                            "verse 57:17": "به‌ڕاستی چاک بزانن که‌هه‌ر خوا زه‌وی زیندوو ده‌کاته‌وه‌دوای مردنی (ئێوه‌ش ئاوا زیندوو ده‌کاته‌وه‌)، بێگومان به‌ڵگه‌و نیشانه‌ی ده‌سه‌ڵاتداری خۆمانمان بۆ ڕوون کردنه‌وه‌، بۆ ئه‌وه‌ی ژیربن و بفامن",
                            "verse 57:18": "به‌ڕاستی ئه‌وانه‌ی که‌خێر خوازن له‌پیاوان و ئافره‌تان، ئه‌وانه‌ی که‌قه‌رز ده‌ده‌ن به‌خواو ماڵ و سامانیان له‌پێناوی ڕه‌زامه‌ندی ئه‌ودا ده‌به‌خشن، ئه‌وانه‌چه‌ند به‌رابه‌ر پاداشتیان ده‌درێته‌وه و پاداشتی به‌ڕێزو به‌نرخ چاوه‌ڕێیانه‌",
                            "verse 57:19": "ئه‌وانه‌ی که‌باوه‌ڕیان هێناوه به‌خواو پێغه‌مبه‌ره‌کانی، ئا ئه‌وانه‌ڕاست و ڕاستگۆکانن، شه‌هیده‌کانیش لای په‌روه‌ردگاریان پاداشت و نوور و ڕوناکی تایبه‌تی خۆیان هه‌یه‌، ئه‌وانه‌ش که‌باوه‌ڕیان نه‌هێناوه‌و ئایه‌ت و فه‌رمانه‌کانی ئێمه‌یان به‌درۆزانی، ئا ئه‌وانه‌نیشته‌جێی دۆزه‌خن",
                            "verse 57:20": "چاک بزانن ژیانی دنیا ته‌نها بریتیه له‌یاری و گه‌مه‌و ڕازاندنه‌وه‌و خۆ هه‌ڵکێشان له‌نێوان یه‌کتریدا، هه‌روه‌ها زۆرکردنی سامان و ماڵ و منداڵ، جا ئه‌وانه‌هه‌ر هه‌مووی وه‌ک بارانێکی به‌پیت وایه که‌ببێته به‌رهه‌مێکی زۆر، کشتیاره‌کان سه‌رسام بکات، له‌وه‌ودوا وشک ببێت و زه‌رد هه‌ڵگه‌ڕێت، پاشان وردوخاش ببێت و بکه‌وێت، بێگومان له‌قیامه‌تیشدا سزای زۆر سه‌خت بۆ دنیا په‌رستان ئاماده‌یه‌، له‌ولاشه‌وه لێ خۆشبوون و ڕه‌زامه‌ندی له‌لایه‌ن خواوه‌ئیماندارانی چاکه‌خوازی لێ به‌هره‌وه‌ر ده‌کرێت، ژیانی دنیاش دوور له‌خواناسی و دینداری جگه‌له‌وه‌ی که‌بریتیه له‌رابواردنێکی که‌م، شتێکی تر نیه‌، زۆر که‌سیشی پێ غه‌ڕاو ده‌ستخه‌ڕۆ ده‌بێت",
                            "verse 57:21": "(که‌واته‌) پێشبڕکێ بکه‌ن بۆ به‌ده‌ست هێنانی لێ خۆشبوون له‌لایه‌ن په‌روه‌ردگارتانه‌وه‌و به‌ده‌ست هێنانی ئه‌و به‌هه‌شته‌ی که‌پانیه‌که‌ی وه‌ک پانتایی ئاسمان و زه‌ویه‌، ئاماده‌کراوه‌بۆ ئه‌وانه‌ی که‌ئیمان و باوه‌ڕیان هێناوه به‌خواو پێغه‌مبه‌ره‌کانی، ئه‌ویش خۆی زیاده ڕێزێکی تایبه‌تیه له‌لایه‌ن خواوه‌ده‌یدات به‌و که‌سانه‌ی که‌خۆی ده‌یه‌وێت، هه‌ر خوا خۆی خاوه‌نی به‌خشش و به‌خشنده‌یی زۆر گه‌وره‌و بێ سنووره‌",
                            "verse 57:22": "هیچ به‌ڵاو ڕوداوێک له‌زه‌ویدا، بۆتان پێش نه‌هاتووه‌که‌له‌_ لوح المحفوظ _ دا تۆمارمان نه‌کردبێت، پێش ئه‌وه‌ی ڕووداوه‌که‌پێش بێت، ئه‌و کاره‌ش بۆ خوا زۆر ئاسانه‌",
                            "verse 57:23": "ئه‌مه‌ش بۆ ئه‌وه‌ی که‌خه‌فه‌ت نه‌خۆن بۆ ئه‌وه‌ی له‌کیستان چووه‌و به‌وه‌ش دڵخۆش و غه‌ڕڕا نه‌بن که‌پێمان به‌خشیوون (واته‌که‌شخه‌نه‌که‌ن)، چونکه‌خوا که‌سانی خۆ به‌گه‌وره‌زان و فه‌خرفرۆشی خۆش ناوێت (ئه‌وانه‌ی به‌به‌خشینی به‌هره‌کان غه‌ڕڕا ده‌بن و خۆ باده‌ده‌ن و فیز ده‌که‌ن)....",
                            "verse 57:24": "یاخود ڕه‌زیلی ده‌که‌ن و فه‌رمان ده‌که‌ن به‌خه‌ڵکیش که‌ره‌زیل بن و ماڵ و سامان نه‌به‌خشن (بۆ به‌رژه‌وه‌ندی گشتی، یان به‌هه‌ژاران و لێقه‌وماوان)، جا ئه‌وه‌ی پشت هه‌ڵکات له‌فه‌رمانه‌کانی خواو ده‌ست نوقاو بێت، ئه‌وه‌بێگومان با چاک بزانێت که‌خوا هه‌ر خۆی بێ نیازه و سوپاسکراوه‌له‌سه‌ر به‌خششه‌بێ سنووره‌کانی.",
                            "verse 57:25": "سوێند به‌خوا بێگومان ئێمه پێغه‌مبه‌ره‌کانمان ڕه‌وانه‌کردووه‌هاوڕێ له‌گه‌ڵ به‌ڵگه و نیشانه‌و موعجیزه‌ی ڕوون و ئاشکراداو کتێبه ئاسمانه‌کانیشمان هێنایه خواره‌وه‌که‌له‌گه‌ڵ ئه‌و پێغه‌مبه‌رانه‌دا بێت، ته‌رازوو پێوه‌ری شه‌رعی و دادپه‌روه‌رانه‌مان بۆ ڕوون کردونه‌ته‌وه‌تا خه‌ڵکی به‌عه‌داله‌ت و دادپه‌روه‌ریی ڕه‌فتار بکه‌ن، هه‌روه‌ها ئاسنیشمان دروست کردووه‌که‌مادده‌یه‌کی سه‌خت و ڕه‌قه‌و سوود به‌خشیشه بۆ خه‌ڵکی، تا ئه‌وه‌ی خوا ده‌یزانێ ل جیهانی واقعیشدا ده‌ربکه‌وێت که‌کێ پشتگیرو لایه‌نگری خواو پێغه‌مبه‌ره‌کانیه‌تی له‌کاتێکدا که‌ئه‌و زاته‌په‌نهانه‌، چونکه‌به‌ڕاستی خوا به‌هێزو باڵاده‌سته‌",
                            "verse 57:26": "بێگومان ئێمه نوح و ئیبراهیممان ڕه‌وانه‌کردووه‌، له‌نه‌وه‌کانیشیاندا پێغه‌مبه‌رایه‌تی و کتێبی ئاسمانیمان دابه‌زاندووه‌، جا له‌نه‌وه‌کانیاندا که‌سانێک هه‌بوون که‌رێگه و ڕێبازی هیدایه‌ت و خواناسی گرتۆته‌به‌ر، زۆربه‌شیان خوانه‌ناس و لارو وێر بوون",
                            "verse 57:27": "له‌وه‌ودوا به‌شوێن پێغه‌مبه‌راندا پێغه‌مبه‌رانی ترمان ڕه‌وانه‌کرد، کۆتایی زنجیره‌ی ئیسحاقی کوڕی ئیبراهیممان هێنا به‌عیسای کوڕی مه‌ریه‌م، ئینجیلیشمان پێبه‌خشی سۆزو میهره‌بانیمان له‌دڵی ئه‌وانه‌دا که‌شوێنی که‌وتبووه‌دابین کرد، به‌ڵام ئه‌وان ڕه‌هبانیه‌ت و دووره‌په‌رێزیان له‌دنیادا کرده‌پیشه‌یان، وه‌نه‌بێت ئێمه ئه‌و حاڵه‌ته‌مان له‌سه‌ر فه‌رز کردبن، به‌ڵکو ته‌نها به‌ده‌ستهێنانی ڕه‌زامه‌ندی خوامان لێ داوا کردبوون، که‌چی ئه‌وان ڕه‌هبانییه‌تیان به‌چاکی په‌یڕه‌و نه‌کرد، ئێمه‌ش پاداشتی ئه‌وانمان دایه‌وه که‌باوه‌ڕی ڕاست و دروستیان هه‌بوو، هه‌رچه‌نده‌زۆربه‌یان لارو وێرو خوانه‌ناس و یاخی ده‌رچوون",
                            "verse 57:28": "ئه‌ی ئه‌و که‌سانه‌ی که‌باوه‌ڕتان هێناوه له‌خوا بترسن و پارێزگاربن و باوه‌ڕی پته‌و بهێنن به‌پێغه‌مبه‌ره‌که‌ی، تا دوو به‌رابه‌ر پاداشت و ڕه‌حمه‌تتان به‌سه‌ردا ببارێنێت، هه‌روه‌ها نوور و ڕوناکیه‌تان پێ ببه‌خشێت له‌به‌ر ڕۆشناییه‌که‌ی دا چالاکی بنوێنن و ڕێبازی ژیان بگرنه‌به‌ر، تا لێتان خۆش ببێت، چونکه‌ئه‌و خوایه لێخۆشبوو میهره‌بانه‌",
                            "verse 57:29": "جا ئیتر خاوه‌نی کتێبه ئاسمانیه‌کان، با بزانن که‌ناتوانن چوارچێوه دانێن بۆ به‌خشنده‌یی و ڕه‌حمه‌ت و میهره‌بانی خوا، خۆیان به‌هه‌ڵبژارده‌ی خوا بزانن، چونکه‌به‌خشش و ڕه‌حمه‌ت، ته‌نها به‌ده‌ستی خوایه و هه‌ر ئه‌و ده‌یبه‌خشێت به‌وانه‌ی که‌خۆی ده‌یه‌وێت، ئه‌و خوایه خاوه‌نی به‌خشش و ڕێزو میهره‌بانیه‌کی گه‌وره‌و بێ سنووره‌"
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Segala yang ada di langit dan di bumi tetap mengucap tasbih kepada Allah dan Dialah Yang Maha Kuasa, lagi Maha Bijaksana.",
                            "verse 57:2": "Dialah sahaja yang menguasai dan memiliki langit dan bumi; Dia menghidupkan dan mematikan dan Dia Maha Kuasa atas tiap-tiap sesuatu.",
                            "verse 57:3": "Dialah Yang Awal dan Yang Akhir dan Yang Zahir serta Yang Batin dan Dialah Yang Maha Mengetahui akan tiap-tiap sesuatu.",
                            "verse 57:4": "Dialah yang telah menciptakan langit dan bumi dalam enam masa, kemudian Dia bersemayam di atas Arasy; Dia Mengetahui apa yang masuk ke bumi serta apa yang keluar daripadanya dan apa yang diturunkan dari langit serta apa yang naik padanya dan Dia tetap bersama-sama kamu di mana sahaja kamu berada dan Allah Maha Melihat akan apa yang kamu kerjakan.",
                            "verse 57:5": "Dialah sahaja yang menguasai dan memiliki langit dan bumi dan kepada Allah jualah dikembalikan segala urusan.",
                            "verse 57:6": "Dialah yang memasukkan waktu malam ke dalam waktu siang dan memasukkan waktu siang ke dalam waktu malam (silih berganti) dan Dialah Yang Maha Mengetahui akan segala (isi hati) yang terkandung di dalam dada.",
                            "verse 57:7": "Berimanlah kamu kepada Allah dan RasulNya dan belanjakanlah (pada jalan kebajikan) sebahagian dari harta benda (pemberian Allah) yang dijadikannya kamu menguasainya sebagai wakil. Maka orang-orang yang beriman di antara kamu serta mereka membelanjakan (sebahagian dari harta itu pada jalan Allah); mereka tetap beroleh pahala yang besar.",
                            "verse 57:8": "Dan mengapa kamu tidak beriman kepada Allah? Sedang Rasulullah mengajak kamu untuk beriman kepada Tuhan kamu dan Allah telah mengambil janji setia dari kamu (untuk beriman); jika kamu hendak beriman (maka telah jelaslah dalil-dalilnya).",
                            "verse 57:9": "Dialah yang menurunkan kepada hambaNya (Nabi Muhammad) keterangan-keterangan Al-Quran yang terang nyata, kerana Dia hendak mengeluarkan kamu dari gelap-gelita (kekufuran) kepada cahaya (iman) yang terang-benderang dan (ingatlah) sesungguhnya Allah Maha Belas, lagi Maha Mengasihani, terhadap kamu.",
                            "verse 57:10": "Dan mengapa kamu tidak membelanjakan harta benda kamu pada jalan Allah? Padahal Allah jualah yang mewarisi langit dan bumi (serta segala isinya). Tidaklah sama di antara kamu, orang-orang yang membelanjakan hartanya serta turut berperang sebelum kemenangan (Nabi menguasai Mekah). Mereka itu lebih besar darjatnya daripada orang-orang yang membelanjakan hartanya serta turut berperang sesudah itu dan tiap-tiap satu puak dari keduanya, Allah janjikan (balasan) yang sebaik-baiknya. Dan (ingatlah), Allah Maha Mendalam PengetahuanNya akan apa yang kamu kerjakan.",
                            "verse 57:11": "Siapakah orangnya yang mahu memberikan pinjaman kepada Allah, sebagai pinjaman yang baik (ikhlas) supaya Allah melipat-gandakan balasannya? Dan (selain itu) dia akan beroleh pahala yang besar!",
                            "verse 57:12": "(Ingatlah) ketika engkau melihat (pada hari kiamat): Orang-orang yang beriman, lelaki dan perempuan, cahaya (iman dan amal soleh) mereka bergerak cepat di hadapan mereka dan di sebelah kanan mereka (semasa mereka berjalan, serta dikatakan kepada mereka): Berita yang menggembirakan kamu pada hari ini, (kamu akan beroleh) Syurga yang mengalir di bawahnya beberapa sungai, kekal kamu di dalamnya; yang demikian itu adalah kemenangan yang besar.",
                            "verse 57:13": "(Ingatlah) semasa orang-orang munafik, lelaki dan perempuan (yang sedang meraba-raba dalam gelap-gelita pada hari kiamat), berkata kepada orang-orang yang beriman: Tunggulah kami, biarlah kami mengambil sedikit dari cahaya kamu. (Lalu) dikatakan (kepada mereka secara mengejek-ejek): Baliklah kamu ke belakang, kemudian carilah cahaya (di sana), serta diadakanlah di antara mereka (yang beriman dan yang munafik itu) sebuah tembok yang mempunyai pintu, di sebelah dalamnya mengandungi rahmat (Syurga dan nikmat) dan di sebelah luarnya, dari situ terdapat (Neraka) dan azab seksa.",
                            "verse 57:14": "(Pada saat itu) mereka (yang munafik) menyeru orang-orang yang beriman (sambil berkata): Bukankah kami bercampur gaul dengan kamu (di dunia dahulu)? Orang-orang yang beriman menjawab: Benar! Akan tetapi kamu telah membinasakan diri kamu (dengan perbuatan munafik) dan kamu telah menunggu-nunggu (kebinasaan umat Islam), dan kamu pula ragu-ragu (terhadap perkara-perkara agama) serta kamu diperdayakan oleh angan-angan kosong (untuk mencapai maksud kamu), sehinggalah datangnya (maut) yang ditetapkan oleh Allah (kepada kamu) dan (selain itu), kamu pula diperdayakan oleh bisikan Syaitan dengan (pengampunan) Allah (semata-mata dan melupakan azabNya).",
                            "verse 57:15": "Oleh itu, pada hari ini tidak diterima penebus diri dari kamu dan tidak juga dari orang-orang kafir. Tempat tinggal kamu ialah Neraka, Nerakalah sahaja penolong kamu dan itulah seburuk-buruk tempat kesudahan kamu!",
                            "verse 57:16": "Belum sampaikah lagi masanya bagi orang-orang yang beriman, untuk khusyuk hati mereka mematuhi peringatan dan pengajaran Allah serta mematuhi kebenaran (Al-Quran) yang diturunkan (kepada mereka)? Dan janganlah pula mereka menjadi seperti orang-orang yang telah diberikan Kitab sebelum mereka, setelah orang-orang itu melalui masa yang lanjut maka hati mereka menjadi keras dan banyak di antaranya orang-orang yang fasik (derhaka).",
                            "verse 57:17": "Ketahuilah kamu, bahawa Allah menghidupkan bumi sesudah matinya; sesungguhnya Kami telah menjelaskan kepada kamu keterangan-keterangan dan bukti, supaya kamu memahaminya.",
                            "verse 57:18": "Sesungguhnya orang-orang lelaki yang bersedekah dan orang-orang perempuan yang bersedekah, serta mereka memberikan pinjaman kepada Allah, sebagai pinjaman yang baik (ikhlas), akan digandakan balasannya (dengan berganda-ganda banyaknya), dan mereka pula akan beroleh pahala yang mulia.",
                            "verse 57:19": "Dan orang-orang yang beriman kepada Allah dan Rasul-rasulNya, merekalah pada sisi (hukum) Tuhan mereka, (orang-orang yang mempunyai kedudukan yang tinggi darjatnya) seperti orang-orang \"Siddiqiin\" dan orang-orang yang mati Syahid; mereka akan beroleh pahala dan cahaya orang-orang Siddiqiin dan orang-orang yang mati syahid itu dan (sebaliknya) orang yang kufur ingkar serta mendustakan ayat-ayat keterangan Kami, merekalah ahli Neraka.",
                            "verse 57:20": "Ketahuilah bahawa (yang dikatakan) kehidupan dunia itu tidak lain hanyalah (bawaan hidup yang berupa semata-mata) permainan dan hiburan (yang melalaikan) serta perhiasan (yang mengurang), juga (bawaan hidup yang bertujuan) bermegah-megah di antara kamu (dengan kelebihan, kekuatan dan bangsa keturunan) serta berlumba-lumba membanyakkan harta benda dan anak pinak; (semuanya itu terhad waktunya) samalah seperti hujan yang (menumbuhkan tanaman yang menghijau subur) menjadikan penanamnya suka dan tertarik hati kepada kesuburannya, kemudian tanaman itu bergerak segar (ke suatu masa yang tertentu), selepas itu engkau melihatnya berupa kuning; Akhirnya ia menjadi hancur bersepai dan (hendaklah diketahui lagi, bahawa) di akhirat ada azab yang berat (di sediakan bagi golongan yang hanya mengutamakan kehidupan dunia itu) dan (ada pula) keampunan besar serta keredaan dari Allah (disediakan bagi orang-orang yang mengutamakan akhirat) dan (ingatlah, bahawa) kehidupan dunia ini tidak lain hanyalah kesenangan bagi orang-orang yang terpedaya.",
                            "verse 57:21": "Berlumba-lumbalah kamu (mengerjakan amal-amal yang baik) untuk mendapat keampunan dari Tuhan kamu dan mendapat Syurga yang bidangnya seluas segala langit dan bumi, yang disediakan bagi orang-orang yang beriman kepada Allah dan Rasul-rasulNya; yang demikian ialah limpah kurnia Allah, diberikanNya kepada sesiapa yang dikehendakiNya; dan Allah sememangnya mempunyai limpah kurnia yang besar.",
                            "verse 57:22": "Tidak ada sesuatu kesusahan (atau bala bencana) yang ditimpakan di bumi dan tidak juga yang menimpa diri kamu, melainkan telah sedia ada di dalam Kitab (pengetahuan Kami) sebelum Kami menjadikannya; sesungguhnya mengadakan yang demikian itu adalah mudah bagi Allah.",
                            "verse 57:23": "(Kamu diberitahu tentang itu) supaya kamu tidak bersedih hati akan apa yang telah luput daripada kamu dan tidak pula bergembira (secara sombong dan bangga) dengan apa yang diberikan kepada kamu dan (ingatlah), Allah tidak suka kepada tiap-tiap orang yang sombong takbur, lagi membanggakan diri.",
                            "verse 57:24": "Orang-orang yang bakhil dan menyuruh manusia supaya berlaku bakhil, (akan mendapat balasan yang menghina) dan sesiapa yang berpaling (dari mematuhi hukum Allah maka padahnya tertimpa atas dirinya sendiri), kerana sesungguhnya Allah, Dialah Yang Maha Kaya, lagi Maha Terpuji.",
                            "verse 57:25": "Demi sesungguhnya! Kami telah mengutus Rasul-rasul Kami dengan membawa bukti-bukti dan mukjizat yang jelas nyata dan Kami telah menurunkan bersama-sama mereka Kitab Suci dan keterangan yang menjadi neraca keadilan, supaya manusia dapat menjalankan keadilan dan kami telah menciptakan besi dengan keadaannya mengandungi kekuatan yang handal serta berbagai faedah lagi bagi manusia. (Dijadikan besi dengan keadaan yang demikian, supaya manusia menggunakan faedah-faedah itu dalam kehidupan mereka sehari-hari) dan supaya ternyata pengetahuan Allah tentang orang yang (menggunakan kekuatan handalnya itu untuk) menegak dan mempertahankan agama Allah serta menolong Rasul-rasulNya, padahal balasan baiknya tidak kelihatan (kepadanya); sesungguhnya Allah Maha Kuat, lagi Maha Kuasa.",
                            "verse 57:26": "Dan demi sesungguhnya! Kami telah mengutus Nabi Nuh dan Nabi Ibrahim dan Kami jadikan pada keturunan keduanya orang-orang yang berpangkat Nabi dan menerima Kitab-kitab agama maka sebahagian di antara mereka: Orang yang beroleh hidayat petunjuk dan kebanyakan mereka orang-orang yang fasik (derhaka).",
                            "verse 57:27": "Kemudian Kami iringi sesudah mereka: Rasul-rasul Kami silih berganti dan Kami iringi lagi dengan Nabi Isa Ibni Mariam, serta Kami berikan kepadanya: Kitab Injil dan Kami jadikan dalam hati orang-orang yang mengikutnya perasaan belas kasihan (sesama sendiri) dan (perbuatan mereka beribadat secara) \"Rahbaniyyah\" merekalah sahaja yang mengadakan dan merekanya; Kami tidak mewajibkannya atas mereka; (mereka berbuat demikian) kerana mencari keredaan Allah; dalam pada itu mereka tidak menjaga dan memeliharanya menurut yang sewajibnya. Oleh itu, orang-orang yang beriman (kepada Nabi Muhammad) di antara mereka, kami berikan pahalanya dan (sebaliknya) banyak di antara mereka yang fasik (derhaka).",
                            "verse 57:28": "Wahai orang-orang yang beriman! Bertakwalah kamu kepada Allah dan tetaplah beriman kepada RasulNya (Muhammad), supaya Allah memberi kepada kamu dua bahagian dari rahmatNya dan menjadikan bagi kamu cahaya untuk kamu berjalan dengannya (pada hari kiamat kelak), serta diampunkannya dosa kamu dan (ingatlah), Allah Maha Pengampun, lagi Maha Mengasihani.",
                            "verse 57:29": "(Ditetapkan pemberian yang demikian kepada kamu) supaya golongan ahli Kitab (Yahudi dan Nasrani yang menentang Islam) mengetahui, bahawa sesungguhnya mereka tidak mempunyai sebarang kuasa untuk mendapat (atau menyekat) sesuatu dari limpah kurnia Allah dan bahawa sesungguhnya limpah kurnia itu terletak dalam kekuasaan Allah, diberikanNya kepada sesiapa yang dikehendakiNya dan (ingatlah), Allah jualah yang mempunyai limpah kurnia yang besar."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "آنچه در آسمانها و زمين است براى خدا تسبيح مى‏گويند; و او عزيز و حكيم است",
                            "verse 57:2": "مالكيت (و حاكميت) آسمانها و زمين از آن اوست; زنده مى‏كند و مى‏ميراند; و او بر هر چيز توانا است!",
                            "verse 57:3": "اول و آخر و پيدا و پنهان اوست; و او به هر چيز داناست",
                            "verse 57:4": "او كسى است كه آسمانها و زمين را در شش روز ( شش دوران) آفريد; سپس بر تخت قدرت قرار گرفت (و به تدبير جهان پرداخت); آنچه را در زمين فرو مى‏رود مى‏داند، و آنچه را از آن خارج مى‏شود و آنچه از آسمان نازل مى‏گردد و آنچه به آسمان بالا مى‏رود; و هر جا باشيد او با شما است، و خداوند نسبت به آنچه انجام مى‏دهيد بيناست!",
                            "verse 57:5": "مالكيت آسمانها و زمين از آن اوست; و همه كارها به سوى او بازمى‏گردد",
                            "verse 57:6": "شب را در روز مى‏كند و روز را در شب; و او به آنچه در دل سينه‏ها وجود دارد داناست",
                            "verse 57:7": "به خدا و رسولش ايمان بياوريد و از آنچه شما را جانشين و نماينده (خود) در آن قرار داده انفاق كنيد; (زيرا) كسانى كه از شما ايمان بياورند و انفاق كنند، اجر بزرگى دارند!",
                            "verse 57:8": "چرا به خدا ايمان نياوريد در حالى كه رسول (او) شما را مى‏خواند كه به پروردگارتان ايمان بياوريد، و از شما پيمان گرفته است (پيمانى از طريق فطرت و خرد)، اگر آماده ايمان‏آوردنيد",
                            "verse 57:9": "او كسى است كه آيات روشنى بر بنده‏اش ( محمد) نازل مى‏كند تا شما را از تاريكيها به سوى نور برد; و خداوند نسبت به شما مهربان و رحيم است",
                            "verse 57:10": "چرا در راه خدا انفاق نكنيد در حالى كه ميراث آسمانها و زمين همه از آن خداست (و كسى چيزى را با خود نمى‏برد)! كسانى كه قبل از پيروزى انفاق كردند و جنگيدند (با كسانى كه پس از پيروزى انفاق كردند) يكسان نيستند; آنها بلندمقامتر از كسانى هستند كه بعد از فتح انفاق نمودند و جهاد كردند; و خداوند به هر دو وعده نيك داده; و خدا به آنچه انجام مى‏دهيد آگاه است",
                            "verse 57:11": "كيست كه به خدا وام نيكو دهد (و از اموالى كه به او ارزانى داشته انفاق كند) تا خداوند آن را براى او چندين برابر كند؟ و براى او پاداش پرارزشى است!",
                            "verse 57:12": "(اين پاداش بزرگ) در روزى است كه مردان و زنان باايمان را مى‏نگرى كه نورشان پيش‏رو و در سمت راستشان بسرعت حركت مى‏كند (و به آنها مى‏گويند:) بشارت باد بر شما امروز به باغهايى از بهشت كه نهرها زير (درختان) آن جارى است; جاودانه درآن خواهيد ماند! و اين همان رستگارى بزرگ است!",
                            "verse 57:13": "روزى كه مردان و زنان منافق به مؤمنان مى‏گويند: «نظرى به ما بيفكنيد تا از نور شما پرتوى برگيريم!» به آنها گفته مى‏شود: «به پشت سر خود بازگرديد و كسب نور كنيد!» در اين هنگام ديوارى ميان آنها زده مى‏شود كه درى دارد، درونش رحمت است و برونش عذاب!",
                            "verse 57:14": "آنها را صدا مى‏زنند: «مگر ما با شما نبوديم؟!» مى‏گويند: «آرى، ولى شما خود را به هلاكت افكنديد و انتظار (مرگ پيامبر را) كشيديد، و (در همه چيز) شك و ترديد داشتيد، و آرزوهاى دور و دراز شما را فريب داد تا فرمان خدا فرا رسيد، و شيطان فريبكار شما را در برابر (فرمان) خداوند فريب داد!",
                            "verse 57:15": "پس امروز نه از شما فديه‏اى پذيرفته مى‏شود، و نه از كافران; و جايگاهتان آتش است و همان سرپرستتان مى‏باشد; و چه بد جايگاهى است!",
                            "verse 57:16": "آيا وقت آن نرسيده است كه دلهاى مؤمنان در برابر ذكر خدا و آنچه از حق نازل كرده است خاشع گردد؟! و مانند كسانى نباشند كه در گذشته به آنها كتاب آسمانى داده شد، سپس زمانى طولانى بر آنها گذشت و قلبهايشان قساوت پيدا كرد; و بسيارى از آنها گنهكارند!",
                            "verse 57:17": "بدانيد خداوند زمين را بعد از مرگ آن زنده مى‏كند! ما آيات (خود) را براى شما بيان كرديم، شايد انديشه كنيد!",
                            "verse 57:18": "مردان و زنان انفاق‏كننده، و آنها كه (از اين راه) به خدا «قرض الحسنه‏» دهند، (اين قرض الحسنه) براى آنان مضاعف مى‏شود و پاداش پرارزشى دارند!",
                            "verse 57:19": "كسانى كه به خدا و رسولانش ايمان آوردند، آنها صديقين و شهدا نزد پروردگارشانند; براى آنان است پاداش (اعمال)شان و نور (ايمان)شان; و كسانى كه كافر شدند و آيات ما را تكذيب كردند، آنها دوزخيانند",
                            "verse 57:20": "بدانيد زندگى دنيا تنها بازى و سرگرمى و تجمل پرستى و فخرفروشى در ميان شما و افزون طلبى در اموال و فرزندان است، همانند بارانى كه محصولش كشاورزان را در شگفتى فرو مى‏برد، سپس خشك مى‏شود بگونه‏اى كه آن را زردرنگ مى‏بينى; سپس تبديل به كاه مى‏شود! و در آخرت، عذاب شديد است يا مغفرت و رضاى الهى; و (به هر حال) زندگى دنيا چيزى جز متاع فريب نيست!",
                            "verse 57:21": "به پيش تازيد براى رسيدن به مغفرت پروردگارتان و بهشتى كه پهنه آن مانند پهنه آسمان و زمين است و براى كسانى كه به خدا و رسولانش ايمان آورده‏اند; آماده شده است، اين فضل خداوند است كه به هر كس بخواهد مى‏دهد; و خداوند صاحب فضل‏عظيم است!",
                            "verse 57:22": "هيچ مصيبتى (ناخواسته) در زمين و نه در وجود شما روى نمى‏دهد مگر اينكه همه آنها قبل از آنكه زمين را بيافرينيم در لوح محفوظ ثبت است; و اين امر براى خدا آسان است!",
                            "verse 57:23": "اين بخاطر آن است كه براى آنچه از دست داده‏ايد تاسف نخوريد، و به آنچه به شما داده است دلبسته و شادمان نباشيد; و خداوند هيچ متكبر فخرفروشى را دوست ندارد!",
                            "verse 57:24": "همانها كه بخل مى‏ورزند و مردم را به بخل دعوت مى‏كنند; و هر كس (از اين فرمان) روى‏گردان شود، (به خود زيان مى‏رساند نه به خدا)، چرا كه خداوند بى‏نياز و شايسته ستايش است!",
                            "verse 57:25": "ما رسولان خود را با دلايل روشن فرستاديم، و با آنها كتاب (آسمانى) و ميزان (شناسايى حق از باطل و قوانين عادلانه) نازل كرديم تا مردم قيام به عدالت كنند; و آهن را نازل كرديم كه در آن نيروى شديد و منافعى براى مردم است، تا خداوند بداند چه كسى او و رسولانش را يارى مى‏كند بى‏آنكه او را ببينند; خداوند قوى و شكست‏ناپذير است!",
                            "verse 57:26": "ما نوح و ابراهيم را فرستاديم، و در دودمان آن دو نبوت و كتاب قرار داديم; بعضى از آنها هدايت يافته‏اند و بسيارى از آنها گنهكارند",
                            "verse 57:27": "سپس در پى آنان‏رسولان ديگر خود را فرستاديم، و بعد از آنان عيسى بن مريم را مبعوث كرديم و به او انجيل عطا كرديم، و در دل كسانى كه از او پيروى كردند رافت و رحمت قرار داديم; و رهبانيتى را كه ابداع كرده بودند، ما بر آنان مقرر نداشته بوديم; گرچه هدفشان جلب خشنودى خدا بود، ولى حق آن را رعايت نكردند; از اين‏رو ما به كسانى از آنها كه ايمان آوردند پاداششان را داديم; و بسيارى از آنها فاسقند!",
                            "verse 57:28": "اى كسانى كه ايمان آورده‏ايد! تقواى الهى پيشه كنيد و به رسولش ايمان بياوريد تا دو سهم از رحمتش به شما ببخشد و براى شما نورى قرار دهد كه با آن (در ميان مردم و در مسير زندگى خود) راه برويد و گناهان شما را ببخشد; و خداوند غفور و رحيم است",
                            "verse 57:29": "تا اهل كتاب بدانند كه قادر بر چيزى از فضل خدا نيستند، و تمام فضل (و رحمت) به دست اوست، به هر كس بخواهد آن را مى‏بخشد; و خداوند داراى فضل عظيم است!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Tudo quanto existe nos céus e na terra glorifica Deus, porque Ele é o Poderoso, o Prudentíssimo.",
                            "verse 57:2": "Seu é o reino dos céus e da terra; dá a vida e dá a morte, e é Onipotente.",
                            "verse 57:3": "Ele é o Primeiro e o Último; o Visível e o Invisível, e é Onisciente.",
                            "verse 57:4": "Ele foi Quem criou os céus e a terra, em seis dias; então, assumiu o trono. Ele bem conhece o que penetra na terra e tudo quanto dela sai; o que desce do céu e tudo quanto a ele ascende, e está convosco onde quer que estejais, e bem vê tudo quanto fazeis.",
                            "verse 57:5": "Seu é o reino dos céus e da terra, e a Deus retornarão todos os assuntos.",
                            "verse 57:6": "Ele insere a noite no dia e o dia na noite, e é Sabedor das intimidades dos corações.",
                            "verse 57:7": "Crede em Deus e em Seu Mensageiro, e fazei caridade daquilo que Ele vos fez herdar. E aqueles que, dentre vós, crerem e fizerem caridade, obterão uma grande recompensa.",
                            "verse 57:8": "E que escusas tereis para não crerdes em Deus, se o Mensageiro vos exorta a crerdes no vosso Senhor? Ele recebeu a vossa promessa, se sois fiéis.",
                            "verse 57:9": "Ele (Deus) é Quem revela ao Seu servo lúcidos versículos, para que vos tire das trevas e vos conduza à luz, porque Ele é, para convosco, compassivo, Misericordiosíssimo.",
                            "verse 57:10": "E que escusas tereis para não contribuirdes na causa de Deus, uma vez que a Deus pertence a herança dos céus e da terra? Nesse caso, jamais podereis equiparar-vos aos que tiverem contribuído e combatido, antes da conquista - estes são mais dignos do que aqueles que contribuíram e combateram posteriormente -, ainda que Deus tenha prometido a todos o bem. Sabei que Deus está inteirado de tudo quanto fazeis.",
                            "verse 57:11": "Qual será o fiel que não quererá emprestar espontaneamente a Deus? Será retribuído em dobro, e terá uma generosa recompensa!",
                            "verse 57:12": "(Será) o dia em que verás (ó Mohammad) os fiéis e as fiéis com a luz a se irradiar, ante eles, pela sua crença. Nesse dia vos alvissaremos com jardins, abaixo dos quais correm os rios, onde morareis eternamente. Tal será a magnífica recompensa!",
                            "verse 57:13": "(Será também) o dia em que os hipócritas e as hipócritas dirão aos fiéis: Esperai-nos: para que nos iluminemos com a vossa luz! Ser-lhes-á retrucado: Voltai atrás, e buscai a luz! Entre eles se elevará uma muralha provida de uma porta, por detrás da qual estará a misericórdia, e em frente à qual estará o suplício infernal.",
                            "verse 57:14": "(Os hipócritas) clamarão: Acaso não estávamos convosco? Ser-lhes-á replicado: Sim! Porém, caístes em tentação e vos enganastes mutuamente e duvidastes (da religião), e os vossos desejos vos iludiram, até que se cumpriram os desígnios de Deus. E o sedutor vos enganou a respeito de Deus.",
                            "verse 57:15": "Assim, pois, hoje não se aceitará resgate algum por vós, nem pelos incrédulos. A vossa morada será o fogo, que é o que merecestes. E que funesto destino!",
                            "verse 57:16": "Porventura, não chegou o momento de os fiéis humilharem os seus corações à recordação de Deus e à verdade revelada, para que não sejam como os que antes receberam o Livro? Porém, longo tempo passou, endurecendo-lhes os corações, e a sua maioria é rebelde e transgressora.",
                            "verse 57:17": "Sabei que Deus vivifica a terra, depois de ter sido árida. Elucidamos-vos os versículos, para que raciocineis.",
                            "verse 57:18": "Em verdade, os caritativos e as caritativas, e aqueles que emprestam espontaneamente a Deus serão retribuídos em dobro, e obterão uma generosa recompensa.",
                            "verse 57:19": "E aqueles que crêem em Deus e em Seus mensageiros são os leias, e os mártires terão, do Seu Senhor, a sua recompensa e a sua luz. Em troca, os incrédulos que desmentem, os Nossos versículos, serão os réprobos.",
                            "verse 57:20": "Sabei que a vida terrena é tão-somente jogo e diversão, veleidades, mútua vanglória e rivalidade, com respeito à multiplicação de bens e filhos; é como a chuva, que compraz aos cultivadores, por vivificar a plantação; logo, completa-se o seu crescimento e a verás amarelada e transformada em feno. Na outra vida haverá castigos severos, indulgência e complacência de Deus. Que é vida terrena, senão um prazer ilusório?",
                            "verse 57:21": "Emulai-vos, pois, em obter a indulgência do vosso Senhor e o Paraíso, cujas dimensões igualam as do céu e da terra, reservado para aqueles que cede a quem Lhe apraz, porque é Agraciante por excelência.",
                            "verse 57:22": "Não assolará desgraça alguma, quer seja na terra, quer sejam a vossas pessoas, que não esteja registrada no Livro, antes mesmo que a evidenciemos. Sabei que isso é fácil a Deus,",
                            "verse 57:23": "Para que vos não desespereis, pelos (prazeres) que vos foram omitidos, nem nos exulteis por aquilo com que vos agraciou, porque Deus não aprecia arrogante e jactancioso algum,",
                            "verse 57:24": "Que mesquinha e recomenda aos demais a avareza. Mas quem desdenhar, que fique sabendo que Deus é, por Si só, o Opulento, o Laudabilíssimo.",
                            "verse 57:25": "Enviamos os Nossos mensageiros com as evidências: e enviamos, com eles, o Livro e a balança, para que os humanos observem a justiça; e criamos o ferro, que encerra grande poder (para a guerra), além de outros benefícios para os humanos, para que Deus Se certifique de quem O secunda intimamente, a Ele e aos Seus mensageiros; Sabei que Deus é Poderoso, Fortíssimo.",
                            "verse 57:26": "E enviamos também Noé e Abraão, e estabelecemos entre seus descendentes a profecia e o Livro; entre eles, há os encaminhados; porém, a sua maioria é depravada.",
                            "verse 57:27": "Então, após eles, enviamos outros mensageiros Nossos e, após estes, enviamos Jesus, filho de Maria, a quem concedemos o Evangelho; e infundimos nos corações daqueles que o seguem compaixão e clemência. No entanto, seguem a vida monástica, que inventaram, mas que não lhes prescrevemos; (Nós lhes prescrevemos) apenas compraz a Deus; porém, não o observaram devidamente. E recompensamos os fiéis, dentre eles; porém, a maioria é depravada.",
                            "verse 57:28": "Ó fiéis, temei a Deus e crede em Seu Mensageiro! Ele vos concederá dupla porção da Sua misericórdia, dar-vos-á uma luz, com que vos encaminhará e vos perdoará; e Deus é Indulgente, Misericordiosíssimo.",
                            "verse 57:29": "Que os adeptos do Livro saibam que não têm qualquer poder sobre a graça de Deus, porque a graça somente está na Mão de Deus, que a concede a quem Lhe apraz; Sabei que Deus é Agraciante por excelência."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 57:1": "Tot ceea ce se aflã în ceruri și pre pãmânt Îi aduce laudã lui Allah, cãci El este Puternic [și] Înțelept [Al-'Aziz, Al-Hakim].",
                            "verse 57:2": "A Lui este împãrãția cerurilor și a pãmântului. El dã viațã și dã moartea și El este cu putere peste toate.",
                            "verse 57:3": "El este Întâiul și Cel de pe urmã, Cel de deasupra tuturor și Cel ascuns și El este a toate știutor [Al-Awwal, Al-Aakher, Az-Zaher, Al- Baten].",
                            "verse 57:4": "El este Cel care a creat cerurile și pãmântul în șase zile și pe urmãs-a așezat pe Tron. El știe ce intrã în pãmânt și ce iese din el , cecoboarã din cer și ce se înalțã l",
                            "verse 57:5": "A Lui este împãrãția cerurilor și a pãmântului și la Allah se întorc[toate] lucrurile .",
                            "verse 57:6": "El face ca noaptea sã intre în zi și ca ziua sã intre în noapte și El este Știutorul celor dinlãuntrul piepturilor .",
                            "verse 57:7": "Credeți în Allah și în Trimisul Sãu și faceți milostenie din celeasupra cãrora El v-a fãcut urmași, cãci aceia dintre voi care cred șicare fac milostenie vor avea parte de rãs",
                            "verse 57:8": "Și ce aveți voi cã nu credeți în Allah, în vreme ce Trimisul vã cheamã sã credeți în Domnul vostru? Iar El a fãcut legãmânt cu voi. Dacã voi vreți sã crede",
                            "verse 57:9": "El este Cel care pogoarã asupra robului Sãu semne limpezi, pentru ca sã vã scoatã pe voi din întunecimi la luminã . Și Allah este Iertãtor, Îndurãtor [Ra'uf, Rahim] cu voi.",
                            "verse 57:10": "Și ce aveți voi cã nu dãruiți pe calea lui Allah, în vreme ce a Lui este moștenirea cerurilor și a pãmântului? Nu este deopotrivã cel caredãruiește dintre voi și care luptã în",
                            "verse 57:11": "Acela care Îi va da lui Allah un împrumut frumos , El i-l va da înapoi înmulțit și va avea parte de rãsplatã generoasã.",
                            "verse 57:12": "Într-o zi îi vei vedea pe dreptcredincioși și pe dreptcredincioase cu lumina alergând în fața lor și în dreapta lor. [Și li se va zice lor] :\"Iatã astãzi vestea voastrã cea bunã: Grãdini",
                            "verse 57:13": "Și în Ziua aceea, fãțarnicii și fãțarnicele le vor zice dreptcredin- cioșilor: “Așteptați ca sã luãm și noi din lumina voastrã!” Dar [li] se va zice: “Întoarceți-v",
                            "verse 57:14": "Și vor striga cãtre ei : \"Oare nu am fost împreunã cu voi?\" Vor zice: \"Ba da! Însã voi v-ați lãsat ispitiți și ați stat la pândã și ați stat laîndoialã și v-au",
                            "verse 57:15": "Și astãzi nu se mai primește rãscumpãrare nici de la voi, nici dela aceia care au tãgãduit. Sãlașul vostru va fi Focul. El va fi locul ce vise cuvine vouã. Și ce rea soartã",
                            "verse 57:16": "Oare nu a sosit vremea pentru aceia care cred, ca inimile lor sã fie smerite la pomenirea lui Allah și înaintea Adevãrului care a fosttrimis și ca ei sã nu fie ca aceia cãrora li s-a dãruit Carte",
                            "verse 57:17": "Sã știți cã Allah dã viațã pãmântului, dupã moartea lui! Noi v-am fãcut vouã semnele limpezi, pentru ca voi sã pricepeți.",
                            "verse 57:18": "Aceia care au fãcut milostenie și acelea care au fãcut miloste- nie I-au dat lui Allah un împrumut minunat, care li se va întoarce lor înmulțit, și vor avea ei parte de rãsplatã generoasã .",
                            "verse 57:19": "Aceia care au crezut în Allah și în trimișii Sãi - aceia sunt ceiiubitori de adevãr - și martirii vor avea la Domnul lor rãsplata șilumina lor, iar aceia care nu au crezut și au soco",
                            "verse 57:20": "Sã știți cã viața aceasta este doar o joacã, o glumã, o podoabã ,goanã dupã laudã între voi și dupã înmulțirea averilor și a copiilor.[Aceasta] es",
                            "verse 57:21": "Grãbiți-vã, întrecându-vã, cãtre iertarea Domnului vostru și cãtreo Grãdinã într-atât de largã, precum lãrgimea cerului și a pãmântului,care a fost pregãtit&a",
                            "verse 57:22": "Nici o nenorocire nu se îndreaptã pe pãmânt și nici în sufletelevoastre fãrã ca ea sã nu se afle într-o carte , înainte ca Noi sã opricinuim. Acesta este un lucru ușor pentru Allah,",
                            "verse 57:23": "Pentru ca voi sã nu fiți triști pentru ceea ce ați pierdut și nici sã nu vã prea bucurați pentru ceea ce El vã dãruiește. Și Allah nu-l iubește pe cel trufaș și l&ati",
                            "verse 57:24": "Pe aceia care sunt zgârciți și le poruncesc oamenilor sã fie zgârciți. Cât despre acela care întoarce spatele , Allah este Cel suficient pentru Sine [și] El este Cel Vrednic de Laudã [Al-Ghaniyy, Al-Hamid].",
                            "verse 57:25": "Noi i-am trimis pe trimișii Noștri cu semnele cele limpezi, am fãcut sã pogoare cu ei Scriptura și Balanța, pentru ca oamenii sã fie cu dreptate, și am fãcut sã pogoare fierul, în ca",
                            "verse 57:26": "Noi i-am trimis pe Noe și pe Avraam și le-am dãruit urmașilor lorprofeția și Scriptura. Și printre ei au fost unii bine cãlãuziți, însãmulți dintre ei au fost ieșiți din dr",
                            "verse 57:27": "Apoi, Noi i-am fãcut sã meargã pe urmele lor pe trimișii Noștri șil-am fãcut sã urmeze pe Isus fiul Mariei, și i-am dãruit lui Evanghelia,iar în inimile celor care l-au urmat am pus m",
                            "verse 57:28": "O, voi cei care credeți! Fiți cu fricã de Allah și credeți înTrimisul Sãu [Muhammed] astfel El vã va dãrui douã pãrți dinîndurarea Sa, vã va face o lumin&a",
                            "verse 57:29": "Aceasta pentru ca oamenii Cãrții sã știe cã ei nu vor avea nici o putere asupra harului lui Allah și cã harul se aflã în mâna lui Allah șiEl îl dãruiește cui voiește El, cãci"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 57:1": "Cele din ceruri şi de pe pământ îl preamăresc pe Dumnezeu. El este Puternicul, Înţeleptul.",
                            "verse 57:2": "A Lui este împărăţia cerurilor şi a pământului. El dăruieşte viaţa şi dăruieşte moartea. El asupra tuturor are putere.",
                            "verse 57:3": "El este Întâiul şi Ultimul, Cel din afară şi Cel din lăuntru. El este Atotcunoscător.",
                            "verse 57:4": "El este Cel ce a creat cerurile şi pământul în şase zile, apoi s-a aşezat pe Tron. El ştie ceea ce intră în pământ şi ce iese din el, precum şi ceea ce coboară din cer şi ceea ce urcă la el. Oriunde aţi fi, El este cu voi. Dumnezeu este Văzător a ceea ce făptuiţi,",
                            "verse 57:5": "A Lui este împărăţia cerurilor şi a pământului. Poruncile, la El, se întorc.",
                            "verse 57:6": "El face ca noaptea să străpungă ziua şi ca ziua să străpungă noaptea. El este Cunoscător al lăuntrului inimilor",
                            "verse 57:7": "Credeţi în Dumnezeu şi în trimisul Său! Dăruiţi din ceea ce v-a dat ca urmaşi. Cei dintre voi care au crezut şi au dăruit vor avea o mare răsplată.",
                            "verse 57:8": "De ce nu credeţi în Dumnezeu, când trimisul vă cheamă să credeţi în Domnul vostru? El a încheiat un legământ cu voi, dacă spuneţi adevărul!",
                            "verse 57:9": "El este Cel ce pogoară asupra robului Său semne vădite ca să vă scoată din întunecimi către lumină. Dumnezeu este Blând şi Milostiv cu voi.",
                            "verse 57:10": "Ce aveţi de nu dăruiţi pentru calea lui Dumnezeu, atunci când moştenirea cerurilor şi a pământului este a lui Dumnezeu? Voi nu sunteţi toţi deopotrivă: cel care a dăruit şi a luptat înainte de biruinţă este pe o treaptă mai înaltă decât cei care au dăruit şi au luptat după aceea. Tuturor Dumnezeu le făgăduieşte prea binele. Dumnezeu este Ştiutor a ceea ce făptuiţi.",
                            "verse 57:11": "Cine este cel care dă un frumos împrumut lui Dumnezeu? El îi înapoiează îndoit şi are o răsplată îmbelşugată.",
                            "verse 57:12": "Într-o zi îi vei vedea pe credincioşi şi pe credincioase a căror lumină se va zori înaintea şi în dreapta lor: “O veste bună vouă, astăzi! Grădini pe sub care curg râuri, unde veţi veşnici! Aceasta este fericirea cea mare.”",
                            "verse 57:13": "Într-o Zi făţarnicii şi făţarnicele vor spune credincioşilor: “Aşteptaţi-ne să luăm din lumina voastră.” Li se va spune: “Întoarceţi-vă şi veţi găsi lumină!” Un zid cu poartă va fi înălţat între ei. În lăuntrul lui va fi milostivenia, iar în afara lui osânda.",
                            "verse 57:14": "Ei le vor striga credincioşilor: “Nu aţi fost împreună cu noi?” Aceştia vor zice: “Ba da! Voi v-aţi ispitit pe voi înşivă, aţi tărăgănat şi v-aţi îndoit. Nădejdile voastre v-au înşelat până ce a venit Porunca lui Dumnezeu. Înşelătorul v-a înşelat cu privire la Dumnezeu.",
                            "verse 57:15": "Astăzi, nu se ia nici o răscumpărare, nici de la voi, nici de la tăgăduitori. Limanul vostru este Focul: el este însoţitorul vostru. Ce rea devenire!",
                            "verse 57:16": "Nu a venit oare clipa ca inimile credincioşilor să se smerească auzind amintirea lui Dumnezeu şi ceea ce s-a pogorât din Adevăr şi să nu fie asemenea celor care au primit altădată Cartea? Vreme îndelungată a trecut peste ei, inimile li s-au împietrit, iar mulţi sunt desfrânaţi.",
                            "verse 57:17": "Să ştiţi că Dumnezeu va da viaţă pământului după moarte. Noi v-am desluşit semnele! Poate veţi pricepe!",
                            "verse 57:18": "Bărbaţilor şi femeilor care dau milostenie, cei care dau un frumos împrumut lui Dumnezeu, El li-l dă îndoit înapoi. Ei vor avea o răsplată îmbelşugată.",
                            "verse 57:19": "Drepţi sunt cei care cred în Dumnezeu şi în trimisul Său, ei sunt martorii Domnului lor de la care îşi vor primi răsplata şi lumina. Cei care au tăgăduit şi au socotit semnele Noastre minciuni vor fi soţii Focului.",
                            "verse 57:20": "Să ştiţi că Viaţa de Acum nu este decât un joc, o desfătare, o găteală fără rost, o luptă a trufiilor voastre, o duşmănie în a aduna cât mai multe averi şi a avea cât mai mulţi prunci. Ea este asemenea unei răpăieli de ploaie; verdeaţa ce va creşte după ea place tăgăduitorilor, apoi se usucă. Tu o vezi cum se îngălbeneşte, apoi se usucă şi se fărâmiţează. În Viaţa de Apoi, veţi avea fie o osândă aprigă, fie iertarea şi mulţumirea lui Dumnezeu. Viaţa de Acum nu este decât o plăcere înşelătoare.",
                            "verse 57:21": "Grăbiţi-vă către iertarea Domnului vostru, către Grădina cea mare cât cerul şi pământul, pregătită celor care au crezut în Dumnezeu şi în trimişii Săi. Aceasta este harul lui Dumnezeu pe care El îl dăruieşte cui voieşte. Dumnezeu este Stăpânul Harului cel Mare!",
                            "verse 57:22": "Nici o nenorocire nu atinge pământul şi nici pe voi înşivă fără ca aceasta să nu fie scrisă într-o Carte, înainte chiar de a fi descătuşat-o. Aceasta Îi este lesne lui Dumnezeu!",
                            "verse 57:23": "Aceasta ca să nu vă mâhniţi de ceea ce aţi pierdut şi nici să nu vă bucuraţi de ceea ce El v-a dat. Dumnezeu nu îl iubeşte pe lăudărosul îngâmfat",
                            "verse 57:24": "şi nici pe zgârciţii ce poruncesc oamenilor să fie zgârciţi. Cel care întoarce spatele să ştie că Dumnezeu este Bogatul, Lăudatul.",
                            "verse 57:25": "Noi i-am trimis pe trimişii Noştri cu dovezi vădite. Noi am pogorât odată cu ei Cartea şi balanţa ca oamenii să se poarte drept. Noi am pogorât de asemenea fierul în care este o nenorocire cumplită şi în care sunt foloase oamenilor pentru ca Dumnezeu să-i ştie pe cei ce-L ajută pe El, precum şi trimişii Săi, în taină. Dumnezeu este Tare, Puternic.",
                            "verse 57:26": "Noi i-am trimis pe Noe şi pe Abraham şi i-am dat seminţiei lor proorocirea şi Cartea. Unii au fost călăuziţi, alţii — cei mai mulţi — au fost desfrânaţi.",
                            "verse 57:27": "Noi am trimis pe urmele lor alţi trimişi de-ai Noştri. Noi l-am trimis pe Iisus, fiul Mariei. Noi i-am dat lui Evanghelia şi am pus în inimile celor care îl urmau blândeţea şi milostenia, însă călugăria pe care ei au întemeiat-o, Noi nu le-am scris-o decât pentru a căuta mulţumirea lui Dumnezeu. Ei nu au păzit-o însă aşa cum se cuvenea s-o păzească. Cei care crezură, dintre ei, avură răsplata, însă mulţi fură desfrânaţi!",
                            "verse 57:28": "O, voi cei ce credeţi! Temeţi-vă de Dumnezeu! Credeţi în trimisul Său pentru ca Dumnezeu să vă dea îndoit din milostivenia Sa şi să vă dăruiască o lumină în care să mergeţi şi să vă ierte vouă. Dumnezeu este Iertător, Milostiv.",
                            "verse 57:29": "Oamenii Cărţii să ştie că nu pot nimic asupra harului lui Dumnezeu. Harul este în mâna lui Dumnezeu şi El îl dăruie cui voieşte. Dumnezeu este Stăpânul Harului cel Mare!"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Все в небесах и на землеХвалу и славу воздает Аллаху,Кто всемогущ и мудр безмерно!",
                            "verse 57:2": "Лишь Он владеет небесами и землей,Лишь Он дарует жизньИль смерть (вам) назначает, —Он всемогущ над всем и вся!",
                            "verse 57:3": "Начало и конец — Он,Явь и тайнаИ преисполнен знанья всякой вещи.",
                            "verse 57:4": "Он — Тот, Кто небеса и землюсотворилЗа шесть (небесных) дней2215аИ утвердил Свое державие на Троне.Он знает, что уходит в землюИ что выходит из нее;Он знает, что нисходит с небаИ что стремится к небесам.И где б вы ни были, всегда Он с вамиИ зрит незримо все, что делаете вы.",
                            "verse 57:5": "Лишь Он владеет небесами и землей,И лишь к Аллаху — возвращение всехдел.",
                            "verse 57:6": "Он вводит ночь на смену дняИ день вливает в ночь,И Он владеет знанием того,Что схоронилось в ваших душах.",
                            "verse 57:7": "Так веруйте в Аллаха и посланникаЕгоИ (с милосердием) расходуйтеиз благ,Что Он оставил вам в наследство, —Ведь тех, кто верует (в Аллаха),Расходуя (из своего добра)на промысле Его,Ждет превеликая награда.",
                            "verse 57:8": "Так что’ удерживает васот поклонения Аллаху?Ведь вас уверовать в Него зовет (Его)посланник.И если обрели вы веру,То, несомненно, с вами в Договоре2216Он.",
                            "verse 57:9": "Он — Тот, Кто посылает Своему слугезнаменья ясные,Чтобы из мрака к свету вас он вывел, —Поистине, Аллах к вам милостиви благ.",
                            "verse 57:10": "И что удерживает вас расходоватьсвое доброНа промысле Аллаха?Ему Единому принадлежит наследиеземли и неба.И неравны перед Аллахом будут те,Кто щедростью дарил до временипобедыИ в час сраженья лично воевал, —Они возвысятся над теми,Кто, не сражаясь, щедрость проявляллишь после.Им всем обещана награда от Аллаха,И ведает о всех деяньях ваших Он.",
                            "verse 57:11": "Так кто же тот, кто предоставитщедрый займ Аллаху?Ведь Он его умножит во сто раз,(Добавив к этому) достойную награду.",
                            "verse 57:12": "В тот ДеньУвидишь ты, как впереди у верующихженщин и мужчин,По праву сторону от них2217,Струится ясный Свет (и слышится):«Сегодня вам предстанет радостнаявесть!Сады, потоками речными омовенны,Где пребывать навечно вам, —Поистине, великое свершенье!»2217",
                            "verse 57:13": "И обратятся к верующим лицемерыв этот День —Как женщины, так и мужчины:«О, подождите нас! Позвольте взятьу вас взаймыОт Света вашего хоть небольшуюдолю!»Им скажут:«Возвращайтесь-ка назад и тамищите Света!»И между ними вырастет стенас вратами,И милосердие заполнит все, что в ней.А за пределами ее — лишь (Божийгнев и) муки!",
                            "verse 57:14": "И (лицемеры) возгласят:«Ужель мы не стояли рядом с вами?»Ответят им:«Вы были рядом с нами,Но отдались соблазну выИ, выжидая, предались сомненьям.Вам лгали ваши вожделенья,Пока не снизошло веление Аллаха,Но искуситель (вновь) вас сбилс Его пути.",
                            "verse 57:15": "И вот теперь ни с вас,Ни с тех, кто Господа отверг,Не будет принят откуп.Убежищем для вас предстанет Ад —Достойное жилище ваших душ,Сквернейшее пристанище(для грешных)!»",
                            "verse 57:16": "И разве не настало времяВсем праведным открыть свои сердцаВ смиренье полном пред АллахомИ Истиной, которая открылась им?И им не должно уподобиться всем тем,Кому (Господне) Откровениепредстало раньшеИ чьи сердца за долгие годаожесточилисьИ многих превратили в (грешников)распутных.",
                            "verse 57:17": "Познайте все, что лишь АллахСпособен жизнь вернуть земле,Когда она поникла в смерти,И Мы послали ясные знаменья вам,Чтоб вы уразумели эту мудрость.",
                            "verse 57:18": "Но тех мужчин и дев,Которые на подать милостиво тратятИ отдают Аллаху щедрый займ,Что будет Им умножен во сто крат, —Их ждет достойная награда.",
                            "verse 57:19": "И те, кто верует в Аллахаи посланников Его, —В Деснице Господа —Правдивые служители и мученики(в ближней жизни)2218.Им — Свет и (высшая) награда!Но те, кто Господа отвергИ объявил Его знаменья ложью,Собратьями в Аду предстанут.",
                            "verse 57:20": "Познайте все, что жизнь в этоммире —Забава легкая да тще’та,Взаимная хвальба, да суетная слава,Да умножение добра и отроков своих.И в этой суете подобны вы дождю,Что поросль взрастит на радостьгрешным, —Со временем она увянет, пожелтеетна глазах,Иссохнет и осыплется в незримость.Но в будущем — суровой будет карадля неверных,И будет всепрощенье и наградаДля праведных служителей Аллаха.И жизнь ваша в мире сем —Лишь себялюбцев сладостный обман,Что будет временем рассеян.",
                            "verse 57:21": "Спешите ж заслужить прощениеАллахаИ пребывание в Его Саду,Что простирается на весь просторземли и небаИ уготован был для тех,Которые в Аллаха и посланников ЕгоУверовали (всей душой и сердцем), —Аллах, поистине, податель всехщедрот!",
                            "verse 57:22": "И ни одна беда ни землю и ни душиваши не постигнет,Чтобы о ней не указалось в Книге(уложений)2218а,Раньше, чем Мы ее осуществим, —И это не составит Нам труда, —",
                            "verse 57:23": "Чтоб не печалило вас то,Что стороной от вас проходит,И чтобы ликованью выне предавалисьО том, чем вас (Аллах так щедро)одарил.Хвастливых гордецов Аллахне любит —",
                            "verse 57:24": "Тех, кто скупится и другимпредписывает скупость.И если (от Аллаха) отвратитсякто-нибудь из вас, —Так ведь Аллах свободен от всех нужд,Достоин Он хвалеб и славы!",
                            "verse 57:25": "Мы посылали к вам посланниковСвоих,Которые несли вам ясные знаменьяИ вместе с ними Книгу откровенийИ Весы (для замерения Добра и Зла),Чтоб человек блюсти мог правосудье.Мы низвели железо вам:В нем — зло смертельное (в войне)И благотворность (в мирной жизни).И оно станет испытанием для вас,Чтобы Аллах мог рассудить,Кто втайне отдает все силыЕго (заветам) и посланникам Его, —Аллах, поистине, всесилен и могуч!",
                            "verse 57:26": "И Мы, поистине, послали Нухаи (ханифа) ИбрахимаИ основали дар пророчества средипотомков ихИ доступ к Книге (Наших откровений),Но лишь немногие путь праведныйизбрали,А остальные в грешников распутныхпревратились.",
                            "verse 57:27": "И вслед за ними Мы другихпосланников послали,За ними — Ису, сына Марйам,Которому Евангелие дали.И души тех, которые пошли за ним,Мы пропитали состраданиеми милостью (к собратьям).Но жизнь монашескую,Что они измыслили себе,Мы не предписывали им.Они же делали сие в угоду Богу,Хотя это была не та угода,Какую надлежало им блюсти.Мы тем из них, которые уверовали(в Бога),Послали должную награду.Но стали многие из них(Господнему Закону) непослушны.",
                            "verse 57:28": "О вы, кто верует!Страшитесь Господа и веруйтев посланника Его, —Он вам удвоит Свою милостьИ Свет зажжет, с которым выпойдете2219.И Он простит вам (вашипрегрешенья), —Прощающ ведь Аллах и милосерд!",
                            "verse 57:29": "И чтобы знали люди Книги,Что нет им власти ни над чемиз милости Аллаха,Что милость — вся в Его РукеИ Он дарует ее тем,Кого сочтет Своей угодой, —Ведь лишь Аллах — Податель всехщедрот."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Lo que está en los cielos y en la tierra glorifica a Alá. Éles el Poderoso, el Sabio.",
                            "verse 57:2": "Suyo es el dominio de los cielos y de la tierra. Él da la vida y da la muerte. Y es omnipotente.",
                            "verse 57:3": "Él es el Principio y el Fin, el Visible y el Escondido. Y es omnisciente.",
                            "verse 57:4": "Él es Quien creó los cielos y la tierra en seis días. Luego, se instaló en el Trono. Sabe lo que penetra en la tierra y lo que de ella sale, lo que desciende del cielo y lo que a él asciende. Está con vosotros dondequiera que os encontréis. Alá ve bien lo que hacéis.",
                            "verse 57:5": "Suyo es el dominio de los cielos y de la tierra. ¡Y todo será devuelto a Alá!",
                            "verse 57:6": "Hace que la noche entre en el día y que el día entre en la noche. Y Él sabe bien lo que encierran los pechos.",
                            "verse 57:7": "¡Creed en Alá y en Su Enviado! Dad limosna de los bienes de los que Él os ha hecho últimos poseedores. Aquéllos de vosotros que hayan creído y dado limosna tendrán una gran recompensa.",
                            "verse 57:8": "Y ¿por qué no habéis de creer en Alá, siendo así que el Enviado os invita a creer en vuestro Señor y que ha concertado un pacto con vosotros? Si es que sois creyentes...",
                            "verse 57:9": "Él es Quien revela a Su siervo signos claros para sacaros de las tinieblas a la luz. En verdad, Alá es manso, misericordioso con vosotros.",
                            "verse 57:10": "Y ¿por qué no habéis de gastar por la causa de Alá, siendo así que la herencia de los cielos y de la tierra pertenece a Alá? No seréis todos iguales: unos, que han gastado y combatido antes del Éxito, tendrán una categoría más elevada que otros que han gastado y combatido después de ella. A todos, sin embargo, ha prometido Alá lo mejor. Alá está bien informado de lo que hacéis.",
                            "verse 57:11": "A quien haga a Alá un préstamo generoso, Él le devolverá el doble y le recompensará generosamente.",
                            "verse 57:12": "El día que veas la luz de los creyentes y de las creyentes correr ante ellos y a su derecha: «¡Buena nueva hoy para vosotros: jardines por cuyos bajos fluyen arroyos, en los que estaréis por toda la eternidad! ¡Ése es el éxito grandioso!»",
                            "verse 57:13": "El día que los hipócritas y las hipócritas digan a los que creyeron: «¡Esperad a que tomemos de vuestra luz!» Se dirá: «¡Retroceded! ¡Buscad una luz!» Entre ellos se levantará una muralla con una puerta. Dentro estará la Misericordia y fuera, enfrente, el Castigo.",
                            "verse 57:14": "Les llamarán: «¿No estábamos con vosotros?» Dirán: «¡Claro que sí! Pero os dejasteis seducir, os mantuvisteis a la expectativa, dudasteis. Vuestros anhelos os engañaron hasta que vino la orden de Alá. El Engañador os engañó acerca de Alá.",
                            "verse 57:15": "Hoy no se aceptará ningún rescate por parte vuestra ni por parte de los que no creyeron. Vuestra morada será el Fuego, que es vuestro lugar apropiado». ¡Qué mal fin...!",
                            "verse 57:16": "¿No es hora ya de que se humillen los corazones de los creyentes ante la Amonestación de Alá y ante la Verdad revelada y de que no sean como quienes, habiendo recibido antes la Escritura, dejaron pasar tanto tiempo que se endureció su corazón? Muchos de ellos eran unos perversos.",
                            "verse 57:17": "¡Sabed que Alá vivifica la tierra después de muerta. Os hemos explicado las aleyas. Quizás, así, comprendáis.",
                            "verse 57:18": "A quienes den limosna, ellos y ellas, haciendo un préstamo generoso a Alá, les devolverá el doble y les recompensará generosamente.",
                            "verse 57:19": "Los que crean en Alá y en Sus enviados serán los veraces y los testigos ante su Señor. Recibirán su recompensa y su luz. Pero quienes no crean y desmientan Nuestros signos morarán en el fuego de la gehena.",
                            "verse 57:20": "¡Sabed que la vida de acá es juego, distracción y ornato, revalidad en jactancia, afán de más hacienda, de más hijos! Es como un chaparrón: la vegetación resultante alegra a los sembradores, pero luego se marchita y ves que amarillea; luego, se convierte en paja seca. En la otra vida habrá castigo severo o perdón y satisfacción de Alá, mientras que la vida de acá no es más que falaz disfrute.",
                            "verse 57:21": "¡Rivalizad en la obtención del perdón de vuestro Señor y de un Jardín tan vasto como el cielo y la tierra, preparado para los que creen en Alá y en Sus enviados! Ese es el favor de Alá, que da a quien Él quiere. Alá es el Dueño del favor in menso.",
                            "verse 57:22": "No ocurre ninguna desgracia, ni a la tierra ni a vosotros mismos, que no esté en una Escritura antes de que la ocasionemos. Es cosa fácil para Alá.",
                            "verse 57:23": "Para que no desesperéis si no conseguís algo y para que no os regocijéis si lo conseguís. Alá no ama a nadie que sea presumido, jactancioso,",
                            "verse 57:24": "a los avaros que ordenan avaricia a los hombres. Pero quien vuelve la espalda..., Alá es Quien Se basta a Sí mismo, el Digno de Alabanza.",
                            "verse 57:25": "Ya hemos mandado a nuestros enviados con las pruebas claras. Y hemos hecho descender con ellos la Escritura y la Balanza, para que los hombres observen la equidad. Hemos hecho descender el hierro, que encierra una gran fuerza y ventajas para los hombres. A fin de que Alá sepa quiénes les auxilian en secreto, a Él y a Sus enviados. Alá es fuerte poderoso.",
                            "verse 57:26": "Ya hemos enviado a Noé y a Abraham y confiado a su descendencia el profetismo y la Escritura. Entre sus descendientes los hubo bien dirigidos, pero muchos de ellos fueron unos perversos.",
                            "verse 57:27": "Tras ellos, mandamos a Nuestros otros enviados, así como Jesús, hijo de María, a quien dimos el Evangelio. Pusimos en los corazones de quienes le siguieron mansedumbre, misericordia y monacato. Este último fue instaurado por ellos -no se lo prescribimos Nosotros- sólo por deseo de satisfacer a Alá, pero no lo observaron como debían. Remuneramos a quienes de ellos creyeron, pero muchos de ellos fueron unos perversos.",
                            "verse 57:28": "¡Creyentes! ¡Temed a Alá y creed en Su Enviado! Os dará, así, participación doble en Su misericordia, os pondrá una Luz que ilumine vuestra marcha y os perdonará. Alá es indulgente, misericordioso.",
                            "verse 57:29": "¡Que la gente de la Escritura sepa que no puede disponer nada del favor de Alá, que el favor está en la mano de Alá, que da a quien Él quiere! ¡Alá es el Dueño del favor inmenso!"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "வானங்களிலும், பூமியிலும் உள்ளயாவும் அல்லாஹ்வுக்கே தஸ்பீஹு செய்து (துதி செய்து) கொண்டிருக்கின்றன - அவன் (யாவரையும்) மிகைத்தோன், ஞானம் மிக்கவன்.",
                            "verse 57:2": "வானங்களுடையவும், பூமியுடையவும் ஆட்சி அவனுக்கே உடையது, அவனே உயிர்ப்பிக்கிறான், மரிக்கும் படியும் செய்கிறான் - மேலும் அவன் அனைத்துப் பொருட்களின் மீதும் பேராற்றலுடையவன்.",
                            "verse 57:3": "(யாவற்றுக்கும்) முந்தியவனும் அவனே, பிந்தியவனும் அவனே, பகிரங்கமானவனும் அவனே, அந்தரங்கமானவனும் அவனே, மேலும், அவன் அனைத்துப் பொருள்களையும் நன்கறிந்தவன்.",
                            "verse 57:4": "அவன் தான் வானங்களையும், பூமியையும் ஆறு நாட்களில் படைத்தான், பின்னர் அர்ஷின் மீது அமைந்தான். பூமிக்குள் நுழைவதையும், அதிலிருந்து வெளியாவதையும், வானத்திலிருந்து இறங்குவதையும், அதில் ஏறுவதையும் அவன் நன்கறிகிறான், நீங்கள் எங்கிருந்த போதிலும் அவன் உங்களுடனே இருக்கிறான் - அன்றியும் அல்லாஹ் நீங்கள் செய்வதை உற்று நோக்கியவனாக இருக்கிறான்.",
                            "verse 57:5": "வானங்களுடையவும், பூமியுடையவும் ஆட்சி அவனுக்கே உடையது, அன்றியும் காரியங்கள் அனைத்தும் அல்லாஹ்விடமே மீட்கப்படும்.",
                            "verse 57:6": "அவனே இரவைப் பகலில் புகுத்துகின்றான், இன்னும் பகலை இரவில் புகுத்துகின்றான் - அவன் இதயங்களிலுள்ளவற்றையெல்லாம் நன்கறிந்தவன்.",
                            "verse 57:7": "நீங்கள் அல்லாஹ்வின் மீதும் அவன் தூதர் மீதும் நம்கிக்கை கொள்ளுங்கள்; மேலும், அவன் உங்களை (எந்த சொத்துக்கு) பின் தோன்றல்களாக ஆக்கியுள்ளானோ, அதிலிருந்து (அல்லாஹ்வுக்காகச்) செலவு செய்யுங்கள்; ஏனெனில் உங்களில் எவர்கள் ஈமான் கொண்டு, (அல்லாஹ்வுக்காகச்) செலவும் (தானம்) செய்கிறார்களோ, அவர்களுக்கு (அவனிடம்) பெரியதொரு கூலி இருக்கிறது.",
                            "verse 57:8": "உங்கள் இறைவன் மீது நம்பிக்கை கொள்ள (நம்) தூதர் உங்களை அழைக்கையில் - இன்னும் திட்டமாய் ஏற்கனவே (அவன்) உங்களிடம் உறுதிமானமும் வாங்கியிருக்கும் போது, அல்லாஹ்வின் மீது நீங்கள் ஈமான் கொள்ளாதிருக்க உங்களுக்கு என்ன நேர்ந்தது? நீங்கள் முஃமின்களாக இருப்பீர்களாயின் (இறை போதனைப்படி நடவுங்கள்).",
                            "verse 57:9": "அவன்தான் உங்களை இருள்களிலிருந்து பிரகாசத்தின் பால் வெளிக் கொண்டுவருவதற்காகத் தன் அடியார் மீது தெளிவானவையான வசனங்களை இறக்கி வைக்கின்றான், மேலும், நிச்சயமாக அல்லாஹ் உங்கள் மீது மிக்க கிருபையுடையவன், நிகரற்ற அன்புடையவன்.",
                            "verse 57:10": "அன்றியும் அல்லாஹ்வின் பாதையில் நீங்கள் செலவு செய்யாதிருக்க உங்களுக்கு என்ன நேர்ந்தது? வானங்கள், பூமியிலுள்ளவற்றின் அனந்தர பாத்தியதை அல்லாஹ்வுடையதே! (மக்கா) வெற்றிக்கு முன்னர் செலவு செய்து, போரிட்டவர்களுக்கு உங்களில் நின்றும் (எவரும்) சமமாக மாட்டார், (மக்காவின் வெற்றிக்குப்) பின், செலவு செய்து போரிட்டவர்களைவிட, அவர்கள் பதவியால் மிகவும் மகத்தானவர்கள், எனினும் அல்லாஹ் எல்லோருக்குமே அழகானதையே வாக்களித்திருக்கின்றான். அன்றியும் அல்லாஹ் நீங்கள் செய்பவற்றை நன்கு தெரிந்தவன்.",
                            "verse 57:11": "அல்லாஹ்வுக்கு அழகான கடனாகக் கடன் கொடுப்பவர் யார்? அவருக்கு அவன் அதை இரட்டிப்பாக்குகின்றான், மேலும், அவருக்குக் கண்ணியமான நற்கூலியும் உண்டு.",
                            "verse 57:12": "முஃமின்களான ஆண்களையும் முஃமின்களான பெண்களையும் நீர் பார்க்கும் நாளில் அவர்களுடைய பிரகாசம் அவர்களுக்கு முன்னாலும், அவர்களுக்கு வலப்புறத்திலும் விரைந்து கொண்டிருக்கும், (அப்போது அவர்களை நோக்கி:) \"இன்று உங்களுக்கு நன்மாராயமாவது சுவர்க்கத்துச் சோலைகளாகும், அவற்றின் கீழே ஆறுகள் ஓடிக் கொண்டிருக்கும், அவற்றில் என்றென்றும் தங்கியிருங்கள் - இது தான் மகத்தான வெற்றியாகும்\" (என்று கூறப்படும்).",
                            "verse 57:13": "முனாஃபிக்கான ஆண்களும், முனாஃபிக்கான பெண்களும் ஈமான் கொண்டவர்களை நோக்கி: \"எங்களை கவனியுங்கள், உங்கள் ஒளியிலிருந்து நாங்களும் பற்ற வைத்துக் கொள்கிறோம்\" என்று கூறும் தினத்தை (நினைவூட்டுவீராக); அவர்களுக்குக் கூறப்படும், \"உங்களுக்குப் பின்னால், திரும்பிச் சென்று பின்னர் ஒளியைத் தேடிக் கொள்ளுங்கள்.\" பிறகு, அவர்களுக்கிடையே ஒரு சுவர் எழுப்பப்படும்! அதற்கு ஒரு வாயில் இருக்கும், அதன் உட்புறம் (இறை) ரஹ்மத் இருக்கும், ஆனால் அதன் வெளிப்புறத்தில் - (எல்லாத்) திசையிலும் வேதனையிருக்கும்.",
                            "verse 57:14": "இவர்கள் (முஃமின்களைப் பார்த்து) நாங்கள் உங்களுடன் இருக்கவில்லையா?\" என்று (அந்த முனாஃபிக்குகள்) சப்தமிட்டுக் கூறுவார்கள், \"மெய்தான், எனினும் நீங்களே உங்களைச் சோதனையிலாழ்த்தி விட்டீர்கள், (எங்கள் அழிவை) நீங்கள் எதிர் பார்த்தீர்கள், (இந்நாளைப் பற்றியும்) சந்தேகமும் கொண்டிருந்தீர்கள்; அல்லாஹ்வின் கட்டளை வரும் வரையில் (உங்களுடைய வீண் ஆசைகள் உங்களை மயக்கி விட்டன, அன்றியும் மயக்குபவ(னான ஷைத்தா)ன், அல்லாஹ்வைப் பற்றி உங்களை மயக்கியும் விட்டான்\" என்றும் (முஃமின்கள்) கூறுவார்கள்.",
                            "verse 57:15": "\"ஆகவே, இன்னும் உங்களிடமிருந்தோ நிராகரித்தவர்களிடமிருந்தோ (உங்களுக்குரிய வேதனைக்குப் பதிலாக) எந்த வகையான நஷ்ட ஈடும் வாங்கப்பட மாட்டாது, உங்களுடைய தங்குமிடம் நரகம் தான், அதுதான் உங்களுக்குத் துணை - அதுவோ சென்றடையும் இடங்களிலெல்லாம் மிகக் கெட்டதாகும்\" (என்றுங் கூறப்படும்).",
                            "verse 57:16": "ஈமான் கொண்டார்களே அவர்களுக்கு, அவர்களுடைய இருதயங்கள் அல்லாஹ்வையும், இறங்கியுள்ள உண்மையான (வேதத்)தையும் நினைத்தால், அஞ்சி நடுங்கும் நேரம் வரவில்லையா? மேலும், அவர்கள் - முன்னால் வேதம் கொடுக்கப்பட்டவர்களைப் போல் ஆகிவிட வேண்டாம், (ஏனெனில்) அவர்கள் மீது நீண்ட காலம் சென்ற பின் அவர்களுடைய இருதயங்கள் கடினமாகி விட்டன அன்றியும், அவர்களில் பெரும்பாலோர் ஃபாஸிக்குகளாக - பாவிகளாக ஆகிவிட்டனர்.",
                            "verse 57:17": "அறிந்து கொள்ளுங்கள்: நிச்சயமாக அல்லாஹ் பூமியை அதன் இறப்பிற்குப்பின், உயிர்ப்பிக்கிறான்: நீங்கள் விளங்கிக் கொள்வதற்காக நாம் இவ்வசனங்களை உங்களுக்கு தெளிவாக விவரிக்கிறோம்.",
                            "verse 57:18": "நிச்சயமாக தானதர்மம் செய்யும் ஆண்களும், பெண்களும், இன்னும் அல்லாஹ்வுக்கு அழகான கடனாகக் கடன் கொடுத்தார்களே அவர்களும் - அவர்களுக்கு (அதன் பலன்) இரு மடங்காக்கப்படும் -(அன்றியும்) அவர்களுக்கு (அல்லாஹ்விடம்) கண்ணியமான நற்கூலியும் இருக்கிறது.",
                            "verse 57:19": "மேலும், எவர்கள் அல்லாஹ்வின் மீதும் அவனுடைய தூதர்கள் மீதும் நம்பிக்கை கொள்கிறார்களோ, அவர்கள் தாம் தங்கள் இறைவன் முன் உண்மையாளர்களாகவும், உயிர் தியாகிகளாகவும் இருப்பார்கள், அவர்களுக்கு அவர்களுடைய நற்கூலியும், (நேர்வழி காட்டும்) போரொளியும் உண்டு, எவர்கள் நிராகரித்துக் கொண்டும், நம் வசனங்களைப் பொய்யாக்கிக் கொண்டும் இருக்கிறார்களோ அவர்கள் நரக வாசிகள்தான்.",
                            "verse 57:20": "அறிந்து கொள்ளுங்கள்: \"நிச்சயமாக இவ்வுலக வாழ்க்கை விளையாட்டும், வேடிக்கையும், அலங்காரமுமேயாகும், மேலும் (அது) உங்களிடையே பெருமையடித்துக் கொள்வதும், பொருள்களையும், சந்ததிகளையும் பெருக்குவதுமேயாகும், (இது) மழையின் உதாரணத்துக்கு ஒப்பாகும், (அதாவது:) அது முளைப்பிக்கும் பயிர் விவசாயிகளை ஆனந்தப் படுத்துகிறது, ஆனால், சீக்கரமே அது உலர்ந்து மஞ்சள் நிறம் ஆவதை நீர் காண்கிறீர்; பின்னர் அது கூளமாகி விடகிறது, (உலக வாழ்வும் இத்தகையதே, எனவே உலக வாழ்வில் மயங்கியோருக்கு) மறுமையில் கடுமையன வேதனையுண்டு; (முஃமின்களுக்கு) அல்லாஹ்வின் மன்னிப்பும், அவன் பொருத்தமும் உண்டு - ஆகவே, இவ்வுலக வாழ்க்கை ஏமாற்றும் சொற்ப சுகமே தவிர (வேறு) இல்லை.",
                            "verse 57:21": "உங்கள் இறைவனின் மன்னிப்பிற்கும் சுவர்க்கத்திற்கும் நீங்கள் முந்துங்கள், அச்சுவர்க்கத்தின் பரப்பு, வானத்தினுடையவும், பூமியினுடையவும் பரப்பைப் போன்றதாகும், எவர்கள் அல்லாஹ்வின் மீதும், அவன் தூதர் மீதும் ஈமான் கொள்கிறார்களோ, அவர்களுக்கு அது சித்தம் செய்து வைக்கப்பட்டிருக்கிறது. அது அல்லாஹ்வுடைய கிருபையாகும் - அதனை அவன் நாடியவருக்கு அளிக்கின்றான். இன்னும், அல்லாஹ் மகத்தான கிருபையுடையவன்.",
                            "verse 57:22": "பூமியிலோ, அல்லது உங்களிலோ சம்பவிக்கிற எந்தச் சம்பவமும் - அதனை நாம் உண்டாக்குவதற்கு முன்னரே (லவ்ஹுல் மஹ்ஃபூள்) ஏட்டில் இல்லாமலில்லை, நிச்சயமாக அது அல்லாஹ்வுக்கு மிக எளிதானதேயாகும்.",
                            "verse 57:23": "உங்களை விட்டுத் தவறிப்போன ஒன்றின் மீது நீங்கள் துக்கப்படாமல் இருக்கவும், அவன் உங்களுக்கு அளித்தவற்றின் மீது நீங்கள் (அதிகம்) மகிழாதிருக்கவும் (இதனை உங்களுக்கு அல்லாஹ் அறிவிக்கிறான்); கர்வமுடையவர்கள், தற்பெருமை உடையவர்கள் எவரையும் அல்லாஹ் நேசிப்பதில்லை.",
                            "verse 57:24": "நிச்சயமாக அல்லாஹ் (எவரிடமும்) தேவையற்றவன். புகழ் மிக்கவன்.",
                            "verse 57:25": "நிச்சயமாக நம் தூதர்களைத் தெளிவான அத்தாட்சிகளுடன் அனுப்பினோம், அன்றியும், மனிதர்கள் நீதியுடன் நிலைப்பதற்காக, அவர்களுடன் வேதத்தையும் (நீதத்தின்) துலாக்கோலையும் இறக்கினோம், இன்னும், இரும்பையும் படைத்தோம், அதில் கடும் அபாயமுமிருக்கிறது, எனினும் (அதில்) மனிதர்களுக்குப் பல பயன்களும் இருக்கின்றன - (இவற்றின் மூலமாகத்) தனக்கும், தன்னுடைய தூதருக்கும் மறைமுகமாகவும் உதவி செய்பவர் எவர் என்பதையும் (சோதித்) அறிந்து கொள்வதற்காக அல்லாஹ் (இவ்வாறு அருள்கிறான்); நிச்சயமாக அல்லாஹ் பலம் மிக்கவன், (யாவரையும்) மிகைத்தவன்.",
                            "verse 57:26": "அன்றியும், திடமாக நாமே நூஹையும், இப்ராஹீமையும் (தூதர்களாக) அனுப்பினோம், இன்னும், அவ்விருவரின் சந்ததியில் நுபவ்வத்தை (நபித்துவத்தை)யும் வேதத்தையும் ஏற்படுத்தினோம், (அவர்களில்) நேர்வழி பெற்றவர்களும் உண்டு, எனினும் அவர்களில் பெரும்பாலோர் ஃபாஸிக்குகளாக - பாவிகளாக இருந்தனர்.",
                            "verse 57:27": "பின்னர் அவர்களுடைய (அடிச்) சுவடுகளின் மீது (மற்றைய) நம் தூதர்களைத் தொடரச் செய்தோம், மர்யமின் குமாரர் ஈஸாவை (அவர்களை)த் தொடரச் செய்து, அவருக்கு இன்ஜீலையும் கொடுத்தோம் - அன்றியும், அவரைப் பின்பற்றியவர்களின் இதயங்களில் இரக்கத்தையும் கிருபையையும் உண்டாக்கினோம், ஆனால் அவர்கள் தாங்களே புதிதாக உண்டாக்கிக் கொண்ட துறவித்தனத்தை நாம் அவர்கள் மீது விதிக்க வில்லை. அல்லாஹ்வின் திருப்பொருத்தத்தை அடைய வேண்டியேயன்றி (அவர்களே அதனை உண்டுபண்ணிக் கொண்டார்கள்); ஆனால் அதைப் பேணுகிற அளவுக்கு அவர்கள் அதைச் சரிவரப் பேணவில்லை அப்பால், அவர்களில் ஈமான் கொண்டவர்களுக்கு அவர்களுடைய (நற்)கூலியை நாம் வழங்கினோம்; எனினும், அவர்களில் பெரும் பாலோர் ஃபாஸிக்குகளாக - பாவிகளாகவே இருக்கின்றனர்.",
                            "verse 57:28": "ஈமான் கொண்டவர்களே! நீங்கள் அல்லாஹ்வுக்கு அஞ்சி, அவனுடைய (இறுதித்) தூதர் மீதும் ஈமான் கொள்ளுங்கள்; அவன்தன் கிருபையிலிருந்து இரு மடங்கை உங்களுக்கு வழங்கி, ஓர் ஒளியையும் உங்களுக்கு அருள்வான், அதைக் கொண்டு நீங்கள் (நேர்வழி) நடப்பீர்கள், இன்னும், உங்களுக்காக (உங்கள் குற்றங்களையும்) அவன் மன்னிப்பான் - அல்லாஹ் மிகவும் மன்னிப்பவன், மிக்க கிருபை உடையவன்.",
                            "verse 57:29": "அல்லாஹ்வுடைய அருள் கொடையிலிருந்து யாதொன்றையும் பெறத் தாங்கள் சக்தியுடையவர்களல்லர் என்று வேதத்தை உடையவர்கள் எண்ணிக் கொள்ளாதிருக்கும் பொருட்டே (இவற்றை அவன் உங்களுக்கு அறிவிக்கின்றான்) அன்றியும் அருள் கொடையெல்லாம் நிச்சயமாக அல்லாஹ்வின் கையிலேயே இருக்கின்றது, தான் விரும்பியவர்களுக்கு அதனை அவன் அளிக்கின்றான் - அல்லாஹ்வே மகத்தான கிருபையுடையவன்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "สิ่งที่อยู่ในชั้นฟ้าทั้งหลายและในแผ่นดินต่างแซ่ซ้องสดุดีแด่อัลลอฮ์ และพระองค์เป็นผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ",
                            "verse 57:2": "อำนาจอันเด็ดขาดแห่งชั้นฟ้าทั้งหลายและแผ่นดินนั้นเป็นสิทธิ์ของพระองค์ พระองค์ทรงให้เป็นและทรงให้ตาย และพระองค์เป็นผู้ทรงอานุภาพเหนือทุกสิ่ง",
                            "verse 57:3": "พระองค์ทรงเป็นองค์แรกและองค์สุดท้าย และทรงเปิดเผยและทรงเร้นลับ และพระองค์เป็นผู้ทรงรอบรู้ทุกสิ่งทุกอย่าง",
                            "verse 57:4": "พระองค์คือ พระผู้ทรงสร้างชั้นฟ้าทั้งหลายและแผ่นดินในระยะ 6 วัน แล้วพระองค์ทรงสถิตอยู่บนบัลลังก์ พระองค์ทรงรอบรู้สิ่งที่เข้าไปในแผ่นดินและสิ่งที่ออกมาจากแผ่นดิน และสิ่งที่ลงมาจากฟากฟ้าและสิ่งที่ขึ้นไปสู่ฟากฟ้า และพระองค์ทรงอยู่กับพวกเจ้าไม่ว่าพวกเจ้าจะอยู่ ณ แห่งหนใด และอัลลอฮ์ทรงเห็นสิ่งที่พวกเจ้ากระทำ",
                            "verse 57:5": "อำนาจอันเด็ดขาดแห่งชั้นฟ้าทั้งหลายและแผ่นดินนั้นเป็นสิทธิ์ของพระองค์ และการงานทั้งหลายถูกให้กลับไปยังอัลลอฮ์เท่านั้น",
                            "verse 57:6": "พระองค์ทรงให้กลางคืนคาบเกี่ยวเข้าไปในกลางวัน และทรงให้กลางวันคาบเกี่ยวเข้าไปในกลางคืน และพระองค์เป็นผู้ทรงรอบรู้สิ่งที่อยู่ในทรวงอก",
                            "verse 57:7": "พระเจ้าจงศรัทธาต่ออัลลอฮ์และร่อซู้ลของพระองค์ และจงบริจาคในทางของอัลลอฮ์ จากสิ่งที่พระองค์ทรงทำให้พวกเจ้าเป็นตัวแทนของมัน ดังนั้น บรรดาผู้ศรัทธาและบรรดาผู้บริจาคในหมู่พวกเจ้านั้น สำหรับพวกเขาจะได้รับรางวัลอันยิ่งใหญ่",
                            "verse 57:8": "และไฉนเล่าพวกเจ้าจึงไม่ศรัทธาต่ออัลลอฮ์ ทั้ง ๆ ที่ร่อซู้ลได้เรียกร้องพวกเจ้าให้ศรัทธาต่อพระเจ้าของพวกเจ้า และแน่นอนพระองค์ได้ทรงเอาสัญญากับพวกเจ้าแล้ว หากพวกเจ้าเป็นผู้ศรัทธา",
                            "verse 57:9": "พระองค์เป็นผู้ทรงประทานบรรดาอัลอายาตอันชัดแจ้งลงมาแก่ (มุฮัมมัด) บ่าวของพระองค์ เพื่อทรงนำพวกเจ้าออกจากความมืดทั้งหลายสู่ความสว่าง และแท้จริงอัลลอฮ์นั้นเป็นผู้ทรงเอ็นดู ผู้ทรงเมตตาเสมอต่อพวกเจ้า",
                            "verse 57:10": "และไฉนเล่าพวกเจ้าจึงไม่บริจาคในทางของอัลลอฮ์ ทั้ง ๆ ที่มรดกแห่งชั้นฟ้าทั้งหลายและแผ่นดินนี้เป็นของอัลลอฮ์ ในหมู่พวกเจ้านั้นมีผู้บริจาคและได้ต่อสู้ (ในทางของอัลลอฮ์) ก่อนการพิชิต (นครมักกะฮ์) ชนเหล่านั้นย่อมมีฐานะสูงกว่าบรรดาผู้บริจาคและต่อสู้ (ในทางของอัลลอฮ์) หลังการพิชิต (นครมักกะฮ์) และอัลลอฮ์ทรงสัญญาความดีงาม (สวนสวรรค์) แก่ทั้งสองฝ่าย และอัลลอฮ์นั้นทรงรอบรู้อย่างละเอียดในสิ่งที่พวกเจ้ากระทำ",
                            "verse 57:11": "ใครคือผู้ที่จะให้อัลลอฮ์ยืม (บริจาคในทางของอัลลอฮ์) ด้วยการยืมที่ดี แล้วพระองค์ก็จะทรงเพิ่มพูนผลบุญแก่เขา และเขาจะได้รับรางวัลอันมีเกียรติ (สวนสวรรค์)",
                            "verse 57:12": "วันที่เจ้าจะเห็นบรรดาผู้ศรัทธาชายและบรรดาผู้ศรัทธาหญิง แสงสว่างของพวกเขาจะฉายแสง ณ เบื้องหน้าของพวกเขา และทางเบื้องขวาของพวกเขา (จะมีเสียงกล่าวว่า) วันนี้มีข่าวดีแก่พวกเจ้า คือสวนสวรรค์หลากหลายมีแม่น้ำหลายสายไหลผ่าน ณ เบื้องของมัน โดยพำนักอยู่ในนั้นตลอดกาล นั่นคือชัยชนะอันยิ่งใหญ่",
                            "verse 57:13": "วันที่พวกมุนาฟิกีนชายและพวกมุนาฟิกีนหญิงจะกล่าวแก่บรรดาผู้ศรัทธาว่า จงมองมายังเราเถิด เพื่อเราจะได้รับแสงสว่างของพวกท่านด้วย จะมีเสียงกล่าวว่า จงหันหลังกลับไปทางข้างหลังของพวกเจ้าเพื่อแสวงหาเอาเอง (ขณะนั้น) ก็จะมีกำแพงที่มีประตูบานหนึ่งมาขวางกั้นระหว่างพวกเขา ด้านในของมันนั้นมีความเมตตา และด้านนอกของมัน (ของพวกมุนาฟิกีน) มีการลงโทษ",
                            "verse 57:14": "พวกเขา (พวกมุนาฟิกีน) จะร้องเรียกเขาทั้งหลาย (บรรดามุอฺมิน) ว่า พวกเรามิได้เคยอยู่ร่วมกับพวกท่านดอกหรือ? เขาทั้งหลายกล่าวว่า แน่นอน แต่พวกท่านได้ทำลายตัวของพวกท่านด้วยการกลับกลอกและพวกท่านคอยสิ่งที่เกิดขึ้น (แก่บรรดามุอฺมินีน) และพวกท่านสงสัย (ในเรื่องของศาสนา) และความหวังที่เลื่อนลอยได้หลอกลวงพวกท่าน จนกระทั่งพระบัญชาของอัลลอฮ์ได้มีมา และมัน (ชัยฏอน) ได้ล่อลวงพวกเจ้าเกี่ยวกับอัลลอฮ์",
                            "verse 57:15": "ดังนั้น วันนี้การไถ่บาปจะไม่ถูกรับจากพวกเจ้า และจากบรรดาผู้ปฏิเสธศรัทธา ที่พำนักของพวกเจ้าคือไฟนรก มันเป็นสถานที่อันเหมาะสมแก่พวกเจ้า และมันเป็นทางกลับที่ชั่วร้ายยิ่ง",
                            "verse 57:16": "ยังไม่ถึงเวลาอีกหรือสำหรับบรรดาผู้ศรัทธาที่หัวใจของพวกเขาจะนอบน้อมต่อการรำลึกถึงอัลลอฮ์ และสิ่งซึ่งได้มีลงมาคือความจริง และพวกเขาอย่าได้เป็นเช่นบรรดาผู้ที่ได้รับคัมภีร์มาแต่ก่อนนี้ แล้วช่วงเวลาได้เนิ่นนานเกินไปแก่พวกเขา ดังนั้น จิตใจของพวกเขาจึงแข็งกระด้าง และส่วนมากของพวกเขาจึงเป็นผู้ฝ่าฝืน",
                            "verse 57:17": "พึ่งทรงเถิดว่า แท้จริงอัลลอฮ์นั้น ทรงให้แผ่นดินมีชีวิตชีวาหลังจากการแห้งแล้งของมัน แน่นอนเราได้ทำให้สัญญาณทั้งหลายแจ่มแจ้งแก่พวกเจ้าแล้ว เพื่อพวกเจ้าจะได้ใช้สติปัญญาใคร่ครวญ",
                            "verse 57:18": "แท้จริงบรรดาผู้บริจาคชายและบรรดาผู้บริจาคหญิง และพวกเขาได้ให้อัลลอฮ์ยืม (บริจาคในหนทางของอัลลอฮ์) ด้วยการยืมที่ดี จะมีเพิ่ม (ผลบุญ) แก่พวกเขาและสำหรับพวกเขาจะได้รับรางวัลอันมีเกียรติ",
                            "verse 57:19": "และบรรดาผู้ศรัทธาต่ออัลลอฮ์และบรรดาร่อซู้ลของพระองค์ ชนเหล่านั้นพวกเขาเป็นผู้สัตย์จริง และเป็นผู้เสียสละชีวิต ณ ที่พระเจ้าของพวกเขา สำหรับพวกเขาจะได้รับรางวัลของพวกเขาและแสงสว่างของพวกเขา ส่วนบรรดาผู้ปฏิเสธศรัทธาและปฏิเสธสัญญาณต่าง ๆ ของเรา ชนเหล่านั้นเป็นชาวนรก",
                            "verse 57:20": "พึงทราบเถิดว่า แท้จริงการมีชีวิตอยู่ในโลกนี้มิใช่อื่นใด เว้นแต่เป็นการละเล่นและการสนุกสนานร่างเริง และเครื่องประดับ และความโอ้อวดระหว่างพวกเจ้า และการแข่งขันกันสะสมในทรัพย์สินและลูกหลาน เปรียบเสมือนเช่นน้ำฝนที่การงอกเงยพืชผลยังความพอใจให้แก่กสิกร แล้วมันก็เหี่ยวแห้ง เจ้าจะเห็นมันเป็นสีเหลืองแล้วมันก็กลายเป็นเศษเป็นชิ้นแห้ง ส่วนในวันปรโลกนั้นมีการลงโทษอย่างสาหัส และมีการอภัยโทษและความโปรดปรานจากอัลลอฮ์ และการมีชีวิตอยู่ในโลกนี้มิใช่อื่นใดนอกจากการแสวงหาผลประโยชน์แห่งการหลอกลวงเท่านั้น",
                            "verse 57:21": "จงเร่งรีบไปสู่การขออภัยโทษจากพระเจ้าของพวกเจ้า และสวนสวรรค์ซึ่งความกว้างของมันประหนึ่งความกว้างของชั้นฟ้าและแผ่นดิน (ซึ่งสวรรค์นั้น) ถูกเตรียมไว้สำหรับบรรดาผู้ศรัทธาต่ออัลลอฮ์และบรรดาร่อซู้ลของพระองค์ นั่นคือความโปรดปรานของอัลลอฮ์ ซึ่งพระองค์จะทรงประทานมันให้แก่ผู้ที่พระองค์ทรงประสงค์ และอัลลอฮ์นั้นทรงเป็นผู้โปรดปรานอันใหญ่หลวง",
                            "verse 57:22": "ไม่มีเคราะห์กรรมอันใดเกิดขึ้นในแผ่นดินนี้ และไม่มีแม้แต่ในตัวของพวกเจ้าเอง เว้นแต่ได้มีไว้ในบันทึกก่อนที่เราจะบังเกิดมันขึ้นมา แท้จริงนั่นมันเป็นการง่ายสำหรับอัลลอฮ์",
                            "verse 57:23": "เพื่อพวกเจ้าจะได้ไม่ต้องเสียใจต่อสิ่งที่ได้สูญเสียไปจากพวกเจ้า และไม่ดีใจต่อสิ่งที่พระองค์ทรงประทานแก่พวกเจ้า และอัลลอฮ์มิทรงชอบทุกผู้หยิ่งจองหอง และผู้คุยโวโอ้อวด",
                            "verse 57:24": "คือบรรดาผู้ที่ตระหนี่และสั่งสอนคนอื่นให้ตระหนี่ และผู้ที่ผินหลังให้ แท้จริงอัลลอฮ์นั้นพระองค์ทรงพอเพียงและทรงได้รับการสรรเสริญอย่างแน่นอน",
                            "verse 57:25": "โดยแน่นอน เราได้ส่งบรรดาร่อซู้ลของเราพร้อมด้วยหลักฐานทั้งหลายอันชัดแจ้ง และเราได้ประทานคัมภีร์และความยุติธรรมลงมาพร้อมกับพวกเขา เพื่อมนุษย์จะได้ดำรงอยู่บนความเที่ยงธรรม และเราได้ให้มีเหล็กขึ้นมา เพราะในนั้นมีความแข็งแกร่งมาก และมีประโยชน์มากหมายสำหรับมนุษย์ และเพื่ออัลลอฮ์จะได้ทรงรู้ถึงผู้ที่ช่วยเหลือพระองค์ และบรรดาร่อซู้ลของพระองค์ (มีความเชื่อมั่น) โดยทางลับ (ต่อพระองค์) แท้จริงอัลลอฮ์นั้นเป็นทรงพลัง ผู้ทรงอำนาจ",
                            "verse 57:26": "(ขอสาบานด้วยพระนามของอัลลอฮ์) โดยแน่นอนเราได้ส่งนูห์และอิบรอฮีม และเราได้ทำให้ลูกหลานของเขาทั้งสองเป็นนบี และเราได้ประทานคัมภีร์ (อัตเตารอฮ์ อัซซะบูร อัลอินญีล และอัลกุรอาน) ดังนั้น บางคนในหมู่พวกเขาก็เป็นผู้อยู่ในแนวทางที่ถูกต้อง และส่วนมากในหมู่พวกเขาก็เป็นผู้ฝ่าฝืนหลงทาง",
                            "verse 57:27": "แล้วเราก็ได้ส่งบรรดาร่อซู้ลของเราติดตามร่องรอยของพวกเขา และเราได้ส่งอีซา อิบน มัรยัมตามมา และเราได้ประทานอินญีลให้แก่เขา และเราได้บันดาลความสงสารและความเมตตาให้เกิดขึ้นในจิตใจของบรรดาผู้ที่เชื่อฟังปฏิบัติตามเขา ส่วนการถือสันโดษนั้น เรามิได้บัญญัติมันขึ้นมาแก่พวกเขา (เว้นแต่) พวกเขาประดิษฐ์มันขึ้นมา เพื่อแสวงหาความโปรดปรานของอัลลอฮ์ แต่พวกเขามิได้เอาใจใส่เท่าที่ควรจะกระทำมัน กระนั้นก็ดี เราก็ได้ประทานรางวัลของพวกเขาแก่บรรดาผู้ศรัทธาในหมู่พวกเขา แต่ส่วนมากของพวกเขาเป็นผู้ฝ่าฝืน",
                            "verse 57:28": "โอ้บรรดาผู้ศรัทธาเอ๋ย จงยำเกรงต่ออัลลอฮ์และจงศรัทธาต่อร่อซู้ลของพระองค์เถิด พระองค์จะทรงประทานความเมตตาของพระองค์ให้แก่พวกเจ้าสองเท่า และจะทรงให้มีแสงสว่างแก่พวกเจ้า เพื่อพวกเจ้าจะได้ดำเนินชีวิตด้วยมัน และจะทรงอภัยโทษให้แก่พวกเจ้า และอัลลอฮ์นั้นเป็นผู้ทรงอภัย ผู้ทรงเมตตาเสมอ",
                            "verse 57:29": "ทั้งนี้เพื่อให้อะฮ์ลุลกิตาบจะได้รู้ว่า พวกเขาไม่มีอำนาจเหนือสิ่งใดในความโปรดปรานของอัลลอฮ์ และแท้จริงความโปรดปรานนั้นอยู่ในเงื้อมพระหัตถ์ของอัลลอฮ์ ซึ่งพระองค์จะทรงประทานความโปรดปรานนั้นแก่ผู้ที่พระองค์ทรงประสงค์ และอัลลอฮ์เป็นผู้ทรงโปรดปรานอันใหญ่หลวง"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Göklerde ve yerde bulunan her şey Allah'ı tesbih etmektedir. O, azîzdir, hakîmdir.",
                            "verse 57:2": "Göklerin ve yerin mülkü O'nundur. O, diriltir, öldürür. O, her şeye gücü yetendir.",
                            "verse 57:3": "O ilktir, sondur, zahirdir, batındır. O, her şeyi bilendir.",
                            "verse 57:4": "O, gökleri ve yeri altı günde yaratan, sonra Arş'ın üzerine istivâ edendir. Yere gireni ve ondan çıkanı, gökten ineni ve oraya yükseleni bilir. Nerede olsanız, O sizinle beraberdir. Allah yaptıklarınızı görür.",
                            "verse 57:5": "Göklerin ve yerin mülkü O'nundur. Bütün işler ancak O'na döndürülür.",
                            "verse 57:6": "Geceyi gündüze katar, gündüzü de geceye katar. O, kalplerde olanı bilir.",
                            "verse 57:7": "Allah'a ve Resûlü'ne iman edin. Sizi, üzerinde tasarrufa yetkili kıldığı şeylerden harcayın. Sizden iman edip de (Allah rızası için) harcayan kimselere büyük mükâfat vardır.",
                            "verse 57:8": "Peygamber sizi, Rabbinize iman etmeye çağırdığı halde niçin Allah'a inanmıyorsunuz? Halbuki O, sizden kesin söz de almıştı. Eğer inanırsanız.",
                            "verse 57:9": "Sizi karanlıklardan aydınlığa çıkarmak için kuluna apaçık âyetler indiren O'dur. Şüphesiz Allah, size karşı çok şefkatli, çok merhametlidir.",
                            "verse 57:10": "Ne oluyor size ki, Allah yolunda harcamıyorsunuz? Halbuki göklerin ve yerin mirası Allah'ındır. Elbette içinizden, fetihten önce harcayan ve savaşanlar, daha sonra harcayıp savaşanlara eşit değildir. Onların derecesi, sonradan infak eden ve savaşanlardan daha yüksektir. Bununla beraber Allah hepsine de en güzel olanı vâdetmiştir. Allah'ın yaptıklarınızdan haberi vardır.",
                            "verse 57:11": "Kim Allah'a güzel bir ödünç verecek olursa, Allah da onun karşılığını kat kat verir ve ayrıca onun çok değerli bir mükâfatı da vardır.",
                            "verse 57:12": "Mümin erkeklerle mümin kadınları, önlerinden ve sağlarından, (amellerinin) nurları aydınlatıp giderken gördüğün günde, (onlara): Bugün müjdeniz, zemininden ırmaklar akan ve içlerinde ebedî kalacağınız cennetlerdir, denilir. İşte büyük kurtuluş budur.",
                            "verse 57:13": "Münafık erkeklerle münafık kadınların, müminlere: Bizi bekleyin, nurunuzdan bir parça ışık alalım, diyeceği günde kendilerine: Arkanıza dönün de bir ışık arayın! denilir. Nihayet onların arasına, içinde rahmet, dışında azap bulunan kapılı bir sur çekilir.",
                            "verse 57:14": "Münafıklar onlara: Biz sizinle beraber değil miydik? diye seslenirler. (Müminler de) derler ki: Evet ama, siz kendi başınızı belaya soktunuz; fırsat beklediniz; şüpheye düştünüz ve kuruntular sizi aldattı. O çok aldatan (şeytan) sizi, Allah hakkında bile aldattı. Nihayet Allah'ın emri gelip çattı!",
                            "verse 57:15": "Bugün artık ne sizden ne de inkâr edenlerden bedel kabul edilir, varacağınız yer ateştir. Size yaraşan odur. Ne kötü bir dönüş yeridir!",
                            "verse 57:16": "İman edenlerin Allah'ı anma ve O'ndan inen Kur'an sebebiyle kalplerinin ürpermesi zamanı daha gelmedi mi? Onlar daha önce kendilerine kitap verilenler gibi olmasınlar. Onların üzerinden uzun zaman geçti de kalpleri katılaştı. Onlardan bir çoğu yoldan çıkmış kimselerdir.",
                            "verse 57:17": "Bilin ki Allah, ölümünden sonra yeryüzünü canlandırıyor. Düşünesiniz diye gerçekten, size âyetleri açıkladık.",
                            "verse 57:18": "Sadaka veren erkeklere ve sadaka veren kadınlara ve Allah'a güzel bir ödünç verenlere, verdiklerinin karşılığı kat kat ödenir ve onlara değerli bir mükâfat vardır.",
                            "verse 57:19": "Allah'a ve peygamberlerine iman edenler, (evet) işte onlar, Rableri yanında sözü özü doğru olanlar ve şehitlik mertebesine erenlerdir. Onların mükâfatları ve nûrları vardır. İnkâr edip de âyetlerimizi yalanlayanlara gelince, onlar da cehennemin adamlarıdır.",
                            "verse 57:20": "Bilin ki dünya hayatı ancak bir oyun, eğlence, bir süs, aranızda bir övünme ve daha çok mal ve evlât sahibi olma isteğinden ibarettir. Tıpkı bir yağmur gibidir ki, bitirdiği ziraatçilerin hoşuna gider. Sonra kurur da sen onun sapsarı olduğunu görürsün; sonra da çer çöp olur. Ahirette ise çetin bir azap vardır. Yine orada Allah'ın mağfireti ve rızası vardır. Dünya hayatı aldatıcı bir geçimlikten başka bir şey değildir.",
                            "verse 57:21": "Rabbinizden bir mağfirete; Allah'a ve peygamberlerine inananlar için hazırlanmış olup genişliği gökle yerin genişliği kadar olan cennete koşuşun. İşte bu, Allah'ın lütfudur ki onu dilediğine verir. Allah büyük lütuf sahibidir.",
                            "verse 57:22": "Yeryüzünde vuku bulan ve sizin başınıza gelen herhangi bir musibet yoktur ki, biz onu yaratmadan önce, bir kitapta yazılmış olmasın. Şüphesiz bu, Allah'a göre kolaydır.",
                            "verse 57:23": "(Allah bunu) elinizden çıkana üzülmeyesiniz ve Allah'ın size verdiği nimetlerle şımarmayasınız diye açıklamaktadır. Çünkü Allah, kendini beğenip böbürlenen kimseleri sevmez.",
                            "verse 57:24": "Onlar cimrilik edip insanlara da cimriliği emrederler. Kim yüz çevirirse şüphesiz ki Allah zengindir, hamde lâyıktır.",
                            "verse 57:25": "Andolsun biz peygamberlerimizi açık delillerle gönderdik ve insanların adaleti yerine getirmeleri için beraberlerinde kitabı ve mizanı indirdik. Biz demiri de indirdik ki onda büyük bir kuvvet ve insanlar için faydalar vardır. Bu, Allah'ın, dinine ve peygamberlerine gayba inanarak yardım edenleri belirlemesi içindir. Şüphesiz Allah kuvvetlidir, daima üstündür.",
                            "verse 57:26": "Andolsun ki biz, Nuh'u ve İbrahim'i gönderdik, peygamberliği de kitabı da onların soyuna verdik. Onlardan (insanlardan) kimi doğru yoldadır; içlerinden birçoğu da yoldan çıkmışlardır.",
                            "verse 57:27": "Sonra bunların izinden ardarda peygamberlerimizi gönderdik. Meryem oğlu İsa'yı da arkalarından gönderdik, ona İncil'i verdik; ona uyanların kalplerine şefkat ve merhamet vermiştik. Uydurdukları ruhbanlığa gelince, onu biz yazmadık. Fakat kendileri Allah rızasını kazanmak için yaptılar. Ama buna da gereği gibi uymadılar. Biz de onlardan iman edenlere mükâfatlarını verdik. İçlerinden çoğu da yoldan çıkmışlardır.",
                            "verse 57:28": "Ey iman edenler! Allah'tan korkun ve Peygamberine inanın ki O, size rahmetinden iki kat versin ve size ışığında yürüyeceğiniz bir nûr lütfetsin; sizi bağışlasın. Allah, çok bağışlayan, çok esirgeyendir.",
                            "verse 57:29": "Böylece kitap ehli, Allah'ın lütfundan hiçbir şey elde edemeyeceklerini bilsinler. Lütuf bütünüyle Allah'ın elindedir, onu dilediğine bahşeder. Allah, büyük lütuf sahibidir."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 57:1": "Осмонлардаги ва ердаги нарсалар Аллоҳга тасбиҳ айтди. Ва У азиз ва ҳакимдир.",
                            "verse 57:2": "Осмонлару ернинг мулки Уникидир. У тирилтирур ва ўлдирур ва У ҳар бир нарсага қодирдир.",
                            "verse 57:3": "У аввал ва охир, ошкор ва пинҳондир. Ва У ҳар бир нарсани билувчидир. («Аввал»-У барча мавжудотлар йўқлигида бор эди.«Охир»-У ҳамма нарса йўқ бўлиб кетганда ҳам Ўзи қолади. «Ошкор»-Унинг мавжудлиги ошкор, очиқ-ойдиндир. «Зоҳир»-У ҳамма нарсадан-устундир. «Пинҳон»-У кўзга кўринмайди. Ҳаммадан пинҳон - махфий нарсаларни билиб турувчидир.",
                            "verse 57:4": "У осмонлару ерни олти кунда яратиб, сўнгра аршни эгаллаган зотдир. Ерга нима кирганини ҳам, ундан нима чиққанини ҳам, осмондан нима тушганини ҳам унга нима чиққанини ҳам биладир. У қаерда бўлсангиз ҳам сиз билан биргадир. Аллоҳ қилаётган амалларингизни кўриб турувчидир. («Истиво» луғатда кўтарилиш, ўрнашиш ва эгаллаш маъноларини билдиради. Лекин Аллоҳга нисбатан бу маъноларни биз тушунгандай ҳолатда ишлатиб бўлмайди. Шунинг учун, ҳамма нарсани яратгандан сўнг Аллоҳ уларни Ўзининг тасарруфига олди, деб шарҳланади.)",
                            "verse 57:5": "Осмонлару ернинг мулки Уникидир ва барча ишлар Аллоҳнинг Ўзигагина қайтадир.",
                            "verse 57:6": "У кечасини кундузга киритадир, кундузни кечасига киритадир ва У кўксингиздаги нарсани ҳам яхши билувчидир.",
                            "verse 57:7": "Аллоҳга ва Унинг Расулига иймон келтиринглар ҳамда сизларни халифа қилиб қўйган нарсалардан эҳсон қилинглар. Бас, сизлардан иймон келтирган ва эҳсон қилганларга улкан ажр бордир.",
                            "verse 57:8": "Сизларга нима бўлдики, Аллоҳга иймон келтирмайсизлар?! Ҳолбуки, Пайғамбар сизларни Роббиингизга иймон келтиришга чақириб турибдир. У сизлардан аҳд олган эди. Агар иймон келтирувчи бўлсаларингиз.(Яъни, Агар сизлар ўзи бирор нарсага ишонувчи бўлсаларингиз, нима учун Аллоҳга ишонмаяпсизлар. Ҳолбуки, орангизда Пайғамбар юриб, сизни парвардигорингизга иймон келтиришга чақириб турибди.)",
                            "verse 57:9": "У зот Ўз бандасига сизларни зулматлардан нурга чиқариш учун равшан оятларни туширадир. Ва, албатта, Аллоҳ сизларга шафқатли ва раҳмлидир.",
                            "verse 57:10": "Сизларга нима бўлдики, Аллоҳнинг йўлида эҳсон қилмайсизлар?! Ҳолбуки, осмонлару ернинг мероси Аллоҳникидир. Сизлардан ҳеч ким фатҳдан илгари эҳсон қилганларга ва урушда қатнашганларга баробар бўла олмайдир. Уларнинг даражалари фатҳдан сўнг эҳсон қилганлардан ва урушда қатнашганлардан кўра улуғдир. Аллоҳ барчага яхшиликни ваъда қилгандир. Ва Аллоҳ нима қилаётганларингиздан хабардордир. (Оятдаги «Фатҳ» сўзи Маккаи мукаррамани Пайғмбар алайҳиссалом бошлиқ мусулмонлар Мадинаи мунавварадан келиб мушриклардан озод қилиш маъносида айтилган.)",
                            "verse 57:11": "Аллоҳга яхши қарз берадиган киши борми?! Бас, У зот унга бир неча марта кўпайтириб қайтарадир ва унга карамли ажр бордир. (Аллоҳ таоло Ўз дини йўлида сарфланадиган молу мулкни унга берилган «яхши қарз»га, яъни, орага судхўрлик ва бошқа ғаразлар қўшилмаган қарзга ўхшатмоқда. Бунда эҳсон, инфоқ қилишга катта тарғиб бордир. Чунки қарзни муҳтожлар олади, Аллоҳ эса ҳеч нарсага муҳтожлиги йўқ, балки барчанинг Унга муҳтожлиги бор зотдир. )",
                            "verse 57:12": "Мўмин ва мўминаларни уларнинг олдиларида ва ўнг тарафларида нурлари ҳаракат қилаётган ҳолда кўрган кунингда, Сизларга бугунги куннинг хушхабари дарахтлари остидан сувлари оқиб турган жаннатлардир. У жойда абадий қолажаксиз. Бу эса, айнан улкан ютуқдир, (дейиладир).",
                            "verse 57:13": "Мунофиқ ва мунофиқалар иймонлиларга: «Тўхтаб туринглар, биз ҳам нурингиздан бир оз олайлик», деган ва уларга: «Ортингизга қайтинг ҳамда нур қидиринг», дейилган кунда. Бас, уларнинг орасига эшиги бор қўрғон уриладир. Унинг ичида раҳмат, ташқарисида - олдида азобдир. (Қиёмат куни зулмат бўлиб, албатта, бу ўша кунда рўй берадиган ҳодисаларнинг бир босқичи, холос. Ҳеч ким ҳеч нарсани кўрмай қолганда, мўминларга нур ато қилиниб, улар шодон ва шаҳдам юриб боришади. Шунда мунофиқлар: «Бизни ташлаб кетманглар, кутиб туринглар, бизга ҳам нурингиздан озгина беринглар», деб ялинишар экан. Уларга: «Ортингизга қайтиб, ўзингиз нур ахтаринг», дейиларкан. Улар қандай қилиб нур топишарди. Бу дунёда жоҳилият зулматларидан Ислом нурига чиқишни хоҳламаган эдилар. Энди охират зулматларида хору зор бўлишлари турган гап.)",
                            "verse 57:14": "Уларга (мунофиқлар): «Биз сиз билан бирга эмасмидик?!» деб нидо қилурлар. Улар: «Худди шундай. Лекин сизлар Аллоҳнинг амри келгунча ўзингизни ўзингиз фитнага дучор қилдингиз, кўз тикиб кутдингиз, шубҳа қилдингиз ва сизларни хом-хаёллар ғурурга кетказди. Сизларни Аллоҳ ҳақида алдамчи алдаб қўйди.",
                            "verse 57:15": "Бугун сизлардан ҳам, куфр келтирганлардан ҳам тўлов олинмас. Жойларингиз жаҳаннамда, у сизнинг эгангиздир. Қандай ҳам ёмон борар жой!» - дерлар. (Мунофиқлар: «Ажаб эмас, Ислом мағлубиятга учраб, мусулмонлар енгилса», деган хом хаёлларга берилиб, ғурурга кетадилар. Мунофиқларни шайтон «Сизлар тўғри иш қиляпсизлар, мабода нотўғри бўлса ҳам, Аллоҳнинг ўзи кечиради», деб уларни алдаб қўяди. Қиёмат кунида уларга ҳеч қандай нажот йўқ.)",
                            "verse 57:16": "Иймон келтирганлар учун Аллоҳнинг зикрига ва нозил бўлган ҳаққа қалблари юмшаш, айни чоқда, олдин китоб берилган, сўнг муддат ўтиши билан қалблари қотиб қолган, кўплари фосиқ бўлганларга ўхшамаслик вақти келмадими?! (Агар Аллоҳ тез-тез эслаб турилмаса, Қуръон ва шариатдан, дин таълимотларидан узоқлашилса, инсон қалбини моғор босади, бағри тошга айланади. Унга Аллоҳнинг зикри ҳам, диний таълимотлар ҳам таъсир қилмайдиган бўлиб қолади. Аввал Таврот ва Инжил каби илоҳий китоблар берилган яҳудий ва насронийларнинг вақт ўтиши билан оятда тасвирланганидек қалбларини моғор босиб, қаттиқ бўлиб қолган.)",
                            "verse 57:17": "Билингларки, албатта Аллоҳ ўлик ерни тирилтирур. Дарҳақиқат, сизларга оятларни баён қилдик, шоядки ақл юритсангизлар.",
                            "verse 57:18": "Албатта, садақа қилувчи эркагу аёл ҳамда Аллоҳга қарзи ҳасана берувчиларга (савоб) кўпайтириб берилур. Уларга карамли ажр ҳам бор.",
                            "verse 57:19": "Аллоҳга ва Унинг Пайғамбарларига иймон келтирганлар, ана ўшалар, сиддиқлардир. Ва Роббилари ҳузуридаги шоҳидлардир. Уларнинг ажрлари ва нурлари бор. Куфр келтирганлар ва оятларимизни ёлғонга чиқарганлар, ана ўшалар, дўзах эгаларидир. (Ушбу оятда Аллоҳга ва Унинг Пайғамбарларига иймон келтирганлар, сиддиқлар, деб аталмоқда. «Сиддиқ» аслида сўзига, эътиқодига ва амалига содиқ кишиларнинг сифатидир. Улар фазл ва мартабада Пайғамбарлардан кейин турадилар. Уларнин ҳаммаларига улуғ ажр ва қиёмат зулматида йўлларини ёритиб борадиган нур бордир. Кофирларга эса дўзах рўпара қилинади.)",
                            "verse 57:20": "Билингки, албатта, бу дунё ҳаёти ўйин, кўнгил эрмаги ва зеб-зийнатдан, ўзаро фахрланишдан, мол-мулкни ва бола-чақани кўпайтиришдан иборатдир. Худди ўсимлиги деҳқонларни ажаблантирган ёмғирга ўхшайдир. Кейинроқ бу ўсимликлар қурийдир ва сарғайганини кўрасан. У сўнгра хас-чўпга айланиб кетадир. Охиратда эса қаттиқ азоб бор, Аллоҳдан мағфират ва розилик бор. Бу дунё ҳаёти ғурурга кетгазувчи матодан ўзга ҳеч нарса эмас. (Яъни, бу дунё ҳаёти шундай бир ёмғирга ўхшайдики, у ёққандан сўнг чиққан наботот деҳқонларни ҳайратга солади, завқлантиради. Аслида эса бу ҳол ўткинчидир. Яъни, ўсимликлар тезда қурийди. ранги сарғаяди ва қуриб, қовжираб, уқаланиб кетади. Ҳа, бу дунё ҳаёти ҳам шу каби алдамчидир. Шу билангина овуниб қолмаслиги керак. Чунки охиратда кофирларга қаттиқ азоб, мўминларга эса Аллоҳнинг мағфирати ва розилиги бор. Албатта, бу гаплар тарки дунё қилишга, ҳамма нарсадан юз ўгиришга чақириқ эмас. Балки мезон ва ўлчовларни тўғри йўлга солишга, ўткинчи ҳой-ҳавасдан устун бўлишга даъват, холос.)",
                            "verse 57:21": "Роббингизнинг мағфиратига ва Аллоҳга ҳамда Унинг Пайғамбарларига иймон келтирганлар учун тайёрланган, кенглиги осмону ернинг кенглигича бўлган жаннатга мусобақалашинг. Ана ўша Аллоҳнинг фазли. Кимга хоҳласа беради, Аллоҳ улуғ фазл эгасидир. (Қуръони карим назарида, мусобақа бу дунё ҳаётининг ўткинчи ҳой-ҳавасларига, бойликка, ўйин-кулгуга эмас, балки Аллоҳнинг мағфиратига ва жаннатга элтувчи яхши амалларга қаратилиши керак.)",
                            "verse 57:22": "Бирор мусибатни пайдо қилмасамиздан олдин у Китобда битилган бўлур, акс ҳолда ер юзида ва ўз шахсларингизда сизга бирор мусибат етмас. Албатта, бу иш Аллоҳ учун осондир.",
                            "verse 57:23": "Токи, кетган нарсага қайғуриб, келган нарсадан хурсанд бўлмаслигингиз учун, Аллоҳ барча димоғдор ва мақтанчоқларни суймайдир.",
                            "verse 57:24": "Улар бахилдирлар ва кишиларни ҳам бахилликка буюрадилар. Ким юз ўгирса, бас, Аллоҳ беҳожат ва мақталган зотдир. (Улар бахиллик қилиб, кишиларни ҳам бахилликка буюрсалар-да, Аллоҳга ҳеч зарари йўқ, чунки Аллоҳ беҳожат, бой ва мақталган зотдир.)",
                            "verse 57:25": "Дарҳақиқат, Биз Пайғамбарларимизни равшан(нарса)лар ила юбордик ва улар ила китоб, ҳамда одамлар адолатда туришлари учун мезон туширдик. Ва темирни туширдик - унда катта куч-қувват ва одамлар учун манфаатлар бор. Аллоҳ ким Ўзига ва Пайғамбарларига ғойибона ёрдам бераётганини билиши учун. Албатта, Аллоҳ кучли ва азиздир. (Ояти каримада Аллоҳ субҳанаҳу ва таоло Ўз Пайғамбарларига юбордим деяётган равшан, очиқ-ойдин нарсалар - мўъжизалар, шариат аҳкомлари, оятлар бўлиши мумкин. Ушбу оят тушган вақтидаёқ мусулмонларни темирга эътибор беришга, ундан самарали фойдаланишга даъват қилган эди. Темирнинг одамлар учун манфаатини санаб тугатиб бўлмайди. Оятнинг охиридаги жумлада бир-икки нозик маъно бор. Жумладан, темирдан ясалган асбобларни ишлатиб, Аллоҳга ва Унинг Пайғамбарларига ёрдам берувчиларни билиши учун, деган ишора. Маълумки, Аллоҳ илмининг чегараси йўқ - ҳамма нарсани рўй беришидан аввал билиб туради. Лекин бу оятдаги «билиши»ни юзага чиқариши, халойиққа билдириши деб тушунмоқ керак. Шунингдек, «ғойибона» сўзи ҳам Аллоҳни ва Унинг Пайғамбарларини кўрмасдан туриб уларни динига ёрдам беринглар, деб шарҳланади.)",
                            "verse 57:26": "Дарҳақиқат, Нуҳ ва Иброҳимни Пайғамбар қилиб юбордик ҳамда Пайғамбарликни ва китобни икковларининг зурриётига хос қилдик. Улар орасида ҳидоят топганлар бор, лекин уларнинг кўплари фосиқлардир.",
                            "verse 57:27": "Сўнгра уларнинг ортидан Пайғамбарларимизни кетма-кет юбордик ва Исйо ибн Марямни ҳам ортларидан юбордик ҳамда унга Инжилни бердик. Унга эргашганларнинг қалбларига меҳрибонлик ва раҳмдилликни солдик. Роҳибликни ўзлари чиқариб олдилар, Биз буни уларга фарз қилмаган эдик, фақат ўзлари Аллоҳнинг розилигини тилаб қилдилар, лекин ҳақиқий риоясини қила олмадилар. Бас, улардан иймон келтирганларига ажрларини бердик, лекин уларнинг кўпи фосиқлардир. (Роҳиблик, таркидунёчиликдан иборат бўлиб, ўрисларда, монахлик, дейилади. Монахликни ихтиёр қилган эркак эркаклар монастирида, аёл эса аёллар монастирида, оила қурмай, дунёни тарк этиб ҳаёт кечирадилар. Қуръони карим бундай роҳибликни Аллоҳ Ийсо алайҳиссаломга эргашувчиларга буюрмаганини, балки улар ўзлари бидъат сифатида кейинчалик ўйлаб топиб одат қилишганини эслатмоқда.)",
                            "verse 57:28": "Эй иймон келтирганлар! Аллоҳга тақво қилинглар ва Унинг Пайғамбарига иймон келтиринглар. У зот Ўз раҳматидан сизларга икки ҳисса берадир ва сизларнинг юришингизга нур берадир ҳамда сизларни мағфират қиладир. Аллоҳ кечирувчи, раҳмли зотдир.",
                            "verse 57:29": "Токи китоб аҳллари Аллоҳнинг фазлидан ҳеч нарсага қодир эмасликларини, фазл Аллоҳнинг қўлида бўлиб, хоҳлаган кишисига беришини билсинлар. Аллоҳ улуғ фазл эгасидир. (Яҳудий ва насронийлар ваҳий, Пайғамбарлик ва илоҳий китоблар фақат бизга хос, ўзгаларга берилмайди, деб фахрланишар эди. Аллоҳ таоло уларнинг бу даъволарини рад қилиб, фазл ўзининг қўлида эканини, кимга хоҳласа, шунга раво кўришини, шу жумладан, араблардан бўлган Муҳаммад алайҳиссаломга беришини таъкидламоқда.)"
                        }
                    }
                }
            }
        }
    }
}