{
    "id": 63,
    "name_simple": "Al-Munafiqun",
    "revelation_place": "madinah",
    "revelation_order": 104,
    "bismillah_pre": true,
    "verses_count": 11,
    "short_text": "The Surah takes its name from the sentence Idha jaa kal-munafiquna of verse 1. This is the name of the Surah as well as the title of its subject matter, for in it a review has been made of the conduct and attitude of the hypocrites themselves.",
    "text": [
        "The Surah takes its name from the sentence Idha jaa kal-munafiquna of verse 1. This is the name of the Surah as well as the title of its subject matter, for in it a review has been made of the conduct and attitude of the hypocrites themselves.",
        "Period of Revelation",
        "As we shall explain below this Surah was sent down either during the Holy Prophet's return journey from his campaign against Bani al- Mustaliq, or immediately after his arrival back at Madinah, and we have established by argument and research in the Introduction to Surah An-Nur that the campaign against Bani al-Mustaliq had taken place in Sha'ban A. H. 6:Thus, the date of the revelation of this Surah is determined precisely.",
        "Historical Background",
        "Before we mention the particular incident about which this Surah was sent down, it is necessary to have a look at the history of the hypocrites of Madinah, for the incident that occurred on this occasion was not a chance happening but had a whole series of events behind it, which ultimately led up to it.",
        "Before the Holy Prophet's emigration to Madinah the tribes of the Aus and the Khazraj, fed up with their mutual rivalries and civil wars, had almost agreed on the leadership of one man and were making preparations to crown him their king. This was Abdullah bin Ubayy bin Salul, the chief of the Khazraj. Muhammad bin Ishaq has stated that among the people of Khazraj his authority was never contested and never had the Aus and the Khazraj rallied to one man before this. (Ibn Hisham, vol. II, p. 234)",
        "Such were the conditions when the voice of Islam reached Madinah and the influential people of both the tribes started becoming Muslims. When before the Emigration, the invitation was being extended to the Holy Prophet (upon whom be Allah'> peace) to come to Madinah, Hadhrat Abbas bin Ubadah bin Nadlah Ansari wanted to defer this invitation for the reason that Abdullah bin Ubayy also might join in the declaration of allegiance and invitation to the Holy Prophet, so that Madinah might become the center of Islam by common consent. But the delegation that arrived in Makkah to declare their allegiance did not give any importance to the proposal of Abbas bin Ubadah, and all its members, who included 75 men from both the tribes, became ready to invite the Holy Prophet in the face of every danger.(lbn Hisham, vol. II, P. 89). We have given the details of this event in the Introduction to Surah Al-Anfal.",
        "Then, when the Holy Prophet arrived in Madinah, Islam had so deeply penetrated every house of the Ansar that Abdullah bin Ubayy became helpless and did not see any other way to save his leadership than to become a Muslim himself. So, he entered Islam along with many of his followers from among the chiefs and leaders of both the tribes although their hearts were burning with rage from within. Ibn Ubayy in particular was filled with grief, for the Holy Prophet (upon whom be Allah's peace) had deprived him of his kingship. For several years his hypocritical faith and grief of being deprived of his kingdom manifested itself in different ways. On the one hand, when on Fridays the Holy Prophet (upon whom be Allah's peace) took his seat to deliver the Sermon, Abdullah bin Ubayy would stand up and say \"O people, the Messenger of Allah is present among you, by whom Allah has honored you; therefore, you should support him and listen to what he says and obey him.\" (Ibn Hisham, vol. III, p. 111). On the other, his hypocrisy was being exposed day by day and the true Muslims were realizing that he and his followers bore great malice against Islam, the Holy Prophet, and the Muslims.",
        "Once when the Holy Prophet was passing on the way Abdullah bin Ubayy spoke to him in harsh words. When the Holy Prophet complained of it to Hadrat Sa'd bin Ubadah; he said:\"O Messenger of Allah, don't be hard on him, for when Allah sent you to us we were making a diadem to crown him, and, by God, he thinks that you have robbed him of his kingdom.\" (Ibn Hisham vol: II, pp. 237-238).",
        "After the Battle of Badr when the Holy Prophet (upon whom be Allah's peace) invaded the Jewish tribe of Bani Qainuqa on their breaking the agreement and unprovoked revolt, this man stood up in support of them, and holding the Holy Prophet by his armor, said:\"These 700 fighters have been helping and protecting me against every enemy; would you cut them down in one morning? By God, I will not leave you until you pardon my clients.\" (Ibn Hisham, vol. III, pp. 5l- 52).",
        "On the occasion of the Battle of Uhud this man committed open treachery and withdrew from the battlefield with 300 of his companions. One should note that at this critical moment when he so acted, the Quraish had marched upon Madinah with 3,000 troops and the Holy Prophet had marched out with only 1,000 men to resist them. Of these 1,000 this hypocrite broke away with 300 men and the Holy Prophet was left with only 700 men to meet 3,000 troops of the enemy in the field.",
        "After this incident the common Muslims of Madinah came to realize fully that he was certainly a hypocrite and his those Companions also were found who were his associates in hypocrisy. That is why when on the very first Friday, after the Battle of Uhud, this man stood up as usual to make a speech before the Holy Prophet's Sermon, the people pulled at his garment, saying \"Sit down you are not worthy to say such things.\" That was the first occasion in Madinah when this man was publicly disgraced. Thereupon he was so filled with rage that he left the mosque jumping over the heads of the people. At the door of the Mosque some of the Ansar said to him, \"What are you doing?Go back and ask the Holy Prophet (upon whom be Allah's peace) to pray for your forgiveness.\" He retorted \"I do not, want him to pray for my forgiveness.\" (Ibn Hisham, vol. III, p. 111).",
        "Then in A. H. 4 the Battle of Bani an-Nadir took place. On this occasion he and his companions supported the enemies of Islam even more openly. On the one side, the Holy Prophet (upon whom be Allah's peace) and his devoted Companions were preparing for war against their enemy, the Jews, and on the other, these hypocrites were secretly sending messages to the Jews to the effect: \"Stand firm we are with you: if you are attacked, we will help you, and if you are driven out, we too will go out with you.\" The secret of this intrigue was exposed by Allah Himself, as has been explained in Surah Al-Hashr: 11-17 above.",
        "But in spite of being so exposed the reason why the Holy Prophet (upon whom be Allah's peace) was still treating him kindly was that he had a large band of the hypocrites behind him. Many of the chiefs of both the Aus and the Khazraj were his supporters. At least a third of the population of Madinah consisted of his companions, as became manifest on the occasion of the Battle of Uhud. Under such conditions it was not prudent to wage a war with these internal enemies combined with the external enemies. On this very account, in spite of being fully aware of their hypocrisy the Holy Prophet continued to deal with them according to their apparent profession of faith for a long time. On the other hand, these people too neither possessed the power nor the courage to fight the believers openly as disbelievers, or to join hands with an invader and face them in the battlefield. Apparently, they were a strong hand but inwardly they had the weakness which Allah has vividly portrayed in Surah Al-Hashr: 12-14. Therefore; they thought their well being lay only in posing as Muslims. They came to the mosque, offered the prayers gave away the zakat, and would make tall oral claims to the faith, which the true Muslims never felt the need to do. They would offer a thousand justifications for each of their hypocritical acts by which they would try to deceive their compatriots, the Ansar, into believing that they were with them. By these designs they were not only saving themselves from the disadvantages which could naturally accrue if they separated themselves from the Ansar brotherhood, but also taking advantage of the opportunities to make mischief which were available to them as members of the Muslim brotherhood.",
        "These were the causes which enabled Abdullah bin Ubayy and like minded hypocrites to get an opportunity to accompany the Holy Prophet (upon whom be Allah's peace) in his campaign against the Bani al-Mustaliq, and they simultaneously engineered two great mischiefs which could shatter the Muslim unity to pieces. However, by virtue of the wonderful training in discipline that the Muslim; had received through the pure teaching of the Quran and the companionship of the Holy Prophet (upon whom be peace) both mischiefs were stopped in time, and the hypocrites themselves were disgraced instead. One of these was the mischief that has been mentioned in Surah An-Nur above, and the other which has been mentioned in this Surah.",
        "This incident has been related by Bukhari, Muslim, Ahmad, Nasai, Tirmidhi, Baihaqi, Tabari, Ibn Marduyah, Abdur Razzaq, lbn Jarir Tabari, Ibn Sa'd and Muhammad bin Ishaq through many reliable channels. In some traditions the expedition in which it took place has not been named, and in others it has been connected with the Battle of Tabuk. But the authorities on the battles fought by the Holy Prophet and history are agreed that this incident took place on the occasion of the campaign against the Bani al- Mustaliq. The following seems to he the real story when all the traditions are read together.",
        "When after crushing down the power of Bani al- Mustaliq the Islamic army had made a halt in the settlement at the well of al Muraisi. Suddenly a dispute arose between two men on taking water from the well; One of them was Jehjah bin Masud Ghifari, a servant of Hadrat Umar appointed to lead his horse. The other was Sinan bin Wabar al-Juhani, whose tribe was an ally of a clan of the Khazraj. Harsh words between them led to fighting and Jehjah kicked Sinan, which the Ansar, on account of their ancient Yamanite tradition, took as a great insult and disgrace. At this Sinan called out the men of Ansar and Jehjah the Emigrants for help. Hearing about the quarrel Ibn Ubayy started inciting and calling the men of the Aus and the Khazraj to come out and help their ally. From the other side some Emigrants also came out. The dispute might have led to a fight between the Ansar and the Muhajirin themselves at the very place where they had just fought an enemy tribe jointly and crushing it had halted in its own territory. But hearing the noise the Holy Prophet (upon whom be peace) emerged and said:\"what is this call of paganism? What have you to do with such a call? Leave it, it is a dirty thing.\" Thereupon the leading men of the two sides met and settled the dispute; Sinan pardoned Jehjah and peace was restored.",
        "After this, every person whose heart was disaffected came to Abdullah bin Ubayy and they all said to him, \"Until now we had our hopes attached to you and you were protecting us, but now it seems you have become a helper of these paupers against us. Ibn Ubayy was already enraged: These words made him burst out, thus: \"This is what you have done to yourselves. You have given these people shelter in your country, and have divided your property among them. So much so that they have now become our rivals. Nothing so fits us and the paupers of Quraish(or the Companions of Muhammad) as the ancient saying 'Feed your dog to fatten it and it will devour you.' If you hold back your property from them, they would go elsewhere. By God, when we return to Madinah, the honorable ones will drive out from it the mean ones.\"",
        "Zaid bin Arqam, a young boy, also happened to be present in the assembly at that time. He heard this and mentioned it before his uncle, and his uncle who was one of the Ansar chiefs went to the Holy Prophet (upon whom be peace) and told him the whole story. The Holy Prophet called Zaid and asked him what had happened and he repeated every word of what he had heard. The Holy Prophet said, \"Zaid, you are perhaps displeased with Ibn Ubayy; you might have been mistaken in the hearing; you. might have imagined Ibn Ubayy said this.\" But Zaid was sure and firm. He said, \"No, I swear by God I have heard him say this and that.\" Thereupon the Holy Prophet called Ibn Ubayy, and he came and swore that he had not said any such thing. The people of the Ansar also said \"Sir, a boy says this: he might have been mistaken in what he heard lbn Ubayy is a venerable old man and our chief. Do not believe what a boy says against him.\" The elderly people of the tribe reproved Zaid also, who became depressed and held his peace. But the Holy Prophet knew Zaid as well as Abdullah bin Ubayy. Therefore, he fully understood what had actually happened.",
        "When Hadrat Umar came to know of this, he came to the Holy Prophet and said:\"Please allow me to put this hypocrite to the sword. Or, if you do not think it is fit to give me the permission you may tell Muadh bin Jabal, or Abbad bin Bishr, or Sad bin Mu'adh, or Muhammad bin Maslamah from among the Ansar, to go and kill him.\"But the Holy Prophet said: \"No, the people will say Muhammad kills his own Companions.\" After this he ordered the people to set off immediately, although it was at a time when the Holy Prophet was not accustomed to travel. The forced march continued for 30 hours at a stretch so that the people became exhausted. Then he halted, and as soon as they touched the ground they fell asleep. This he did to distract their minds from what had happened at the well of al-Muraisi. On the way, Hadrat Usaid bin Hudair, an Ansar chief, met the Holy Prophet, and said:\"O Messenger of Allah, today you ordered the people to set off at a time which was disagreeable for traveling, a thing you have never done before.\"The Holy Prophet replied: \"Have you. not heard of what your friend said?\" When he asked who he meant, the Holy Prophet replied: Abdullah bin Ubayy. He asked what he had said. The Holy Prophet answered: \"He has asserted that when he returns to Madinah the honorable ones will drive out from it the mean ones. He answered: \"By God, O Messenger of Allah, you are the honorable one and he is the mean one; you will drive him out whenever you want to.\"",
        "By and by the news spread among the Ansar soldiers and it enraged them against Ibn Ubayy. The people advised him to go to the Holy Prophet (upon whom be Allah's peace) and request for his forgiveness, but he retorted: \"You asked me to believe in him, and I believed in him; you asked me to pay the zakat on my property, and I paid the zakat too; now the only thing left is that I should bow down to Muhammad.\"This further enraged the believing Ansar and everyone' started reproaching and cursing him roughly. When the caravan was about to enter Madinah, Abdullah, the son of Abdullah bin Ubayy, stood before his father with a drawn-out sword and said: \"You had said that when you reached Madinah, the honorable ones would drive out the mean ones. Now, you will know who is honorable you or Allah and His Messenger. By God, you cannot enter Madinah until the Messenger of Allah (upon whom be Allah's peace) permits you to enter.\" At this Ibn Ubayy cried out: \"O people of Khazraj, look, my own son is preventing me from entering Madinah.\" The people conveyed this news to the Holy Prophet, and he said: \"Tell Abdullah to let his father come home.\"Abdullah said, \"If this is the Holy Prophet's order, then you may enter.\"Thereupon the Holy Prophet said to Hadrat Umar: \"Now what do you think, Umar? Had you killed him on the day when you asked my permission to kill him, many people would have trembled with rage. Today if I order them to kill him, they will kill him immediately.\"Hadrat Umar replied \"By God, I realize there was greater wisdom behind what the Apostle of Allah said than what I said.\"'",
        "These were the circumstances under which this Surah was sent down most probably after the Holy Prophet's return to Madinah."
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that declares that God bears witness that the false profession of faith by The Hypocrites is uttered only as a screen to hide their duplicity. It takes its name from its main topic, “the hypocrites” (munāfiqūn). The surah warns the believers about the treachery of the hypocrites and describes their behaviour in some detail. A specific occasion on which the hypocrites tried to stop anyone donating money to believers is described (verse 7 .) and God calls on the Muslims to compensate for this by giving more of their own funds to the needy (verse 9 .).",
    "name_translation": "The Hypocrites",
    "name_complex": "Al-Munâfiqûn",
    "surah_name_ar": "المنافقون",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 63:1": "Kur të vijnë te ti hipokritët, ata thonë: “Ne dëshmojmë, se ti, me të vërtetë, je i dërguari i Perëndisë!” – E Perëndia e di, se ti, me siguri, je i dërguari i Tij, por Perëndia dëshmon edhe se hipokritët janë gënjeshtarë të qartë.",
                            "verse 63:2": "Ata betimet e tyre i kanë bërë maskë, andaj i kanë penguar (njerëzit) prej rrugës së Perëndisë. – Me të vërtetë, është shëmtim, atë që kanë punuar!",
                            "verse 63:3": "Kjo është ngase kanë besuar, pastaj kanë mohuar, e u vulosën zemrat e tyre, prandaj ata nuk kuptojnë.",
                            "verse 63:4": "Kur i shikon ata, figura e tyre të mahnitë; e nëse flasin, dëgjon fjalët e tyre, - mirëpo, ata u gjasojnë trungjeve të mbështetura dhe mendojnë se çdo fjalë është kundër tyre. Ata janë armiq të vërtetë, andaj ruajuni prej tyre! – Perëndia i vraftë, si po shmangen prej së vërtetës?!",
                            "verse 63:5": "E kur ju thuhet atyre: “Ejani, se i dërguari i Perëndisë do të lutet për t’ju falë”, - ata tundin kokat e tyre dhe i sheh ata që pengojnë, e që janë mendjemëdhenj.",
                            "verse 63:6": "Njësoj është – u lute për faljen e tyre apo nuk u lute, Perëndia kurrsesi nuk i falë. Perëndia, me të vërtetë, nuk e udhëzon popullin ngatërrestar.",
                            "verse 63:7": "Ata thonë: “Mos u jepni kurrgjë atyre që janë te Profeti i Perëndisë, përderisa të largohen (prej tij)!” Por, Perëndisë i takojnë thesarët në qiej dhe në Tokë, por hipokritët nuk kuptojnë.",
                            "verse 63:8": "Ata thonë: “Nëse kthehemi në Medinë, padyshim të fuqishmit do t’i dëbojnë të dobëtit nga ajo (Medina)!” Por, fuqia është e Perëndisë dhe e Profetit të Tij dhe e besimtarëve, mirëpo – hipokritët nuk e dijnë (këtë).",
                            "verse 63:9": "O besimtarë, mos t’ju habisin pasuria juaj dhe fëmijët tuaj nga të përmendurit Perëndinë. E ata që bëjnë këtë, do të humbin.",
                            "verse 63:10": "Jepni ju prej atyre dhuntive, që u kam dhënë Unë juve, para se t’ju vijë vdekja ndonjërit, e ai të thotë: “O Zoti im, sikur të më kishe lënë edhe një kohë të shkurtër në jetë, do të kisha dhënë lëmoshën dhe do të bëhesha ndër të mirët!”",
                            "verse 63:11": "Perëndia nuk i jep afat askujt, kur t’i vijë momenti i vdekjes; e Perëndia di mirë atë që punoni ju."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "(Ya Peyğəmbər!) Münafiqlər (riyakarlar) sənin yanına gəldikləri zaman: \"Biz sənin, doğrudan da, Allahın Peyğəmbəri olduğuna şəhadət veririk! - deyirlər. Allah sənin Onun həqiqi Peyğəmbər olduğunu bilir. Allah həm də münafiqlərin xalis yalançı olduqlarına şəhadət verir.",
                            "verse 63:2": "Onlar (yalan) andlarını özlərində sipər edib (xalqı) Allah yolundan döndərirlər. Həqiqətən, onların törətdikləri əməllər necə də pisdir!",
                            "verse 63:3": "Bunun səbəbi odur ki, onlar (dildə) iman gətirdilər, sonra isə (ürəklərində gizli) kafir oldular. Buna görə də onların ürəklərinə möhür vurulmuş, özləri isə anlamaz kimsələr olmuşlar.",
                            "verse 63:4": "(Ya Peyğəmbər!) Sən onları gördükdə cüssələri (boy-buxunları, gözəllikləri) xoşuna gəlir, danışanda sözlərinə qulaq asırsan. Onlar, sanki (divara) söykədilmiş dirəklərdir (ruhsuz bədən, müqəvva kimidirlər). Onlar (ikiüzlülüklərinin Peyğəmbərə və mö'minlərə əyan olacağından qorxub) hər bir qışqırığın (səs-küyün) öz əleyhlərinə olduğunu zənn edirlər. Onlar düşməndirlər, sən onlardan həzər et! Allah onları öldürsün, necə də haqdan döndərilirlər!",
                            "verse 63:5": "Onlara: \"Gəlin Allahın Peyğəmbəri (Rəbbinizdən) sizin bağışlanmağınızı diləsin!\"-deyildiyi zaman (istehza ilə) başlarını bulayar və sən (Ya Rəsulum!) onların təkəbbürlə üz çevirdiklərini görərsən.",
                            "verse 63:6": "Sən onların bağışlanmasını diləsən də, diləməsən də, fərqi yoxdur. Onsuz da Allah onları bağışlamayacaqdır. Şübhəsiz ki, Allah fasiq qövmü doğru yola yönəltməz!",
                            "verse 63:7": "Onlar: \"Allahın Peyğəmbəri yanında olanlara bir şey verməyin ki, dağılıb getsinlər!\" - deyən kimsələrdir. Halbuki göylərin və yerin xəzinələri Allaha məxsusdur, lakin münafiqlər (bunu) anlamazlar.",
                            "verse 63:8": "Onlar: \"Əgər biz (Bəni Müstəliq vuruşunda) Mədinəyə qayıtsaq, ən güclülər (ən şərəflilər - münafiqlər) ən zəifləri (ən həqirləri - Peyğəmbəri və ona iman gətirənləri), əlbəttə, oradan çıxardacaqlar!\" - deyirlər. Halbuki şərəf-şan da, (qüvvət və qələbə də) yalnız Allaha, Onun Peyğəmbərinə və mö'minlərə məxsusdur, lakin münafiqlər (bunu) bilməzlər!",
                            "verse 63:9": "Ey iman gətirənlər! Nə mal-dövlətiniz, nə də oğul-uşağınız sizi Allahın zikrindən yayındırmasın! Hər kəs bunu etsə (Allahı yada salmasa), belələri əsl ziyana uğrayanlardır.",
                            "verse 63:10": "Birinizin ölümü çatıb: \"Ey Rəbbim! Mənə bir az möhlət versəydin, sədəqə verib salehlərdən olardım! - deməmişdən əvvəl sizə verdiyim ruzidən (Allah yolunda) xərcləyin.",
                            "verse 63:11": "Və (bilin ki) Allah əcəli çatan heç kəsə möhlət verməz. Allah sizin nə etdiklərinizdən xəbərdardır!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Kad ti licemjeri dolaze, oni govore: \"Mi tvrdimo da si ti, zaista, Allahov poslanik!\" - I Allah zna da si ti, zaista, Njegov poslanik, a Allah tvrdi i da su licemjeri pravi lašci.",
                            "verse 63:2": "Oni se iza zakletvi svojih zaklanjaju, pa od Allahova puta odvraćaju. Ružno je, doista, kako postupaju!",
                            "verse 63:3": "To je zato što su vjernici bili, pa nevjernici postali, i onda su im srca zapečaćena, pa ne shvaćaju.",
                            "verse 63:4": "Kad ih pogledaš, njihov izgled te ushićuje; a kad progovore, ti slušaš riječi njihove, međutim, oni su kao šuplji naslonjeni balvani, i misle da je svaki povik protiv njih. Oni su pravi neprijatelji, pa ih se pričuv",
                            "verse 63:5": "A kad im se rekne: \"Dođite, Allahov Poslanik će moliti da vam se oprosti\"- oni glavama svojim tresu i vidiš ih kako nadmeno odbijaju.",
                            "verse 63:6": "Isto im je - molio ti oprosta za njih ili ne molio, Allah im, zaista, neće oprostiti, Allah, doista, narodu nevjerničkom neće na Pravi put ukazati.",
                            "verse 63:7": "Oni govore: \"Ne udjeljujte ništa onima koji su uz Allahova Poslanika, da bi ga napustili!\" A blaga nebesa i Zemlje su Allahova, ali licemjeri neće da shvate.",
                            "verse 63:8": "Oni govore: \"Ako se vratimo u Medinu, sigurno će jači istjerati iz nje slabijeg!\" A snaga je u Allaha i Poslanika Njegova i u vjernika, ali licemjeri neće da znaju.",
                            "verse 63:9": "O vjernici, neka vas imanja vaša i djeca vaša ne zabave od sjećanja na Allaha. A oni koji to učine, biće izgubljeni.",
                            "verse 63:10": "I od onoga čime vas Mi opskrbljujemo udjeljujte prije nego nekom od vas smrt dođe, pa da onda rekne: \"Gospodaru moj, da me još samo kratko vrijeme zadržiš, pa da milostinju udjeljujem i da dobar budem!\"",
                            "verse 63:11": "Allah, sigurno, neće ostaviti u životu nikoga kome smrtni čas njegov dođe; a Allah dobro zna ono što vi radite."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "মুনাফিকরা আপনার কাছে এসে বলেঃ আমরা সাক্ষ্য দিচ্ছি যে আপনি নিশ্চয়ই আল্লাহর রসূল। আল্লাহ জানেন যে, আপনি অবশ্যই আল্লাহর রসূল এবং আল্লাহ সাক্ষ্য দিচ্ছেন যে, মুনাফিকরা অবশ্যই মিথ্যাবাদী।",
                            "verse 63:2": "তারা তাদের শপথসমূহকে ঢালরূপে ব্যবহার করে। অতঃপর তারা আল্লাহর পথে বাধা সৃষ্টি করে। তারা যা করছে, তা খুবই মন্দ।",
                            "verse 63:3": "এটা এজন্য যে, তারা বিশ্বাস করার পর পুনরায় কাফের হয়েছে। ফলে তাদের অন্তরে মোহর মেরে দেয়া হয়েছে। অতএব তারা বুঝে না।",
                            "verse 63:4": "আপনি যখন তাদেরকে দেখেন, তখন তাদের দেহাবয়ব আপনার কাছে প্রীতিকর মনে হয়। আর যদি তারা কথা বলে, তবে আপনি তাদের কথা শুনেন। তারা প্রাচীরে ঠেকানো কাঠসদৃশ্য। প্রত্যেক শোরগোলকে তারা নিজেদের বিরুদ্ধে মনে করে। তারাই শত্রু, অতএব তাদের সম্পর্কে সতর্ক হোন। ধ্বংস করুন আল্লাহ তাদেরকে। তারা কোথায় বিভ্রান্ত হচ্ছে ?",
                            "verse 63:5": "যখন তাদেরকে বলা হয়ঃ তোমরা এস, আল্লাহর রসূল তোমাদের জন্য ক্ষমাপ্রার্থনা করবেন, তখন তারা মাথা ঘুরিয়ে নেয় এবং আপনি তাদেরকে দেখেন যে, তারা অহংকার করে মুখ ফিরিয়ে নেয়।",
                            "verse 63:6": "আপনি তাদের জন্যে ক্ষমাপ্রার্থনা করুন অথবা না করুন, উভয়ই সমান। আল্লাহ কখনও তাদেরকে ক্ষমা করবেন না। আল্লাহ পাপাচারী সম্প্রদায়কে পথপ্রদর্শন করেন না।",
                            "verse 63:7": "তারাই বলেঃ আল্লাহর রাসূলের সাহচর্যে যারা আছে তাদের জন্যে ব্যয় করো না। পরিণামে তারা আপনা-আপনি সরে যাবে। ভূ ও নভোমন্ডলের ধন-ভান্ডার আল্লাহরই কিন্তু মুনাফিকরা তা বোঝে না।",
                            "verse 63:8": "তারাই বলেঃ আমরা যদি মদীনায় প্রত্যাবর্তন করি তবে সেখান থেকে সবল অবশ্যই দুর্বলকে বহিস্কৃত করবে। শক্তি তো আল্লাহ তাঁর রসূল ও মুমিনদেরই কিন্তু মুনাফিকরা তা জানে না।",
                            "verse 63:9": "মুমিনগণ! তোমাদের ধন-সম্পদ ও সন্তান-সন্ততি যেন তোমাদেরকে আল্লাহর স্মরণ থেকে গাফেল না করে। যারা এ কারণে গাফেল হয়, তারাই তো ক্ষতিগ্রস্ত।",
                            "verse 63:10": "আমি তোমাদেরকে যা দিয়েছি, তা থেকে মৃত্যু আসার আগেই ব্যয় কর। অন্যথায় সে বলবেঃ হে আমার পালনকর্তা, আমাকে আরও কিছুকাল অবকাশ দিলে না কেন? তাহলে আমি সদকা করতাম এবং সৎকর্মীদের অন্তর্ভুক্ত হতাম।",
                            "verse 63:11": "প্রত্যেক ব্যক্তির নির্ধারিত সময় যখন উপস্থিত হবে, তখন আল্লাহ কাউকে অবকাশ দেবেন না। তোমরা যা কর, আল্লাহ সে বিষয়ে খবর রাখেন।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 63:1": "Когато идват при теб, лицемерите казват: Свидетели сме, че ти си Пратеника на Аллах. Аллах знае, че ти си Неговият Пратеник. Аллах е свидетел, че лицемерите са лъжци.",
                            "verse 63:2": "Те превръщат клетвите си в прикритие и възпират от пътя на Аллах. Лоши са делата им!",
                            "verse 63:3": "Така е, защото повярваха, после станаха неверници, затова бяха запечатани сърцата им, та не разбират.",
                            "verse 63:4": "И като ги гледаш, видът им ти харесва, и като говорят, вслушваш се в думите им. Те са като подпрени дървета. Смятат, че всеки вик е против тях. Те са врагът. Пази се от тях! Да ги порази Аллах, как така се подлъгват!",
                            "verse 63:5": "И когато им се каже: Елате Пратеника на Аллах да моли за вас опрощение!, те извръщат глави и ги виждаш как надменно се отказват.",
                            "verse 63:6": "Все едно е дали ще молиш опрощение за тях, или не ще молиш. Аллах не ще им опрости. Аллах не напътва нечестивите хора.",
                            "verse 63:7": "Те са, които казват: Не харчете за онези, които са при Пратеника на Аллах, за да се разотидат! Но на Аллах принадлежат съкровищниците на небесата и на земята. Ала лицемерите не проумяват.",
                            "verse 63:8": "Казват: Щом се върнем в ал-Медина, по-могъщият там непременно ще пропъди по-слабия. А могъществото принадлежи на Аллах и на Неговия Пратеник, и на вярващите. Ала лицемерите не разбират.",
                            "verse 63:9": "О, вярващи, да не ви отвличат от споменаването на Аллах нито вашите имоти, нито вашите деца! А които сторват това, те са губещите.",
                            "verse 63:10": "И раздавайте от онова, което ви дарихме за препитание, преди да е дошла при някого от вас смъртта и той да каже: Господи, да би ми дал малко време, щях да раздавам милостиня и да бъда от праведните!",
                            "verse 63:11": "Но Аллах на никого не ще даде отсрочка, щом му дойде времето. Сведущ е Аллах за вашите дела."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "當偽信者來見你的時候，他們說：「我們作証，你確是真主的使者。」真主知道你確是他的使者，真主作証，偽信的人們確是說謊的。",
                            "verse 63:2": "他們以自己的盟誓為護符，妨礙主道。他們的行為真惡劣！",
                            "verse 63:3": "這是因為他們口稱信道，心實不信，他們的心就封閉了，故他們不是明理的。",
                            "verse 63:4": "當你看見他們的時候，他們的體格，將使你讚嘆。如果他們說話，你就靜聽他們的言辭，他們好像木偶樣，他們以為一切吶喊，都是對他們而發的。他們確是敵人，故你當謹防他們。願真主誅滅他們！他們是如何悖謬的呢！",
                            "verse 63:5": "有人對他們說：「你們來道歉吧，使者將為你們求餞。」他們卻掉頭不顧，你看他們妄自尊大，不肯道歉。",
                            "verse 63:6": "你為他們求餞與否，這在他們，是一樣的。真主絕不赦宥他們，真主必定不引導悖逆的民眾。",
                            "verse 63:7": "他們說：「你們不要供給使者左右的人，以便他們離散。」天地的庫藏，只是真主的，偽信的人們卻不明理。",
                            "verse 63:8": "他們說：「如果我們返回麥地那，尊榮者必將卑賤者驅逐出城。」尊榮只是真主和使者以及信士們的，而偽信的人們卻不知道！",
                            "verse 63:9": "信道的人們啊！你們的財產和子女，不要使你們忽略了記念真主。誰那樣做，誰是虧折的。",
                            "verse 63:10": "在死亡降臨之前，你們當分捨我賜予你們的，否則，將來人人說：「我的主啊！你為何不讓我延遲到一個臨近的定期，以便我有所施捨，而成為善人呢？」",
                            "verse 63:11": "但壽限一到，真主絕不讓任何人延遲，真主是徹知你們的行為的。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Když k tobě přicházejí pokrytci, říkají: \"Dosvědčujeme, že jsi vskutku posel Boží!\" A Bůh dobře ví, žes vskutku Jeho posel, a Bůh dosvědčuje, že pokrytci jsou vskutku lháři.",
                            "verse 63:2": "A zaštíťují se přísahami svými a přitom svádějí jiné od cesty Boží. Jak hnusné je to, co dělají!",
                            "verse 63:3": "A to je proto, že zprvu uvěřili a potom se stali nevěřícími a srdce jejich byla zapečetěna, takže nic nechápou.",
                            "verse 63:4": "A když je vidíš, líbí se ti osoby jejích, a když hovoří, nasloucháš řeči jejich, jako by to byly trámy podepřené. A domnívají se, že křik každý je proti nim. Oni jsou nepřáteli, střež se jich! Nechť Bůh proti nim bojuje! Do čeho se to jen dostali?",
                            "verse 63:5": "A když se jim řekne: \"Pojďte, posel Boží poprosí za vás o slitování,\" odvracejí hlavy své a vidíš je, jak odmítají, jsouce pyšní.",
                            "verse 63:6": "Je pro ně zcela jedno, zda za ně prosíš o odpuštění, či nikoliv, Bůh jim beztak neodpustí. Bůh přece nepovede cestou správnou lid hanebníků.",
                            "verse 63:7": "To jsou ti, kdož říkají: \"Nepřispívejte nic na ty, kdož jsou s poslem Božím, ale ať utečou!\" A Bohu patří pokladnice nebes i země, ale pokrytci to nechápou.",
                            "verse 63:8": "A říkají dále: \"Věru, kdybychom se vrátili do Medíny, vskutku by z ní nejmocnější vyhnal nejubožejšího.\" Avšak moc náleží Bohu a poslu Jeho a věřícím, leč pokrytci to nevědí.",
                            "verse 63:9": "Vy, kteří věříte! Nechť vás majetky vaše a děti vaše neodlákají od vzpomínání Boha. A ti, kdož tak učiní, ti věru ztrátu utrpí.",
                            "verse 63:10": "Rozdávejte z toho, co jsme vám uštědřili, dříve než každého z vás zastihne smrt a než vykřikne: \"Pane můj, kdybys mi mohl dát odklad do lhůty blízké, abych mohl dávat almužny a stát se jedním z bezúhonných!\"",
                            "verse 63:11": "Ale Bůh nedá odklad duši žádné, když dostaví se lhůta její, a Bůh dobře je zpraven o všem, co děláte."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Wanneer de huichelaars tot u komen, zeggen zij: \"Wij getuigen dat gij inderdaad de boodschapper van God zijt.\" God weet dat gij Zijn boodschapper zijt, en God getuigt dat de huichelaars inderdaad leugenaars zijn.",
                            "verse 63:2": "Zij hebben hun eden tot een schild gemaakt; zo leiden zij mensen van God’s weg af. Hetgeen zij doen is zeker slecht.",
                            "verse 63:3": "Dat is omdat zij het geloof omhelsden en daarna verwierpen. Derhalve is een zegel op hun hart gedrukt en zij begrijpen niet (meer).",
                            "verse 63:4": "En wanneer gij hen ziet, behaagt hun uterlijk u en indien zij spreken luistert gij naar hen. Zij lijken op aangeklede stukken hout. Zij denken dat ieder gerucht tegen hen is. Zij zijn (uw) vijanden, neemt u daarom voor hen in acht. God’s vloek zij over hen! Hoe ver zijn zij afgewend (van de Waarheid)!",
                            "verse 63:5": "En wanneer er tot hen wordt gezegd: \"Komt, de boodschapper van God zal voor u om vergiffenis vragen,\" dan wenden zij hun hoofd af en gij ziet hen zich hoogmoedig terugtrekken.",
                            "verse 63:6": "Het is hetzelfde of gij wel of niet voor hen om vergiffenis vraagt, God zal hen stellig niet vergeven. Voorzeker, God leidt het opstandige volk niet.",
                            "verse 63:7": "Zij zijn het die zeggen, \"Besteedt niets voor degenen die met de boodschapper van God zijn zodat deze weglopen\"- terwijl aan God de schatten der hemelen en der aarde behoren; doch de huichelaars begrijpen dit niet.",
                            "verse 63:8": "Zij zeggen: \"Als wij naar Madinah terugkeren zal de aanzienlijkste er zeker de minste uitdrijven;\" maar eer behoort aan God, Zijn boodschapper en de gelovigen; de huichelaars echter weten het niet.",
                            "verse 63:9": "O, gij die gelooft, laat uw rijkdommen en uw kinderen u niet afleiden van de gedachtenis aan God. En wie dat doet behoort tot de verliezers.",
                            "verse 63:10": "En besteedt uit datgene waarvan Wij u voorzien hebben voordat de dood één uwer overvalt en deze zegt: \"Mijn Heer! Waarom hebt Gij mij niet voor een wijle uitstel verleend, opdat ik aalmoezen zou kunnen geven en tot de rechtvaardigen behoren?\"",
                            "verse 63:11": "En God geeft niemand uitstel wanneer zijn tijd is gekomen; en God is volkomen op de hoogte van hetgeen gij doet."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 63:1": "When the hypocrites come unto thee (O Muhammad), they say: We bear witness that thou art indeed Allah’s messenger. And Allah knoweth that thou art indeed His messenger, and Allah beareth witness that the hypocrites indeed are speaking falsely.",
                            "verse 63:2": "They make their faith a pretext so that they may turn (men) from the way of Allah. Verily evil is that which they are wont to do,",
                            "verse 63:3": "That is because they believed, then disbelieved, therefore their hearts are sealed so that they understand not.",
                            "verse 63:4": "And when thou seest them their figures please thee; and if they speak thou givest ear unto their speech. (They are) as though they were blocks of wood in striped cloaks. They deem every shout to be against them. They are the enemy, so beware of them. Allah confound them! How they are perverted!",
                            "verse 63:5": "And when it is said unto them: Come! The messenger of Allah will ask forgiveness for you! they avert their faces and thou seest them turning away, disdainful.",
                            "verse 63:6": "Whether thou ask forgiveness for them or ask not forgiveness for them is all one for them; Allah will not forgive them. Lo! Allah guideth not the evil-living folk.",
                            "verse 63:7": "They it is who say: Spend not on behalf of those (who dwell) with Allah’s messenger that they may disperse (and go away from you); when Allah’s are the treasures of the heavens and the earth; but the hypocrites comprehend not.",
                            "verse 63:8": "They say: Surely, if we return to Al-Madinah the mightier will soon drive out the weaker; when might belongeth to Allah and to His messenger and to the believers; but the hypocrites know not.",
                            "verse 63:9": "O ye who believe! Let not your wealth nor your children distract you from remembrance of Allah. Those who do so, they are the losers.",
                            "verse 63:10": "And spend of that wherewith We have provided you before death cometh unto one of you and he saith: My Lord! If only thou wouldst reprieve me for a little while, then I would give alms and be among the righteous.",
                            "verse 63:11": "But Allah reprieveth no soul when its term cometh, and Allah is Informed of what ye do."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 63:1": "When the Hypocrites come to thee, they say, \"We bear witness that thou art indeed the Apostle of God.\" Yea, God knoweth that thou art indeed His Apostle, and God beareth witness that the Hypocrites are indeed liars.",
                            "verse 63:2": "They have made their oaths a screen (for their misdeeds): thus they obstruct (men) from the Path of God: truly evil are their deeds.",
                            "verse 63:3": "That is because they believed, then they rejected Faith: So a seal was set on their hearts: therefore they understand not.",
                            "verse 63:4": "When thou lookest at them, their exteriors please thee; and when they speak, thou listenest to their words. They are as (worthless as hollow) pieces of timber propped up, (unable to stand on their own). They think that every cry is against them. They are the enemies; so beware of them. The curse of God be on them! How are they deluded (away from the Truth)!",
                            "verse 63:5": "And when it is said to them, \"Come, the Apostle of God will pray for your forgiveness\", they turn aside their heads, and thou wouldst see them turning away their faces in arrogance.",
                            "verse 63:6": "It is equal to them whether thou pray for their forgiveness or not. God will not forgive them. Truly God guides not rebellious transgressors.",
                            "verse 63:7": "They are the ones who say, \"Spend nothing on those who are with God’s Apostle, to the end that they may disperse (and quit Medina).\" But to God belong the treasures of the heavens and the earth; but the Hypocrites understand not.",
                            "verse 63:8": "They say, \"If we return to Medina, surely the more honourable (element) will expel therefrom the meaner.\" But honour belongs to God and His Apostle, and to the Believers; but the Hypocrites know not.",
                            "verse 63:9": "O ye who believe! Let not your riches or your children divert you from the remembrance of God. If any act thus, the loss is their own.",
                            "verse 63:10": "and spend something (in charity) out of the substance which We have bestowed on you, before Death should come to any of you and he should say, \"O my Lord! why didst Thou not give me respite for a little while? I should then have given (largely) in charity, and I should have been one of the doers of good\".",
                            "verse 63:11": "But to no soul will God grant respite when the time appointed (for it) has come; and God is well acquainted with (all) that ye do."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 63:1": "When the hypocrites come to thee they say, ’We bear witness that thou art indeed the Messenger of God.’ And God knows that thou art indeed His Messenger, and God bears witness that the hypocrites are truly liars.",
                            "verse 63:2": "They have taken their oaths as a covering, then they have barred from the way of God. Surely they -- evil are the things they have been doing.",
                            "verse 63:3": "That is because they have believed, then they have disbelieved; therefore a seal has been set on their hearts, and they do not understand.",
                            "verse 63:4": "When thou seest them, their bodies please thee; but when they speak, thou listenest to their speech, and it is as they were propped-up timbers. They think every cry is against them. They are the enemy; so beware of them. God assail them! How they are perverted!",
                            "verse 63:5": "And when it is said to them, ’Come now, and God’s Messenger will ask forgiveness for you,’ they twist their heads, and thou seest them turning their faces away, waxing proud.",
                            "verse 63:6": "Equal it is for them, whether thou askest forgiveness for them or thou askest not forgiveness for them; God will never forgive them. God guides not the people of the ungodly.",
                            "verse 63:7": "Those are they that say, ’Do not expend on them that are with God’s Messenger until they scatter off’; yet unto God belong the treasuries of the heavens and of the earth, but the hypocrites do not understand.",
                            "verse 63:8": "They say, ’If we return to the City, the mightier ones of it will expel the more abased’; yet glory belongs unto God, and unto His Messenger and the believers, but the hypocrites do not know it.",
                            "verse 63:9": "O believers, let not your possessions neither your children divert you from God’s remembrance; whoso does that, they are the losers.",
                            "verse 63:10": "Expend of what We have provided you before that death comes upon one of you and he says, ’O my Lord, if only Thou wouldst defer me unto a near term, so that I may make freewill offering, and so I may become one of the righteous.’",
                            "verse 63:11": "But God will never defer any soul when its term comes. And God is aware of the things you do."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 63:1": "WHEN THE HYPOCRITES come unto thee, they say, \"We bear witness that thou art indeed God’s Apostle!\" But God knows that thou art truly His Apostle; and He bears witness that the hypocrites are indeed false [in their declaration of faith].",
                            "verse 63:2": "They have made their oaths a cover [for their falseness], and thus they turn others away from the path of God. Evil, indeed, is all that they are wont to do:",
                            "verse 63:3": "this, because [they profess that] they have attained to faith, whereas [inwardly] they deny the truth – and so, a seal has been set on their hearts, so that they can no longer understand [what is true and what false].",
                            "verse 63:4": "Now when thou seest them, their outward appearance may please thee; and when they speak, thou art inclined to lend ear to what they say. [But though they may seem as sure of themselves] as if they were timbers [firmly] propped up, they think that every shout is [directed] against them. They are the [real] enemies [of all faith], so beware of them. [They deserve the imprecation,] \"May God destroy them!\" How perverted are their minds! –",
                            "verse 63:5": "for, when they are told, \"Come, the Apostle of God will pray [unto God] that you be forgiven,\" they turn their heads away, and thou canst see how they draw back in their false pride.",
                            "verse 63:6": "As for them, it is all the same whether thou dost pray that they be forgiven or dost not pray for them: God will not forgive them – for, behold, God does not bestow His guidance upon such iniquitous folk.",
                            "verse 63:7": "It is they who say [to their compatriots], \"Do not spend anything on those who are with God’s Apostle, so that they [may be forced to] leave.\" However, unto God belong the treasures of the heavens and the earth: but this truth the hypocrites cannot grasp.",
                            "verse 63:8": "[And] they say, \"Indeed, when we return to the City, [we,] the ones most worthy of honour, will surely drive out therefrom those most contemptible ones!\" However, all honour belongs to God, and [thus] to His Apostle and those who believe [in God]: but of this the hypocrites are not aware.",
                            "verse 63:9": "O YOU who have attained to faith! Let not your worldly goods or your children make you oblivious of the remembrance of God: for if any behave thus – it is they, they who are the losers!",
                            "verse 63:10": "And spend on others out of what We have provided for you as sustenance, ere there come a time when death approaches any of you, and he then says, \"O my Sustainer! If only Thou wouldst grant me a delay for a short while, so that I could give in charity and be among the righteous!\"",
                            "verse 63:11": "But never does God grant a delay to a human being when his term has come; and God is fully aware of all that you do."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 63:1": "When the hypocrites come to you, they say, “We bear witness that you are indeed the messenger of Allah.”-Allah knows that you are really His messenger-But Allah testifies that the hypocrites are actually liars.",
                            "verse 63:2": "They have made their oaths a shield, and thus they have prevented (others) from the way of Allah. Surely evil is what they have been doing.",
                            "verse 63:3": "That is because they declared faith (in Islam apparently), then disbelieved (secretly). Therefore a seal has been set on their hearts, and thus they do not understand.",
                            "verse 63:4": "And if you see them, their physiques would attract you, and if they speak, you would (like to) listen to their speech (because of their eloquence). (Yet, being devoid of substance,) it is as if they were propped up beams of timber. They deem every shout (they hear) to be against them (out of cowardice). They are the enemy; so beware of them. May Allah destroy them. How perverted are they!",
                            "verse 63:5": "And when it is said to them, “Come on, so that Allah’s Messenger may pray for your forgiveness”, they twist their heads (in aversion), and you see them turning away in arrogance.",
                            "verse 63:6": "It is equal in their case, whether you (O prophet,) pray for their forgiveness or do not pray, Allah will never forgive them. Indeed Allah does not guide the sinning people.",
                            "verse 63:7": "They are those who say, “Do not spend on those who are with Allah’s Messenger until they disperse. And to Allah belong the treasures of the heavens and the earth, but the hypocrites do not understand.",
                            "verse 63:8": "They say, “If we return to Madīnah, the more honorable ones will drive out the meaner ones from there.” And to Allah belongs the honour, and to His Messenger, and to the believers, but the hypocrites do not know.",
                            "verse 63:9": "O you who believe, your riches and your children must not divert you from the remembrance of Allah. And those who do that are the losers.",
                            "verse 63:10": "And spend out of what We have given to you before death overtakes one of you and he says, “My Lord, would you not give me respite to a near term, so that I should pay Sadaqah (alms) and become one of the righteous?”",
                            "verse 63:11": "But Allah will never give respite to anyone, once his appointed time will come. And Allah is All-Aware of what you do."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 63:1": "When the hypocrites come to you they say: ‘We bear witness that you are indeed the Messenger of God’. And God knows that you are indeed His Messenger, and God bears witness that the hypocrites truly are liars.",
                            "verse 63:2": "They have taken their oaths as a shield, and so they have barred from the way of God. Evil indeed is that which they are wont to do.",
                            "verse 63:3": "That is because they believed, then disbelieved; therefore their hearts have been stamped. Hence they do not understand.",
                            "verse 63:4": "And when you see them, their figures please you; and if they speak, you listen to their speech. [Yet] they are like blocks of timber [that have been] propped-up. They assume that every cry is [directed] against them. They are the enemy, so beware of them. May God assail them! How can they deviate?",
                            "verse 63:5": "And when it is said to them, ‘Come, and God’s Messenger will ask forgiveness for you’, they twist their heads, and you see them turning away, disdainful.",
                            "verse 63:6": "will be the same for them, whether you ask forgiveness for them or do not ask forgiveness for them: God will never forgive them. Indeed God does not guide the immoral folk.",
                            "verse 63:7": "They are the ones who say: ‘Do not expend on those who are with the Messenger of God, until they scatter off’. Yet to God belong the treasuries of the heavens and the earth, but the hypocrites do not understand.",
                            "verse 63:8": "They say, ‘Surely if we return to Medina, the powerful will [soon] expel from it the weaker’. Yet [the real] might belongs to God and to His Messenger, and to the believers, but the hypocrites do not know.",
                            "verse 63:9": "O you who believe, do not let your possessions and your children divert you from the remembrance of God; for whoever does that — it is they who are the losers.",
                            "verse 63:10": "And expend of that with which We have provided you before death comes to any of you, whereat he will say, ‘My Lord, if only You would reprieve me for a short time so that I might give charity and become one of the righteous!’",
                            "verse 63:11": "But God will never reprieve a soul when its term has come. And God is Aware of what you do."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 63:1": "(O Esteemed Beloved!) When the hypocrites come to you, they say: ‘We bear witness that you are certainly the Messenger of Allah.’ And Allah knows that surely you are His Messenger (blessings and peace be upon him). But Allah bears witness that undoubtedly the hypocrites are liars.",
                            "verse 63:2": "They have made their oaths a shield. Then they hinder (the people) from the path of Allah. Surely, that is an extremely evil (work) which they are doing.",
                            "verse 63:3": "That is because they believed (with their tongues) but remained disbelievers (at heart). So their hearts have been sealed. And they do not understand (anything).",
                            "verse 63:4": "(O servant!) When you see them, their bodies (and height and structure) seem attractive to you, and if they speak, you lend ear to what they say (i.e., they will look sensible to you, but the fact is that) they are nothing but wooden planks propped up against a supporting wall. They take every loud voice (as some suffering and misery) befallen them. It is these (hypocrites) who are (your) enemies. So be on guard against them. May Allah ruin them; where are they wandering distracted!",
                            "verse 63:5": "And when it is said to them: ‘Come so that Allah’s Messenger (blessings and peace be upon him) may seek forgiveness for you,’ these (hypocrites) jerk their heads aside (insolently) and you see them keeping away (from your presence) in arrogance.",
                            "verse 63:6": "It is all the same for these (evil-fated denigrators of the Holy Prophet [blessings and peace be upon him]) whether you seek for them forgiveness or do not seek for them forgiveness, Allah will never forgive them (because they mock you and show you dislike and arrogance). Surely, Allah does not provide guidance to the disobedient community.",
                            "verse 63:7": "(O Esteemed Beloved!) They are the people who say this as well (out of malice and enmity against you): ‘Do not spend on those (destitute devotees of Allah) who remain in the presence of the Messenger of Allah (i.e., do not provide them financial help) until they (all may desert him and) flee away (and disperse). In truth, to Allah belong all the treasures of the heavens and the earth, but the hypocrites do not understand.",
                            "verse 63:8": "They say: ‘If (now) we return to Medina, then (we) the honourable will drive out the dishonourable (i.e., the Muslims).’ But in fact, honour belongs to Allah alone and His Messenger and the believers. However, the hypocrites do not understand (this reality).",
                            "verse 63:9": "O believers! Let not your wealth and your children make you neglectful of the very remembrance of Allah. And whoever does so, it is they who are the losers.",
                            "verse 63:10": "And spend (in the way of Allah) out of (the wealth) which We have given you before death approaches one of you, and he says: ‘O my Lord, why did You not give me respite for a short while so that I could donate in charity and become one of the most pious?’",
                            "verse 63:11": "And Allah never grants respite to anyone when his hour of death approaches. And Allah is Well Aware of the actions that you do."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Kun tekopyhät tulevat luoksesi, he sanovat: »Me todistamme, että sinä varmasti olet Jumalan sananjulistaja.» Jumala tietää, että sinä totisesti olet Hänen sananjulistajansa; samoin Jumala todistaa, että tekopyhät totisesti ovat valehtelijoita.",
                            "verse 63:2": "He ottavat valansa verhokseen, harhauttaen muita pois Jumalan tieltä; nurjat ovat totisesti heidän tekonsa.",
                            "verse 63:3": "Sillä he uskoivat, mutta sitten tulivat epäuskoon, ja senvuoksi on heidän sydämensä paatunut, niin että heillä ei ole ymmärrystä.",
                            "verse 63:4": "Mutta kun katselet heitä, miellyttää heidän muotonsa, ja kun he puhuvat, kuuntelet heidän puhettaan; he ovat kuin tukipylväitä ja kuitenkin pelkäävät, että jokainen sotahuuto koskee heitä. He ovat vihollisia; varo siis heitä. Jumalan tuomio tulkoon heidän osakseen! Miksi he ovat pois kääntyneet?",
                            "verse 63:5": "Ja kun heille sanotaan: »Tulkaa, Jumalan sananjulistaja pyytää teille anteeksiantoa», he pudistavat päätänsä, ja sinä näet heidän pöyhkeinä kääntyvän pois.",
                            "verse 63:6": "Heille on yhdentekevää, pyydätkö heille anteeksiantoa vai et. Milloinkaan ei Jumala anna heille anteeksi, totisesti, Jumala ei kaitse väärintekijöitä.",
                            "verse 63:7": "He ovat niitä, jotka sanovat: »Älkää lahjoittako mitään niiden hyväksi, jotka ovat Jumalan sananjulistajan kanssa, ennenkuin he eroavat hänestä.» Jumalan ovat taivaitten ja maan aarteet, mutta teeskentelijät ovat ymmärrystä vailla.",
                            "verse 63:8": "He sanovat: »Jos me palaamme Medinaan, niin mahtavat varmasti karkoittavat sieltä alhaiset.» Jumalalle kuuluu kuitenkin kaikki mahti, samoin kuin Hänen sanansaattajalleen ja uskoville, mutta tekopyhät eivät sitä tiedä.",
                            "verse 63:9": "Te, jotka uskotte! Älkää antako rikkauksienne ja lastenne vieroittaa itseänne jumalanpelosta. Ne, jotka niin tekevät, ovat kadotuksen omia.",
                            "verse 63:10": "Jakakaa keskenänne, mitä olemme teille antanut, ennenkuin kuolema kohtaa jonkun teistä, niin ettei hän sanoisi: »Herra, jospa olisit antanut minulle vielä vähän elinaikaa, niin olisin tahtonut olla armelias ja kuulua niihin, jotka tekevät hyvää.»",
                            "verse 63:11": "Mutta Jumala ei anna armonaikaa kenellekään, jonka hetki on tullut; niin, Jumala tietää, mitä te teette."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 63:1": "Quand les hypocrites viennent à toi, ils disent : \" Nous attestons que tu es l'Envoyé de Dieu ! \" Dieu sait que tu es Son Envoyé, et Dieu atteste que les hypocrites sont des menteurs.",
                            "verse 63:2": "Ils ont pris leurs serments comme sauvegarde, mais ils se sont écartés du chemin de Dieu. Certes, ce qu'ils ont fait est détestable.",
                            "verse 63:3": "Il en est ainsi, parce qu'ils ont cru et qu'ensuite ils ont mécru. Un sceau a alors été placé sur leurs cœurs de sorte qu'ils ne savent pas raisonner.",
                            "verse 63:4": "Pourtant, lorsque tu les regardes, ils te plaisent ; s'ils parlent, tu écoutes leurs paroles ; ils sont semblables à des solives bien ancrées. Ils pensent que chaque cri est dirigé contre eux. Ce sont eux les ennemis. Prends garde à eux ! Que Dieu les tue ! Comme ils sont pervertis !",
                            "verse 63:5": "Quand on leur dit : \" Venez, l'Envoyé de Dieu demandera pardon pour vous ! \", ils détournent la tête et tu les vois s'éloigner enflés d'orgueil.",
                            "verse 63:6": "Il revient au même que tu demandes pardon pour eux ou que tu ne demandes pas pardon pour eux : Dieu ne leur pardonnera pas. Certes, Dieu ne dirige pas les pervers.",
                            "verse 63:7": "Ce sont eux qui disent : \" Ne dépensez rien pour ceux qui sont auprès de l'Envoyé de Dieu, afin qu'ils se séparent de lui \". A Dieu appartiennent les trésors des cieux et de la terre, mais les hypocrites ne savent pas raisonner.",
                            "verse 63:8": "Ils disent : \" Si nous revenions à Médine, le plus puissant de cette ville en expulserait le plus faible \". C'est à Dieu qu'appartient la puissance, ainsi qu'à son Prophète et aux croyants, mais les hypocrites ne savent pas.",
                            "verse 63:9": "O vous qui croyez, que vos richesses et vos enfants ne vous distraient pas du souvenir de Dieu ! Car ceux qui agissent ainsi sont les perdants.",
                            "verse 63:10": "Dépensez [en aumônes] une partie des biens dont Nous vous avons comblés avant que la mort n'atteigne l'un d'entre vous et qu'il ne dise : \" Mon Seigneur ! Si seulement tu m'accordais un court délai, je ferais l'aumône et je serais parmi les justes \".",
                            "verse 63:11": "Dieu n'accorde de délai à aucune âme lorsque son terme est arrivé. Dieu est parfaitement instruit de ce que vous faites."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 63:1": "Quand les hypocrites viennent à toi, ils disent : «Nous attestons que tu es certes le Messager de Dieu»; Dieu sait que tu es vraiment Son messager; et Dieu atteste que les hypocrites sont assurément des menteurs.",
                            "verse 63:2": "Ils prennent leurs serments pour bouclier et obstruent le chemin de Dieu. Quelles mauvaises choses que ce qu’ils faisaient !",
                            "verse 63:3": "C’est parce qu’en vérité ils ont cru, puis rejeté la foi. Leur coeurs donc, ont été scellés, de sorte qu’ils ne comprennent rien.",
                            "verse 63:4": "Et quand tu les vois, leurs corps t’émerveillent; et s’ils parlent, tu écoutes leur parole. ils sont comme des bûches appuyées (contre des murs) et ils pensent que chaque cri est dirigé contre eux. L’ennemi c’est eux. Prends y garde. que Dieu les extermine ! Comme les voilà détournés (du droit chemin).",
                            "verse 63:5": "Et quand on leur dit : «Venez que le Messager de Dieu implore le pardon pour vous», ils détournent leurs têtes, et tu les vois se détourner tandis qu’ils s’enflent d’orgueil.",
                            "verse 63:6": "C’est égal, pour eux, que tu implores le pardon pour eux ou que tu ne le fasses pas : Dieu ne leur pardonnera jamais, car Dieu ne guide pas les gens pervers.",
                            "verse 63:7": "Ce sont eux qui disent : «Ne dépensez point pour ceux qui sont auprès du Messager de Dieu, afin qu’ils se dispersent». Et c’est à Dieu qu’appartiennent les trésors des cieux et de la terre, mais les hypocrites ne comprennent pas.",
                            "verse 63:8": "Ils disent : «Si nous retournons à Médine, le plus puissant en fera assurément sortir le plus humble ». Or c’est à Dieu qu’est la puissance ainsi qu’à Son messager et aux croyants. Mais les hypocrites ne le savent pas.",
                            "verse 63:9": "ô vous qui avez cru ! Que ni vos biens ni vos enfants ne vous distraient du rappel de Dieu. Et quiconque fait cela... alors ceux-là seront les perdants.",
                            "verse 63:10": "Et dépensez de ce que Nous vous avons octroyé avant que la mort ne vienne à l’un de vous et qu’il dise alors : «Seigneur ! si seulement Tu m’accordais un court délai : je ferais l’aumône et serais parmi les gens de bien».",
                            "verse 63:11": "Dieu cependant n’accorde jamais de délai à une âme dont le terme est arrivé. Et Dieu est Parfaitement Connaisseur de ce que vous faites."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Wenn die Heuchler zu dir kommen, sagen sie: «Wir bezeugen, daß du in Wahrheit der Gesandte Allahs bist.» Und Allah weiß, daß du in Wahrheit Sein Gesandter bist, jedoch Allah bezeugt, daß die Heuchler gewißlich Lügner sind.",
                            "verse 63:2": "Sie haben sich aus ihren Eiden einen Schild gemacht; so machen sie abwendig vom Wege Allahs. Schlimm ist wahrlich das, was sie zu tun pflegen.",
                            "verse 63:3": "Dies, weil sie glaubten und hernach ungläubig wurden. So ist ein Siegel auf ihre Herzen gesetzt worden, also daß sie nicht verstehen.",
                            "verse 63:4": "Und wenn du sie siehst, so gefallen dir ihre Gestalten; und wenn sie sprechen, horchst du auf ihre Rede. Sie sind, als wären sie aufgerichtete Holzklötze. Sie glauben, jeder Schrei sei wider sie. Sie sind der Feind, drum hüte dich vor ihnen. Allahs Fluch über sie! Wie werden sie abgewendet!",
                            "verse 63:5": "Und wenn zu ihnen gesprochen wird: «Kommt her, der Gesandte Allahs will für euch um Verzeihung bitten», dann wenden sie ihre Köpfe zur Seite, und du siehst, wie sie sich in Hochmut abkehren.",
                            "verse 63:6": "Es ist ihnen gleich, ob du für sie um Verzeihung bittest oder nicht für sie um Verzeihung bittest. Allah wird ihnen nie verzeihen; Allah weist dem widerspenstigen Volk nicht den Weg.",
                            "verse 63:7": "Sie sind es, die sprechen: «Spendet nicht für die, die mit dem Gesandten Allahs sind, damit sie sich zerstreuen (und ihn v erlassen)», während doch die Schätze der Himmel und der Erde Allahs sind; allein die Heuchler verstehen es nicht.",
                            "verse 63:8": "Sie sprechen: «Wenn wir nach Medina zurückkehren, dann wird der Angesehenste sicherlich den Geringsten daraus vertreiben», obwohl das Ansehen nur Allah und Seinem Gesandten und den Gläubigen gebührt; allein die Heuchler wissen es nicht.",
                            "verse 63:9": "O die ihr glaubt, lasset euer Vermögen und eure Kinder euch nicht vom Gedenken an Allah abhalten. Und wer das tut - das sind die Verlierenden.",
                            "verse 63:10": "Und spendet von dem, was Wir euch gegeben haben, bevor einen von euch der Tod ereilt und er spricht: «Mein Herr! wenn Du mir nur Aufschub gewähren wolltest auf eine kleine Weile, dann würde ich Almosen geben und der Rechtschaffenen einer sein.»",
                            "verse 63:11": "Nie aber wird Allah einer Seele Aufschub gewähren, wenn ihre Frist um ist; und Allah kennt wohl, was ihr tut."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "¼,s jlwy½ tc rqEgkjs ikl equkQs+d+hu vkrs gSa rks dgrs gSa fd ge rks bd+jkj djrs gSa fd vki ;d+uhu [+kqnk ds jlwy gSa vkSj [+kqnk Hkh tkurk gS rqe ;d+huh mlds jlwy gks exj [+kqnk t+kfgj fd, nsrk gS fd ;s yksx vius ¼,rd+kn ds fygkt+ ls½ t+:j >wBs gSa",
                            "verse 63:2": "bu yksxksa us viuh d+leksa dks flij cuk j[kk gS rks ¼blh ds t+fj, ls½ yksxksa dks [+kqnk dh jkg ls jksdrs gSa cs’kd ;s yksx tks dke djrs gSa cqjs gSa",
                            "verse 63:3": "bl lcc ls fd ¼t+kfgj esa½ bZeku yk, fQj dkfQ+j gks x,] rks muds fnyksa ij ¼xks;k½ eksgj yxk nh x;h gS rks vc ;s le>rs gh ugha",
                            "verse 63:4": "vkSj tc rqe mudks ns[kksxs rks ruklqcs vkt+k dh otg ls mudk d+n o d+ker rqEgsa cgqr vPNk ekywe gksxk vkSj xq¶+rxw djsaxs rks ,slh fd rqe roTtks ls lquks ¼exj vD+y ls [k+kyh½ xks;k nhokjksa ls yxk;h gq;ha csdkj ydfM+;k¡ gSa gj ph[+k dh vkokt+ dks le>rs gSa fd mUgha ij vk iM+h ;s yksx rqEgkjs nq’eu gSa rqe muls cps jgks [+kqnk bUgsa ekj Mkys ;s dgk¡ cgds fQjrs gSa",
                            "verse 63:5": "vkSj tc muls dgk tkrk gS fd vkvks jlwyvYykg rqEgkjs okLrs ex+Qsjr dh nqvk djsa rks og yksx vius lj Qsj ysrs gSa vkSj rqe mudks ns[kksxs fd rdCcqj djrs gq, eq¡g Qsj ysrs gSa",
                            "verse 63:6": "rks rqe mudh ex+Qsjr dh nqvk ek¡xks ;k u ek¡xks muds gd+ esa cjkcj gS ¼D;ksa fd½ [+kqnk rks mUgsa gjfxt+ c[+’ksxk ugha [+kqnk rks gjfxt+ cndkjksa dks eaft+ys ed+lwn rd ugha igq¡pk;k djrk",
                            "verse 63:7": ";s ogh yksx rks gSa tks ¼vUlkj ls½ dgrs gSa fd tks ¼eqgkftjhu½ jlwys [+kqnk ds ikl jgrs gSa mu ij [+kpZ u djks ;gk¡ rd fd ;s yksx [+kqn frrj fcrj gks tk,¡ gkykWfd lkjs vkleku vkSj t+ehu ds [+kt+kus [+kqnk gh ds ikl gSa exj equkQsd+hu ugha le>rs",
                            "verse 63:8": ";s yksx rks dgrs gSa fd vxj ge ykSV dj enhus igq¡ps rks bT+t+nkj yksx ¼[+kqn½ t+yhy ¼jlwy½ dks t+:j fudky ckgj dj nsaxs gkykWfd bT+t+r rks [+kkl [+kqnk vkSj mlds jlwy vkSj eksfeuhu ds fy, gS exj equkQs+dhu ugha tkurs",
                            "verse 63:9": ",s bZekunkjksa rqEgkjs eky vkSj rqEgkjh vkSykn rqedks [+kqnk dh ;kn ls x+kfQy u djs vkSj tks ,slk djsxk rks ogh yksx ?kkVs esa jgsaxs",
                            "verse 63:10": "vkSj geus tks dqN rqEgsa fn;k gS mlesa ls d+Cy blds ¼[+kqnk dh jkg esa½ [k+pZ dj Mkyks fd rqeesa ls fdlh dh ekSr vk tk, rks ¼bldh ukScr u vk, fd½ dgus yxs fd ijojfnxkj rwus eq>s FkksM+h lh eksgyr vkSj D;ksa u nh rkfd [+kSjkr djrk vkSj usdhdkjksa ls gks tkrk",
                            "verse 63:11": "vkSj tc fdlh dh ekSr vk tkrh gS rks [+kqnk mldks gjfxt+ eksgyr ugha nsrk vkSj tks dqN rqe djrs gks [+kqnk mlls [+kcjnkj gS lwj, equkQsdw+u [+kRe"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Apabila orang-orang munafik datang kepadamu, mereka berkata: \"Kami mengakui, bahwa sesungguhnya kamu benar-benar Rasul Allah\". Dan Allah mengetahui bahwa sesungguhnya kamu benar-benar Rasul-Nya; dan Allah mengetahui bahwa sesungguhnya orang-orang munafik itu benar-benar orang pendusta.",
                            "verse 63:2": "Mereka itu menjadikan sumpah mereka sebagai perisai, lalu mereka menghalangi (manusia) dari jalan Allah. Sesungguhnya amat buruklah apa yang telah mereka kerjakan.",
                            "verse 63:3": "Yang demikian itu adalah karena bahwa sesungguhnya mereka telah beriman, kemudian menjadi kafir (lagi) lalu hati mereka dikunci mati; karena itu mereka tidak dapat mengerti.",
                            "verse 63:4": "Dan apabila kamu melihat mereka, tubuh-tubuh mereka menjadikan kamu kagum. Dan jika mereka berkata kamu mendengarkan perkataan mereka. Mereka adalah seakan-akan kayu yang tersandar. Mereka mengira bahwa tiap-tiap teriakan yang keras ditujukan kepada mereka. Mereka itulah musuh (yang sebenarnya), maka waspadalah terhadap mereka; semoga Allah membinasakan mereka. Bagaimanakah mereka sampai dipalingkan (dari kebenaran)?",
                            "verse 63:5": "Dan apabila dikatakan kepada mereka: Marilah (beriman), agar Rasulullah memintakan ampunan bagimu, mereka membuang muka mereka dan kamu lihat mereka berpaling sedang mereka menyombongkan diri.",
                            "verse 63:6": "Sama saja bagi mereka, kamu mintakan ampunan atau tidak kamu mintakan ampunan bagi mereka, Allah tidak akan mengampuni mereka; sesungguhnya Allah tidak memberi petunjuk kepada orang-orang yang fasik.",
                            "verse 63:7": "Mereka orang-orang yang mengatakan (kepada orang-orang Ansar): \"Janganlah kamu memberikan perbelanjaan kepada orang-orang (Muhajirin) yang ada di sisi Rasulullah supaya mereka bubar (meninggalkan Rasulullah)\". Padahal kepunyaan Allah-lah perbendaharaan langit dan bumi, tetapi orang-orang munafik itu tidak memahami.",
                            "verse 63:8": "Mereka berkata: \"Sesungguhnya jika kita telah kembali ke Madinah, benar-benar orang yang kuat akan mengusir orang-orang yang lemah daripadanya\". Padahal kekuatan itu hanyalah bagi Allah, bagi Rasul-Nya dan bagi orang-orang mu’min, tetapi orang-orang munafik itu tiada mengetahui.",
                            "verse 63:9": "Hai orang-orang yang beriman, janganlah harta-hartamu dan anak-anakmu melalaikan kamu dari mengingat Allah. Barangsiapa yang membuat demikian maka mereka itulah orang-orang yang rugi.",
                            "verse 63:10": "Dan belanjakanlah sebagian dari apa yang telah Kami berikan kepadamu sebelum datang kematian kepada salah seorang di antara kamu; lalu ia berkata: \"Ya Tuhanku, mengapa Engkau tidak menangguhkan (kematian) ku sampai waktu yang dekat, yang menyebabkan aku dapat bersedekah dan aku termasuk orang-orang yang saleh?\"",
                            "verse 63:11": "Dan Allah sekali-kali tidak akan menangguhkan (kematian) seseorang apabila datang waktu kematiannya. Dan Allah Maha Mengetahui apa yang kamu kerjakan."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Quando vengono a te, gli ipocriti dicono: « Attestiamo che sei veramente il Messaggero di Allah», ma Allah attesta che tu sei il Suo Messaggero e attesta, Allah, che gli ipocriti sono bugiardi.",
                            "verse 63:2": "Si fanno scudo dei loro giuramenti e hanno allontanato altri dalla via di Allah. Quant'è perverso quello che fanno!",
                            "verse 63:3": "E questo perché prima credettero, poi divennero increduli. Sul loro cuore fu quindi posto un suggello, affinché non capissero.",
                            "verse 63:4": "Quando li vedi, sei ammirato dalla loro prestanza; se parlano, ascolti le loro parole. Sono come tronchi appoggiati . Credono che ogni grido sia contro di loro. Sono essi il nemico. Stai in guardia. Li annienti Allah! Quanto si sono traviati!",
                            "verse 63:5": "E quando si dice loro: « Venite, il Messaggero di Allah implorerà il perdono per voi», voltano la testa e li vedi allontanarsi pieni di superbia.",
                            "verse 63:6": "Per loro è la stessa cosa, che tu implori perdono per loro o che non lo implori: Allah non li perdonerà mai. In verità Allah non guida gli empi.",
                            "verse 63:7": "Essi sono coloro che dicono: « Non date nulla a coloro che seguono il Messaggero di Allah, affinché si disperdano». Appartengono ad Allah i tesori dei cieli e della terra, ma gli ipocriti non lo capiscono.",
                            "verse 63:8": "Dicono: « Se ritorniamo a Medina, il più potente scaccerà il più debole» . La potenza appartiene ad Allah, al Suo Messaggero e ai credenti, ma gli ipocriti non lo sanno.",
                            "verse 63:9": "O credenti, non vi distraggano dal ricordo di Allah i vostri beni e i vostri figli. Quelli che faranno ciò saranno i perdenti.",
                            "verse 63:10": "Siate generosi di quello che Noi vi abbiamo concesso, prima che giunga a uno di voi la morte ed egli dica: «Signore, se Tu mi dessi una breve dilazione, farei l'elemosina e sarei fra i devoti».",
                            "verse 63:11": "Ma Allah non concede dilazioni a nessuno che sia giunto al termine. Allah è ben informato a proposito di quello che fate."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "偽信者たちがあなたの許にやって来ると，「わたしたちはあなたが，本当にアッラーの使徒であることを証言する。」と言う。アッラーは，あなたが確かに使徒であることを知っておられる。またアッラーは，偽信者たちが真に嘘言の徒であることを証言なされる。",
                            "verse 63:2": "かれらはその誓いを（悪行のための）隠れ場として，アッラーの道から（人びとを）妨げている。本当にかれらの行うことは，憎むべきである。",
                            "verse 63:3": "それは，かれらが一度信仰して，それから不信心になったためで，かれらの心は封じられ，そのためかれらは理解しない。",
                            "verse 63:4": "あなたがかれらを見る時，かれらの（立派な）風体に感心するであろう。かれらが語れば，あなたはその雄弁な言葉に魅せられる。だがかれらは，（何の知識もなく何を言っても分らない）壁に寄りかかっているただの材木のようなものである。かれらはどの叫びも，自分たちのことをいっていると考えている。かれらは敵である。用心しなさい。アッラーよかれらを滅ぼして下さい。何とかれらは（真理から）逸れたことよ。",
                            "verse 63:5": "かれらに向かって，「来なさい。アッラーの使徒が，あなたがたのために御赦しを祈るであろう。」と言うと，あなたはかれらが顔を背けて，微慢に背を向けて去るのを見よう。",
                            "verse 63:6": "あなたがかれらのために御赦しを祈っても，また祈らなくても，かれらにとって同じである。アッラーは，決してかれらを御赦しになられない。本当にアッラーは，（アッラーの）� に背く者を御導きになられない。",
                            "verse 63:7": "かれらはこう言うのである。「アッラーの使徒と一緒の者に，施しをしてはいけません。かれらは結局解散されるのです。」本当に天と地の宝庫はアッラーの有である。だが，偽信者たちはそれを理解しない。",
                            "verse 63:8": "かれらは，「わたしたちがアル・マディーナに帰れば，そこの高貴な者が卑しい者たちを必ずそこから追うでしょう。」と言う。凡そ栄誉は，アッラーと使徒，そしてその信者たちにある。だが偽信者たちには，これが分らない。",
                            "verse 63:9": "信仰する者よ，あなたがたの富や子女にかまけて，アッラーを念じることを疎かにしてはならない。そうする者（アッラーを念わない者）は，自らを損う者である。",
                            "verse 63:10": "死があなたがたを理う前に，われが与えたものから施しなさい。かれは，「主よ，何故あなたは暫くの間の猶予を与えられないのですか。そうすればわたしは喜捨〔サダカ〕をして，善い行いの者になりますのに。」と言う。",
                            "verse 63:11": "定められた時がやって来た時，アッラーは誰にも猶予を与えられない。アッラーは，あなたがたの行うことに通暁なされる。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "위선자들이 그대에게 이르러저희는 그대가 하나님의 선지자임을 증언하도다 라고 말하나 실로 하나님께서는 그대가 그분의 선지자임을 알고 계시며 또한 하나님 은 위선자들이 거짓하고 있는 것 도 목격하고 계시니라",
                            "verse 63:2": "그들은 그들의 맹세로 가림한후 하나님의 길에서 사람들을 벗 어나게 하매 실로 그들이 행하는 것에 사악함이 있을 것이라",
                            "verse 63:3": "그것은 그들이 믿음을 가진 후 불신하였기 때문으로 그들의 마음이 봉하여지매 그들은 이해하지 못하노라",
                            "verse 63:4": "그대가 그들을 볼 때 그들의 외형이 그대를 놀라게 할 것이며 그들이 말할 때면 그대는 그들의 화술에 기를 기울일 것이라 그러 나 그들은 벽에 기대어진 재목과 같아 그들의 모든 외침이 그들에 게 거역하고 있다고 생각하노라 그들은 적이라 그러므로 그들을 주의하라 하나님의 저주가 그들에게 있을 것이라 그들은 얼마나 진리에서 벗어나 유혹되어 있느뇨",
                            "verse 63:5": "하나님의 선지자께로 오라 그분께서 너희의 죄즐 사하여 달라 고 기도하실 때 그들은 얼굴을 돌리나니 그대는 그들이 크게 오만 하며 외면하는 것을 보리라",
                            "verse 63:6": "그대가 그들의 죄를 사하여 달라 기도하든 아니하든 그들에게는 똑같은 것으로 하나님은 그들 을 용서하지 아니할 것이니 실로 하나님은 사악한 백성들을 인도하지 아니하시노라",
                            "verse 63:7": "하나님의 선지자와 함께 있는자들이 분산할 때까지 그들에게 자선을 베풀지 말라고 말하는 자 들이 바로 그들이라 하늘과 대지 의 보물이 하나님께 있으나 위선 자들은 이해하지 못하노라",
                            "verse 63:8": "그들은 우리가 메디나로 돌아가 더 강한 자가 더 천한 자를 추방하리라고 말하더라 권능은 하 나님과 그분의 선지자와 믿는 자 들에게 있나니 위선자들은 모르고있노라",
                            "verse 63:9": "믿는 사람들이여 너희 재물과너희 자손들로 인하여 너희가 하 나님을 염원함에 벗어나서는 아니되나니 그렇게 하는 자 누구든 손실자들이라",
                            "verse 63:10": "그러므로 죽음이 너희에게 이르기 전에 하나님이 베푼 일용 할 양식으로 자선을 베풀라 그렇 지 아니하면 주여 잠시 저를 유예하여 주소서 제가 자선을 베풀어 의로운 자 중에 있겠나이다 라고 말하게 되리라",
                            "verse 63:11": "그러나 하나님은 결정한 때가 이르면 어느 누구도 유예하지 아니하시거늘 하나님은 너희가 행하는 모든 것을 아시고 계시니라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "ئه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم) کاتێك ناپاك و دووڕووه‌کان دێن بۆ لات و ده‌ڵێن: ئێمه شایه‌تی ده‌ده‌ین که تۆ پێغه‌مبه‌ری خوایت!! له‌حاڵێکدا که خوا خۆی چاك ده‌زانێت که تۆ پێغه‌مبه‌ر و فرستاده‌ی ئه‌ویت، له هه‌مان کاتدا، خوا شایه‌تی ده‌دا که ئه‌و ناپاك و دووڕووانه درۆزنن.",
                            "verse 63:2": "ئه‌وانه سوێندی درۆیان کردووه به قه‌ڵغانی خۆیان و به‌و هۆیه‌وه به‌ربه‌ستی خه‌ڵکیان کردووه له ڕێبازی خوا، به‌ڕاستی ئه‌وه‌ی ئه‌وان ده‌یانکرد، کارێکی زۆر ناپه‌سه‌ندو نابه‌جێ بوو.",
                            "verse 63:3": "ئه‌و حاڵه‌ته‌شیان بۆیه تێدا دروست بووه چونکه سه‌ره‌تا باوه‌ڕیان هێنا؛ له‌وه‌ودوا حه‌قیان پۆشی و کافر بوونه‌وه‌، به‌هۆی ئه‌وه‌وه مۆر نرا به‌سه‌ر دڵیاندا (بۆیه تێگه‌یشتن و بیروبۆچوونیان شێواوه و) له ڕاستیه‌کان تێ ناگه‌ن.",
                            "verse 63:4": "کاتێك ده‌یانبینیت سیما و له‌ش و لاریان سه‌رسامت ده‌کات، کاتێکیش دێنه قسه (ئه‌وه‌نده ده‌م بازو قسه‌زانن) ئه‌وه گوێ ده‌گرێت بۆ قسه‌یان، ده‌ڵێی داری وشکی به‌دیواردا هه‌ڵپه‌سێردراون، ئه‌وه‌نده له ترس و بیمدا ده‌ژین، هه‌ر هاوارو و بانگێك بکرێت، هه‌ر باسێك بێته پێشه‌وه‌، وه‌ده‌زانن دژی ئه‌وانه‌، ئا ئه‌وانه هه‌ر دوژمنن، که‌وابوو خۆتیان لێ بپارێزه‌، وریایان به‌، خوا بیانکوژێت و له‌ناویان به‌رێت، ئاخر بۆچی واده‌که‌ن، به‌ره‌و کوێ لادران (بۆچی باوه‌ڕی دامه‌زراو ناهێنن و له ڕێبازی ڕاست لاده‌ده‌ن).",
                            "verse 63:5": "کاتێك پێیان بوترێت وه‌رن پێغه‌مبه‌ری خوا، داوای لێخۆشبوونتا بۆ ده‌کات، سه‌ر باده‌ده‌ن و لووت به‌رزی ده‌که‌ن، ده‌یانبینیت ڕوو وه‌رده‌گێڕن و به‌رهه‌ڵستی ده‌که‌ن، له‌کاتێکدا ئه‌وانه خۆیان لا گه‌وره ده‌بێت و خۆ به‌زلزانن.",
                            "verse 63:6": "چونیه‌که بۆیان داوای لێخۆشبوونیان بۆ بکه‌یت یان نه‌یکه‌یت، هه‌رگیز خوا لێیان خۆش نابێت، چونکه به‌ڕاستی خوا ڕێنموویی قه‌ومی تاوانبارو له‌سنوور ده‌رچوو نادات.",
                            "verse 63:7": "ئه‌وانه که‌سانێکن ده‌ڵێن به خه‌ڵکی: ماڵ و سامان مه‌به‌خشن به‌و که‌سانه‌ی که له ده‌وری پێغه‌مبه‌ری خوادان، تا بڵاوه‌ی لێ بکه‌ن!! (مه‌به‌ستیان هه‌ژارانی کۆچبه‌رانه‌، ئه‌ی نازانن) هه‌رچی گه‌نجیه‌نه‌کان هه‌یه له ئاسمانه‌کان و زه‌ویدا هه‌ر خوا خاوه‌نیانه‌، به‌ڵام دووڕوه‌کان ئه‌م ڕاستیه تێناگه‌ن و له نهێنیه‌کان سه‌رده‌رناکه‌ن.",
                            "verse 63:8": "ئه‌و دووڕووانه ده‌ڵێن: سوێند به خوا ئه‌گه‌ر گه‌ڕاینه‌وه بۆ مه‌دینه (دیاره که به‌و حاڵه‌شه‌وه به‌شداری غه‌زایان کردووه‌، به ناچاری، یان بۆ ته‌ماع و ئاشووب نانه‌وه‌) ده‌بێت ئه‌وه‌ی که ده‌سه‌ڵاتدارو به‌ڕێز و پیاوماقووڵه‌، ئه‌وه ده‌ر بکات له شار که بێ ڕێزو بێ ده‌سه‌ڵاته‌، ئه دووڕووانه نازانن که‌: عیززه‌ت و ده‌سه‌ڵات و پایه‌داری هه‌ر شایسته‌ی خواو پێغه‌مبه‌ره‌که‌ی و ئیماندارانه‌.",
                            "verse 63:9": "ئه‌ی ئه‌و که‌سانه‌ی باوه‌ڕتان هێناوه‌، هه‌وڵ بده‌ن نه ماڵ و سامانتان، نه ڕۆڵه‌کانتان، نه‌بنه هۆی ئه‌وه‌ی که له‌یادی خواو به‌ده‌ستهێنانی ڕه‌زامه‌ندی ئه‌و که‌مته‌رخه‌می و بێ ئاگاتان بکه‌ن، جا هه‌رکه‌س له یادی خوا که‌م ته‌رخه‌می بکات، ئا ئه‌وانه هه‌ر خۆیان خه‌ساره‌تمه‌ندو زه‌ره‌رمه‌ندن.",
                            "verse 63:10": "له‌و ماڵ و سامان و زانستی و هێزو ده‌سه‌ڵاته‌ی که پێمان به‌خشیوون، ئێوه‌ش لێی ببه‌خشن و ده‌ستی به‌سه‌ردا مه‌گرن و قۆرخی مه‌که‌ن؛ پێش ئه‌وه‌ی که مردن یه‌خه به‌یه‌کێکتان بگرێت و بڵێت: په‌روه‌ردگارا، خۆزگه ما‌وه‌یه‌کی که‌می تر مۆڵه‌تت بدامایه تا خێرو چاکه‌م بکردایه و ماڵ و سامانم ببه‌خشیایه و بچوومایه‌ته ڕیزی چاکانه‌وه‌...",
                            "verse 63:11": "جا ئه‌و داخوازیه به‌جێ نیه‌، چونکه ڕۆژی هه‌رکه‌سێك ته‌واو بوو، کاتی مه‌رگی هه‌ر که‌سێك هات، هه‌رگیز خوا دوای ناخات و مۆڵه‌تی بۆ تازه ناکاته‌وه‌، خوایش زۆر ئاگایه به هه‌موو ئه‌و کاروکرده‌وانه‌ی که ئه‌نجامی ده‌ده‌ن."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Apabila orang-orang munafik datang kepadamu (wahai Muhammad), mereka berkata: Kami mengakui bahawa sesungguhnya engkau sebenar-benarnya Rasul Allah dan Allah sememangnya mengetahui bahawa engkau ialah RasulNya, serta Allah menyaksikan bahawa sesungguhnya pengakuan mereka adalah dusta.",
                            "verse 63:2": "Mereka menjadikan sumpahnya (atau akuannya) sebagai perisai (untuk menyelamatkan dirinya dan harta bendanya daripada dibunuh atau dirampas), lalu mereka menghalang (dirinya dan orang lain) dari menurut jalan Allah. Sesungguhnya amatlah buruk apa yang mereka telah kerjakan.",
                            "verse 63:3": "(Perbuatan buruk) yang demikian kerana mereka mengaku beriman (di hadapan orang-orang Islam) kemudian mereka tetap kafir sesama sendiri, maka dengan sebab itu dimeteraikan atas hati mereka; lalu mereka tidak dapat memahami (yang mana benar dan yang mana salah).",
                            "verse 63:4": "Dan apabila engkau melihat mereka, engkau tertarik hati kepada tubuh badan mereka (dan kelalukannya) dan apabila mereka berkata-kata, engkau juga (tertarik hati) mendengar tutur katanya (kerana manis dan fasih. Dalam pada itu) mereka adalah seperti batang-batang kayu yang tersandar (tidak terpakai kerana tidak ada padanya kekuatan yang dikehendaki). Mereka (kerana merasai bersalah, sentiasa dalam keadaan cemas sehingga) menyangka tiap-tiap jeritan (atau riuh rendah yang mereka dengar) adalah untuk membahayakan mereka. Mereka itulah musuh yang sebenar-benarnya maka berjaga-jagalah engkau terhadap mereka. Semoga Allah membinasa dan menyingkirkan mereka dari rahmatNya. (Pelik sungguh!) Bagaimana mereka dipalingkan (oleh hawa nafsunya dari kebenaran)?",
                            "verse 63:5": "Dan apabila dikatakan kepada mereka: Marilah (bertaubat) supaya Rasulullah meminta ampun (kepada Allah) untuk kamu, mereka (enggan sambil) menggeleng-gelengkan kepalanya dan engkau melihat mereka berpaling (dari bertaubat) serta mereka berlaku sombong angkuh.",
                            "verse 63:6": "(Tidak ada faedahnya) kepada mereka, samada engkau meminta ampun untuk mereka atau engkau tidak meminta ampun, Allah tidak sekali-kali akan mengampunkan mereka. Sesungguhnya Allah tidak memberi hidayat petunjuk kepada kaum yang fasik.",
                            "verse 63:7": "Merekalah yang mengatakan (kepada orang-orang Islam di Madinah yang menolong Rasulullah dan orang-orang Muhajirin): Janganlah kamu membelanjakan harta kamu kepada orang-orang yang ada bersama-sama Rasulullah supaya mereka bersurai (meninggalkannya). Padahal bagi Allah jualah perbendaharaan langit dan bumi, (tiada sesiapapun yang dapat memberi atau menyekat sebarang pemberian melainkan dengan kehendakNya); akan tetapi orang-orang yang munafik itu tidak memahami (hakikat yang sebenarnya).",
                            "verse 63:8": "Mereka berkata lagi: Demi sesungguhnya! Jika kita kembali ke Madinah (dari medan perang), sudah tentu orang-orang yang mulia lagi kuat (pihak kita) akan mengusir keluar dari Madinah orang-orang yang hina lagi lemah (pihak Islam). Padahal bagi Allah jualah kemuliaan dan kekuatan itu dan bagi RasulNya serta bagi orang-orang yang beriman; akan tetapi golongan yang munafik itu tidak mengetahui (hakikat yang sebenarnya).",
                            "verse 63:9": "Wahai orang-orang yang beriman! Janganlah kamu dilalaikan oleh (urusan) harta benda kamu dan anak-pinak kamu daripada mengingati Allah (dengan menjalankan perintahNya). Dan (ingatlah), sesiapa yang melakukan demikian, maka mereka itulah orang-orang yang rugi.",
                            "verse 63:10": "Dan belanjakanlah (dermakanlah) sebahagian dari rezeki yang Kami berikan kepada kamu sebelum seseorang dari kamu sampai ajal maut kepadanya, (kalau tidak) maka dia (pada saat itu) akan merayu dengan katanya: Wahai Tuhanku! Alangkah baiknya kalau Engkau lambatkan kedatangan ajal matiku ke suatu masa yang sedikit sahaja lagi, supaya aku dapat bersedekah dan dapat pula aku menjadi dari orang-orang yang soleh.",
                            "verse 63:11": "Dan (ingatlah), Allah tidak sekali-kali akan melambatkan kematian seseorang (atau sesuatu yang bernyawa) apabila sampai ajalnya dan Allah Amat Mendalam PengetahuanNya mengenai segala yang kamu kerjakan."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "هنگامى كه منافقان نزد تو آيند مى‏گويند: «ما شهادت مى‏دهيم كه يقينا تو رسول خدايى! س‏ذللّه خداوند مى‏داند كه تو رسول او هستى، ولى خداوند شهادت مى‏دهد كه منافقان دروغگو هستند (و به گفته خود ايمان ندارند)",
                            "verse 63:2": "آنها سوگندهايشان را سپر ساخته‏اند تا مردم را از راه خدا باز دارند، و كارهاى بسيار بدى انجام مى‏دهند!",
                            "verse 63:3": "اين بخاطر آن است كه نخست ايمان آوردند سپس كافر شدند; از اين رو بر دلهاى آنان مهر نهاده شده، و حقيقت را درك نمى‏كنند!",
                            "verse 63:4": "هنگامى كه آنها را مى‏بينى، جسم و قيافه آنان تو را در شگفتى فرو مى‏برد; و اگر سخن بگويند، به سخنانشان گوش فرا مى‏دهى; اما گويى چوبهاى خشكى هستند كه به ديوار تكيه داده شده‏اند! هر فريادى از هر جا بلند شود بر ضد خود مى‏پندارند; آنها دشمنان واقعى تو هستند، پس از آنان بر حذر باش! خداوند آنها را بكشد، چگونه از حق منحرف مى‏شوند؟!",
                            "verse 63:5": "هنگامى كه به آنان گفته شود: «بياييد تا رسول خدا براى شما استغفار كند!»، سرهاى خود را (از روى استهزا و كبر و غرور) تكان مى‏دهند; و آنها را مى‏بينى كه از سخنان تو اعراض كرده و تكبر مى‏ورزند!",
                            "verse 63:6": "براى آنها تفاوت نمى‏كند، خواه استغفار برايشان كنى يا نكنى، هرگز خداوند آنان را نمى‏بخشد; زيرا خداوند قوم فاسق را هدايت نمى‏كند!",
                            "verse 63:7": "آنها كسانى هستند كه مى‏گويند: «به افرادى كه نزد رسول خدا هستند انفاق نكنيد تا پراكنده شوند!» (غافل از اينكه) خزاين آسمانها و زمين از آن خداست، ولى منافقان نمى‏فهمند!",
                            "verse 63:8": "آنها مى‏گويند: «اگر به مدينه بازگرديم، عزيزان ذليلان را بيرون مى‏كنند!» در حالى كه عزت مخصوص خدا و رسول او و مؤمنان است; ولى منافقان نمى‏دانند!",
                            "verse 63:9": "اى كسانى كه ايمان آورده‏ايد! اموال و فرزندانتان شما را از ياد خدا غافل نكند! و كسانى كه چنين كنند، زيانكارانند!",
                            "verse 63:10": "از آنچه به شما روزى داده‏ايم انفاق كنيد، پيش از آنكه مرگ يكى از شما فرا رسد و بگويد: س‏خ‏للّهپروردگارا! چرا (مرگ) مرا مدت كمى به تاخير نينداختى تا (در راه خدا) صدقه دهم و از صالحان باشم؟!»",
                            "verse 63:11": "خداوند هرگز مرگ كسى را هنگامى كه اجلش فرا رسد به تاخير نمى‏اندازد، و خداوند به آنچه انجام مى‏دهيد آگاه است"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Quando os hipócritas se apresentam a ti, dizem: Reconhecemos que tu és o Mensageiro de Deus. Porém, Deus bem sabe que tu és o Seu Mensageiro e atesta que os hipócritas são mentirosos.",
                            "verse 63:2": "Fazem dos seus juramentos uma coberta (para as suas más ações), e desencaminham-se da senda de Deus. Que péssimo é o que fazem !",
                            "verse 63:3": "Isso porque creram e depois renegaram; consequentemente, foram sigilados os seus corações e por isso são insensatos.",
                            "verse 63:4": "E quando os vês, os seus aspectos te agradam; e quando falam escuta-lhes as palavras. Todavia, são como madeira encostada; pensam que qualquer grito é contra eles. São os inimigos; cuida-te, pois, deles. Que Deus os maldiga! Como se desencaminham!",
                            "verse 63:5": "Porém, quando lhes é dito: Vinde, que o Mensageiro de Deus implorará, para vós, o perdão!, meneiam a cabeça e os vês afastarem-se, ensoberbecidos.",
                            "verse 63:6": "Tanto se lhes dá que implores ou não o perdão para eles; Deus jamais os perdoará, porque Deus não encaminha os depravados.",
                            "verse 63:7": "São aqueles que dizem: Nada dispendais, com os que acompanham o Mensageiro de Deus, até que se dispersem. Os tesouros dos céus e da terra pertencem a Deus, embora os hipócritas continuem a ser insensatos.",
                            "verse 63:8": "Dizem: Em verdade, se voltássemos para Madina , o mais poderoso expulsaria dela o mais fraco. Porém, a potestade só pertence a Deus, ao Seu Mensageiro e aos fiéis, ainda que os hipócritas o ignorem.",
                            "verse 63:9": "Ó fiéis, que os vossos bens e os vossos filhos não vos alheiem da recordação de Deus, porque aqueles que tal fizerem, serão desventurados.",
                            "verse 63:10": "Fazei caridade de tudo com que vos agraciamos, antes que a morte surpreenda qualquer um de vós, e este diga: Ó Senhor meu, porque não me toleras até um término próximo, para que eu possa fazer caridade e ser um dos virtuosos?",
                            "verse 63:11": "Porém, Deus jamais adiará a hora de qualquer alma, quando ela chegar, porque Deus está bem inteirado de tudo quanto fazeis."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 63:1": "Când vin la tine, fãțar nicii zic: \"Mãrturisim cã tu ești Trimisul lui Allah\". Însã Allah știe cã tu ești Trimisul Sãu și Allah mãrturisește cã fãț",
                            "verse 63:2": "Ei și-au luat jurãmintele lor drept pavãzã și astfel împiedicã dela calea lui Allah . Cât de rãu este ceea ce fac ei!",
                            "verse 63:3": "Aceasta este pentru cã ei au crezut, iar apoi s-au lepãdat de credințã și inimile lor au fost pecetluite, încât ei nu mai pricep.",
                            "verse 63:4": "Dacã-i vezi, îți plac chipurile lor. Dacã vorbesc, asculți vorba lor.Dar ei sunt ca niște butuci rezemați și ei socotesc cã orice strigãteste împotriva lor . Ei sunt dușmanul! Deci",
                            "verse 63:5": "Și dacã li se zice lor \"Veniți , cãci Trimisul lui Allah se va ruga de iertare pentru voi!\", ei întorc capetele și îi vezi cum se îndepãrteazã îngâmfați .",
                            "verse 63:6": "E totuna pentru ei de te rogi de iertare pentru ei sau nu te rogi deiertare pentru ei; Allah nu le va ierta lor, cãci Allah nu cãlãuzește neamul celor ieșiți din drum.",
                            "verse 63:7": "Ei sunt aceia care zic : \"Nu-i îngrijiți pe aceia care sunt lângãTrimisul lui Allah, pânã ce ei nu se vor risipi!\" Însã ale lui Allah sunt comorile cerurilor și ale pãmântului, dar fãț",
                            "verse 63:8": "Ei zic: \"Când ne vom întoarce la Medina, cel mai puternic de acolo îl va alunga pe cel mai umil\" . Însã a lui Allah este puterea și a Trimisului Sãu și a dreptcredincioșilor, dar fãțarnicii nu știu .",
                            "verse 63:9": "O, voi cei care credeți! Sã nu vã abatã averile voastre și copiiivoștri de la pomenirea lui Allah! Cei care fac aceasta, aceia vor fi pierduți!",
                            "verse 63:10": "Și dãruiți din cele cu care v-am înzestrat Noi, înainte ca moartea sã vinã la unul dintre voi și sã zicã el: “Doamne, mai dã-mi un rãgaz pânã la un termen apropiat, astfel",
                            "verse 63:11": "Însã Allah nu va mai da rãgaz nici unui suflet, dacã a venit termenul sãu și Allah este bine știutor a ceea ce faceți ."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 63:1": "Când făţarnicii vor veni la tine, îţi vor spune: Noi mărturisim că tu eşti trimisul lui Dumnezeu!” Dumnezeu ştie că tu eşti trimisul Său., precum Dumnezeu mărturiseşte şi că făţarnicii sunt mincinoşi.",
                            "verse 63:2": "Ei şi-au luat jurămintele drept pavăză şi s-au îndepărtat de la calea lui Dumnezeu. Rău au făcut ceea ce-au făcut!",
                            "verse 63:3": "Aceasta, căci ei întâi au crezut, apoi au tăgăduit. Inimile le-au fost pecetluite, încât nu mai pricep nimic.",
                            "verse 63:4": "Când îi vezi, chipurile lor îţi plac. Când vorbesc, le asculţi vorba. Ei sunt asemenea unor grinzi împodobite! Ei socot că orice strigăt este asupra lor. Ei sunt vrăjmaşii voştri. Bagă de seamă la ei! Dumnezeu să-i dea morţii! Ei sunt de-a-ndoaselea!",
                            "verse 63:5": "Când li se spune: “Veniţi! Trimisul lui Dumnezeu va cere iertarea pentru voi”, îşi vor întoarce capul şi îi vei vedea îndepărtându-se trufaşi.",
                            "verse 63:6": "Nu le pasă dacă tu ceri iertarea pentru ei ori dacă nu ceri iertarea pentru ei! Dumnezeu nu le va ierta lor, căci Dumnezeu nu călăuzeşte poporul desfrânat.",
                            "verse 63:7": "Ei sunt cei care spun: “Nu cheltuiţi nimic pentru cei din preajma trimisului lui Dumnezeu până când nu-l părăsesc.” Comorile cerurilor şi ale pământului sunt ale lui Dumnezeu, însă cei făţarnici nu înţeleg.",
                            "verse 63:8": "Ei spun: “Dacă ne vom întoarce iar la Medina, cel puternic îl va alunga din cetate pe cel slab.” Puterea este a lui Dumnezeu, a trimisului Său şi a credincioşilor, însă cei făţarnici nu ştiu.",
                            "verse 63:9": "O, voi cei ce credeţi! Averile şi pruncii voştri să nu vă îndepărteze de la amintirea lui Dumnezeu! Cei care fac astfel, sunt cei pierduţi.",
                            "verse 63:10": "Daţi milostenie din ceea ce Noi v-am înzestrat, înainte ca moartea să vină la vreunul dintre voi, iar el să spună: “Domnul meu! Dacă mi-ai fi dat încă un răgaz, până la un soroc apropiat, aş fi dat milostenie şi aş fi fost drept.”",
                            "verse 63:11": "Dumnezeu nu va da nimănui nici un răgaz când îi va veni sorocul. Dumnezeu este Cunoscător a ceea ce faceţi."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Когда к тебе приходят лицемеры,То говорят они:«Свидетельствуем мы, что ты —посланник от Аллаха».Да, ведает Аллах, что ты —действительно Его посланник.И Он свидетельствует то,Что лицемеры, истинно, лжецы!",
                            "verse 63:2": "И свои клятвы обратили они в щит,(За коим лицемерие и ложь надежносхоронились),Тем самым совращая и других с путиАллаха, —Поистине, деяния их скверны.",
                            "verse 63:3": "И это потому,Что поначалу предались они (Аллаху).Потом же (от Аллаха) отреклись.Тогда печать легла на их сердца,И ничего они сейчас не разумеют.",
                            "verse 63:4": "Когда ты видишь их,Тебя их вид прельщает,И, когда речь они ведут,С охотою внимаешь их словам, —Они подобны приставным столбам2237,(Их совесть нечиста),И каждый вскрик2238 им кажетсявраждебным.Они — враги, и опасайся их, —Так пусть падет проклятие Аллаха!О, как обмануты они (в своихнадеждах)!",
                            "verse 63:5": "Когда им говорят:«Придите! Посланник Бога возмоли’тпрощения за вас»,Воротят головы они, и видишь ты,С какой надменностью они уходят.",
                            "verse 63:6": "Им все равно —Возмолишь ты об их прощениииль нет.Аллах им не простит, —Ведь возгордившимся невернымОн не укажет праведной стези.",
                            "verse 63:7": "Они — все те, кто говорит:«Не тратьте ничего на тех,Кто у посланника Аллаха.Тогда рассеются они (и город нашпокинут)».Но лишь Аллах сокровищами небаи земли владеет,А лицемеры этого не понимают.",
                            "verse 63:8": "И говорят они:«Коль мы вернемся в город2239,То те, кто больше чтим2240,Изгонят из него невежд».Но лишь Аллах, Его посланникИ те, кто верует в Него,Владеют (славой и) почетом,А лицемеры этого не понимают.",
                            "verse 63:9": "О вы, кто верует! Пусть вашесостояние и детиНе отвлекают вас от поминанияАллаха, —Ведь тот, кто поступает так,Поистине, несет убыток.",
                            "verse 63:10": "Из благ, что Мы вам даровали,Благотворите до того, как смертьнастигнет вас,И не придется вам сказать:«Владыка мой, коль Ты мне дашькороткую отсрочку,Я буду в милостыни щедри праведным (приду к Тебе)».",
                            "verse 63:11": "Но ни одной душе Господь не дастотсрочки,Когда придет назначенный черед.Он знает все, что делаете вы!"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Cuando los hipócritas vienen a ti, dicen: «Atestiguamos que tú eres, en verdad, el Enviado de Alá». Alá sabe que tú eres el enviado. Pero Alá es testigo de que los hipócritas mienten.",
                            "verse 63:2": "Se han escudado en sus juramentos y han desviado a otros del camino de Alá. ¡Qué mal está lo que han hecho!",
                            "verse 63:3": "Porque primero creyeron y, luego, han descreído. Sus corazones han sido sellados, así que no entienden.",
                            "verse 63:4": "Cuando se les ve, se admira su presencia. Si dicen algo, se escucha lo que dicen. Son como maderos apoyados. Creen que todo grito va dirigido contra ellos. Son ellos el enemigo. ¡Ten, pues, cuidado con ellos! ¡Que Alá les maldiga! ¡Cómo pueden ser tan desviados!",
                            "verse 63:5": "Cuando se les dice: «¡Venid, que el Enviado de Alá pedirá perdon por vosotros!», vuelven la cabeza y se les ve retirarse altivamente.",
                            "verse 63:6": "Da lo mismo que pidas o no que se les perdone. Alá no les perdonará. Alá no dirige a la gente perversa.",
                            "verse 63:7": "Son ellos los que dicen: «No gastéis nada en favor de los que están con el Enviado de Alá; así, se escaparán de él». Los tesoros de los cielos y de la tierra pertenecen a Alá, pero los hipócritas no comprenden.",
                            "verse 63:8": "Dicen: «Si volvemos a la ciudad, los más poderosos, sin duda, expulsarán de ella a los más débiles». Pero el poder pertenece a Alá, a Su Enviado y a los creyentes. Los hipócritas, empero, no saben.",
                            "verse 63:9": "¡Creyentes! Que ni vuestra hacienda ni vuestros hijos os distraigan del recuerdo de Alá. Quienes eso hacen, son los que pierden.",
                            "verse 63:10": "Gastad de lo que os hemos proveído, antes de que la muerte venga a uno de vosotros y éste diga: «¡Señor! ¿Por qué no me das algo más de tiempo, para que dé limosna y sea de los justos?».",
                            "verse 63:11": "Cuando le vence a uno su plazo, Alá no le concede prórroga. Alá está bien informado de lo que hacéis."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "\"(நபியே!) முனாஃபிக்குகள் (நயவஞ்சகர்கள்) உம்மிடம் வந்து, \"நிச்சயமாக, நீர் அல்லாஹ்வின் தூதராக இருக்கின்றீர்\" என்று நாங்கள் சாட்சி சொல்கிறோம்\" என்று கூறுகின்றனர். மேலும், அல்லாஹ், \"நிச்சயமாக நீர் அவனுடைய தூதராக இருக்கின்றீர்\" என்பதை நன்கு அறிவான். ஆனால், அல்லாஹ், நிச்சயமாக முனாஃபிக்குகள் (வஞ்சகமாகப்) பொய்யுரைப்பவர்கள்\" என்பதாகச் சாட்சி சொல்கிறான்.",
                            "verse 63:2": "இவர்கள் தங்களுடைய (பொய்ச்)சத்தியங்களைக் கேடயமாக வைத்துக் கொண்டு அல்லாஹ்வின் பாதையிலிருந்து (மக்களைத்) தடுத்தும் வருகின்றனர், நிச்சயமாக இவர்கள் செய்து கொண்டிருப்பது மிகவும் கெட்டது.",
                            "verse 63:3": "இது நிச்சயமாக இவர்கள் ஈமான் கொண்டு பின் காஃபிர் ஆகி விட்டதனாலேயாகும், ஆகவே இவர்களின் இதயங்கள் மீது முத்திரையிடப்பட்டு விட்டது, எனவே, அவர்கள் விளங்கிக் கொள்ள மாட்டார்கள்.",
                            "verse 63:4": "இவர்களை நீர் பார்த்தால், இவர்களுடைய உடல் (அமைப்பு)கள் உம்மை ஆச்சரியப்படுத்தும்; அன்றியும் இவர்கள் பேசினால், இவர்களுடைய பேச்சை நீர் (கவனித்துக்) கேட்பீர்; எனினும் இவர்கள் (நேர்மையானவர்கள் அல்லர், சுவரில்) சாய்த்து வைக்கப்பட்ட மரங்கள் போன்று இருக்கின்றனர், ஒவ்வொரு சப்தமும் தங்களுக்கு எதிரானது என்று எண்ணுகிறார்கள், இவர்கள்தாம் (உம்) பகைவர்கள், ஆகவே இவர்களிடம் நீர் எச்சரிக்கையாக இருப்பீராக, அல்லாஹ் இவர்களை அழித்து விடுவான், இவர்கள் (சத்தியத்திலிருந்து) எங்கு செல்கின்றனர்?",
                            "verse 63:5": "இன்னும், \"வாருங்கள்; அல்லாஹ்வின் தூதர் உங்களுக்காக (இறைவனிடம்) பாவமன்னிப்புத் தேடுவார் என்று இவர்களிடம் கூறப்பட்டால், இவர்கள் தங்கள் தலைகளைச் சாய்த்துக் கொண்டு, பெருமை கொண்டவர்களாகத் திருப்பிச் செல்வதை நீர் காண்பீர்.",
                            "verse 63:6": "அவர்களுக்காக நீர் பாவமன்னிப்புக் கோரினாலும் அல்லது பாவமன்னிப்புக் கோராவிட்டாலும் அவர்களுக்குச் சமமேயாகும், அல்லாஹ் அவர்களுக்குப் பாவமன்னிப்பளிக்க மாட்டான் - பாவம் செய்யும் சமூகத்தாரை நிச்சயமாக அல்லாஹ் நேர்வழியில் செலுத்த மாட்டான்.",
                            "verse 63:7": "இவர்கள் தாம், அல்லாஹ்வின் தூதருடன் இருப்பவர்கள், (அவரை விட்டுப்) பிரிந்து செல்லும் வரை அவர்களுக்காக நீங்கள் செலவு செய்யாதீர்கள்\" என்று கூறியவர்கள், வானங்களிலும், பூமியிலுமுள்ள பொக்கிஷங்கள் அல்லாஹ்வுக்கே சொந்தமானவை, ஆனால் இந்நயவஞ்சகர்கள் (அதை) உணர்ந்து கொள்ளமாட்டார்கள்.",
                            "verse 63:8": "நாங்கள் அல்மதீனாவுக்குத் திரும்புவோமானால், கண்ணியமானவர்கள் தாழ்ந்தவர்களை அதிலிருந்து நிச்சயமாக வெளியேற்றிவிடுவார்கள்\" என்று அவர்கள் கூறுகின்றனர், ஆனால் கண்ணியம் அல்லாஹ்வுக்கும், அவனுடைய தூதருக்கும், முஃமின்களுக்குமே உரியது, எனினும், இந்நயவஞ்சர்கள் (அதை) அறிந்து கொள்ளமாட்டார்கள்.",
                            "verse 63:9": "ஈமான் கொண்டவர்களே! உங்கள் செல்வமும், உங்களுடைய மக்களும், அல்லாஹ்வின் நினைப்பை விட்டும் உங்களைப் பராமுகமாக்கிவிட வேண்டாம் - எவர் இவ்வாறு செய்கிறாரோ நிச்சயமாக அவர்கள்தாம் நஷ்டமடைந்தவர்கள்.",
                            "verse 63:10": "உங்களில் ஒருவருக்கு மரணம் வருமுன்னரே, நாம் உங்களுக்கு அளித்த பொருளிலிருந்து, தான தர்மம் செய்து கொள்ளுங்கள், (அவ்வாறு செய்யாது மரணிக்கும் சமயம்); \"என் இறைவனே! என் தவணையை எனக்கு சிறிது பிற்படுத்தக் கூடாதா? அப்படியாயின் நானும் தான தர்மம் செய்து ஸாலிஹான (நல்ல)வர்களில் ஒருவனாக ஆகிவிடுவேனே\" என்று கூறுவான்.",
                            "verse 63:11": "ஆனால், அல்லாஹ், எந்த ஆத்மாவுக்கும் அதன் தவணை வந்துவிட்டால் (அதனைப்) பிற்படுத்த மாட்டான் - நீங்கள் செய்பவற்றை அல்லாஹ் நன்கு தெரிந்தே இருக்கின்றான்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "เมื่อพวกสับปลับ (มุนาฟิกูน) มาหาเจ้า พวกเขากล่าวว่า เราขอปฏิญาณว่า แท้จริงท่านเป็นร่อซู้ลของอัลลอฮ์ แต่อัลลอฮ์ทรงรู้ดียิ่งว่า แท้จริงเจ้านั้นเป็นร่อซู้ลของพระองค์อย่างแน่นอน และอัลลอฮ์ทรงเป็นพยานว่า แท้จริงพวกมุนาฟิกีนนั้นเป็นผู้กล่าวเท็จอย่างแน่นอน",
                            "verse 63:2": "พวกเขาได้ถือเอาการสาบานของพวกเขาเป็นโล่แล้วกีดกันจากทางของอัลลอฮ์ แท้จริงพวกเขานั้นสิ่งที่พวกเขาได้กระทำไปนั้นช่างชั่วช้าจริง ๆ",
                            "verse 63:3": "นั่นเป็นเพราะพวกเขาศรัทธาแล้วก็ปฏิเสธศรัทธา ดังนั้นจึงถูกผนึกบนหัวใจของพวกเขาแล้วพวกเขาก็ไม่เข้าใจ",
                            "verse 63:4": "และเมื่อเจ้าได้เห็นพวกเขาแล้ว ร่างกายของพวกเขาจะเป็นที่พึงพอใจแก่เจ้า และหากพวกเขาพูด เจ้าก็จะฟังคำพูดของพวกเขา ประหนึ่งว่าพวกเขาเป็นท่อนไม้ที่ถูกยันไว้ พวกเขาคิดว่า ทุก ๆ เสียงร้องนั้นเป็นปฏิปักษ์ต่อพวกเขา พวกเขาคือศัตรู ดังนั้นจงระวังพวกเขา ขออัลลอฮ์ทรงให้ความอัปยศแก่พวกเขา ทำไมเล่าพวกเขาจึงหันเหออกไปทางอื่น",
                            "verse 63:5": "และเมื่อได้มีเสียงกล่าวแก่พวกเขาว่า จงมาเถิดร่อซู้ลของอัลลอฮ์ จงขออภัยโทษให้แก่พวกท่าน พวกเขาก็หันศีรษะของพวกเขาไปอีกทางหนึ่ง และเจ้าเห็นพวกเขาผินหลังออกไปทั้ง ๆ ที่พวกเขาเป็นผู้หยิ่งผยอง",
                            "verse 63:6": "มีผลเท่ากันแก่พวกเขาที่เจ้าจะขออภัยโทษแก่พวกเขาหรือไม่ขออภัยโทษให้แก่พวกเขาก็ตาม อัลลอฮ์จะไม่ทรงอภัยโทษให้แก่พวกเขา แท้จริงอัลลอฮ์จะไม่ทรงชี้แนะทางแก่หมู่ชนผู้ฝ่าฝืน",
                            "verse 63:7": "พวกเขาคือผู้ที่กล่าวว่า อย่าบริจาคให้แก่ผู้ที่อยู่กับร่อซู้ลของอัลลอฮ์ เพื่อพวกเขาจะได้แยกย้ายออกไป แต่ขุมคลังแห่งชั้นฟ้าทั้งหลายและแผ่นดินนั้นเป็นของอัลลอฮ์ แต่ว่าพวกมุนาฟิกีนไม่เข้า",
                            "verse 63:8": "พวกเขากล่าวว่า ถ้าเรากลับไปยังนครมะดีนะฮ์ พวกที่มีเกียรติกว่าจะขับไล่พวกที่ต่ำต้อยออกจากนครมะดีนะฮ์ ส่วนอำนาจนั้นเป็นของอัลลอฮ์และร่อซู้ลของพระองค์และบรรดาผู้ศรัทธา แต่ว่าพวกมุนาฟิกีนนั้นหารู้ไม่",
                            "verse 63:9": "โอ้บรรดาผู้ศรัทธาเอ๋ย อย่าให้ทรัพย์สินของพวกเจ้าและลูกหลานของพวกเจ้าหันเหพวกเจ้าจากการรำลึกถึงอัลลอฮ์ และผู้ใดกระทำเช่นนั้น ชนเหล่านั้นคือพวกที่ขาดทุน",
                            "verse 63:10": "และจงบริจาคจากสิ่งที่เราได้ให้ปัจจัยยังชีพพแก่พวกเจ้าก่อนที่ความตายจะเกิดขึ้นแก่ผู้ใดในหมู่พวกเจ้า แล้วเขาก็จะกล่าวว่า ข้าแต่พระเจ้าของข้าพระองค์ มาตรว่าพระองค์ท่านทรงผ่อนผันให้แก่ข้าพระองค์อีกชั่วเวลาเพียงเล็กน้อย เพื่อที่ข้าพระองค์จะได้บริจาค และข้าพระองค์ก็จะอยู่ในหมู่คนดีทั้งหลาย (ผู้ทรงคุณธรรม)",
                            "verse 63:11": "แต่อัลลอฮ์จะไม่ทรงผ่อนผันให้แก่ชีวิตใดเมื่อกำหนดของมันได้มาถึงแล้ว และอัลลอฮ์นั้นทรงรู้ดียิ่งในสิ่งที่พวกเจ้ากระทำ"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 63:1": "Мунофиқлар ҳузурингга келганларида, гувоҳлик берамизки, сен, албатта, Аллоҳнинг Расулисан, дерлар. Ҳолбуки, Аллоҳ албатта сен Унинг Расули эканингни биладир. Ва Аллоҳ гувоҳли берурки, албатта, мунофиқлар ёлғончидирлар.",
                            "verse 63:2": "Улар қасамларини қалқон қилиб олдилар ва (одамларни) Аллоҳнинг йўлидан бурдилар. Бас, албатта, уларнинг қилган ишлари ёмон бўлди!",
                            "verse 63:3": "Бунга сабаб шуки, улар иймон келтирдилар, сўнг кофир бўлдилар, бас, қалбларига муҳр босилди. Энди улар фаҳмламаслар.",
                            "verse 63:4": "Ва агар уларни кўрсанг, жисмлари сени ажаблантирур ва агар гапирсалар, гапларига қулоқ осурсан. Улар худди суяб қуйилган ходага ўхшарлар. Ҳар қичқириқни зиддиларига ҳисоблайдилар. Улар душмандирлар. Улардан ҳазир бўл. Аллоҳ уларга уруш очсин, ҳақдан қандоқ ўгирилурлар. (Бу оятда Аллоҳ таоло мунофиқларнинг баъзи сифатлари ва тасарруфларини мўминлар улардан эҳтиёт бўлишлари учун баён қилмоқда. Чунки мунофиқларнинг ичида чиройли юзли, келишган гавдали, сўзга уста кишилар бор. Бундай қараганда, келишган, туппа-тузук одамлар, гаплари ҳам кишиларни ром қиладиган. Масалан, мунофиқларнинг ўша пайтдаги раҳбари Абдуллоҳ ибн Убай қоматли, чиройли ва сўзламол одам эди. Бошқа мунофиқлардан ҳам унга ўхшашлари бор эди. Пайғамбар алайҳиссаломнинг мажлисларига келиб, деворга суяниб ўтирар эдилар. Саҳобалар уларнинг қоматларига ҳавас билан боқишар, гапларига қулоқ солар эдилар. Лекин барибир қалблари иймондан, яхшиликдан холи бўлгани учун Аллоҳ таоло уларни деворга суяб қўйган ходага ўхшатмоқда.)",
                            "verse 63:5": "Ва агар уларга: «Келинглар, Аллоҳнинг Расули сизларга истиғфор айтадир», дейилса, улар бошларини чайқарлар. Ва уларни мутакаббирлик ҳолида юз ўгираётганларини кўрарсан.",
                            "verse 63:6": "Уларга истиғфор айтасанми ёки айтмайсанми-улар учун бари бир. Аллоҳ уларни ҳеч мағфират қилмас. Зеро, Аллоҳ фосиқ қавмларни ҳидоятга бошламас. (Истиғфор айтиш - гуноҳнинг кечишини Аллоҳдан сўраш. Суранинг нозил бўлиши ҳақидаги ривоятларда келишича, мунофиқларнинг раҳбари Абдуллоҳ ибн Убайнинг ёлғончилиги фош бўлгандан сўнг кишилар унга: «Энди Расулуллоҳнинг ҳузурларига бориб узр сўра, у киши сенинг гуноҳларингни кечишини сўраб Аллоҳга дуо қилсалар, гуноҳларинг мағфират қилинса ажаб эмас», дейишганда, мутакаббирлик билан бош чайқаб, бормаган экан. Лекин оятнинг ҳукми ҳамма мунофиқлар учун бир.)",
                            "verse 63:7": "Улар, Расулуллоҳнинг ҳузуридагиларга нафақа берманглар, токи тарқаб кетсинлар, дерлар. Ҳолбуки, осмонлару ернинг хазиналари Аллоҳникидир. Ва лекин мунофиқлар тушунмаслар.",
                            "verse 63:8": "Улар, агар Мадинага қайтиб борсак, албатта азиз хорни ундан чиқарур, дерлар. Ҳолбуки, азизлик Аллоҳга, Унинг Расулига ва мўминларига хосдир. Лекин мунофиқлар билмаслар. (Ушбу ояти карима мунофиқлар бошлиғининг Пайғамбар алайҳиссаломни Мадинадан хорларча қувиб чиқараман, деб қилган дўқ-пўписасига раддия беради. «Мадинага қайтиб борсак», дейилгандан мурод Мусталақ қавмига қарши ғазотдан қайтиб Мадина шаҳрига борсак, деганидир. Бундан кўриниб турибдики, мунофиқлар қарши турли жабҳа ва услубларни, шу жумладан, маҳаллийчиликни ҳам ишга соладилар.)",
                            "verse 63:9": "Эй иймон келтирганлар. Молларингиз ва болаларингиз сизни Аллоҳнинг зикридан чалғитмасин. Ким шундай қилса, бас, ана ўшалар ютқазувчилардир.",
                            "verse 63:10": "Ва бирингизга ўлим келиб: «Эй Роббим, агар менинг ўлимимни яқин муддатга орқага сурсанг, бас, садақа қилиб солиҳлардан бўлсам», демасдан аввал Биз сизларга ризқ қилиб берган нарсалардан нафақа қилинг. (Ризқнинг асосий манбаи Аллоҳнинг Ўзидир ва У одамларга Ўзи хоҳлаганича бериб қўйган ва унинг нафақа, хайр-эҳсон қилиб туришга буюрган. Албатта, бу иш ўлим келишидан аввал бўлиши шарт. Соғ-саломатликда, ҳамма нарсага қодирлик пайтда хайр-эҳсон қилса, ўрнига тушади.)",
                            "verse 63:11": "Аллоҳ ажали келган жонни ҳеч-ҳеч орқага сурмас. Зеро, Аллоҳ нима қилаётганингиздан хабардордир. (Оқил киши бошига ўлим келмасидан хайрли ишларни кўпроқ қилиб қолишга интилади ва шундай бўлиши ҳам лозим. Чунки Аллоҳ таоло ҳар бир гапу ишдан хабардор зотдир.)"
                        }
                    }
                }
            }
        }
    }
}