{
    "id": 67,
    "name_simple": "Al-Mulk",
    "revelation_place": "makkah",
    "revelation_order": 77,
    "bismillah_pre": true,
    "verses_count": 30,
    "short_text": "The Surah takes its name al-Mulk from the very first sentence.",
    "text": [
        "\n",
        "The Surah takes its name al-Mulk from the very first sentence.",
        "\n",
        "Period of Revelation",
        "\n",
        "It could not be known from any authentic tradition when this Surah was revealed, but the subject matter and the style indicate that it is one of the earliest Surahs to be revealed at Makkah.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "In this surah, on the one hand, the teachings of Islam have been introduced briefly, and, on the other, the people living in heedlessness have been aroused from their slumber in a most effective way. A characteristic of the earliest surahs of the Makkan period is that they present the entire teachings of Islam and the object of the Holy Prophet's mission, not in detail, but briefly, so that they are assimilated by the people easily. Moreover, they are particularly directed to make the people shun heedlessness, to make them think, and to arouse their dormant conscience.",
        "\n",
        "In the first five verses man has been made to realize that the universe in which he lives is a most well organized and fortified Kingdom in which he cannot detect any fault, any weakness or flaw, how ever hard he may try to probe. This Kingdom has been brought from nothing into existence by Allah Almighty Himself and All the powers of controlling, administering and ruling it are also entirely in Allah's hand and His power is infinite. Besides, man has also been told that in this wise system he has not been created without a purpose, but he has been sent here for a test and in this test he can succeed only by his righteous deeds and conduct.",
        "\n",
        "In vv. 6-11, dreadful consequences of disbelief which will appear in the Hereafter have been mentioned, and the people told that Allah, by sending His Prophets, has warned them of these consequences in this very world, as if to say \"Now, if you do not believe in what the Prophets say and correct your attitude and behavior accordingly, in the Hereafter you will yourself have to admit that you really deserved the punishment that was being meted out to you.\"",
        "\n",
        "In vv. 12-15, the truth that has been impressed on the minds is that the Creator cannot be unaware of His creation, as if to say: \"He is aware of each open and hidden secret of yours, even of the innermost ideas of your hearts. Hence, the right basis of morality is that man should avoid evil, fearing the accountability of the unseen God, whether in the world there is a power to take him to task for this or not, and whether in the world there is a possibility of being harmed by such a power or not. Those who adopt such a conduct in the world alone will deserve forgiveness and a rich reward in the Hereafter.\"",
        "\n",
        "In vv. 15-23, making allusions, one after the other to those common truths of daily occurrence, which man does not regard as worthy of much attention, he has been invited to consider them seriously. It has been said: \"Look: the earth on which you move about with full satisfaction and peace of mind, and from which you obtain your sustenance has been subdued for you by Allah; otherwise this earth might at any time start shaking suddenly so as to cause your destruction, or a typhoon might occur, which may annihilate you completely. Look at the birds that fly above you; it is only Allah Who is sustaining them in the air. Look at your own means and resources: if Allah wills to inflict you with a scourge, none can save you from it; and if Allah wills to close the doors of sustenance on you, none can open them for you. These things are there to make you aware of the truth, but you see them like animals, which are unable to draw conclusions from observations, and you do not use your\r\nsight, hearing and minds which Allah has bestowed on you as men; that is why you do not see the right way.\"",
        "\n",
        "In vv. 24-27, it has been said: \"You have ultimately to appear before your God in any case. It is not for the Prophet to tell you the exact time and date of the event. His only duty is to warn you beforehand of its inevitable occurrence. Today you do not listen to him and demand that he should cause the event to occur and appear prematurely before you; but when it does occur, and you see it with your own eyes, you will then be astounded. Then, it will be said to you \"This is the very thing you were calling to be hastened.\"",
        "\n",
        "In vv. 28-29 replies have been given to what the disbelievers of Makkah said against the Holy Prophet (upon whom be peace) and his Companions. They cursed the Holy Prophet and prayed for his and the believers destruction. To this it has been said: \"Whether those who call you to the right way are destroyed, or shown mercy by Allah, how will their fate change your destiny? You should look after yourselves and consider who would save you if you were overtaken by the scourge of God?You regard those who believe in God and put their trust in Him as the misguided. A time will come when it will become evident as to who was misguided in actual truth.",
        "\n",
        "In conclusion, the people have been asked this question and left to ponder over it \"If the water which has come out from the earth at some place in the desert or hill country of Arabia and upon which depends your whole life activity, should sink and vanish underground, who beside Allah can restore to you this life giving water?\"",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that opens with the statement “Blessed is He in whose hands is all sovereignty”. It takes its name from Divine sovereignty (mulk) mentioned in verse 1. The surah challenges the disbelievers with declarations of God’s total power over them, and everything else, in this world and the next. It describes the regret the disbelievers will express on the Day of Resurrection (verse 9 . and verse 27).The surah is also known as: Control, The Dominion, The Kingdom.",
    "name_translation": "Sovereignty",
    "name_complex": "Al-Mulk",
    "surah_name_ar": "الملك",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 67:1": "Eshtë i lartësuar Ai, në dorën e të cilit është pushteti dhe Ai është i pushtetshëm për çdo gjë! –",
                            "verse 67:2": "Ai i cili ka krijur jetën dhe vdekjen, për t’ju provuar se kush prej jush vepron më mirë; - Ai është i Plotëfuqishëm dhe falës.",
                            "verse 67:3": "Ai, i cili, i ka krijuar shtatë qiej njërin mbi tjetrin, - ti nuk vëren në krijesat e Mëshiruesit kurrfarë disharmonie, dhe shiko edhe një ehrë a mos po sheh ndonjë plasaritje,",
                            "verse 67:4": "pastaj shiko përsëri shumë herë, shikimi do të kthehet i lodhur dhe i molisuar.",
                            "verse 67:5": "Na, juve ua kemi zbukuruar qiellin më të afërm me yje të shkëlqyeshme dhe kemi bërë që (zjarri i tyre) t’i gjuajë djajtë, për të cilët kemi përgatitur dënimin me zjarr.",
                            "verse 67:6": "Kurse, për ata që nuk besojnë në Zotin e tyre, dënimi është skëterra; e sa i shëmtuar është ai vendbanim!",
                            "verse 67:7": "Kur të hudhen në të, do të dëgjohet psherëtima e tyre, e zjarri do të ndizet furishëm,",
                            "verse 67:8": "gati për të eksploduar nga ashpërsia. Kurdo që të hedhet në të ndonjë grup (jobesimtarësh), - rojtarët e skëterrës i pyesin ata: “A nuk u erdhi askush t’ua tërheq vërejtjen juve?”",
                            "verse 67:9": "“Po”, përgjigjen ata, gjithsesi na ka ardhur neve përkujtuesi, por ne i kemi mohuar ata dhe kemi thënë: “Perëndia nuk ka shpallur asgjë, ju jeni në humbje të madhe!”",
                            "verse 67:10": "Ata (jobesimtarët), thonë: “Sikur të kishim dëgjuar ose menduar, nuk do të gjendeshim midis banorëve të skëterrës!”",
                            "verse 67:11": "Dhe, ata e pranuan mëkatin e tyre. Larg qofshin prej mëshirës së Zotit banorët e skëterrës!",
                            "verse 67:12": "Me të vërtetë, ata që i frikohen Zotit të tyre edhe atëherë kur nuk i sheh askush, për ta ka falje dhe shpërblim të madh!",
                            "verse 67:13": "Flitni ju fshehtas ose haptas, por Ai, me të vërtetë, di çka në zemrat tuaja!",
                            "verse 67:14": "E si mos t’i dijë Ai, i cili ka krijuar çdo gjë dhe është i informuar hollësisht.",
                            "verse 67:15": "Ai ju ka bërë Tokën të nënshtruar – të shërbyeshme, andaj ecni nëpër viset e saj dhe ushqehuni me atë që ju ka dhënë Ai. Ju (pasi të ringjalleni), do të ktheheni tek Ai.",
                            "verse 67:16": "A jeni ju të sigurtë se Ai që është (Sundues) në qiell, nuk do t’ju fusë në tokë, kur ajo fillon të dridhet papritmas?",
                            "verse 67:17": "Ose, a jeni të sigurtë se Ai që është (Sundues) në qiell, nuk do t’ju çojë furtunë gurësh? Atëherë do të dini se çfarë është vërejtja Ime!",
                            "verse 67:18": "Me të vërtetë, i kanë konsideruar gënjeshtarë ata që kanë qenë përpara këtyre. E sa i ashpër ka qenë dënimi (pezmi) Im!",
                            "verse 67:19": "A thua nuk po i shohin ata shpendët mbi kokat e tyre, se si fluturojnë, duke i hapur dhe mbledhur krahët? Askush nuk i mbanë ata, përveç Zotit Mëshirues; Ai, me të vërtetë, sheh çdo gjë.",
                            "verse 67:20": "Ose, kush është ai që do të jetë ushtria e juaj, që t’u ndihmojë juve, përveç Mëshiruesit? Jobesimtarët janë vetëm në mashtrim, (s’ka ushtarë për ju).",
                            "verse 67:21": "Kush janë ata që ju furnizojnë, në qoftë se Ai (Perëndia) e ndalon furnizimin? – Por, ata janë zhytur në të këqia dhe në arrati (nga e vërteta).",
                            "verse 67:22": "Eshtë më mirë ai që shkon rrëshqanas e kokëulur, apo ai që në rrugën e drejtë ecën vertikalisht e ballëlartë?",
                            "verse 67:23": "Thuaj: “Ai është që ju ka krijur dhe u ka dhënë të dëgjuarit, të pamurit dhe zemrat (mendjen), kurse ju pak falenderoni!”",
                            "verse 67:24": "Thuaj: “Ai ju ka krijuar të shpërndarë nëpër Tokë dhe para Tij do të tuboheni (për llogari)”.",
                            "verse 67:25": "E ata thonë: “Kur është ky premtim (caktojeni), nëse thoni të vërtetën?!”",
                            "verse 67:26": "Thuaj: “Vetëm Zoti e di (kohën), kurse unë jam vetëm paralajmërues i qartë”.",
                            "verse 67:27": "Kur për së afërmi e panë dënimin, u zymtuan fytyrat e atyre që nuk kanë besuar dhe do t’u thuhet: “Qe, kjo është ajo që e keni kërkuar (shpejtimin e dënimit)!”",
                            "verse 67:28": "Thuaj: “C’menoni ju, në qoftë se Perëndia më shkatërron mua dhe ata që janë me mua, ose na mëshiron; kush është ai që do t’i mbrojë jobesimtarët nga dënimi i padurueshëm?”",
                            "verse 67:29": "Thuaj: “Ai është Mëshiruesi, (që na shpëton neve), në Atë besojmë dhe në Atë mbështetemi, e ju sigurisht do ta dini se kush është i humbur plotësisht”.",
                            "verse 67:30": "Thuaj: “Cka mendoni, nëse ujërat tuaja ju shterren – kush do t’u sjell juve ujin rrjedhës?”"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Hökm (hər şeyin ixtiyarı) əlində olan Allah nə qədər ucadır (nə qədər uludur). O, hər şeyə qadirdir!",
                            "verse 67:2": "Hansınızın əməlcə daha gözəl olduğunu sınamaq (bəlli etmək) üçün ölümü və həyatı yaradan Odur. O, yenilməz qüvvət sahibidir, (çox) bağışlayandır.",
                            "verse 67:3": "Yeddi göyü (bir-birinin üstündə) qat-qat yaradan da Odur. (Ey insan!) Sən Rəhmanın yaratdığında heç bir uyğunsuzluq görməzsən. Bir gözünü qaldırıb (səmaya) bax, heç orada bir yarıq (çatdaq, nöqsan) görə bilərsənmi?!",
                            "verse 67:4": "Sonra gözünü qaldırıb iki dəfə bax. Göz orada (axtardığını tapmayıb) zəif, yorğun düşərək yenə də sənə tərəf qayıdacaqdır!",
                            "verse 67:5": "And olsun ki, Biz dünya səmasını (yerə ən yaxın olan göyü) qəndillərlə (ulduzlarla) bəzədik, onları şeytanlara atılan mərmilər etdik və onlar (şeytanlar) üçün yandırıb-yaxan alovlu atəş əzabı hazırladıq.",
                            "verse 67:6": "Rəbbini inkar edənləri cəhənnəm əzabı gözləyir. Ora necə də pis məskəndir!",
                            "verse 67:7": "Onlar (özləri kimi kafirlərlə) qaynayan Cəhənnəmə atıldıqları zaman onun dəhşətli uğultusunu eşidəcəklər!",
                            "verse 67:8": "O, (kafirlərə olan) qeyzindən az qala parça-parça olsun. Hər hansı bir tayfa ora (Cəhənnəmə) atıldıqca onun gözətçiləri onlardan (məzəmmətlə): \"Məgər sizə (Allahın əzabı ilə) qorxudan bir peyğəmbər gəlməmişdimi?\" - deyə soruşacaqlar.",
                            "verse 67:9": "Onlar deyəcəklər: \"Bəli, bizə (Allahın əzabı ilə) qorxudan peyğəmbər gəlmişdi. Amma biz (onu) yalançı sayıb demişdik: \"Allah heç bir şey (vəhy) nazil etməmişdir. Siz sadəcə olaraq (haqdan) çox azmısınız!\"",
                            "verse 67:10": "Onlar: \"Əgər biz (peyğəmbərlərin öyüd-nəsihətinə) qulaq asıb ağlımızı başımıza yığsaydıq, cəhənnəm əhli içində olmazdıq!\" - deyəcək,",
                            "verse 67:11": "Və beləcə öz günahlarını e'tiraf edəcəklər. Məhv olsun cəhənnəm əhli!",
                            "verse 67:12": "Rəbbindən (Onu) görmədən qorxanları isə (günahlardan) bağışlanma və böyük bir mükafat gözləyir!",
                            "verse 67:13": "(Ey insanlar!) İstər sözünüzü gizli saxlayın, istər açıq deyin (heç bir fərqi yoxdur). (Allah) ürəklərdə olanları biləndir!",
                            "verse 67:14": "Məgər yaradan (sizin gizli saxladığınız hər şeyi) bilməzmi?! O, (hər şeyi) incəliyinə qədər biləndir, (hər şeydən) xəbərdardır!",
                            "verse 67:15": "Yeri (Yer kürəsini) sizə ram edən Odur. Onun qoynunda gəzin, (Allahın) ruzisindən yeyin. Axır dönüş də Onadır!",
                            "verse 67:16": "(Ey insanlar!) Göydə olanın (Allahın) yer hərəkətə gəlib çalxalandığı zaman sizi onun dibinə batırmayacağına əminsinizmi?!",
                            "verse 67:17": "Yaxud göydə olanın sizin üstünüzə daş yağdıran bir yel göndərməyəcəyinə arxayınsınızmı?! Onda Mənim (sizi əzabla) qorxutmağımın necə olduğunu mütləq biləcəksiniz.",
                            "verse 67:18": "Onlardan (Məkkə mürşiklərindən) əvvəlkilər də (öz peyğəmbərlərini) təkzib etmişdilər. (Ya Peyğəmbər! Bir görəydin) Mənim onları cəzalandırmağım (inkar etməyim) necə oldu.",
                            "verse 67:19": "Məgər onlar başları üstündə (səf çəkib) qanad çalaraq (qanadlarını açıb-yumaraq) uçan quşları görmürlərmi? Onları (göydə) ancaq Rəhman (olan Allah) saxlayır. Həqiqətən, O, hər şeyi görəndir!",
                            "verse 67:20": "Yaxud bu əsgərləriniz (köməkçiləriniz) kimdir ki, onlar sizi Rəhmanın əzabından qurtara bilsinlər?! (Bəndələri Allahın əzabından Onun ?zündən başqa heç kəs xilas edə bilməz!) Kafirlər, sadəcə olaraq, aldanmaqdadırlar!",
                            "verse 67:21": "Əgər (Allah) ?z ruzisini kəssə, sizə kim ruzi verə bilər?! Xeyr onlar (cahillikləri üzündən) dikbaşlıqdan və (haqqa) nifrət etməkdən (boyun qoymamaqdan) əl çəkmirlər.",
                            "verse 67:22": "Elə isə (küfrü ucbatından) üzüstə sürünən daha haqq yoldadır, yoxsa düz yolda düz gedən?!",
                            "verse 67:23": "(Ya Peyğəmbər!) De: \"Sizi yoxdan yaradan, sizə qulaq, göz və qəlb verən Odur. (Allahın ne'mətlərinə) nə az şükür edirsiniz!\"",
                            "verse 67:24": "De: \"Sizi yer üzünə yayıb səpələyən Odur. (Qiyamət günü) Onun hüzuruna toplanacaqsınız!\"",
                            "verse 67:25": "Onlar (müşriklər) deyirlər: \"Əgər doğru danışanlardansınızsa, (bir xəbər verin görək) bu və'd (haqq-hesab, cəza) nə vaxt yerinə yetəcəkdir?\"",
                            "verse 67:26": "De: \"Onu bilmək yalnız Allaha məxsusdur. Mən isə ancaq (sizi Allahın əzabı ilə) açıq-aşkar qorxudan bir peyğəmbərəm!\"",
                            "verse 67:27": "Kafirlər əzabın yaxınlaşdığını gördükləri zaman üzləri eybəcər kökə düşəcək (qaralacaq) və onlara: \"Sizin (dünyada) istədiyiniz (və həmişə istehza edib inanmadığınız) əzab budur!\" - deyiləcəkdir.",
                            "verse 67:28": "(Ya Peyğəmbər! Bu müşriklərə) de: \"Bir deyin görək, istər Allah məni və mənimlə birlikdə olanları məhv etsin, istərsə də bizə bir mərhəmət əta etsin; siz kafirləri şiddətli əzabdan (Allahın əzabından) kim qurtara bilər?! (Biz ölsək də, qalsaq da, bu sizə heç bir fayda verməz. Allahın əzabından nicat tapmaq üçün ancaq Onun haqq dininə iman gətirmək lazımdır!)",
                            "verse 67:29": "De: \"O bizim iman gətirdiyimiz və təvəkkül etdiyimiz Rəhmandır. Kimin (haqq yoldan) açıq-aydın azmış olduğunu (tezliklə) biləcəksiniz!\"",
                            "verse 67:30": "De: \"Bir söyləyin görək, əgər suyunuz çəkilib (yerin dibinə) getsə, (Allahdan başqa) kim sizə axar su gətirə bilər?!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Uzvišen je Onaj u čijoj je ruci vlast - On sve može! -",
                            "verse 67:2": "Onaj koji je dao smrt i život da bi iskušao koji od vas će bolje postupati; -",
                            "verse 67:3": "Onaj koji je sedam nebesa jedna iznad drugih stvorio - ti u onome što Milostivi stvara ne vidiš nikakva nesklada, pa ponovo pogledaj vidiš li ikakav nedostatak,",
                            "verse 67:4": "zatim ponovo više puta pogledaj, pogled će ti se vratiti klonuo i umoran.",
                            "verse 67:5": "Mi smo vama najbliže nebo sjajnim zvijezdama ukrasili i učinili da vatra iz njih pogađa šejtane, za koje smo patnju u ognju pripremili.",
                            "verse 67:6": "A za one koji ne vjeruju u Gospodara svoga kazna je Džehennem, užasno je ono boravište!",
                            "verse 67:7": "Kad budu u nj bačeni, pucketanje njegovo će čuti, i on će ključati,",
                            "verse 67:8": "gotovo da se od bijesa raspadne. Kad god se koja gomila u nj baci, stražari u njemu će je upitati: \"Zar nije niko dolazio da vas opominje?\"",
                            "verse 67:9": "Jest, dolazio nam je onaj koji nas je opominjao - odgovoriće -",
                            "verse 67:10": "I reći će: \"Da smo slušali ili razmišljali, ne bismo među stanovnicima Džehennema bili!\"",
                            "verse 67:11": "I oni će priznati da su bili nevjernici - pa, stanovnici Džehennema ognjenog daleko bili!\"",
                            "verse 67:12": "Onima koji se Gospodara svoga boje i kad ih niko ne vidi - oprost i nagrada velika!",
                            "verse 67:13": "Govorili vi tiho ili glasno - pa, On, sigurno, zna svačije misli!",
                            "verse 67:14": "A kako i ne bi znao Onaj koji stvara, Onaj koji sve potanko zna, koji je o svemu obaviješten.",
                            "verse 67:15": "On vam je Zemlju pogodnom učinio, pa hodajte predjelima njezinim i hranite se onim što On daje, Njemu ćete poslije oživljenja odgovarati.",
                            "verse 67:16": "Jeste li sigurni da vas Onaj koji nebesima vlada neće u Zemlju utjerati, kad se ona počne iznenada tresti?",
                            "verse 67:17": "Ili, jeste li sigurni da Onaj koji nebesima vlada na vas neće vjetar s kamenjem poslati? Tada biste saznali kakva je prijetnja Moja!",
                            "verse 67:18": "A poricali su i oni prije njih, pa kakva je samo bila kazna Moja!",
                            "verse 67:19": "Zar oni ne vide ptice iznad sebe kako raširenih krila lete, a i skupljaju ih? Samo ih Milostivi drži; On, zaista, sve dobro vidi.",
                            "verse 67:20": "Ili ko je taj koji će biti vojska vaša i vama pomoći, osim Milostivog? - Nevjernici su samo obmanuti.",
                            "verse 67:21": "Ili, ko je taj koji će vas nahraniti, ako On hranu Svoju uskrati? - Ali, oni su uporni u bahatosti i u bježanju od istine.",
                            "verse 67:22": "Da li je na ispravnijem putu onaj koji se idući spotiče ili onaj koji Pravim putem uspravno ide?",
                            "verse 67:23": "Reci:\"On sve stvara i daje vam sluh i vid i pameti, a vi se malo zahvaljujete!\"",
                            "verse 67:24": "Reci:\"On vas je po Zemlji razasuo i pred Njim ćete se sakupiti.\"",
                            "verse 67:25": "A oni govore:\"Kad će već jednom ta prijetnja, ako istinu govorite?!\"",
                            "verse 67:26": "Reci:\"Sam Allah zna! A ja sam dužan samo da javno opominjem.\"",
                            "verse 67:27": "Kad je izbliza ugledaju, jad će prekriti lica onih koji nisu vjerovali i biće rečeno:\"Evo, ovo je ono što ste požurivali!\"",
                            "verse 67:28": "Reci:\"Kažite vi meni: ako Allah pošalje smrt meni i onima koji su sa mnom, ili ako nam se smiluje, ko će nevjernike od neizdržljive patnje zaštititi?\"",
                            "verse 67:29": "Reci:\"On je Milostivi, u Njega vjerujemo i na Njega se oslanjamo, a vi ćete, sigurno, saznati ko je u očitoj zabludi.\"",
                            "verse 67:30": "Reci:\"Šta mislite, ako vam vode presuše - ko će vam tekuću vodu dati?\""
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "পূণ্যময় তিনি, যাঁর হাতে রাজত্ব। তিনি সবকিছুর উপর সর্বশক্তিমান।",
                            "verse 67:2": "যিনি সৃষ্টি করেছেন মরণ ও জীবন, যাতে তোমাদেরকে পরীক্ষা করেন-কে তোমাদের মধ্যে কর্মে শ্রেষ্ঠ? তিনি পরাক্রমশালী, ক্ষমাময়।",
                            "verse 67:3": "তিনি সপ্ত আকাশ স্তরে স্তরে সৃষ্টি করেছেন। তুমি করুণাময় আল্লাহ তা’আলার সৃষ্টিতে কোন তফাত দেখতে পাবে না। আবার দৃষ্টিফেরাও; কোন ফাটল দেখতে পাও কি?",
                            "verse 67:4": "অতঃপর তুমি বার বার তাকিয়ে দেখ-তোমার দৃষ্টি ব্যর্থ ও পরিশ্রান্ত হয়ে তোমার দিকে ফিরে আসবে।",
                            "verse 67:5": "আমি সর্বনিম্ন আকাশকে প্রদীপমালা দ্বারা সুসজ্জত করেছি; সেগুলোকে শয়তানদের জন্যে ক্ষেপণাস্ত্রবৎ করেছি এবং প্রস্তুত করে রেখেছি তাদের জন্যে জলন্ত অগ্নির শাস্তি।",
                            "verse 67:6": "যারা তাদের পালনকর্তাকে অস্বীকার করেছে তাদের জন্যে রয়েছে জাহান্নামের শাস্তি। সেটা কতই না নিকৃষ্ট স্থান।",
                            "verse 67:7": "যখন তারা তথায় নিক্ষিপ্ত হবে, তখন তার উৎক্ষিপ্ত গর্জন শুনতে পাবে।",
                            "verse 67:8": "ক্রোধে জাহান্নাম যেন ফেটে পড়বে। যখনই তাতে কোন সম্প্রদায় নিক্ষিপ্ত হবে তখন তাদেরকে তার সিপাহীরা জিজ্ঞাসা করবে। তোমাদের কাছে কি কোন সতর্ককারী আগমন করেনি?",
                            "verse 67:9": "তারা বলবেঃ হ্যাঁ আমাদের কাছে সতর্ককারী আগমন করেছিল, অতঃপর আমরা মিথ্যারোপ করেছিলাম এবং বলেছিলামঃ আল্লাহ তা’আলা কোন কিছু নাজিল করেননি। তোমরা মহাবিভ্রান্তিতে পড়ে রয়েছ।",
                            "verse 67:10": "তারা আরও বলবেঃ যদি আমরা শুনতাম অথবা বুদ্ধি খাটাতাম, তবে আমরা জাহান্নামবাসীদের মধ্যে থাকতাম না।",
                            "verse 67:11": "অতঃপর তারা তাদের অপরাধ স্বীকার করবে। জাহান্নামীরা দূর হোক।",
                            "verse 67:12": "নিশ্চয় যারা তাদের পালনকর্তাকে না দেখে ভয় করে, তাদের জন্যে রয়েছে ক্ষমা ও মহাপুরস্কার।",
                            "verse 67:13": "তোমরা তোমাদের কথা গোপনে বল অথবা প্রকাশ্যে বল, তিনি তো অন্তরের বিষয়াদি সম্পর্কে সম্যক অবগত।",
                            "verse 67:14": "যিনি সৃষ্টি করেছেন, তিনি কি করে জানবেন না? তিনি সূক্ষ্নজ্ঞানী, সম্যক জ্ঞাত।",
                            "verse 67:15": "তিনি তোমাদের জন্যে পৃথিবীকে সুগম করেছেন, অতএব, তোমরা তার কাঁধে বিচরণ কর এবং তাঁর দেয়া রিযিক আহার কর। তাঁরই কাছে পুনরুজ্জীবন হবে।",
                            "verse 67:16": "তোমরা কি ভাবনামুক্ত হয়ে গেছ যে, আকাশে যিনি আছেন তিনি তোমাদেরকে ভূগর্ভে বিলীন করে দেবেন, অতঃপর তা কাঁপতে থাকবে।",
                            "verse 67:17": "না তোমরা নিশ্চিন্ত হয়ে গেছ যে, আকাশে যিনি আছেন, তিনি তোমাদের উপর প্রস্তর বৃষ্টি বর্ষণ করবেন, অতঃপর তোমরা জানতে পারবে কেমন ছিল আমার সতর্কবাণী।",
                            "verse 67:18": "তাদের পূর্ববর্তীরা মিথ্যারোপ করেছিল, অতঃপর কত কঠোর হয়েছিল আমার অস্বীকৃতি।",
                            "verse 67:19": "তারা কি লক্ষ্য করে না, তাদের মাথার উপর উড়ন্ত পক্ষীকুলের প্রতি পাখা বিস্তারকারী ও পাখা সংকোচনকারী? রহমান আল্লাহ-ই তাদেরকে স্থির রাখেন। তিনি সর্ব-বিষয় দেখেন।",
                            "verse 67:20": "রহমান আল্লাহ তা’আলা ব্যতীত তোমাদের কোন সৈন্য আছে কি, যে তোমাদেরকে সাহায্য করবে? কাফেররা বিভ্রান্তিতেই পতিত আছে।",
                            "verse 67:21": "তিনি যদি রিযিক বন্ধ করে দেন, তবে কে আছে, যে তোমাদেরকে রিযিক দিবে বরং তারা অবাধ্যতা ও বিমুখতায় ডুবে রয়েছে।",
                            "verse 67:22": "যে ব্যক্তি উপুড় হয়ে মুখে ভর দিয়ে চলে, সে-ই কি সৎ পথে চলে, না সে ব্যক্তি যে সোজা হয়ে সরলপথে চলে?",
                            "verse 67:23": "বলুন, তিনিই তোমাদেরকে সৃষ্টি করেছেন এবং দিয়েছেন কর্ণ, চক্ষু ও অন্তর। তোমরা অল্পই কৃতজ্ঞতা প্রকাশ কর।",
                            "verse 67:24": "বলুন, তিনিই তোমাদেরকে পৃথিবীতে বিস্তৃত করেছেন এবং তাঁরই কাছে তোমরা সমবেত হবে।",
                            "verse 67:25": "কাফেররা বলেঃ এই প্রতিশ্রুতি কবে হবে, যদি তোমরা সত্যবাদী হও?",
                            "verse 67:26": "বলুন, এর জ্ঞান আল্লাহ তা’আলার কাছেই আছে। আমি তো কেবল প্রকাশ্য সতর্ককারী।",
                            "verse 67:27": "যখন তারা সেই প্রতিশ্রুতিকে আসন্ন দেখবে তখন কাফেরদের মুখমন্ডল মলিন হয়ে পড়বে এবং বলা হবেঃ এটাই তো তোমরা চাইতে।",
                            "verse 67:28": "বলুন, তোমরা কি ভেবে দেখেছ-যদি আল্লাহ তা’আলা আমাকে ও আমার সংগীদেরকে ধ্বংস করেন অথবা আমাদের প্রতি দয়া করেন, তবে কাফেরদেরকে কে যন্ত্রণাদায়ক শাস্তি থেকে রক্ষা করবে?",
                            "verse 67:29": "বলুন, তিনি পরম করুণাময়, আমরা তাতে বিশ্বাস রাখি এবং তাঁরই উপর ভরসা করি। সত্ত্বরই তোমরা জানতে পারবে, কে প্রকাশ্য পথ-ভ্রষ্টতায় আছে।",
                            "verse 67:30": "বলুন, তোমরা ভেবে দেখেছ কি, যদি তোমাদের পানি ভূগর্ভের গভীরে চলে যায়, তবে কে তোমাদেরকে সরবরাহ করবে পানির স্রোতধারা?"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 67:1": "Благословен е Онзи, в Чиято Ръка е Владението. Той над всяко нещо има сила.",
                            "verse 67:2": "Той е, Който сътвори смъртта и живота, за да ви изпита кой от вас е по-добър в делата. Той е Всемогъщия, Опрощаващия,",
                            "verse 67:3": "Който сътвори седем небеса на слоеве. Не ще видиш несъразмерност в творението на Всемилостивия. Пак обърни взор! Нима виждаш пукнатини?",
                            "verse 67:4": "После пак обърни взор веднъж и още веднъж. Взорът ще се върне към теб безсилен и морен.",
                            "verse 67:5": "И украсихме най-близкото небе със светилници, и ги сторихме да бъдат камъни за сатаните. И приготвихме за тях мъчението на Пламъците.",
                            "verse 67:6": "За онези, които не вярват в своя Господ, е мъчението на Ада. И как лоша е тази участ!",
                            "verse 67:7": "Когато бъдат хвърлени там, ще чуят неговия рев, както ври,",
                            "verse 67:8": "едва не избухва от ярост. Всякога, щом в него бъде хвърлена тълпа, стражите му ги питат: Не дойде ли при вас предупредител?",
                            "verse 67:9": "Ще казват: Да, наистина, дойде при нас предупредител, но [го] взехме за лъжец и казахме: Аллах нищо не е низпослал. Вие сте в голяма заблуда.",
                            "verse 67:10": "И ще кажат: Ако се бяхме вслушали или размислили, нямаше да сме сред обитателите на Пламъците.",
                            "verse 67:11": "И така ще признаят своя грях. Гибел за обитателите на Пламъците!",
                            "verse 67:12": "За онези, които и в уединение се боят от своя Господ, наистина има опрощение и голяма награда.",
                            "verse 67:13": "Тайно или открито да изричате думите си, Той знае съкровеното в сърцата.",
                            "verse 67:14": "Нима Онзи, Който е сътворил, не знае? Той е Всепроникващия, Сведущия.",
                            "verse 67:15": "Той е, Който подчини за вас земята, затова ходете из нейните краища и яжте от Неговото препитание! Към Него е възкресението.",
                            "verse 67:16": "Нима имате сигурност, че Онзи, Който е на небето, не ще накара земята да ви погълне? И ето я - тресе се!",
                            "verse 67:17": "Или имате сигурност, че Онзи, Който е на небето, не ще изпрати срещу вас ураган от камъни, та да разберете какво е Моето предупреждение?",
                            "verse 67:18": "И онези преди тях отричаха. А какво бе Моето наказание!",
                            "verse 67:19": "Не виждат ли те птиците над тях, разтварящи и свиващи криле? Държи ги само Всемилостивия. Той съзира всяко нещо.",
                            "verse 67:20": "И кое ваше войнство ще ви помогне без Всемилостивия? Неверниците само се мамят.",
                            "verse 67:21": "Или кой може препитание да ви даде, ако Той задържи Своето препитание? Ала упорстват в надменността и отдалечаването [от истината].",
                            "verse 67:22": "Нима онзи, който върви с наведена глава, е по-напътен от онзи, който върви изправен по правия път?",
                            "verse 67:23": "Кажи [о, Мухаммад]: Той е, Който ви сътвори и създаде за вас слуха и зрението, и сърцата. Колко малко сте признателни!",
                            "verse 67:24": "Кажи: Той е, Който ви намножи по земята и при Него ще бъдете събрани.",
                            "verse 67:25": "И казват: Кога [ще се сбъдне] това обещание, ако говорите истината?",
                            "verse 67:26": "Кажи: Знанието е само при Аллах, а аз съм само явен предупредител.",
                            "verse 67:27": "И когато го видят отблизо, лицата на неверниците ще помръкнат и ще им бъде казано: Това е, което търсехте.",
                            "verse 67:28": "Кажи: Виждате ли? Дори Аллах да погуби мен и тези с мен, или да ни пощади, кой ще защити неверниците от болезненото мъчение?",
                            "verse 67:29": "Кажи: Той е Всемилостивия. Вярваме в Него и на Него се уповаваме. И ще узнаете кой е в явна заблуда.",
                            "verse 67:30": "Кажи: Виждате ли? Ако водата ви потъне, кой ще ви даде изворна вода?"
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "多福哉擁有主權者！他對於萬事是全能的。",
                            "verse 67:2": "他曾創造了死生，以便他考驗你們誰的作為是最優美的。他是萬能的，是至赦的。",
                            "verse 67:3": "他創造了七層天，你在至仁主的所造物中，不能看出一點參差。你再看看！你究竟能看出甚麼缺陷呢？",
                            "verse 67:4": "然後你再看兩次，你的眼睛將昏花地、疲倦地轉回來！",
                            "verse 67:5": "我確已以眾星點綴最近的天，並以眾星供惡魔們猜測。我已為他們預備火獄的刑罰。",
                            "verse 67:6": "不信主的人們將受火獄的刑罰，那歸宿真惡劣！",
                            "verse 67:7": "當他們被投入火獄的時候，他們將聽見沸騰的火獄發出驢鳴般的聲音。",
                            "verse 67:8": "火獄幾乎為憤怒而破碎，每有一群人被投入其中，管火獄的天神們就對他們說：「難道沒有任何警告者降臨你們嗎？」",
                            "verse 67:9": "他們說：「不然！警告者確已降臨我們了，但我們否認他們，我們說：『真主沒有降示甚麼，你們只在重大的迷誤中。』」",
                            "verse 67:10": "他們說：「假若我們能聽從，或能明理，我們必不致淪於火獄的居民之列！」",
                            "verse 67:11": "他們承認他們的罪過。讓火獄的居民遠離真主的慈恩！",
                            "verse 67:12": "在秘密中畏懼主的人們，將蒙赦宥和重大的報酬。",
                            "verse 67:13": "你們可以隱匿你們的言語；也可以把它說出來。他確是全知心事的。",
                            "verse 67:14": "創造者既是玄妙而且徹知的，難道他不知道你們所隱匿的言語嗎？",
                            "verse 67:15": "他為你們而使大地平穩，你們應當在大地的各方行走，應當吃他的給養，你們復活後，只歸於他。",
                            "verse 67:16": "難道你們不怕在天上的主使大地在震蕩的時候吞咽你們嗎？",
                            "verse 67:17": "道你們不怕在天上的主使飛沙走石的暴風摧毀你們嗎？你們將知道我的警告是怎樣的。",
                            "verse 67:18": "在他們之前逝去的人們，確已否認眾使者，我的譴責是怎樣的？",
                            "verse 67:19": "道他們沒有看見在他們的上面展翅和歛翼的眾鳥嗎？只有至仁主維持它們，他確是明察萬物的。",
                            "verse 67:20": "除了真主援助你們外，還有誰能做你們的援軍呢？你們只陷於自欺之中。",
                            "verse 67:21": "誰能供給你們呢？如果至仁主扣留他的給養。不然，他們固執著驕傲和勃逆。",
                            "verse 67:22": "究竟誰更能獲得引導呢？是匍匐而行的人呢？還是在正路上挺身而行的人呢？",
                            "verse 67:23": "你說：「他是創造你們，並為你們創造耳、目和心的。你們卻很少感謝。」",
                            "verse 67:24": "你說：「他是使你們繁殖於大地上的，你們將來要被集合到他那裡。」",
                            "verse 67:25": "他們說：「這個警告甚麼時候實現呢？如果你們是誠實的人。」",
                            "verse 67:26": "你說：「關於此事的知識，只在主那裡，我只是一個坦率的警告者。」",
                            "verse 67:27": "當他們看見這應許臨近的時候，不信的人們的面目將變成黑的！或者將說：「這就是你們生前妄言不會實現的事。」",
                            "verse 67:28": "你說：「你們告訴我吧，如果真主毀滅我，和我的同道，或憐憫我們，那末，誰使不信道的人們得免於痛苦的刑罰呢？」",
                            "verse 67:29": "你說：「他是至仁主，我們已信仰他，我們只信賴他。你們將知道誰在明顯的迷誤中。」",
                            "verse 67:30": "你說：「你們告訴我吧，如果你們的水一旦滲漏了，誰能給你們一條流水呢？」"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Požehnán buď ten, v jehož rukou je království a jenž všemocný je nad každou věcí,",
                            "verse 67:2": "jenž stvořil smrt i život, aby vyzkoušel, kdo z vás bude v skutcích nejlepší - a On mocný je i odpouštějící -",
                            "verse 67:3": "jenž stvořil sedm nebes ve vrstvách. A nespatříš ve stvoření Milosrdného nesouměrnost žádnou! Pozvedni jen zrak svůj, zda uvidíš trhlinu nějakou!",
                            "verse 67:4": "A potom obrať svůj zrak ještě dvakrát, a pohled tvůj se k tobě navrátí ponížen a vyčerpán námahou marnou.",
                            "verse 67:5": "My věru jsme ozdobili nejbližší nebe svítilnami, jež určili jsme i pro satanů kamenováni, a připravili jsme pro ně trest plamenný.",
                            "verse 67:6": "Těm, kdož neuvěřili v Pána svého, náleží trest pekelný a jak hnusný je to cíl konečný!",
                            "verse 67:7": "A až tam vrháni budou, uslyší řev jeho, vřením vydávaný,",
                            "verse 67:8": "a div že nevybuchne zuřivostí. A pokaždé když doň jedna skupina bude házena, zeptají se strážci jeho: \"Což nepřišel k vám varovatel žádný?\"",
                            "verse 67:9": "A odpovědí: \"Ano, přišel k nám varovatel, ale za lháře jsme jej prohlásili a řekli: \"Bůh vůbec nic neseslal a vy jste jenom ve velkém bludu!\"",
                            "verse 67:10": "A dodají: \"Kdybychom byli naslouchali či pochopili, nebyli bychom dnes věru plamene obyvateli!\"",
                            "verse 67:11": "Svou vinu tedy doznali - pryč s plamene obyvateli!",
                            "verse 67:12": "Těm, kdo bojí se Pána svého kvůli nepoznatelnému, těm věru dostane se odpuštění i převeliké odměny.",
                            "verse 67:13": "Utajujte si řeči své či dávejte je najevo co skryto je v hrudích, On dobře ví!",
                            "verse 67:14": "Což nezná On ty, které stvořil, On, jenž prozíravý je a dobře zpravený?",
                            "verse 67:15": "On je ten, jenž pro vás zemi pokornou učinil; choďte po zádech jejích a jezte z toho, co vám uštědřil a u Něho bude pak vzkříšeni.",
                            "verse 67:16": "Jste si jisti tím, že ten, kdo na nebi dlí, vás nedá pohltit zemí? Hle, ona se již chví!",
                            "verse 67:17": "Jste si jisti tím, že ten, kdo na nebi dlí, na vás nepošle vichřici plnou kamení? Pak poznáte, co znamená Mé varování!",
                            "verse 67:18": "Již ti, kdo před nimi byli, posly za lháře prohlásili. A jaká byla Má nevole?",
                            "verse 67:19": "Což neviděli ptactvo nad sebou, jak křídla roztahuje a skládá? Nikdo krom Milosrdného je nedrží a On jasně všechny věci zří.",
                            "verse 67:20": "A kdo je ten, jenž pro vás vojskem je, aby vám pomohl, leda Milosrdný? Však nevěřící jsou jen v zaslepení.",
                            "verse 67:21": "A kdo je ten, jenž obživu vaši vám uštědří, jestliže On štědrost svou zadrží? Však naopak oni setrvávají ve vzpurnosti a odmítání!",
                            "verse 67:22": "Což ten, jenž klopýtá padaje na tvář svou, je veden lépe než ten, kdo vzpřímeně po stezce přímé kráčí?",
                            "verse 67:23": "Rci: \"On je ten, kdo vzniknout vám dal a daroval vám sluch, zrak i srdce - a jak málo jste vděčni!\"",
                            "verse 67:24": "Rci: \"On je ten, kdo rozšířil vás po zemi - a k Němu budete shromážděni.\"",
                            "verse 67:25": "A ptají se: \"A kdy se tento slib splní, jste-li pravdomluvní?\"",
                            "verse 67:26": "Odpověz: \"Vědomost o tom je u Boha jedině - já jsem jen varovatel zjevný.\"",
                            "verse 67:27": "A až zblízka trest uvidí, naplní se tváře těch, kdož nevěřili, hrůzou; a bude jim řečeno: \"Tohle je to, co jste požadovali!\"",
                            "verse 67:28": "Rci: \"Co si myslíte? A ať již Bůh mě zahubí spolu s těmi, kdož se mnou jsou, anebo se nad námi slituje, kdo potom ochrání nevěřící před trestem bolestným?\"",
                            "verse 67:29": "Rci: \"On je Milosrdný; uvěřili jsme v Něho a spoléháme na Něho. A záhy se dozvíte, kdo vlastně v bludu zjevném se nalézá!\"",
                            "verse 67:30": "Rci: \"Co si myslíte? Kdyby se jednou zrána vody vaše v hloubce ztratily, kdo tedy, ne-li Bůh, vodu pramenitou vám dá?\""
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Gezegend is Hij in Wiens hand het Koninkrijk is en Die macht heeft over alle dingen.",
                            "verse 67:2": "Die de dood en het leven heeft ingesteld, opdat Hij u moge beproeven wie onder u zich het beste gedraagt; en Hij is de Almachtige, de Vergevensgezinde.",
                            "verse 67:3": "Hij Die de zeven hemelen opeenvolgend heeft geschapen. Gij kunt geen tekort zien in de schepping van de Barmhartige. Kijk dan nog eens; ziet gij een enkel gebrek?",
                            "verse 67:4": "Kijk dan weer eens en dan nog eens, uw blik zal vermoeid en verzwakt tot u terugkeren.",
                            "verse 67:5": "En voorwaar, Wij hebben de naastbije hemel met lampen versierd, Wij hebben hem tot een middel gemaakt om de satans te verdrijven en voor hen hebben Wij de straf van het razende Vuur bereid.",
                            "verse 67:6": "En voor degenen die niet in hun Heer geloven is de straf der hel (bereid), en dit is een slechte bestemming.",
                            "verse 67:7": "Wanneer zij er in worden geworpen, zullen zij haar van woede horen zieden.",
                            "verse 67:8": "Zij zal bijna barsten van woede. Telkens als een groep er in geworpen wordt, zullen de bewakers er van (der hel) hun vragen: \"Kwam er geen waarschuwer tot u?\"",
                            "verse 67:9": "Zij zullen zeggen: \"Zeker, de waarschuwer kwam tot ons, maar wij verwierpen hem, en zeiden: \"God heeft niets geopenbaard; gij verkeert slechts in grote dwaling.\"",
                            "verse 67:10": "En zij zullen zeggen: \"Indien wij maar geluisterd hadden en ons verstand hadden gebruikt, zouden wij ons niet onder de bewonerg van het laaiende Vuur bevinden.\"",
                            "verse 67:11": "Dan zullen zij hun zonden bekennen; maar de bewoners van het Vuur zijn verre (van genade).",
                            "verse 67:12": "Waarlijk, degenen die hun Heer in het verborgene vrezen, zullen vergiffenis en een grote beloning ontvangen.",
                            "verse 67:13": "Hetzij gij uw woorden verbergt of openbaar maakt, Hij weet, wat in (uw) binnenste is.",
                            "verse 67:14": "Zou Hij Die schiep niet alles weten? Hij is Aldoordringend, Alkennend.",
                            "verse 67:15": "Hij is het Die de aarde aan u onderworpen heeft; wandelt dus op haar paden en geniet van haar gaven. En tot Hem zal de Opstanding zijn.",
                            "verse 67:16": "Voelt gij u veilig voor Hem Die in de Hemel is, dat Hij u niet zal doen verzwelgen als de aarde plotseling begint te schudden?",
                            "verse 67:17": "Voelt gij u veilig voor Hem Die in de Hemel is, dat Hij niet tegen u een orkaan zal zenden? Dan zult gij weten, hoe (mijn) waarschuwing was.",
                            "verse 67:18": "En voorzeker loochenden zij die vóór u waren ook (de boodschap). Hoe (ernstig) was dan Mijn afkeuring!",
                            "verse 67:19": "Hebben zij de vogelen niet boven hun (hoofden) gezien, die hun vleugels uitspreiden en in- eenvouwen? Niemand behalve de Barmhartige houdt ze tegen, waarlijk, Hij ziet alle dingen.",
                            "verse 67:20": "Waar is uw leger dat u buiten God om zou kunnen helpen? De ongelovigen zijn omhuld door bedrog.",
                            "verse 67:21": "Of wie is er die voor u wil zorgen indien Hij Zijn voorziening terughoudt? Neen, zij volharden in opstandigheid en afkerigheid.",
                            "verse 67:22": "Is hij die gebogen loopt, beter geleid of hij die rechtop het rechte pad bewandelt?",
                            "verse 67:23": "Zeg: \"Hij is het, Die u schiep, en u oren, ogen en hart gaf; weinig dank betuigt gij er voor.\"",
                            "verse 67:24": "Zeg: \"Hij is het Die u vermenigvuldigt op aarde en tot Hem zult gij bijeen verzameld worden.\"",
                            "verse 67:25": "En zij zeggen: \"Wanneer zal deze belofte vervuld worden, als gij de waarheid spreekt?\"",
                            "verse 67:26": "Zeg: \"De kennis daarvan ligt alleen bij God en ik ben slechts een duideliike waarschuwer.\"",
                            "verse 67:27": "Maar als zij de straf van nabij zullen zien, zal het gezicht der ongelovigen zich verduisteren en er zal gezegd worden: \"Dit is wat gij placht te vragen.\"",
                            "verse 67:28": "Zeg: \"Vertel mij, indien God mij en degenen die met mij zijn, zou vernietigen - veeleer zal Hij ons genadig zijn - wie zal de ongelovigen tegen een pijnlijke straf kunnen beschermen?\"",
                            "verse 67:29": "Zeg: \"Hij is de Barmhartige, in Hem geloven wij en in Hem stellen wij ons vertrouwen. En gij zult weldra weten wie in klaarblijkelijke dwaling verkeert.\"",
                            "verse 67:30": "Zeg: \"Vertel mij, indien uw water diep in de aarde wegzakt, wie zal u dan helder stromend water kunnen brengen?\""
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 67:1": "Blessed is He in Whose hand is the Sovereignty, and, He is Able to do all things.",
                            "verse 67:2": "Who hath created life and death that He may try you which of you is best in conduct; and He is the Mighty, the Forgiving,",
                            "verse 67:3": "Who hath created seven heavens in harmony. Thou (Muhammad) canst see no fault in the Beneficent One’s creation; then look again: Canst thou see any rifts ?",
                            "verse 67:4": "Then look again and yet again, thy sight will return unto thee weakened and made dim.",
                            "verse 67:5": "And verily We have beautified the world’s heaven with lamps, and We have made them missiles for the devils, and for them We have prepared the doom of flame.",
                            "verse 67:6": "And for those who disbelieve in their Lord there is the doom of hell, a hapless journey’s end!",
                            "verse 67:7": "When they are flung therein they hear its roaring as it boileth up,",
                            "verse 67:8": "As it would burst with rage. Whenever a (fresh) host is flung therein the wardens thereof ask them: Came there unto you no warner ?",
                            "verse 67:9": "They say: Yea, verily, a warner came unto us; but we denied and said: Allah hath naught revealed; ye are in naught but a great error.",
                            "verse 67:10": "And they say: Had we been wont to listen or have sense, we had not been among the dwellers in the flames.",
                            "verse 67:11": "So they acknowledge their sins; but far removed (from mercy) are the dwellers in the flames.",
                            "verse 67:12": "Lo! those who fear their Lord in secret, theirs will be forgiveness and a great reward.",
                            "verse 67:13": "And keep your opinion secret or proclaim it, lo! He is Knower of all that is in the breasts (of men).",
                            "verse 67:14": "Should He not know what He created ? And He is the Subtile, the Aware.",
                            "verse 67:15": "He it is Who hath made the earth subservient unto you, so Walk in the paths thereof and eat of His providence. And unto Him will be the resurrection (of the dead).",
                            "verse 67:16": "Have ye taken security from Him Who is in the heaven that He will not cause the earth to swallow you when lo! it is convulsed ?",
                            "verse 67:17": "Or have ye taken security from Him Who is in the heaven that He will not let loose on you a hurricane ? But ye shall know the manner of My warning.",
                            "verse 67:18": "And verily those before them denied, then (see) the manner of My wrath (with them)!",
                            "verse 67:19": "Have they not seen the birds above them spreading out their wings and closing them ? Naught upholdeth them save the Beneficent. Lo! He is Seer of all things.",
                            "verse 67:20": "Or who is he that will be an army unto you to help you instead of the Beneficent ? The disbelievers are in naught but illusion.",
                            "verse 67:21": "Or who is he that will provide for you if He should withhold His providence ? Nay, but they are set in pride and frowardness.",
                            "verse 67:22": "Is he who goeth groping on his face more rightly guided, or he who walketh upright on a straight road ?",
                            "verse 67:23": "Say (unto them, O Muhammad): He it is who gave you being, and hath assigned unto you ears and eyes and hearts. Small thanks give ye!",
                            "verse 67:24": "Say: He it is Who multiplieth you in the earth, and unto Whom ye will be gathered.",
                            "verse 67:25": "And they say: When (will) this promise (be fulfilled), if ye are truthful ?",
                            "verse 67:26": "Say: The knowledge is with Allah only, and I am but a plain warner;",
                            "verse 67:27": "But when they see it nigh, the faces of those who disbelieve will be awry, and it will be said (unto them): This is that for which ye used to call.",
                            "verse 67:28": "Say (O Muhammad): Have ye thought: Whether Allah causeth me (Muhammad) and those with me to perish or hath mercy on us, still, who will protect the disbelievers from a painful doom ?",
                            "verse 67:29": "Say: He is the Beneficent. In Him we believe and in Him we put our trust. And ye will soon know who it is that is in error manifest.",
                            "verse 67:30": "Say: Have ye thought: If (all) your water were to disappear into the earth, who then could bring you gushing water ?"
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 67:1": "Blessed be He in Whose hands is Dominion; and He over all things hath Power;-",
                            "verse 67:2": "He Who created Death and Life, that He may try which of you is best in deed: and He is the Exalted in Might, Oft-Forgiving;-",
                            "verse 67:3": "He Who created the seven heavens one above another: No want of proportion wilt thou see in the Creation of (God) Most Gracious. So turn thy vision again: seest thou any flaw?",
                            "verse 67:4": "Again turn thy vision a second time: (thy) vision will come back to thee dull and discomfited, in a state worn out.",
                            "verse 67:5": "And we have, (from of old), adorned the lowest heaven with Lamps, and We have made such (Lamps) (as) missiles to drive away the Evil Ones, and have prepared for them the Penalty of the Blazing Fire.",
                            "verse 67:6": "For those who reject their Lord (and Cherisher) is the Penalty of Hell: and evil is (such), Destination.",
                            "verse 67:7": "When they are cast therein, they will hear the (terrible) drawing in of its breath even as it blazes forth,",
                            "verse 67:8": "Almost bursting with fury: Every time a Group is cast therein, its Keepers will ask, \"Did no Warner come to you?\"",
                            "verse 67:9": "They will say: \"Yes indeed; a Warner did come to us, but we rejected him and said, ’God never sent down any (Message): ye are nothing but an egregious delusion!’\"",
                            "verse 67:10": "They will further say: \"Had we but listened or used our intelligence, we should not (now) be among the Companions of the Blazing Fire!\"",
                            "verse 67:11": "They will then confess their sins: but far will be (Forgiveness) from the Companions of the Blazing Fire!",
                            "verse 67:12": "As for those who fear their Lord unseen, for them is Forgiveness and a great Reward.",
                            "verse 67:13": "And whether ye hide your word or publish it, He certainly has (full) knowledge, of the secrets of (all) hearts.",
                            "verse 67:14": "Should He not know,- He that created? and He is the One that understands the finest mysteries (and) is well-acquainted (with them).",
                            "verse 67:15": "It is He Who has made the earth manageable for you, so traverse ye through its tracts and enjoy of the Sustenance which He furnishes: but unto Him is the Resurrection.",
                            "verse 67:16": "Do ye feel secure that He Who is in heaven will not cause you to be swallowed up by the earth when it shakes (as in an earthquake)?",
                            "verse 67:17": "Or do ye feel secure that He Who is in Heaven will not send against you a violent tornado (with showers of stones), so that ye shall know how (terrible) was My warning?",
                            "verse 67:18": "But indeed men before them rejected (My warning): then how (terrible) was My rejection (of them)?",
                            "verse 67:19": "Do they not observe the birds above them, spreading their wings and folding them in? None can uphold them except (God) Most Gracious: Truly (God) Most Gracious: Truly it is He that watches over all things.",
                            "verse 67:20": "Nay, who is there that can help you, (even as) an army, besides (God) Most Merciful? In nothing but delusion are the Unbelievers.",
                            "verse 67:21": "Or who is there that can provide you with Sustenance if He were to withhold His provision? Nay, they obstinately persist in insolent impiety and flight (from the Truth).",
                            "verse 67:22": "Is then one who walks headlong, with his face grovelling, better guided,- or one who walks evenly on a Straight Way?",
                            "verse 67:23": "Say: \"It is He Who has created you (and made you grow), and made for you the faculties of hearing, seeing, feeling and understanding: little thanks it is ye give.",
                            "verse 67:24": "Say: \"It is He Who has multiplied you through the earth, and to Him shall ye be gathered together.\"",
                            "verse 67:25": "They ask: When will this promise be (fulfilled)? - If ye are telling the truth.",
                            "verse 67:26": "Say: \"As to the knowledge of the time, it is with God alone: I am (sent) only to warn plainly in public.\"",
                            "verse 67:27": "At length, when they see it close at hand, grieved will be the faces of the Unbelievers, and it will be said (to them): \"This is (the promise fulfilled), which ye were calling for!\"",
                            "verse 67:28": "Say: \"See ye?- If God were to destroy me, and those with me, or if He bestows His Mercy on us,- yet who can deliver the Unbelievers from a grievous Penalty?\"",
                            "verse 67:29": "Say: \"He is (God) Most Gracious: We have believed in Him, and on Him have we put our trust: So, soon will ye know which (of us) it is that is in manifest error.\"",
                            "verse 67:30": "Say: \"See ye?- If your stream be some morning lost (in the underground earth), who then can supply you with clear-flowing water?\""
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 67:1": "Blessed be He in whose hand is the Kingdom -- He is powerful over everything --",
                            "verse 67:2": "who created death and life, that He might try you which of you is fairest in works; and He is the All-mighty, the All-forgiving --",
                            "verse 67:3": "who created seven heavens one upon another. Thou seest not in the creation of the All-merciful any imperfection. Return thy gaze; seest thou any fissure?",
                            "verse 67:4": "Then return thy gaze again, and again, and thy gaze comes back to thee dazzled, aweary.",
                            "verse 67:5": "And We adorned the lower heaven with lamps, and made them things to stone Satans; and We have prepared for them the chastisement of the Blaze.",
                            "verse 67:6": "And for those who disbelieve in their Lord there awaits the chastisement of Gehenna -- an evil homecoming!",
                            "verse 67:7": "When they are cast into it they will hear it sighing, the while it boils",
                            "verse 67:8": "and wellnigh bursts asunder with rage. As often as a troop is cast into it, its keepers ask them, ’Came there no warner to you?’;",
                            "verse 67:9": "They say, ’Yes indeed, a warner came to us; but we cried lies, saying, \"God has not sent down anything; you are only in great error.",
                            "verse 67:10": "They also say, ’If we had only heard, or had understood, we would not have been of the inhabitants of the Blaze.’",
                            "verse 67:11": "So they confess their sins. Curse the inhabitants of the Blaze!",
                            "verse 67:12": "Surely those who fear their Lord in the Unseen -- there awaits them forgiveness and a great wage.",
                            "verse 67:13": "Be secret in your speech, or proclaim it, He knows the thoughts within the breasts.",
                            "verse 67:14": "Shall He not know, who created? And He is the All-subtle, the All-aware.",
                            "verse 67:15": "It is He who made the earth submissive to you; therefore walk in its tracts, and eat of His provision; to Him is the Uprising.",
                            "verse 67:16": "Do you feel secure that He who is in heaven will not cause the earth to swallow you, the while it rocks?",
                            "verse 67:17": "Do you feel secure that He who is in heaven will not loose against you a squall of pebbles, then you shall know how My warning is?",
                            "verse 67:18": "Those that were before them also cried lies; then how was My horror!",
                            "verse 67:19": "Have they not regarded the birds above them spreading their wings, and closing them? Naught holds them but the All-merciful. Surely He sees everything.",
                            "verse 67:20": "Or who is this that shall be a host for you to help you, apart from the All-merciful? The unbelievers are only in delusion.",
                            "verse 67:21": "Or who is this that shall provide for you if He withholds His provision? No, but they persist in disdain and aversion.",
                            "verse 67:22": "What, is he who walks prone upon his face better guided than he who walks upright on a straight path?",
                            "verse 67:23": "Say: ’It is He who produced you, and appointed for you hearing and sight and hearts; little thanks you show!’",
                            "verse 67:24": "Say: ’It is He who scattered you in the earth, and unto Him you shall be mustered.’",
                            "verse 67:25": "They say, ’When shall this promise come to pass, if you speak truly?’",
                            "verse 67:26": "Say: ’The knowledge is with God; I am only a clear warner.’",
                            "verse 67:27": "Then, when they see it nigh at hand, the faces of the unbelievers will be vexed, and it will be said, ’This is what you were promised.’",
                            "verse 67:28": "Say: ’What think you? If God destroys me and those with me, or has mercy on us, then who will protect the unbelievers from a painful chastisement?’",
                            "verse 67:29": "Say: ’He is the All-merciful. We believe in Him, and in Him we put all our trust. Assuredly, you will soon, know who is in manifest error.",
                            "verse 67:30": "Say: ’What think you? If in the morning your water should have vanished into the earth, then who would bring you running water?’"
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 67:1": "HALLOWED be He in whose hand all dominion rests, since He has the power to will anything:",
                            "verse 67:2": "He who has created death as well as life, so that He might put you to a test [and thus show] which of you is best in conduct, and [make you realize that] He alone is almighty, truly forgiving.",
                            "verse 67:3": "[Hallowed be] He who has created seven heavens in full harmony with one another: no fault wilt thou see in the creation of the Most Gracious. And turn thy vision [upon it] once more: canst thou see any flaw?",
                            "verse 67:4": "Yea, turn thy vision [upon it] again and yet again: [and every time] thy vision will fall back upon thee, dazzled and truly defeated....",
                            "verse 67:5": "And, indeed, We have adorned the skies nearest to the earth with lights, and have made them the object of futile guesses for the evil ones [from among men]: and for them have We readied suffering through a blazing flame",
                            "verse 67:6": "for suffering in hell awaits all who are [thus] bent on blaspheming against their Sustainer: and how vile a journey’s end!",
                            "verse 67:7": "When they are cast into that [hell], they will hear its breath indrawing as it boils up,",
                            "verse 67:8": "well-nigh bursting with fury; [and] every time a host [of such sinners] is flung into it, its keepers will ask them, \"Has no warner ever come to you?\"",
                            "verse 67:9": "They will reply: \"Yea, a warner did indeed come unto us, but we gave him the lie and said, ‘Never has God sent down anything [by way of revelation]! You [self-styled warners] are but lost in a great delusion!’\"",
                            "verse 67:10": "And they will add: \"Had we but listened [to those warnings], or [at least] used our own reason, we would not [now] be among those who are destined for the blazing flame!\"",
                            "verse 67:11": "Thus will they come to realize their sins: but [by that time,] remote will have become all good from those who are destined for the blazing flame.",
                            "verse 67:12": "[As against this,] behold, for those who stand in awe of their Sustainer although He is beyond the reach of their perception, there is forgiveness in store and a great reward.",
                            "verse 67:13": "AND [know, O men, that] whether you keep your beliefs secret or state them openly, He has full knowledge indeed of all that is in [your] hearts.",
                            "verse 67:14": "How could it be that He who has created [all] should not know [all]? Yea, He alone is unfathomable [in His wisdom], all-aware!",
                            "verse 67:15": "He it is who has made the earth easy to live upon: go about, then, in all its regions, and partake of the sustenance which He provides: but [always bear in mind that] unto Him you shall be resurrected.",
                            "verse 67:16": "Can you ever feel secure that He who is in heaven will not cause the earth to swallow you up when, lo and behold, it begins to quake?",
                            "verse 67:17": "Or can you ever feel secure that He who is in heaven will not let loose against you a deadly stormwind, whereupon you would come to know how [true] My warning was?",
                            "verse 67:18": "And, indeed, [many of] those who lived aforetime did give the lie [to My warnings]: and how awesome was My rejection [of them]!",
                            "verse 67:19": "Have they, then, never beheld the birds above them, spreading their wings and drawing them in? None but the Most Gracious upholds them: for, verily, He keeps all things in His sight.",
                            "verse 67:20": "[And] is there any, beside the Most Gracious, that could be a shield for you, and succour you [against danger]? They who deny this truth are but lost in self-delusion!",
                            "verse 67:21": "Or is there any that could provide you with sustenance if He should withhold His provision [from you]? Nay, but they [who are bent on denying the truth] stubbornly persist in their disdain [of God’s messages] and in their headlong flight [from Him]!",
                            "verse 67:22": "But then, is he that goes along with his face close to the ground better guided than he that walks upright on a straight way?",
                            "verse 67:23": "SAY: \"[God is] He who has brought you [all] into being, and has endowed you with hearing, and sight, and hearts: [yet] how seldom are you grateful!\"",
                            "verse 67:24": "Say: \"It is He who has multiplied you on earth; and it is unto Him that you shall be gathered [on resurrection].\"",
                            "verse 67:25": "But they [only] ask, \"When is this promise to be fulfilled? [Answer this, O you who believe in it,] if you are men of truth!\"",
                            "verse 67:26": "Say thou, [O Prophet:] \"Knowledge thereof rests with God alone; and I am only a plain warner.\"",
                            "verse 67:27": "Yet in the end, when they shall see that [fulfilment] close at hand, the faces of those who were bent on denying the truth will be stricken with grief; and they will be told, \"This it is that you were [so derisively] calling for!\"",
                            "verse 67:28": "SAY [O Prophet]: \"What do you think? Whether God destroys me and those who follow me, or graces us with His mercy – is there anyone that could protect [you] deniers of the truth from grievous suffering [in the life to come]?\"",
                            "verse 67:29": "Say: \"He is the Most Gracious: we have attained to faith in Him, and in Him have we placed our trust; and in time you will come to know which of us was lost in manifest error.\"",
                            "verse 67:30": "Say [unto those who deny the truth]: \"What do you think? If of a sudden all your water were to vanish underground, who [but God] could provide you with water from [new] unsullied springs?\""
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 67:1": "Glorious is the One in whose hand is the Kingdom (of the whole universe), and He is powerful over every thing,",
                            "verse 67:2": "the One who created death and life, so that He may test you as to which of you is better in his deeds. And He is the All-Mighty, the Most-Forgiving,",
                            "verse 67:3": "who has created seven skies, one over the other. You will see nothing out of proportion in the creation of the RaHmān (the All-Merciful Allah). So, cast your eye again. Do you see any rifts?",
                            "verse 67:4": "Then cast your eye again and again, and the eye will come back to you abased, in a state of weariness.",
                            "verse 67:5": "And We have decorated the nearest sky with lamps, and have made them devices to stone the devils, and We have prepared for them the punishment of Hell.",
                            "verse 67:6": "And for those who disbelieved in their Lord, there is the punishment of Jahannam , and it is an evil end.",
                            "verse 67:7": "When they will be thrown in it, they will hear a terrible sound from it, and it will be boiling,",
                            "verse 67:8": "seeming as if it will burst out of fury. Whenever a group is thrown into it, its keepers will say to them, “Had no warner come to you?”",
                            "verse 67:9": "They will say, “Yes, a warner had come to us, but We had rejected, and said, ‘Allah has not revealed anything. You are only in great error.’”",
                            "verse 67:10": "And they will say, “Had we been listening or understanding, we would not have been among the people of the Hell.”",
                            "verse 67:11": "Thus they will confess their sin. So, away with the people of the Hell!",
                            "verse 67:12": "Surely, for those who have awe of their Lord without seeing (Him), there is forgiveness and a big reward.",
                            "verse 67:13": "Whether you keep your talk secret or make it aloud, He knows well what lies in the hearts.",
                            "verse 67:14": "Is it (imaginable) that He who has created (them) will not have (such a) knowledge, while He is the Knower of the finest things, the All-Aware?",
                            "verse 67:15": "He is the One who has made the earth subjugated for you, so walk on its shoulders, and eat out of His provision, and to Him is the Resurrection.",
                            "verse 67:16": "Have you become fearless of Him who is in the sky if He makes you sink into the earth, and it starts trembling at once?",
                            "verse 67:17": "Or, have you become fearless of Him who is in the sky if He looses a violent wind with stones against you? So, you will soon come to know how was My warning!",
                            "verse 67:18": "And of course, those before them (also) rejected (the truth). So, how was My censure?",
                            "verse 67:19": "Have they not looked to the birds above them spreading their wings, and (at times) they fold (them) in? No one holds them up except the RaHmān (the All-Merciful Allah). Surely He is watchful of every thing.",
                            "verse 67:20": "Now, who is there to act as a force for you to help you, except the RaHmān ? The disbelievers are in nothing but delusion.",
                            "verse 67:21": "Or, who is there to give you sustenance, if He withholds His sustenance? Still, they persist in rebellion and aversion.",
                            "verse 67:22": "Then, is the one who walks falling down (frequently) on his face more right or the one who walks properly on a straight path?",
                            "verse 67:23": "Say, “He is the One who has originated you, and made for you ears and eyes and hearts. How little you pay gratitude!”",
                            "verse 67:24": "Say, “He is the One who has scattered you on the earth, and to Him you will be assembled.”",
                            "verse 67:25": "And they say, “When will this promise (of the Day of Judgment) be fulfilled, if you are true?”",
                            "verse 67:26": "Say, “The knowledge (of that Day) is only with Allah, and I am only a plain warner.",
                            "verse 67:27": "Then, once they will see it approaching, the faces of the disbelievers will be turned awkward, and it will be said, “This is what you were calling for!”",
                            "verse 67:28": "Say, “Tell me, if Allah destroys me and those who are with me (as you wish), or has mercy on us (as we wish), who can (in either case) save the disbelievers from a painful punishment?”",
                            "verse 67:29": "Say, “He is the RaHmān; we have believed in Him, and in Him we placed our trust. So, you will soon come to know who is in open error.”",
                            "verse 67:30": "Say, “Tell me, Should your water vanish into the earth, who will bring you a flowing (stream of) water?"
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 67:1": "Blessed is He in Whose hand is [all] sovereignty, and He has power over all things.",
                            "verse 67:2": "[He] Who created death and life, that He may try you [to see] which of you is best in conduct, and He is the Mighty, the Forgiving,",
                            "verse 67:3": "Who created seven heavens in layers. You do not see in the Compassionate One’s creation any irregularity. Then cast your eyes again: Do you see any fissure?",
                            "verse 67:4": "Then cast your eyes yet again and your sight will return to you humbled and wearied.",
                            "verse 67:5": "And verily We have adorned the lowest heaven with lamps, and made them missiles against the devils; and We have prepared for them the chastisement of the Blaze.",
                            "verse 67:6": "And for those who disbelieve in their Lord there is the chastisement of Hell, and [what] an evil journey’s end!",
                            "verse 67:7": "When they are flung into it they hear it blaring as it seethes,",
                            "verse 67:8": "almost exploding with rage. Whenever a host is flung into it, its keepers ask them: ‘Did there not come to you a warner?’",
                            "verse 67:9": "They will say, ‘Yes, a warner did indeed come to us, but we denied and said, “God has not revealed anything; you are assuredly in great error” ’.",
                            "verse 67:10": "And they will say, ‘Had we listened or comprehended, we would not have been among the inhabitants of the Blaze’.",
                            "verse 67:11": "Thus they will confess their sin. So away with the inhabitants of the Blaze!",
                            "verse 67:12": "Assuredly those who fear their Lord in secret, there will be for them forgiveness and a great reward.",
                            "verse 67:13": "And [whether you] keep secret your speech or proclaim it, He indeed is Knower of what is in the breasts.",
                            "verse 67:14": "Will He Who has created not know? And He is the Subtle, the Aware.",
                            "verse 67:15": "It is He Who made the earth tractable for you, so walk in its flanks and eat of His provision; and to Him is the resurrection.",
                            "verse 67:16": "Are you secure [in thinking] that He Who is in the heaven will not cause the earth to swallow you while it quakes?",
                            "verse 67:17": "Are you secure [in thinking] that He Who is in the heaven will not unleash upon you a squall of pebbles? But you will [soon] come to know the nature of My warning.",
                            "verse 67:18": "And verily those who were before them denied, then [see] how was My rebuttal!",
                            "verse 67:19": "Or have they not seen the birds above them spreading their wings and closing? Nothing sustains them, except the Compassionate One. Indeed He is Seer of all things.",
                            "verse 67:20": "Or who is it that will be an army for you to help you besides the Compassionate One? The disbelievers are in nothing but delusion.",
                            "verse 67:21": "Or who is it that will provide for you if He withholds His provision? Nay, but they persist in disdain and aversion.",
                            "verse 67:22": "Is he who walks cast down on his face more rightly guided, or he who walks upright on a straight path?",
                            "verse 67:23": "Say: ‘It is He Who created you and endowed you with hearing and sight and hearts. Little do you thank!’",
                            "verse 67:24": "Say: ‘It is He Who multiplied you on earth, and to Him you will be gathered’.",
                            "verse 67:25": "And they say: ‘When will this promise be [fulfilled], if you are truthful?’",
                            "verse 67:26": "Say: ‘The knowledge is only with God, and I am but a plain warner’.",
                            "verse 67:27": "But when they see it near at hand, the faces of those who disbelieved will be awry, and it will be said: ‘This is that which you used to make claims about’.",
                            "verse 67:28": "Say: ‘Have you considered: If God destroys me and those with me, or has mercy on us, who then will protect the disbelievers from a painful chastisement?’",
                            "verse 67:29": "Say: ‘He is the Compassionate One; we believe in Him, and in Him we put our trust. And assuredly you will [soon] know who is in manifest error’.",
                            "verse 67:30": "Say: ‘Have you considered: If your water were to sink deep into the earth, who then will bring you running water?’"
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 67:1": "Blessed is He in Whose (Mighty) Hand is the kingdom (of all the worlds). And He enjoys perfect command over everything;",
                            "verse 67:2": "He Who has created death and life (so that) He may test you as to which of you is best in conduct. And He is Almighty, Most Forgiving;",
                            "verse 67:3": "He Who has created seven (or numerous) heavenly spheres corresponding to one another (layer upon layer). You will not find any irregularity and disproportion in the system of the creation of the Most Kind (Lord). So have a (meditative and thoughtful) look around: do you find in this (creation) any incongruity or disharmony (i.e., degeneration or falling apart)?",
                            "verse 67:4": "Look around time and again with (an inquisitive) vision (from different angles and with scientific methods. Every time) your sight will return to you fatigued and frustrated (in finding any shortcoming or imperfection).",
                            "verse 67:5": "And surely, We have adorned the lowest heaven of the universe with lights (in the form of stars, planets, other asteroids and meteoroids). And We have also made (some of them) the means of pelting away (i.e., eliminating the negative effects of) satans (i.e., rebellious forces). And We have prepared for these (satans) a torment of Blazing Fire.",
                            "verse 67:6": "And for those who have denied their Lord is the torment of Hell. And what an evil abode it is!",
                            "verse 67:7": "When they will be flung into it, they will hear its horrifying roar. And that (Fire) will be boiling (with rage),",
                            "verse 67:8": "As if it is about to burst into pieces with intense wrath. When a group will be cast into it, its guards will ask them: ‘Did no Warner come to you?’",
                            "verse 67:9": "They will say: ‘Yes indeed! A Warner did come to us, but we rejected him and said: Allah has not sent down anything. You are just in great error.’",
                            "verse 67:10": "And they will say: ‘Had we listened to or understood (the truth), we would not have been (put) amongst the inmates of Hell (Today).’",
                            "verse 67:11": "Then they will confess their sin. So remoteness for the inmates of Hell (from Allah’s mercy) is (destined).",
                            "verse 67:12": "Surely, those who fear their Lord unseen, for them is forgiveness and great reward.",
                            "verse 67:13": "And whether you speak in secret or aloud, certainly He knows best (even) the things (hidden) in the hearts.",
                            "verse 67:14": "Does He, Who has created, not know? In truth, He is the One Who can see the essence and is Well Aware (of everything).",
                            "verse 67:15": "He is the One Who has made the earth soft and subservient to you. So walk about through its tracks and eat of the sustenance (given) by Him, and towards Him alone is the return, rising (after death).",
                            "verse 67:16": "Have you gone fearless of (the Lord of) the heaven that He may sink you into the earth when it suddenly shakes?",
                            "verse 67:17": "Have you gone fearless of (the Lord of) the heaven that He may send against you a stone-pelting wind? Then soon will you come to know how My Warning is!",
                            "verse 67:18": "And surely, those before them (also) denied. But how (awful) proved My denial!",
                            "verse 67:19": "Have they not seen the birds above them spreading out their wings and (sometimes) folding them? Nothing can hold them (from falling) except (the law made by) the Most Kind (Lord). Surely, He sees everything best.",
                            "verse 67:20": "Well, is there anyone that can muster an army to help you against the Most Kind Lord? The disbelievers are merely (snared) in deception.",
                            "verse 67:21": "Well, is there anyone that can provide you sustenance if (Allah) holds back His sustenance (from you)? In fact, they are adamantly fixed in rebellion and hatred (for truth).",
                            "verse 67:22": "Is he who walks in prone position more rightly guided, or he who walks upright on a straight path?",
                            "verse 67:23": "Say: ‘(Allah) is He Who created you and provided you with ears and eyes and hearts. Yet you give thanks but little.’",
                            "verse 67:24": "Say: ‘He is the One Who has spread you in the earth, and you will be gathered towards Him (on the Day of Assembly).’",
                            "verse 67:25": "And they say: ‘When will this promise (of the Day of Resurrection) be fulfilled if you are truthful?’",
                            "verse 67:26": "Say: ‘The knowledge (of that Hour) is with Allah alone and I am just a clear Warner.’ (If the time is disclosed, there will be no fear any more.)",
                            "verse 67:27": "Then, when they will see that (Day) near, the faces of the disbelievers will be deformed and darkened, and it will be said (to them): ‘This is (the promise) which you asked for (to come to pass in haste).’",
                            "verse 67:28": "Say: ‘Well, give your view: if Allah causes me death (as you desire) and (also) to my Companions, or shows mercy to us (i.e., defers our death), then (in both these cases) who will shelter the disbelievers from the painful torment?’",
                            "verse 67:29": "Say: ‘He alone is the Most Kind (Lord) in Whom we believe and in Whom we trust. So you will soon know who is in open error.’",
                            "verse 67:30": "Say: ‘If your water sinks far deep into the earth (i.e., dries up), then who will bring you flowing water (on earth)?’"
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Siunattu on Hän, jonka käsissä on valtakunta ja voima yli kaiken olevaisen!",
                            "verse 67:2": "Hän, joka loi elämän ja kuoleman koetellakseen, kuka teistä osoittautuu parhaaksi teoissa. Hän on mahtava, laupias.",
                            "verse 67:3": "Hän on luonut seitsemän taivasta toinen toisensa yläpuolelle. Et voi havaita mitään vikaa Armahtajan luomistyössä. Katsele ympärillesi: voitko huomata mitään vajavaisuutta?",
                            "verse 67:4": "Käänny ylt'ympäri ja katsele yhä edelleen, ja katseesi palaa lähtökohtaan pettyneenä ja väsyneenä.",
                            "verse 67:5": "Olemmehan koristanut koko alimman taivaan valoilla, joista on tullut aseita paholaisia vastaan, näille Me olemme valmistanut helvetin tulen tuskat.",
                            "verse 67:6": "Niitä, jotka eivät usko Herraansa, odottaa helvetin tuska; kurja on tuo määränpää.",
                            "verse 67:7": "Kun heidät heitetään sinne, he kuulevat sen pauhun, kun se kiehuu.",
                            "verse 67:8": "Se on raivoonsa pakahtumaisillaan. Joka kerta, kun sinne heitetään joukko, sen vartijat kysyvät näiltä: »Eikö varoittaja aikanaan tullut luoksenne?»",
                            "verse 67:9": "Ja he vastaavat: »Kyllä, varoittaja tuli totisesti luoksemme, mutta me torjuimme hänet ja sanoimme: 'Jumala ei ole sinulle ilmoitustaan antanut, olet suuressa harhassa.'»",
                            "verse 67:10": "Ja he sanovat: »Jos olisimme ottaneet vaarin ja miettineet, emme olisi joutuneet helvetin asukkaiden joukkoon.»",
                            "verse 67:11": "Niin he tunnustavat syntinsä, mutta etäälle armosta jäävät helvetin tulen asukkaat.",
                            "verse 67:12": "Niitä varten, jotka salassakin pelkäävät ja kunnioittavat Herraansa, on anteeksiantamus ja suuri palkinto.",
                            "verse 67:13": "Joko salaatte sanottavanne tai lausutte sen julki, kyllä Herra varmasti tuntee mielenne.",
                            "verse 67:14": "Eikö Hän sitä tietäisi, joka kaiken loi? Hänhän vähimmänkin havaitsee ja kaiken tajuaa.",
                            "verse 67:15": "Hän on luonut maan alamaiseksenne, jotta voisitte kävellä sen teillä ja syödä sen antimia. Hänen luokseen johtaa ylösnousemus.",
                            "verse 67:16": "Oletteko varmat siitä, ettei Hän, joka on yläpuolellanne, anna maan niellä teitä? Katso, se jo vavahtelee!",
                            "verse 67:17": "Tai oletteko varmat siitä, ettei Hän, joka on teidän yläpuolellanne, lähetä päällenne hirmumyrskyä? Saatte kokea, millainen oli minun varoitukseni.",
                            "verse 67:18": "On kyllä ollut niitä, jotka ennen heitä ovat väittäneet totuutta valheeksi, mutta millainen olikaan kuritukseni!",
                            "verse 67:19": "Eivätkö he näe, miten linnut heidän yläpuolellaan levittävät ja kokoovat siipensä? Kuka muu kuin Armahtaja pitää niitä koholla? Hän totisesti näkee kaiken.",
                            "verse 67:20": "Kuka muu kuin Armahtaja voi teitä auttaa niinkuin suuri sotajoukko? Epäuskoiset ovat sokeita.",
                            "verse 67:21": "Onko ketään, joka teitä ravitsisi, jos Hän ei antaisi teille elatusta? Mutta he vain jatkavat kapinoimistaan ja vastusteluaan.",
                            "verse 67:22": "Kumpi voi paremmin seurata johdatusta, sekö, joka ryömii kasvot maata vasten, vai se, joka etenee oikeata tietä pystyssä päin?",
                            "verse 67:23": "Sano: »Hän on teidät luonut ja antanut teille näön, kuulon ja sydämen. Vähäinen on teidän kiitollisuutenne.»",
                            "verse 67:24": "Sano: »Hän on teidät levittänyt aina maan ääriin asti, ja Hänen luokseen teidät kootaan yhteen.»",
                            "verse 67:25": "He sanovat myös: »Milloin on tämä lupaus täyttyvä, jos puheesi on totta?»",
                            "verse 67:26": "Sano: »Sen tietää Jumala yksin, minä olen vain julkinen varoittaja.»",
                            "verse 67:27": "Mutta kun he näkevät tuhon olevan lähellä, synkkenevät niiden kasvot, jatka eivät usko, ja kuuluu sana: »Tämä on se, mitä te halusitte.»",
                            "verse 67:28": "Sano: »Mitä ajattelette? Vaikkapa Jumala tuhoaisi minut ja ne, jotka ovat minun kanssani, tai armahtaisi meidät, kukapa silloinkaan pelastaisi epäuskoiset tuomion kurituksesta?»",
                            "verse 67:29": "Sano: »Hän on Armahtaja, Me uskomme Häneen ja Häneen Me luotamme; pian saatte tietää, kuka on ilmeisessä harhassa.»",
                            "verse 67:30": "Sano: »Mitä ajattelisitte, jos jonakin aamuna vetenne valuisi kuiviin? Kuka teille silloin voisi hankkia kirkasta, juoksevaa vettä?»"
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 67:1": "Béni soit Celui qui tient en Sa main le Royaume et qui est puissant sur toute chose !",
                            "verse 67:2": "Celui qui a créé la mort et la vie pour vous éprouver [et voir] qui de vous agit le mieux, et qui est l'Omnipotent, le Pardonneur.",
                            "verse 67:3": "Celui qui a créé sept cieux bien ordonnés. Tu ne vois dans la création du Miséricordieux aucune faille. Regarde encore ! Aperçois-tu quelque brèche ?",
                            "verse 67:4": "Puis, regarde encore par deux fois : ton regard reviendra vers toi, lassé, brouillé.",
                            "verse 67:5": "Nous avons orné le ciel de ce monde de luminaires et Nous en avons fait des projectiles contre les démons, et Nous avons préparé pour eux le châtiment de la Fournaise.",
                            "verse 67:6": "A ceux qui ont mécru en leur Seigneur est destiné le châtiment de la Géhenne. Quel détestable lieu de retour !",
                            "verse 67:7": "Quand ils y sont jetés, ils l'entendent rugir tandis qu'elle bouillonne. Elle est près",
                            "verse 67:8": "d'éclater de fureur. Chaque fois qu'un groupe y est précipité, ses gardiens lui demandent : \" Un avertisseur n'est-il pas venu à vous ? \"",
                            "verse 67:9": "\" Si fait ! disent-ils, un avertisseur est venu à nous, mais nous avons crié au mensonge et nous avons dit : \"Dieu n'a rien fait descendre ; c'est seulement que vous êtes plongés dans un profond égarement\" \".",
                            "verse 67:10": "Ils ajoutent : \" Si nous avions entendu ou si nous avions raisonné, nous ne serions pas parmi les hôtes de la Fournaise. \"",
                            "verse 67:11": "Ils reconnaissent leurs péchés. Que soient donc exterminés les hôtes de la Fournaise.",
                            "verse 67:12": "Ceux qui craignent leur Seigneur en secret obtiendront un pardon et une grande récompense.",
                            "verse 67:13": "Que vous teniez secret votre discours ou que vous le proclamiez, Dieu sait parfaitement ce que contiennent les poitrines.",
                            "verse 67:14": "Ne connaît-Il pas ce qu'Il a créé, Lui qui est le Subtil, Celui qui est instruit de tout ?",
                            "verse 67:15": "C'est Lui qui a fait que la terre vous est soumise ; parcourez-en donc les vastes étendues et mangez de la subsistance que Dieu vous accorde. C'est vers Lui que se fera la Résurrection.",
                            "verse 67:16": "Avez-vous obtenu de Celui qui est au ciel l'assurance qu'Il ne vous fera pas engloutir par la terre ? Or, voici qu'elle tremble...",
                            "verse 67:17": "Avez-vous obtenu de Celui qui est au ciel l'assurance qu'Il ne déchaînera pas contre vous une tornade ? Vous connaîtrez alors la nature de Mon avertissement.",
                            "verse 67:18": "Ceux qui vécurent avant eux avaient crié au mensonge. Quelle ne fut pas alors Ma réprobation !",
                            "verse 67:19": "Ne voient-il pas comment les oiseaux, au-dessus d'eux, déploient leurs ailes et les replient ? Seul le Miséricordieux les soutient ; en vérité, Il voit tout !",
                            "verse 67:20": "Y a-t-il quelqu'un qui puisse, pour vous, faire office d'armée et vous secourir en lieu et place du Miséricordieux ? Certes, les mécréants ne sont que dans l'illusion.",
                            "verse 67:21": "Quel est donc celui qui pourvoira à vos besoins si Dieu retient Ses dons ? Mais non !, ils persistent dans l'insolence et dans la haine.",
                            "verse 67:22": "Celui qui marche tête baissée est-il mieux dirigé que celui qui marche tranquillement droit devant lui ?",
                            "verse 67:23": "Dis : \" C'est Lui qui vous a fait exister et qui vous a donné l'ouïe, la vue et les cœurs. Comme vous êtes peu reconnaissants ! \"",
                            "verse 67:24": "Dis : \" C'est Lui qui vous a multipliés sur la terre et vers Qui vous serez rassemblés \".",
                            "verse 67:25": "Ils disent : \" Quand donc se réalisera cette promesse si vous êtes véridiques ? \"",
                            "verse 67:26": "Dis : \" La connaissance n'est qu'auprès de Dieu, et moi je ne suis qu'un avertisseur explicite \".",
                            "verse 67:27": "Quand les mécréants verront le châtiment de près, leurs visages seront horrifiés. On leur dira :\" Voici ce que vous réclamiez ! \"",
                            "verse 67:28": "Dis : \" Y pensez-vous ? Soit que Dieu m'anéantisse, moi et mes compagnons, soit qu'Il me fasse miséricorde, qui donc protégera les mécréants contre un châtiment douloureux ? \"",
                            "verse 67:29": "Dis : \" Lui, le Miséricordieux ! Nous croyons en Lui et à Lui nous nous en remettons ! Vous saurez bientôt qui se trouve dans un égarement manifeste \".",
                            "verse 67:30": "Dis : \" Y pensez-vous ? Si l'eau dont vous disposez était absorbée par la terre, qui donc vous procurerait une eau jaillissante ? \""
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 67:1": "Béni soit celui dans la main de qui est la royauté, et Il est Omnipotent.",
                            "verse 67:2": "Celui qui a créé la mort et la vie afin de vous éprouver (et de savoir) qui de vous est le meilleur en oeuvre, et c’est Lui le Puissant, le Pardonneur.",
                            "verse 67:3": "Celui qui a créé sept cieux superposés sans que tu voies de disproportion en la création du Tout Miséricordieux. Ramène [sur elle] le regard. Y vois-tu une brèche quelconque ?",
                            "verse 67:4": "Puis, retourne ton regard à deux fois : le regard te reviendra humilié et frustré.",
                            "verse 67:5": "Nous avons effectivement embelli le ciel le plus proche avec des lampes [des étoiles] dont Nous avons fait des projectiles pour lapider des diables et Nous leur avons préparé le châtiment de la Fournaise.",
                            "verse 67:6": "Ceux qui ont mécru à leur Seigneur auront le châtiment de l’Enfer. Et quelle mauvaise destination !",
                            "verse 67:7": "Quand ils y seront jetés, ils lui entendront un gémissement, tandis qu’il bouillonne.",
                            "verse 67:8": "Peu s’en faut que, de rage, il n’éclate. Toutes les fois qu’un groupe y est jeté, ses gardiens leur demandent : «Quoi ! ne vous est-il pas venu d’avertisseur ? »",
                            "verse 67:9": "Ils dirent : «Mais si ! un avertisseur nous était venu certes, mais nous avons crié au mensonge et avons dit : Dieu n’a rien fait descendre, vous n’êtes que dans un grand égarement»",
                            "verse 67:10": "Et ils dirent : «Si nous avions écouté ou raisonné, nous ne serions pas parmi les gens de la Fournaise».",
                            "verse 67:11": "Ils ont reconnu leur péché. Que les gens de la Fournaise soient anéantis à jamais.",
                            "verse 67:12": "Ceux qui redoutent leur Seigneur bien qu’ils ne L’aient jamais vu auront un pardon et une grande récompense.",
                            "verse 67:13": "Que vous cachiez votre parole ou la divulguiez Il connaît bien le contenu des poitrines.",
                            "verse 67:14": "Ne connaît-Il pas ce qu’Il a créé alors que c’est Lui Compatissant, le Parfaitement Connaisseur.",
                            "verse 67:15": "C’est Lui qui vous a soumis la terre : parcourez donc ses grandes étendues. Mangez de ce qu’Il vous fournit. Vers Lui est la Résurrection.",
                            "verse 67:16": "êtes-vous à l’abri que Celui qui est au ciel enfouisse en la terre ? Et voici qu’elle tremble !",
                            "verse 67:17": "Ou êtes-vous à l’abri que Celui qui au ciel envoie contre vous un ouragan de pierres ? Vous saurez ainsi quel fut Mon avertissement.",
                            "verse 67:18": "En effet, ceux d’avant eux avaient crié au mensonge. Quelle fut alors Ma réprobation !",
                            "verse 67:19": "N’ont-ils pas vu les oiseaux au-dessus d’eux, déployant et repliant leurs ailes tour à tour ? Seul le Tout Miséricordieux les soutient. Car Il est sur toute chose, Clairvoyant.",
                            "verse 67:20": "Quel est celui qui constituerait pour vous une armée [capable] de vous secourir, en dehors du Tout Miséricordieux ? En vérité les mécréants sont dans l’illusion complète.",
                            "verse 67:21": "Ou quel est celui qui vous donnera votre subsistance s’Il s’arrête de fournir Son attribution ? Mais ils persistent dans leur insolence et dans leur répulsion.",
                            "verse 67:22": "Qui est donc mieux guidé ? Celui qui marche face contre terre ou celui qui marche redressé sur un chemin droit.",
                            "verse 67:23": "Dis : «C’est Lui qui vous a crées et vous a donné l’ouïe, les yeux et les coeurs». Mais vous êtes rarement reconnaissants !",
                            "verse 67:24": "Dis : «C’est Lui qui vous a répandus sur la terre, et c’est vers Lui que vous serez rassemblés».",
                            "verse 67:25": "Et ils disent : «A quand cette promesse si vous êtes véridiques ? ».",
                            "verse 67:26": "Dis : «Dieu seul [en] a la connaissance. Et moi je ne suis qu’un avertisseur clair».",
                            "verse 67:27": "Puis, quand ils verront (le châtiment) de près, les visages de ceux qui ont mécru seront affligés. Et il leur sera dit : «Voilà ce que vous réclamiez».",
                            "verse 67:28": "Dis : «Que vous en semble ? Qu’Alla me fasse périr ainsi que ceux qui sont avec moi ou qu’Il nous fasse miséricorde, qui protégera alors les mécréants d’un châtiment douloureux ? ».",
                            "verse 67:29": "Dis : «C’est Lui, le Tout Miséricordieux. Nous croyons en Lui et c’est en Lui que nous plaçons notre confiance. Vous saurez bientôt qui est dans un égarement évident».",
                            "verse 67:30": "Dis : «Que vous en semble ? Si votre eau était absorbée au plus profond de la terre, qui donc vous apporterait de l’eau de source ? »"
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Segensreich ist Der, in Dessen Hand die Herrschaft ist; und Er vermag alle Dinge zu tun.",
                            "verse 67:2": "Der den Tod erschaffen hat und das Leben, daß Er euch prüfe, wer von euch der Beste ist im Handeln; und Er ist der Allmächtige, der Allverzeihende,",
                            "verse 67:3": "Der sieben Himmel im Einklang erschaffen hat. Keinen Fehler kannst du in der Schöpfung des Gnadenreichen sehen. So wende den Blick: siehst du irgendeinen Mangel?",
                            "verse 67:4": "So wende den Blick abermals und abermals: dein Blick wird nur zu dir zurückkehren ermüdet und geschwächt.",
                            "verse 67:5": "Fürwahr, Wir haben den untersten Himmel mit Lampen geschmückt, und Wir haben sie zu einem Mittel zur Vertreibung der Teufel gemacht, und für sie haben Wir die Strafe des flammenden Feuers bereitet.",
                            "verse 67:6": "Und für jene, die nicht an ihren Herrn glauben, ist die Strafe der Hölle, und eine üble Bestimmung ist das!",
                            "verse 67:7": "Wenn sie hineingeworfen werden, dann werden sie sie brüllen hören, indes sie aufschäumt.",
                            "verse 67:8": "Fast möchte sie bersten vor Wut. Sooft eine Schar hineingeworfen wird, werden ihre Wächter sie fragen: «Ist denn kein Warner zu euch gekommen?»",
                            "verse 67:9": "Sie werden sprechen: «Doch, sicherlich, es kam ein Warner zu uns, aber wir schalten (ihn) einen Lügner und sprachen: \"Allah hat nichts herabgesandt; ihr seid bloß in schwerem Irrtum.\"»",
                            "verse 67:10": "Sie werden sprechen: «Hätten wir nur zugehört oder Verstand gehabt, wir wären nicht unter den Bewohnern des flammenden Feuers gewesen.»",
                            "verse 67:11": "So werden sie ihre Sünden bekennen; doch fern sind die Bewohner des flammenden Feuers (der Gnade).",
                            "verse 67:12": "Wahrlich, diejenigen, die ihren Herrn im geheimen fürchten, werden Vergebung und großen Lohn erhalten.",
                            "verse 67:13": "Und ob ihr euer Wort verbergt oder es offen verkündet, Er kennt die innersten Gedanken der Herzen.",
                            "verse 67:14": "Kennt denn Der nicht, Der erschaffen? Er ist scharfsinnig, allwissend.",
                            "verse 67:15": "Er ist es, Der die Erde für euch dienstfertig gemacht hat; wandert also auf ihren Wegen und genießet Seine Versorgung. Und zu Ihm wird die Auferstehung sein.",
                            "verse 67:16": "Fühlt ihr euch sicher vor Dem, Der im Himmel ist, daß Er nicht die Erde euch verschlingen läßt, wenn sie, siehe, zu beben beginnt?",
                            "verse 67:17": "Fühlt ihr euch sicher vor Dem, Der im Himmel ist, daß Er nicht einen Sturmwind gegen euch schickt? Dann werdet ihr wissen, wie Meine Warnung war!",
                            "verse 67:18": "Und schon leugneten jene, die vor ihnen waren; wie war dann (die Folge) Meiner Verleugnung!",
                            "verse 67:19": "Haben sie nicht die Vögel über sich gesehen, wie sie ihre Flügel breiten und sie dann einziehen? Keiner hält sie zurück als der Gnadenreiche. Wahrlich, Er sieht alle Dinge.",
                            "verse 67:20": "Oder wer ist es, der ein Heer für euch sein kann, euch beizustehen, gegen den Gnadenreichen? Die Ungläubigen sind in Täuschung nur.",
                            "verse 67:21": "Oder wer ist es, der euch versorgen wird, wenn Er Seine Versorgung zurückhält? Nein, aber sie verharren in Trotz und in Widerwillen.",
                            "verse 67:22": "Wie! ist der, der gebückt auf seinem Gesicht einhergeht, besser geleitet als jener, der aufrecht wandelt auf dem geraden Weg?",
                            "verse 67:23": "Sprich: «Er ist es, Der euch ins Dasein rief und Der euch Ohren und Augen und Herzen gab; (aber) wenig ist es, was ihr Dank wisset!»",
                            "verse 67:24": "Sprich: «Er ist es, Der euch mehrte auf Erden, und zu Ihm werdet ihr versammelt werden.»",
                            "verse 67:25": "Und sie sprechen: «Wann wird diese Verheißung (sich erfüllen), wenn ihr wahrhaftig seid?»",
                            "verse 67:26": "Sprich: «Das Wissen (darum) ist bei Allah allein, und ich bin nur ein aufklärender Warner.»",
                            "verse 67:27": "Doch wenn sie es nahe sehen, dann werden die Gesichter derer, die ungläubig sind, verzerrt sein, und es wird gesprochen werden: «Das ist's, was ihr zu verlangen pflegtet.»",
                            "verse 67:28": "Sprich: «Sagt an, wenn Allah mich vernichten sollte und die mit mir sind, oder wenn Er uns Barmherzigkeit erweisen sollte, wer wird die Ungläubigen vor qualvoller Strafe schützen?»",
                            "verse 67:29": "Sprich: «Er ist der Gnadenreiche; an Ihn glauben wir und auf Ihn vertrauen wir. Ihr werdet bald erfahren, wer in offenkundigem Irrtum ist.»",
                            "verse 67:30": "Sprich: «Sagt an, wenn euer Wasser versickern würde, wer könnte euch dann fließendes Wasser bringen?»"
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "ftl ¼[+kqnk½ ds dCt+s esa ¼lkjs tgk¡u dh½ ckn’kkgr gS og cM+h cjdr okyk gS vkSj og gj pht+ ij dkfnj gS",
                            "verse 67:2": "ftlus ekSr vkSj ft+Unxh dks iSnk fd;k rkfd rqEgsa vkt+ek, fd rqeesa ls dke esa lcls vPNk dkSu gS vkSj og x+kfyc ¼vkSj½ cM+k c[+’kus okyk gS",
                            "verse 67:3": "ftlus lkr vkleku rys Åij cuk Mkys Hkyk rq>s [+kqnk dh vkQ+fju’k esa dksbZ dlj ut+j vkrh gS rks fQj vk¡[k mBkdj ns[k Hkyk rq>s dksbZ fÓx+kQ+ ut+j vkrk gS",
                            "verse 67:4": "fQj nqckjk vk¡[k mBk dj ns[kks rks ¼gj ckj rsjh½ ut+j ukdke vkSj Fkd dj rsjh rjQ iyV vk,xh",
                            "verse 67:5": "vkSj geus uhps okys ¼igys½ vkleku dks ¼rkjksa ds½ fpjkx+ksa ls t+hur nh gS vkSj geus mudks ÓSrkuksa ds ekjus dk vkyk cuk;k vkSj geus muds fy, ngdrh gq;h vkx dk vt+kc rS;kj dj j[kk gS",
                            "verse 67:6": "vkSj tks yksx vius ijojfnxkj ds equfdj gSa muds fy, tgUuqe dk vt+kc gS vkSj og ¼cgqr½ cqjk fBdkuk gS",
                            "verse 67:7": "tc ;s yksx blesa Mkys tk,¡xs rks mldh cM+h ph[+k lqusaxs vkSj og tks’k ekj jgh gksxh",
                            "verse 67:8": "cfYd xks;k ekjs tks’k ds QV iM+sxh tc mlesa ¼mudk½ dksbZ fxjksg Mkyk tk,xk rks muls nkjksx+, tgUuqe iwNsxk D;k rqEgkjs ikl dksbZ Mjkus okyk iSx+Ecj ugha vk;k Fkk",
                            "verse 67:9": "og dgsaxs gkW gekjs ikl Mjkus okyk rks t+:j vk;k Fkk exj geus mldks >qByk fn;k vkSj dgk fd [+kqnk us rks dqN ukft+y gh ugha fd;k rqe rks cM+h ¼xgjh½ xqejkgh esa ¼iM+s½ gks",
                            "verse 67:10": "vkSj ¼;s Hkh½ dgsaxs fd vxj ¼mudh ckr½ lqurs ;k le>rs rc rks ¼vkt½ nkst+f[+k;ksa esa u gksrs",
                            "verse 67:11": "x+jt+ og vius xqukg dk bd+jkj dj ysaxs rks nkst+f[k+;ksa dks [+kqnk dh jger ls nwjh gS",
                            "verse 67:12": "cs’kd tks yksx vius ijojfnxkj ls csns[ks Hkkyss Mjrs gSa muds fy, ex+Qsjr vkSj cM+k Hkkjh vtz gS",
                            "verse 67:13": "vkSj rqe viuh ckr fNidj dgks ;k [kqYye [kqYyk og rks fny ds Hksnksa rd ls [+kwc okfd+Q+ gS",
                            "verse 67:14": "Hkyk ftlus iSnk fd;k og rks cs[+kcj vkSj og rks cM+k ckjhdchu okfd+Q+dkj gS",
                            "verse 67:15": "ogh rks gS ftlus t+ehu dks rqEgkjs fy, uje ¼o geokj½ dj fn;k rks mlds vrjkQ+ o tokfuc esa pyks fQjks vkSj mldh ¼nh gq;h½ jkst+h [kkvks",
                            "verse 67:16": "vkSj fQj mlh dh rjQ d+cz ls mB dj tkuk gS D;k rqe ml Ó[+l ls tks vkleku esa ¼gqdwer djrk gS½ bl ckr ls cs[+kkSQ+ gks fd rqedks t+ehu esa /kWlk ns fQj og ,dckjxh myV iqyV djus yxs",
                            "verse 67:17": ";k rqe bl ckr ls cs[+kkSQ gks fd tks vkleku esa ¼lYrur djrk½ gS fd rqe ij iRFkj Hkjh vk¡/kh pyk, rks rqEgsa vud+jhsc gh ekywe gks tk,xk fd esjk Mjkuk dSlk gS",
                            "verse 67:18": "vkSj tks yksx muls igys Fks mUgksus >qByk;k Fkk rks ¼ns[kks½ fd esjh uk[+kq’kh dSlh Fkh",
                            "verse 67:19": "D;k mu yksxksa us vius ljksa ij fpfM+;ksa dks mM+rs ugha ns[kk tks ijksa dks QSyk, jgrh gSa vkSj lesV ysrh gSa fd [+kqnk ds flok mUgsa dksbZ jksds ugha jg ldrk cs’kd og gj pht+ dks ns[k jgk gS",
                            "verse 67:20": "Hkyk [+kqnk ds flok ,slk dkSu gS tks rqEgkjh Q+kSt cudj rqEgkjh enn djs dkfQ+j yksx rks /kks[ks gh ¼/kks[ks½ esa gSa Hkyk [+kqnk vxj viuh ¼nh gq;h½ jkst+h jksd ys rks dkSu ,slk gS tks rqEgsa fjt+d+ ns",
                            "verse 67:21": "exj ;s dq¶+Q+kj rks ljd’kh vkSj uQ+jr ¼ds Hk¡oj½ esa Q¡ls gq, gSa Hkyk tks Ó[+l vkSa/ks eq¡g ds cky pys og T+;knk fgnk;r ;k¶rk gksxk",
                            "verse 67:22": ";k og Ó[+l tks lh/kk cjkcj jkgs jkLr ij py jgk gks ¼,s jlwy½ rqe dg nks fd [+kqnk rks ogh gS ftlus rqedks fur u;k iSnk fd;k",
                            "verse 67:23": "vkSj rqEgkjs okLrs dku vkSj vk¡[k vkSj fny cuk, ¼exj½ rqe rks cgqr de Óqdz vnk djrs gks",
                            "verse 67:24": "dg nks fd ogh rks gS ftlus rqedks t+ehu esa QSyk fn;k vkSj mlh ds lkeus tek fd, tkvksxs",
                            "verse 67:25": "vkSj dq¶+Q+kj dgrs gSa fd vxj rqe lPps gks rks ¼vkf[+kj½ ;s ok;nk dc ¼iwjk½ gksxk",
                            "verse 67:26": "¼,s jlwy½ rqe dg nks fd ¼bldk½ bYe rks cl [+kqnk gh dks gS vkSj eSa rks flQZ lkQ+ lkQ+ ¼vt+kc ls½ Mjkus okyk gw¡",
                            "verse 67:27": "rks tc ;s yksx mls djhc ls ns[k ysaxs ¼[+kkSQ ds ekjs½ dkfQjksa ds psgjs fcxM+ tk,¡xs vkSj muls dgk tk,xk ;s ogh gS ftlds rqe [+kokLrx+kj Fks",
                            "verse 67:28": "¼,s jlwy½ rqe dg nks Hkyk ns[kks rks fd vxj [+kqnk eq>dks vkSj esjs lkfFk;ksa dks gykd dj ns ;k ge ij jge Qjek, rks dkfQ+jksa dks nnZukd vt+kc ls dkSu iukg nsxk",
                            "verse 67:29": "rqe dg nks fd ogh ¼[+kqnk½ cM+k jge djus okyk gS ftl ij ge bZeku yk, gSa vkSj geus rks mlh ij Hkjkslk dj fy;k gS rks vud+jhc gh rqEgsa ekywe gks tk,xk fd dkSu ljhgh xqejkgh esa ¼iM+k½ gS",
                            "verse 67:30": ",s jlwy rqe dg nks fd Hkyk ns[kks rks fd vxj rqEgkjk ikuh t+ehu ds vUnj pyk tk, dkSu ,slk gS tks rqEgkjs fy, ikuh dk p’ek cgk yk,"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Maha Suci Allah Yang di tangan-Nyalah segala kerajaan, dan Dia Maha Kuasa atas segala sesuatu,",
                            "verse 67:2": "Yang menjadikan mati dan hidup, supaya Dia menguji kamu, siapa di antara kamu yang lebih baik amalnya. Dan Dia Maha Perkasa lagi Maha Pengampun.",
                            "verse 67:3": "Yang telah menciptakan tujuh langit berlapis-lapis, kamu sekali-kali tidak melihat pada ciptaan Tuhan Yang Maha Pemurah sesuatu yang tidak seimbang. Maka lihatlah berulang-ulang, adakah kamu lihat sesuatu yang tidak seimbang?",
                            "verse 67:4": "Kemudian pandanglah sekali lagi niscaya penglihatanmu akan kembali kepadamu dengan tidak menemukan sesuatu cacat dan penglihatanmu itupun dalam keadaan payah.",
                            "verse 67:5": "Sesungguhnya Kami telah menghiasi langit yang dekat dengan bintang-bintang dan Kami jadikan bintang-bintang itu alat-alat pelempar syaitan, dan Kami sediakan bagi mereka siksa neraka yang menyala-nyala.",
                            "verse 67:6": "Dan orang-orang yang kafir kepada Tuhannya, memperoleh azab Jahannam. Dan itulah seburuk-buruk tempat kembali.",
                            "verse 67:7": "Apabila mereka dilemparkan ke dalamnya mereka mendengar suara neraka yang mengerikan, sedang neraka itu menggelegak,",
                            "verse 67:8": "hampir-hampir (neraka) itu terpecah-pecah lantaran marah. Setiap kali dilemparkan ke dalamnya sekumpulan (orang-orang kafir). Penjaga-penjaga (neraka itu) bertanya kepada mereka: \"Apakah belum pernah datang kepada kamu (di dunia) seorang pemberi peringatan?\"",
                            "verse 67:9": "Mereka menjawab: \"Benar ada, sesungguhnya telah datang kepada kami seorang pemberi peringatan, maka kami mendustakan (nya) dan kami katakan: ’Allah tidak menurunkan sesuatupun, kamu tidak lain hanyalah di dalam kesesatan yang besar’\".",
                            "verse 67:10": "Dan mereka berkata: \"Sekiranya kami mendengarkan atau memikirkan (peringatan itu) niscaya tidaklah kami termasuk penghuni-penghuni neraka yang menyala-nyala\".",
                            "verse 67:11": "Mereka mengakui dosa mereka. Maka kebinasaanlah bagi penghuni-penghuni neraka yang menyala-nyala.",
                            "verse 67:12": "Sesungguhnya orang-orang yang takut kepada Tuhannya Yang tidak nampak oleh mereka, mereka akan memperoleh ampunan dan pahala yang besar.",
                            "verse 67:13": "Dan rahasiakanlah perkataanmu atau lahirkanlah; sesungguhnya Dia Maha Mengetahui segala isi hati.",
                            "verse 67:14": "Apakah Allah Yang menciptakan itu tidak mengetahui (yang kamu lahirkan dan rahasiakan); dan Dia Maha Halus lagi Maha Mengetahui?",
                            "verse 67:15": "Dialah Yang menjadikan bumi itu mudah bagi kamu, maka berjalanlah di segala penjurunya dan makanlah sebahagian dari rezki-Nya. Dan hanya kepada-Nya-lah kamu (kembali setelah) dibangkitkan.",
                            "verse 67:16": "Apakah kamu merasa aman terhadap Allah yang di langit bahwa Dia akan menjungkir balikkan bumi bersama kamu, sehingga dengan tiba-tiba bumi itu bergoncang?,",
                            "verse 67:17": "atau apakah kamu merasa aman terhadap Allah yang di langit bahwa Dia akan mengirimkan badai yang berbatu. Maka kelak kamu akan mengetahui bagaimana (akibat mendustakan) peringatan-Ku?",
                            "verse 67:18": "Dan sesungguhnya orang-orang yang sebelum mereka telah mendustakan (rasul-rasul-Nya). Maka alangkah hebatnya kemurkaan-Ku.",
                            "verse 67:19": "Dan apakah mereka tidak memperhatikan burung-burung yang mengembangkan dan mengatupkan sayapnya di atas mereka? Tidak ada yang menahannya (di udara) selain Yang Maha Pemurah. Sesungguhnya Dia Maha Melihat segala sesuatu.",
                            "verse 67:20": "Atau siapakah dia yang menjadi tentara bagimu yang akan menolongmu selain daripada Allah Yang Maha Pemurah? Orang-orang kafir itu tidak lain hanyalah dalam (keadaan) tertipu.",
                            "verse 67:21": "Atau siapakah dia ini yang memberi kamu rezki jika Allah menahan rezki-Nya? Sebenarnya mereka terus-menerus dalam kesombongan dan menjauhkan diri?",
                            "verse 67:22": "Maka apakah orang yang berjalan terjungkel di atas mukanya itu lebih banyak mendapat petunjuk ataukah orang yang berjalan tegap di atas jalan yang lurus?",
                            "verse 67:23": "Katakanlah: \"Dia-lah Yang menciptakan kamu dan menjadikan bagi kamu pendengaran, penglihatan dan hati\". (Tetapi) amat sedikit kamu bersyukur.",
                            "verse 67:24": "Katakanlah: \"Dia-lah Yang menjadikan kamu berkembang biak di muka bumi, dan hanya kepada-Nya-lah kamu kelak dikumpulkan\".",
                            "verse 67:25": "Dan mereka berkata: \"Kapankah datangnya ancaman itu jika kamu adalah orang-orang yang benar?\".",
                            "verse 67:26": "Katakanlah: \"Sesungguhnya ilmu (tentang hari kiamat itu) hanya pada sisi Allah. Dan sesungguhnya aku hanyalah seorang pemberi peringatan yang menjelaskan\".",
                            "verse 67:27": "Ketika mereka melihat azab (pada hari kiamat) sudah dekat, muka orang-orang kafir itu menjadi muram. Dan dikatakan (kepada mereka) inilah (azab) yang dahulunya kamu selalu meminta-mintanya.",
                            "verse 67:28": "Katakanlah: \"Terangkanlah kepadaku jika Allah mematikan aku dan orang-orang yang bersama dengan aku atau memberi rahmat kepada kami, (maka kami akan masuk surga), tetapi siapakah yang dapat melindungi orang-orang yang kafir dari siksa yang pedih?\"",
                            "verse 67:29": "Katakanlah: \"Dia-lah Allah Yang Maha Penyayang, kami beriman kepada-Nya dan kepada-Nya-lah kami bertawakkal. Kelak kamu akan mengetahui siapakah dia yang berada dalam kesesatan yang nyata\".",
                            "verse 67:30": "Katakanlah: \"Terangkanlah kepadaku jika sumber air kamu menjadi kering; maka siapakah yang akan mendatangkan air yang mengalir bagimu?\"."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Benedetto Colui nella Cui mano è la sovranità, Egli è onnipotente;",
                            "verse 67:2": "Colui che ha creato la morte e la vita per mettere alla prova chi di voi meglio opera, Egli è l'Eccelso, il Perdonatore;",
                            "verse 67:3": "Colui che ha creato sette cieli sovrapposti senza che tu veda alcun difetto nella creazione del Compassionevole. Osserva, vedi una qualche fenditura?",
                            "verse 67:4": "Osserva ancora due volte: il tuo sguardo ricadrà, stanco e sfinito.",
                            "verse 67:5": "Invero abbellimmo di luminarie il cielo più vicino, e ne abbiamo fatto strumenti; per lapidare i dèmoni per i quali abbiamo preparato la Fiamma.",
                            "verse 67:6": "Per coloro che non credono nel loro Signore, c'è il castigo dell'Inferno: qual tristo divenire!",
                            "verse 67:7": "Quando vi sono precipitati, ne sentono il fragore mentre ribolle:",
                            "verse 67:8": "manca poco a che scoppi di rabbia. Ogni volta che un gruppo vi è precipitato, i suoi guardiani chiedono: « Non vi è forse giunto un ammonitore?».",
                            "verse 67:9": "Risponderanno: « Sì, ci era giunto un ammonitore, ma noi lo tacciammo di menzogna e dicemmo: \"Allah non ha fatto scendere alcunché, voi siete in evidente errore! \"».",
                            "verse 67:10": "E diranno: «Se avessimo ascoltato o compreso, non saremmo tra i compagni del a Fiamma».",
                            "verse 67:11": "Riconoscono il loro peccato. Che siano ridotti in polvere i compagni della Fiamma!",
                            "verse 67:12": "Coloro che invece temono il loro Signore in ciò che è invisibile, avranno perdono e ricompensa grande.",
                            "verse 67:13": "Sia che nascondiate i vostri intenti o li palesiate, Egli ben conosce quello che contengono i petti.",
                            "verse 67:14": "Non conoscerebbe ciò che Egli stesso ha creato, quando Egli è il Sottile , il Ben informato?",
                            "verse 67:15": "Egli è Colui che vi ha fatto remissiva la terra: percorretela in lungo e in largo, e mangiate della Sua provvidenza. Verso di Lui è la Resurrezione.",
                            "verse 67:16": "Siete forse sicuri che Colui che sta nel cielo non vi faccia inghiottire dalla terra quando trema?",
                            "verse 67:17": "O siete sicuri che Colui che sta nel cielo non scateni contro di voi un uragano? Conoscerete allora il Mio avvertimento.",
                            "verse 67:18": "Invero coloro che li precedettero già tacciarono di menzogna. Quale fu la mia riprovazione!",
                            "verse 67:19": "Non hanno visto, sopra di loro, gli uccelli spiegare e ripiegare le ali? Non li sostiene altri che il Compassionevole. In verità Egli osserva ogni cosa.",
                            "verse 67:20": "Chi potrebbe costituire un esercito per voi, e [chi potrebbe] soccorrervi all'infuori del Compassionevole? I miscredenti sono in preda all'inganno.",
                            "verse 67:21": "Chi provvederà a voi, se Egli tratterrà la Sua provvidenza? No, essi persistono nell'insolenza e nel rifiuto.",
                            "verse 67:22": "Colui che cammina con il volto rivolto al suolo è forse meglio guidato di colui che si erge camminando sulla retta via ?",
                            "verse 67:23": "Di': « Egli è Colui che vi ha creati e vi ha dato l'udito, gli occhi e i cuori». Quanto poco Gli siete riconoscenti!",
                            "verse 67:24": "Di': « Egli è Colui che vi ha sparsi sulla terra e verso di Lui sarete riuniti».",
                            "verse 67:25": "Dicono: « A quando questa promessa? [Ditecelo,] se siete veridici».",
                            "verse 67:26": "Di': « La conoscenza [di ciò] appartiene ad Allah. Io non sono altro che un ammonitore esplicito».",
                            "verse 67:27": "Quando la vedranno da vicino, saranno stravolti i visi dei miscredenti e sarà detto loro: « Ecco ciò che vi ostinavate a chiedere! ».",
                            "verse 67:28": "Di': « Cosa credete? Sia che Allah faccia perire me e quelli che sono con me sia che ci usi misericordia, chi potrà proteggere i miscredenti da un doloroso castigo?»",
                            "verse 67:29": "Di': « Egli è il Compassionevole! Crediamo in Lui e in Lui confidiamo. Presto saprete chi è in errore evidente» .",
                            "verse 67:30": "Di': « Cosa credete? Se la vostra acqua rientrasse nelle profondità [della terra] chi vi procurerebbe acqua sorgiva?»."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "大権を掌握なされる方に祝福あれ。本当にかれは凡てのことに全能であられる。",
                            "verse 67:2": "（かれは）死と生を創られた方である。それは，あなたがたの中誰の行いが優れているのかを試みられるためで，かれは偉力ならびなく寛容であられる。",
                            "verse 67:3": "（かれは）一層一層に，7天を創られる御方。慈悲あまねく御方の創造には，少しの不調和もないことを見るであろう。それで改めて観察しなさい。あなたは何か裂け目を見るのか。",
                            "verse 67:4": "それで今一度，目を上げて見るがいい。あなたの視線は，（何の欠陥も捜し出せず）只ぼんやりしてもとに戻るだけである。",
                            "verse 67:5": "かれは灯明（星）をもって，最下層の天を飾り，悪魔たちに対する磔（流星）となし，またかれらのために烈火の懲罰を準備した。",
                            "verse 67:6": "かれらの主を信じない者には，地獄の懲罰がある。何と悪い帰り所であることよ。",
                            "verse 67:7": "かれらがその中に投げ込まれる時，それ（地獄）が沸騰するかのように不気味で忌しい音でうなるのをかれらは聞こう。",
                            "verse 67:8": "激しい怒りのために破裂するかのようである。一団がその中に投げ込まれる度に，そこの看守はかれらに，「あなたがたに，警告者はやって来なかったのか。」と問う。",
                            "verse 67:9": "かれらは言う。「そうです，確かに一人の警告者がわたしたちの許にやって来ました。だがわたしたちは拒否して言った。『アッラーは何（の啓示）も下されない。あなたがたは，大変な過誤の中にいるだけである。』」",
                            "verse 67:10": "かれらはなお言う。「わたしたちが聞き，熟考したならば，烈火の住人の中には入らなかったでしょうに。」",
                            "verse 67:11": "かれらは自分の様々な罪を認めた。烈火の住人は，（容赦から）遠く離れている。",
                            "verse 67:12": "本当に目に見えない主を，畏れる者には，容赦と偉大な報奨があろう。",
                            "verse 67:13": "あなたがたが言葉を隠していても，またそれを表わしても，かれは本当に胸の中のものを知っておられる。",
                            "verse 67:14": "かれが創造されたものを，知らないであろうか。かれは，深奥を理解し通暁なされる。",
                            "verse 67:15": "かれこそは，大地をあなたがたに使い易くなされた方である。それでその諸地域を往来し，かれの糧を食べるがよい。そして復活の時にはかれに召されていく身である。",
                            "verse 67:16": "大地が揺れ動く時，天にいます方が，あなたがたをそれに呑み込ませられないであろうと，安心しているのか。",
                            "verse 67:17": "またあなたがたは天にいます方が，（砂石の）烈風をあなたがたに送られないであろうと，安心しているのか。やがてあなたがたは，わが警告が如何なるものかを知ろであろう。",
                            "verse 67:18": "本当にあなたがた以前の者たちも，（わが警告を）嘘であるとした。それであが不興が如何に（恐ろしいもので）あったか。",
                            "verse 67:19": "かれらは上を飛ぶ鳥に就いて考えないのか。翼を広げ，またそれを畳むではないか。慈悲あまねく御方の外，誰がそれらを支えることができよう。本当にかれは，凡てのことを御存知であられる。",
                            "verse 67:20": "慈悲あまねく御方を差し置いてあなたがたを助ける軍勢となり得るものは，誰であるのか。不信者は，妄想しているに過ぎない。",
                            "verse 67:21": "かれがもし御恵みを止められると，あなたがたに恵みをなし得るものは誰であるのか。いやかれらは高慢と，（真理からの）回避に固執する。",
                            "verse 67:22": "顔を伏せて（只頑なに）歩く者と，正しい道の上を規則正しく歩く者と，どちらがよく導かれるのか。",
                            "verse 67:23": "言ってやるがいい。「かれこそはあなたがたを創り，あなたがたのために，聴覚，視覚，感情（知力）を与えられた方である。何とあなたがたの感謝の念の薄いことよ。」",
                            "verse 67:24": "言ってやるがいい。「かれこそは，あなたがたを地上に分散し繁栄させられた方であり，あなたがたはかれの御許に集められる。」",
                            "verse 67:25": "かれら（不信者）は，「もしあなたがたの言葉が真実なら，この契約は何時（果たされるの）であろうか。」と言う。",
                            "verse 67:26": "言ってやろがいい。「本当にそれを知るのは，アッラーだけである。わたしは公明な警告者に過ぎない。」",
                            "verse 67:27": "かれらが目の辺にそれを見る時，不信者たちの顔は悲しみに曇る。「これがあなたがたの求めていたもの（約束の成就）である。」と告げられる。",
                            "verse 67:28": "言ってやるがいい。「あなたがたは考えないのか，もしアッラーが，わたしやわたしと一緒の者を滅ぼされても，また慈悲を与えられても，凡そ不信者を痛烈な懲罰から救うものは誰であろうか。」",
                            "verse 67:29": "言ってやるがいい。「かれは慈悲あまねく御方であられ，わたしたちはかれを信仰し，かれに（全てを）托す。やがてあなたがたは，明らかな過誤の中にいる者が誰であるのかを知るであろう。」",
                            "verse 67:30": "言ってやるがいい。「あなたがたは考えないのか。もし或る朝，あなたがたの水が地下に沈み去ったならば，涌き出る水を，あなたがたに(■?)せるものは，一体誰であるのか。」"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "왕국을 소유하고 계시는 하 나님께 축복이 있으소서 실로 그 분은 모든 일에 전지전능하심이라",
                            "verse 67:2": "죽음과 생명을 제정하시어 그것으로 너희가 선을 행하는지 시 험하고자 하시니 그분은 권능과 지혜로 충만하심이라",
                            "verse 67:3": "그분은 칠천을 층으로 하여 차례로 창조하셨노라 너희는 그것이 완전무결하여 무엇하나 결함이없음을 볼 것이니 다시 한번 눈을돌려보라 결함을 볼 수 있겠느뇨",
                            "verse 67:4": "그런 후 다시 한번 눈을 들어보라 피곤하여 있던 눈이 겸손하 고 순종한 시력으로 돌아오리라",
                            "verse 67:5": "실로 하나님은 가장 낮은 하 늘을 등불로서 장식하였고 그 것으로 사탄을 물리침에 유용하게하였으며 그들을 위해 타오르는 불지옥의 응벌을 준비하셨도다",
                            "verse 67:6": "주님을 믿지 아니한 자들을 위해서 사악한 응벌이 있나니",
                            "verse 67:7": "그들이 그곳으로 던져질 때 그들은 신음소리 같은 무서운 비 탄의 소리를 들을 것이라",
                            "verse 67:8": "지옥은 분노하여 폭발할 것이니 불신자의 무리가 던져질 때 마다 너희에게 한 경고자가 이르지 아니 했었느뇨 라고 수호자가 질 문할 것이라",
                            "verse 67:9": "실로 저희에게 한 경고자가 도래하였으나 저희가 그를 거역 했습니다 하나님은 아무 것도 계 시하지 아니했습니다 당신들은 크게 방황하고 있을 뿐입니다 라고 말하더라",
                            "verse 67:10": "더하여 말하길 우리가 귀를기울였다면 또는 숙고 했더라면 우리는 타오르는 불지옥의 동료중에 있지 아니했을 텐데 라고 말하더라",
                            "verse 67:11": "그들은 죄악들을 고백하나 타오르는 불지옥의 동료들로부터 용서가 되지 않노라",
                            "verse 67:12": "그러나 보이지 아니한 주님을 두려워 한 자들에게는 관용과 큰 보상이 있노라",
                            "verse 67:13": "너희가 숨기어 말하는 것과 드러내어 말하는 것도 하나님은 마음속의 모든 것을 아심으로 충 만하시니라",
                            "verse 67:14": "그분이 창조한 것을 그분이 모를리 있느뇨 실로 그분은 신비 한 모든 것을 이해하시고 아시는 분이시라",
                            "verse 67:15": "하나님은 너희를 위해 대지 를 유연하게 하셨나니 곳곳을 다 녀 보라 그리고 그분이 베푼 양식 을 섭취하라 죽은 후에는 그분께 로 귀의하노라",
                            "verse 67:16": "하늘에 계신 그분께서 대지 를 흔들어 그것이 너희를 삼켜 버 리지는 못하게 할 것이라 안심하 느뇨",
                            "verse 67:17": "아니면 하늘에 계신 그분께 서 너희 위에 응벌을 내리지 아니 할 것이라 안심하느뇨 그때 너희 는 나의 응벌이 어떠한 것인가를 알게 되리라",
                            "verse 67:18": "실로 그들 이전 백성들이 나의 경고를 거역했을 때 그들 위에 내려진 나의 벌이 얼마나 무서웠 더뇨",
                            "verse 67:19": "머리 위에서 새들이 날개를 폈다가 접었다 하면서 먹이를 채 려고 덮치는 새들을 보지 못했더 뇨 자비로우신 하나님 외에는 어 느 누구도 그렇게 유지할 수 없나니 실로 그분은 모든 것을 지켜보고 계심이라",
                            "verse 67:20": "자비로우신 하나님 외에 너 희를 도울 주인은 누구이뇨 실로 불신자들은 환상에 빠져 있더라",
                            "verse 67:21": "하나님이 양식을 거두신다면너희에게 누가 너희에게 일용할 양식을 주겠느뇨 그런데도 그들은진리에서 벗어나 오만하도다",
                            "verse 67:22": "고개 숙여 걷는 자가 낫겠 느뇨 아니면 바른 길을 걷는자의 인도됨이 낫겠느뇨",
                            "verse 67:23": "일러가로되 너희를 창조하사성장케 하고 듣는 능력과 보는 능력과 감각의 능력롸 이해의 능력 을 주신 분이 바로 하나님이시라 그러나 너희는 감사하지 않더라",
                            "verse 67:24": "일러가로되 대지 위에 너희 를 번성케 하신 분이 하나님이시 거늘 너희 모두가 그분께로 집합 되노라",
                            "verse 67:25": "그러나 그들은 그대가 진실 을 말하고 있을 때 이 약속이 언 제 실행되느뇨 라고 물으매",
                            "verse 67:26": "일러가로되 그것은 하나님 만이 아시는 것으로 실로 나는 분명한 경고자에 불과하니라",
                            "verse 67:27": "그러나 그들이 그것을 가까 이서 목격할 때면 불신자들의 얼 굴은 슬픔으로 가득찰 것이며 그 것이 너희가 구하던 이행될 약속 이요 라는 말씀이 들려올 것이라",
                            "verse 67:28": "일러가로되 나와 그리고 나 와 함께 한 자들을 하나님께서 멸망케 하시거나 아니면 우리에게 은혜를 베푼다 하더라도 고통스러운 응벌로부터 불신자들을 누가 구제할 수 있을런지 너희가 생각 해 보았느뇨",
                            "verse 67:29": "일러가로되 그분은 자비로우신 분으로 우리는 그분만을 믿으 며 그분에게만 의탁하나니 너희는분명히 방황했던 자가 누구인지 알게 되리라",
                            "verse 67:30": "일러가로되 물이 땅속으로 스며들어 물을 잃게 되었을 때 누가 너희에게 흐르는 물을 공급하 여 주겠느뇨"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "گه‌وره‌و موباره‌ك و پیرۆزه‌، ئه‌و زاته‌ی که هه‌موو بوونه‌وه‌رو جیهانی به‌ده‌سته‌، ئه‌و زاته‌ی ده‌سه‌ڵاتی به‌سه‌ر هه‌موو شتێکدا هه‌یه‌.",
                            "verse 67:2": "هه‌ر ئه‌و خۆی مردن و ژیانی به‌دیهێناوه‌، تا تاقیتان بکاته‌وه‌، کێتان کرده‌وه‌ی چاکترو په‌سه‌ندتره‌، هه‌ر ئه‌ویش زاتێکی باڵاده‌سته به‌سه‌ر بێ باوه‌ڕاندا، وه لێخۆشبووه له ئیمانداران.",
                            "verse 67:3": "هه‌روه‌ها ئه‌و زاته ئاسمانه‌کانی به حه‌وت چین دروست کردووه‌، له نێو به‌دیهێنراوه‌کانی ئه‌و خوای میهره‌بانه‌دا هیچ ناڕێکی و ناته‌واویه‌ك به‌دی ناکه‌یت، ئه‌ی ئینسان: هه‌رچاو بگێڕه‌و سه‌رنج بده بزانه هیچ درزو که‌م و کووڕیه‌ك به‌دی ده‌که‌یت؟!",
                            "verse 67:4": "پاشان هه‌ر سه‌رنج بده‌و چاو بگێره‌و ورد به‌ره‌وه جار له دوای جارو کۆڵ مه‌ده‌، سه‌رسام و ملکه‌چ ده‌بیت، چاوت به نائومێدی ده‌گه‌ڕێته‌وه له‌کاتێکدا که چاوت ماندووه‌و په‌کی که‌وتووه‌.",
                            "verse 67:5": "سوێند به‌خوا بێگومان ئێمه ئاسمانی دنیامان کردووه به چراخان (به‌هۆی ئه‌ستێره‌کانه‌وه که به شه‌وگاردا به‌دی ده‌کرێن) و به‌و ئه‌ستێرانه شه‌یتانه‌کان ڕاو ده‌که‌ین، له قیامه‌تیشدا سزاو ئه‌شکه‌نجه‌ی دۆزه‌خمان بۆ ئاماده کردوون.",
                            "verse 67:6": "هه‌روه‌ها بۆ ئه‌وانه‌ش که باوه‌ڕیان به په‌روه‌ردگاریان نیه‌، سزاو ئازاری دۆزه‌خ ئاماده‌یه‌، ئای که چاره‌نووس و سه‌رئه‌نجامێکی زۆر ناسۆرو ناخۆشه‌...",
                            "verse 67:7": "کاتێك فڕێ ده‌درێنه ناوی ده‌نگێکی ناسازو ناخۆش و لووره‌یه‌ك له دۆزه‌خه‌وه ده‌بیستن، له‌کاتێکدا قوڵپ ده‌دات و ده‌کوڵێت.",
                            "verse 67:8": "له داخی خوانه‌ناسان خه‌ریکه پارچه پارچه ببێت و لێك ببێته‌وه‌، هه‌ر جارێك ده‌سته‌و تاقمێك فڕێ ده‌درێته ناوی پاسه‌وانی دۆزه‌خ لێیان ده‌پرسێت: باشه‌، ترسێنه‌رێکتان بۆ نه‌هات تا له‌م سه‌رئه‌نجامه ئاگادارتان بکات؟!",
                            "verse 67:9": "له وه‌ڵامدا به‌که‌ساسیه‌وه ده‌ڵێن: با، به‌ڵێ، له‌ڕاستیدا ترسێنه‌رمان بۆهات، به‌ڵام ئێمه بڕوامان پێنه‌کردن و وتمان: خوا هیچی له‌م باره‌یه‌وه نه‌ناردووه‌، ئێوه ته‌نها له گومڕایی گه‌وره‌دا گیرتان خواردووه‌و هیچی تر!!",
                            "verse 67:10": "ئینجا ده‌ڵێن: ئه‌گه‌ر ئێمه گوێمان بگرتایه‌و بیرو هۆشمان به‌کار بهێنایه نه‌ده‌بووینه نیشته‌جێی دۆزه‌خ.",
                            "verse 67:11": "ئه‌وسا ئیتر به‌ناچاریی و خه‌جاڵه‌تیه‌وه دان به‌گوناهو تاوانی خۆیاندا ده‌نێن، جا با نیشته‌جێکانی دۆزه‌خ له‌وه‌و لا ترچن.",
                            "verse 67:12": "به‌ڕاستی ئه‌وانه‌ی که له په‌روه‌ردگاریان ده‌ترسن له په‌نهانیدا، بۆ ئه‌وانه لێخۆشبوون و پاداشتی گه‌وره ئاماده‌یه‌..",
                            "verse 67:13": "خه‌ڵکینه‌؛ چونیه‌که بۆتان چ به‌نهێنی قسه بکه‌ن یان به‌ئاشکرا، ئه‌و زاته به‌هه‌موو ئه‌و خه‌ته‌ره‌و خه‌یاڵانه‌ی دێن به‌کرۆکی سینه‌کاندا زاناو ئاگایه‌",
                            "verse 67:14": "مه‌گه‌ر خوا نازانێت کێی دروست کردووه‌و چۆنی دروست کردووه‌، له‌کاتێکدا ئه‌و زاته وردکارو به سۆزو ئاگایه‌.",
                            "verse 67:15": "هه‌ر ئه‌و زاته زه‌وی بۆ زه‌لیل و ملکه‌چ کردوون (هه‌رچیتان بوێت له‌سه‌ری دروست ده‌که‌ن، چۆنتان بوێت به‌کاری ده‌هێنن)، بگه‌ڕێن به هه‌موو گۆشه‌و که‌ناریدا، له‌و ڕزق و ڕۆزیه‌ش بخۆن که پێشکه‌شتانی ده‌کات، دڵنیاش بن که سه‌رئه‌نجام گه‌ڕانه‌وه‌تان بۆ لای ئه‌و زاته‌یه‌.",
                            "verse 67:16": "ئایا له‌و زاته ناترسن که له سه‌رووی ئاسمانه‌وه‌یه‌، که به‌ناخی زه‌ویدا بتانباته خواره‌وه‌؟! جا ده‌ستبه‌جێ ئه‌و زه‌وی یه بێته له‌رزه‌...",
                            "verse 67:17": "یاخود له‌و زاته ناترسن که له سه‌روو ئاسماندایه که بایه‌کی به‌هێز هه‌ڵکاته سه‌رتان و به‌رد بارانتان بکات؟! ئه‌وسا ده‌زانن هه‌ڕه‌شه‌ی من چۆن بووه‌.",
                            "verse 67:18": "سوێند به‌خوا بێگومان خه‌ڵکانی تری پێش ئه‌مان بڕوایان به‌پێغه‌مبه‌رانی ئێمه نه‌کرد ئاشکرایه چ به‌ڵایه‌کم به‌سه‌رهێناون و چۆن ته‌مێم کردن.",
                            "verse 67:19": "ئایا سه‌رنجی باڵنده‌یان نه‌داوه به‌سه‌ریانه‌وه پۆل پۆل ده‌فڕن و باڵه‌کانیان لێك ده‌نێن، ئه‌و باڵندانه جگه خوای میهره‌بان که‌س به ئاسمانه‌وه ڕاگیریان ناکات، به‌ڕاستی ئه‌و زاته به هه‌موو شتێك بینایه‌و هیچی لێ ون نابێت و چاودێری هه‌موو دروستکراوانی ده‌کات (فڕۆکه‌و که‌شتی ئاسمانی و.... هتد، هه‌ر ئه‌و زاته به هۆکاره‌کان له ئاسماندا هاتووچۆیان پێده‌کات و ڕایان ده‌گرێت).",
                            "verse 67:20": "ئایا کێیه ئه‌و که‌سه خۆی به سه‌ربازو به‌رگریکه‌ر له ئێوه ده‌زانێت و وا ده‌نوێنێت که ده‌توانێت به‌بێ خوای میهره‌بان سه‌رتان بخات و پایه‌دارتان بکات؟! نه‌خێر، کافران ته‌نها له خه‌ڵه‌تاویدان و هیچی تر؟!",
                            "verse 67:21": "یاخود کێ یه ئه‌وه‌ی که ڕزق و ڕۆزیتان پێده‌به‌خشێت، ئه‌گه‌ر خوا لێتان بگرێته‌وه‌؟! نه‌خێر، به‌و تاقی کردنه‌وه‌یه‌ش بێ باوه‌ڕان هه‌ر له گومڕایی و سه‌رلێشێواوی و دووره په‌رێزی له به‌رنامه‌ی خوا ڕۆچوون!",
                            "verse 67:22": "جا ئایا ئه‌و که‌سه‌ی که ده‌مه‌و ڕوو که‌وتووه‌و به‌و حاڵه‌وه ده‌ڕوات، چاکتر ڕێگه ده‌زانێت؟ یان ئه‌و که‌سه‌ی که به‌سه‌ر شه‌قامێکی ڕاست و ڕه‌واندا به ڕێك و پێکی ده‌ڕوات به‌ڕێوه‌؟!",
                            "verse 67:23": "ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم پێیان بڵێ: هه‌ر خوایه‌، که ئێوه‌ی دروستکردووه‌و ده‌زگای بینین و بیستن و تێگه‌یشتنی پێ به‌خشیون، که‌چی که‌متان شوکرانه بژێرو سوپاسگوزارن.",
                            "verse 67:24": "هه‌روه‌ها پێیان بڵێ: هه‌ر ئه‌و خوایه‌؛ ئێوه‌ی له خاکی زه‌وی پێگه‌یاندووه‌، گه‌ڕانه‌وه‌و کۆکردنه‌وه‌شتان بۆ لای ئه‌وه‌.",
                            "verse 67:25": "بێ باوه‌ڕان ده‌ڵێن: باشه‌، که‌ی ئه‌م به‌ڵێنه دێته دی، (زیندووکردنه‌وه‌و لێپرسینه‌وه‌) ئه‌گه‌ر ئێوه ڕاستگۆن؟!",
                            "verse 67:26": "پێیان بڵێ: زانیاری ئه‌و کاته لای خوایه‌، من ته‌نها بێدار که‌ره‌وه‌یه‌کی ئاشکرام.",
                            "verse 67:27": "کاتێك بینیان ئه‌و به‌ڵێنه خواییه یه‌خه‌یان پێ ده‌گرێت، چڕوچاوی ئه‌وانه‌ی که باوه‌ڕیان نه‌بووه‌، تاڵ و ترش و ناشرین ده‌کرێت، ئه‌وسا پێیان ده‌وترێت ئا ئه‌مه ئه‌و به‌ڵێنه‌یه که‌پێتان ده‌درا.",
                            "verse 67:28": "هه‌روه‌ها پێیان بڵێ: باشه‌، ئه‌گه‌ر خوا، من و هه‌موو ئه‌و که‌سانه‌ی که شوێنم که‌وتوون له‌ناو به‌رێت، یان به‌زه‌یی پیاماندا بێته‌وه‌، ئه‌وسا کێ هه‌یه بێ باوه‌ڕان له سزای پڕ ئێشی دۆزه‌خ ڕزگار بکات؟! (ئه‌گه‌ر له‌سه‌ر یاخی بوونیان به‌رده‌وام بن)",
                            "verse 67:29": "هه‌روه‌ها بڵێ: ئێمه خوای میهره‌بانمان هه‌یه‌و باوه‌ڕی پته‌ومان پێیه‌تی و پشت و په‌نامان هه‌ر ئه‌وه‌، جا ئیتر ڕۆژێك دێت که به ڕوونی بۆتان ده‌رده‌که‌وێت کێ له‌گومڕایی ئاشکرادا گیری خواردووه‌و سه‌ری لێ شێواوه‌.",
                            "verse 67:30": "پێیان بڵێ: هه‌واڵم بده‌نێ باشه ئه‌گه‌ر ئاوه‌که‌تان ڕۆچوو، کێ ده‌توانێت ئاوی سازگارو ڕه‌وانتان بۆ به‌ده‌ست بهێنێت؟! (جگه له خوای میهره‌بان)."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Maha Berkat (serta Maha Tinggilah kelebihan) Tuhan yang menguasai pemerintahan (dunia dan akhirat) dan memanglah Dia Maha Kuasa atas tiap-tiap sesuatu;",
                            "verse 67:2": "Dialah yang telah mentakdirkan adanya mati dan hidup (kamu) untuk menguji dan menzahirkan keadaan kamu: Siapakah di antara kamu yang lebih baik amalnya; dan Dia Maha Kuasa (membalas amal kamu), lagi Maha Pengampun, (bagi orang-orang yang bertaubat);",
                            "verse 67:3": "Dialah yang telah mengaturkan kejadian tujuh petala langit yang berlapis-lapis; engkau tidak dapat melihat pada ciptaan Allah Yang Maha Pemurah itu sebarang keadaan yang tidak seimbang dan tidak munasabah; (jika engkau ragu-ragu) maka ulangilah pandanganmu dapatkah engkau melihat sebarang kecacatan?",
                            "verse 67:4": "Kemudian ulangilah pandanganmu berkali-kali, nescaya pandanganmu itu akan berbalik kepadamu dengan hampa (daripada melihat sebarang kecacatan), sedang dia pula berkeadaan lemah lesu (kerana habis tenaga dengan sia-sia).",
                            "verse 67:5": "Dan demi sesungguhnya! Kami telah menghiasi langit yang dekat (pada penglihatan penduduk bumi) dengan bintang-bintang dan Kami jadikan bintang-bintang itu punca rejaman terhadap Syaitan-syaitan dan Kami sediakan bagi mereka azab Neraka yang menjulang-julang.",
                            "verse 67:6": "Dan bagi orang-orang yang kufur ingkar terhadap Tuhan mereka, disediakan azab Neraka Jahannam dan itulah seburuk-buruk tempat kembali.",
                            "verse 67:7": "Apabila mereka dicampakkan ke dalamnya, mereka mendengar suara jeritannya meraung-raung, sedang ia menggelegak.",
                            "verse 67:8": "Hampir-hampir ia pecah berkecai-kecai kerana kuat marahnya. Tiap-tiap kali dicampakkan ke dalamnya sekumpulan besar (dari orang kafir), bertanyalah penjaga-penjaga Neraka itu kepada mereka: Tidakkah kamu pernah didatangi seorang Rasul pemberi ingatan dan amaran (di dunia dahulu)?",
                            "verse 67:9": "Mereka menjawab: Ada! Sebenarnya telah datang kepada kami seorang Rasul pemberi ingatan dan amaran, lalu kami dustakan serta kami katakan (kepadanya): Allah tidak menurunkan sesuatupun, kamu (wahai orang yang mendakwa menjadi Rasul) hanyalah berada dalam kesesatan yang besar!",
                            "verse 67:10": "Dan mereka berkata: Kalaulah kami dahulu mendengar dan memahami (sebagai orang yang mencari kebenaran), tentulah kami tidak termasuk dalam kalangan ahli Neraka.",
                            "verse 67:11": "Akhirnya mereka mengakui dosa-dosa mereka (sebagai orang-orang yang kufur ingkar), maka tetaplah jauhnya rahmat Allah dari ahli Neraka.",
                            "verse 67:12": "Sesungguhnya orang-orang yang takut (melanggar hukum) Tuhannya semasa mereka tidak dilihat orang dan semasa mereka tidak melihat azab Tuhan, mereka beroleh keampunan dan pahala yang besar.",
                            "verse 67:13": "Dan tuturkanlah perkataan kamu dengan perlahan atau dengan nyaring, (sama sahaja keadaannya kepada Allah), kerana sesungguhnya Allah Maha Mengetahui akan segala (isi hati) yang terkandung di dalam dada.",
                            "verse 67:14": "Tidakkah Allah yang menciptakan sekalian makhluk itu mengetahui (segala-galanya)? Sedang Dia Maha Halus urusan PentadbiranNya, lagi Maha Mendalam PengetahuanNya!",
                            "verse 67:15": "Dialah yang menjadikan bumi bagi kamu: Mudah digunakan, maka berjalanlah di merata-rata ceruk rantaunya, serta makanlah dari rezeki yang dikurniakan Allah; dan (ingatlah), kepada Allah jualah (tempat kembali kamu sesudah) dibangkitkan hidup semula; (maka hargailah nikmatNya dan takutilah kemurkaanNya).",
                            "verse 67:16": "Patutkah kamu merasa aman (tidak takut) kepada Tuhan yang pusat pemerintahanNya di langit itu: Menunggang-balikkan bumi menimbus kamu, lalu bergegarlah bumi itu dengan serta-merta (melenyapkan kamu di bawahnya)?",
                            "verse 67:17": "Atau patutkah kamu merasa aman (tidak takut) kepada Allah yang pusat pemerintahanNya di langit itu: Menghantarkan kepada kamu angin ribut yang menghujani kamu dengan batu; maka dengan itu, kamu akan mengetahui kelak bagaimana buruknya kesan amaranKu?",
                            "verse 67:18": "Dan demi sesungguhnya! orang-orang (kafir) yang terdahulu daripada mereka telah mendustakan (rasul-rasulnya lalu mereka dibinasakan); dengan yang demikian, (perhatikanlah) bagaimana buruknya kesan kemurkaanKu.",
                            "verse 67:19": "Patutkah mereka menutup mata dan tidak memerhatikan (kekuasaan Allah pada) burung-burung yang terbang di atas mereka, (siapakah yang menjaganya ketika) burung-burung itu mengembang dan menutupkan sayapnya? Tidak ada yang menahannya (daripada jatuh) melainkan (kekuasaan) Allah Yang Maha Pemurah. Sesungguhnya Dia Maha Melihat serta mengetahui akan tiap-tiap sesuatu.",
                            "verse 67:20": "Bahkan siapa dia yang menjadi tentera bagi kamu, yang akan menolong kamu selain dari Allah Yang Maha Pemurah? (Sebenarnya) orang-orang yang kafir tidak lain hanyalah berada dalam keadaan terpedaya.",
                            "verse 67:21": "Atau siapa dia yang dapat memberi rezeki kepada kamu jika Allah menahan rezekiNya? (Tidak ada sesiapapun), bahkan mereka (yang musyrik itu) kekal terus dalam keadaan sombong angkuh serta melarikan diri (dari kebenaran).",
                            "verse 67:22": "Maka adakah orang yang berjalan (melalui jalan yang tidak betul, yang menyebabkan dia selalu jatuh) tersungkur di atas mukanya: Boleh mendapat hidayat atau orang yang berjalan tegak betul, melalui jalan yang lurus rata?",
                            "verse 67:23": "Katakanlah (wahai Muhammad): Allah yang menciptakan kamu (dari tiada kepada ada) dan mengadakan bagi kamu pendengaran dan penglihatan serta hati (untuk kamu bersyukur, tetapi) amatlah sedikit kamu bersyukur.",
                            "verse 67:24": "Katakanlah lagi: Dialah yang mengembangkan kamu di bumi dan kepadaNyalah kamu akan dihimpunkan.",
                            "verse 67:25": "Dan mereka (yang ingkar) berkata: Bilakah datangnya (hari kiamat) yang dijanjikan itu, jika betul kamu orang-orang yang benar?",
                            "verse 67:26": "Katakanlah (wahai Muhammad): Sesungguhnya ilmu pengetahuan (tentang masa kedatangannya) hanya ada pada sisi Allah dan sesungguhnya aku hanyalah seorang Rasul pemberi ingatan dan amaran yang terang nyata.",
                            "verse 67:27": "Kemudian apabila (datang kiamat dan) mereka melihat (azab) yang dijanjikan itu secara dekat, muramlah muka orang-orang yang kafir itu, serta dikatakan (kepada mereka): Inilah dia yang dahulu kamu kerap kali minta disegerakan kedatangannya!.",
                            "verse 67:28": "Tanyalah (wahai Muhammad, kepada mereka): Bagaimana fikiran kamu, jika Allah binasakan daku dan orang-orang yang bersama-sama denganku (sebagaimana yang kamu harap-harapkan) atau Dia memberi rahmat kepada kami (sehingga kami dapat mengalahkan kamu), maka siapakah yang dapat melindungi orang-orang yang kafir dari azab seksa yang tidak terperi sakitnya?.",
                            "verse 67:29": "Tegaskan (wahai Muhammad, kepada mereka): Allah Dialah Yang Maha Pemurah, yang kami beriman kepadaNya dan yang kepadaNya kami berserah diri; oleh itu kamu akan mengetahui kelak siapakah yang berada dalam kesesatan yang nyata.",
                            "verse 67:30": "Katakanlah lagi: Bagaimana fikiran kamu, sekiranya air kamu hilang lenyap (di telan bumi), maka siapakah (selain Allah) yang dapat mendatangkan kepada kamu air yang sentiasa terpancar mengalir?."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "پربركت و زوال‏ناپذير است كسى كه حكومت جهان هستى به دست اوست، و او بر هر چيز تواناست",
                            "verse 67:2": "آن كس كه مرگ و حيات را آفريد تا شما را بيازمايد كه كدام يك از شما بهتر عمل مى‏كنيد، و او شكست‏ناپذير و بخشنده است",
                            "verse 67:3": "همان كسى كه هفت آسمان را بر فراز يكديگر آفريد; در آفرينش خداوند رحمان هيچ تضاد و عيبى نمى‏بينى! بار ديگر نگاه كن، آيا هيچ شكاف و خللى مشاهده مى‏كنى؟!",
                            "verse 67:4": "بار ديگر (به عالم هستى) نگاه كن، سرانجام چشمانت (در جستجوى خلل و نقصان ناكام مانده) به سوى تو باز مى‏گردد در حالى كه خسته و ناتوان است!",
                            "verse 67:5": "ما آسمان پايين (نزديك) را با چراغهاى فروزانى زينت بخشيديم، و آنها ( شهابها ) را تيرهايى براى شياطين قرار داديم، و براى آنان عذاب آتش فروزان فراهم ساختيم!",
                            "verse 67:6": "و براى كسانى كه به پروردگارشان كافر شدند عذاب جهنم است، و بد فرجامى است!",
                            "verse 67:7": "هنگامى كه در آن افكنده شوند صداى وحشتناكى از آن مى‏شنوند، و اين در حالى است كه پيوسته مى‏جوشد!",
                            "verse 67:8": "نزديك است (دوزخ) از شدت غضب پاره پاره شود; هر زمان كه گروهى در آن افكنده مى‏شوند، نگهبانان دوزخ از آنها مى‏پرسند: «مگر بيم‏دهنده الهى به سراغ شما نيامد؟!»",
                            "verse 67:9": "مى‏گويند: «آرى، بيم‏دهنده به سراغ ما آمد، ولى ما او را تكذيب كرديم و گفتيم: خداوند هرگز چيزى نازل نكرده، و شما در گمراهى بزرگى هستيد!»",
                            "verse 67:10": "و مى‏گويند: «اگر ما گوش شنوا داشتيم يا تعقل مى‏كرديم، در ميان دوزخيان نبوديم!»",
                            "verse 67:11": "اينجاست كه به گناه خود اعتراف مى‏كنند; دور باشند دوزخيان از رحمت خدا!",
                            "verse 67:12": "(اما) كسانى كه از پروردگارشان در نهان مى‏ترسند، مسلما آمرزش و پاداش بزرگى دارند!",
                            "verse 67:13": "گفتار خود را پنهان كنيد يا آشكار (تفاوتى نمى‏كند)، او به آنچه در سينه‏هاست آگاه است!",
                            "verse 67:14": "آيا آن كسى كه موجودات را آفريده از حال آنها آگاه نيست؟! در حالى كه او (از اسرار دقيق) باخبر و آگاه است!",
                            "verse 67:15": "او كسى است كه زمين را براى شما رام كرد، بر شانه‏هاى آن راه برويد و از روزيهاى خداوند بخوريد; و بازگشت و اجتماع همه به سوى اوست!",
                            "verse 67:16": "آيا خود را از عذاب كسى كه حاكم بر آسمان است در امان مى‏دانيد كه دستور دهد زمين بشكافد و شما را فرو برد و به لرزش خود ادامه دهد؟!",
                            "verse 67:17": "يا خود را از عذاب خداوند آسمان در امان مى‏دانيد كه تندبادى پر از سنگريزه بر شما فرستد؟! و بزودى خواهيد دانست تهديدهاى من چگونه است!",
                            "verse 67:18": "كسانى كه پيش از آنان بودند (آيات الهى را) تكذيب كردند، اما (ببين) مجازات من چگونه بود!",
                            "verse 67:19": "آيا به پرندگانى كه بالاى سرشان است، و گاه بالهاى خود را گسترده و گاه جمع مى‏كنند، نگاه نكردند؟! جز خداوند رحمان كسى آنها را بر فراز آسمان نگه نمى‏دارد، چرا كه او به هر چيز بيناست!",
                            "verse 67:20": "آيا اين كسى كه لشكر شماست مى‏تواند شما را در برابر خداوند يارى دهد؟ ولى كافران تنها گرفتار فريبند!",
                            "verse 67:21": "يا آن كسى كه شما را روزى مى‏دهد، اگر روزيش را بازدارد (چه كسى مى‏تواند نياز شما را تامين كند)؟! ولى آنها در سركشى و فرار از حقيقت لجاجت مى‏ورزند!",
                            "verse 67:22": "آيا كسى كه به رو افتاده حركت مى‏كند به هدايت نزديكتر است يا كسى كه راست‏قامت در صراط مستقيم گام برمى‏دارد؟!",
                            "verse 67:23": "بگو: «او كسى است كه شما را آفريد و براى شما گوش و چشم و قلب قرار داد; اما كمتر سپاسگزارى مى‏كنيد!»",
                            "verse 67:24": "بگو: «او كسى است كه شما را در زمين آفريد و به سوى او محشور مى‏شويد!»",
                            "verse 67:25": "آنها مى‏گويند: «اگر راست مى‏گوييد اين وعده قيامت چه زمانى است؟!»",
                            "verse 67:26": "بگو: «علم آن تنها نزد خداست; و من فقط بيم‏دهنده آشكارى هستم!»",
                            "verse 67:27": "هنگامى كه آن (وعده الهى) را از نزديك مى‏بينند، صورت كافران زشت و سياه مى‏گردد، و به آنها گفته مى‏شود: «اين همان چيزى است كه تقاضاى آن را داشتيد»!",
                            "verse 67:28": "بگو: «به من خبر دهيد اگر خداوند مرا و تمام كسانى را كه با من هستند هلاك كند، يا مورد ترحم قرار دهد، چه كسى كافران را از عذاب دردناك پناه مى‏دهد؟!»",
                            "verse 67:29": "بگو: «او خداوند رحمان است، ما به او ايمان آورده و بر او توكل كرده‏ايم; و بزودى مى‏دانيد چه كسى در گمراهى آشكار است!»",
                            "verse 67:30": "بگو: «به من خبر دهيد اگر آبهاى (سرزمين) شما در زمين فرو رود، چه كسى مى‏تواند آب جارى و گوارا در دسترس شما قرار دهد؟!»"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Bendito seja Aquele em Cujas mãos está a Soberania, e que é Onipotente;",
                            "verse 67:2": "Que criou a vida e a morte, para testar quem de vós melhor se comporta - porque é o Poderoso, o Indulgentíssimo -,",
                            "verse 67:3": "Que criou sete céus sobrepostos; tu não acharás imperfeição alguma na criação do Clemente! Volta, pois, a olhar ! Vês, acaso, alguma fenda?",
                            "verse 67:4": "Novamente, olha e torna a fazê-lo, e o teu olhar voltará a ti, confuso e fatigado.",
                            "verse 67:5": "E adornamos o céu aparente com lâmpadas, e lhes destinamos apedrejarem os demônios, e preparamos, para eles o suplício do fogo infernal.",
                            "verse 67:6": "Bem como a pena do inferno, para aqueles que negam o seu Senhor. Que funesto destino!",
                            "verse 67:7": "Quando nele forem precipitados, ouvi-lo-ão rugir, borbulhante,",
                            "verse 67:8": "A ponto de estalar de fúria. Cada vez que um grupo (de réprobos) for precipitado nele, os seus guardiães lhes perguntarão. Acaso, não vos foi enviado nenhum admoestador?",
                            "verse 67:9": "Dirão: Sim! Foi-nos enviado um admoestador, porém desmentimo-lo, dizendo: Deus nada revelou! Estais em grave erro!",
                            "verse 67:10": "E dirão (mais): Se tivéssemos escutado o meditado, não estaríamos entre os condenados ao tártaro!",
                            "verse 67:11": "E confessarão os seus pecados; anátema aos condenados ao tártaro!",
                            "verse 67:12": "Em verdade aqueles que temerem intimamente o seu Senhor obterão indulgência e uma grande recompensa.",
                            "verse 67:13": "Quer faleis privativa ou publicamente, Ele é Conhecedor das intimidades dos corações.",
                            "verse 67:14": "Como não haveria de conhecê-las o Criados, sendo Ele o Onisciente, o Sutilíssimo?",
                            "verse 67:15": "Ele foi Quem vos fez a terra manejável. Percorrei-a pois, por todos os seus quadrantes e desfrutai das Suas mercês; a Ele será o retorno!",
                            "verse 67:16": "Estais, acaso, seguros de que Aquele que está no céu não vos fará ser tragados pela terra? Ei-la que treme!",
                            "verse 67:17": "Ou estais seguros de que Aquele que está no céu não desencadeará um violento furacão sobre vós? Logo sabereis como é a Nossa advertência.",
                            "verse 67:18": "Em verdade, os seus antepassados desmentiram os Meus enviados. Porém, que terrível foi a Minha rejeição!",
                            "verse 67:19": "Não reparam, acaso, nos pássaros que pairam sobre eles, protraindo e recolhendo as suas asas? Ninguém os mantém no espaço, senão o Clemente, porque é Onividente.",
                            "verse 67:20": "Ou então, qual é o exército com que contais para socorrer-vos, em vez do Clemente? Em verdade, os incrédulos estão grandemente iludidos.",
                            "verse 67:21": "Ou então, quem será que os sustentará se Ele retiver as Suas mercês? Não obstante, obstinam-se na perfídia e no extravio.",
                            "verse 67:22": "Quem está melhor encaminhado: o que anda, vacilante, pela tortuosidade, ou quem anda, altaneiro, pela senda reta?",
                            "verse 67:23": "Dize-lhes: Foi Ele Quem vos criou e vos dotou de ouvidos, de vistas e de faculdades. Quão pouco Lhe agradeceis!",
                            "verse 67:24": "Dize-lhes (mais): Foi Ele Quem vos multiplicou, na terra, e ante Ele sereis congregados.",
                            "verse 67:25": "Porém, perguntaram: Quando se cumprirá tal promessa? Dizei-nos, se estais certos.",
                            "verse 67:26": "Responde-lhes: Só Deus o sabe, e eu sou unicamente um admoestador elucidante.",
                            "verse 67:27": "Mas , quando o virem (o castigo) de perto, os rostos dos incrédulos se ensombrecerão e lhes será dito: Aqui tendes o que pedíeis!",
                            "verse 67:28": "Dize-lhes: Se Deus me fizesse perecer, juntamente com os meus seguidores ou se se apiedasse de nós, quem livraria os incrédulos de um doloroso castigo?",
                            "verse 67:29": "Dize-lhes (mais): Ele é o Clemente, no Qual cremos e ao Qual nos encomendamos. Logo sabereis quem está em erro evidente!",
                            "verse 67:30": "Dize-lhes (ainda): Que vos parece? Se a vossa água, ao amanhecer, tivesse sido toda absorvida (pela terra), quem faria manar água potável para vós?"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 67:1": "Binecuvântat fie Acela care are în mâna Lui împãrãția și este cu putere peste toate,",
                            "verse 67:2": "Acela care a fãcut moartea și viața, ca sã vã încerce pe voi,[pentru a vedea] care dintre voi este mai bun întru faptã. Și El estePuternic [și] Iertãtor [Al-'Aziz, Al-Ghafur].",
                            "verse 67:3": "Acela care a creat șapte ceruri unul peste altul, fãrã sã vezi nici onepotrivire în creația Celui Milostiv [Ar-Rahman]. Întoarce-ți privirea! Oare vezi tu vreo crãpãturã?",
                            "verse 67:4": "Întoarce-ți iarãși privirea de douã ori! Privirea se va întoarce la tine umilitã și slabã!",
                            "verse 67:5": "Noi am împodobit cerul cel mai de jos cu candele și le-am fãcut pe ele pietre pentru lovirea șeitanilor și am pregãtit pentru ei chinul Vãpãii.",
                            "verse 67:6": "Aceia care nu au crezut în Domnul lor vor avea parte de chinulGheenei. Și ce rea întoarcere!",
                            "verse 67:7": "Când vor fi aruncați în ea, îi vor auzi vuietul, în vreme ce ea clocotește.",
                            "verse 67:8": "Aproape cã plesnește de mânie. De fiecare datã când este aruncatã o ceatã nouã, pãzitorii sãi îi întreabã: \"Oare nu a venit la voi un prevenitor?\"",
                            "verse 67:9": "Iar ei vor zice: \"Ba da! A venit la noi un prevenitor, însã noi l-amînvinuit de minciunã și am zis: Allah nu a trimis nimic, iar voi nu sunteți decât în mare rãtãcire!\"",
                            "verse 67:10": "Și ei vor zice: \"Dacã noi am fi ascultat și am fi priceput, nu am fiprintre oaspeții Vãpãii!\"",
                            "verse 67:11": "Și astfel ei vor mãrturisi pãcatele lor. Așadar, striviți sã fie oaspeții Vãpãii!",
                            "verse 67:12": "Aceia care se tem de Domnul lor, fãrã sã-L vadã pe El, vor avea parte de iertare și de mare rãsplatã.",
                            "verse 67:13": "Spuneți în șoaptã vorba voastrã ori rostiți-o cu glas tare! El le știe pe cele dinlãuntrul piepturilor .",
                            "verse 67:14": "Oare nu le știe pe cele pe care le-a creat, cu toate cã El esteBinevoitor [și] Atoateștiutor [Al-Latif, Al-Khabir]?",
                            "verse 67:15": "El este Cel care v-a fãcut pãmântul supus. Deci strãbateți întinderile sale. Și mâncați din înzestrarea Lui. Și la El este învierea .",
                            "verse 67:16": "Sunteți voi siguri cã Cel din cer nu va lãsa sã vã înghitã pãmântul, când iatã cã el se cutremurã?!",
                            "verse 67:17": "Sau sunteți siguri cã Cel din cer nu va trimite asupra voastrã o vijelie cu pietre? Atunci veți ști cum va fi mustrarea Mea!",
                            "verse 67:18": "Și cei de dinaintea lor i-au învinuit de minciunã [pe trimișii lor] și cum a fost rãzbunarea Mea?!",
                            "verse 67:19": "Oare nu vãd ei pãsãrile de deasupra lor întinzând și strângând aripile lor? Nu le poate ține pe ele decât Cel Milostiv [Ar-Rahman]! El este Cel care le vede pe toate.",
                            "verse 67:20": "Cine este acela care sã fie pentru voi oștire ce vã ajutãîmpotriva Celui Milostiv [Ar-Rahman]? Necredincioșii nu sunt decâtîntr-o amãgire.",
                            "verse 67:21": "Cine este acela care vã îngrijește pe voi, dacã El oprește darurileSale ? Însã ei stãruie în semeția lor și în fuga lor [de Adevãr].",
                            "verse 67:22": "Oare cel care merge cu fața plecatã este mai bine cãlãuzit saucel care merge cu capul sus, pe un drum drept?",
                            "verse 67:23": "Spune: \"El este Cel care v-a creat și v-a dat vouã auzul și ochii și inimile! Dar voi sunteți puțin mulțumitori\".",
                            "verse 67:24": "Spune: \"El este Cel care v-a rãspândit pe pãmânt și la El veți fi adunați!\"",
                            "verse 67:25": "Ei zic: \"Când va fi aceastã fãgãduințã, dacã voi sunteți întruadevãr?\"",
                            "verse 67:26": "Spune: \"Știința despre aceasta este numai la Allah, iar eu sunt numai un prevenitor limpede!\"",
                            "verse 67:27": "Și când o vor vedea aproape, se vor întrista chipurile celor care nu au crezut. Și [li] se va zice: \"Aceasta este ceea ce voi ați cerut!\"",
                            "verse 67:28": "Spune: “Cum vi se pare? Dacã Allah ne va face sã pierim pe mine și pe cei care sunt cu mine sau va fi îndurãtor cu noi, cine îi va apãra pe cei necredincioși de un chin dureros?”",
                            "verse 67:29": "Spune: \"El este Cel Milostiv [Ar-Rahman]! Noi credem în El și înEl ne încredem și veți afla voi cine este în rãtãcire învederatã!\"",
                            "verse 67:30": "Spune: \"Ce credeți? De se va strecura apa voastrã în adânc, cine vã va aduce apã de izvor?\""
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 67:1": "Binecuvântat fie Cel ce are în mâna Sa împărăţia, Cel ce asupra tuturor are putere,",
                            "verse 67:2": "Cel ce a creat viaţa şi moartea ca să dovedească care dintre voi este mai bun la faptă. El este Puternic, Iertător.",
                            "verse 67:3": "Binecuvântat fie Cel ce a creat cele şapte ceruri puse unele asupra altora! Nu vei vedea în creaţia Milostivului nici o nepotrivire. Întoarce-ţi privirea! Zăreşti pe undeva vreun cusur?",
                            "verse 67:4": "Roteşte-ţi apoi privirea încă de două ori! Şi privirea ţi se va întoarce obosită, slăbită.",
                            "verse 67:5": "Noi am împodobit cerul cel mai apropiat cu lumini pe care le-am făcut ca să-i lovim pe diavolii cărora le-am pregătit şi osânda Iadului.",
                            "verse 67:6": "Cei care L-au tăgăduit pe Domnul lor vor avea parte de osânda Gheenei. Ce rea devenire!",
                            "verse 67:7": "Când vor fi aruncaţi acolo, vor auzi un răget, iar Gheena va clocoti",
                            "verse 67:8": "gata să se sfarme de furie. De fiece dată când o ceată îi este aruncată, păzitorii săi vor întreba: “Nu vi s-a predicat şi vouă?”",
                            "verse 67:9": "Ei vor spune: “Ba da, cineva a venit să ne predice, însă noi l-am hulit zicându-i: ‘Dumnezeu n-a pogorât nimic, iar voi sunteţi într-o adâncă rătăcire.’”",
                            "verse 67:10": "Ei vor spune: “Dacă noi am fi ascultat ori dacă am fi înţeles, nu am fi fost acum printre soţii Focului.”",
                            "verse 67:11": "Ei şi-au recunoscut păcatul. Să piară soţii Focului!",
                            "verse 67:12": "Cei care s-au temut de Domnul lor întru Taină vor avea iertare şi mare răsplată.",
                            "verse 67:13": "Fie că vă tăinuiţi vorbele, fie că le spuneţi tare, El cunoaşte lăuntrul inimilor voastre.",
                            "verse 67:14": "Nu cunoaşte El ceea ce a creat, El, Pătrunzătorul, Cunoscătorul?",
                            "verse 67:15": "El a făcut pământul supus vouă. Străbateţi marile sale întinderi şi mâncaţi din dăruirea Lui. Către El va fi Învierea.",
                            "verse 67:16": "Credeţi oare că Cel ce este în Cer nu poate face pământul să vă înghită? Iată-l cum se zgâlţâie!",
                            "verse 67:17": "Credeţi oare că Cel ce este în Cer nu poate dezlănţui asupra voastră o furtună de pietre? Atunci veţi şti ce a însemnat predica Mea!",
                            "verse 67:18": "Cei dinaintea lor au hulit. Şi cum a fost mustrarea Mea!",
                            "verse 67:19": "Ei nu văd păsările deasupra lor cum îşi întind şi îşi strâng aripile? Numai Milostivul le ţine acolo. El este Atotvăzător.",
                            "verse 67:20": "Cel ce are o oştire pentru voi, vă poate ajuta în locul Milostivului? Tăgăduitorii sunt în amăgire.",
                            "verse 67:21": "Cine v-ar putea hrăni, dacă Dumnezeu şi-ar lua darurile înapoi? Ei se încăpăţânează însă în obrăznicie şi ură.",
                            "verse 67:22": "Cel care merge cu capul în jos este mai bine călăuzit decât cel care merge pe Calea cea Dreaptă cu capul sus?",
                            "verse 67:23": "Spune: “El este Cel ce a făcut să vă naşteţi. El v-a dat auzul, văzul şi inimile.” Voi sunteţi însă atât de puţin recunoscători!",
                            "verse 67:24": "Spune: “El este Cel ce v-a împrăştiat pe pământ şi la El veţi fi iarăşi strânşi.”",
                            "verse 67:25": "Ei vor spune: “Când se va împlini această făgăduială, dacă spuneţi adevărul?”",
                            "verse 67:26": "Spune: “Ştiinţa nu este decât la Dumnezeu. Eu nu sunt decât un predicator cu vorba limpede!”",
                            "verse 67:27": "Când cei care tăgăduiesc o vor vedea de aproape, chipurile li se vor schimonosi. Li se va spune: “Aceasta este ceea ce aţi chemat!”",
                            "verse 67:28": "Spune: “Ce credeţi? Fie că Dumnezeu mă va nimici pe mine şi pe cei dimpreună cu mine, fie că se va milostivi de noi, însă cine îi va apăra pe tăgăduitori de osânda dureroasă?”",
                            "verse 67:29": "Spune: “El este Milostivul! Noi credem în El. Lui ne încredinţăm.” Veţi şti atunci cine este într-o rătăcire făţişă!",
                            "verse 67:30": "Spune: “Ce credeţi? Dacă apa voastră se va scurge în pământ peste noapte cine vă va mai da apă de izvor?”"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Благословен будь Тот,В Руке Которого вся власть(над миром),Кто всемогущ над всем и вся!",
                            "verse 67:2": "Кто создал смерть и жизнь,Чтоб испытать,Кто праведней из вас в своих деяньях.Велик в могуществе СвоемИ отдающ во всепрощенье Он!",
                            "verse 67:3": "Он — Тот, Кто создал семь небесрядами.В Божественном творенье томНе различить тебе (структурных)нарушений.И снова обрати свой взор —Ты зришь какой-нибудь изъян(в творенье этом)?",
                            "verse 67:4": "И вновь свой взор ты обрати:Вернется он униженным и тщетным.",
                            "verse 67:5": "Мы небеса ближайшие украсилисветильниками (звезд),И Мы их сотворили для того,чтоб дьяволов изгнать,И уготовили для них Мы наказанье —Гореть в пылающем Огне.",
                            "verse 67:6": "Для тех, кто не уверовал в Аллаха, —муки Ада, —Поистине, отвратная обитель(для неверных)!",
                            "verse 67:7": "Когда в него их будут низвергать,Они услышат рев (зловещий),И возгорится с новой силой пламя,",
                            "verse 67:8": "От гнева чуть не задыхаясь.И всякий раз, когда толпа неверныхбудет низвергнута туда,Воскликнут стражи (Ада):«Неужто не пришел к вам увещатель?»",
                            "verse 67:9": "Они ответят:«Да, к нам увещатель приходил,Но мы его отвергли и сказали:„Аллах не посылает ничего,И вы лишь в заблуждении великом“».",
                            "verse 67:10": "И говорят они:«О, если б мы прислушались,О, если б поразмыслили получше,Мы б не были сейчас средьобитателей Огня!»",
                            "verse 67:11": "Тогда они признали все свои грехи, —(Но нет! Раскаяния их Аллахне принял):Прочь, обитатели зловещего Огня,от милости Аллаха!",
                            "verse 67:12": "Но тех, кто глубиной души Егострашится,Прощенье ждет и высшая награда.",
                            "verse 67:13": "Сокроешь ты свои слова иль молвишь,Секреты всех сердец Он знает.",
                            "verse 67:14": "Как может Он не знать того,что Сам же сотворил?Он — Тот, Кто в корень зритмельчайших таинств,Владеет знанием всего!",
                            "verse 67:15": "Он — Тот, Кто сделал землю вампослушной, —Ходите ж по ее раменам,Кормитесь тем, что вам дарует Бог, —К Нему лежит (и ваше) Воскресение(на Суд).",
                            "verse 67:16": "И есть ли уверенье в вас,Что Тот, Кто сущ на небесах,Под вашими стопами не разверзнетземлю,Что поглотит вас?Так ведь она колеблется уже!",
                            "verse 67:17": "И есть ли уверенье в вас,Что Тот, Кто сущ на небесах,На вас не спустит ураган?И вы узнаете тогда,Каким является Мое предупрежденье!",
                            "verse 67:18": "Поистине, и те, кто был до них,отвергли (веру),И вот тогда — как страшен был Мойгнев!",
                            "verse 67:19": "Ужель они не видят птиц, (которыепарят над ними),То крылья распахнув, то вновьсворачивая их?Кто, кроме Милосердного Аллаха,Их удержать способен так?Поистине, всевидящ Он!",
                            "verse 67:20": "И кто же тот, кто служит ратью вамИ кто способен оказать вам помощь,Помимо Милосердного Аллаха?Поистине, неверные — в глубокомзаблужденье!",
                            "verse 67:21": "И кто же тот, кто пропитает вас,Если Аллах от вас удержит пищу?Поистине, погрязли в нечестивостиони,(Упрямо) отвергая веру.",
                            "verse 67:22": "Кто ж лучший проводник —Кто, пресмыкаясь, бьет челом о землюИль тот, кто шествует по праведнойстезе?",
                            "verse 67:23": "Скажи: «Он — Тот, Кто вас взрастилИ даровал вам слух, и зрение,и сердце,(Чтоб вы могли и чувствовать,и разуметь), —И все ж как мало благодарны вы».",
                            "verse 67:24": "Скажи: «Он — Тот, Кто вас рассеялпо землеС тем, чтоб в конце пути земногоСозвать вас снова у Себя».",
                            "verse 67:25": "И говорят они: «Коль истину несете вы,Когда ж исполнятся все вашиобещанья?»",
                            "verse 67:26": "Ты им ответь:«Сие известно только Богу, —Всего лишь увещатель я,Несущий вам открытое и ясноепредупрежденье».",
                            "verse 67:27": "Когда ж они узрят его2253 так близко,Покроются их лица мраком,И прозвучит им:«Это — то, к чему вы так взывали!»",
                            "verse 67:28": "Скажи: «Вы видите — была б ГосподняволяУбить меня и тех, кто следует за мной,Иль милостью Своею всех насодарить,То кто ж неверных защититот наказания Аллаха?»",
                            "verse 67:29": "Скажи: «Он — Милосердный (Бог).В Него уверовали мыИ возложили на Него свои надежды.И в скором времени познаете и вы,Которые из нас в глубокомзаблужденье!»",
                            "verse 67:30": "Скажи: «Вы видите — коль утреннейзареюУйдут от вас под землю питьевыеводы,Кто повелит прозрачному ключупролиться к вам?»"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "¡Bendito sea Aquél en Cuya mano está el dominio! Es omnipotente.",
                            "verse 67:2": "Es Quien ha creado la muerte y la vida para probaros, para ver quién de vosotros es el que mejor se porta. Es el Poderoso, el Indulgente.",
                            "verse 67:3": "Es Quien ha creado siete cielos superpuestos. No ves ninguna contradición en la creación del Compasivo. ¡Mira otra vez! ¿Adviertes alguna falla?",
                            "verse 67:4": "Luego, mira otras dos veces: tu mirada volverá a ti cansada, agotada.",
                            "verse 67:5": "Hemos engalanado el cielo más bajo con luminares, de los que hemos hecho proyectiles contra los demonios y hemos preparado para ellos el castigo del fuego de la gehena.",
                            "verse 67:6": "Quienes no hayan creído en su Señor tendrán el castigo de la gehena. ¡Qué mal fin...!",
                            "verse 67:7": "Cuando sean arrojados a ella, oirán su fragor, en plena ebullición,",
                            "verse 67:8": "a punto de estallar de furor. Siempre que se le arroje una oleada, sus guardianes les preguntarán: «¿Es que no vino a vosotros un monitor?»",
                            "verse 67:9": "«¡Claro que sí!» dirán: «Vino a nosotros un monitor, pero desmentimos, y dijimos: 'Alá no ha revelado nada. No estáis sino muy extraviados'».",
                            "verse 67:10": "Y dirán: «Si hubiéramos oído o comprendido, no moraríamos ahora en el fuego de la gehena».",
                            "verse 67:11": "Confesarán su pecado. ¡Que Alá aleje a los moradores del fuego de la gehena!",
                            "verse 67:12": "Quienes hayan tenido miedo a su Señor en secreto tendrán perdón y una gran recompensa.",
                            "verse 67:13": "Da lo mismo que mantengáis ocultas vuestras palabras o que las divulguéis. Él conoce bien lo que encierran los pechos.",
                            "verse 67:14": "¿No va a saber Quien ha creado, Él, Que es el Sutil, el Bien Informado?",
                            "verse 67:15": "Él es Quien os ha hecho dócil la tierra. Recorredla, pues, de acá para allá y comed de Su sustento. La Resurrección se hará hacia Él.",
                            "verse 67:16": "¿Estáis a salvo de que Quien está en el cielo haga que la tierra os trague? He aquí que tiembla...",
                            "verse 67:17": "¿O estáis a salvo de que Quien está en el cielo envíe contra vosotros una tempestad de arena? Entonces veréis cómo era Mi advertencia...",
                            "verse 67:18": "Quienes fueron antes que ellos desmintieron y ¡cuál no fue Mi reprobación!",
                            "verse 67:19": "¿Es que no han visto las aves encima de ellos, desplegando y recogiendo las alas? Sólo el Compasivo las sostiene. Lo ve bien todo.",
                            "verse 67:20": "O ¿quién es el que podría auxiliaros cual legión, fuera del Compasivo? Los infieles son presa de una ilusión.",
                            "verse 67:21": "O ¿quien es el que os proveería de sustento si Él interrumpiera Su sustento? Sí, persisten en su insolencia y aversión.",
                            "verse 67:22": "Quien anda agachado ¿va mejor dirigido que quien anda erguido por una vía recta?",
                            "verse 67:23": "Di: «Él es Quien os ha creado, Quien os ha dado el oído, la vista y el intelecto. ¡Qué poco agradecidos sois!»",
                            "verse 67:24": "Di: «Él es Quien os ha diseminado por la tierra. Y hacia Él seréis congregados».",
                            "verse 67:25": "Y dicen: «¿Cuándo se cumplirá esta amenaza, si es verdad lo que decís?»",
                            "verse 67:26": "Di: «Sólo Alá lo sabe. Yo soy solamente un monitor que habla claro».",
                            "verse 67:27": "Pero, en cuanto vean su inminencia, se afligirán los rostros de los infieles. Y se dirá: «Aquí tenéis lo que reclamabais».",
                            "verse 67:28": "Di: «¿Qué os parece? Lo mismo si Alá nos hace perecer, a mí y a los que están conmigo, que si se apiada de nosotros, ¿quién preservará a los infieles de un castigo doloroso?",
                            "verse 67:29": "Di: «¡Es el Compasivo! ¡Creemos en Él y confiamos en Él! Ya veréis quién es el que está evidentemente extraviado».",
                            "verse 67:30": "Di: «¿Qué os parece? Si el agua se os agotara una mañana, ¿quien iba a traeros agua viva?»"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "எவனுடைய கையில் ஆட்சி இருக்கின்றதோ அவன் பாக்கியவான்; மேலும், அவன் எல்லாப் பொருட்களின் மீதும் பேராற்றலுடையவன்.",
                            "verse 67:2": "உங்களில் எவர் செயல்களால் மிகவும் அழகானவர் என்பதைச் சோதிப்பதற்காக அவன், மரணத்தையும் வாழ்வையும் படைத்தான்; மேலும், அவன் (யாவரையும்) மிகைத்தவன்; மிக மன்னிப்பவன்.",
                            "verse 67:3": "அவனே ஏழு வானங்களையும் அடுக்கடுக்காக படைத்தான்; (மனிதனே) அர்ரஹ்மானின் படைப்பில் குறையை நீர் காணமாட்டீர், பின்னும் (ஒரு முறை) பார்வையை மீட்டிப்பார்! (அவ்வானங்களில்) ஏதாவது ஓர் பிளவை காண்கிறாயா?",
                            "verse 67:4": "பின்னர் இருமுறை உன் பார்வையை மீட்டிப்பார், உன் பார்வை களைத்து, மழுங்கிச் சிறுமையடைந்து உன்னிடம் திரும்பும்.",
                            "verse 67:5": "அன்றியும், திட்டமாக நாமே (பூமிக்குச்) சமீபமாக இருக்கும் வானத்தை (நட்சத்திர) விளக்குகளைக் கொண்டு அலங்கரித்திருக்கின்றோம்; இன்னும், அவற்றை ஷைத்தான்களை (வெருட்டும்) எறி கற்களாகவும் நாம் ஆக்கினோம்; அன்றியும் அவர்களுக்காகக் கொழுந்து விட்டெரியும் (நரக) நெருப்பின் வேதனையைச் சித்தம் செய்திருக்கின்றோம்.",
                            "verse 67:6": "இன்னும், எவர்கள் தங்கள் இறைவனை நிராகரிக்கின்றார்களோ, அவர்களுக்கு நரக வேதனை உண்டு; (அது) மிகக் கெட்ட மீளுமிடமாகும்.",
                            "verse 67:7": "அதில் அவர்கள் போடப்படுவார்களாயின், அது கொதிக்கும் நிலை (கழுதையின் பெருங்குரலைப் போல்) அருவருப்பான சப்தம் உண்டாவதை அவர்கள் கேட்பார்கள்.",
                            "verse 67:8": "அது கோபத்தால் வெடித்து விடவும் நெருங்குகிறது, அதில் ஒவ்வொரு கூட்டமும் போடப்படும் போதெல்லாம், \"அச்சமூட்டி எச்சரிக்கை செய்பவர் உங்களிடம் வரவில்லையா?\" என்று அதன் காவலாளிகள் அவர்களைக் கேட்பார்கள்.",
                            "verse 67:9": "அதற்கவர்கள் கூறுவார்கள்; \"ஆம்! அச்சமூட்டி எச்சரிக்கை செய்பவர் திட்டமாக எங்களிடம் வந்தார், ஆனால் நாங்கள் (அவரைப்) பொய்ப்பித்து, 'அல்லாஹ் யாதொன்றையும் இறக்கவில்லை, நீங்கள் பெரும் வழிகேட்டில் அல்லாமல் வேறில்லை\" என்று சொன்னோம்.\"",
                            "verse 67:10": "இன்னும் அவர்கள் கூறுவார்கள்; \"நாங்கள் (அவர் போதனையைச்) செவியுற்றோ அல்லது சிந்தித்தோ இருந்திருந்தோமானால் நாங்கள் நரகவாசிகளில் இருந்திருக்க மாட்டோம்.\"",
                            "verse 67:11": "(இவ்வாறு) தங்கள் பாவங்களை அவர்கள் ஒப்புக் கொள்வார்கள் - எனவே, இந்நரகவாசிகளுக்குக் கேடுதான்.",
                            "verse 67:12": "நிச்சயமாக எவர்கள் தங்கள் இறைவனை(ப் பார்க்காதிருந்தும்) அந்தரங்கத்தில் அவனுக்கு அஞ்சுகிறார்களோ, அவர்களுக்கு மன்னிப்புமுண்டு, பெரிய நற்கூலியும் உண்டு.",
                            "verse 67:13": "மேலும், உங்கள் சொல்லை நீங்கள் இரகசியமாக்குங்கள், அல்லது அதை பகிரங்கமாக்குங்கள் - நிச்சயமாக அவன் இதயங்களிலுள்ளவற்றையும் மிக அறிந்தவன்.",
                            "verse 67:14": "(அனைத்தையும்) படைத்தவன் அறிய மாட்டானா? அவன் நுணுக்கமாக கவனிப்பவன்; யாவற்;றையும் நன்கு தெறிந்தவன்.",
                            "verse 67:15": "அவனே உங்களுக்கு இப்பூமியை (நீங்கள் வாழ்வதற்கு) வசதியாக ஆக்கினான்; ஆகவே, அதன் பல மருங்குகளிலும், நடந்து அவனுடைய உணவிலிருந்து புசியுங்கள்; இன்னும் அவனிடமே (யாவரும்) உயிர்த்தெழவேண்டியிருக்கிறது.",
                            "verse 67:16": "வானத்தில் இருப்பவன் உங்களைப் பூமியில் சொறுகிவிடுவான் என்பதை பற்றி நீங்கள் அச்சமற்று இருக்கிறீர்களா? அப்போது (பூமி) அதிர்ந்து நடுங்கும்.",
                            "verse 67:17": "அல்லது வானத்திலிருப்பவன் உங்கள் மீது கல்மாரியை அனுப்புவது பற்றி அச்சமற்று இருக்கிறீர்களா? ஆகவே, எனது எச்சரிக்கை (செய்யப்பட்ட வேதனை) எப்படி என்பதை விரைவில் நீங்கள் அறிந்துகொள்வீர்கள்.",
                            "verse 67:18": "அன்றியும் அவர்களுக்கு முன் இருந்தார்களே அவர்களும் (நம் வசனங்களை இவ்வாறே) பொய்ப்பித்துக் கொண்டிருந்தனர், என் எச்சரிக்கை எவ்வளவு கடுமையாக இருந்தது?",
                            "verse 67:19": "இறக்கைகளை விரித்துக் கொண்டும், சேர்த்துக் கொண்டும், இவர்களுக்கு மேல் (வானில் பறக்கும்) பறவைகளை இவர்கள் பார்க்கவில்லையா? அர்ரஹ்மானைத் தவிர (வேறு யாரும் கீழே விழாது) அவற்றைத் தடுத்துக் கொண்டிருக்கவில்லை - நிச்சயமாக அவன் ஒவ்வொரு பொருளையும் நோட்டமிடுகிபவன்.",
                            "verse 67:20": "அன்றியும், அர்ரஹ்மானை தவிர வேறு எவர் உங்களுக்குப் பட்டாளமாக இருந்து கொண்டு உதவி செய்வார்? காஃபிர்கள் ஏமாற்றத்திலன்றி வேறில்லை.",
                            "verse 67:21": "அல்லது, தான் உணவளிப்பதை அவன் தடுத்துக் கொண்டால், உங்களுக்கு உணவளிப்பவர் யார்? அப்படியல்ல, ஆனால், இவர்கள் மாறு செய்வதிலும் (சத்தியத்தை) வெறுப்பதிலும் ஆழ்ந்திருக்கின்றனர்.",
                            "verse 67:22": "முகம் குப்புற விழுந்து செல்பவன் மிக நேர்வழி அடைந்தவனா? அல்லது நேரான பாதையில் செவ்வையாக நடப்பவ(ன் மிக நேர்வழி அடைந்தவ)னா.",
                            "verse 67:23": "(நபியே!) நீர் கூறுவீராக: \"அவனே உங்களைப் படைத்து உங்களுக்குச் செவிப்புலனையும், பார்வைகளையும் இதயங்களையும் அமைத்தான்; (எனினும்) மிகவும் சொற்பமாகவே நீங்கள் நன்றி செலுத்துகிறீர்கள்.\"",
                            "verse 67:24": "\"அவனே உங்களைப் பூமியின் (பல பாகங்களிலும்) பரவச் செய்தான், அன்றியும், அவனிடமே நீங்கள் ஒன்று திரட்டப்படுவீர்கள்\" என்று கூறுவீராக.",
                            "verse 67:25": "ஆயினும், \"நீங்கள் உண்மையாளர்களாக இருந்தால், வாக்களிக்கப்பட்ட (மறுமையான)து எப்பொழுது (வரும்)?\" என்று (காஃபிர்கள்) கேட்கிறார்கள்.",
                            "verse 67:26": "\"இதைப் பற்றி ஞானம் நிச்சயமாக அல்லாஹ்விடமே தான் இருக்கிறது, தவிர, நிச்சயமாக நான் தெளிவாக அச்சமூட்டி எச்சரிக்கை செய்பவன் தான்\" என்று (நபியே!) நீர் கூறும்.",
                            "verse 67:27": "எனவே, அது நெருங்கி வருவதை அவர்கள் காணும் போது நிராகரிப்போரின் முகங்கள் (நிறம் பேதலித்துக்) கெட்டுவிடும், இன்னும், \"நீங்கள் எதை வேண்டிக் கொண்டிருந்தீர்களோ, அது இது தான்\" என்று அவர்களுக்குக் கூறப்படும்.",
                            "verse 67:28": "கூறுவீராக: அல்லாஹ், என்னையும் என்னுடன் இருப்பவர்களையும் (நீங்கள் ஆசிப்பது போல்) அழித்து விட்டாலும், அல்லது (நாங்கள் நம்புவது போல்) அவன் எங்கள் மீது கிருபை புரிந்தாலும், நோவினை செய்யும் வேதனையை விட்டு, காஃபிர்களைக் காப்பவர் யார் என்பதை கவனித்தீர்களா?",
                            "verse 67:29": "(நபியே!) நீர் கூறும்: (எங்களைக் காப்பவன்) அவனே - அர்ரஹ்மான், அவன் மீதே நாங்கள் ஈமாக் கொண்டோம், மேலும் அவனையே முற்றிலும் சார்ந்திருக்கிறோம் - எனவே, வெகு சீக்கிரத்தில் பகிரங்கமான வழி கேட்டிலிருப்பவர் யார் என்பதை நீங்கள் அறிவீர்கள்!\"",
                            "verse 67:30": "(நபியே!) நீர் கூறும்: உங்களின் தண்ணீர் பூமியினுள் (உறிஞ்சப்பட்டுப்) போய்விட்டால், அப்பொழுது ஓடும் நீரை உங்களுக்குக் கொண்டு வருபவன் யார்? என்பதை கவனித்தீர்களா? என்று (எனக்கு அறிவியுங்கள்)."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "ความเจริญสุขจงมีแด่พระผู้ซึ่งอำนาจอยู่ในพระหัตถ์ของพระองค์ และพระองค์คือผู้ทรงอานุภาพเหนือทุกสิ่งทุกอย่าง",
                            "verse 67:2": "พระผู้ทรงให้มีความตายและให้มีความเป็น เพื่อจะทดสอบพวกเจ้าว่า ผู้ใดบ้างในหมู่พวกเจ้าที่มีผลงานดียิ่ง และพระองค์เป็นผู้ทรงอำนาจ ผู้ทรงให้อภัยเสมอ",
                            "verse 67:3": "พระผู้ทรงสร้างชั้นฟ้าทั้งเจ็ดเป็นชั้น ๆ เจ้าจะไม่เห็นแต่อย่างใดในความไม่ได้สัดส่วนในการสร้างของพระผู้ทรงกรุณาปรานี ดังนั้นเจ้าจงหันกลับมามองดูซิ เจ้าเห็นรอยร้าวหรือช่องโหว่บ้างไหม ?",
                            "verse 67:4": "แล้วจงหันกลับมามองอีกเป็นครั้งที่สอง สายตานั้นก็จะกลับมายังเจ้าด้วยการยอมจำนนและในสภาพที่ละเหี่ย",
                            "verse 67:5": "และโดยแน่นอนเราได้ประดับท้องฟ้าของโลกนี้ด้วยดวงดาวเป็นแสงประทีป และเราได้ทำให้มันเป็นอาวุธไล่ชัยตอน และเราได้เตรียมการลงโทษด้วยไฟอันร้อนแรงสำหรับพวกมัน",
                            "verse 67:6": "และสำหรับบรรดาผู้ปฏิเสธศรัทธาต่อพระเจ้าของพวกเขานั้น คือการลงโทษแห่งนรกญะฮันนัม และมันเป็นทางกลับที่ชั่วช้ายิ่ง",
                            "verse 67:7": "เมื่อพวกเขาถูกโยนลงไปในนรกพวกเขาจะได้ยินเสียงของมันครวญครางขณะที่มันกำลังกเดือนพล่าน",
                            "verse 67:8": "มันแทบจะระเบิดออกไปเพราะความเคียดแค้น ทุกครั้งที่พวกหนึ่งถูกโยนลงไปในมัน ยามเฝ้านรกจะถามพวกเขาว่า มิได้มีผู้ตักเตือนมายังพวกเจ้าดอกหรือ",
                            "verse 67:9": "พวกเขากล่าวว่า มี ได้มีผู้ตักเตือนมายังเรา แต่พวกเราได้ปฏิเสธ และเรากล่าวอีกว่า อัลลอฮ์มิได้ทรงประทานสิ่งใดลงมาพวกท่านต่างหากที่อยู่ในการหลงผิดอย่างมาก",
                            "verse 67:10": "และพวกเขากล่าวอีกว่า หากพวกเราฟังและใช้สติปัญญาใคร่ครวญ พวกเราก็จะมิได้มาอยู่เป็นชาวนรกอย่างนี้ดอก",
                            "verse 67:11": "พวกเขายอมสารภาพในความผิดของพวกเขา แต่มันห่างไกลไปเสียแล้วสำหรับชาวนรก",
                            "verse 67:12": "แท้จริงบรรดาผู้ยำเกรงต่อพระเจ้าของพวกเขาโดยทางลับ สำหรับพวกเขาจะได้รับการอภัยโทษและรางวัลอันใหญ่หลวง",
                            "verse 67:13": "และพวกเจ้าจงปิดบังคำพูดของพวกเจ้าหรือเปิดเผยมันก็ตาม แท้จริงพระองค์ทรงรอบรู้สิ่งที่อยู่ในทรวงอก",
                            "verse 67:14": "พระผู้ทรงสร้างจะมิทรงรอบรู้ดอกหรือ ? พระองค์คือผู้ทรงรอบรู้อย่างถี่ถ้วนผู้ทรงตระหนักยิ่ง",
                            "verse 67:15": "พระองค์คือผู้ทรงทำแผ่นดินนี้ให้ราบเรียบสำหรับพวกเจ้า ดังนั้นจงสัญจรไปตามขอบเขตของมันและจงบริโภคจากปัจจัยยังชีพของพระองค์ และยังพระองค์เท่านั้นการฟื้นคืนชีพ",
                            "verse 67:16": "พวกเจ้าจะปลอดภัยละหรือ จากการที่พระองค์ทรงสถิตย์อยู่ ณ ฟากฟ้าจะให้แผ่นดินสูบพวกเจ้าแล้วขณะนั้นมันจะหวั่นไหว",
                            "verse 67:17": "หรือว่าพวกเจ้าจะปลอดภัยจากการที่พระผู้ทรงสถิตย์อยู่ ณ ฟากฟ้า จะทรงส่งลมหอบก้อนกรวดให้กระหน่ำมายัง พวกเจ้า แล้วพวกเจ้าจะได้รู้ว่าการตักเตือนของข้าเป็นเช่นใด ?",
                            "verse 67:18": "และโดยแน่นอน บรรดา (หมู่ชน) ก่อนหน้าพวกเขาได้ปฏิเสธมาก่อนแล้ว ดังนั้นการปฏิเสธคำเตือนของข้ามีผลเป็นอย่างไร?",
                            "verse 67:19": "พวกเขามิได้มองไปดูนกที่ (บิน) อยู่เบื้องบนพวกเขาดอกหรือ? มันกาวปีกและหุบปีก (ของมัน) ไม่มีผู้ใดจะไปดึงมันไว้ได้นอกจากพระผู้ทรงกรุณาปรานี แท้จริงพระองค์ทรงมองเห็นทุกสิ่งอย่าง",
                            "verse 67:20": "หรือผู้ใดเล่า ซึ่งเขาเป็นพลพรรคของพวกเจ้าที่จะช่วยเหลือพวกเจ้าอื่นจากพระผู้ทรงกรุณาปรานี? พวกปฏิเสธศรัทธานั้นมิใช่อื่นใดเลยนอกจากในการหลอกลวงเท่านั้น",
                            "verse 67:21": "หรือผู้ใดเล่าซึ่งเขาจะให้ปัจจัยยังชีพแก่พวกเจ้า หากพระองค์ทรงระงับปัจจัยยังชีพของพระองค์ไว้ แต่ว่าพวกเจ้าดื้อรั้นอยู่ในความหยิ่งยะโส และห่าไกลจากความจริง",
                            "verse 67:22": "ผู้ที่เดินคว่ำคมำบนใบหน้าของเขาจะเป็นผู้ที่อยู่ในแนวทางที่ถูกต้องกว่า หรือว่าผู้ที่เดินตัวตรงอยู่บนแนวทางที่เที่ยงตรง",
                            "verse 67:23": "จงกล่าวเถิดมุฮัมมัด พระองค์คือผู้ทรงบังเกิดพวกเจ้าจะขอบคุณ",
                            "verse 67:24": "จงกล่าวเถิดมุฮัมมัด พระองค์เป็นผู้ทรงแพร่เผ่าพันธ์ของพวกเจ้าในแผ่นดินและพวกเจ้าจะถูกรวบรวมให้กลับไปหาพระองค์",
                            "verse 67:25": "และพวกเขากล่าวว่า เมื่อใดเล่าสัญญานี้จะเกิดขึ้น หากพวกท่านเป็นผู้สัตย์จริง",
                            "verse 67:26": "จงกล่าวเถิดมุฮัมมัด ความรู้ในเรื่องนั้นอยู่ที่อัลลอฮ์ ความจริงฉันเป็นเพียงผู้ตักเตือนอันแจ่มแจ้งเท่านั้น",
                            "verse 67:27": "ต่อเมื่อพวกเขาเห็นมัน (การลงโทษ) ใกล้เข้ามาแล้ว ใบหน้าของบรรดาผู้ปฏิเสธศรัทธาก็จะหม่นหมอง และจะมีเสียงกล่าวว่า นี่คือสิ่งที่พวกเจ้าร้องขอ (ในโลกดุนยา)",
                            "verse 67:28": "จงกล่าวเถิดมุฮัมมัด พวกท่านจะบอกฉันซิว่า หากอัลลอฮ์จะทรงทำลายฉันและผู้ที่อยู่ร่วมกับฉันหรือจะทรงเมตตาแก่พวกเรา ดังนั้นผู้ใดเล่าจะช่วยพวกปฏิเสธศรัทธาให้พ้นจากการลงโทษอันเจ็บปวด",
                            "verse 67:29": "จงกล่าวเถิดมุฮัมมัด พระองค์คือพระผู้ทรงกรุณาปรานี เราศรัทธาต่อพระองค์แล้วเราขอมอบหมายแด่พระองค์แล้วจะได้รู้ว่าใครผู้ใดอยู่ในการหลงผิดอันชัดแจ้ง",
                            "verse 67:30": "จงกล่าวเถิดมุฮัมมัด พวกท่านจงบอกฉันซิว่า หากแหล่งน้ำของพวกท่านเหือดแห้งลง ดังนั้นผู้ใดเล่าจะนำน้ำที่ท่วมทันมาให้พวกท่าน"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Mutlak hükümranlık elinde olan Allah, yüceler yücesidir ve O'nun her şeye gücü yeter.",
                            "verse 67:2": "O ki, hanginizin daha güzel davranacağını sınamak için ölümü ve hayatı yaratmıştır. O, mutlak galiptir, çok bağışlayıcıdır.",
                            "verse 67:3": "O ki, birbiri ile âhenktar yedi göğü yaratmıştır. Rahmân olan Allah'ın yaratışında hiçbir uygunsuzluk göremezsin. Gözünü çevir de bir bak, bir bozukluk görebiliyor musun?",
                            "verse 67:4": "Sonra gözünü, tekrar tekrar çevir bak; göz (aradığı bozukluğu bulmaktan) âciz ve bitkin halde sana dönecektir.",
                            "verse 67:5": "Andolsun ki biz, (dünyaya) en yakın olan göğü kandillerle donattık. Bunları şeytanlara atış taneleri yaptık ve onlara alevli ateş azabını hazırladık.",
                            "verse 67:6": "Rablerini inkâr edenler için cehennem azabı vardır. O, ne kötü dönüştür!",
                            "verse 67:7": "Oraya atıldıklarında, onun kaynarken çıkardığı uğultuyu işitirler.",
                            "verse 67:8": "Neredeyse cehennem öfkesinden çatlayacak! Her ne zaman oraya bir topluluk atılsa, onun bekçileri onlara: Size, (bu azap ile) korkutucu bir peygamber gelmemiş miydi? diye sorarlar.",
                            "verse 67:9": "Onlar şöyle cevap verirler: Evet, doğrusu bize, (bu azap ile) korkutan bir peygamber gelmişti; fakat biz (onu) yalan saymış ve: Allah'ın bir şey gönderdiği yok; siz olsa olsa büyük bir sapıklık içindesiniz! demiştik.",
                            "verse 67:10": "Ve: Şayet kulak vermiş veya aklımızı kullanmış olsaydık, (şimdi) şu alevli cehennemin mahkûmları arasında olmazdık! diye ilâve ederler.",
                            "verse 67:11": "Böylece günahlarını itiraf ederler. Artık (Allah'ın rahmetinden) uzak olsun, o alevli cehennemin mahkûmları!",
                            "verse 67:12": "Fakat daha görmeden Rablerinden (azabından) korkanlara gelince, onlar için gerçekten hem bağışlanma hem de büyük mükâfat vardır.",
                            "verse 67:13": "Sözünüzü ister gizleyin, ister açığa vurun; bilin ki O, kalplerin içindekini bilmektedir.",
                            "verse 67:14": "Hiç yaratan bilmez mi? O, en ince işleri görüp bilmektedir ve her şeyden haberdardır.",
                            "verse 67:15": "Yeryüzünü size boyun eğdiren O'dur. Şu halde yerin omuzlarında (üzerinde) dolaşın ve Allah'ın rızkından yeyin. Dönüş ancak O'nadır.",
                            "verse 67:16": "Gökte olanın, sizi yere batırıvermeyeceğinden emin misiniz? O zaman yer sarsıldıkça sarsılır.",
                            "verse 67:17": "Yahut gökte olanın üzerinize taş yağdıran (bir fırtına) göndermeyeceğinden emin misiniz? İşte (bu) tehdidimin ne demek olduğunu yakında bileceksiniz!",
                            "verse 67:18": "Andolsun ki, onlardan öncekiler de (bunu) yalan saymışlardı; ama benim karşılık olarak verdiğim azap nasıl olmuştu!",
                            "verse 67:19": "Üstlerinde kanatlarını aça-kapata uçan kuşları (hiç) görmediler mi? Onları (havada) rahmân olan Allah'tan başkası tutmuyor. Şüphesiz O her şeyi görmektedir.",
                            "verse 67:20": "Rahmân olan Allah'a karşı şu size yardım edecek askerleriniz hani kimlerdir? İnkârcılar ancak derin bir gaflet içinde bulunmaktadırlar.",
                            "verse 67:21": "Allah size verdiği rızkı kesiverse, size rızık verebilecek olan kimdir? Hayır, onlar azgınlık ve nefrette direnip durmaktadırlar.",
                            "verse 67:22": "Şimdi (düşünün bakalım), yüz üstü kapanarak yürüyen mi (varılacak) yere daha iyi erişir, yoksa doğru yolda düzgün yürüyen mi?",
                            "verse 67:23": "(Resûlüm!) De ki: Sizi yaratan, size işitme duyusu, gözler ve kalpler veren O'dur. Ne az şükrediyorsunuz!",
                            "verse 67:24": "De ki: Sizi yeryüzünde çoğaltıp yayan O'dur; ancak O'nun huzuruna gelip toplanacaksınız.",
                            "verse 67:25": "\"Doğru sözlü iseniz (söyleyin), bu tehdit hani ne zaman (gerçekleşecek)?\" derler.",
                            "verse 67:26": "De ki: O bilgi, ancak Allah'a mahsustur. Ben ise sadece apaçık bir uyarıcıyım.",
                            "verse 67:27": "Ama onu (azabı) yakından gördükleri zaman, inkâr edenlerin yüzleri kararacak ve (kendilerine): İşte sizin isteyip durduğunuz budur! denecektir.",
                            "verse 67:28": "De ki: Allah beni ve beraberimdekileri (sizin istediğiniz üzere) yok etse veya (öyle olmayıp da) bizi esirgese, (söyleyin bakalım) inkârcıları yakıcı azaptan kurtaracak kimdir?",
                            "verse 67:29": "De ki: (Sizi imana davet ettiğimiz) O (Allah) çok esirgeyicidir; biz O'na iman etmiş ve sırf O'na güvenip dayanmışızdır. Siz kimin apaçık bir sapıklık içinde olduğunu yakında öğreneceksiniz!",
                            "verse 67:30": "De ki: Suyunuz çekiliverse, söyleyin bakalım, size kim bir akar su getirebilir?"
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 67:1": "Қўлида мулк бўлган У зот улуғ, муқаддас бўлди. У барча нарсага қодирдир.",
                            "verse 67:2": "У ўлим ва ҳаётини сизларнинг қайсиларингиз амалда яхшироқ эканлигингизни синаш учун яратгандир. У азиз ва ўта мағфиратлидир. (Ўлимни эслаган одам унга тайёргарлик кўради ва ўлгандан сўнг шарманда бўлмаслик учун ўзини яхши ишларга сафарбар қилади.)",
                            "verse 67:3": "У етти осмонни табақама-табақа яратгандир. Роҳманнинг яратганида ҳеч тафовут кўрмассан. Қайта назар сол! Бирор камчилик кўряпсанми?",
                            "verse 67:4": "Сўнг такрор-такрор назар сол, назар сенга истаганини топа олмай, ҳорғин- чарчаган ҳолда қайтади.",
                            "verse 67:5": "Ва дарҳақиқат Биз яқин осмонни чироқлар билан зийнатлаб қўйдик ва у (чироқ)ларни шайтонларга отиладиган нарса ҳам қилиб қўйдик. Ва у(шайтон)ларга олови қизиб турган жаҳаннамни тайёрлаб қўйдик. (Араб фолбинлари бизнинг шайтонларимиз осмонга чиқиб, ғойибдаги нарсаларни билиб беради, деб мақтанар эдилар. Қуръони Карим буни рад этиб, бу дунёда шайтонларни юлдузлардан ажраб чиққан учқунлар қувиб ҳайдашини, у дунёда эса, уларга Аллоҳ жаҳаннам азобини тайёрлаб қўйганини таъкидламоқда.)",
                            "verse 67:6": "Ўз Роббиларига куфр келтирганлар учун жаҳаннам азоби бордур ва у қандай ҳам ёмон қайтадиган жой!",
                            "verse 67:7": "Улар жаҳаннамга ташланган чоғларида унинг ҳанграган овозини эшитурлар, у эса қайнаб турган бўладир.",
                            "verse 67:8": "У ғазабдан ёрилиб кетай дейдир. Ҳар қачон унга янги гуруҳ ташланганда унинг хизматкорлари: «Сизларга огоҳлантирувчи келмаганмиди?», деб сўрайдир.",
                            "verse 67:9": "Улар: «Ҳа, дарҳақиқат бизга огоҳлантирувчи келган эди. Лекин биз (уни) ёлғончига чиқардик ва: «Аллоҳ ҳеч нарса туширгани йўқ, сизлар катта адашувдан бошқа ҳеч нарса эмассизлар», деган эдик», дерлар.",
                            "verse 67:10": "Ва улар: «Агар эътибор қулоғи билан эшитганимизда ёки ақлни ишлатганимизда эди, дўзахийлар орасида бўлмаган бўлар эдик», дерлар.",
                            "verse 67:11": "Бас, улар ўз гуноҳларини эътироф этдилар. Йўқолсин дўзахийлар!",
                            "verse 67:12": "Албатта ўз Роббиларидан ғойибдан қўрқадиганлар учун гуноҳларини кечиш ва улкан ажр-савоблар бордир.",
                            "verse 67:13": "Ва сиз сўзингизни сир тутасизми ёки ошкора айтасизми, албатта, У кўнгиллардагини ҳам билгувчи зотдир.",
                            "verse 67:14": "Яратган зот Ўзи билмасмиди? Ва У дақиқларгача билувчи ва хабардор зотдир.",
                            "verse 67:15": "У сизларга ерни бўйсундириб қўйган зотдир. Бас, унинг турли жойларида юринг ва Унинг ризқидан енг ва қабрдан чиқиб бориш ҳам Унинг ҳузурига бўладир. (Уламоларимиз қадимдан ушбу ояти кариманинг тафсирини Исломда меҳнатга чорлаш, ризқни териб ейиш, ер юзинининг турли жойларида ҳаракат қилиш зарурлигига далил қилиб келтирадилар. Дарҳақиқаат, Аллоҳ таоло ерни инсонга бўйсундириб қўйган, лекин бу ҳақиқат ҳозирги асримиздагидек ҳеч қачон яққол кўзга ташланмаган.)",
                            "verse 67:16": "Осмондаги зот сизларни ерга юттириб юборишидан омонда бўлдингизми? У (ер) эса изтиробда ҳаракатланиб туради. («Осмондаги зот»дан мурод Аллоҳ таоло, лекин бу дегани Аллоҳ осмонда дегани эмас. Чунки Аллоҳ таоло маконга муҳтож эмасдир. У макон ва замондан устун зотдир. Аҳли сунна ва жамоа эътиқодига биноан, Аллоҳнинг ерда ёки осмонда дейилишидан мақсад, Унинг хоҳиши ва ҳукми еру осмонга баробар ўтиши ва Унинг султони ғолиб эканлигидир.)",
                            "verse 67:17": "Ёки осмондаги зот сизларга азоб шамолни юборишидан омонда бўлдингизми? Бас, албатта огоҳлантириш қандоқ бўлишини билурсизлар.",
                            "verse 67:18": "Ва дарҳақиқат улардан аввалгилари ҳам ёлғонга чиқарган эдилар. Бас инкорим қандай бўлди?!",
                            "verse 67:19": "Тепаларида (қаноатларини) ёйиб ва йиғаётган қушни кўрмайдиларми? Уларни Роҳмандан бошқа ушлаб турувчи йўқ. Албатта, У барча нарсани кўрувчидир.",
                            "verse 67:20": "Роҳмандан бошқа сизларга ёрдам берадиган аскар ким ўзи? Кофирлар ғурурдан бошқа ҳеч нарсада эмаслар!",
                            "verse 67:21": "У Ризқни тортиб қўйса, сизга ризқ берадиган ким ўзи?! Балки улар абадий туғёнда ва ҳақдан нафратда бўлурлар.",
                            "verse 67:22": "Юз тубан қоқилиб юраётган киши ҳидоятдами ёки тўғри йўлдан қоматини тик тутиб бораётган кишими? («Юз тубан, қоқилиб юраётган киши» кофир кишидир. Чунки, унинг аниқ йўли, мақсади ва кўрсатмаси йўқ. Йўли адаштирувчи, хавф-хатарларга тўладир.)",
                            "verse 67:23": "Сен: «У сизларни йўқдан бор қилган ва сизларга эшитиш, кўриш ва ақлни берган зотдир. Жуда ҳам оз шукр қиласизлар-а?!» деб айт.",
                            "verse 67:24": "Сен: «У сизларни ер юзида яратган, кўпайтирган зотдир. Ва Унинг ҳузурига тўпланурсизлар», деб айт.",
                            "verse 67:25": "Ва улар: «Агар ростгўй бўлсангиз, бу ваъда қачон бўлади?» дерлар.",
                            "verse 67:26": "Мен: «Албатта, илм, фақат Аллоҳнинг ҳузуридадир. Ва албатта, мен яққол огоҳлантирувчиман, холос», деб айт.",
                            "verse 67:27": "Бас азобни яқиндан кўрганда куфр келтирганларнинг юзлари қораяр. Ва уларга: «Сўраган нарсангиз шу бўлади», дейилур.",
                            "verse 67:28": "Сен: «Айтинглар-чи, агар Аллоҳ мени ва мен билан бўлганларни ҳалок қилса ёки раҳм қилса, кофирларни аламли азобдан ким қутқариб қолади?!» деб айт.",
                            "verse 67:29": "Сен: «У Роҳмандур, биз Унга иймон келтирдик ва Унга таваккал қилдик. Бас, сизлар тезда ким очиқ-ойдин хатода эканини билурсизлар», деб айт.",
                            "verse 67:30": "Сен: «Айтинглар-чи, агар сувларингиз ерга сингиб кетса, сизларга ким осонгина топиладиган сувни келтиради?» деб айт."
                        }
                    }
                }
            }
        }
    }
}