{
    "id": 68,
    "name_simple": "Al-Qalam",
    "revelation_place": "makkah",
    "revelation_order": 2,
    "bismillah_pre": true,
    "verses_count": 52,
    "short_text": "This Surah is called Nun as well as Al-Qalam, the words with which it begins.",
    "text": [
        "\n",
        "This Surah is called Nun as well as Al-Qalam, the words with which it begins.",
        "\n",
        "Period of Revelation",
        "\n",
        "This too is one of the earliest surahs to be revealed at Makkah, but its subject matter shows that it was sent down at the time when opposition to the Holy Prophet (upon whom be peace) had grown very harsh and tyrannical.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "It consists of three themes: Replies to the opponents objections, administration of warning and admonition to them, and exhortation to the Holy Prophet (upon whom be peace) to patience and constancy.",
        "\n",
        "At the outset, the Holy Prophet has been addressed, to the effect: \"The disbelievers call you a madman whereas the Book that you are presenting and the sublime conduct that you practice, are by themselves sufficient to refute their false accusations. Soon they will see as to who was mad and who was sane; therefore, do not at all yield to the din of opposition being kicked up against you, for all this is actually meant to cow you and make you resort to a compromise with them.\"",
        "\n",
        "Then, in order to enlighten the common people the character of a prominent man from among the opponents, whom the people of Makkah fully well recognized, has been presented, without naming him:At that time, the Holy Prophet's pure and sublime conduct was before them, and every discerning eye could also see what sort of character and morals were possessed by the chiefs of Makkah, who were leading the opposition against him.",
        "\n",
        "Then, in vv. 17-33, the parable of the owners of a garden has been presented, who after having been blessed by Allah turned ungrateful to Him, and did not heed the admonition of the best man among them when it was given them. Consequently, they were deprived of the blessing and they realized this, when all they had lay devastated. With this parable the people of Makkah have been warned to the effect:\"With the appointment of the Holy Prophet (upon whom be peace) to Prophethood, you, O people of Makkah, too, have been put to a test similar to the one to which the owners of the garden had been put. If you do not listen to him, you too will be afflicted with a punishment in the world, and the punishment of the Hereafter is far greater.\"",
        "\n",
        "Then, in vv. 34-47 continuously, the disbelievers have been admonished, in which the address sometimes turns to them directly and sometimes they are warned through the Holy Prophet (upon whom be peace). A summary of what has been said in this regard, is this: Well being in the Hereafter inevitably belongs to those who spend their lives in the world in full consciousness of God. It is utterly against reason that the obedient servants should meet in the Hereafter the same fate as the guilty. There is absolutely no basis of the disbelievers misunderstanding that God will treat them in the manner they choose for themselves, whereas they have no guarantee for this. Those who are being called upon to bow before God in the world and they refuse to do so, would be unable to prostrate themselves on the Day of Resurrection even if they wanted to do so, and thus would stand disgraced and condemned. Having denied the Qur'an they cannot escape Divine punishment. The rein they are being\r\ngiven, has deluded them. They think that since they are not being punished in spite of their denial, they must be on the right path, whereas they are following the path of ruin. They have no reasonable ground for opposing the Messenger, for he is a preacher without any vested interest: he is not asking any reward of them for himself, and they cannot either make the claim that they know with certainty that he is not a true Messenger, nor that what he says is false.",
        "\n",
        "In conclusion, the Holy Prophet (upon whom be peace) has been exhorted to the effect:\"Bear with patience the hardships that you may have to face in the way of preaching the Faith till Allah's judgment arrives, and avoid the impatience which caused suffering and affliction to the Prophet Jonah (peace be on him).\"",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that opens with the single discrete Arabic letter Nūn and the oath of the Divine One swearing by the instrument of The Pen, as well as all knowledge that people are able to preserve and communicate thereby. It takes its name from “the pen” (al-qalam) mentioned in verse 1. The surah deals with the accusation that Muhammad was not God’s Messenger but merely mad (verse 2 .). The arrogance of those who assume that, because they have some of the good things in this life, they can reject the Revelation, is rebutted (verse 10 .). Examples are given of those who came to regret their arrogance (verse 17 .). The Prophet is urged to remain steadfast (verse 48 .).",
    "name_translation": "The Pen",
    "name_complex": "Al-Qalam",
    "surah_name_ar": "القلم",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 68:1": "Nûn. Pasha pendën dhe në atë që shkruajnë ata,",
                            "verse 68:2": "ti, me dhuntinë e Zotit tënd, nuk je i marrë;",
                            "verse 68:3": "ti, me të vërtetë, do të jesh përherë i shpërblyer",
                            "verse 68:4": "dhe, me të vërtetë, ti je me virtyte të mëdha",
                            "verse 68:5": "dhe, ti do të shohësh, por edhe ata (jobesimtarët) do të shohin,",
                            "verse 68:6": "kush nga ju është i marrë.",
                            "verse 68:7": "Zoti yt e di më së miri për atë që e ka devijuar rrugën e tij dhe Ai i di mirë ata që janë në rrugën e drejtë.",
                            "verse 68:8": "Andaj, mos ju përul ti atyre që përgënjeshtrojnë.",
                            "verse 68:9": "Ata dëshirojnë që ti të bësh lëshime, e të bëjnë (lëshime) edhe ata,",
                            "verse 68:10": "dhe mos ju përul ti atyre që betohen (rrejshëm), e që janë të poshtër,",
                            "verse 68:11": "lajkatarit dhe atë që transmeton fjalët për të keq;",
                            "verse 68:12": "penguesin e të mirav, e kundërvajtësin e mëkatarin e madh;",
                            "verse 68:13": "të ashpërit dhe pos kësaj edhe kopil, -",
                            "verse 68:14": "(mos ju përul ti) për shkak se është i pasur dhe ka shumë djemë,",
                            "verse 68:15": "i cili kur t’i lexohen ajetet Tona (Kur’ani), thotë: “Këto janë vetëm përralla të (popujve të) lashtë!”",
                            "verse 68:16": "Na (së shpejti), do t’ia damkosim hundën atij!",
                            "verse 68:17": "Na, do t’i provojmë ata (jobesimtaët), sikundër që i kemi provuar pronarët e kopshtit, të cilët ishin betuar se në mëngjes do t’i marrin frutet;",
                            "verse 68:18": "e nuk patën thënë: “Nëse do Zoti!”",
                            "verse 68:19": "Dhe, e goditi atë (kopshtin) një fatkeqësi nga Zoti yt, derisa ata flinin",
                            "verse 68:20": "dhe ai (kopshti) gëdhiu i shkretëruar.",
                            "verse 68:21": "Kurse, në agim, ata, e thirrën njëri-tjetrin:",
                            "verse 68:22": "“Nxitoni herët në kopshtin tuaj, nëe doni t’i tuboni frutet!”",
                            "verse 68:23": "Dhe at au nisën duke biseduar qetësisht:",
                            "verse 68:24": "“Mos të lejojmë që të paraqitet asnjë i vobektë në kopshtin tonë!”",
                            "verse 68:25": "Dhe, ata u nisën herët, të bindur se do të mund t’i pengojnë ata (të vobektit),",
                            "verse 68:26": "e kur e panë (kopshtin e shkretëruar), ata thanë: “Na, me të vërtetë, qenkemi të humbur;",
                            "verse 68:27": "por, jo, jo, - krejt paskemi mbaruar!”",
                            "verse 68:28": "Njëri më i arsyeshëm, prej tyre tha: “A nuk ju thashë unë se duhet ta kujtoni Perëndinë!”",
                            "verse 68:29": "“Lavdëruar qoftë Zoti ynë!” – thanë. Na, me të vërtetë, paskemi qentë të padrejtë!”",
                            "verse 68:30": "Dhe, atëherë filluan ta qortojnë njëri-tjetrin.",
                            "verse 68:31": "“Sa keq për ne!” thanë ata – ne, me të vërtetë, paskemi qenë të egërsuar;",
                            "verse 68:32": "Zoti ynë mund të na japë edhe më të mirë se këtë; me të vërtetë, ne mbështetemi te Zoti ynë!”",
                            "verse 68:33": "I tillë ka qenë dënimi, e dënimi në jetën tjetër është më i madh, nëse e dinë!",
                            "verse 68:34": "Për ata që i druajnë Perëndisë, te Perëndia do të ketë kopshte të dhuntisë, -",
                            "verse 68:35": "Vallë, a do t’i barazojmë muslimanët me njerëzit e këqinj?! –",
                            "verse 68:36": "Cka keni ju, si gjykoni ju?!",
                            "verse 68:37": "A keni ju ndonjë libër, në të cilin lexoni",
                            "verse 68:38": "se do të keni atë që e zgjedhni ju?",
                            "verse 68:39": "Apo, a ka për ju betime të mëdha, që do të vlejnë deri në Ditën e Kijametit, e që do ta keni atë çka e keni caktuar.",
                            "verse 68:40": "Pyeti ata – kush është garantues për këtë.",
                            "verse 68:41": "Ose, a kanë ata bashkëpunëtorë në këtë. E, le t’i sjellin ata bashkëpunëtorët e tyre, nëse flasin të vërtetën.",
                            "verse 68:42": "(Kujtoju) Ditën e vështirë, kur zbulohen të gjitha dhe ata ftohen (thirrën) që të përulen në tokë (në sexhde), e nuk munden (nuk do të kenë fuqi),",
                            "verse 68:43": "(ata do të jenë) me sy ulur dhe krejtësisht të poshtëruar, - e, me të vërtetë, kanë qenë të ftuar në përulje (sexhde), derisa qenë gjallë dhe shëndoshë.",
                            "verse 68:44": "Prandaj, më lë ti Mua, (Unë) do t’i dënoj ata që e mohojnë këtë Thënie (Kur’anin), Ne ata gradualisht do t’i mashtrojmë (për dënim) në mënyrë të panjohur",
                            "verse 68:45": "dhe u japim atyre afat, se, me të vërtetë, mashtrimi Im është i fortë!",
                            "verse 68:46": "A po kërkon ti shpërblim nga ata, e ata janë të rënduar nga borxhet?",
                            "verse 68:47": "E, a ka tek ata dijeni të fshehtë, e ata po i përshkruajnë ato?",
                            "verse 68:48": "Duro ti për gjykimin e Zotit tënd dhe mos u bën si peshkatari (Junusi), kur iu lut Zotit të vet, e ai (Junusi) ishte i hidhëruar,",
                            "verse 68:49": "dhe, sikur mos ta arrinte atë mirësi prej Perëndisë, ai do të hudhej në një shkretëtirë e do të ishte i qortuar,",
                            "verse 68:50": "por, Zoti i tij e ka zgjedhur dhe e ka bërë atë në grupin e njerëzve të mirë.",
                            "verse 68:51": "Pothuajse, me të vërtetë, jobesimtarët duan të të rrëzojnë me shikim kur dëgjojnë Kur’anin, duke thënë: “Ai, në të vërtetë, është i marrë!”",
                            "verse 68:52": "E, ai (Kur’ani), është këshillë për tërë botën!"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Nun! And olsun qələmə və (mələklərin) yazdıqlarına (yaxud lövhi-məhfuzda yazılanlara) ki,",
                            "verse 68:2": "Sən (ya Rəsulum!) Rəbbinin ne'məti sayəsində divanə deyisən!",
                            "verse 68:3": "Və həqiqətən, səni minnətsiz (tükənmək bilməyən) mükafat gözləyir!",
                            "verse 68:4": "Şübhəsiz ki, sən böyük bir əxlaq üzərindəsən!",
                            "verse 68:5": "(Tezliklə) sən də görəcəksən, onlar da görəcəklər,",
                            "verse 68:6": "Hansınızın divanə olduğunu!",
                            "verse 68:7": "Həqiqətən, sənin Rəbbin öz yolundan çıxanları da, doğru yoldan olanları da ən gözəl tanıyandır!",
                            "verse 68:8": "Elə isə (ya Peyğəmbər! Allahın ayələrini) yalan sayanlara itaət etmə!",
                            "verse 68:9": "(Müşriklər) istərdilər ki, sən onlara yumşaqlıq göstərəsən, onlar da sənə yumşaqlıq göstərsinlər! (Sən onların bütləri barəsində pis söz deməyəsən, onlar da sənə əziyyət verməsinlər və ya sən onların bütlərinə tapınasan, onlar da sənin Allahına ibadət etsinlər!)",
                            "verse 68:10": "(Ya Peyğəmbər!) İtaət etmə (yalan yerə) hər and içənə, alçağa;",
                            "verse 68:11": "Qeybət edənə, söz gəzdirənə;",
                            "verse 68:12": "Xeyrə mane olana, (zülm etməkdə) həddi aşana, günaha batana;",
                            "verse 68:13": "Daş ürəkliyə, (anlamaza və eyni zamanda) əsli-nəsəbi bilinməyən haramzadaya -",
                            "verse 68:14": "O, mal-dövlət, oğul-uşaq sahibi olsa belə!",
                            "verse 68:15": "Ayələrimiz ona oxunduğu zaman o: \"(Bunlar) qədimlərin əfsanələridir!\" - dedi.",
                            "verse 68:16": "Biz (tezliklə) onun burnuna damğa basacağıq!",
                            "verse 68:17": "Biz vaxtilə o bağ sahiblərini imtahana çəkdiyim kimi, bunları da (Məkkə mürşiklərini də) imtahana çəkdik. O vaxt (o bağ sahibləri) səhər açılanda (onun meyvələrini) mütləq dərəcəklərinə and içmişdilər.",
                            "verse 68:18": "Və heç bir istisna yeri də qoymamışdılar (inşallah deməmişdilər).",
                            "verse 68:19": "Onlar yuxuda ikən (ya Peyğəmbər!) sənin Rəbbindən o bağa bir bəla gəldi.",
                            "verse 68:20": "Və o (yanıb) qapqara qaraldı (külə döndü).",
                            "verse 68:21": "Onlar səhər qalxıb bir-birini belə səslədilər:",
                            "verse 68:22": "Əgər (məhsul) yığacaqsınızsa, bağınıza tez gedin!\"",
                            "verse 68:23": "Nəhayət, yola düşdülər, (yol boyu) bir-birinə xəlvətcə belə deyirdilər:",
                            "verse 68:24": "\"(Elə edin ki) bu gün orada yanınıza heç bir yoxsul soxulmasın!\"",
                            "verse 68:25": "Onlar (yoxsulları) bağa buraxmağa qadir olacaqlarını güman edərək erkən getdilər. [Və ya: Onlar gücləri yetdiyi halda (yoxsulları) yardımdan məhrum etməkdən ötrü sübh tezdən yola düzəldilər]",
                            "verse 68:26": "(Bağı) bu vəziyyətdə (yanıb külə dönmüş) gördükdə dedilər: \"Yəqin ki, (yolumuzu) azmışıq!",
                            "verse 68:27": "Xeyr, biz (bağımızın bərəkətindən) məhrum olmuşuq!\"",
                            "verse 68:28": "Onların ən ağıllısı (və insaflısı) dedi: \"Məgər mən sizə (Allahı) həmd-səna ilə təqdis etməli olduğunuzu demədimmi?!\"",
                            "verse 68:29": "Onlar: \"Rəbbimiz pakdır, müqəddəsdir! Həqiqətən, biz zalım idik!\" - dedilər.",
                            "verse 68:30": "Onlar bir-birini danlamağa başladılar.",
                            "verse 68:31": "Və dedilər: \"Vay halımıza! Biz azğınlıq (tüğyan) edirdik.",
                            "verse 68:32": "Ola bilsin ki, Rəbbimiz (tövbəmizi qəbul buyurub) onun əvəzinə bizə daha yaxşısını versin. Biz Rəbbimizdən (bizi bağışlamasını, bizə mərhəmət əta etməsini) diləyirik!\"",
                            "verse 68:33": "(Dünyadakı) əzab belədir. Şübhəsiz ki, axirət əzabı daha şiddətlidir. Kaş biləydilər!",
                            "verse 68:34": "Həqiqətən, Allahdan qorxub pis əməllərdən çəkinənləri Rəbbi yanında Nəim cənnətləti gözləyir!",
                            "verse 68:35": "Məgər Biz müsəlmanları kafirlərlə eynimi tutacağıq?!",
                            "verse 68:36": "(Ey kafirlər! Siz dünyada yoxsul mö'minlərdən var-dövlətcə üstün olduğunuz kimi, axirətdə də onlardan üstün olacağınızı, yaxud ən azı onlarla eyni olacağınızı iddia edirsiniz). Sizə nə olub, necə mühakimə yürüdürsünüz?",
                            "verse 68:37": "Yoxsa (Allahdan nazil olmuş) bir kitabınız vardır ki, (bunları) orada oxuyursunuz?!",
                            "verse 68:38": "Yaxud orada bəyənib seçdiyiniz hər şeyin sizin olacağı yazılmışdır?!",
                            "verse 68:39": "Və ya hökm edib istədiklərinizin sizin olacağınıza dair Bizdən qiyamət gününədək davam edəcək əhd almısınız?!",
                            "verse 68:40": "(Ya Peyğəmbər!) Onlardan soruş ki, hansı biri buna zamindir?",
                            "verse 68:41": "Yoxsa onların (axirətdə müsəlmanlardan üstün və ya onlarla eyni olacaqları barədəki iddialarını təsdiq edən) şərikləri vardır?! Əgər doğru deyirlərsə, qoy şəriklərini gətirsinlər!",
                            "verse 68:42": "İş çətinləşəcəyi (baldırlar açılacağı,lüt-üryan vəziyyətdə qiyamətə gedəcəkləri, qiyamət bütün dəhşəti ilə görünəcəyi, həqiqət aşkar olacağı) və səcdəyə (namaza) də'vət olunacaqları gün onlar (səcdə etməyə) qadir olmayacaqlar.",
                            "verse 68:43": "Gözləri zəlilcəsinə yerə dikiləcək, özlərini də zillət bürüyəcəkdir. Halbuki onlar (dünyada) sağlam olduqları ikən səcdəyə də'vət olunurdular.",
                            "verse 68:44": "(Ya Peyğəmbər!) Artıq bu kəlamı (Qur'anı) yalan sayanları Mənə tapşır. Biz onları özləri də bilmədən tədriclə əzaba giriftar edərik.",
                            "verse 68:45": "Onlara (daha çox günaha batmaq üçün bir müddət) möhlət verərəm. Həqiqətən Mənim əzabım dözülməz dərəcədə şiddətlidir.",
                            "verse 68:46": "Yoxsa sən (risaləti təbliğ etmək müqabilində) onlardan ücrət (muzd) istəyirsən və onlar ağır borc yükü altında qalıblar?!",
                            "verse 68:47": "Yoxsa qeyb (lövhi-məhfuz) yanlarındadır və onlar (səninlə mübahisə etdikləri məsələləri, qiyamət günü kafirlərin Allah yanında mö'minlərdən üstün olacağını oradan öyrənib) yazırlar?!",
                            "verse 68:48": "(Ya Rəsulum!) Sən öz Rəbbinin hökmünə səbr et və balıq sahibi (Yunis peyğəmbər) kimi olma (risaləti təbliğ etməyi yerə qoyma). O zaman o, (balığın qarnında) qəm-kədər içində boğularaq (Rəbbinə) dua etmişdi.",
                            "verse 68:49": "Əgər Rəbbindən ona bir mərhəmət (ne'mət) yetişməsəydi, o, məzəmmət olunaraq quru yerə (səhraya) atılacaqdı.",
                            "verse 68:50": "Amma (tövbə etdikdən sonra) Rəbbi onu (?z bəndələri içərisində) seçdi və salehlərdən (peyğəmbərlərdən) etdi.",
                            "verse 68:51": "(Ya Peyğəmbər!) Həqiqətən, kafirlər Qur'anı eşitdikləri zaman (sənə olan həsədlərindən və qəzəblərindən dolayı) az qala səni gözləri ilə yeyələr. Onlar (sənin barəndə): \"O divanədir!\" - deyirlər.",
                            "verse 68:52": "Halbuki bu (Qur'an) aləmlərə (insanlara və cinlərə) ancaq bir öyüd-nəsihətdir! (Onun nazil olduğu kimsə heç vaxt divanə ola bilməz!)"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Nun. Tako Mi kalema i onoga što oni pišu,",
                            "verse 68:2": "ti nisi, milošću Gospodara svoga, lud;",
                            "verse 68:3": "ti ćeš, sigurno, nagradu neprekidnu dobiti",
                            "verse 68:4": "jer ti si, zaista, najljepše ćudi",
                            "verse 68:5": "i ti ćeš vidjeti, a i oni će vidjeti,",
                            "verse 68:6": "ko je od vas lud.",
                            "verse 68:7": "Gospodar tvoj dobro zna onoga koji je s puta Njegova skrenuo i on dobro zna one koji su na Pravome putu,",
                            "verse 68:8": "zato ne slušaj one koji neće da vjeruju,",
                            "verse 68:9": "oni bi jedva dočekali da ti popustiš, pa bi i oni popustili,",
                            "verse 68:10": "i ne slušaj nijednog krivokletnika, prezrena,",
                            "verse 68:11": "klevetnika, onoga koji tuđe riječi prenosi,",
                            "verse 68:12": "škrca, nasilnika, velikog grješnika,",
                            "verse 68:13": "surova i, osim toga, u tuđe pleme uljeza,",
                            "verse 68:14": "samo zato što je bogat i što ima mnogo sinova,",
                            "verse 68:15": "koji govori, kad mu se ajeti Naši kazuju: \"To su samo naroda drevnih priče!\"",
                            "verse 68:16": "Na nos ćemo Mi njemu biljeg utisnuti!",
                            "verse 68:17": "Mi smo ih na kušnju stavili, kao što smo vlasnike jedne bašče na kušnju stavili kad su se zakleli da će je, sigurno, rano izjutra obrati",
                            "verse 68:18": "a nisu rekli: \"Ako Bog da!\"",
                            "verse 68:19": "I dok su oni spavali, nju od Gospodara tvoga zadesi nesreća",
                            "verse 68:20": "i ona osvanu opustošena.",
                            "verse 68:21": "A u zoru oni su jedni druge dozivali:",
                            "verse 68:22": "Poranite u bašču svoju ako je mislite obrati!",
                            "verse 68:23": "I oni krenuše tiho razgovarajući:",
                            "verse 68:24": "Neka vam danas u nju nikako nijedan siromah ne ulazi!",
                            "verse 68:25": "I oni poraniše uvjereni da će moći to provesti,",
                            "verse 68:26": "a kad je ugledaše, povikaše: \"Mi smo zalutali;",
                            "verse 68:27": "ali ne, ne - svega smo lišeni!\"",
                            "verse 68:28": "Ponajbolji između njih reče: \"Nisam li vam ja govorio da je trebalo na Allaha misliti!\"",
                            "verse 68:29": "Hvaljen neka je Gospodar naš! - \"mi smo, uistinu, nepravedni bili!\"",
                            "verse 68:30": "I onda počeše jedni druge koriti.",
                            "verse 68:31": "Teško nama! - govorili su - \"mi smo, zaista, obijesni bili;",
                            "verse 68:32": "Gospodar naš nam može bolju od nje dati, samo od Gospodara našeg mi se nadamo naknadi!\"",
                            "verse 68:33": "Eto takva je bila kazna, a na onome je svijetu je, nek znaju, kazna još veća!",
                            "verse 68:34": "Za one koji se budu bojali Allaha biće, zaista, dženneti uživanja u Gospodara njihova -",
                            "verse 68:35": "zar ćemo muslimane sa nevjernicima izjednačiti?!",
                            "verse 68:36": "Šta vam je, kako rasuđujete?",
                            "verse 68:37": "Imate li vi Knjigu, pa u njoj čitate",
                            "verse 68:38": "da ćete imati ono što vi izaberete?",
                            "verse 68:39": "Ili, zar smo vam se zakleli zakletvama koje će do Sudnjeg dana vrijediti da ćete ono što vi odredite imati?",
                            "verse 68:40": "Upitaj ih ko je od njih jamac za to.",
                            "verse 68:41": "Ili, imaju li oni druge jamce? Pa neka jamce svoje dovedu, ako govore istinu.",
                            "verse 68:42": "Na Dan kada bude nepodnošljivo i kada budu pozvani da licem na tle padnu pa ne budu mogli,",
                            "verse 68:43": "oborenih pogleda i sasvim poniženi biće nevjernici - a bili su pozivani da licem na tle padaju dok su živi i zdravi bili.",
                            "verse 68:44": "Zato ostavi Mene i one koji ovaj Govor poriču, Mi ćemo ih postepeno odakle se i ne nadaju patnji približavati",
                            "verse 68:45": "i vremena im davati, jer je obmana Moja, zaista, jaka!",
                            "verse 68:46": "Tražiš li ti od njih nagradu, pa su nametom opterećeni?",
                            "verse 68:47": "Ili je u njih iskonska knjiga, pa prepisuju?",
                            "verse 68:48": "Ti strpljivo čekaj presudu Gospodara svoga i ne budi kao Zunnun koji je u ogorčenju zavapio.",
                            "verse 68:49": "I da ga nije stigla Allahova milost, na pusto mjesto bi izbačen bio",
                            "verse 68:50": "ali, Gospodar njegov ga je odabrao i učinio ga jednim od onih koji su dobri.",
                            "verse 68:51": "Skoro da te nevjernici pogledima svojim obore kad Kur’an slušaju, govoreći: \"On je, uistinu, luda!\"",
                            "verse 68:52": "A Kur’an je svijetu cijelome opomena!"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "নূন। শপথ কলমের এবং সেই বিষয়ের যা তারা লিপিবদ্ধ করে,",
                            "verse 68:2": "আপনার পালনকর্তার অনুগ্রহে আপনি উম্মাদ নন।",
                            "verse 68:3": "আপনার জন্যে অবশ্যই রয়েছে অশেষ পুরস্কার।",
                            "verse 68:4": "আপনি অবশ্যই মহান চরিত্রের অধিকারী।",
                            "verse 68:5": "সত্ত্বরই আপনি দেখে নিবেন এবং তারাও দেখে নিবে।",
                            "verse 68:6": "কে তোমাদের মধ্যে বিকারগ্রস্ত।",
                            "verse 68:7": "আপনার পালনকর্তা সম্যক জানেন কে তাঁর পথ থেকে বিচ্যুত হয়েছে এবং তিনি জানেন যারা সৎপথ প্রাপ্ত।",
                            "verse 68:8": "অতএব, আপনি মিথ্যারোপকারীদের আনুগত্য করবেন না।",
                            "verse 68:9": "তারা চায় যদি আপনি নমনীয় হন, তবে তারাও নমনীয় হবে।",
                            "verse 68:10": "যে অধিক শপথ করে, যে লাঞ্ছিত, আপনি তার আনুগত্য করবেন না।",
                            "verse 68:11": "যে পশ্চাতে নিন্দা করে একের কথা অপরের নিকট লাগিয়ে ফিরে।",
                            "verse 68:12": "যে ভাল কাজে বাধা দেয়, সে সীমালংঘন করে, সে পাপিষ্ঠ,",
                            "verse 68:13": "কঠোর স্বভাব, তদুপরি কুখ্যাত;",
                            "verse 68:14": "এ কারণে যে, সে ধন-সম্পদ ও সন্তান সন্ততির অধিকারী।",
                            "verse 68:15": "তার কাছে আমার আয়াত পাঠ করা হলে সে বলে; সেকালের উপকথা।",
                            "verse 68:16": "আমি তার নাসিকা দাগিয়ে দিব।",
                            "verse 68:17": "আমি তাদেরকে পরীক্ষা করেছি, যেমন পরীক্ষা করেছি উদ্যানওয়ালাদের, যখন তারা শপথ করেছিল যে, সকালে বাগানের ফল আহরণ করবে,",
                            "verse 68:18": "ইনশাআল্লাহ না বলে।",
                            "verse 68:19": "অতঃপর আপনার পালনকর্তার পক্ষ থেকে বাগানে এক বিপদ এসে পতিত হলো। যখন তারা নিদ্রিত ছিল।",
                            "verse 68:20": "ফলে সকাল পর্যন্ত হয়ে গেল ছিন্নবিচ্ছিন্ন তৃণসম।",
                            "verse 68:21": "সকালে তারা একে অপরকে ডেকে বলল,",
                            "verse 68:22": "তোমরা যদি ফল আহরণ করতে চাও, তবে সকাল সকাল ক্ষেতে চল।",
                            "verse 68:23": "অতঃপর তারা চলল ফিসফিস করে কথা বলতে বলতে,",
                            "verse 68:24": "অদ্য যেন কোন মিসকীন ব্যক্তি তোমাদের কাছে বাগানে প্রবেশ করতে না পারে।",
                            "verse 68:25": "তারা সকালে লাফিয়ে লাফিয়ে সজোরে রওয়ানা হল।",
                            "verse 68:26": "অতঃপর যখন তারা বাগান দেখল, তখন বললঃ আমরা তো পথ ভূলে গেছি।",
                            "verse 68:27": "বরং আমরা তো কপালপোড়া,",
                            "verse 68:28": "তাদের উত্তম ব্যক্তি বললঃ আমি কি তোমাদেরকে বলিনি? এখনও তোমরা আল্লাহ তা’আলার পবিত্রতা বর্ণনা করছো না কেন?",
                            "verse 68:29": "তারা বললঃ আমরা আমাদের পালনকর্তার পবিত্রতা ঘোষণা করছি, নিশ্চিতই আমরা সীমালংঘনকারী ছিলাম।",
                            "verse 68:30": "অতঃপর তারা একে অপরকে ভৎর্সনা করতে লাগল।",
                            "verse 68:31": "তারা বললঃ হায়! দুর্ভোগ আমাদের আমরা ছিলাম সীমাতিক্রমকারী।",
                            "verse 68:32": "সম্ভবতঃ আমাদের পালনকর্তা পরিবর্তে এর চাইতে উত্তম বাগান আমাদেরকে দিবেন। আমরা আমাদের পালনকর্তার কাছে আশাবাদী।",
                            "verse 68:33": "শাস্তি এভাবেই আসে এবং পরকালের শাস্তি আরও গুরুতর; যদি তারা জানত!",
                            "verse 68:34": "মোত্তাকীদের জন্যে তাদের পালনকর্তার কাছে রয়েছে নেয়ামতের জান্নাত।",
                            "verse 68:35": "আমি কি আজ্ঞাবহদেরকে অপরাধীদের ন্যায় গণ্য করব?",
                            "verse 68:36": "তোমাদের কি হল ? তোমরা কেমন সিদ্ধান্ত দিচ্ছ?",
                            "verse 68:37": "তোমাদের কি কোন কিতাব আছে, যা তোমরা পাঠ কর।",
                            "verse 68:38": "তাতে তোমরা যা পছন্দ কর, তাই পাও?",
                            "verse 68:39": "না তোমরা আমার কাছ থেকেকেয়ামত পর্যন্ত বলবৎ কোন শপথ নিয়েছ যে, তোমরা তাই পাবে যা তোমরা সিদ্ধান্ত করবে?",
                            "verse 68:40": "আপনি তাদেরকে জিজ্ঞাসা করুন তাদের কে এ বিষয়ে দায়িত্বশীল?",
                            "verse 68:41": "না তাদের কোন শরীক উপাস্য আছে? থাকলে তাদের শরীক উপাস্যদেরকে উপস্থিত করুক যদি তারা সত্যবাদী হয়।",
                            "verse 68:42": "গোছা পর্যন্ত পা খোলার দিনের কথা স্মরণ কর, সেদিন তাদেরকে সেজদা করতে আহবান জানানো হবে, অতঃপর তারা সক্ষম হবে না।",
                            "verse 68:43": "তাদের দৃষ্টি অবনত থাকবে; তারা লাঞ্ছনাগ্রস্ত হবে, অথচ যখন তারা সুস্থ ও স্বাভাবিক অবস্থায় ছিল, তখন তাদেরকে সেজদা করতে আহবান জানানো হত।",
                            "verse 68:44": "অতএব, যারা এই কালামকে মিথ্যা বলে, তাদেরকে আমার হাতে ছেড়ে দিন, আমি এমন ধীরে ধীরে তাদেরকে জাহান্নামের দিকে নিয়ে যাব যে, তারা জানতে পারবে না।",
                            "verse 68:45": "আমি তাদেরকে সময় দেই। নিশ্চয় আমার কৌশল মজবুত।",
                            "verse 68:46": "আপনি কি তাদের কাছে পারিশ্রমিক চান? ফলে তাদের উপর জরিমানার বোঝা পড়ছে?",
                            "verse 68:47": "না তাদের কাছে গায়বের খবর আছে? অতঃপর তারা তা লিপিবদ্ধ করে।",
                            "verse 68:48": "আপনি আপনার পালনকর্তার আদেশের অপেক্ষায় সবর করুন এবং মাছওয়ালা ইউনুসের মত হবেন না, যখন সে দুঃখাকুল মনে প্রার্থনা করেছিল।",
                            "verse 68:49": "যদি তার পালনকর্তার অনুগ্রহ তাকে সামাল না দিত, তবে সে নিন্দিত অবস্থায় জনশুন্য প্রান্তরে নিক্ষিপ্ত হত।",
                            "verse 68:50": "অতঃপর তার পালনকর্তা তাকে মনোনীত করলেন এবং তাকে সৎকর্মীদের অন্তর্ভুক্ত করে নিলেন।",
                            "verse 68:51": "কাফেররা যখন কোরআন শুনে, তখন তারা তাদের দৃষ্টি দ্বারা যেন আপনাকে আছাড় দিয়ে ফেলে দিবে এবং তারা বলেঃ সে তো একজন পাগল।",
                            "verse 68:52": "অথচ এই কোরআন তো বিশ্বজগতের জন্যে উপদেশ বৈ নয়।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 68:1": "Нун. Кълна се в калема и в онова, което пишат!",
                            "verse 68:2": "Ти [о, Мухаммад] - по милостта на твоя Господ - не си луд.",
                            "verse 68:3": "За теб има несекваща награда.",
                            "verse 68:4": "Ти наистина имаш велик нрав.",
                            "verse 68:5": "Ти ще видиш и те ще видят",
                            "verse 68:6": "кой от вас е безумният.",
                            "verse 68:7": "Най-добре твоят Господ знае кой се е отклонил от Неговия път и най-добре Той знае напътените.",
                            "verse 68:8": "И не се покорявай на отричащите!",
                            "verse 68:9": "Желаят, ако се смекчиш, и те да се смекчат.",
                            "verse 68:10": "И не се покорявай на онзи, който все се кълне и е жалък,",
                            "verse 68:11": "клеветник, който разнася сплетни,",
                            "verse 68:12": "възпира доброто, престъпва, съгрешава,",
                            "verse 68:13": "грубиян и дори извънбрачен син.",
                            "verse 68:14": "А тъй като има богатство и синове,",
                            "verse 68:15": "когато му бъдат четeни Нашите знамения, казва: Легенди на предците!",
                            "verse 68:16": "Ще го бележим по носа.",
                            "verse 68:17": "Изпитахме ги, както изпитахме и стопаните на градината, когато се заклеха [тайно] да я оберат на сутринта.",
                            "verse 68:18": "И да не правят изключение.",
                            "verse 68:19": "И я споходи бедствие от твоя Господ, докато спяха.",
                            "verse 68:20": "И тя стана като черна нощ.",
                            "verse 68:21": "И си викаха един другиму на сутринта:",
                            "verse 68:22": "Тръгнете към своята реколта в зори, ако ще берете!",
                            "verse 68:23": "И се отправиха, шепнейки един на друг:",
                            "verse 68:24": "Днес да не влиза там при вас бедняк!",
                            "verse 68:25": "И тръгнаха в зори с твърдо намерение.",
                            "verse 68:26": "И когато я видяха, рекоха: Наистина сме се заблудили.",
                            "verse 68:27": "Не, ние сме лишени.",
                            "verse 68:28": "Най-разумният от тях рече: Не ви ли казах - защо не прославяте Аллах?",
                            "verse 68:29": "Рекоха: Слава на нашия Господ! Бяхме угнетители.",
                            "verse 68:30": "И започнаха взаимно да се укоряват.",
                            "verse 68:31": "Рекоха: О, горко ни, наистина сме престъпващи!",
                            "verse 68:32": "Дано нашият Господ ни даде в замяна по-добра от нея. Ние нашия Господ умоляваме.",
                            "verse 68:33": "Такова е наказанието. А наказанието в отвъдния живот е по-голямо, ако знаят.",
                            "verse 68:34": "Наистина за богобоязливите при техния Господ са Градините на блаженството.",
                            "verse 68:35": "Нима отдадените на Аллах ще сторим да са като престъпниците?",
                            "verse 68:36": "Какво ви е, така да отсъждате?",
                            "verse 68:37": "Или имате книга, от която се учите,",
                            "verse 68:38": "и в нея имате, каквото изберете?",
                            "verse 68:39": "Или имате обещание от Нас до Деня на възкресението да имате онова, което сами отсъждате?",
                            "verse 68:40": "Питай ги кой от тях е поръчител за това?",
                            "verse 68:41": "Или имат съдружници? Да доведат своите съдружници - ако говорят истината -",
                            "verse 68:42": "в Деня, когато ще се разкрият делата и [тези] ще бъдат приканени да се поклонят, а не ще могат.",
                            "verse 68:43": "Свели поглед, ще ги покрие унижение, а бяха приканвани да се покланят, когато бяха здрави.",
                            "verse 68:44": "Остави на Мен [о, Мухаммад] взимащите за лъжа тази Вест! Постепенно ще ги въвлечем [в погибел], без да разберат.",
                            "verse 68:45": "Ще им дам отсрочка. Моята промисъл е силна.",
                            "verse 68:46": "Или търсиш от тях отплата, та са обременени с дълг?",
                            "verse 68:47": "Или при тях е неведомото и те го записват?",
                            "verse 68:48": "Изтърпи до присъдата на твоя Господ и не бъди като човека в кита, който зовеше, изпълнен със скръб!",
                            "verse 68:49": "Ако не бе го достигнала милост от неговия Господ, щеше да е изхвърлен на голия бряг с упрек.",
                            "verse 68:50": "Но неговият Господ го пречисти и го стори праведник.",
                            "verse 68:51": "И едва не те сразяват с погледи неверниците, когато слушат Напомнянето6, и казват: Той е луд.",
                            "verse 68:52": "А то не е друго освен напомняне за световете."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "努奈。以筆和他們所寫的盟誓，",
                            "verse 68:2": "你為主的恩典，你絕不是一個瘋人，",
                            "verse 68:3": "你必得享受不斷的報酬。",
                            "verse 68:4": "你確是具備一種偉大的性格的。",
                            "verse 68:5": "你將看見，他們也將看見，",
                            "verse 68:6": "你們究竟誰是害瘋病的。",
                            "verse 68:7": "你的主的確知道誰是叛離他的正道的，他的確知道誰是遵循他的正道的。",
                            "verse 68:8": "你不要順從否認真理的人們，",
                            "verse 68:9": "他們希望你柔順，他們也柔順。",
                            "verse 68:10": "你不要順從每個妄誓的、卑賤的、",
                            "verse 68:11": "說謊的、進饞的、",
                            "verse 68:12": "吝嗇的、過份的、犯罪的、",
                            "verse 68:13": "粗鄙而且是私生子的人。",
                            "verse 68:14": "那是因為他是有財產和子嗣的。",
                            "verse 68:15": "有人對他宣讀我的跡象時，他就說：「這是古人的故事。」",
                            "verse 68:16": "我將在他的鼻子上打上烙印。",
                            "verse 68:17": "我確已考驗他們，猶如考驗園圃的主人們一樣。當時，他們曾盟誓，他們必定在早晨收獲園圃中的果實，",
                            "verse 68:18": "並不留一部分給貧民。",
                            "verse 68:19": "當他們正在睡覺的時候，從你的主發出的災難降臨那個園圃，",
                            "verse 68:20": "一旦之間變成焦土一樣。",
                            "verse 68:21": "他們曾在早晨彼此相呼：",
                            "verse 68:22": "「你們當在早晨到園裡去，如果你們要想收獲。」",
                            "verse 68:23": "他們走了，途中悄悄地商議說：",
                            "verse 68:24": "「今天絕不要讓一個貧民走進園圃。」",
                            "verse 68:25": "他們早晨起來以為自己是能遏制的。",
                            "verse 68:26": "當他們看見園圃的時候，他們說：「我們碓是迷誤的，",
                            "verse 68:27": "不然，我們是被剝奪的！」",
                            "verse 68:28": "他們中最優秀的人說：「難道我沒有對你們說嗎？你們怎麼不讚頌真主呢？」",
                            "verse 68:29": "他們說：「讚頌我們的主超絕萬物！我們確是不義的。」",
                            "verse 68:30": "於是他們大家走向前來，互相責備起來。",
                            "verse 68:31": "他們說：「傷哉我們！我們原來確是放蕩者。",
                            "verse 68:32": "或許我們的主，以一個比這還好的園圃，補償我們，我們確是懇求我們的主的。」",
                            "verse 68:33": "刑罰就是那樣的。後世的刑罰確是更重大的，假如他們知道。",
                            "verse 68:34": "敬畏的人們，在他們的主那裡，必將享受恩澤的樂園。",
                            "verse 68:35": "難道我使歸順的人像犯罪的人一樣嗎？",
                            "verse 68:36": "你們有甚麼理由？你們怎麼這樣的判斷呢！",
                            "verse 68:37": "難道有一本可供你們誦習的天經，",
                            "verse 68:38": "在那本天經裡你們確有自己所選擇的。",
                            "verse 68:39": "難道我曾與你們締結過復活日才滿期的、堅定的盟約，因而你們確有你們所判斷的？",
                            "verse 68:40": "你問他們，他們中有誰能保証那件事呢？",
                            "verse 68:41": "難道他們有許多配主嗎？教他們把那些配主召喚來，如果他們是誠實的人。",
                            "verse 68:42": "在那日，大難將臨頭，他們將被召去叩頭，而他們不能叩頭。",
                            "verse 68:43": "同時，他們身遭凌辱，不敢仰視。而過去他們健全的時候，曾被召去叩頭。",
                            "verse 68:44": "你讓我懲治否認這訓辭的人吧！我將使他們不知不覺地漸趨於毀滅。",
                            "verse 68:45": "我優容他們，我的計策確是周密的。",
                            "verse 68:46": "你向他們索取報酬，教他們擔負太重呢？",
                            "verse 68:47": "還是他們能知幽玄，故加以記錄呢？",
                            "verse 68:48": "故你應當忍受你的主的判決，不要像那個葬身魚腹的人一樣。當時，他拗著怒呼籲他的主；",
                            "verse 68:49": "假若從他的主發出的恩典沒有達到他，那末，他必受責備地被拋到荒涼的地方。",
                            "verse 68:50": "嗣後，他的主揀選了他，並使他入於善人之列。",
                            "verse 68:51": "不信道的人們幾乎以他們的怒目使你跌倒。當他們聽到宣讀教誨的時候，他們說：「他確是一個瘋子。」",
                            "verse 68:52": "這《古蘭經》不是別的，它是對全世界的教誨。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Nún. Při peru a při tom, co píší,",
                            "verse 68:2": "díky milosti Pána svého ty blázen žádný nejsi!",
                            "verse 68:3": "A věru tě očekává odměna neupomínaná,",
                            "verse 68:4": "vždyť vskutku povaha tvá je vznešená.",
                            "verse 68:5": "A spatříš ty a také oni spatří,",
                            "verse 68:6": "kdo z vás je pokušením svedený.",
                            "verse 68:7": "Pán tvůj nejlépe zná, kdož z cesty jeho zbloudili, a dobře ví i o těch, kdož správně jsou vedeni.",
                            "verse 68:8": "Neposlouchej ty, kdo za lháře tě prohlásili!",
                            "verse 68:9": "Rádi by, abys jim lichotil, a pak i oni by ti lichotili.",
                            "verse 68:10": "Neposlouchej žádného křivopřísežníka hnusného,",
                            "verse 68:11": "klevetníka s pomluvami obcházejícího,",
                            "verse 68:12": "dobrému se na odpor stavějícího, nepřítele hříšného,",
                            "verse 68:13": "násilníka, a k tomu původu pochybného",
                            "verse 68:14": "- i když je majetný a syny obdařen!",
                            "verse 68:15": "Když jsou před ním přednášeny naše verše, volá: \"Povídačky starých!\"",
                            "verse 68:16": "Však bude námi na rypáku označen!",
                            "verse 68:17": "A podrobujeme je zkoušce podobné té, jíž podrobili jsme majitele zahrady, kteří přísahali, že půjdou do ní zrána úrodu sklidit,",
                            "verse 68:18": "však nepronesli: \"Bude-li Bůh chtít!\"",
                            "verse 68:19": "A zatímco spali, jedna z metel Pána tvého ji navštívila,",
                            "verse 68:20": "takže za jitra zahrada jak očesána byla.",
                            "verse 68:21": "A zrána na sebe volali:",
                            "verse 68:22": "Pojďme časně na svá pole, abychom všechno sklidili!",
                            "verse 68:23": "A na cestu se vydali a vzájemně si šeptali:",
                            "verse 68:24": "Jen aby nám sem dnes žádný nuzák nepřišel!",
                            "verse 68:25": "A tak za jitra vyrazili, aby rozhodnutí své vyplnili,",
                            "verse 68:26": "však vidouce zahradu, vykřikli: \"Věru jsme v bludu byli!",
                            "verse 68:27": "Ba co víc, vždyť nezbylo nám vůbec nic!\"",
                            "verse 68:28": "I pravil nejobezřetnější z nich: \"Což neříkal jsem vám, že slávu Boží pronésti jsme měli?\"",
                            "verse 68:29": "A zvolali: \"Sláva budiž Pánu našemu, vždyť vskutku jsme nespravedliví byli.\"",
                            "verse 68:30": "A vzájemně si výčitky činili",
                            "verse 68:31": "řkouce: \"Běda nám, vpravdě jsme vzpurní byli;",
                            "verse 68:32": "ale snad Pán náš výměnou za ni nám lepší dá, vždyť my věru po Pánu svém touhu máme!\"",
                            "verse 68:33": "Takový bývá trest na tomto světě, však trest na onom světě ještě větší bude - kéž by si to uvědomili!",
                            "verse 68:34": "Bohabojní pak u Pána svého v zahradách slastí žíti budou.",
                            "verse 68:35": "Což učiníme ty, kdož do vůle Boží se odevzdali, stejnými jako hříšníky?",
                            "verse 68:36": "Co je vám, že tak soudíte?",
                            "verse 68:37": "Máte snad Písmo, z něhož studujete,",
                            "verse 68:38": "a je v něm pro vás jen to, co si vyberete?",
                            "verse 68:39": "Či jste snad s Námi spojeni přísahami platnými do dne zmrtvýchvstání, že dostanete to, co sami rozhodnete?",
                            "verse 68:40": "Zeptej se jich, kteří z nich jsou toho ručiteli,",
                            "verse 68:41": "či zda mají společníky? Ať tedy přivedou své společníky - pravdu hovoří-li -",
                            "verse 68:42": "v den, kdy lýtka budou obnažena a oni výzvu dostanou, aby na zem padli, a schopni toho nebudou.",
                            "verse 68:43": "A hanba na ně padne a zraky ponížením sklopí: vždyť k padnutí na zem vyzváni byli, když ještě v bezpečí na zemi žili.",
                            "verse 68:44": "Nech mne s těmi, kdož toto vyprávění za lež prohlásili; postupně zkázu k nim přivedu, aniž místo, odkud přišla, tušit budou.",
                            "verse 68:45": "Já značný jim dávám odklad, však jistý je můj úklad!",
                            "verse 68:46": "Či žádáš od nich odměnu a zatímco je dluhy tíží",
                            "verse 68:47": "anebo znají nepoznatelné z něhož si píší?",
                            "verse 68:48": "Trpělivě tedy vyčkávej rozsudek Pána svého a nebuď jako onen s rybou, jenž o pomoc volal, když cítil úzkost tísnivou.",
                            "verse 68:49": "A kdyby ho nebylo dostihlo Pána jeho dobrodiní, na holou zemi býval by byl vyvržen pln zahanbení.",
                            "verse 68:50": "Však Pán jeho si jej vyvolil a jedním z bezúhonných jej učinil.",
                            "verse 68:51": "A nevěřící, když připomenutí slyší, div že pohledy tě neproklínají a hovoří: \"On džiny je posedlý věru!\"",
                            "verse 68:52": "Však není to než připomenutí lidstvu všemu!"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Noen. Bij de pen, en bij hetgeen zij schrijven.",
                            "verse 68:2": "Gij zijt, bij de gratie van uw Heer, geen krankzinnige.",
                            "verse 68:3": "En voorzeker er is een loon voor u dat niet zal ophouden.",
                            "verse 68:4": "En gij staat zeker op hoog zedelijk peil.",
                            "verse 68:5": "En gij zult zien en zij (de ongelovigen) zullen ook zien,",
                            "verse 68:6": "Wie van u bezeten is.",
                            "verse 68:7": "Zeker, uw Heer weet het beste wie van Zijn weg afdwaalt en Hij kent het beste degenen die de leiding volgen.",
                            "verse 68:8": "Dus gehoorzaam de loochenaars niet.",
                            "verse 68:9": "Zij zouden willen dat gij meegaande waart, dan zouden zij ook meegaande kunnen zijn.",
                            "verse 68:10": "En geef geen gehoor aan een verachtelijke eedaflegger,",
                            "verse 68:11": "Lasteraar, achterklapper.",
                            "verse 68:12": "Tegenhouder van het goede, overtreder, zondaar,",
                            "verse 68:13": "Laatdunkend, bovendien een berucht misdadiger,",
                            "verse 68:14": "Omdat hij rijkdommen en kinderen bezit.",
                            "verse 68:15": "Wanneer Onze woorden aan hem worden voorgedragen, zegt hij: \"Fabelen der oudeu.\"",
                            "verse 68:16": "Wij zullen hem op de neus brandmerken.",
                            "verse 68:17": "Voorwaar, Wij zullen hen (de ongelovigen) op de proef stellen zoals Wij de eigenaars van een tuin beproefden toen zij zwoeren dat zij zeker het fruit daarvan in de vroege morgen zouden plukken.",
                            "verse 68:18": "En zij maakten geen voorbehoud.",
                            "verse 68:19": "Toen kwam er van uw Heer een bezoeking over hen, terwijl zij sliepen,",
                            "verse 68:20": "Waardoor (de tuin) werd als een gemaaid veld.",
                            "verse 68:21": "Toen riepen zij tot elkander in de morgen,",
                            "verse 68:22": "Zeggende: \"Gaat vroeg naar uw veld indien gij het fruit wilt plukken.\"",
                            "verse 68:23": "En zij gingen fluisterend met elkander op weg.",
                            "verse 68:24": "\"Laat heden geen arme bij u binnen komen.\"",
                            "verse 68:25": "En zij gingen vroeg in de morgen uit, (denkende) dat zij de macht hadden om het te verhinderen.",
                            "verse 68:26": "Maar toen zij de tuin zagen, zeiden zij: \"Voorwaar, wij zijn verdwaald!",
                            "verse 68:27": "Neen, wij zijn beroofd.\"",
                            "verse 68:28": "De beste onder hen sprak: \"Zeide ik niet tot u: ’Waarom looft gij (God) niet?’\"",
                            "verse 68:29": "Nu riepen zij uit: \"Glorie zij U, onze Heer! Voorzeker wij waren onrechtvaardig.\"",
                            "verse 68:30": "Toen gingen zij elkaar beschuldigen.",
                            "verse 68:31": "En zeiden: \"Wee ons, wij waren inderdaad overtreders.",
                            "verse 68:32": "Het kan zijn dat onze Heer ons een betere tuin dan deze zal geven, wij wenden ons tot onze Heer.\"",
                            "verse 68:33": "Zo is de straf (voor dit leven). En voorwaar, de straf van het Hiernamaals zal nog groter zijn, konden zij dit maar begrijpen!",
                            "verse 68:34": "Inderdaad, voor de rechtvaardigen zijn er verrukkelijke tuinen bij hun Heer!",
                            "verse 68:35": "Zullen Wij dan degenen die zich onderwerpen even als de schuldigen behandelen?",
                            "verse 68:36": "Wat is er met u? Hoe oordeelt gij?",
                            "verse 68:37": "Hebt gij een Boek waarin gij leest?",
                            "verse 68:38": "Dat gij alles waarnaar gij verlangt zult verkrijgen?",
                            "verse 68:39": "Of hebt gij enige verdragen met Ons gesloten tot de Dag der Opstanding zodat gij dan alles zult hebben wat gij zult willen?",
                            "verse 68:40": "Vraag hun, wie van hen daar borg voor is.",
                            "verse 68:41": "Of hebben zij soms deelgenoten? Laten zij dan deze naar voren brengen als zij de waarheid spreken.",
                            "verse 68:42": "Op de Dag, waarop men beangstigd wordt, zullen zij geroepen worden te prostreren, maar zij zullen dat niet kunnen doen.",
                            "verse 68:43": "Hun ogen zullen terneergeslagen zijn en vernedering zal hen overvallen, want zij werden tot het prostraat Sadjdah geroepen toen hun niets ontbrak (en zij deden het niet).",
                            "verse 68:44": "Laat Mij en degenen die deze aankondiging loochenen, alleen. Wij zullen hen stap voor stap (de vernietiging) doen naderen, op een wijze die zij niet kennen.",
                            "verse 68:45": "En Ik geef hun uitstel; want Mijn opzet is sterk.",
                            "verse 68:46": "Vraagt gij van hen een beloning voor u zelf zodat zij onder schuld gebukt gaan?",
                            "verse 68:47": "Of hebben zij kennis van het onzienlijke, zodat zij het kunnen opschrijven?",
                            "verse 68:48": "Wacht geduldig op het gebod van uw Heer en wees niet als de man van de vis toen hij (God) aanriep terwijl hij misnoegd was.",
                            "verse 68:49": "Als een gunst van zijn Heer hem niet had bereikt dan zou hji zeker op een dorre kust geworpen zijn, terwijl hij vernederd werd.",
                            "verse 68:50": "Maar zijn Heer verkoos hem en maakte hem tot één der goeden.",
                            "verse 68:51": "En de ongelovigen wanneer zij het vermaan horen willen u met hun blikken gaarne ten val brengen; en zij zeggen: \"Hij is zeker krankzinnig.\"",
                            "verse 68:52": "Neen, het (Boek) is niets dan een vermaning voor de werelden."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 68:1": "Nun. By the pen and that which they write (therewith),",
                            "verse 68:2": "Thou art not, for thy Lord’s favour unto thee, a madman.",
                            "verse 68:3": "And lo! thine verily will be a reward unfailing.",
                            "verse 68:4": "And lo! thou art of a tremendous nature.",
                            "verse 68:5": "And thou wilt see and they will see",
                            "verse 68:6": "Which of you is the demented.",
                            "verse 68:7": "Lo! thy Lord is Best Aware of him who strayeth from His way, and He is Best Aware of those who walk aright.",
                            "verse 68:8": "Therefor obey not thou the rejecters",
                            "verse 68:9": "Who would have had thee compromise, that they may compromise.",
                            "verse 68:10": "Neither obey thou each feeble oath-monger,",
                            "verse 68:11": "Detracter, spreader abroad of slanders,",
                            "verse 68:12": "Hinderer of the good, transgressor, malefactor",
                            "verse 68:13": "Greedy therewithal, intrusive.",
                            "verse 68:14": "It is because he is possessed of wealth and children",
                            "verse 68:15": "That, when Our revelations are recited unto him, he saith: Mere fables of the men of old.",
                            "verse 68:16": "We shall brand him on the nose.",
                            "verse 68:17": "Lo! We have tried them as We tried the owners of the garden when they vowed that they would pluck its fruit next morning,",
                            "verse 68:18": "And made no exception (for the Will of Allah);",
                            "verse 68:19": "Then a visitation from thy Lord came upon it while they slept",
                            "verse 68:20": "And in the morning it was as if plucked.",
                            "verse 68:21": "And they cried out one unto another in the morning,",
                            "verse 68:22": "Saying: Run unto your field if ye would pluck (the fruit).",
                            "verse 68:23": "So they went off, saying one unto another in low tones:",
                            "verse 68:24": "No needy man shall enter it to-day against you.",
                            "verse 68:25": "They went betimes, strong in (this) purpose.",
                            "verse 68:26": "But when they saw it, they said: Lo! we are in error!",
                            "verse 68:27": "Nay, but we are desolate!",
                            "verse 68:28": "The best among them said: Said I not unto you: Why glorify ye not (Allah) ?",
                            "verse 68:29": "They said: Glorified be our Lord! Lo! we have been wrong-doers.",
                            "verse 68:30": "Then some of them drew near unto others, self-reproaching.",
                            "verse 68:31": "They said: Alas for us! In truth we were outrageous.",
                            "verse 68:32": "It may be that our Lord will give us better than this in place thereof. Lo! we beseech our Lord.",
                            "verse 68:33": "Such was the punishment. And verily the punishment of the Hereafter is greater if they did but know.",
                            "verse 68:34": "Lo! for those who keep from evil are gardens of bliss with their Lord.",
                            "verse 68:35": "Shall We then treat those who have surrendered as We treat the guilty ?",
                            "verse 68:36": "What aileth you ? How foolishly ye judge!",
                            "verse 68:37": "Or have ye a scripture wherein ye learn",
                            "verse 68:38": "That ye shall indeed have all that ye choose ?",
                            "verse 68:39": "Or have ye a covenant on oath from Us that reacheth to the Day of Judgment, that yours shall be all that ye ordain ?",
                            "verse 68:40": "Ask them (O Muhammad) which of them will vouch for that!",
                            "verse 68:41": "Or have they other gods ? Then let them bring their other gods if they are truthful",
                            "verse 68:42": "On the day when it befalleth in earnest, and they are ordered to prostrate themselves but are not able,",
                            "verse 68:43": "With eyes downcast, abasement stupefying them. And they had been summoned to prostrate themselves while they were yet unhurt.",
                            "verse 68:44": "Leave Me (to deal) with those who give the lie to this pronouncement. We shall lead them on by steps from whence they know not.",
                            "verse 68:45": "Yet I bear with them, for lo! My scheme is firm",
                            "verse 68:46": "Or dost thou (Muhammad) ask a fee from them so that they are heavily taxed ?",
                            "verse 68:47": "Or is the Unseen theirs that they can write (thereof) ?",
                            "verse 68:48": "But wait thou for thy Lord’s decree, and be not like him of the fish, who cried out in despair.",
                            "verse 68:49": "Had it not been that favour from his Lord had reached him he surely had been cast into the wilderness while he was reprobate.",
                            "verse 68:50": "But his Lord chose him and placed him among the righteous.",
                            "verse 68:51": "And lo! those who disbelieve would fain disconcert thee with their eyes when they hear the Reminder, and they say: Lo! he is indeed mad;",
                            "verse 68:52": "When it is naught else than a Reminder to creation."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 68:1": "Nun. By the Pen and the (Record) which (men) write,-",
                            "verse 68:2": "Thou art not, by the Grace of thy Lord, mad or possessed.",
                            "verse 68:3": "Nay, verily for thee is a Reward unfailing:",
                            "verse 68:4": "And thou (standest) on an exalted standard of character.",
                            "verse 68:5": "Soon wilt thou see, and they will see,",
                            "verse 68:6": "Which of you is afflicted with madness.",
                            "verse 68:7": "Verily it is thy Lord that knoweth best, which (among men) hath strayed from His Path: and He knoweth best those who receive (true) Guidance.",
                            "verse 68:8": "So hearken not to those who deny (the Truth).",
                            "verse 68:9": "Their desire is that thou shouldst be pliant: so would they be pliant.",
                            "verse 68:10": "Heed not the type of despicable men,- ready with oaths,",
                            "verse 68:11": "A slanderer, going about with calumnies,",
                            "verse 68:12": "(Habitually) hindering (all) good, transgressing beyond bounds, deep in sin,",
                            "verse 68:13": "Violent (and cruel),- with all that, base-born,-",
                            "verse 68:14": "Because he possesses wealth and (numerous) sons.",
                            "verse 68:15": "When to him are rehearsed Our Signs, \"Tales of the ancients\", he cries!",
                            "verse 68:16": "Soon shall We brand (the beast) on the snout!",
                            "verse 68:17": "Verily We have tried them as We tried the People of the Garden, when they resolved to gather the fruits of the (garden) in the morning.",
                            "verse 68:18": "But made no reservation, (\"If it be God’s Will\").",
                            "verse 68:19": "Then there came on the (garden) a visitation from thy Lord, (which swept away) all around, while they were asleep.",
                            "verse 68:20": "So the (garden) became, by the morning, like a dark and desolate spot, (whose fruit had been gathered).",
                            "verse 68:21": "As the morning broke, they called out, one to another,-",
                            "verse 68:22": "\"Go ye to your tilth (betimes) in the morning, if ye would gather the fruits.\"",
                            "verse 68:23": "So they departed, conversing in secret low tones, (saying)-",
                            "verse 68:24": "\"Let not a single indigent person break in upon you into the (garden) this day.\"",
                            "verse 68:25": "And they opened the morning, strong in an (unjust) resolve.",
                            "verse 68:26": "But when they saw the (garden), they said: \"We have surely lost our way:",
                            "verse 68:27": "\"Indeed we are shut out (of the fruits of our labour)!\"",
                            "verse 68:28": "Said one of them, more just (than the rest): \"Did I not say to you, ’Why not glorify (God)?’\"",
                            "verse 68:29": "They said: \"Glory to our Lord! Verily we have been doing wrong!\"",
                            "verse 68:30": "Then they turned, one against another, in reproach.",
                            "verse 68:31": "They said: \"Alas for us! We have indeed transgressed!",
                            "verse 68:32": "\"It may be that our Lord will give us in exchange a better (garden) than this: for we do turn to Him (in repentance)!\"",
                            "verse 68:33": "Such is the Punishment (in this life); but greater is the Punishment in the Hereafter,- if only they knew!",
                            "verse 68:34": "Verily, for the Righteous, are Gardens of Delight, in the Presence of their Lord.",
                            "verse 68:35": "Shall We then treat the People of Faith like the People of Sin?",
                            "verse 68:36": "What is the matter with you? How judge ye?",
                            "verse 68:37": "Or have ye a book through which ye learn-",
                            "verse 68:38": "That ye shall have, through it whatever ye choose?",
                            "verse 68:39": "Or have ye Covenants with Us to oath, reaching to the Day of Judgment, (providing) that ye shall have whatever ye shall demand?",
                            "verse 68:40": "Ask thou of them, which of them will stand surety for that!",
                            "verse 68:41": "Or have they some \"Partners\" (in Godhead)? Then let them produce their \"partners\", if they are truthful!",
                            "verse 68:42": "The Day that the shin shall be laid bare, and they shall be summoned to bow in adoration, but they shall not be able,-",
                            "verse 68:43": "Their eyes will be cast down,- ignominy will cover them; seeing that they had been summoned aforetime to bow in adoration, while they were whole, (and had refused).",
                            "verse 68:44": "Then leave Me alone with such as reject this Message: by degrees shall We punish them from directions they perceive not.",
                            "verse 68:45": "A (long) respite will I grant them: truly powerful is My Plan.",
                            "verse 68:46": "Or is it that thou dost ask them for a reward, so that they are burdened with a load of debt",
                            "verse 68:47": "Or that the Unseen is in their hands, so that they can write it down?",
                            "verse 68:48": "So wait with patience for the Command of thy Lord, and be not like the Companion of the Fish,- when he cried out in agony.",
                            "verse 68:49": "Had not Grace from his Lord reached him, he would indeed have been cast off on the naked shore, in disgrace.",
                            "verse 68:50": "Thus did his Lord choose him and make him of the Company of the Righteous.",
                            "verse 68:51": "And the Unbelievers would almost trip thee up with their eyes when they hear the Message; and they say: \"Surely he is possessed!\"",
                            "verse 68:52": "But it is nothing less than a Message to all the worlds."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 68:1": "Nun. By the Pen, and what they inscribe,",
                            "verse 68:2": "thou art not, by the blessing of thy Lord, a man possessed.",
                            "verse 68:3": "Surely thou shalt have a wage unfailing;",
                            "verse 68:4": "surely thou art upon a mighty morality.",
                            "verse 68:5": "So thou shalt see, and they will see,",
                            "verse 68:6": "which of you is the demented.",
                            "verse 68:7": "Surely thy Lord knows very well those who have gone astray from His way, and He knows very well those who are guided.",
                            "verse 68:8": "So obey thou not those who cry lies.",
                            "verse 68:9": "They wish that thou shouldst compromise, then they would compromise.",
                            "verse 68:10": "And obey thou not every mean swearer,",
                            "verse 68:11": "backbiter, going about with slander,",
                            "verse 68:12": "hinderer of good, guilty aggressor, coarse-grained,",
                            "verse 68:13": "moreover ignoble,",
                            "verse 68:14": "because he has wealth and sons.",
                            "verse 68:15": "When Our signs are recited to him, he says, ’Fairy-tales of the ancients!’",
                            "verse 68:16": "We shall brand him upon the muzzle!",
                            "verse 68:17": "Now We have tried them, even as We tried the owners of the garden when they swore they would pluck in the morning",
                            "verse 68:18": "and they added not the saving words.",
                            "verse 68:19": "Then a visitation from thy Lord visited it, while they were sleeping,",
                            "verse 68:20": "and in the morning it was as if it were a garden plucked.",
                            "verse 68:21": "In the morning they called to one another,",
                            "verse 68:22": "’Come forth betimes upon your tillage, if you would pluck!’",
                            "verse 68:23": "So they departed, whispering together,",
                            "verse 68:24": "’No needy man shall enter it today against your will.’",
                            "verse 68:25": "And they went forth early, determined upon their purpose.",
                            "verse 68:26": "But when they saw it, they said, ’Surely we are gone astray;",
                            "verse 68:27": "nay, rather we have been robbed!’",
                            "verse 68:28": "Said the most moderate of them, ’Did I not say to you, \"Why do you not give glory?\"’",
                            "verse 68:29": "They said, ’Glory be to God, our Lord; truly, we were evildoers.’",
                            "verse 68:30": "And they advanced one upon another, blaming each other.",
                            "verse 68:31": "They said, ’Woe, alas for us! Truly, we were insolent.",
                            "verse 68:32": "It may be that our Lord will give us in exchange a better than it; to our Lord we humbly turn.’",
                            "verse 68:33": "Such is the chastisement; and the chastisement of the world to come, is assuredly greater, did they but know.",
                            "verse 68:34": "Surely for the godfearing shall be Gardens of Bliss with their Lord.",
                            "verse 68:35": "What, shall we make those who have surrendered like to the sinners?",
                            "verse 68:36": "What ails you then, how you judge?",
                            "verse 68:37": "Or have you a Book wherein you study?",
                            "verse 68:38": "Surely therein you shall have whatever you choose!",
                            "verse 68:39": "Or have you oaths from Us, reaching to the Day of Resurrection? Surely you shall have whatever you judge!",
                            "verse 68:40": "Ask them, which of them will guarantee that!",
                            "verse 68:41": "Or do they have associates? Then let them bring their associates, if they speak truly.",
                            "verse 68:42": "Upon the day when the leg shall be bared, and they shall be summoned to bow themselves, but they cannot;",
                            "verse 68:43": "humbled shall be their eyes, and abasement shall overspread them, for they had been summoned to bow themselves while they were whole.",
                            "verse 68:44": "So leave Me with him who cries lies to this discourse! We will draw them on little by little whence they know not;",
                            "verse 68:45": "and I shall respite them -- assuredly My guile is sure.",
                            "verse 68:46": "Or askest thou them for a wage, and so they are weighed down with debt?",
                            "verse 68:47": "Or is the Unseen in their keeping, and so they are writing it down?",
                            "verse 68:48": "So be thou patient under the judgment of thy Lord, and be not as the Man of the Fish, when he called, choking inwardly.",
                            "verse 68:49": "Had there not overtaken him a blessing from his Lord he would have been cast upon the wilderness, being condemned.",
                            "verse 68:50": "But his Lord had chosen him, and He placed him among the righteous.",
                            "verse 68:51": "The unbelievers wellnigh strike thee down with their glances, when they hear the Reminder, and they say, ’Surely he is a man possessed!’",
                            "verse 68:52": "And it is nothing but a Reminder unto all beings."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 68:1": "Nūn. CONSIDER the pen, and all that they write !",
                            "verse 68:2": "Thou art not, by thy Sustainer’s grace, a madman!",
                            "verse 68:3": "And, verily, thine shall be a reward never-ending",
                            "verse 68:4": "for, behold, thou keepest indeed to a sublime way of life;",
                            "verse 68:5": "and [one day] thou shalt see, and they [who now deride thee] shall see,",
                            "verse 68:6": "which of you was bereft of reason.",
                            "verse 68:7": "Verily, thy Sustainer alone is fully aware as to who has strayed from His path, just as He alone is fully aware of those who have found the right way.",
                            "verse 68:8": "Hence, defer not to [the likes and dislikes of] those who give the lie to the truth:",
                            "verse 68:9": "they would like thee to be soft [with them], so that they might be soft [with thee].",
                            "verse 68:10": "Furthermore, defer not to the contemptible swearer of oaths,",
                            "verse 68:11": "[or to] the slanderer that goes about with defaming tales,",
                            "verse 68:12": "[or] the withholder of good, [or] the sinful aggressor,",
                            "verse 68:13": "[or] one who is cruel, by greed possessed, and, in addition to all this, utterly useless [to his fellow-men].",
                            "verse 68:14": "Is it because he is possessed of worldly goods and children",
                            "verse 68:15": "that, whenever Our messages are conveyed to him, such a one says, \"Fables of ancient times\"?",
                            "verse 68:16": "[For this] We shall brand him with indelible disgrace!",
                            "verse 68:17": "[As for such sinners,] behold, We [but] try them as We tried the owners of a certain garden who vowed that they would surely harvest its fruit on the morrow,",
                            "verse 68:18": "and made no allowance [for the will of God]:",
                            "verse 68:19": "whereupon a visitation from thy Sustainer came upon that [garden] while they were asleep,",
                            "verse 68:20": "so that by the morrow it became barren and bleak.",
                            "verse 68:21": "Now when they rose at early morn, they called unto one another,",
                            "verse 68:22": "\"Go early to your tilth if you want to harvest the fruit!\"",
                            "verse 68:23": "Thus they launched forth, whispering unto one another,",
                            "verse 68:24": "\"Indeed, no needy person shall enter it today [and come] upon you !\"",
                            "verse 68:25": "and early they went, strongly bent upon their purpose.",
                            "verse 68:26": "But as soon as they beheld [the garden and could not recognize] it, they exclaimed, \"Surely we have lost our way!\"",
                            "verse 68:27": "[and then,] \"Nay, but we have been rendered destitute!\"",
                            "verse 68:28": "Said the most right-minded among them: \"Did I not tell you, ‘Will you not extol God’s limitless glory?’\"",
                            "verse 68:29": "They answered: \"Limitless in His glory is our Sustainer! Verily, we were doing wrong!\"",
                            "verse 68:30": "and then they turned upon one another with mutual reproaches.",
                            "verse 68:31": "[In the end] they said: \"Oh, woe unto us! Verily, we did behave outrageously!",
                            "verse 68:32": "[But] it may be that our Sustainer will grant us something better instead: for, verily, unto our Sustainer do we turn with hope!\"",
                            "verse 68:33": "SUCH is the suffering [with which We try some people in this world]; but greater by far will be the suffering [which sinners shall have to bear] in the life to come – if they but knew it!",
                            "verse 68:34": "For, behold, it is the God-conscious [alone] whom gardens of bliss await with their Sustainer:",
                            "verse 68:35": "or should We, perchance, treat those who surrender themselves unto Us as [We would treat] those who remain lost in sin?",
                            "verse 68:36": "What is amiss with you? On what do you base your judgment [of right and wrong]?",
                            "verse 68:37": "Or have you, perchance, a [special] divine writ which you study,",
                            "verse 68:38": "and in which you find all that you may wish to find?",
                            "verse 68:39": "Or have you received a solemn promise, binding on Us till Resurrection Day, that yours will assuredly be whatever you judge [to be your rightful due]?",
                            "verse 68:40": "Ask them which of them is able to vouch for this!",
                            "verse 68:41": "Or have they, perchance, any sages to support their views? Well, then, if they are sincere in this their claim, let them produce those supporters of theirs",
                            "verse 68:42": "on the Day when man’s very being shall be bared to the bone, and when they [who now deny the truth] shall be called upon to prostrate themselves [before God], and shall be unable to do so:",
                            "verse 68:43": "downcast will be their eyes, with ignominy overwhelming them – seeing that they had been called upon [in vain] to prostrate themselves [before Him] while they were yet sound [and alive].",
                            "verse 68:44": "Hence, leave Me alone with such as give the lie to this tiding. We shall bring them low, step by step, without their perceiving how it has come about:",
                            "verse 68:45": "for, behold, though I may give them rein for a while, My subtle scheme is exceedingly firm!",
                            "verse 68:46": "Or is it that [they fear lest] thou ask them for a reward, [O Prophet,] so that they would be burdened with debt [if they listened to thee]?",
                            "verse 68:47": "Or [do they think] that the hidden reality [of all that exists] is within their grasp, so that [in time] they can write it down?",
                            "verse 68:48": "BEAR, THEN, with patience thy Sustainer’s will, and be not like him of the great fish, who cried out [in distress] after having given in to anger.",
                            "verse 68:49": "[And remember:] had not grace from his Sustainer reached him, he would indeed have been cast forth upon that barren shore in a state of disgrace:",
                            "verse 68:50": "but [as it was,] his Sustainer had elected him and placed him among the righteous.",
                            "verse 68:51": "Hence, [be patient,] even though they who are bent on denying the truth would all but kill thee with their eyes whenever they hear this reminder, and [though] they say, \"[As for Muhammad,] behold, most surely he is a madman!\"",
                            "verse 68:52": "[Be patient:] for this is nought else but reminder [from God] to all mankind."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 68:1": "Nūn , by the pen and what they write,",
                            "verse 68:2": "with the grace of your Lord, you are not insane.",
                            "verse 68:3": "And you will definitely have a reward that will never end.",
                            "verse 68:4": "And you are surely on an excellent standard of character.",
                            "verse 68:5": "So, you will see, and they will see",
                            "verse 68:6": "which of you is demented.",
                            "verse 68:7": "Surely your Lord knows best who has strayed from his way, and He is well aware of those who are on the right path.",
                            "verse 68:8": "So, do not obey those who reject (the true faith.)",
                            "verse 68:9": "They wish that you become flexible (in your faith), so that they should become flexible (in their hostile attitude.)",
                            "verse 68:10": "And do not obey any contemptible one who swears much,",
                            "verse 68:11": "a slanderer who goes about with calumnies,",
                            "verse 68:12": "one who prevents good, (and who is) transgressor, sinful,",
                            "verse 68:13": "harsh, (and) after all that, notorious,",
                            "verse 68:14": "(do not obey such a person merely) because he is a man of wealth and sons.",
                            "verse 68:15": "When Our verses are recited to him, he says, “(These are) the tales of the ancient.”",
                            "verse 68:16": "We will soon brand him on the snout.",
                            "verse 68:17": "We have tested them as We had tested the Owners of the Garden, when they had sworn an oath that they would pluck its fruits on the next morning,",
                            "verse 68:18": "and did not make any exception (by saying inshā’allāh ).",
                            "verse 68:19": "Then, there whirled around it a whirl (of calamity) from your Lord, while they were asleep.",
                            "verse 68:20": "Thus, on the next morning, it was like a harvested field.",
                            "verse 68:21": "So, they called out each other as the morning broke,",
                            "verse 68:22": "saying, “Set out early, if you are going to pluck (the fruits).”",
                            "verse 68:23": "So they set out while they were whispering to each other,",
                            "verse 68:24": "saying, “Let no poor man enter into it upon you today.”",
                            "verse 68:25": "And in early hours they rushed quickly, while they were (assuming themselves) powerful (to pluck the fruits and prevent the poor.)",
                            "verse 68:26": "But when they saw it (the place of the ruined garden), they said, “We have missed the way.”",
                            "verse 68:27": "(Then, once they realized that the garden is the same, but it has been destroyed, they said,) “No, but we are deprived (of the fruits).”",
                            "verse 68:28": "Said he who was the best among them, “Did I not say to you, ‘Why do you not pronounce tasbīH (Allah’s purity)?”",
                            "verse 68:29": "They said, “We pronounce the purity of our Lord. No doubt, we were wrongdoers.”",
                            "verse 68:30": "Then, (at the beginning,) they started reproaching one another;",
                            "verse 68:31": "(and at last,) they said, “Woe to us! In fact, we (all) were outrageous.",
                            "verse 68:32": "We hope that our Lord will give us in exchange something better than this. Truly we turn to Allah.”",
                            "verse 68:33": "In this way the punishment comes. And, of course, the punishment of the Hereafter is even greater, if they but realize!",
                            "verse 68:34": "Surely, for the God-fearing there are gardens of bliss.",
                            "verse 68:35": "Otherwise, shall We make the obedient like the sinners?",
                            "verse 68:36": "What has happened to you? How do you judge?",
                            "verse 68:37": "Do you have a book in which you read",
                            "verse 68:38": "that for you there is what you choose?",
                            "verse 68:39": "Or do you have oaths sworn by Us, remaining effective up to the Day of Judgment, that you will get what you decide?",
                            "verse 68:40": "Ask them which of them stands surety for that.",
                            "verse 68:41": "Or do they have associate-gods (who have guaranteed safety for them)? Then, let them bring their associate-gods, if they are true.",
                            "verse 68:42": "On the Day when the Shin will be exposed, and they will be called upon to prostrate themselves, they will not be able to.",
                            "verse 68:43": "With their eyes downcast, they will be enveloped by ignominy. They used to be called upon to prostrate when they were healthy (but they did not.)",
                            "verse 68:44": "So, leave Me alone with those who reject this discourse. We will draw them on little by little (towards Hell) from a way they do not know.",
                            "verse 68:45": "And I give them respite. Indeed, My plan is firm.",
                            "verse 68:46": "Is it that you ask them for a fee, due to which they are burdened with debt?",
                            "verse 68:47": "Or do they have the (knowledge of the) Unseen, and they write it down?",
                            "verse 68:48": "So, remain patient with your Lord’s judgment, and be not like the Man of the Fish, he cried out while he was in anguish.",
                            "verse 68:49": "Had not a favour from His Lord come to his help, he would have been cast in the wilderness in a reproachable state.",
                            "verse 68:50": "Then his Lord chose him, and made him one of the righteous.",
                            "verse 68:51": "And indeed the disbelievers seem to trip you up with their glances when they hear the Reminder, and say, “He is a madman indeed.”",
                            "verse 68:52": "And it is nothing else but a Reminder for all the worlds."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 68:1": "Nūn. By the Pen and what they inscribe.",
                            "verse 68:2": "You are not by the grace of your Lord, a madman.",
                            "verse 68:3": "And assuredly you will have an unfailing reward.",
                            "verse 68:4": "And assuredly you possess a magnificent nature.",
                            "verse 68:5": "Then you will see and they will see,",
                            "verse 68:6": "which of you is demented.",
                            "verse 68:7": "Assuredly your Lord knows best those who stray from His way, and He knows best those who are guided.",
                            "verse 68:8": "So do not obey the deniers.",
                            "verse 68:9": "They desire that you should be pliable, so that they may be pliable [towards you].",
                            "verse 68:10": "And do not obey any mean oath-monger,",
                            "verse 68:11": "backbiting, scandal-monger,",
                            "verse 68:12": "hinderer of good, sinful transgressor,",
                            "verse 68:13": "coarse-grained, moreover ignoble,",
                            "verse 68:14": "[only] because he has wealth and sons.",
                            "verse 68:15": "When Our signs are recited to him, he says: ‘Fables of the ancients!’",
                            "verse 68:16": "We shall brand him on the snout.",
                            "verse 68:17": "Indeed We have tried them, just as We tried the owners of the garden, when they vowed that they would pluck in the morning.",
                            "verse 68:18": "And they did not make any exception.",
                            "verse 68:19": "Then a visitation from your Lord visited it while they slept.",
                            "verse 68:20": "So by the morning it was like the darkness of night.",
                            "verse 68:21": "They then called out to one another in the morning,",
                            "verse 68:22": "[saying], ‘Go forth early to your tillage if you are going to pluck’.",
                            "verse 68:23": "So off they went, whispering to one another:",
                            "verse 68:24": "‘No needy person shall today come to you in it’.",
                            "verse 68:25": "And they went forth early, able to prohibit.",
                            "verse 68:26": "But when they saw it, they said, ‘Assuredly we have strayed!’",
                            "verse 68:27": "‘Nay, but we have been deprived!’",
                            "verse 68:28": "The most moderate among them said, ‘Did I not say to you, “Why do you not glorify?” ’",
                            "verse 68:29": "They said, ‘Glory be to God, our Lord. Verily we have been wrongdoers’.",
                            "verse 68:30": "They then turned to one another, blaming each other.",
                            "verse 68:31": "They said, ‘O woe to us! We have indeed been unjust.",
                            "verse 68:32": "It may be that our Lord will give us in its place one that is better than it. Truly we turn humbly to our Lord’.",
                            "verse 68:33": "Such will be the chastisement; and the chastisement of the Hereafter is assuredly greater, did they but know.",
                            "verse 68:34": "Verily for the God-fearing there will be the Gardens of Bliss near their Lord.",
                            "verse 68:35": "Are We then to treat those who submit [to Us] as [We treat] the sinners?",
                            "verse 68:36": "What is wrong with you? How do you judge?",
                            "verse 68:37": "Or do you have a Scripture, wherein you learn,",
                            "verse 68:38": "that you will indeed have in it whatever you choose?",
                            "verse 68:39": "Or do you have oaths, binding on Us until the Day of Resurrection that you will indeed have whatever you decide?",
                            "verse 68:40": "Ask them, which of them will aver that?",
                            "verse 68:41": "Or do they have partners? Then let them produce their partners if they are truthful.",
                            "verse 68:42": "The day when the shank is bared and they are summoned to prostrate themselves, but they will not be able [to do so].",
                            "verse 68:43": "With humbled gazes they will be overcast by abasement; for they had indeed been summoned to prostrate themselves while they were yet sound.",
                            "verse 68:44": "So leave Me [to deal] with those who deny this discourse. We will draw them on by degrees, whence they do not know.",
                            "verse 68:45": "And I will grant them respite; [for] assuredly My devising is firm.",
                            "verse 68:46": "Or are you asking them a fee, so that they are weighed down with debt?",
                            "verse 68:47": "Or do they possess [access to] the Unseen, so that they are writing down?",
                            "verse 68:48": "So await patiently the judgement of your Lord, and do not be like the one of the whale, who called out, choking with grief.",
                            "verse 68:49": "Had it not been for a grace from his Lord that reached him, he would have surely been cast onto a wilderness, while he was blameworthy.",
                            "verse 68:50": "But his Lord chose him and made him one of the righteous.",
                            "verse 68:51": "Indeed those who disbelieve would almost throw you down [to the ground] with their looks when they hear the Reminder, and they say: ‘He is truly a madman!’",
                            "verse 68:52": "Yet it is just a Reminder for all the worlds."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 68:1": "Nun. (Only Allah and the Messenger [blessings and peace be upon him] know the real meaning.) By the pen and by that (subject) which (the angels) write down!",
                            "verse 68:2": "(O Esteemed Beloved!) By the Grace of your Lord, you are not (at all) insane.",
                            "verse 68:3": "And assuredly, for you there is a reward that will never end.",
                            "verse 68:4": "And assuredly, you are placed high on the Most Glorious and Exalted (seat of) character (i.e., adorned with the Qur’anic morality and endowed with the character traits of Allah).",
                            "verse 68:5": "Soon you will see and they (too) will see,",
                            "verse 68:6": "As to which of you is mad.",
                            "verse 68:7": "Surely, your Lord knows him best who has strayed from the straight path and (also) knows best those who are rightly guided.",
                            "verse 68:8": "So do not agree with what the beliers say.",
                            "verse 68:9": "They wish that you should become (needlessly) flexible (in the matter of the Din [Religion]). Then they too would show flexibility.",
                            "verse 68:10": "And do not agree with any vile, most mean swearer of oaths,",
                            "verse 68:11": "(The one who is) a slanderer, fault-finder, mischief-monger, (and) who backbites the people to rouse strife,",
                            "verse 68:12": "(The one who) greatly hinders pious works and is a miser, rebellious transgressor (and) toughened sinner,",
                            "verse 68:13": "(The one who is) rude, unmannerly, crooked and moreover of doubtful birth.",
                            "verse 68:14": "So (do not pay any heed to him) because he is wealthy and has children.",
                            "verse 68:15": "When Our Verses are recited to him, he says: ‘These are the fictitious stories of the bygone people.’",
                            "verse 68:16": "Now We shall brand him on the snout.",
                            "verse 68:17": "Surely, We will try them (the inhabitants of Mecca in the same way) as We tried (in Yemen) the owners of the garden when they swore that they would surely pluck its fruit the next morning.",
                            "verse 68:18": "And they did not make any exception (saying ‘if Allah wills’ or for the share of the orphans).",
                            "verse 68:19": "So a whirl (of disaster) from your Lord went round (that garden during the night) whilst they were asleep,",
                            "verse 68:20": "So, that (waving fruit-laden garden) became a harvested field in the morning.",
                            "verse 68:21": "Then as the day dawned, they started calling out one another:",
                            "verse 68:22": "‘Leave early for your tilth if you want to pick the fruit.’",
                            "verse 68:23": "So they set off whispering to one another:",
                            "verse 68:24": "‘Do not let any pauper come near you in the garden today.’",
                            "verse 68:25": "And early in the morning they left, (feeling) quite competent to execute their plan (of getting the yield and depriving the poor of their share).",
                            "verse 68:26": "Then when they saw that (ruined garden), they said: ‘We must have lost our way; (this is not our garden).’",
                            "verse 68:27": "(But when they saw it cautiously, they cried: ‘Oh no!) We have been deprived indeed.’",
                            "verse 68:28": "One of them, wise and inclined to the balanced judgment, said: ‘Did I not say to you: Why do you not glorify and remember Allah?’",
                            "verse 68:29": "(Then) they said: ‘Our Lord is Holy. Surely, it is we who were the wrongdoers.’",
                            "verse 68:30": "So, blaming and maligning, they turned to one another.",
                            "verse 68:31": "They said: ‘Woe to us! No doubt it is we who were disobedient and rebellious.",
                            "verse 68:32": "We hope that our Lord may give us something better than this in exchange. Verily, we turn to our Lord.’",
                            "verse 68:33": "Such is the punishment. And truly, the torment of the Hereafter is far greater (than this). Would that they only knew!",
                            "verse 68:34": "Surely, for the Godfearing there are Gardens of Bliss with their Lord.",
                            "verse 68:35": "Shall We (deprive) the obedient like the disobedient?",
                            "verse 68:36": "What is the matter with you? How do you make a judgment?",
                            "verse 68:37": "Do you have any Book with you in which you read (this),",
                            "verse 68:38": "That it contains all that you like?",
                            "verse 68:39": "Or have you any (such) firm covenants from Us as will subsist till the Day of Resurrection (by means of which We are bound) that you will be provided with whatever you shall decide (for yourselves)?",
                            "verse 68:40": "Ask them which of them will vouch for such (a baseless assertion)!",
                            "verse 68:41": "Or do they have any partners (as well)? Then they should bring their partners if they are truthful.",
                            "verse 68:42": "The Day when the ‘shin’ (i.e., the terrifying fierceness of the Hour of Rising) will be laid bare, and (the disobedient) people will be called to prostrate themselves, but they will not be able to do so (i.e., to prostrate themselves).",
                            "verse 68:43": "Their eyes will be cast down (with terror and shame) and disgrace will be spreading over them, whereas they were called to prostrate themselves (in the world also) when they were healthy (but they, even then, refused to fall prostrate).",
                            "verse 68:44": "So, (O Esteemed Beloved,) leave Me (to exact revenge) from the one who rejects this Revelation. Now We shall take them (towards disaster) so gradually that they will not perceive it.",
                            "verse 68:45": "And I am giving them respite. Surely, My strategy is unbeatable.",
                            "verse 68:46": "Do you ask them for any reward (for preaching the faith in Messengership) that they are weighed down with (the burden of) paying the recompense?",
                            "verse 68:47": "Do they have the knowledge of the unseen that they write down (their judgments on the basis of that)?",
                            "verse 68:48": "So be steadfast in waiting for the command of your Lord, and do not (take it to your heart) like (Yunus [Jonah], the Messenger with) fish episode, when he cried out (to Allah) in a state pent up with rage and grief (against his community).",
                            "verse 68:49": "Had the mercy and blessing of his Lord not helped him, he would certainly have been thrown in the barren field, blamed. (But Allah saved him from that.)",
                            "verse 68:50": "Then his Lord exalted him and (placed him) amongst the perfectly pious (blessing him with His exceptional nearness).",
                            "verse 68:51": "And indeed, when the disbelievers listen to the Qur’an, it seems as if they wish to damage you with their (jealously evil) looks and say: ‘He is insane.’",
                            "verse 68:52": "And it (the Qur’an) is direction and guidance for all the worlds."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Kynän ja sen nimessä, mitä kirjoitetaan!",
                            "verse 68:2": "Sinä et ole, Herrasi armosta, mikään hourailija,",
                            "verse 68:3": "vaan totisesti odottaa Sinua ehtymätön palkka,",
                            "verse 68:4": "ja totisesti on siveellinen mielenlaatusi jalo.",
                            "verse 68:5": "Pian olet näkevä, ja myöskin he saavat nähdä,",
                            "verse 68:6": "ketä teistä riivaa hulluus.",
                            "verse 68:7": "Totisesti tietää Herrasi parhaiten, kuka poikkeaa Hänen tieltään, ja Hän tietää parhaiten, kuka noudattaa johdatusta.",
                            "verse 68:8": "Älä suostu siis niihin, jotka julistavat totuuden valheeksi!",
                            "verse 68:9": "He toivovat sinun osoittavan velttoutta, jotta myös he voisivat olla velttoja.",
                            "verse 68:10": "Älä tottele ainoatakaan halpamaista vannojaa,",
                            "verse 68:11": "panettelijaa, joka kulkee ympäri pahaa puhuen,",
                            "verse 68:12": "joka kieltää hyvän, rikkoo lakia ja tekee syntiä,",
                            "verse 68:13": "joka lisäksi on alhaissyntyinen, röyhkeä ja ahne,",
                            "verse 68:14": "siksi, että hänellä on rikkautta ja poikia!",
                            "verse 68:15": "Kun tunnusmerkkimme luetellaan hänelle, hän sanoo: »Muinaisjuttuja.»",
                            "verse 68:16": "Me painamme pian poltinmerkkimme hänen nenäkkäisiin kasvoihinsa.",
                            "verse 68:17": "Totisesti koettelemme heitä, niinkuin koettelimme puutarhan omistajia, kun he vannoivat korjaavansa sadon seuraavana päivänä,",
                            "verse 68:18": "mutta eivät varanneet mitään osuutta (köyhille).",
                            "verse 68:19": "Silloin Herrasi lähettämä koettelemus kohtasi puutarhaa heidän nukkuessaan,",
                            "verse 68:20": "niin että se oli musta kuin palon jäljiltä.",
                            "verse 68:21": "Mutta aamulla kutsuivat he toisiaan",
                            "verse 68:22": "sanoen: »Kunkin on käytävä varhain pellolleen, jos mieli korjata sato!»",
                            "verse 68:23": "Ja he lähtivät puhellen hiljaa keskenään:",
                            "verse 68:24": "»Älkää tänään salliko köyhien tulla jälkikeräykseen.»",
                            "verse 68:25": "Ja he lähtivät matkaan aamulla tämä itaruus mielessään,",
                            "verse 68:26": "mutta kun he näkivät mitä oli tapahtunut, he sanoivat: »Varmaankin olemme joutuneet tieltä harhaan.",
                            "verse 68:27": "Ei, meille tuli kato!»",
                            "verse 68:28": "Viisain heistä sanoi: »Enkö sanonut teille: 'Ylistäkää Jumalaa.'»",
                            "verse 68:29": "He vastasivat: »Kunnia Herralle! Totisesti olimme jumalattomia.»",
                            "verse 68:30": "Ja sitten jotkut heistä kääntyivät päivitellen toistensa puoleen",
                            "verse 68:31": "ja sanoivat: »Voi meitä! Olemme totisesti rikkoneet;",
                            "verse 68:32": "ehkä Herra kuitenkin antaa meille jotakin parempaa tämän asemesta; totisesti tahdomme sitä Herraltamme anoa.»",
                            "verse 68:33": "Sellainen oli rangaistus, mutta tulevan elämän rangaistus on totisesti oleva vielä suurempi. Jospa he sen käsittäisivät!",
                            "verse 68:34": "Niille, jotka karttavat pahaa, on totisesti valmistettu autuuden puutarhat Herransa luona.",
                            "verse 68:35": "Onko Meidän kohdeltava Jumalan alamaisia kuten syyllisiä?",
                            "verse 68:36": "Miten voitte tuomita siten?",
                            "verse 68:37": "Vai onko teillä kirja, josta voitte lukea,",
                            "verse 68:38": "että teillä todella on siinä se, mitä pidätte parhaana?",
                            "verse 68:39": "Vai onko teillä Meidän antamamme valalliset vakuutukset, jotka ovat voimassa myös ylösnousemuksen päivänä, että varmasti saatte mitä kuvittelette?",
                            "verse 68:40": "Kysy heiltä, Muhammed, kuka heistä uskaltaa mennä tästä takaukseen.",
                            "verse 68:41": "Vai onko heillä liittolaisia? Anna heidän näyttää liittolaisensa, jos he tarkoittavat totta.",
                            "verse 68:42": "Päivänä, jolloin he ovat suuressa ahdistuksessa, jolloin heidät kutsutaan rukoukseen lankeamaan, mutta eivät kykene sitä tekemään,",
                            "verse 68:43": "he seisovat katse maahan luotuina ja kasvot häpeää uhkuen,koska heidät kutsuttiin polvistumaan heidän ollessaan parhaissa voimissaan.",
                            "verse 68:44": "Siispä jätä Minun pideltävikseni ne, jotka väittävät valheeksi näitä sanomia. Me johdamme heitä askel askeleelta heidän huomaamattaan,",
                            "verse 68:45": "ja Minä annan heille aikaa; onhan totisesti suunnitelmani järkähtämätön.",
                            "verse 68:46": "Vai vaaditko, Muhammed, palkkaa heiltä, niin että he velasta rasittuvat?",
                            "verse 68:47": "Vai onko heillä tieto salatusta, niin että he voivat kirjoittaa sen muistiin?",
                            "verse 68:48": "Odota sentähden järkkymättömänä Herrasi tuomiota äläkä ole niinkuin kalan nielemä mies, joka huusi murheen vallassa.",
                            "verse 68:49": "Ellei hänen Herransa armo olisi tullut hänen osakseen, hän olisi hylättynä varmasti sinkoutunut jollekin autiolle rannalle,",
                            "verse 68:50": "mutta Hänen Herransa valitsi hänet ja asetti hänet vanhurskaitten joukkoon.",
                            "verse 68:51": "Ne, jotka ovat vaipuneet epäuskoon, olisivat katseillaan sinut lävistäneet, kuullessaan kehoituksesi, he sanoivat: »Totisesti, hän on järjiltään.»",
                            "verse 68:52": "Mutta Koraani on vain muistutus koko maailmalle."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 68:1": "Noun. Par le calame et par ce qu'ils transcrivent !",
                            "verse 68:2": "Par la grâce de ton Seigneur, tu n'es pas un possédé !",
                            "verse 68:3": "Pour toi, il y a une récompense sans contrepartie,",
                            "verse 68:4": "et toi tu es d'un caractère sublime.",
                            "verse 68:5": "Bientôt tu verras, et eux aussi verront",
                            "verse 68:6": "lequel d'entre vous est mis à l'épreuve.",
                            "verse 68:7": "Certes, ton Seigneur connaît le mieux ceux qui se sont égarés hors de Son chemin et Il connaît le mieux ceux qui sont bien dirigés.",
                            "verse 68:8": "N'obéis donc pas à ceux qui crient au mensonge.",
                            "verse 68:9": "Ils aimeraient que tu sois complaisant, et ils se montreraient complaisants.",
                            "verse 68:10": "Et n'obéis pas au vil prêteur de serments,",
                            "verse 68:11": "au diffamateur qui répand la calomnie,",
                            "verse 68:12": "à celui qui interdit le bien, au transgresseur, pécheur invétéré,",
                            "verse 68:13": "arrogant et bâtard par surcroît.",
                            "verse 68:14": "Ne lui obéis pas même s'il abonde en richesses et en fils.",
                            "verse 68:15": "Lorsque Nos versets lui sont lus, il dit : \" Ce sont fables des Anciens ! \"",
                            "verse 68:16": "Nous le marquerons sur le museau !",
                            "verse 68:17": "Certes, Nous les éprouverons comme Nous avons éprouvé les propriétaires du jardin lorsqu'ils avaient juré de faire leur cueillette au matin ;",
                            "verse 68:18": "mais ils avaient juré sans faire aucune réserve.",
                            "verse 68:19": "Le jardin reçut une visite envoyée par ton Seigneur pendant qu'ils dormaient",
                            "verse 68:20": "et ce fut, au matin, comme si tout avait été cueilli.",
                            "verse 68:21": "Au petit matin, ils s'interpellèrent :",
                            "verse 68:22": "\" Partez de bonne heure à votre champ, si vous voulez faire la cueillette \".",
                            "verse 68:23": "Ils se mirent en route en se parlant à voix basse :",
                            "verse 68:24": "\" Que nul pauvre ne pénètre ici à votre corps défendant ! \"",
                            "verse 68:25": "Ils partirent donc de bonne heure, ainsi résolus.",
                            "verse 68:26": "Lorsqu'ils virent ce qui était arrivé, ils dirent : \" Certes, nous sommes égarés !",
                            "verse 68:27": "Plus encore, nos sommes ruinés ! \"",
                            "verse 68:28": "Le plus modéré d'entre eux dit : \" Ne vous avais-je pas avertis ? Si seulement vous aviez rendu gloire à Dieu ! \"",
                            "verse 68:29": "Ils dirent : \" Gloire à notre Seigneur ! Oui, nous avons été iniques \" ;",
                            "verse 68:30": "et ils se tournaient les uns vers les autres en se faisant mutuellement des reproches.",
                            "verse 68:31": "\" Malheur à nous !, disaient-ils, nous avons été rebelles !",
                            "verse 68:32": "Mais il se peut que notre Seigneur nous donne en échange quelque chose de meilleur que ceci. C'est une supplique que nous adressons à notre Seigneur ! \"",
                            "verse 68:33": "Tel fut le châtiment ! Mais le châtiment de la vie future est plus sévère, s'ils savaient !",
                            "verse 68:34": "Pour ceux qui Le craignent, il y a, auprès de leur Seigneur, les Jardins du délice.",
                            "verse 68:35": "Traiterons-Nous ceux qui sont soumis à Dieu à l'instar des coupables ?",
                            "verse 68:36": "Qu'avez-vous donc à juger ainsi ?",
                            "verse 68:37": "Possédez-vous un Livre qui vous enseigne",
                            "verse 68:38": "qu'un jour vous y trouverez ce que vous convoitez ?",
                            "verse 68:39": "Ou bien avez-vous reçu de Notre part un serment valable jusqu'au Jour de la Résurrection, selon lequel vous obtiendrez tout ce que vous ordonnez ?",
                            "verse 68:40": "Demande-leur lequel d'entre eux s'en porte garant.",
                            "verse 68:41": "Ont-ils des associés ? Qu'ils viennent donc avec leurs associés s'ils sont véridiques.",
                            "verse 68:42": "Le Jour où, les jambes découvertes, on les appellera à se prosterner, ils en seront incapables.",
                            "verse 68:43": "Les yeux baissés, ils seront couverts de honte, car on les avait appelés à se prosterner alors qu'ils étaient encore indemnes.",
                            "verse 68:44": "Laisse-Moi donc avec ceux qui traitent de mensonge ce discours ; Nous les mènerons par étapes par où ils ne savent pas.",
                            "verse 68:45": "Je leur accorde un délai, car Mon stratagème est sûr.",
                            "verse 68:46": "Leur demanderas-tu un salaire alors qu'ils sont chargés de dettes ?",
                            "verse 68:47": "Ou sont-ils en possession du Mystère et en train de le transcrire ?",
                            "verse 68:48": "Soumets-toi donc patiemment au décret de ton Seigneur, et ne sois pas comme l'homme au poisson lorsqu'il appelait à perdre haleine :",
                            "verse 68:49": "si un bienfait de son Seigneur ne s'était pas saisi de lui, il aurait été rejeté en réprouvé sur la terre sauvage.",
                            "verse 68:50": "Mais son Seigneur l'a élu et Il l'a placé parmi les justes.",
                            "verse 68:51": "Peu s'en faut que ceux qui mécroient ne te pourfendent du regard quand ils entendent le Rappel et qu'ils disent : \" Il est sûrement possédé ! \"",
                            "verse 68:52": "Pourtant, ceci n'est qu'un Rappel adressé à l'univers !"
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 68:1": "Noun . Par la plume et ce qu’ils écrivent !",
                            "verse 68:2": "Tu (Muhammad) n’est pas, par la grâce de ton Seigneur, un possédé.",
                            "verse 68:3": "Et il y aura pour toi certes, une récompense jamais interrompue.",
                            "verse 68:4": "Et tu es certes, d’une moralité imminente.",
                            "verse 68:5": "Tu verras et ils verront.",
                            "verse 68:6": "qui d’entre vous a perdu la raison.",
                            "verse 68:7": "C’est ton Seigneur qui connaît mieux ceux qui s’égarent de Son chemin, et il connaît mieux ceux qui suivent la bonne voie.",
                            "verse 68:8": "N’obéis pas à ceux qui crient en mensonge,",
                            "verse 68:9": "Ils aimeraient bien que tu transiges avec eux afin qu’ils transigent avec toi.",
                            "verse 68:10": "Et n’obéis à aucun grand jureur, méprisable,",
                            "verse 68:11": "grand diffamateur, grand colporteur de médisance,",
                            "verse 68:12": "grand empêcheur du bien, transgresseur, grand pécheur,",
                            "verse 68:13": "au coeur dur, et en plus de cela bâtard .",
                            "verse 68:14": "Même s’il est doté de richesses et (de nombreux) enfants.",
                            "verse 68:15": "Quand Nos versets lui sont récités, il dit : «Des contes d’anciens».",
                            "verse 68:16": "Nous le marquerons sur le museau [nez] .",
                            "verse 68:17": "Nous les avons éprouvés comme Nous avons éprouvés les propriétaires du verger qui avaient juré d’en faire la récolte au matin,",
                            "verse 68:18": "sans dire : «Si Dieu le veut». .",
                            "verse 68:19": "Une calamité de la part de ton Seigneur tomba dessus pendant qu’ils dormaient,",
                            "verse 68:20": "et le matin, ce fut comme si tout avait été rasé.",
                            "verse 68:21": "Le [lendemain] matin, ils s’appelèrent les uns les autres :",
                            "verse 68:22": "«Partez tôt à votre champ si vous voulez le récolter».",
                            "verse 68:23": "Ils allèrent donc, tout en parlent entre eux à vois basse :",
                            "verse 68:24": "«Ne laissez aucun pauvre y entrer aujourd’hui».",
                            "verse 68:25": "Ils partirent de bonne heure décidés à user d’avarice [envers les pauvres], convaincus que cela était en leur pouvoir.",
                            "verse 68:26": "Puis, quand ils le virent [le jardin], ils dirent : «vraiment, nous avons perdus notre chemin,",
                            "verse 68:27": "Ou plutôt nous somme frustrés».",
                            "verse 68:28": "Le plus juste d’entre eux dit : «Ne vous avais-je pas dit : Si seulement vous avez rendu gloire à Dieu ! »",
                            "verse 68:29": "Ils dirent : «Gloire à notre Seigneur ! Oui, nous avons été injustes».",
                            "verse 68:30": "Puis ils s’adressèrent les uns aux autres, se faisant des reproches.",
                            "verse 68:31": "Ils dirent : «Malheur à nous ! Nous avons été des rebelles.",
                            "verse 68:32": "Nous souhaitons que notre Seigneur nous le remplace par quelque chose de meilleur. Nous désirons nous rapprocher de notre Seigneur».",
                            "verse 68:33": "Tel fut le châtiment; et le châtiment de l’au-delà est plus grand encore, si seulement ils savaient !",
                            "verse 68:34": "Les pieux auront auprès de leur Seigneur les jardins de délice.",
                            "verse 68:35": "Traiterons-Nous les soumis [à Dieu] à la manière des criminels ?",
                            "verse 68:36": "Qu’avez-vous ? Comment jugez-vous ?",
                            "verse 68:37": "Ou bien avez-vous un Livre dans lequel vous apprenez",
                            "verse 68:38": "qu’en vérité vous obtiendrez tout ce que vous désirez ?",
                            "verse 68:39": "Ou bien est-ce que vous avez obtenu de Nous des serments valables jusqu’au Jour de la Résurrection, Nous engageant à vous donner ce que vous décidez ?",
                            "verse 68:40": "Demande-leur qui d’entre eux en est garant ?",
                            "verse 68:41": "Ou encore, est-ce qu’ils ont des associés ? Eh bien, qu’ils fassent venir leur associés s’ils sont véridiques !",
                            "verse 68:42": "Le jour où ils affronteront les horreurs [du Jugement] et où ils seront appelés à la Prosternation mais ils ne le pourront pas.",
                            "verse 68:43": "Leurs regards seront abaissés, et l’avilissement les couvrira. Or, ils étaient appelés à la Prosternation au temps où ils étaient sains et saufs ! ...",
                            "verse 68:44": "Laisse-Moi donc avec quiconque traite de mensonge ce discours; Nous allons les mener graduellement par où ils ne savent pas !",
                            "verse 68:45": "Et Je leur accorde un délai, car Mon stratagème est sûr !",
                            "verse 68:46": "Ou bien est-ce que tu leur demandes un salaire, les accablant ainsi d’une lourde dette ?",
                            "verse 68:47": "Ou savent-ils l’Inconnaissable et c’est de là qu’ils écrivent [leurs mensonges] ?",
                            "verse 68:48": "Endure avec patience la sentence de ton Seigneur, et ne soit pas comme l’homme au Poisson (Jonas) qui appela (Dieu) dans sa grande angoisse.",
                            "verse 68:49": "Si un bienfait de son Seigneur ne l’avait pas atteint, il aurait été rejeté honni sur une terre déserte,",
                            "verse 68:50": "Puis son Seigneur l’élut et le désigna au nombre des gens de bien.",
                            "verse 68:51": "Peu s’en faut que ceux qui mécroient ne te transpercent par leurs regards, quand ils entendent le Coran, ils disent : «Il est certes fou ! ».",
                            "verse 68:52": "Et ce n’est qu’un Rappel, adressé aux mondes ! ."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Nün. Bei der Feder und bei dem, was sie schreiben,",
                            "verse 68:2": "Du bist, durch die Gnade deines Herrn, kein Wahnsinniger.",
                            "verse 68:3": "Und für dich ist ganz sicherlich nicht endender Lohn bestimmt.",
                            "verse 68:4": "Und du besitzest ganz sicherlich hohe moralische Eigenschaften.",
                            "verse 68:5": "Also wirst du sehen und sie werden sehen,",
                            "verse 68:6": "Wer von euch der Besessene ist.",
                            "verse 68:7": "Fürwahr, dein Herr weiß am besten, wer von Seinem Wege abirrt, und Er kennt auch am besten die Rechtgeleiteten.",
                            "verse 68:8": "Drum richte dich nicht nach den Wünschen der Leugner.",
                            "verse 68:9": "Sie möchten, daß du entgegenkommend wärest, dann würden (auch) sie entgegenkommend sein.",
                            "verse 68:10": "Und füge dich nicht irgendeinem verächtlichen Schwüremacher,",
                            "verse 68:11": "Verleumder, einem, der herumgeht, üble Nachrede zu verbreiten,",
                            "verse 68:12": "Hinderer des Guten, Übertreter, Sünder,",
                            "verse 68:13": "Schlechten Benehmens, dazu treulos,",
                            "verse 68:14": "Nur weil er Reichtümer und Kinder besitzt.",
                            "verse 68:15": "Wenn ihm Unsere Zeichen vorgetragen werden, so spricht er: «Fabeln der Alten!»",
                            "verse 68:16": "Wir wollen ihn auf der Nase brandmarken.",
                            "verse 68:17": "Wir prüfen sie, wie Wir die Eigentümer eines Gartens prüften, als sie schworen, sie würden sicherlich seine (ganze) Frucht am Morgen pflücken.",
                            "verse 68:18": "Und sie machten keinen Vorbehalt.",
                            "verse 68:19": "Dann kam eine Heimsuchung über ihn von deinem Herrn, während sie schliefen.",
                            "verse 68:20": "Und der Morgen fand ihn wie einen verwüsteten (Garten).",
                            "verse 68:21": "Dann riefen sie am Morgen einander zu:",
                            "verse 68:22": "«Geht in der Frühe hinaus zu eurem Acker, wenn ihr ernten möchtet.»",
                            "verse 68:23": "Und sie machten sich auf und redeten dabei flüsternd miteinander:",
                            "verse 68:24": "«Gegen euch darf ihn heute kein Armer betreten.»",
                            "verse 68:25": "Und sie gingen in der Frühe mit dem festen Vorsatz, geizig zu sein.",
                            "verse 68:26": "Doch als sie ihn sahen, sprachen sie: «Fürwahr, wir sind verloren!",
                            "verse 68:27": "Nein, wir sind beraubt.»",
                            "verse 68:28": "Der Beste unter ihnen sprach: «Habe ich euch nicht gesagt: \"Warum preist ihr nicht (Gott)?\"»",
                            "verse 68:29": "(Nun) sprachen sie: «Preis sei unserem Herrn! Gewiß, wir sind Frevler gewesen.»",
                            "verse 68:30": "Dann wandten sich einige von ihnen an die anderen, indem sie sich wechselseitig Vorwürfe machten.",
                            "verse 68:31": "Sie sprachen: «Weh uns! wir waren fürwahr widerspenstig.",
                            "verse 68:32": "Vielleicht wird unser Herr uns einen besseren (Garten) zum Tausch für diesen geben; wir flehen demütig zu unserem Herrn.»",
                            "verse 68:33": "So ist die Strafe. Und fürwahr, die Strafe des Jenseits ist schwerer. Wenn sie es nur wüßten!",
                            "verse 68:34": "Für die Gerechten sind Gärten der Wonne bei ihrem Herrn.",
                            "verse 68:35": "Sollten Wir etwa die Muslims wie die Schuldigen behandeln?",
                            "verse 68:36": "Was ist euch? Wie urteilt ihr!",
                            "verse 68:37": "Habt ihr ein Buch, worin ihr leset,",
                            "verse 68:38": "Daß ihr danach alles erhalten sollt, was ihr wünscht?",
                            "verse 68:39": "Oder habt ihr Gelöbnisse von Uns, bindend bis zum Tage der Auferstehung, daß alles für euch ist, was ihr befehlt?",
                            "verse 68:40": "Frage sie, wer von ihnen dafür bürgen mag.",
                            "verse 68:41": "Oder haben sie Götter? So sollen sie ihre Götter herbeibringen, wenn sie die Wahrheit reden.",
                            "verse 68:42": "Am Tage, da eine Trübsal kommen wird und sie aufgefordert werden, sich anbetend niederzuwerfen, werden sie es nicht können;",
                            "verse 68:43": "Ihre Blicke werden niedergeschlagen sein, (und) Schande wird sie bedecken; denn sie waren aufgefordert worden, sich anbetend niederzuwerfen, als sie gesund und wohlbehalten waren (doch sie gehorchten nicht).",
                            "verse 68:44": "Laß Mich allein mit denen, die dies (Unser) Wort verwerfen. Wir werden sie Schritt um Schritt einholen, von wo wissen sie nicht.",
                            "verse 68:45": "Und Ich gebe ihnen Frist; denn Mein Plan ist fest.",
                            "verse 68:46": "Verlangst du einen Lohn von ihnen, so daß sie sich von der Schuldenlast bedrückt fühlen?",
                            "verse 68:47": "Ist das Verborgene bei ihnen, so daß sie (es) niederschreiben können?",
                            "verse 68:48": "So warte geduldig auf den Befehl deines Herrn, und sei nicht gleich dem Genossen des Fisches (Jonas), da er (seinen Herrn) anrief, indes er von Kummer erfüllt war.",
                            "verse 68:49": "Hätte ihn nicht Gnade von seinem Herrn erreicht, er wäre sicherlich an einen öden Strand geworfen worden, und er wäre geschmäht worden.",
                            "verse 68:50": "Doch sein Herr erwählte ihn und machte ihn zu einem der Rechtschaffenen.",
                            "verse 68:51": "Und jene, die ungläubig sind, möchten dich gerne zu Fall bringen mit ihren (zornigen) Blicken, wenn sie die Ermahnung hören; und sie sagen: «Er ist gewiß verrückt!»",
                            "verse 68:52": "Nein, es ist nichts anderes als eine Ehre für alle Welten."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "uwu d+ye dh vkSj ml pht+ dh tks fy[krh gSa ¼mldh½ d+le gS",
                            "verse 68:2": "fd rqe vius ijojfnxkj ds Q+t+y ¼o dje½ ls nhokus ugha gks",
                            "verse 68:3": "vkSj rqEgkjs okLrs ;d+huu og vtz gS tks dHkh [k+Re gh u gksxk",
                            "verse 68:4": "vkSj cs’kd rqEgkjs ,[+kykd+ cM+s vkyk ntsZ ds gSa",
                            "verse 68:5": "rks vud+jhc gh rqe Hkh ns[kksxs vkSj ;s dq¶+Q+kj Hkh ns[k ysaxs",
                            "verse 68:6": "fd rqeesa nhokuk dkSu gS",
                            "verse 68:7": "cs’kd rqEgkjk ijojfnxkj buls [+kwc okfd+Q+ gS tks mldh jkg ls HkVds gq, gSa vkSj ogh fgnk;r ;k¶+rk yksxksa dks Hkh [+kwc tkurk gS",
                            "verse 68:8": "rks rqe >qBykus okyksa dk dguk u ekuuk",
                            "verse 68:9": "og yksx ;s pkgrs gSa fd vxj rqe ujeh ,[+rs;kj djks rks og Hkh uje gks tk,¡",
                            "verse 68:10": "vkSj rqe ¼dgha½ ,sls ds dgus esa u vkuk tks cgqr d+lesa [kkrk t+yhy vkSd+kr ,sctw",
                            "verse 68:11": "tks vkyk ntsZ dk pqx+y[k+ksj eky dk cgqr c[+khy",
                            "verse 68:12": "gn ls c<+us okyk xqusgxkj rqUn fetkt+",
                            "verse 68:13": "vkSj mlds vykok cnt+kr ¼gjet+knk½ Hkh gS",
                            "verse 68:14": "pw¡fd eky cgqr ls csVs j[krk gS",
                            "verse 68:15": "tc mlds lkeus gekjh vk;rsa i<+h tkrh gSa rks cksy mBrk gS fd ;s rks vxyksa ds vQ+lkus gSa",
                            "verse 68:16": "ge vud+jhc bldh ukd ij nkx+ yxk,¡xs",
                            "verse 68:17": "ftl rjg geus ,d ckx+ okyksa dk bErsgku fy;k Fkk mlh rjg mudk bErsgku fy;k tc mUgksus d+lesa [kk [kkdj dgk fd lqcg gksrs ge mldk esok t+:j rksM+ Mkysaxs",
                            "verse 68:18": "vkSj bU’kkvYykg u dgk",
                            "verse 68:19": "rks ;s yksx iM+s lks gh jgs Fks fd rqEgkjs ijojfnxkj dh rjQ ls ¼jkrksa jkr½ ,d cyk pDdj yxk x;h",
                            "verse 68:20": "rks og ¼lkjk ckx+ tydj½ ,slk gks x;k tSls cgqr dkyh jkr",
                            "verse 68:21": "fQj ;s yksx uwj ds rM+ds yxs ckge xqy epkus",
                            "verse 68:22": "fd vxj rqedks Qy rksM+uk gS rks vius ckx+ esa losjs ls pyks",
                            "verse 68:23": "x+jt+ og yksx pys vkSj vkil esa pqids pqids dgrs tkrs Fks",
                            "verse 68:24": "fd vkt ;gk¡ rqEgkjs ikl dksbZ Q+d+hj u vkus ik,",
                            "verse 68:25": "rks og yksx jksd Fkke ds ,greke ds lkFk Qy rksM+us dh Bkus gq, losjs gh tk igq¡ps",
                            "verse 68:26": "fQj tc mls ¼tyk gqvk fl;kg½ ns[kk rks dgus yxs ge yksx HkVd x,",
                            "verse 68:27": "¼;s gekjk ckx+ ugha fQj ;s lkspdj cksys½ ckr ;s gS fd ge yksx cM+s cnulhc gSa",
                            "verse 68:28": "tks muesa ls equflQ+ fetkt+ Fkk dgus yxk D;ksa eSaus rqels ugha dgk Fkk fd rqe yksx ¼[+kqnk dh½ rlchg D;ksa ugha djrs",
                            "verse 68:29": "og cksys gekjk ijojfnxkj ikd gS cs’kd geha gh dqlwjokj gSa",
                            "verse 68:30": "fQj yxs ,d nwljs ds eq¡g nj eq¡g eyker djus",
                            "verse 68:31": "¼vkf[+kj½ lcus bd+jkj fd;k fd gk, vQlksl cs’kd ge gh [+kqn ljd’k Fks",
                            "verse 68:32": "mEehn gS fd gekjk ijojfnxkj gesa blls csgrj ckx+ buk;r Q+jek, ge vius ijojfnxkj dh rjQ :tw djrs gSa",
                            "verse 68:33": "¼ns[kks½ ;w¡ vt+kc gksrk gS vkSj vk[+skjr dk vt+kc rks blls dgha c<+ dj gS vxj ;s yksx le>rs gksa",
                            "verse 68:34": "cs’kd ijgst+xkj yksx vius ijojfnxkj ds ;gk¡ ,s’kks vkjke ds ckx+ksa esa gksaxs",
                            "verse 68:35": "rks D;k ge Qjekcjnkjksa dks ukQ+jekuks ds cjkcj dj nsaxs",
                            "verse 68:36": "¼gjfxt+ ugha½ rqEgsa D;k gks x;k gS rqe rqe dSlk gqD+e yxkrs gks",
                            "verse 68:37": ";k rqEgkjs ikl dksbZ bZekuh fdrkc gS ftlesa rqe i<+ ysrs gks",
                            "verse 68:38": "fd tks pht+ ilUn djksxs rqe dks ogk¡ t+:j feysxh",
                            "verse 68:39": ";k rqeus gels d+lesa ys j[kh gSa tks jkst+s d+;ker rd pyh tk,xh fd tks dqN rqe gqDe nksxs ogh rqEgkjs fy, t+:j gkft+j gksxk",
                            "verse 68:40": "muls iwNks rks fd muesa bldk dkSu ft+Eesnkj gS",
                            "verse 68:41": ";k ¼bl ckc esa½ muds vkSj yksx Hkh Ójhd gSa rks vxj ;s yksx lPps gSa rks vius Ójhdksa dks lkeus yk,¡",
                            "verse 68:42": "ftl fnu fiaMyh [kksy nh tk, vkSj ¼dkfQ+j½ yksx ltns ds fy, cqyk, tk,¡xs rks ¼ltnk½ u dj ldsaxs",
                            "verse 68:43": "mudh vk¡[ksa >qdh gq;h gksaxh :lokbZ mu ij NkbZ gksxh vkSj ¼nqfu;k esa½ ;s yksx ltns ds fy, cqyk, tkrs vkSj gVVs dVVs rUn:Lr Fks",
                            "verse 68:44": "rks eq>s ml dyke ds >qBykus okys ls le> ysus nks ge mudks vkfgLrk vkfgLrk bl rjg idM+ ysaxs fd mudks [+kcj Hkh u gksxh",
                            "verse 68:45": "vkSj eSa mudks eksgyr fn;s tkrk gw¡ cs’kd esjh rnchj et+cwr gS",
                            "verse 68:46": "¼,s jlwy½ D;k rqe muls ¼rcyhx+s fjlkyr dk½ dqN flyk ek¡xrs gks fd mu ij rkoku dk cks> iM+ jgk gS",
                            "verse 68:47": ";k muds bl x+Sc ¼dh [+kcj½ gS fd ;s yksx fy[k fy;k djrs gSa",
                            "verse 68:48": "rks rqe vius ijojfnxkj ds gqDe ds bUrst+kj esa lcz djks vkSj eNyh ¼dk fuokyk gksus½ okys ¼;wuql½ ds ,sls u gks tkvks fd tc og x+qLls esa Hkjs gq, Fks vkSj vius ijojfnxkj dks iqdkjk",
                            "verse 68:49": "vxj rqEgkjs ijojfnxkj dh esgjckuh mudh ;kojh u djrh rks pfV;y eSnku esa Mky fn, tkrs vkSj mudk cqjk gky gksrk",
                            "verse 68:50": "rks muds ijojfnxkj us mudks cjxqt+hnk djds usdksdkjksa ls cuk fn;k",
                            "verse 68:51": "vkSj dq¶+Q+kj tc d+qjku dks lqurs gSa rks ekywe gksrk gS fd ;s yksx rqEgsa ?kwj ?kwj dj ¼jkg jkLr lss½ t+:j fQlyk nsaxs",
                            "verse 68:52": "vkSj dgrs gSa fd ;s rks flM+h gSa vkSj ;s ¼d+qjku½ rks lkjs tgk¡u dh ulhgr gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Nun, demi kalam dan apa yang mereka tulis,",
                            "verse 68:2": "berkat ni’mat Tuhanmu kamu (Muhammad) sekali-kali bukan orang gila.",
                            "verse 68:3": "Dan sesungguhnya bagi kamu benar-benar pahala yang besar yang tidak putus-putusnya.",
                            "verse 68:4": "Dan sesungguhnya kamu benar-benar berbudi pekerti yang agung.",
                            "verse 68:5": "Maka kelak kamu akan melihat dan mereka (orang-orang kafir) pun akan melihat,",
                            "verse 68:6": "siapa di antara kamu yang gila.",
                            "verse 68:7": "Sesungguhnya Tuhanmu, Dia-lah Yang Paling Mengetahui siapa yang sesat dari jalan-Nya; dan Dia-lah Yang Paling Mengetahui orang-orang yang mendapat petunjuk.",
                            "verse 68:8": "Maka janganlah kamu ikuti orang-orang yang mendustakan (ayat-ayat Allah).",
                            "verse 68:9": "Maka mereka menginginkan supaya kamu bersikap lunak lalu mereka bersikap lunak (pula kepadamu).",
                            "verse 68:10": "Dan janganlah kamu ikuti setiap orang yang banyak bersumpah lagi hina,",
                            "verse 68:11": "yang banyak mencela, yang kian ke mari menghambur fitnah,",
                            "verse 68:12": "yang sangat enggan berbuat baik, yang melampaui batas lagi banyak dosa,",
                            "verse 68:13": "yang kaku kasar, selain dari itu, yang terkenal kejahatannya,",
                            "verse 68:14": "karena dia mempunyai (banyak) harta dan anak.",
                            "verse 68:15": "Apabila dibacakan kepadanya ayat-ayat Kami, ia berkata: \"(Ini adalah) dongeng-dongengan orang-orang dahulu kala.\"",
                            "verse 68:16": "Kelak akan kami beri tanda dia di belalai-(nya).",
                            "verse 68:17": "Sesungguhnya Kami telah menguji mereka (musyrikin Mekah) sebagaimana Kami telah menguji pemilik-pemilik kebun, ketika mereka bersumpah bahwa mereka sungguh-sungguh akan memetik (hasil)nya di pagi hari,",
                            "verse 68:18": "dan mereka tidak mengucapkan: \"Insyaa Allah\",",
                            "verse 68:19": "lalu kebun itu diliputi malapetaka (yang datang) dari Tuhanmu ketika mereka sedang tidur,",
                            "verse 68:20": "maka jadilah kebun itu hitam seperti malam yang gelap gulita,",
                            "verse 68:21": "lalu mereka panggil memanggil di pagi hari:",
                            "verse 68:22": "\"Pergilah di waktu pagi (ini) ke kebunmu jika kamu hendak memetik buahnya\".",
                            "verse 68:23": "Maka pergilah mereka saling berbisik-bisikan.",
                            "verse 68:24": "\"Pada hari ini janganlah ada seorang miskin pun masuk ke dalam kebunmu\".",
                            "verse 68:25": "Dan berangkatlah mereka di pagi hari dengan niat menghalangi (orang-orang miskin) padahal mereka mampu (menolongnya).",
                            "verse 68:26": "Tatkala mereka melihat kebun itu, mereka berkata: \"Sesungguhnya kita benar-benar orang-orang yang sesat (jalan),",
                            "verse 68:27": "bahkan kita dihalangi (dari memperoleh hasilnya)\"",
                            "verse 68:28": "Berkatalah seorang yang paling baik fikirannya di antara mereka: \"Bukankah aku telah mengatakan kepadamu, hendaklah kamu bertasbih (kepada Tuhanmu)?.",
                            "verse 68:29": "Mereka mengucapkan: \"Maha Suci Tuhan kami, sesungguhnya kami adalah orang-orang yang zalim\".",
                            "verse 68:30": "Lalu sebahagian mereka menghadapi sebahagian yang lain seraya cela mencela.",
                            "verse 68:31": "Mereka berkata: \"Aduhai celakalah kita; sesungguhnya kita ini adalah orang-orang yang melampaui batas\".",
                            "verse 68:32": "Mudah-mudahan Tuhan kita memberikan ganti kepada kita dengan (kebun) yang lebih baik daripada itu; sesungguhnya kita mengharapkan ampunan dari Tuhan kita.",
                            "verse 68:33": "Seperti itulah azab (dunia). Dan sesungguhnya azab akhirat lebih besar jika mereka mengetahui.",
                            "verse 68:34": "Sesungguhnya bagi orang-orang yang bertakwa (disediakan) surga-surga yang penuh kenikmatan di sisi Tuhannya.",
                            "verse 68:35": "Maka apakah patut Kami menjadikan orang-orang Islam itu sama dengan orang-orang yang berdosa (orang kafir)?",
                            "verse 68:36": "Mengapa kamu (berbuat demikian): bagaimanakah kamu mengambil keputusan?",
                            "verse 68:37": "Atau adakah kamu mempunyai sebuah kitab (yang diturunkan Allah) yang kamu membacanya?,",
                            "verse 68:38": "bahwa di dalamnya kamu benar-benar boleh memilih apa yang kamu sukai untukmu.",
                            "verse 68:39": "Atau apakah kamu memperoleh janji-janji yang diperkuat dengan sumpah dari Kami, yang tetap berlaku sampai hari kiamat; sesungguhnya kamu benar-benar dapat mengambil keputusan (sekehendakmu)?",
                            "verse 68:40": "Tanyakanlah kepada mereka: \"Siapakah di antara mereka yang bertanggung jawab terhadap keputusan yang diambil itu?\"",
                            "verse 68:41": "Atau apakah mereka mempunyai sekutu-sekutu? Maka hendaklah mereka mendatangkan sekutu-sekutunya jika mereka adalah orang-orang yang benar.",
                            "verse 68:42": "Pada hari betis disingkapkan dan mereka dipanggil untuk bersujud; maka mereka tidak kuasa,",
                            "verse 68:43": "(dalam keadaan) pandangan mereka tunduk ke bawah, lagi mereka diliputi kehinaan. Dan sesungguhnya mereka dahulu (di dunia) diseru untuk bersujud, dan mereka dalam keadaan sejahtera.",
                            "verse 68:44": "Maka serahkanlah (ya Muhammad) kepada-Ku (urusan) orang-orang yang mendustakan perkataan ini (Al Qur’an). Nanti Kami akan menarik mereka dengan berangsur-angsur (ke arah kebinasaan) dari arah yang tidak mereka ketahui,",
                            "verse 68:45": "dan Aku memberi tangguh kepada mereka. Sesungguhnya rencana-Ku amat teguh.",
                            "verse 68:46": "Ataukah kamu meminta upah kepada mereka, lalu mereka diberati dengan utang.",
                            "verse 68:47": "Ataukah ada pada mereka ilmu tentang yang gaib lalu mereka menulis (padanya apa yang mereka tetapkan)?",
                            "verse 68:48": "Maka bersabarlah kamu (hai Muhammad) terhadap ketetapan Tuhanmu, dan janganlah kamu seperti orang (Yunus) yang berada dalam (perut) ikan ketika ia berdo’a sedang ia dalam keadaan marah (kepada kaumnya).",
                            "verse 68:49": "Kalau sekiranya ia tidak segera mendapat ni’mat dari Tuhannya, benar-benar ia dicampakkan ke tanah tandus dalam keadaan tercela.",
                            "verse 68:50": "Lalu Tuhannya memilihnya dan menjadikannya termasuk orang-orang yang saleh.",
                            "verse 68:51": "Dan sesungguhnya orang-orang kafir itu benar-benar hampir menggelincirkan kamu dengan pandangan mereka, tatkala mereka mendengar Al Qur’an dan mereka berkata: \"Sesungguhnya ia (Muhammad) benar-benar orang yang gila .",
                            "verse 68:52": "Dan Al Qur’an itu tidak lain hanyalah peringatan bagi seluruh umat."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Nûn . Per il calamo e ciò che scrivono !",
                            "verse 68:2": "Per Grazia di Allah tu non sei un folle ,",
                            "verse 68:3": "e in verità ci sarà per te infinita ricompensa,",
                            "verse 68:4": "e in verità di un'immensa grandezza è il tuo carattere .",
                            "verse 68:5": "Vedrai, e pure loro vedranno",
                            "verse 68:6": "chi di voi ha perso la ragione.",
                            "verse 68:7": "Il tuo Signore ben conosce chi si allontana dalla Sua via e ben conosce coloro che seguono la retta via.",
                            "verse 68:8": "Non obbedire a coloro che tacciano di menzogna.",
                            "verse 68:9": "Vorrebbero che tu fossi accondiscente e allora sarebbero accondiscendenti anche loro .",
                            "verse 68:10": "Non dare ascolto ad alcun miserabile spergiuro ,",
                            "verse 68:11": "al diffamatore, seminatore di maldicenza,",
                            "verse 68:12": "a quel grande nemico del bene, trasgressore, peccatore,",
                            "verse 68:13": "arrogante e persino bastardo .",
                            "verse 68:14": "[Non dargli ascolto,] anche se possiede ricchezze e progenie.",
                            "verse 68:15": "Quando i nostri versetti gli sono recitati, dice: « Favole degli antichi ! »",
                            "verse 68:16": "Lo marchieremo sul grugno .",
                            "verse 68:17": "Li abbiamo messi alla prova come abbiamo messo alla prova quelli del giardino che avevano giurato di fare il raccolto al mattino ,",
                            "verse 68:18": "senza formulare riserva .",
                            "verse 68:19": "Venne un uragano, proveniente dal tuo Signore, mentre dormivano:",
                            "verse 68:20": "e al mattino fu come se [il giardino] fosse stato falciato.",
                            "verse 68:21": "L'indomani si chiamarono gli uni con gli altri, di buon mattino:",
                            "verse 68:22": "«Andate di buonora alla vostra piantagione, se volete raccogliere».",
                            "verse 68:23": "Andarono parlando tra loro a bassa voce:",
                            "verse 68:24": "«Che oggi non si presenti a voi un povero!» .",
                            "verse 68:25": "Uscirono di buon'ora, in preda all'avarizia, pur avendo i mezzi [per fare l'elemosina].",
                            "verse 68:26": "Quando poi videro [quel che era avvenuto], dissero: «Davvero abbiamo sbagliato [strada]!",
                            "verse 68:27": "[Ma poi convennero:] Siamo rovinati»",
                            "verse 68:28": "Il più equilibrato tra loro disse: « Non vi avevo forse avvertito di rendere gloria ad Allah?».",
                            "verse 68:29": "Dissero: «Gloria al nostro Signore, invero siamo stati ingiusti».",
                            "verse 68:30": "Si volsero poi gli uni agli altri, biasimandosi a vicenda.",
                            "verse 68:31": "Dissero: « Guai a noi, invero siamo stati iniqui.",
                            "verse 68:32": "E' possibile che il nostro Signore, ci compensi di questo con qualcosa di migliore. Noi bramiamo il nostro Signore» .",
                            "verse 68:33": "Questo fu il castigo, ma il castigo dell'altra vita è ancora maggiore, se solo lo sapessero!",
                            "verse 68:34": "I devoti avranno presso il loro Signore i Giardini della Delizia.",
                            "verse 68:35": "Tratteremo i sottomessi come i criminali?",
                            "verse 68:36": "Che cosa vi prende? Come giudicate?",
                            "verse 68:37": "Avete forse una Scrittura che vi istruisca,",
                            "verse 68:38": "e in cui troviate quel che desiderate?",
                            "verse 68:39": "Ci siamo forse legati a voi con solenni giuramenti che Ci impegnino fino al Giorno della Resurrezione, a darvi quello che chiederete?",
                            "verse 68:40": "Interpellali su chi di loro se ne faccia garante.",
                            "verse 68:41": "Oppure, hanno forse degli [dèi] associati? Allora facciano venire i loro associati, se sono sinceri.",
                            "verse 68:42": "Il Giorno in cui affronteranno gli orrori , saranno chiamati a prosternarsi, ma non potranno farlo:",
                            "verse 68:43": "saranno bassi i loro sguardi e saranno coperti di ignominia. Eppure furono chiamati a prosternarsi quando ancora erano sani e salvi.",
                            "verse 68:44": "LasciaMi solo con coloro che tacciano di menzogna questo Discorso. Li condurremo passo passo per vie che non conoscono .",
                            "verse 68:45": "Concedo loro una dilazione: in verità il Mio piano è infallibile.",
                            "verse 68:46": "Forse chiedi loro un compenso che li gravi di un peso insopportabile ?",
                            "verse 68:47": "Forse possiedono l'invisibile e lo descrivono?",
                            "verse 68:48": "Sopporta dunque con pazienza il Decreto del tuo Signore e non essere come l'uomo del Pesce , che invocò al colmo dell'angoscia.",
                            "verse 68:49": "Se una grazia del tuo Signore non lo avesse toccato, sarebbe stato gettato sulla riva deserta, reietto.",
                            "verse 68:50": "Poi il suo Signore lo scelse e ne fece uno dei giusti.",
                            "verse 68:51": "Manca poco che i miscredenti ti trapassino con gli sguardi, quando sentono il Monito; dicono: «Davvero è uno posseduto! » .",
                            "verse 68:52": "Ma questo [Corano] non è che un Monito per il Creato."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "ヌーン。筆に誓けて，また書いたものにおいて誓う。",
                            "verse 68:2": "主の恩恵において，あなたは気違いではない。",
                            "verse 68:3": "いや，本当にあなたには，尽きない報奨があろう。",
                            "verse 68:4": "本当にあなたは，崇高な徳性を備えている。",
                            "verse 68:5": "やがてあなたは見よう，かれらもまた見るであろう。",
                            "verse 68:6": "あなたがたの誰が気違いであるかを。",
                            "verse 68:7": "本当にあなたの主は，道から迷い去った者を，最もよく知っておられ，また導かれている者を最もよく知り尽される方である。",
                            "verse 68:8": "それであなたは（真理を）否認する者に従ってはならない。",
                            "verse 68:9": "かれらの願いは，あなたが歩み寄ることで，そうなればかれらも妥協したいのである。",
                            "verse 68:10": "あなたは，卑劣な誓いをたてるどんな者にも屈従してはならない。",
                            "verse 68:11": "中傷し，悪口を言い歩く者，",
                            "verse 68:12": "善事を妨げ，� に背く罪深い者，",
                            "verse 68:13": "乱暴（残虐）な者，その外素性の卑しい者，",
                            "verse 68:14": "富と（多くの）子女を持っているために（そうである，これらの者に従ってはならない）。",
                            "verse 68:15": "かれにわが印が読唱されると，「それは昔の物語です。」と言う。",
                            "verse 68:16": "やがてわれは，鼻の上に焼印を押すであろう。",
                            "verse 68:17": "本当にわれは，（果樹）園の持ち主を試みたように，かれらを試みた。かれらが，早朝にそれ（果物）を収穫することを誓った時に，",
                            "verse 68:18": "（アッラーの御望みならば）と，条件を付けることをしなかった。",
                            "verse 68:19": "それでかれらが眠っている間に，あなたの主からの天罰がそれを襲った。",
                            "verse 68:20": "それで朝には，それは摘み取られたようになった。",
                            "verse 68:21": "早朝かれらは互いに叫んだ。",
                            "verse 68:22": "「もし収穫するのならあなたがたの畑に急ぎましょう。」",
                            "verse 68:23": "そこでかれらは低声に囁き合って出かけた。",
                            "verse 68:24": "「今日は一人の貧乏人も，あの（果樹園）に入らせてはなりません。」",
                            "verse 68:25": "かれらは強く心に決めて，朝早く出て行った。",
                            "verse 68:26": "だがかれらがそれを見た時，言った。「わたしたちは，道を間違えている。",
                            "verse 68:27": "いや，わたしたちは（収穫物を）奪われた。」",
                            "verse 68:28": "かれらの中，すこし穏やかな一人が言った。「あなたがたはどうして（主を）讃えないのかと，わたしが言ったのに。」",
                            "verse 68:29": "かれらは，「わたしたちの主を讃える。本当にわたしたちは不義でありました。」と言った。",
                            "verse 68:30": "そこでかれらは，互いに責め合い始めた。",
                            "verse 68:31": "かれらは言った。「ああ悲しい，わたしたちは本当に横柄でした。",
                            "verse 68:32": "主はこれに代る，更に良い（果樹園）を与えられるかもしれない。本当にわたしたちは，（悔悟して）主に嘆願します。」",
                            "verse 68:33": "このようなものが，（現世の）懲罰である。だが来世の懲罰は更に大きなものである。もしかれらに分っていたならば。",
                            "verse 68:34": "本当にアッラーを畏れる者に対しては，主の御許に喜こびの楽園があろう。",
                            "verse 68:35": "われは信心深い者たちを，罪人のように扱うとでもいうのか。",
                            "verse 68:36": "あなたがたはどうしたのか。あなたがたはどう判断するのか。",
                            "verse 68:37": "それともあなたがたには，学ぶに足りる啓典があるのか。",
                            "verse 68:38": "あなたがたが選ぶものは，何でもその啓典の中にあるのか。",
                            "verse 68:39": "それともあなたがたは，審判の日まで有効な誓約をわれと結んだのか。あなたがたが思慮分別することは，確かにあなたがたのものになるのか。",
                            "verse 68:40": "（ムハンマドよ）かれらに問え。「かれらの誰がそれを保証するのですか。」",
                            "verse 68:41": "または，かれらは（主に）配するものがあるのか。かれらが正しいのなら，その配するものを連れて来させなさい。",
                            "verse 68:42": "脛が，現わにされる日（を思いなさい）。かれらはサジダするよう求められる。だがかれらには出来ないであろう。",
                            "verse 68:43": "かれらは目を伏せ，屈辱を被るであろう。サジダするよう，確かにかれらは呼びかけられていた。その時五体満足なのに（拒否した）。",
                            "verse 68:44": "そこでこの御言葉（クルアーン）を虚偽であるとする者をわれに任せよ。われはかれらが気付かない方面から，一歩一々（堕落に）導き，",
                            "verse 68:45": "かれらを猶予するであろう。本当にわれの計略は強く確かである。",
                            "verse 68:46": "それともあなたがかれらに報酬を求め，それでかれらは負担を課せられたのか。",
                            "verse 68:47": "また幽玄界がかれらの手元にあり，それでかれらは（それを）書き下すことが出来るのか。",
                            "verse 68:48": "だから忍耐して，あなたの主の命令を待て。魚の友のようであってはならない。苦しさの余り（かれが）叫んだ時（のように）。",
                            "verse 68:49": "主からの恩恵がかれに達しなかったならば，かれは罪を負わされ，不面目に不毛の地に捨てられたであろう。",
                            "verse 68:50": "このように主は，かれを選び正義の徒の一人となされた。",
                            "verse 68:51": "不信心者は警告を聞く時，その（物凄い）目付きで，あなたを凡んど� れんばかりにする。かれらは言う。「本当にかれは憑かれた者です。」",
                            "verse 68:52": "だが，この（クルアーン）こそは，万有のための訓戒に外ならない。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "눈 연필과 그들의 기록에 걸어 맹세하사",
                            "verse 68:2": "그대가 미친자가 아닌 것은 주님의 은혜로서",
                            "verse 68:3": "진실로 그대에게는 한없는 보상이 주어지리라",
                            "verse 68:4": "실로 그대는 고상한 성품의 소유자로",
                            "verse 68:5": "머지 않아 그대도 알게 될 것이며 저들도 알게 되리라",
                            "verse 68:6": "너희 중에 누가 미친 자이뇨",
                            "verse 68:7": "실로 그대 주님은 하나님의 길에서 방황하는 자와 복음을 받 아들이는 자들을 가장 잘 아시는 분이시라",
                            "verse 68:8": "그러므로 진리를 거역하는 자들에게 기울이지 말라",
                            "verse 68:9": "그들이 순응하는 척 하며 그 대가 순응하기를 그들은 원하고 있노라",
                            "verse 68:10": "비열한 그들의 맹세에 귀를 기울지 말라",
                            "verse 68:11": "그들은 중상모략하는 자들로 비방하고 배회하면서",
                            "verse 68:12": "모든 선행을 방해하고 영역 을 넘어 죄악에 깊이 빠진 자들로",
                            "verse 68:13": "난폭하고 잔인하니 모든 것 이 저주스런 태생이라",
                            "verse 68:14": "이는 그가 재물과 많은 자손들을 가졌기 때문이뇨",
                            "verse 68:15": "하나님의 말씀이 그에게 계 시될 때마다 그것은 옛 선조들은 우화들이라고 말하였더라",
                            "verse 68:16": "하나님은 콧등에 낙인을 찍 어 두리라",
                            "verse 68:17": "아침에 과수원의 과일을 수 확하려 결심했을 때 과수원 사람 들을 시험했듯이 하나님은 그들을 시험하노라",
                            "verse 68:18": "그러나 그들은 은혜를 베풀지 아니 했으니",
                            "verse 68:19": "그들이 잠든 사이에 주님으로부터 그 정원에 재앙이 있었노 라",
                            "verse 68:20": "그리하여 그 정원은 검은 불모지가 되어 버렸으니",
                            "verse 68:21": "아침이 되매 그들은 서로가 서로에게 소리 지르더라",
                            "verse 68:22": "과일을 수확코자 한다면 아 침 일찍 과수원으로 나가라 하니",
                            "verse 68:23": "그들은 떠나며 낮은 비밀의 목소리로 속삭이더라",
                            "verse 68:24": "오늘은 가난뱅이가 당신의 과수원에 들어 오지 못하도록 하 라",
                            "verse 68:25": "그리하여 그들은 그렇게 작 정하고 아침 일찍 피하여 떠났 더라",
                            "verse 68:26": "그들이 과수원을 보았을 때 우리가 길을 잃었도다 라고 그들 은 말하며",
                            "verse 68:27": "실로 우리는 크게 빼앗긴 자들이요 라고 하더라",
                            "verse 68:28": "그들 중에 보다 정직했던 자가 왜 하나님을 찬양하지 아니 했느냐 내가 너희에게 말하지 아니 했더뇨 라고 하매",
                            "verse 68:29": "주님께 영광이 있으소서 실 로 저희가 사악한 자들이었습니다라고 말하노라",
                            "verse 68:30": "그때 그들은 서로가 서로를 비난하며",
                            "verse 68:31": "실로 우리가 사악한 자들이 었으니 비참할 뿐이라고 말하고",
                            "verse 68:32": "주님께서 이것보다 더 좋은 것으로 바꾸어 주실 것이요 실로 우리는 그분께 회개하도다 라고 말하더라",
                            "verse 68:33": "그러함이 현세의 벌이라 너 희가 알고 있다면 내세의 응벌은 더욱 크니라",
                            "verse 68:34": "그러나 하나님을 두려워 하 는 자들에게는 은혜의 천국이 있 나니",
                            "verse 68:35": "하나님이 믿음의 백성들을 죄인의 백성들처럼 대우하려 하시겠느뇨",
                            "verse 68:36": "도대체 너희가 그런 판단을 하는 이유가 무엇이뇨",
                            "verse 68:37": "너희가 배울 수 있는 한 성 서가 있었느뇨",
                            "verse 68:38": "너희가 그 안에서 선택할 무엇이 있었느뇨",
                            "verse 68:39": "심판의 날까지 너희가 원하 는 것이 너희에게 이르리라 하나 님의 성약이라도 받았느뇨",
                            "verse 68:40": "그대여 그들 가운데 누가 그것을 보장할 것인지 그들에게 물어보라",
                            "verse 68:41": "그들에게 신과 대등한 무리 의 동료가 있다는 거뇨 그들이 진 실이라면 그들의 무리들을 이르게 하라",
                            "verse 68:42": "가혹한 재앙이 있을 그날에 그들은 부복하라 부름을 받으나 그렇게할 수도 없노라",
                            "verse 68:43": "그들의 눈들은 아래로 처져 있고 굴욕이 그들을 애워싸노라 그들이 건전했을 때 부복하라 부 름을 받았노라",
                            "verse 68:44": "그러므로 이 메세지를 거역 한 자들을 나에게 맡기라 그들이 인식하지 못하는 방향으로부터 점차로 벌을 주리라",
                            "verse 68:45": "내가 그들을 일시적으로 유 예하나 실로 나의 계획은 확고하 니라",
                            "verse 68:46": "그대가 그들에게 보상을 요 구하여 그들이 부채로 짐을 지고 있느뇨",
                            "verse 68:47": "보이지 않는 것이 그들곁에 있어 그들이 그것을 기록이라도 할 수 있느뇨",
                            "verse 68:48": "그러므로 인내하라 그때 주 님의 명령이 있을 것이니 노하여 고함을 쳤던 물고기의 무리가 되 지 말라",
                            "verse 68:49": "주님의 은혜가 그에게 베풀 어지지 아니 했으면 벌거벗은 채 불모의 땅에 버려져 비난을 받고 있었으리라",
                            "verse 68:50": "그러나 주님은 그를 선택하 사 의로운 자 중에 있게 하셨노라",
                            "verse 68:51": "불신자들이 그 교훈을 들을 때면 그들의 눈으로써 그대를 괴 롭히며 실로 그야말로 미친자라 말하더라",
                            "verse 68:52": "그러나 그것은 분명 온 인류를 위한 교훈이라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "سه‌رنجی سه‌ره‌تای سووره‌تی (الشوری) بده‌. سوێند به پێنووس و ئه‌وه‌ی که ده‌ینوسن (ئه‌م سوێند خواردنه نیشانه‌ی نرخی خوێندن و زانستیه لای خوای گه‌وره‌).",
                            "verse 68:2": "(ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم تۆ به‌هۆی نازو نیعمه‌تی په‌روه‌ردگارته‌وه دووریت له شێتی یه‌وه وه‌کو نه‌فامن ده‌ڵێن)",
                            "verse 68:3": "بێگومان پاداشتێکی نه‌بڕاوه بۆ تۆ ئاماده‌یه‌.",
                            "verse 68:4": "به‌ڕاستی تۆ له‌سه‌ر ڕه‌وشت و خوویه‌کی زۆر جوان و په‌سه‌ند و بێ وێنه و مه‌زنیت.",
                            "verse 68:5": "سه‌رئه‌نجام تۆ ده‌بینیت و ده‌زانیت و ئه‌وانیش ده‌بینن و ده‌زانن...",
                            "verse 68:6": "شێتێتی به کامتانه‌وه‌یه‌.",
                            "verse 68:7": "به‌ڕاستی په‌روه‌ردگارت خۆی ده‌زانێت، کێ له ڕێبازی ئه‌و لایداوه و گومڕا بووه‌، کێیش ڕێبازی هیدایه‌ت و ئیمانی گرتۆته‌به‌رو ڕاسته له‌گه‌ڵ خوادا.",
                            "verse 68:8": "تۆ هه‌رگیز به‌قسه‌ی ئه‌وانه مه‌که که باوه‌ڕیان به تۆ نیه‌و به‌رنامه‌که‌ی تۆ به‌درۆ ده‌زانن.",
                            "verse 68:9": "ئه‌وانه ئاواته‌خوازن که تۆ نه‌رمی بنوێنیت ئینجا ئه‌وانیش نه‌رمی بنوێنن.",
                            "verse 68:10": "به‌قسه‌ی هه‌موو ئه‌وانه مه‌که که زۆر سوێند ده‌خۆن و زۆر سووك و ڕیسوان.",
                            "verse 68:11": "ئه‌وانه‌ی که به‌شوێن عه‌یب و عاردا ده‌گه‌ڕێن و دووزمانی ده‌که‌ن و فیتنه ده‌گێڕن و حه‌زیان له ئاشووبه‌.",
                            "verse 68:12": "زۆر دژی خێرو چاکه‌ن و ده‌ستدرێژی ده‌که‌ن و گوناه ئه‌نجام ده‌ده‌ن و پیلان ده‌گێڕن.",
                            "verse 68:13": "له هه‌مان کاتدا ئێسك تاڵ و ڕه‌وشت ناشرین و ناکه‌س به‌چه‌و باوك نادیارن...",
                            "verse 68:14": "هه‌ریه‌که‌یان به‌وه ده‌نازێت که‌هه‌ندێك ماڵ و سامان و کوڕی هه‌یه‌...",
                            "verse 68:15": "کاتێك ئایه‌ته‌کانی ئێمه‌ی به‌سه‌ردا ده‌خوێنرێته‌وه بێباکانه ده‌ڵێت: ئه‌مه داستانی پێشووه‌کانه‌، ئه‌مه به‌سه‌رهاتی دێرینه‌.",
                            "verse 68:16": "ئێمه سه‌رئه‌نجام لووتی داخ ده‌که‌ین و سه‌ری لووتی ڕه‌ش ده‌که‌ین.",
                            "verse 68:17": "به‌ڕاستی ئێمه ئه‌و خه‌ڵکه‌مان تاقی کرده‌وه هه‌روه‌ك خاوه‌نانی باخه‌که‌مان تاقیکرده‌وه‌، کاتێك سوێندیان خوارد بێگومان به‌یانی ده‌یچنن.",
                            "verse 68:18": "بێ ئه‌وه‌ی بڵێن به‌پشتیوانی خوا، (یان به‌و مه‌به‌سته‌ی هیچی پێوه نه‌هێڵن بۆ هه‌ژاران)...",
                            "verse 68:19": "ئه‌وسا په‌روه‌ردگارت به‌ڵایه‌کی داباراند به‌سه‌ر باخه‌که‌دا له‌کاتێکدا ئه‌وان خه‌وتبوون...",
                            "verse 68:20": "ئیتر وه‌ك باخێکی لێهات؛ که هه‌مووی چنرابێته‌وه‌و هیچی پێوه نه‌ما بێت...",
                            "verse 68:21": "ئه‌وسا به‌یانی زوو یه‌کتریان ئاگادار کردو وتیان:...",
                            "verse 68:22": "با بچین بۆ سه‌ر باخ و بێستانه‌که‌مان ئه‌گه‌ر بڕیاره بیچنین...",
                            "verse 68:23": "ئه‌وسا ده‌رچوون به‌نهێنی و به‌هێواشی ده‌ڕۆیشتن، به چپه قسه‌یان ده‌کرد...",
                            "verse 68:24": "ده‌یانوت: نابێت ئه‌مڕۆ هه‌ژاران پێمان بزانن و ڕوو بکه‌نه باخه‌که‌مان...",
                            "verse 68:25": "به‌یانی زوو بۆی ده‌رچوون، وایان ده‌زانی که توانیویانه هه‌ژاران بێ به‌ش بکه‌ن.",
                            "verse 68:26": "کاتێك گه‌یشتنه باخه وێرانه‌که‌و بینیان وتیان: بێگومان ئێمه ون بووین و ڕێمان هه‌ڵه کردووه‌...",
                            "verse 68:27": "دوای ئه‌وه‌ی دڵنیا بوون ڕێیان هه‌ڵه نه‌کردووه‌، وتیان: نه‌خێر، به‌ڵکو ئێمه به‌ش بڕاو کراوین...",
                            "verse 68:28": "له هه‌موویان ژیر تر وتی: پێم نه‌وتن که حه‌ق وایه ته‌سبیحات و ستایشی خوا بکه‌ن و سوپاسگوزاری بکه‌ن؟!",
                            "verse 68:29": "ئه‌وسا هه‌موو وتیان: پاکی و بێگه‌ردی بۆ په‌روه‌ردگارمانه‌، به‌ڕاستی ئێمه ناحه‌قیمان کرد.",
                            "verse 68:30": "ئه‌وسا ڕویان کرده یه‌کترو ده‌ستیان کرده لۆمه‌کردن و سه‌رزه‌نشت کردنی یه‌کتری و...",
                            "verse 68:31": "وتیان: هاوار بۆ ئێمه‌، به‌ڕاستی ئێمه پیاو خراپ و له سنوور ده‌رچوو بووین (که‌ی ئه‌و ڕه‌زیلییه ڕاسته‌)!!",
                            "verse 68:32": "ئومێده‌وارین که په‌روه‌ردگارمان له‌م باخه باشترمان پێ ببه‌خشێت (ئێمه ئیتر ته‌مێ بووین، ده‌رس و ئامۆژگاریمان وه‌رگرت) ئیتر ئێمه به‌ڕاستی به‌هیوای ڕه‌زامه‌ندی خوا هه‌وڵ ده‌ده‌ین و به‌هیوای به‌خششی ئه‌وین.",
                            "verse 68:33": "سزای ئه‌م ژیانه ئاوایه و سزاو ئازاری قیامه‌تیش سه‌ختتره ئه‌گه‌ر خه‌ڵکی بیانزانیایه‌.",
                            "verse 68:34": "به‌ڕاستی بۆ خواناس و پارێزکاران باخه‌کانی به‌هه‌شتی پڕ له نازو نیعمه‌ت له‌لای په‌روه‌ردگاریان ئاماده‌یه‌.",
                            "verse 68:35": "ئایا ڕه‌وایه پاداشتی موسوڵمانان وه‌ك تاوانبار و تاوانکاران بێت؟!",
                            "verse 68:36": "ئه‌وه چیتانه‌؟ چۆن حوکم و بڕیاری ناڕه‌وای وا ده‌رده‌که‌ن!!",
                            "verse 68:37": "ئایا کتێبێکی ئاسمانیتان بۆ هاتووه‌، تیایدا بخوێنن؟!...",
                            "verse 68:38": "تا هه‌رچی ئێوه بتانه‌وێت به ئاره‌زووی خۆتان هه‌ڵی بژێرن؟!",
                            "verse 68:39": "یان سوێندتان له‌سه‌رمانه که تاڕۆژی قیامه‌ت هه‌ر چیتان بوێت ئه‌وه بێت؟!",
                            "verse 68:40": "پرسیاریان لێ بکه بزانه کامیان زامنی ئه‌و کاره‌یه‌!!",
                            "verse 68:41": "ئایا ئه‌مانه شه‌ریك و هاوبه‌شیان هه‌یه له‌م بڕیاره‌دا، کوان؟ ده‌با بیانهێنن ئه‌گه‌ر ڕاست ده‌که‌ن؟",
                            "verse 68:42": "ڕۆژێك دێت په‌رده له‌سه‌ر هه‌موو شتێك لاده‌درێت و لاق ده‌رده‌که‌وێت، خوانه‌ناسان بانگ ده‌کرێن بۆ سوژده بردن، به‌ڵام ناتوانن.",
                            "verse 68:43": "ئه‌وانه‌؛ ئه‌و ڕۆژه چاویان شۆڕه و زه‌لیلی و خه‌جاڵه‌تی به‌ته‌واوی دایان ده‌گرێت، چونکه کاتی خۆی بانگ ده‌کران بۆ نوێژکردن و سوژده بردن، له کاتێکدا له‌وپه‌ڕی ته‌ندروستی و سه‌ربه‌ستیدا بوون (به‌ڵام گاڵته‌یان پێی ده‌هات).",
                            "verse 68:44": "وازم لێ بهێنه بۆ ئه‌وانه‌ی که بڕوا به‌م گوفتاره ناهێنن، ئێمه ئه‌وانه بۆ سه‌ره‌نجامی ناکامیان به‌ره‌به‌ره کێش ده‌که‌ین، بێ ئه‌وه‌ی به خۆیان بزانن و هه‌ستی پێ بکه‌ن.",
                            "verse 68:45": "من مۆڵه‌تیان ده‌ده‌م، به‌ڵام هه‌رگیز له سزای ئێمه ڕزگاریان نابێت چونکه بێگومان ده‌سه‌ڵاتمان تۆکمه‌یه‌.",
                            "verse 68:46": "ئه‌ی ئایا تۆ داوای کرێیان لێده‌که‌یت، تا قه‌رزار باری زۆر ببن و نه‌توانن له ژێری ده‌رچن؟!",
                            "verse 68:47": "ئه‌ی ئایا ئه‌وانه غه‌یب زانن و له نهێنیه‌کان ئاگادارن تا بۆ خۆیان شت یاداشت بکه‌ن و دژایه‌تی ئیسلام بکه‌ن؟",
                            "verse 68:48": "ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم تۆ خۆڕاگربه له به‌رامبه‌ر فه‌رمانی په‌روه‌ردگارته‌وه‌، نه‌که‌یت وه‌ك هاوه‌ڵ و خاوه‌نی نه‌هه‌نگه‌که بیت (که یونس پێغه‌مبه‌ره‌) له کاتێکدا که دڵی پڕ بوو له خه‌فه‌ت و په‌ژاره‌یه‌کی زۆره‌وه پاڕایه‌وه‌و لاڵایه‌وه‌...",
                            "verse 68:49": "ئه‌گه‌ر ڕه‌حمه‌ت و به‌خشنده‌یی په‌روه‌ردگاری فریای نه‌که‌وتایه هه‌روا له‌و ده‌شته‌دا به‌بێ ناز ده‌مایه‌وه‌...",
                            "verse 68:50": "به‌ڵام په‌روه‌ردگاری هه‌ڵی بژاردو خستیه ڕیزی چاکانه‌وه (دوای نزاو په‌شیمانی).",
                            "verse 68:51": "(ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم) به‌ڕاستی ئه‌وانه‌ی که بێ باوه‌ڕ بوون کاتێك که گوێیان له قورئان ده‌بێت نزیکه به چاویان هه‌ڵتدێرن، ده‌ڵێن: ئه‌م پێغه‌مبه‌ره ده‌ستی لێ وه‌شێنراوه‌.",
                            "verse 68:52": "له کاتێکدا قورئان ته‌نها بریتیه له یادخستنه‌وه‌و بێدار خه‌ره‌وه‌ی هه‌موو خه‌ڵکی ئه‌م جیهانه (ئه‌گه‌ر تێفکرن)."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Nuun. Demi Pena dan apa yang mereka tulis;",
                            "verse 68:2": "Engkau (wahai Muhammad) dengan sebab nikmat pemberian Tuhanmu bukanlah seorang gila (sebagaimana yang dituduh oleh kaum musyrik, bahkan engkau adalah seorang yang bijaksana).",
                            "verse 68:3": "Dan sesungguhnya engkau tetap beroleh pahala yang amat besar, yang tidak putus-putus, (sebagai balasan bagi menjalankan ajaran Islam);",
                            "verse 68:4": "Dan bahawa sesungguhnya engkau mempunyai akhlak yang amat mulia.",
                            "verse 68:5": "Maka (tidak lama lagi) engkau akan melihat dan mereka juga akan melihat;",
                            "verse 68:6": "Siapakah orangnya yang gila di antara kamu semua.",
                            "verse 68:7": "Sesungguhnya Tuhanmu, Dialah jua yang lebih mengetahui akan orang yang sesat dari jalanNya dan Dialah jua yang lebih mengetahui akan orang-orang yang mendapat petunjuk.",
                            "verse 68:8": "Oleh itu (berpegang teguhlah pada ajaran Islam yang sedang engkau amalkan dan) janganlah engkau menurut kemahuan orang-orang yang mendustakan (agama Allah).",
                            "verse 68:9": "Mereka suka kalaulah engkau bertolak ansur (menurut kemahuan mereka), supaya mereka juga bertolak ansur berlemah-lembut (pada zahirnya terhadapmu).",
                            "verse 68:10": "Dan janganlah engkau (berkisar dari pendirianmu yang benar dan jangan) menurut kemahuan orang yang selalu bersumpah, lagi yang hina (pendapatnya dan amalannya);",
                            "verse 68:11": "Yang suka mencaci, lagi yang suka menyebarkan fitnah hasutan (untuk memecah belahkan orang ramai);",
                            "verse 68:12": "Yang sering menghalangi amalan-amalan kebajikan, yang melanggar hukum-hukum agama, lagi yang amat berdosa;",
                            "verse 68:13": "Yang jahat kejam, yang selain itu tidak tentu pula bapanya.",
                            "verse 68:14": "Adakah kerana dia seorang hartawan dan ramai anak-pinaknya (maka dia mendustakan agama Kami)? -",
                            "verse 68:15": "Apabila dibacakan kepadanya ayat-ayat keterangan Kami, dia berkata: (Ini ialah) cerita-cerita dongeng orang-orang dahulu kala.",
                            "verse 68:16": "(Orang yang bersifat demikian, akan didedahkan kehinaannya) Kami akan adakan tanda di atas hidungnya (yang berupa belalai itu).",
                            "verse 68:17": "Sesungguhnya Kami telah timpakan mereka dengan bala bencana, sebagaimana Kami timpakan tuan-tuan punya kebun (dari kaum yang telah lalu), ketika orang-orang itu bersumpah (bahawa) mereka akan memetik buah-buah kebun itu pada esok pagi; -",
                            "verse 68:18": "Serta mereka tidak menyebut pengecualian.",
                            "verse 68:19": "Maka kebun itu didatangi serta diliputi oleh bala bencana dari Tuhanmu (pada malam hari), sedang mereka semua tidur.",
                            "verse 68:20": "Lalu menjadilah ia sebagai kebun yang telah binasa semua buahnya.",
                            "verse 68:21": "Kemudian pada pagi-pagi, mereka panggil memanggil antara satu dengan yang lain -",
                            "verse 68:22": "(Setengahnya berkata): Pergilah pada pagi-pagi ke kebun kamu, kalau betul kamu mahu memetik buahnya.",
                            "verse 68:23": "Lalu berjalanlah mereka sambil berbisik (katanya):",
                            "verse 68:24": "Pada hari ini, janganlah hendaknya seorang miskin pun masuk ke kebun itu mendapatkan kamu.",
                            "verse 68:25": "Dan pergilah mereka pada pagi-pagi itu, dengan kepercayaan, (bahawa) mereka berkuasa menghampakan fakir miskin dari hasil kebun itu.",
                            "verse 68:26": "Sebaik-baik sahaja mereka melihat kebunnya, mereka berkata: Sebenarnya kita sesat jalan, (ini bukanlah kebun kita).",
                            "verse 68:27": "(Setelah mereka perhati dengan teliti, mereka berkata: Tidak! Kita tidak sesat), bahkan kita orang-orang yang dihampakan (dari hasil kebun kita, dengan sebab ingatan buruk kita sendiri).",
                            "verse 68:28": "Berkatalah orang yang bersikap adil di antara mereka: Bukankah aku telah katakan kepada kamu (semasa kamu hendak menghampakan orang-orang fakir miskin dari habuannya): Amatlah elok kiranya kamu mengingati Allah (serta membatalkan rancangan kamu yang jahat itu)?",
                            "verse 68:29": "Mereka berkata (dengan sesalnya): Maha Suci Tuhan Kami! Sesungguhnya kami adalah orang-orang yang berlaku zalim!",
                            "verse 68:30": "Kemudian setengahnya mengadap yang lain, sambil cela-mencela.",
                            "verse 68:31": "Mereka berkata: Aduhai celakanya kita! Sesungguhnya kita adalah orang-orang yang melampaui batas.",
                            "verse 68:32": "Semoga Tuhan kita, (dengan sebab kita bertaubat) menggantikan bagi kita yang lebih baik daripada (kebun yang telah binasa) itu; sesungguhnya, kepada Tuhan kita sahajalah kita berharap.",
                            "verse 68:33": "Demikianlah azab seksa (yang telah ditimpakan kepada golongan yang ingkar di dunia) dan sesungguhnya azab hari akhirat lebih besar lagi; kalaulah mereka orang-orang yang berpengetahuan (tentulah mereka beringat-ingat).",
                            "verse 68:34": "Sesungguhnya orang-orang yang bertakwa, disediakan bagi mereka taman-taman Syurga yang penuh nikmat, di sisi Tuhan mereka.",
                            "verse 68:35": "Patutkah Kami (berlaku tidak adil, dengan) menjadikan orang-orang Islam (yang taat), sama seperti orang-orang yang berdosa (yang kufur ingkar)?",
                            "verse 68:36": "Apa sudah jadi kepada akal kamu? Bagaimana kamu menetapkan hukum (yang terang-terang salahnya itu)?",
                            "verse 68:37": "Adakah kamu mempunyai sesebuah Kitab (dari Allah) yang kamu baca dan pelajari?",
                            "verse 68:38": "Bahawa di dalam Kitab itu membolehkan kamu mendapat apa sahaja yang kamu pilih?",
                            "verse 68:39": "Atau adakah kamu mendapat akuan-akuan yang ditegaskan dengan sumpah dari Kami, yang tetap hingga hari kiamat, menentukan bahawa kamu dapat mencapai apa yang kamu putuskan?",
                            "verse 68:40": "Bertanyalah kepada mereka: Siapakah orangnya di antara mereka yang menjamin benarnya hukum: Bahawa mereka akan mendapat di akhirat apa yang didapati oleh orang Islam?",
                            "verse 68:41": "Atau adakah mereka mempunyai sekutu-sekutu (yang sefaham dengan mereka? Kalau ada) maka hendaklah mereka membawanya, jika betul mereka orang-orang yang benar.",
                            "verse 68:42": "(Ingatkanlah orang-orang yang tidak beriman) akan masa didedahkan kedahsyatan huru-hara (hari kiamat) dan mereka diseru supaya sujud maka mereka tidak dapat melakukannya;",
                            "verse 68:43": "Sambil pandangan mereka tunduk malu, serta mereka diliputi kehinaan dan sesungguhnya mereka (di dunia) dahulu telahpun diseru supaya sujud (tetapi mereka enggan) sedang mereka dalam keadaan sihat.",
                            "verse 68:44": "Biarkanlah Aku sahaja (wahai Muhammad) dengan orang yang mendustakan keterangan Al-Quran ini, Kami akan menarik mereka sedikit demi sedikit (ke jurang kebinasaan), dari arah yang mereka tidak mengetahuinya.",
                            "verse 68:45": "Dan Aku akan melanjutkan tempoh untuk mereka; sesungguhnya rancangan sulitKu (terhadap golongan yang kufur ingkar itu), amatlah kuat kukuh.",
                            "verse 68:46": "Pernahkah engkau (wahai Muhammad) meminta sebarang bayaran kepada mereka (mengenai ajaran Islam yang engkau sampaikan), lalu mereka merasa berat menanggung bayaran itu (sehingga menjauhkan diri daripada menyahut seruanmu)?",
                            "verse 68:47": "Atau adakah di sisi mereka (Luh Mahfuz yang mengandungi) perkara-perkara yang ghaib lalu mereka menyalin (daripadanya untuk menentang ajaran dan peringatanmu)?",
                            "verse 68:48": "Maka bersabarlah (wahai Muhammad) menerima hukum Tuhanmu (memberi tempoh kepada mereka) dan janganlah engkau bersikap seperti orang yang telah ditelan oleh ikan. (Ingatlah kisahnya) ketika dia berdoa merayu dengan keadaan sesak sebak terkurung dalam perut ikan.",
                            "verse 68:49": "Kalaulah dia tidak didatangi nikmat pertolongan dari Tuhannya, nescaya tercampaklah dia ke tanah yang tandus (di tepi pantai) dalam keadaan dia ditempelak (kerana salah silapnya).",
                            "verse 68:50": "Selepas itu Tuhannya memilihnya, serta menjadikan dia dari orang-orang yang soleh.",
                            "verse 68:51": "Dan sesungguhnya orang-orang yang kafir itu, hampir-hampir menggelincir dan menjatuhkanmu dengan pandangan mereka (yang penuh dengan permusuhan dan kebencian), semasa mereka mendengar Al-Quran sambil berkata: Sebenarnya (Muhammad) itu, sungguh-sungguh orang gila.",
                            "verse 68:52": "Padahal Al-Quran itu tidak lain hanyalah peringatan bagi umat manusia seluruhnya."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "ن، سوگند به قلم و آنچه مينويسند،",
                            "verse 68:2": "كه به نعمت پروردگارت تو مجنون نيستى،",
                            "verse 68:3": "و براى تو پاداشى عظيم و هميشگى است!",
                            "verse 68:4": "و تو اخلاق عظيم و برجسته‏اى دارى!",
                            "verse 68:5": "و بزودى تو مى‏بينى و آنان نيز مى‏بينند،",
                            "verse 68:6": "كه كدام يك از شما مجنونند!",
                            "verse 68:7": "پروردگارت بهتر از هر كس مى‏داند چه كسى از راه او گمراه شده، و هدايت‏يافتگان را نيز بهتر مى‏شناسد!",
                            "verse 68:8": "حال كه چنين است از تكذيب‏كنندگان اطاعت مكن!",
                            "verse 68:9": "آنها دوست دارند نرمش نشان دهى تا آنها (هم) نرمش نشان دهند (نرمشى توام با انحراف از مسير حق)!",
                            "verse 68:10": "و از كسى كه بسيار سوگند ياد مى‏كند و پست است اطاعت مكن،",
                            "verse 68:11": "كسى كه بسيار عيبجوست و به سخن چينى آمد و شد مى‏كند،",
                            "verse 68:12": "و بسيار مانع كار خير، و متجاوز و گناهكار است;",
                            "verse 68:13": "علاوه بر اينها كينه توز و پرخور و خشن و بدنام است!",
                            "verse 68:14": "مبادا بخاطر اينكه صاحب مال و فرزندان فراوان است (از او پيروى كنى)!",
                            "verse 68:15": "هنگامى كه آيات ما بر او خوانده مى‏شود مى‏گويد: «اينها افسانه‏هاى خرافى پيشينيان است! س‏ذللّه",
                            "verse 68:16": "(ولى) ما بزودى بر بينى او علامت و داغ ننگ مى‏نهيم!",
                            "verse 68:17": "ما آنها را آزموديم، همان گونه كه «صاحبان باغ‏» را آزمايش كرديم، هنگامى كه سوگند ياد كردند كه ميوه‏هاى باغ را صبحگاهان (دور از چشم مستمندان) بچينند",
                            "verse 68:18": "و هيچ از آن استثنا نكنند;",
                            "verse 68:19": "اما عذابى فراگير (شب هنگام) بر (تمام) باغ آنها فرود آمد در حالى كه همه در خواب بودند،",
                            "verse 68:20": "و آن باغ سرسبز همچون شب سياه و ظلمانى شد!",
                            "verse 68:21": "صبحگاهان يكديگر را صدا زدند،",
                            "verse 68:22": "كه بسوى كشتزار و باغ خود حركت كنيد اگر قصد چيدن ميوه‏ها را داريد!",
                            "verse 68:23": "آنها حركت كردند در حالى كه آهسته با هم مى‏گفتند:»",
                            "verse 68:24": "«مواظب باشيد امروز حتى يك فقير وارد بر شما نشود!»",
                            "verse 68:25": "(آرى) آنها صبحگاهان تصميم داشتند كه با قدرت از مستمندان جلوگيرى كنند",
                            "verse 68:26": "هنگامى كه (وارد باغ شدند و) آن را ديدند گفتند: «حقا» ما گمراهيم!",
                            "verse 68:27": "(آرى، همه چيز از دست ما رفته) بلكه ما محروميم!»",
                            "verse 68:28": "يكى از آنها كه از همه عاقلتر بود گفت: «آيا به شما نگفتم چرا تسبيح خدا نمى‏گوييد؟!",
                            "verse 68:29": "گفتند: «منزه است پروردگار ما، مسلما ما ظالم بوديم!»",
                            "verse 68:30": "سپس روبه يكديگر كرده به ملامت هم پرداختند،",
                            "verse 68:31": "(و فريادشان بلند شد) گفتند: «واى بر ما كه طغيانگر بوديم!",
                            "verse 68:32": "اميدواريم پروردگارمان (ما را ببخشد و) بهتر از آن به جاى آن به ما بدهد، چرا كه ما به او علاقه‏منديم!»",
                            "verse 68:33": "اين گونه است عذاب (خداوند در دنيا)، و عذاب آخرت از آن هم بزرگتر است اگر مى‏دانستند!",
                            "verse 68:34": "مسلما براى پرهيزگاران نزد پروردگارشان باغهاى پر نعمت بهشت است!",
                            "verse 68:35": "آيا مؤمنان را همچون مجرمان قرار مى‏دهيم؟!",
                            "verse 68:36": "شما را چه مى‏شود؟! چگونه داورى مى‏كنيد؟!",
                            "verse 68:37": "آيا كتابى داريد كه از آن درس مى‏خوانيد",
                            "verse 68:38": "كه آنچه را شما انتخاب مى‏كنيد از آن شماست؟!",
                            "verse 68:39": "يا اينكه عهد و پيمان مؤكد و مستمرى تا روز قيامت بر ما داريد كه هر چه را حكم كنيد براى شما باشد؟!",
                            "verse 68:40": "از آنها بپرس كدام يك از آنان چنين چيزى را تضمين مى‏كند؟!",
                            "verse 68:41": "يا اينكه معبودانى دارند كه آنها را شريك خدا قرار داده‏اند (و براى آنان شفاعت مى‏كنند)؟! اگر راست مى‏گويند معبودان خود را بياورند!",
                            "verse 68:42": "(به خاطر بياوريد) روزى را كه ساق پاها (از وحشت) برهنه مى‏گردد و دعوت به سجود مى‏شوند، اما نمى‏توانند (سجود كنند)",
                            "verse 68:43": "اين در حالى است كه چشمهايشان (از شدت شرمسارى) به زير افتاده، و ذلت و خوارى وجودشان را فراگرفته; آنها پيش از اين دعوت به سجود مى‏شدند در حالى كه سالم بودند (ولى امروز ديگر توانايى آن را ندارند)!",
                            "verse 68:44": "اكنون مرا با آنها كه اين سخن را تكذيب مى‏كنند واگذار! ما آنان را از آنجا كه نمى‏دانند به تدريج به سوى عذاب پيش مى‏بريم",
                            "verse 68:45": "و به آنها مهلت (بازگشت) مى‏دهم; چرا كه نقشه‏هاى من محكم و دقيق است!",
                            "verse 68:46": "يا اينكه تو از آنها مزدى مى‏طلبى كه پرداختش براى آنها سنگين است؟!",
                            "verse 68:47": "يا اسرار غيب نزد آنهاست و آن را مى‏نويسند (و به يكديگر مى‏دهند)؟!",
                            "verse 68:48": "اكنون كه چنين است صبر كن و منتظر فرمان پروردگارت باش، و مانند صاحب ماهى ( يونس) مباش (كه در تقاضاى مجازات قومش عجله كرد و گرفتار مجازات ترك اولى شد) در آن زمان كه با نهايت اندوه خدا را خواند",
                            "verse 68:49": "و اگر رحمت خدا به ياريش نيامده بود، (از شكم ماهى) بيرون افكنده مى‏شد در حالى كه نكوهيده بود!",
                            "verse 68:50": "ولى پروردگارش او را برگزيد و از صالحان قرار داد!",
                            "verse 68:51": "نزديك است كافران هنگامى كه آيات را مى‏شنوند با چشم‏زخم خود تو را از بين ببرند، و مى‏گويند: «او ديوانه است!»",
                            "verse 68:52": "در حالى كه اين () جز مايه بيدارى براى جهانيان نيست!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 68:1": "Nun. Pe calem și pe ceea ce ei scriu!",
                            "verse 68:2": "Tu nu ești, prin mila Domnului tãu, smintit!",
                            "verse 68:3": "Și tu vei avea parte de o rãsplatã neîntreruptã!",
                            "verse 68:4": "Și tu ai o fire minunatã !",
                            "verse 68:5": "Vei vedea tu și vor vedea și ei",
                            "verse 68:6": "Cine dintre voi este smintit.",
                            "verse 68:7": "Domnul tãu știe mai bine cine a rãtãcit de la drumul Sãu și El îi cunoaște mai bine pe cei care sunt bine cãlãuziți.",
                            "verse 68:8": "Deci, nu da ascultare celor ce socot minciunã!",
                            "verse 68:9": "Ei ar dori ca tu sã fii binevoitor și sã fie și ei binevoitori.",
                            "verse 68:10": "Nu da ascultare celui care juruiește întruna și e vrednic de dis- preț ,",
                            "verse 68:11": "Defãimãtor, care umblã cu clevetiri,",
                            "verse 68:12": "Care împiedicã binele , e nelegiuit, pãcãtos,",
                            "verse 68:13": "Crud, și, dupã toate astea, și bastard,",
                            "verse 68:14": "Pentru cã el are avere și copii!",
                            "verse 68:15": "Când i se recitã lui versetele Noastre, el zice: \"Basme ale celor de demult!\"",
                            "verse 68:16": "Noi îi vom face lui un semn pe nas!",
                            "verse 68:17": "Noi i-am încercat pe ei , așa cum i-am încercat pe stãpânii grãdinii, când au jurat sã adune roadele din ea dimineața,",
                            "verse 68:18": "Dar fãrã sã lase nimic necules ,",
                            "verse 68:19": "Și s-a abãtut peste ea o nenorocire de la Domnul tãu, în vreme ce ei dormeau,",
                            "verse 68:20": "Iar dimineața era asemenea unui ogor cules.",
                            "verse 68:21": "Și dimineața s-au strigat ei unii pe alții.",
                            "verse 68:22": "\"Purcedeți devreme la ogoarele voastre, ca sã culegeți !\"",
                            "verse 68:23": "Și au purces ei, zicându-și unul altuia mai mult în șoaptã:",
                            "verse 68:24": "\"Sã nu intre astãzi peste voi, în ea, nici un sãrman!\"",
                            "verse 68:25": "Și au purces devreme, hotãrâți sã-i opreascã, închipuindu-și cã vor fi în stare de aceasta ,",
                            "verse 68:26": "Dar când au vãzut-o, au zis ei:\"Noi suntem cu adevãrat rãtãciți,",
                            "verse 68:27": "Sau, mai degrabã, noi suntem lipsiți [de roadele noastre]!\"",
                            "verse 68:28": "A zis cel mai drept dintre ei : \"Oare nu v-am zis eu sã aduceți mãrire [lui Allah]?\"",
                            "verse 68:29": "Au zis ei: \"Mãrire Domnului nostru! Noi am fost nedrepți!\"",
                            "verse 68:30": "Și s-au îndreptat unul cãtre altul, aducându-și mustrãri.",
                            "verse 68:31": "Și au zis ei: \"Vai de noi! Noi am fost nelegiuiți!",
                            "verse 68:32": "Poate cã Domnul nostru ne va da în schimb [ceva] mai bun decât ea! Noi dorim sã ne apropiem de Domnul nostru!\"",
                            "verse 68:33": "Așa este chinul! Iar chinul din Lumea de Apoi va fi și mai mare! Dacã ei ar ști!",
                            "verse 68:34": "Însã cei evlavioși au la Domnul lor Grãdinile plãcerii.",
                            "verse 68:35": "Oare Noi îi tratãm pe cei supuși [lui Allah] la fel ca pe cei pãcãtoși?!",
                            "verse 68:36": "Ce-i cu voi? Cum judecați?",
                            "verse 68:37": "Sau aveți voi o Carte din care învãțați",
                            "verse 68:38": "Cã veți avea tot ceea ce poftiți?",
                            "verse 68:39": "Sau ați luat de la Noi jurãminte pânã în Ziua Învierii, prin careNe legãm sã vã dãm ceea ce hotãrâți?",
                            "verse 68:40": "Întreabã-i care dintre ei este pentru aceasta chezaș?",
                            "verse 68:41": "Sau au ei asociați? Sã-i aducã pe asociații lor, dacã ei sunt întru adevãr!",
                            "verse 68:42": "Într-o Zi li se va arãta lor o nenorocire și ei vor fi chemați la prosternare, însã nu vor putea .",
                            "verse 68:43": "Plecați vor fi ochii lor și îi va acoperi umilința , pentru cã ei aufost chemați la prosternare , când erau în pace!...",
                            "verse 68:44": "Deci lasã-Mã pe Mine și pe cei ce socotesc mincinoasã aceastã vestire! Noi îi vom trage pe ei treptat, de unde ei nici nu știu .",
                            "verse 68:45": "Eu le dau lor un rãgaz, însã vicleșugul Meu este temeinic!",
                            "verse 68:46": "Sau le ceri lor o rãsplatã și ei sunt împovãrați de datorii?",
                            "verse 68:47": "Sau le știu ei pe cele nevãzute și [din ele] scriu ei?",
                            "verse 68:48": "Deci îndurã cu rãbdare hotãrârea Domnului tãu și nu fi ca tovarãșul peștelui cel mare [Iona], care L-a chemat [pe Allah], când el era plin de mâhnire!",
                            "verse 68:49": "Dacã nu l-ar fi ajuns pe el îndurarea de la Domnul lui , ar fi fost el aruncat pe țãrmul gol și ar fi fost acoperit de rușine.",
                            "verse 68:50": "Însã l-a ales pe el Domnul sãu și l-a așezat pe el printre cei evlavioși .",
                            "verse 68:51": "Aceia care nu cred aproape cã te doboarã cu privirile lor , când aud Îndemnarea , și zic ei: \"El este smintit!\"",
                            "verse 68:52": "Însã El nu este decât o Îndemnare pentru toate lumile!"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 68:1": "Nun. Pe condei şi pe ceea ce scriu ei!",
                            "verse 68:2": "Tu, har Domnului tău, nu eşti îndrăcit!",
                            "verse 68:3": "O răsplată necurmată vei avea!",
                            "verse 68:4": "Tu ai o fire prea-înălţată.",
                            "verse 68:5": "Ai să vezi şi au să vadă,",
                            "verse 68:6": "care dintre voi este apucatul.",
                            "verse 68:7": "Domnul tău îi ştie prea bine pe cei care s-au rătăcit de la Calea Sa, precum îi ştie prea bine pe cei călăuziţi.",
                            "verse 68:8": "Nu da ascultare celor care hulesc.",
                            "verse 68:9": "Ar dori să-i măguleşti, ca şi ei să te măgulească.",
                            "verse 68:10": "Nu da ascultare celui care se tot jură, însă este om de nimic,",
                            "verse 68:11": "şi nici clevetitorului care umblă cu bârfa,",
                            "verse 68:12": "nici celui care se pune în calea binelui, călcător de lege şi păcătos,",
                            "verse 68:13": "nici celui lacom care, pe deasupra, mai este şi lepădat.",
                            "verse 68:14": "Nu-i da ascultare chiar de este avut în bogăţie şi fii.",
                            "verse 68:15": "Când versetele Noastre îi sunt citite, el spune: “Poveşti de-ale celor dintâi!”",
                            "verse 68:16": "Atunci, Noi îl vom însemna pe nas!",
                            "verse 68:17": "Noi îi vom pune la încercare, precum i-am pus pe stăpânii grădinii care juraseră că dimineaţa o vor culege toată,",
                            "verse 68:18": "fără nici o îngrădire.",
                            "verse 68:19": "O urgie de la Domnul tău a trecut peste ea, în vreme ce ei dormeau,",
                            "verse 68:20": "iar dimineaţa, era ca şi culeasă!",
                            "verse 68:21": "Sculându-se de dimneaţă, au început să se strige:",
                            "verse 68:22": "“Plecaţi devreme la ogor, de sunteţi cu adevărat culegători.”",
                            "verse 68:23": "Şi plecară la drum şuşotind între ei:",
                            "verse 68:24": "“Astăzi, nu cumva să intre vreun sărman peste voi!”",
                            "verse 68:25": "Plecară devreme cu aceasta în gând, deşi aveau destul.",
                            "verse 68:26": "Când o văzură, spuseră: “Precis ne-am rătăcit!”",
                            "verse 68:27": "Suntem acum lipsiţi de tot!”",
                            "verse 68:28": "Cel mai cumsecade dintre ei spuse: “Nu v-am spus eu să-l fi preamărit pe Dumnezeu?”",
                            "verse 68:29": "Ei spuseră: “Mărire Domnului nostru! Da, am fost nedrepţi.”",
                            "verse 68:30": "Şi ei se întoarseră atunci unii către alţii dojenindu-se.",
                            "verse 68:31": "Ei spuseră: “Vai nouă! Am fost nişte ticăloşi!",
                            "verse 68:32": "Poate Domnul nostru ne va da nouă în schimb ceva mai bun decât aceasta. Către Domnul nostru noi căutăm.”",
                            "verse 68:33": "Aceasta le-a fost osânda, însă osânda din Viaţa de Apoi va fi mult mai mare. O, dacă ar şti!",
                            "verse 68:34": "Cei care se tem de Dumnezeu au, la Domnul lor, Grădinile Plăcerii.",
                            "verse 68:35": "Cum să-i facem pe cei supuşi deopotrivă cu cei nelegiuiţi?",
                            "verse 68:36": "Ce aveţi? Cum judecaţi?",
                            "verse 68:37": "Aveţi vreo carte din care învăţaţi?",
                            "verse 68:38": "Din care aveţi ce alege?",
                            "verse 68:39": "Ori aveţi jurăminte de la Noi care ajung până în Ziua Învierii că veţi avea ceea ce judecaţi voi?",
                            "verse 68:40": "Întreabă-i: “Care, dintre voi, este chezaş?”",
                            "verse 68:41": "Au dumnezei-părtaşi? Să vină cu părtaşii lor, dacă spun adevărul.",
                            "verse 68:42": "În Ziua când picioarele vor fi dezgolite, vor fi chemaţi să se prosterneze, însă nu vor mai putea.",
                            "verse 68:43": "Îşi vor lăsa privirile în jos şi vor fi acoperiţi de ruşine, căci au fost chemaţi să se prosterneze pe când erau sănătoşi.",
                            "verse 68:44": "Lasă-Mă cu cel care socoate mincinoasă această Spusă, Noi îl vom duce din treaptă în treaptă pe unde nici nu ştie!",
                            "verse 68:45": "Eu le mai dau un răgaz. Vicleşugul meu este fără greş!",
                            "verse 68:46": "Le ceri tu vreo răsplată? Atunci ar fi împovăraţi de datorii strivitoare.",
                            "verse 68:47": "Ori sunt ei atât de aproape de Taină încât scriu!",
                            "verse 68:48": "Rabdă întru judecata Domnului tău şi nu fi ca Omul din peşte care striga pe când se înăbuşea!",
                            "verse 68:49": "Dacă un har de la Domnul său nu l-ar fi ajuns, ar fi fost aruncat ca un blestemat pe pământul gol.",
                            "verse 68:50": "Domnul său l-a ales şi l-a făcut dintre cei drepţi.",
                            "verse 68:51": "Tăgăduitorii mai că te străpung cu privirea când aud amintirea şi spun: “Cu adevărat este îndrăcit!”",
                            "verse 68:52": "Aceasta nu este însă decât o amintire pentru lumi!"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Ну–н2254.Клянусь пером и тем, что они пишут!",
                            "verse 68:2": "По милости Владыки твоегоТы, (Мухаммад), неодержим",
                            "verse 68:3": "И для тебя назначены дары2255,Поистине, неистощимы",
                            "verse 68:4": "И нрав возвышенный тебе (дарован).",
                            "verse 68:5": "Увидишь ты,Увидят и они —",
                            "verse 68:6": "Которые из вас поражены безумьем.",
                            "verse 68:7": "Поистине, Господь твой знает лучше,Которые из вас сошли с Его пути,И лучше знает тех, кто следует Егодорогой.",
                            "verse 68:8": "А потому ты не прислушивайся к тем,Кто ложью нарекает (Откровениясвятые).",
                            "verse 68:9": "Они хотят, чтоб ты был болееуступчив, —Тогда бы и они с тобою были мягче.",
                            "verse 68:10": "Не следуй всякому презренномулюбителю поклясться,",
                            "verse 68:11": "Клеветнику, носителю злословья,",
                            "verse 68:12": "Погрязшему в грехах и злодеяньяхИ отвлекающему от благого,",
                            "verse 68:13": "Жестокому, безродному к тому ж,",
                            "verse 68:14": "Будь у него большое достояньеи (много) сыновей.",
                            "verse 68:15": "Когда ему Послание от Нас читают,Он отвечает: «Это сказы первых!»",
                            "verse 68:16": "Наложим Мы узду на его нос!",
                            "verse 68:17": "Мы точно так же испытали их2256,Как испытали Мы владельцев сада,Когда они, (забыв про оговорку),поклялись,Что поутру плоды все срежут,",
                            "verse 68:18": "Не сделав в этом оговорки(На часть плодов, что беднымнадлежит отдать).",
                            "verse 68:19": "Когда же были в сон они погружены,На сад со всех сторон от Бога твоегообрушилась погибель.",
                            "verse 68:20": "Наутро сад весь черным стал,как будто был он срезан.",
                            "verse 68:21": "А поутру, созвав друг друга,(Братья) говорили:",
                            "verse 68:22": "«Коль урожай собрать хотите,Вы ранним утром в сад должныпойти».",
                            "verse 68:23": "И вот отправились они,Переговариваясь потихоньку:",
                            "verse 68:24": "«Пусть ни один бедняк (презренный)В наш сад сегодня не войдет».",
                            "verse 68:25": "И шли они с решеньем (твердым)(Свой замысел) осуществить.",
                            "verse 68:26": "Едва завидев сад,(В отчаянье) воскликнули они:«Поистине, сошли мы с верного пути!",
                            "verse 68:27": "Теперь и мы уж лишены(Плодов всех нашего труда)».",
                            "verse 68:28": "И тут один из них, кто был разумнеедругих,Сказал: «Ужель я вам не говорил,Что славить вы должны Аллаха?»",
                            "verse 68:29": "«Да будет славен наш Господь! —они сказали. —Поистине, неправыми мы были!»",
                            "verse 68:30": "И стали упрекать они друг друга,",
                            "verse 68:31": "Говоря: «О, горе нам!Мы были нарушителями (Божьейволи).",
                            "verse 68:32": "Быть может, наш ГосподьНам сад в замену даст ещепрекрасней, —Ведь мы к Нему пришли (в раскаяниидобром)!»",
                            "verse 68:33": "Вот наказание (в сей жизни),В другой же жизни — наказаниееще страшней.О, если б они только знали!",
                            "verse 68:34": "Поистине, Сады услады ждут людей,Кто гнева Божьего страшится.",
                            "verse 68:35": "Ужель Мы равно отнесемсяИ к мусульманам, и к неверным?",
                            "verse 68:36": "Что с вами?И на чем вы строите свои сужденья?",
                            "verse 68:37": "Ужель у вас имеется какая-либо книга,Что учит вас (сужденьям этим),",
                            "verse 68:38": "И в ней для вас, поистине, все то,Что пожелаете избрать себе(на случай)?",
                            "verse 68:39": "Ужель вы заключили договор,Скрепленный Нашей клятвой,Что вплоть до Воскресения (на Суд)Решение всех дел, поистине,останется за вами?",
                            "verse 68:40": "Спроси же их: которые из нихГотовы послужить порукой в этом?",
                            "verse 68:41": "Иль есть у них другие божества?Так пусть они представят их,Если они в словах своих правдивы.",
                            "verse 68:42": "В тот День,Когда откроются (все) не’дуги2257(земли,Что люди возвели себе в угоду),И призовут их (Господу в молитве)поклониться,А этого они не смогут сделать2258,",
                            "verse 68:43": "Потупленными будут взоры их,Позор их (с головы до ног) покроет.А ведь к (молитвенным) поклонамИ раньше призывали их,И пребывали в (полном) здравииони —(И все же отказались).",
                            "verse 68:44": "А потому Меня оставьте с глазуна глаз с теми,Кто эту (Книгу) ложью нарекает.Подвергнем Мы их наказаниямс таких сторон,О коих нет у них малейшихпредставлений.",
                            "verse 68:45": "Я дам отсрочку им,Но замысел мой тверд и неминуем.",
                            "verse 68:46": "Иль ты награды ждешь от них, —Они ж отягчены долгами?",
                            "verse 68:47": "Иль в их руках Незримое лежит,О коем они могут записи вести?",
                            "verse 68:48": "А потому ты терпеливо жди указатвоего ВладыкиИ человеку в рыбе2259 не уподобляйся,Когда в страданиях он к Господувоззвал.",
                            "verse 68:49": "Ведь если б на него не снизошлоВеликодушие его Владыки,Он был бы на пустынный берегвыброшен с позором.",
                            "verse 68:50": "Тогда его Господь избрал егоИ праведником ввел (в назначенноебратство).",
                            "verse 68:51": "Неверные же взорами своими,Заслышав чтение послания сего,Тебя стараются сбить с толкуИ говорят: «Он явно одержим!»",
                            "verse 68:52": "Сие2260, поистине, не что иное,Как Напоминание мирам!"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "n. ¡Por el cálamo y lo que escriban!",
                            "verse 68:2": "¡Por la gracia de tu Señor, que tú no eres un poseso!",
                            "verse 68:3": "Tendrás, ciertamente, una recompensa ininterrumpida.",
                            "verse 68:4": "Eres, sí, de eminente carácter.",
                            "verse 68:5": "Tú verás y ellos verán",
                            "verse 68:6": "quién de vosotros es el tentado.",
                            "verse 68:7": "Tu Señor sabe mejor que nadie quiénes se extravían de Su camino y sabe mejor que nadie quiénes siguen la buena dirección.",
                            "verse 68:8": "¡No obedezcas, pues, a los desmentidores!",
                            "verse 68:9": "Desearían que fueras condescendiente, para serlo ellos también.",
                            "verse 68:10": "¡No obedezcas a ningún vil jurador.",
                            "verse 68:11": "al pertinaz difamador, que va sembrando calumnias,",
                            "verse 68:12": "a quien impide el bien, al violador de la ley, al pecador,",
                            "verse 68:13": "al arrogante y, encima, bastardo,",
                            "verse 68:14": "so pretexto de poseer hacienda e hijos varones!",
                            "verse 68:15": "Cuando se le recitan Nuestras aleyas, dice: «¡Patrañas de los antiguos!»",
                            "verse 68:16": "¡Le marcaremos en el hocico!",
                            "verse 68:17": "Les hemos probado como probamos a los dueños del jardín. Cuando juraron que cogerían sus frutos por la mañana,",
                            "verse 68:18": "sin hacer salvedad.",
                            "verse 68:19": "Mientras dormían, cayó sobre él un azote enviado por tu Señor",
                            "verse 68:20": "y amaneció como si hubiera sido arrasado.",
                            "verse 68:21": "Por la mañana, se llamaron unos a otros:",
                            "verse 68:22": "«¡Vamos temprano a nuestro campo, si queremos coger los frutos!»",
                            "verse 68:23": "Y se pusieron en camino, cuchicheando:",
                            "verse 68:24": "«¡Ciertamente, hoy no admitiremos a ningún pobre!»",
                            "verse 68:25": "Marcharon, pues, temprano, convencidos de que serían capaces de llevar a cabo su propósito.",
                            "verse 68:26": "Cuando lo vieron, dijeron: «¡Seguro que nos hemos extraviado!",
                            "verse 68:27": "¡No, se nos ha despojado!»",
                            "verse 68:28": "El más moderado de ellos dijo: «¿No os lo había dicho? ¿Por qué no glorificáis?»",
                            "verse 68:29": "Dijeron: «¡Gloria a nuestro Señor! ¡Hemos obrado impíamente!»",
                            "verse 68:30": "Y pusiéronse a recriminarse.",
                            "verse 68:31": "Dijeron: «¡Ay de nosotros, que hemos sido rebeldes!",
                            "verse 68:32": "Quizá nos dé nuestros Señor, a cambio, algo mejor que éste. Deseamos ardientemente a nuestro Señor».",
                            "verse 68:33": "Tal fue el castigo. Pero el castigo de la otra vida es mayor aún. Si supieran...",
                            "verse 68:34": "Los que temen a Alá tendrán, junto a su Señor. los jardines de la Delicia.",
                            "verse 68:35": "¿Vamos, pues, a tratar igual a los que se someten a Alá que a los pecadores?",
                            "verse 68:36": "¿Qué os pasa? ¿Qué manera de juzgar es ésa?",
                            "verse 68:37": "¿O es que disponéis de una Escritura para estudiar?",
                            "verse 68:38": "Tendríais en ella lo que deseáis.",
                            "verse 68:39": "¿O es que nos atan a vosotros juramentos que nos obligan hasta el día de la Resurrección? Obtendríais lo que juzgarais.",
                            "verse 68:40": "Pregúntales quién responde de ello.",
                            "verse 68:41": "¿O es que tienen asociados? Pues, ¡que traigan a sus asociados, si es verdad lo que dicen!",
                            "verse 68:42": "El día que las cosas se pongan mal y sean invitados a prosternarse, no podrán.",
                            "verse 68:43": "Abatida la mirada, cubiertos de humillación, porque fueron invitados a prosternarse cuando aún estaban en seguridad...",
                            "verse 68:44": "¡Déjame a solas con quienes desmienten este discurso! Les conduciremos paso a paso, sin que sepan cómo.",
                            "verse 68:45": "Les concedo una prórroga. ¡Mi estratagema es segura!",
                            "verse 68:46": "¿O es que les reclamas un salario tal que se vean abrumados de deudas?",
                            "verse 68:47": "¿O es que conocen lo oculto y toman nota?",
                            "verse 68:48": "Espera, pues, paciente la decisión de tu Señor y no hagas como el del pez, cuando clamó en medio de la angustia.",
                            "verse 68:49": "Si no llega a alcanzarle una gracia de su Señor, habría sido arrojado a una costa desnuda, reprobado.",
                            "verse 68:50": "Pero su Señor le escogió y le hizo de los justos.",
                            "verse 68:51": "Poco les falta a los infieles, cuando oyen la Amonestación, para clavar en ti su mirada. Y dicen: «¡Sí, es un poseso!»",
                            "verse 68:52": "Pero no es sino una amonestación dirigida a todo el mundo."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "நூன், எழுதுகோல் மீதும் இன்னும் (அதன் மூலம்) அவர்கள் எழுதுவதின் மீதும் சத்தியமாக!",
                            "verse 68:2": "உம்முடைய இறைவன் அருட்கொடையால், நீர் பைத்தியக்காரர் அல்லர்.",
                            "verse 68:3": "இன்னும், உமக்குக் குறைவே இல்லாத நற்கூலி நிச்சயமாக இருக்கிறது.",
                            "verse 68:4": "மேலும், (நபியே) நிச்சயமாக நீர் மிக உயர்ந்த மகத்தான நற்குணம் உடையவராக இருக்கின்றீர்.",
                            "verse 68:5": "எனவே, வெகு சீக்கிரத்தில் நீரும் பார்ப்பீர்; அவர்களும் பார்ப்பார்கள்.",
                            "verse 68:6": "உங்களில் எவர் (பைத்தியமென்னும் நோயால்) சோதனைக்குள்ளாக்கப்பட்டவர் என்பதை.",
                            "verse 68:7": "உம்முடைய இறைவன் அவனுடைய வழியை விட்டுத் தவறியவர்கள் யார் என்பதை நிச்சயமாக நன்கறிவான்; (அது போன்றே) நேர்வழி பெற்றோரையும் அவன் நன்கறிவான்.",
                            "verse 68:8": "எனவே, (சன்மார்க்கத்தைப்) பொய்ப்பிப்பவர்களுக்கு நீர் வழிபடாதீர்.",
                            "verse 68:9": "(சன்மார்க்க போதனையை) நீர் தளர்த்தினால், தாங்களும் தளர்ந்து போகலாம் என்று அவர்கள் விரும்புகின்றனர்.",
                            "verse 68:10": "அன்றியும், இழிவானவனான அதிகம் சத்தியம் செய்யும் ஒவ்வொருவனுக்கும் நீர் வழிபடாதீர்;",
                            "verse 68:11": "(அத்தகையவன்) குறைகூறித்திரிபவன், கோள் சொல்லிக் கொண்டு நடப்பவன்.",
                            "verse 68:12": "(எப்பொழுதும்) நன்மையானவற்றைத் தடுத்துக் கொண்டிருப்பவன், வரம்பு மீறிய பெரும் பாவி.",
                            "verse 68:13": "கடின சித்தமுடையவன், அப்பால் இழி பிறப்புமுடையவன்.",
                            "verse 68:14": "பெரும் செல்வமும், (பல) ஆண் மக்களும் உள்ளவனாக அவனிருப்பதால்",
                            "verse 68:15": "நம் வசனங்கள் அவனிடம் ஓதப்பட்டால், \"இவை முன்னோர்களின் கட்டுக்கதைகள்\" என்று அவன் கூறுகின்றான்.",
                            "verse 68:16": "விரைவிலேயே அவனுடைய மூக்கின் மீது அடையாளமிடுவோம்.",
                            "verse 68:17": "நிச்சயமாக நாம் தோட்டமுடையவர்களைச் சோதித்தது போலவே, நாம் அவர்களைச் சோதித்தோம். அ(த் தோட்;டத்திற்குடைய)வர்கள் அதிலுள்ள கனிகளை அதிகாலையில் சென்று பறித்து விடுவோமென்று சத்தியம் செய்தார்கள்.",
                            "verse 68:18": "அல்லாஹ் நாடினால் என்று அவர்கள் கூறவில்லை,",
                            "verse 68:19": "எனவே, அவர்கள் தூங்கிக் கொண்டிருந்த போது உம் இறைவனிடமிருந்து சுற்றக் கூடிய (நெருப்பின் ஆபத்)து சுற்றி(த் தோட்டத்தை) அழித்து விட்டது.",
                            "verse 68:20": "(நெருப்புக் கரித்து விட்ட படியால் அத்தோட்டம்) காலையில் கருத்த சாம்பலைப் போல் ஆயிருந்தது.",
                            "verse 68:21": "(இது அறியாது) காலையில் எழுந்த அவர்கள் ஒருவரை ஒருவர் அழைத்தனர்.",
                            "verse 68:22": "\"நீங்கள் (விளைந்த) கனிகளைக் கொய்பவர்களாக இருந்தால் உங்கள் தோட்டத்திற்கு அதிகாலையில் செல்லுங்கள்\" (என்று கூறிக் கொண்டனர்).",
                            "verse 68:23": "எனவே அவர்கள் (பிறர் அறியாது) மெதுவாகப் பேசிக் கொண்டு சென்றனர்,",
                            "verse 68:24": "\"எந்த ஏழை எளியவரும் இன்று உங்களிடம் அ(த் தோட்டத்)தில் நிச்சயமாக பிரவேசிக்கக் கூடாது\" (என்று).",
                            "verse 68:25": "உறுதியுடன் சக்தியுடையவர்களாக காலையில் சென்றனர்.",
                            "verse 68:26": "ஆனால், அவர்கள் அதை (தோட்டத்தை அழிந்து போன நிலையில்) கண்ட போது: \"நிச்சயமாக நாம் வழி தவறி (வேறு தோட்டத்திற்கு) வந்து விட்டோம்\" என்று கூறினார்கள்.",
                            "verse 68:27": "(பின்னர் கவனித்துப் பார்த்துவிட்டு) \"இல்லை! (ஏழை எளியோர்க்கு எதுவும் கிடைக்காமற் செய்து) நாம் தாம் பாக்கியம் இழந்தவர்களாக ஆகிவிட்டோம்\" (என்றும் கூறிக்கொண்டனர்.)",
                            "verse 68:28": "அவர்களில் நடுநிலையுள்ள ஒருவர் \"நீங்கள் தஸ்பீஹு செய்திருக்க வேண்டும் என்று நான் உங்களுக்கு கூறவில்லையா?\" என்று கூறினார்.",
                            "verse 68:29": "\"எங்கள் இறைவன் தூயவன், நாம் தாம் நிச்சமயாக அநியாயம் செய்தவர்கள் ஆகிவிட்டோம்\" என்றும் கூறினர்.",
                            "verse 68:30": "பின்னர், அவர்களில் சிலர் சிலரை நிந்தித்தவர்களாக முன்னோகினர்.",
                            "verse 68:31": "அவர்கள் கூறினார்கள்: \"எங்களுக்குண்டான கேடே! நிச்சயமாக நாம் வரம்பு மீறியவர்களாக இருந்தோம்.",
                            "verse 68:32": "\"எங்களுடைய இறைவன் இதைவிட மேலானதை எங்களுக்கு மாற்றித் தரக்கூடும், நாங்கள் (தவ்பா செய்து) நிச்சயமாக எங்களுடைய இறைவன் மீதே ஆதரவு வைக்கிறோம்\" (எனக் கூறினர்).",
                            "verse 68:33": "இவ்வாறுதான் (இவ்வுலக) வேதனை வருகிறது, அவர்கள் அறிந்து கொள்வார்களானால் மறுமையின் வேதனை (இதைவிட) மிகவும் பெரிது (என உணர்ந்து சன்மார்க்கத்தின் பால் திரும்புவார்கள்).",
                            "verse 68:34": "நிச்சயமாக, பயபக்தியுடையோருக்கு, அவர்களுடைய இறைவனிடத்தில் (பாக்கியமுடைய) சுவனச் சோலைகள் உண்டு.",
                            "verse 68:35": "நாம் முஸ்லிம்களை, (பாவம் செய்யும்) குற்றவாளிகளைப் போல் ஆக்குவோமா?",
                            "verse 68:36": "(சத்தியத்தை நிராகரிப்போரே! உங்களுக்கு என்ன நேர்ந்தது? (இரு சாராரும் சமமென) எவ்வாறு நீங்கள் தீர்ப்புச் செய்கிறீர்கள்?",
                            "verse 68:37": "அல்லது உங்களிடம் ஏதாவது வேத(ஆதார)ம் இருக்கின்றதா? அதில் நீங்கள் படித்திருக்கின்றீர்களா?",
                            "verse 68:38": "நிச்சயமாக நீங்கள் உங்களுக்காகத் தெரிந்தெடுத்துக் கொள்வதுவே (சரி) என்று அதில் இருக்கின்றதா,",
                            "verse 68:39": "அல்லது, நீங்கள் தீர்ப்புச் செய்து கொள்வதெல்லாம் கியாம நாள் வரை உங்களுக்கு நிச்சயமாகக் கிடைத்துக் கொண்டிருக்கும் என்று நம் உறுதி பிரமாணங்கள் உங்களிடம் இருக்கின்றனவா?",
                            "verse 68:40": "(அவ்வாறெனில்) அவர்களில் எவர் அதற்குப் பொறுப்பேற்பவர் என்பதை (நபியே!) நீர் அவர்களிடம் கேட்பீராக.",
                            "verse 68:41": "அல்லது (பொறுப்பேற்க) அவர்களுக்கு இணை வைக்கும் கூட்டாளிகள் தாம் இருக்கின்றார்களா? அவ்வாறாயின், அவர்கள் உண்மையாளர்களாக இருந்தால் அவர்களுடைய கூட்டாளிகளைக் கொண்டு வரட்டும்.",
                            "verse 68:42": "கெண்டைக் காலை விட்டு (திரை) அகற்றப்படும் நாளில் ஸுஜூது செய்யுமாறு (மக்கள்) அழைக்கப்படும் நாளில், (இவ்வுலகில் மாறு செய்த) அவர்கள் அதற்கும் இயலாதிருப்பார்கள்.",
                            "verse 68:43": "அவர்களுடைய பார்வைகள் கீழ் நோக்கியவையாக இருக்கும்நிலையில் இழிவு அவர்களை மூடிக் கொள்ளும்; அவர்களோ (உலகில்) திடமாக இருந்த போது, ஸுஜூது செய்யுமாறு அழைக்கப்பட்டுக் கொண்டுதானிருந்தனர். (ஆனால் அப்போது அலட்சியமாக இருந்தனர்.)",
                            "verse 68:44": "எனவே, என்னையும், இந்தச் செய்தியைப் பொய்யாக்குவோரையும் விட்டு விடுவீராக! அவர்களே அறியாத விதத்தில் படிப்படியாகப் பிடிப்போம்.",
                            "verse 68:45": "அன்றியும், நான் அவர்களுக்கு அவகாசம் கொடுப்பேன், நிச்சயமாக என் திட்டமே உறுதியானது.",
                            "verse 68:46": "நீர் அவர்களிடம் ஏதாவது கூலிகேட்டு, அதனால் அவர்களுக்கு கடன் சுமை ஏற்பட்டு விட்டதா?",
                            "verse 68:47": "அல்லது மறைவான விஷயங்கள் (எழுதப்படும் ஏடு) அவர்களிடம் இருந்து (அதில்) அவர்கள் எழுதுகின்றார்களா?",
                            "verse 68:48": "ஆகவே, உம்முடைய இறைவனின் கட்டளைக்காக (நபியே!) நீர் பொறுத்திருப்பீராக, மீனுடையவரைப் போன்று (அவசரப்பட்டவர்) ஆகிவிடவேண்டாம், அவர் துன்பம் நிறைந்தவராகத் (தன் இறைவனை) அழைத்தபோது:",
                            "verse 68:49": "அவருடைய இறைவனிடமிருந்து அருள் கொடை அவரை அடையாதிருந்தால், அவர் பழிக்கப்பட்டவராக வெட்டவெளியில் எறியப்பட்டிருப்பார்.",
                            "verse 68:50": "ஆனால், அவருடைய இறைவன், அவரைத் தேர்ந்தெடுத்து, அவரை ஸாலிஹானவர்களில் - நல்லவர்களில் நின்றும் ஆக்கினான்.",
                            "verse 68:51": "மேலும், எவர்கள் நிராகரிக்கின்றார்களோ அவர்கள் நல்லுபதேசத்தை (குர்ஆனை) கேட்கும் போது, தங்களுடைய பார்வைகளால் உம்மை வீழ்த்திட நெருங்குகிறார்கள்; \"நிச்சயமாக அவர் பைத்தியக்காரர்\" என்றும் கூறுகின்றனர்.",
                            "verse 68:52": "ஆனால் அது (குர்ஆன்) அகிலத்தார் அனைவருக்குமே நல்லுபதேசயேன்றி வேறில்லை."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "นูน ขอสาบานด้วยปากกา และสิ่งที่พวกเขาขีดเขียน",
                            "verse 68:2": "ด้วยความโปรดปรานแห่งพระเจ้าของเจ้า เจ้ามิได้เป็นผู้เสียสติ",
                            "verse 68:3": "และแท้จริงสำหรับเจ้านั้นมีรางวัลอย่างมิขาดสาย",
                            "verse 68:4": "และแท้จริง เจ้านั้นอยู่บนคุณธรรมอันยิ่งใหญ่",
                            "verse 68:5": "แล้วเจ้าจะได้เห็นและพวกเขาก็จะได้เห็น",
                            "verse 68:6": "ว่าผู้ใดในหมู่พวกเจ้าคือผู้วิกลจิริต",
                            "verse 68:7": "แท้จริงพระเจ้าของเจ้านั้นพระองค์ทรงรู้ดียิ่งถึงผู้ที่หลงจากทางของพระองค์ และพระองค์ทรงรู้ดียิ่งถึงผู้ที่อยู่ในแนวทางที่ถูกต้อง",
                            "verse 68:8": "ดังนั้นเจ้าอย่าได้ปฏิบัติตามบรรดาผู้ปฏิเสธเลย",
                            "verse 68:9": "พวกเขาใคร่ที่จะเห็นว่า หากเจ้าอ่อนข้อ แล้วพวกเขาก็จะอ่อนข้อตาม",
                            "verse 68:10": "และเจ้าอย่าปฏิบัติตามทุกคนที่เป็นนักสาบานที่ต่ำช้า",
                            "verse 68:11": "ผู้นินทาตระเวนใส่ร้ายผู้อื่น",
                            "verse 68:12": "ผู้ขัดขวางการทำความดี ผู้อธรรมทำร้ายบาปหนา",
                            "verse 68:13": "เป็นคนหยาบคายเลวทราม ยิ่งกว่านั้นยังเป็นคนต่ำช้าแปลกปลอม",
                            "verse 68:14": "โดยถือว่าเขาเป็นผู้มีทรัพย์สินและมีบุตรหลานมาก",
                            "verse 68:15": "เมื่ออายาต (อัลกุรอาน) ทั้งหลายของเราถูกสาธยายแก่เขา เขากล่าวว่าเป็นนิยายเหลวไหลสมัยก่อน",
                            "verse 68:16": "เราจะตีตราเขาบนปลายจมูก",
                            "verse 68:17": "แท้จริงเราได้ทดสอบพวกเขา ดั่งเช่นที่เราได้ทดสอบบรรดาเจ้าของสวน เมื่อพวกเขาสาบานว่าจะเก็บเกี่ยวผลของมันในยามรุ่ง",
                            "verse 68:18": "และพวกเขามิได้กล่าวคำว่า อินชาอัลลอฮ์",
                            "verse 68:19": "ดังนั้น การลงโทษจากพระเจ้าของเจ้าก็ได้มาทำลายสวนนั้น ขณะที่พวกเขากำลังนอนหลับอยู่",
                            "verse 68:20": "ครั้นในตอนเช้า มันก็กลายเป็นเช่นถูกตัดอย่างราบเรียบ",
                            "verse 68:21": "ดังนั้นพวกเขาจึงกู่ตะโกนให้ตื่นแต่เช้าตรู่",
                            "verse 68:22": "จงเข้าไปในสวนของพวกท่านในตอนเช้าตรู่เถิด หากพวกท่านต้องการจะเก็บผลไม้",
                            "verse 68:23": "แล้วพวกเขาพากันออกไป แล้วพวกเขาพูดกระซิบซึ่งกันและกันอย่างเบา ๆ",
                            "verse 68:24": "ว่า วันนี้อย่าได้ให้คนยากจนขัดสนสักคนหนึ่ง เข้าไปหาพวกท่านในสวนนั้น",
                            "verse 68:25": "และพวกเขาก็ได้ออกไปแต่เช้า ตั้งใจว่าจะเก็บผลไม้ให้หมดก่อนที่ยากจนจะเข้าไปในสวน",
                            "verse 68:26": "ครั้นเมื่อพวกเขาเห็นสวน (อยู่ในสภาพที่ถูกทำลาย) พวกเขาก็กล่าวขึ้นว่าแท้จริงพวกเราหลงทางเสียแล้ว",
                            "verse 68:27": "(บางคนกล่าวว่า) เปล่าดอก พวกเราถูกหวงห้ามสิทธิ์เสียแล้ว",
                            "verse 68:28": "คนที่มีสติปัญญาคนหนึ่งในหมู่พวกเขากล่าวว่า ฉันมิได้บอกพวกท่านดอกหรือว่า ทำไม่พวกท่านจึงไม่กล่าวสดุดีแด่อัลลอฮ์",
                            "verse 68:29": "พวกเขาจึงกล่าวว่า มหาบริสุทธิ์แห่งพระเจ้าของเรา แท้จริงเรานั้นเป็นผู้อธรรม",
                            "verse 68:30": "แล้วบางคนในหมู่พวกเขาก็หันไปต่อว่าซึ่งกันแล้วกัน",
                            "verse 68:31": "พวกเขากล่าวว่าความหายนะประสบแก่เราแล้วเพราะเราเป็นผู้ละเมิดฝ่าฝืน",
                            "verse 68:32": "บางทีพระเจ้าของเรา จะทรงเปลี่ยนแปลงสิ่งที่ดีกว่าให้แก่เรา แท้จริงเราหวังในความอภัยต่อพระเจ้าของเรา",
                            "verse 68:33": "เช่นนั้นแหละการลงโทษ และแน่นอนการลงโทษในปรโลกนั้นยิ่งใหญ่นัก หากพวกเขาล่วงรู้",
                            "verse 68:34": "แท้จริง สำหรับบรรดาผู้ยำเกรง ณ ที่พระเจ้าของพวกเขานั้นคือสวนสวรรค์หลากหลายแห่งบรมสุข",
                            "verse 68:35": "ดังนั้นจะให้เราปฏิบัติแก่บรรดาผู้นอบน้อมเสมือนกับเราปฏิบัติแก่บรรดาผู้กระทำผิดกระนั้นหรือ ?",
                            "verse 68:36": "เกิดอะไรขึ้นแด่พวกเจ้า ? ทำไมพวกเจ้าจึงตัดสินเช่นนั้น",
                            "verse 68:37": "หรือว่าที่พวกเจ้ามีคัมภีร์ไว้สำหรับอ่าน ?",
                            "verse 68:38": "ซึ่งในคัมภีร์นั้นมีสิ่งสำหรับพวกเจ้าที่พวกเจ้าจะเลือกเอาได้",
                            "verse 68:39": "หรือว่าพวกเจ้าสัญญาผูกพันกับเราจนกระทั่งถึงวันกิยามะฮ์ว่า แท้จริงสำหรับพวกเจ้านั้นจำได้ตามที่พวกเจ้าตัดสินเอาไว้",
                            "verse 68:40": "มุฮัมมัดจงถามพวกเขาดูว่า คนใดในหมู่พวกเขาจะเป็นหัวหน้าในการตัดสินเรื่องนั้น",
                            "verse 68:41": "หรือว่าพวกเขามีหุ้นส่วนกับอัลลอฮ์ก็จงให้พวกเขานำหุ้นส่วนเหล่านั้นของพวกเขามา ถ้าหากพวกเขาสัตย์จริง",
                            "verse 68:42": "วันที่น้าแข้งจะถูกเลิกขึ้น (ในวันกิยามะฮ์ พระเจ้าจะมาตัดสินคดี หน้าแข้งของพระองค์จะถูกเลิกขึ้น) และพวกเขาจะถูกเรียกให้มาสุญูด แต่พวกเขาไม่สามารถจะสุญูดได้",
                            "verse 68:43": "สายตาของพวกเขาจะละห้อย ความต่ำต้อยจะปกคลุมพวกเขา และแน่นอนพวกเขาเคยถูกเรียกให้มาสุญูดแล้วขณะที่พวกเขายังอยู่ในสภาพที่ปลอดภัยดี",
                            "verse 68:44": "ดังนั้นจงปล่อยให้ข้าเถิด สำหรับผู้ที่ปฏิเสธต่ออัลกุรอาน เราจะนำพวกเขาลงสู่ (การลงโทษ) ทีละขั้น โดยที่พวกเขาไม่รู้",
                            "verse 68:45": "และข้าจะประวิงเวลาให้แก่พวกเขาแท้จริงอุบายของข้านั้นแข็งแรงนัก",
                            "verse 68:46": "หรือว่าเจ้าได้ขอค่าตอบแทนจากพวกเขา ดังนั้นพวกเขาจึงแบกภาระหนักเพราะมีหนี้",
                            "verse 68:47": "หรือว่าพวกเขารู้ในสิ่งเร้นลับ แล้วพวกเขาก็บันทึกเอาไว้",
                            "verse 68:48": "ดังนั้น เจ้า (มุฮัมมัด) จงอดทนต่อไปเถิดต่อบัญชาของพระเจ้าของเจ้า และอย่าเป็นดั่งเช่นเจ้าของปลา (นบียูนุส) ขณะที่เขาวิงวอนเขาอยู่ในสภาพที่ระทมทุกข์",
                            "verse 68:49": "หากมิใช่เพราะความเมตตาจากพระเจ้าของเขามีมายังเขาแล้ว เขาคงถูกเหวี่ยงไปยังที่โล่งเตียน และเขาจะถูกตำหนิด้วย",
                            "verse 68:50": "แต่พระเจ้าของเขาได้ทรงคัดเลือกเขา และทรงทำให้เขาอยู่ในหมู่ผู้กระทำความดี",
                            "verse 68:51": "และบรรดาผู้ปฏิเสธศรัทธานั้นแทบจะทำให้สายตาของพวกเขาจ้องเขม็งไปยังเจ้า เมื่อพวกเขาได้ยินอัลกุรอานพวกเขาก็กล่าวว่าแท้จริงเขาเป็นคนบ้าแน่ ๆ",
                            "verse 68:52": "แต่อัลกุรอานนั้นมิใช่อื่นใดนอกจากเป็นข้อตักเตือนแก่ประชาชาติทั้งหมด"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Nûn. Kaleme ve (kalem tutanların) yazdıklarına andolsun ki,",
                            "verse 68:2": "[68.2]Sen -Rabbinin nimeti sayesinde- mecnun değilsin.",
                            "verse 68:3": "Hiç şüphesiz senin için bitip tükenmeyen bir mükâfat vardır.",
                            "verse 68:4": "Ve sen elbette yüce bir ahlâk üzeresin.",
                            "verse 68:5": "(Sen de) göreceksin, onlar da görecekler,",
                            "verse 68:6": "Hanginizde delilik olduğunu yakında .",
                            "verse 68:7": "Doğrusu Rabbin, kendi yolundan sapan kişiyi en iyi bilendir, hidayete erenleri de en iyi bilen O'dur.",
                            "verse 68:8": "O halde, (hakikati) yalan sayanlara boyun eğme!",
                            "verse 68:9": "Onlar isterler ki, sen yumuşak davranasın da onlar da sana yumuşak davransınlar.",
                            "verse 68:10": "[68.10]Şunların hiçbirine itâat etme :yemin edip duran,aşağılık,",
                            "verse 68:11": "[68.11](Herkesi) kötüleğen,söz götürüp getiren,",
                            "verse 68:12": "Hayra engel olan, mütecâviz ve saldırgan günahkar,",
                            "verse 68:13": "[68.13]Kaba ve kötülükle damgalı,",
                            "verse 68:14": "[68.14]Mal ve oğullar sahibi olmuş diye (böyle yolunu şaşırmış)",
                            "verse 68:15": "Ona âyetlerimiz okunduğu zaman o, \"Öncekilerin masalları!\" der.",
                            "verse 68:16": "Biz yakında onun burnuna damga vuracağız (kibirini kırıp rezil edeceğiz).",
                            "verse 68:17": "Biz, vaktiyle \"bahçe sahipleri\" ne belâ verdiğimiz gibi, onlara da belâ verdik. Hani onlar (bahçe sahipleri), sabah olurken (kimse görmeden) onu (mahsullerini) devşireceklerine yemin etmişlerdi.",
                            "verse 68:18": "Onlar istisna da etmiyorlardı.",
                            "verse 68:19": "Fakat onlar daha uykudayken Rabbinin katından (gönderilen) kuşatıcı bir âfet (ateş) bahçeyi sarıverdi de,",
                            "verse 68:20": "[68.20]Bahçe kapkara kesildi.",
                            "verse 68:21": "[68.21]Sabah olurken birbirlerine seslendiler.",
                            "verse 68:22": "\"Madem devşireceksiniz, hadi erkenden mahsülünüzün başına gidin!\" diye.",
                            "verse 68:23": "Derken yürüyorlardı; fısıldaşıyorlardı.",
                            "verse 68:24": "\"Sakın bugün hiçbir yoksul bahçeye girip yanınıza sokulmasın\"diye.",
                            "verse 68:25": "[68.25](Evet yoksullara yardıma) güçleri yettiği halde, onları yardımdan mahrum etmek niyet ve azmi ile erkenden yola düştüler.",
                            "verse 68:26": "Fakat bahçeyi gördüklerinde: Mutlaka yolumuzu şaşırmış olmalıyız! dediler.",
                            "verse 68:27": "Yok yok, doğrusu biz mahrum bırakılmışız!",
                            "verse 68:28": "İçlerinden en makul olanı şöyle dedi: Ben size \"Rabbinizi tesbih etsenize\" dememiş miydim?",
                            "verse 68:29": "Rabbimizi tesbih ederiz; doğrusu biz (kendi kendimize) yazık etmişiz, dediler.",
                            "verse 68:30": "Ardından, kabahati birbirlerine yüklemeye başladılar.",
                            "verse 68:31": "(Nihayet) şöyle dediler: Yazıklar olsun bize! Gerçekten biz azgın kişilermişiz.",
                            "verse 68:32": "Belki Rabbimiz bize bunun yerine daha iyisini verir. Çünkü biz (artık) Rabbimizi(O'nun hoşnutluğunu) arzuluyoruz.",
                            "verse 68:33": "İşte azap böyledir. Ahiret azabı ise elbette daha büyüktür. Keşke bilselerdi!",
                            "verse 68:34": "Şu da muhakkak ki, takvâ sahipleri için Rableri katında nimetleri bol cennetler vardır.",
                            "verse 68:35": "Öyle ya, (Allah'a) teslimiyet gösterenleri, (o) günahkârlar gibi tutar mıyız hiç?",
                            "verse 68:36": "Size ne oluyor? Ne biçim hüküm veriyorsunuz?",
                            "verse 68:37": "Yoksa size ait bir kitap var da, (bu bâtıl inanışları) onda mı okuyorsunuz?",
                            "verse 68:38": "Onda, beğendiğiniz her şey sizin için mutlaka vardır (diye mi yazılı)?",
                            "verse 68:39": "Yoksa, \"Ne hükmederseniz mutlaka sizindir\" diye sizin lehinize olarak tarafımızdan verilmiş, kıyamet gününe kadar geçerli kesin sözler mi var?",
                            "verse 68:40": "Sor onlara: Bu iddiayı onların hangisi savunacak?",
                            "verse 68:41": "Yoksa ortakları mı var onların? Sözlerinde doğru iseler, hadi getirsinler ortaklarını!",
                            "verse 68:42": "O gün incikten açılır ve secdeye davet edilirler; fakat güç getiremezler.",
                            "verse 68:43": "Gözleri horluktan aşağı düşmüş bir halde kendilerini zillet bürür. Halbuki onlar, sapasağlam iken de secdeye davet ediliyorlardı (fakat yine secde etmiyorlardı).",
                            "verse 68:44": "(Resûlüm!) Sen bu sözü (Kur'an'ı) yalan sayanı bana bırak (kendini üzme). Biz onları, bilmedikleri bir yönden yavaş yavaş azaba yaklaştırıyoruz.",
                            "verse 68:45": "Onlara mühlet veriyorum. Doğrusu benim fendim çok sağlamdır!",
                            "verse 68:46": "Yoksa sen onlardan bir ücret istiyorsun da bu yüzden onlar ağır bir borç altında mı kalıyorlar?",
                            "verse 68:47": "Yahut gaybın bilgisi onların nezdinde de, onlar mı (istedikleri gibi) yazıyorlar?",
                            "verse 68:48": "Sen Rabbinin hükmünü sabırla bekle. Balık sahibi (Yunus) gibi olma. Hani o, dertli dertli Rabbine niyaz etmişti.",
                            "verse 68:49": "Şayet Rabbinden ona bir nimet yetişmemiş olsaydı o, mutlaka, kınanacak bir halde ıssız bir diyara atılacaktı.",
                            "verse 68:50": "Fakat ardından, Rabbi onu seçti (vahiy verdi) ve onu sâlihlerden kıldı.",
                            "verse 68:51": "O inkâr edenler Zikr'i (Kur'an'ı) işittikleri zaman, neredeyse seni gözleriyle devirivereceklerdi. Hâla da (kin ve hasetlerinden:) \"Hiç şüphe yok o bir delidir\" derler.",
                            "verse 68:52": "Oysa o (Kur'an), âlemler için ancak bir öğüttür."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 68:1": "Нуун. Қалам билан ва сатрларга ёзадиган нарсалар билан қасам. (Оятда қасам қалам билан чекланмади, балки Аллоҳ сатрларга ёзилажак нарсалар билан ҳам қасам ичди. Бизнинг замонамизда қаламдан бошқа ёзув қўлланмалари ҳам чиқди. Қалам ва ёзиш билан қасам ичилиши мусулмонлар учун ўқиш-ёзиш, илм-маърифатга катта эътибор беришга чақириқдур.)",
                            "verse 68:2": "Сен Роббинг неъмати ила мажнун эмассан.",
                            "verse 68:3": "Ва албатта, сенга миннат қилинмайдиган ажр бордур.",
                            "verse 68:4": "Ва албатта, сен улкан хулқдасан.",
                            "verse 68:5": "Бас, тезда кўрурсан ва улар ҳам кўрурлар.",
                            "verse 68:6": "Сизлардан кимда жунунлик борлигини.",
                            "verse 68:7": "Албатта, Роббинг Ўзи, ким Унинг йўлидан адашганини билувчидур ва У ҳидоятда юрувчиларни ҳам билувчидур.",
                            "verse 68:8": "Бас, ёлғонга чиқарувчиларга итоат қилма.",
                            "verse 68:9": "Агар сен муроса қилсанг, улар ҳам муроса қилишни орзу қиларлар.",
                            "verse 68:10": "Итоат қилма! Ҳар бир қасамхўр, пасткашга.",
                            "verse 68:11": "Кишиларни айбловчи, чақимчилик қилиб юрувчига.",
                            "verse 68:12": "яхшиликни ман қилувчи, тажавузкор, сергуноҳга.",
                            "verse 68:13": "Қўпол, ундан сўнг отасининг таъйини йўққа.",
                            "verse 68:14": "Моли ва ўғиллари кўп бўлганидан.",
                            "verse 68:15": "Бизнинг оятларимиз Унгаўқилган пайтда, аввалгиларнинг афсоналари, деганга.",
                            "verse 68:16": "Тезда унинг тумшуғига белги қўямиз.",
                            "verse 68:17": "Албатта, Биз уларини боғ эгаларини синаганимиздек синаб кўрдик. Вақтики, эрта тонгада териб оламиз, деб қасам ичдилар.",
                            "verse 68:18": "Ва истисно қилмадилар.",
                            "verse 68:19": "Улар ухлаб ётганда, боғ устидан Роббингдан бўлган айланувчи айланиб чиқди.",
                            "verse 68:20": "Бас, у худди меваси териб олинганга ўхшаб қолди.",
                            "verse 68:21": "Улар, тонг-саҳарда бир-бирларини чақирдилар:",
                            "verse 68:22": "«Агар терадиган бўлсангиз, экинзорингизга эртароқ боринг», деб.",
                            "verse 68:23": "Бас, паст овозла гаплашиб, юриб кетдилар.",
                            "verse 68:24": "«Бугун сиз борингизда у боғга мискин кира кўрмасин», деб.",
                            "verse 68:25": "Ва эрталабда қасдла, ўзларини қодир сезиб, бордилар.",
                            "verse 68:26": "Уни кўрганларида, биз адашибмиз, дедилар.",
                            "verse 68:27": "Балки биз маҳрум бўлгандиримиз, дедилар.",
                            "verse 68:28": "Уларнинг энг яхши ва адолатлиси, «Сизларга тасбиҳ айтсаларингиз-чи, демабмидим?!», деди.",
                            "verse 68:29": "Роббимиз айблардан пок бўлди, албатта биз золимлардан эдик, дедилар.",
                            "verse 68:30": "Бас, баъзилари баъзиларни маломат қила бошладилар.",
                            "verse 68:31": "Вой, шўримиз қурсин, туғёнга кетган эканмиз.",
                            "verse 68:32": "Шояд Роббимиз унинг ўрнига ундан кўра яхшироғини берса. Биз ўз Роббимизга рағбатлимиз, дедилар.",
                            "verse 68:33": "Азоб шундоқ бўлур ва агар билсалар, албатта охират азоби бундан катта бўладир.",
                            "verse 68:34": "Албатта, тақводорлар учун Роббилари ҳузурида наъийм жаннатлари бордур.",
                            "verse 68:35": "Мусулмонларни жинояткорларга ўхшатиб қўярмидик?!",
                            "verse 68:36": "Сизларга нима бўлди, қандай ҳукм чиқаряпсизлар?!",
                            "verse 68:37": "Ёки сизларнинг китобингиз бор-у, ундан ўқидингизми?",
                            "verse 68:38": "Унда сизларга нимани ихтиёр қилсангиз, албатта, (бўлаверади) дейилганми?!",
                            "verse 68:39": "Ёки сизларга Бизнинг қиёмат кунигача етадиган ваъдаларимиз бўлиб, унда, албатта, сиз нима ҳукм қилсангиз шу бўлади, дейилганми?!",
                            "verse 68:40": "Сўра улардан, қай бирлари бу нарсага кафил экан?",
                            "verse 68:41": "Ёки уларнинг шериклари бормикин, агар ростгўй бўлсалар, ўша шерикларини ҳам олиб келсинлар.",
                            "verse 68:42": "Болдирлар шимарилган кунида ва улар саждага чақирилганда, қодир бўлмаслар. (Бу, қиёмат кунидир. Оғир ҳолатда қолиб қочишга уринган одам ҳалақит бермасин, деб иштонини шимариб, болдирини очиб олади.",
                            "verse 68:43": "Уларнинг кўзлари қўрқинчга тўла, хорлик ўраб олган. Ва дарҳақиқат, улар саломатлик ҳолларида сажда қилишга чақирилган эдилар.",
                            "verse 68:44": "Бу гапни ёлғонга чиқарувчиларни Менинг Ўзимга қўйиб қўй. Биз уларни ўзлари билмаган тарафдан аста-секин оламиз.",
                            "verse 68:45": "Ва уларга муҳлат бераман, албатта, Менинг ҳийлам метиндир.",
                            "verse 68:46": "Ёки сен улардан ҳақ сўраяпсану, улар қарзга ботиб қолдиларми?",
                            "verse 68:47": "Ёки ҳузурларида ғойиб илми бору, улар ёзиб оладиларми?",
                            "verse 68:48": "Роббинг ҳукмига сабр қил ва бир вақтлар ғамга тўлган ҳолда нидо қилган балиқ соҳибига ўхшама.",
                            "verse 68:49": "Агар уни Роббисининг неъмати топмаганда, очиқ саҳро жойга, мазамматга қолган ҳолда ташланган бўларди.",
                            "verse 68:50": "Бас, уни Роббиси танлаб олди ва солиҳ бандаларидан қилди.",
                            "verse 68:51": "Ва кофирлар зикрни эшитаётганларида сени кўзлари билан тойдирмоқчи бўлдилар ва, албатта, у жиннидур, дерлар.",
                            "verse 68:52": "Ҳолбуки, у бутун одамларга эслатмадан ўзга нарса эмас."
                        }
                    }
                }
            }
        }
    }
}