{
    "id": 69,
    "name_simple": "Al-Haqqah",
    "revelation_place": "makkah",
    "revelation_order": 78,
    "bismillah_pre": true,
    "verses_count": 52,
    "short_text": "The Surah takes its name from the word al-Haaqqah with which it opens.",
    "text": [
        "\n",
        "The Surah takes its name from the word al-Haaqqah with which it opens.",
        "\n",
        "Period of Revelation",
        "\n",
        "This too is one of the earliest surahs to be revealed at Makkah. Its subject matter shows that it was sent down at the time when opposition to the Holy Prophet (upon whom be peace) had started but had not yet become tyrannical. Musnad Ahmad contains a tradition from Hadrat Umar, saying: \"Before embracing Islam one day I came out of my house with a view to causing trouble to the Holy Prophet, but he had entered the Masjid al-Haram before me. When I arrived I found that he was reciting surah Al-Haaqqah in the Prayer. I stood behind him and listened. As he recited the Qur'an I wondered at its literary charm and beauty. Then suddenly an idea came to my mind that he must be a poet as the Quraish alleged. Just at that moment he recited the words: \"This is the Word of an honorable Messenger: it is not the word of a poet.\" I said to myself: Then, he must be a soothsayer, if not a poet. Thereupon be recited the words:\"Nor is it the word of a soothsayer: little it is that you\r\nreflect. It is a Revelation from the Lord and Sustainer of the worlds. On hearing this Islam entered deep into my heart.\" This tradition of Hadrat Umar shows that this surah had been sent down long before his acceptance of Islam, for even after this event he did not believe for a long time, and he continued to be influenced in favor of Islam by different incidents from time to time, till at last in the house of his own sister he came by the experience that made him surrender and submit to the Faith completely. (For details, see introduction to surah Maryam and Introduction to surah Al-Waqiah).",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "The first section (vv. 1-37) is about the Hereafter and the second (vv. 38-52) about the Qur'an's being a revelation from Allah and the Holy Prophet's being a true Messenger of Allah.",
        "\n",
        "The first section opens with the assertion that the coming of the Resurrection and the occurrence of the Hereafter is a truth which has to take place inevitably. Then in vv. 4-12, it has been stated that the communities that denied the Hereafter in the past became worthy of Allah's scourge ultimately. In vv. 13-17 the occurrence of Resurrection has been depicted. In vv. 18-37 the real object for which Allah has destined a second life for mankind after the present worldly life has been enunciated. In it we are told that on that Day all men shall appear in the Court of their Lord, where no secret of theirs shall remain hidden each man's record will be placed in his hand. Those who had spent lives in the world with the realization that one day they would have to render an account of their deeds before their Lord, and who had worked righteously in the world and provided beforehand for their well being in the Hereafter, will rejoice when they see that they have been acquitted and\r\nblessed with the eternal bliss of Paradise. On the contrary, those who neither recognized the rights of Allah, nor discharged the rights of men, will have no one to save them from the punishment of Allah, and they will be cast into Hell.",
        "\n",
        "In the second section (vv. 38-52) the disbelievers of Makkah have been addressed and told: \"You think this Qur'an is the word of a poet or soothsayer, whereas it is a Revelation sent dawn by Allah, which is being presented by the noble Messengers. The Messenger by himself had no power to increase or decrease a word in it. If he forges something of his own composition into it, We will cut off his neck-vein (or heart- vein). For this is the Truth absolute and pure: and those who give it a lie, will have ultimately to regret and repent.",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that opens by proclaiming one of the names of the Day of Resurrection, The Inevitable reality or hour, so named because in the matter of truth shall forever be decided then and all truth shall prevail regarding every aair. It takes its name from the Inevitable or Besieger (al-Ḥāqqah) mentioned in verse 1. The surah describes punishment in this life (verse 4 .) and the next (verse 13 .). The bliss to be enjoyed by the believers is eloquently contrasted with the torments of hell (verse 19 .). From verse 38 onwards, God airms the Truth of the Quran and the Prophet.The surah is also known as: Reality, The Catastrophe, The Concrete Reality, The Indubitable, The Inevitable Hour, The Inevitable Reality, The Sure Occurrence, The Sure Reality, The Undeniable.",
    "name_translation": "The Inevitable",
    "name_complex": "Al-Hâqqah",
    "surah_name_ar": "الحاقة",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 69:1": "Casti i të vërtetës!",
                            "verse 69:2": "Cka është Casti i të vërtetës?",
                            "verse 69:3": "Kush ta shpjegon ty (plotësisht) Castin e të vërtetës (Kijametin)?",
                            "verse 69:4": "Themudi dhe Adi e kanë përgënjeshtruar Kijametin,",
                            "verse 69:5": "e populli i Themudit është shkatërruar me një ulurimë (britmë) të madhe temrruese,",
                            "verse 69:6": "e populli i Adit është shkatërruar me një furtunë të hatashme,",
                            "verse 69:7": "të cilën Perëndia ua ka dërguar atyre shtatë netë dhe tetë ditë – parreshtur, e ku mund t’i vërejshe njerëzit e përmbysur si trungjet e hurmeve të kalbura,",
                            "verse 69:8": "e, a po sheh mos ka mbetur kush prej tyre?",
                            "verse 69:9": "E, ka ardhur Faraoni, dhe ata para tij, si dhe populli (i Lutit), me gabime të mëdha",
                            "verse 69:10": "dhe e kundërshtuan të dërguarin e Zotit të tyre, andaj Perëndia i ka dënuar ata me dënim të ashpër.",
                            "verse 69:11": "Ne, kur vërshoi uji i madh, ju ngarkuam juve në anije,",
                            "verse 69:12": "për t’ju bërë këtë juve mësim dhe që të mbajnë mend veshët e atyre njerëzve (të dijshëm),",
                            "verse 69:13": "e kur të fryejë njëherë buria,",
                            "verse 69:14": "e toka dhe malet të bartën e të copëtohen nga një shpërthim (eksplodim)",
                            "verse 69:15": "atë ditë do të ngjajë Dita e Kijametit,",
                            "verse 69:16": "dhe do të çahet qielli, e atë ditë do të jetë i thyeshëm,",
                            "verse 69:17": "dhe engjëjt do të rrinë anëve të qiellit, kurse atë ditë – tetë grupe engjëjsh do ta mbajnë Arshin (fronin) e Zotit tënd.",
                            "verse 69:18": "Atë ditë do të pyeteni (paraqiteni) ju, dhe asnjë fshehtësi e juaj nuk do të mbetët e pazbuluar:",
                            "verse 69:19": "atij që i jepet libri i veprave të tij në dorën e djathtë, do t’ju thotë (të tjerëve): Qe, lexoni librin, tim;",
                            "verse 69:20": "unë kam qenë i bindur se do të paraqes llogari.",
                            "verse 69:21": "E, ai është në një jetë të këndshme,",
                            "verse 69:22": "në një kopsht të mrekullueshëm,",
                            "verse 69:23": "frutet e të cilit janë të ulëta (afër duarve).",
                            "verse 69:24": "(Ju thuhet atyre): “Ju bafshin mirë ushqimi dhe pijet për veprat që keni punuar, në ditët e kaluara!”",
                            "verse 69:25": "Atij që i jepet libri i veprave të tij në dorën e majtë, do të thotë: “Ah, mos të më ishte dhënë libri im,",
                            "verse 69:26": "dhe mos të kisha ditur për llogarinë time,",
                            "verse 69:27": "Ah, të kisha qenë i vdekur (të mos isha ringjallur)!",
                            "verse 69:28": "Pasuria ime nuk më solli dobi,",
                            "verse 69:29": "dhe falimentoi fuqia ime!",
                            "verse 69:30": "(e atyre u thuhet): “Kapni ata dhe lidhni në pranga,",
                            "verse 69:31": "pastaj në skëterrë fërgoni,",
                            "verse 69:32": "e mandej lidhni në zingjirë prej shtatëdhjetë kutësh,",
                            "verse 69:33": "sepse, ai, me të vërtetë, nuk ka besuar Perëndinë e Madhërueshëm,",
                            "verse 69:34": "dhe nuk ka nxitur të ushqejë të varfërit e shkretë.",
                            "verse 69:35": "Prandaj, ai, sot këtu, nuk ka mik të dashur,",
                            "verse 69:36": "as ushim tjetër, përpos qelbësirës;",
                            "verse 69:37": "të cilin e hanë vetëm fajtorët (jobesimtarët).",
                            "verse 69:38": "E, Unë betohem me atë çka shihni ju,",
                            "verse 69:39": "dhe me atë që nuk shihni,",
                            "verse 69:40": "me të vërtetë, ajo (Kur’ani) është fjala e shpallur Profetit të shenjtë,",
                            "verse 69:41": "e nuk është fjalë e poetit. Pak ju besoni,",
                            "verse 69:42": "e as nuk është fjalë e ndonjë magjistari (falltori), pak po mendoni ju!",
                            "verse 69:43": "(Kur’ani) është i zbritur nga Zotii gjithësisë!",
                            "verse 69:44": "Sikur të kishte trilluar (Muhammedi) diçka prej fjalëve në llogari Tonë,",
                            "verse 69:45": "Ne do ta kapnim atë ëpr dorën e djathtë,",
                            "verse 69:46": "dhe do t’ia prenim arterien e zemrës,",
                            "verse 69:47": "dhe askush prej jush nuk do të mund ta mbronte prej këtij (dënimi).",
                            "verse 69:48": "Me të vërtetë, ai (Kur’ani), është, këshillë për ata që dëshirojnë zbatimin e urdhërave dhe të ruhen prej të këqiave,",
                            "verse 69:49": "por, Ne, me siguri, e dimë, që ka prej jush përgënjeshtrues.",
                            "verse 69:50": "Me të vërtetë, ai (Kur’ani), është, fatkeqësi për mohuesit,",
                            "verse 69:51": "por, ai (Kur’ani), padyshim, është e vërtetë e pamohueshme.",
                            "verse 69:52": "Prandaj, falenderohu me emrin e Zotit tënd të Madhërueshëm."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "Haqq olan qiyamət!",
                            "verse 69:2": "Nədir qiyamət?!",
                            "verse 69:3": "Nə bilirsən (haradan bilirsən) ki, nədir qiyamət?! (Qiyamətin nə olduğunu sənə nə öyrətdi?)",
                            "verse 69:4": "Səmud da, Ad da (ürəkləri dəhşətə salan) o qiyaməti yalan saymışdılar!",
                            "verse 69:5": "Səmud (qövmü) hədsiz dərəcədə dəhşətli (tükürpədici) səslə həlak edildi.",
                            "verse 69:6": "Ad (qövmü) isə uğultulu, çox (soyuq və) siddətli bir küləklə tar-mar oldu.",
                            "verse 69:7": "Allah o küləyi yeddi gecə, səkkiz gün ardı-arası kəsilmədən onların üstünə əsdirdi. Belə ki, (əgər yanlarında olsaydın) sən onları orada yıxılıb ölmüş görərdin. Onlar, sanki içi bomboş xurma kötükləri idilər.",
                            "verse 69:8": "İndi sən onlardan heç bir əsər-əlamət görə bilərsənmi?!",
                            "verse 69:9": "Fir'on da, ondan əvvəlkilər də, alt-üst olmuş Mö'təfikə əhli (Lut qövmü) də günah (xəta) törətmişdilər.",
                            "verse 69:10": "Onlar Rəbbinin peyğəmbərinə asi olmuş, O da onları şiddəti getdikcə artan bir əzabla yaxalamışdı.",
                            "verse 69:11": "Həqiqətən, hər tərəfi su basdığı zaman (Nuhun tufanı qopduqda) sizi gəmiyə Biz daşıdıq.",
                            "verse 69:12": "Ona görə ki, bunu (mö'minlərə nicat verib kafirləri məhv etməyimizi) sizə bir ibrət dərsi edək və dərk edən (öyüd-nəsihəti cani-dildən dinləyən) qulaq bunu eşidib yadda saxlasın!",
                            "verse 69:13": "Sur bircə dəfə üfürüləcəyi;",
                            "verse 69:14": "Yer və dağlar qaldırılıb bircə dəfə bir-birinə çırpılacağı (əzilib toza dönəcəyi) zaman -",
                            "verse 69:15": "Məhz o gün (vaqe olacağına heç bir şübhə olmayan) qiyamət qopacaqdır!",
                            "verse 69:16": "Və (göy) süst düşüb parçalanacaqdır!",
                            "verse 69:17": "Mələklər də onun (göyün) ətrafında (Allahın əmrinə müntəzir) olacaq və həmin gün (ya Peyğəmbər!) sənin Rəbbinin ərşini onların (başı) üstündə səkkiz mələk daşıyacaqdır!",
                            "verse 69:18": "O gün (ey insanlar!) siz (haqq-hesab üçün Rəbbinizin hüzuruna) gətiriləcəksiniz. Sizin heç bir sirriniz (Allahdan) gizli qalmayacaqdır!",
                            "verse 69:19": "Əməl dəftəri sağ əlinə verilən kimsə deyəcəkdir: \"Alın, əməl dəftərimi oxuyun!",
                            "verse 69:20": "Mən (dünyada ikən qiyamət günü) öz hesabıma yetişəcəyimə (möhkəm) inanmışdım!\"",
                            "verse 69:21": "Bundan belə o, xoş güzəran içində,",
                            "verse 69:22": "Yüksək bir Cənətdə olacaqdır.",
                            "verse 69:23": "(Elə bir Cənnət ki, onun) meyvələri çox yaxındadır (mö'minlər onlardan ayaq üstə olanda da, oturanda da, uzananda da yeyə biləcəklər).",
                            "verse 69:24": "(Onlara belə deyiləcəkdir: ) \"Keçmiş günlərdə etdiyiniz (yaxşı) əməllər müqabilində yeyin-için!\"",
                            "verse 69:25": "Əməl dəftəri sol əlinə verilən isə deyəcəkdir: \"Kaş əməl dəftərim mənə verilməyəydi!",
                            "verse 69:26": "Hesabımın nə olduğunu bilməyəydim!",
                            "verse 69:27": "Kaş o (ölüm) qəti (əbədi) olaydı! (Bir daha dirilib bu əzabı görməyəydim!)",
                            "verse 69:28": "Mal-dövlətim mənə heç bir fayda vermədi (Allahın əzabını məndən dəf edə bilmədi).",
                            "verse 69:29": "Mülküm (səltənətim) də məhv olub getdi!\"",
                            "verse 69:30": "(Allah dərgahından belə bir nida gələcəkdir: ) \"Onu tutub qandallayın!",
                            "verse 69:31": "Sonra da Cəhənnəmə atın!",
                            "verse 69:32": "Daha sonra onu yetmiş arşın uzunluğunda zəncirlə bağlayın!",
                            "verse 69:33": "Cünki o, böyük olan Allaha inanmırdı.",
                            "verse 69:34": "O (özü zəkat vermir, acizə, kimsəsizə kömək etmit, xalqda da) yoxsulu yedirtməyə rəğbət oyatmırdı.",
                            "verse 69:35": "Bu gün bax burda onun yaxın bir dostu yoxdur.",
                            "verse 69:36": "İrindən başqa bir yeməyi də yoxdur.",
                            "verse 69:37": "Onu ancaq günahkarlar yeyər!\"",
                            "verse 69:38": "And içirəm gördüklərinizə,",
                            "verse 69:39": "Və görmədiklərinizə ki,",
                            "verse 69:40": "Bu (Qur'an) çox möhtərəm bir elçinin (Cəbrailin, yaxud Muhəmməd əleyhissəlamın Allahın ona nazil etdiyi) sözüdür!",
                            "verse 69:41": "O, şair sözü deyildir! Nə az inanırsınız!",
                            "verse 69:42": "O, kahin sözü də deyildir! Nə az düşünürsünüz!",
                            "verse 69:43": "O, aləmlərin Rəbbi tərəfindən nazil edilmişdir.",
                            "verse 69:44": "Əgər o (Peyğəmbər) özündən bə'zi sözlər uydurub Bizə isnad etsəydi,",
                            "verse 69:45": "Biz ondan mütləq şiddətli intiqam alardıq (sağ əlini kəsərdik, yaxud boynunu vurardıq)!",
                            "verse 69:46": "Sonra onun şah damarını qopardardıq!",
                            "verse 69:47": "Və heç biriniz də (Bizim əzabımızı) ondan dəf edə bilməzdiniz.",
                            "verse 69:48": "Şübhəsiz ki, bu (Qur'an) müttəqilərə bir öyüd-nəsihətdir.",
                            "verse 69:49": "(Ey insanlar!) İçərinizdə onu yalan hesab edənlər olduğunu da, əlbəttə, bilirik.",
                            "verse 69:50": "Şübhəsiz ki, bu (Qur'an) kafirlər üçün bir peşmançılıqdır (ona inanmadıqlarına görə qiyamət günü böyük zərər çəkəcəklər).",
                            "verse 69:51": "Doğrudan da, bu (Qur'an) gerçək bir həqiqətdir.",
                            "verse 69:52": "Elə isə (ya Peyğəmbər!) sən ulu olan Rəbbinin adını təsbih (müqəddəs tutub həmd-səna ilə zikr) et!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "Čas neizbježni,",
                            "verse 69:2": "šta je Čas neizbježni,",
                            "verse 69:3": "i otkud ti znaš šta je Čas neizbježni?",
                            "verse 69:4": "Semud i Ad su Smak svijeta poricali",
                            "verse 69:5": "pa je Semud uništen glasom strahovitim,",
                            "verse 69:6": "a Ad uništen vjetrom ledenim, silovitim,",
                            "verse 69:7": "kome je On vlast nad njima, sedam noći i osam dana uzastopnih bio prepustio, pa si u njima ljude povaljane kao šuplja datulina debla vidio,",
                            "verse 69:8": "i vidiš li da je iko od njih ostao?",
                            "verse 69:9": "A došli su faraon, i oni prije njega,",
                            "verse 69:10": "i protiv poslanika Gospodara svoga se dizali, pa ih je On ne može biti teže kaznio.",
                            "verse 69:11": "Mi smo vas, kada je voda preplavila sve, u lađi nosili",
                            "verse 69:12": "da vam to poukom učinimo i da to od zaborava sačuva uho koje pamti.",
                            "verse 69:13": "A kada se jednom u Rog puhne,",
                            "verse 69:14": "pa se Zemlja i nebo dignu i od jednog udara zdrobe,",
                            "verse 69:15": "toga dana će se Smak svijeta dogoditi",
                            "verse 69:16": "i nebo će se razdvojiti - tada će labavo biti -",
                            "verse 69:17": "i meleki će na krajevima njegovim stajati, a prijesto Gospodara tvoga će tog dana iznad njih osmerica držati.",
                            "verse 69:18": "Tada će ispitivani biti, i nijedna tajna vaša neće sakrivena ostati:",
                            "verse 69:19": "onaj kome se knjiga njegova u desnu ruku njegovu da - reći će: \"Evo vam, čitajte knjigu moju,",
                            "verse 69:20": "ja sam čvrsto vjerovao da ću račun svoj polagati.\"",
                            "verse 69:21": "I on će biti u životu zadovoljnom,",
                            "verse 69:22": "u Džennetu predivnom,",
                            "verse 69:23": "čiji će plodovi na dohvat ruke biti.",
                            "verse 69:24": "Jedite i pijte radosni, za ono što ste u danima minulim zaradili!",
                            "verse 69:25": "A onaj kome se dâ knjiga u lijevu ruku njegovu reći će: \"Kamo sreće da mi knjiga moja ni data nije",
                            "verse 69:26": "i da ni saznao nisam za obračun svoj!",
                            "verse 69:27": "Kamo sreće da me je smrt dokrajčila -",
                            "verse 69:28": "bogatstvo moje mi nije od koristi,",
                            "verse 69:29": "snage moje nema više!\"",
                            "verse 69:30": "Držite ga i u okove okujte,",
                            "verse 69:31": "zatim ga samo u vatri pržite,",
                            "verse 69:32": "a onda ga u sindžire sedamdeset lakata duge vežite,",
                            "verse 69:33": "jer on u Allaha Velikog nije vjerovao",
                            "verse 69:34": "i da se nahrani nevoljnik - nije nagovarao;",
                            "verse 69:35": "zato on danas ovdje nema prisna prijatelja",
                            "verse 69:36": "ni drugog jela osim pomija,",
                            "verse 69:37": "koje će samo nevjernici jesti.\"",
                            "verse 69:38": "A Ja se kunem onim što vidite",
                            "verse 69:39": "i onim što ne vidite,",
                            "verse 69:40": "Kur’an je, doista, govor objavljen plemenitom Poslaniku,",
                            "verse 69:41": "a nije govor nikakva pjesnika - kako vi nikako ne vjerujete!",
                            "verse 69:42": "i nisu riječi nikakva proroka - kako vi malo razmišljate!",
                            "verse 69:43": "Objava je on od Gospodara svjetova!",
                            "verse 69:44": "A da je on o Nama kojekakve riječi iznosio,",
                            "verse 69:45": "Mi bismo ga za desnu ruku uhvatili,",
                            "verse 69:46": "a onda mu žilu kucavicu presjekli,",
                            "verse 69:47": "i niko ga između vas ne bi mogao od toga odbraniti.",
                            "verse 69:48": "Pouka je Kur’an onima koju budu Allahova naređenja izvršavali, a zabrana se klonili -",
                            "verse 69:49": "A Mi, sigurno, znamo da neki od vas neće u nj vjerovati -",
                            "verse 69:50": "i on će biti uzrok jadu nevjernika,",
                            "verse 69:51": "a on je, doista, sama istina",
                            "verse 69:52": "zato ti hvali ime Gospodara tvoga, Veličanstvenoga!"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "সুনিশ্চিত বিষয়।",
                            "verse 69:2": "সুনিশ্চিত বিষয় কি?",
                            "verse 69:3": "আপনি কি কিছু জানেন, সেই সুনিশ্চিত বিষয় কি?",
                            "verse 69:4": "আদ ও সামুদ গোত্র মহাপ্রলয়কে মিথ্যা বলেছিল।",
                            "verse 69:5": "অতঃপর সমুদ গোত্রকে ধ্বংস করা হয়েছিল এক প্রলয়ংকর বিপর্যয় দ্বারা।",
                            "verse 69:6": "এবং আদ গোত্রকে ধ্বংস করা হয়েছিল এক প্রচন্ড ঝঞ্জাবায়ূ,",
                            "verse 69:7": "যা তিনি প্রবাহিত করেছিলেন তাদের উপর সাত রাত্রি ও আট দিবস পর্যন্ত অবিরাম। আপনি তাদেরকে দেখতেন যে, তারা অসার খর্জুর কান্ডের ন্যায় ভূপাতিত হয়ে রয়েছে।",
                            "verse 69:8": "আপনি তাদের কোন অস্তিত্ব দেখতে পান কি?",
                            "verse 69:9": "ফেরাউন, তাঁর পূর্ববর্তীরা এবং উল্টে যাওয়া বস্তিবাসীরা গুরুতর পাপ করেছিল।",
                            "verse 69:10": "তারা তাদের পালনকর্তার রসূলকে অমান্য করেছিল। ফলে তিনি তাদেরকে কঠোরহস্তে পাকড়াও করলেন।",
                            "verse 69:11": "যখন জলোচ্ছ্বাস হয়েছিল, তখন আমি তোমাদেরকে চলন্ত নৌযানে আরোহণ করিয়েছিলাম।",
                            "verse 69:12": "যাতে এ ঘটনা তোমাদের জন্যে স্মৃতির বিষয় এবং কান এটাকে উপদেশ গ্রহণের উপযোগী রূপে গ্রহণ করে।",
                            "verse 69:13": "যখন শিংগায় ফুৎকার দেয়া হবে-একটি মাত্র ফুৎকার",
                            "verse 69:14": "এবং পৃথিবী ও পর্বতমালা উত্তোলিত হবে ও চুর্ণ-বিচুর্ণ করে দেয়া হবে,",
                            "verse 69:15": "সেদিন কেয়ামত সংঘটিত হবে।",
                            "verse 69:16": "সেদিন আকাশ বিদীর্ণ হবে ও বিক্ষিপ্ত হবে।",
                            "verse 69:17": "এবং ফেরেশতাগণ আকাশের প্রান্তদেশে থাকবে ও আট জন ফেরেশতা আপনার পালনকর্তার আরশকে তাদের উর্ধ্বে বহন করবে।",
                            "verse 69:18": "সেদিন তোমাদেরকে উপস্থিত করা হবে। তোমাদের কোন কিছু গোপন থাকবে না।",
                            "verse 69:19": "অতঃপর যার আমলনামা ডান হাতে দেয়া হবে, সে বলবেঃ নাও, তোমরাও আমলনামা পড়ে দেখ।",
                            "verse 69:20": "আমি জানতাম যে, আমাকে হিসাবের সম্মুখীন হতে হবে।",
                            "verse 69:21": "অতঃপর সে সুখী জীবন-যাপন করবে,",
                            "verse 69:22": "সুউচ্চ জান্নাতে।",
                            "verse 69:23": "তার ফলসমূহ অবনমিত থাকবে।",
                            "verse 69:24": "বিগত দিনে তোমরা যা প্রেরণ করেছিলে, তার প্রতিদানে তোমরা খাও এবং পান কর তৃপ্তি সহকারে।",
                            "verse 69:25": "যার আমলনামা তার বাম হাতে দেয়া হবে, সে বলবেঃ হায় আমায় যদি আমার আমল নামা না দেয়া হতো।",
                            "verse 69:26": "আমি যদি না জানতাম আমার হিসাব!",
                            "verse 69:27": "হায়, আমার মৃত্যুই যদি শেষ হত।",
                            "verse 69:28": "আমার ধন-সম্পদ আমার কোন উপকারে আসল না।",
                            "verse 69:29": "আমার ক্ষমতাও বরবাদ হয়ে গেল।",
                            "verse 69:30": "ফেরেশতাদেরকে বলা হবেঃ ধর একে গলায় বেড়ি পড়িয়ে দাও,",
                            "verse 69:31": "অতঃপর নিক্ষেপ কর জাহান্নামে।",
                            "verse 69:32": "অতঃপর তাকে শৃঙ্খলিত কর সত্তর গজ দীর্ঘ এক শিকলে।",
                            "verse 69:33": "নিশ্চয় সে মহান আল্লাহতে বিশ্বাসী ছিল না।",
                            "verse 69:34": "এবং মিসকীনকে আহার্য দিতে উৎসাহিত করত না।",
                            "verse 69:35": "অতএব, আজকের দিন এখানে তার কোন সুহূদ নাই।",
                            "verse 69:36": "এবং কোন খাদ্য নাই, ক্ষত-নিঃসৃত পুঁজ ব্যতীত।",
                            "verse 69:37": "গোনাহগার ব্যতীত কেউ এটা খাবে না।",
                            "verse 69:38": "তোমরা যা দেখ, আমি তার শপথ করছি।",
                            "verse 69:39": "এবং যা তোমরা দেখ না, তার-",
                            "verse 69:40": "নিশ্চয়ই এই কোরআন একজন সম্মানিত রসূলের আনীত।",
                            "verse 69:41": "এবং এটা কোন কবির কালাম নয়; তোমরা কমই বিশ্বাস কর।",
                            "verse 69:42": "এবং এটা কোন অতীন্দ্রিয়বাদীর কথা নয়; তোমরা কমই অনুধাবন কর।",
                            "verse 69:43": "এটা বিশ্বপালনকর্তার কাছ থেকে অবতীর্ণ।",
                            "verse 69:44": "সে যদি আমার নামে কোন কথা রচনা করত,",
                            "verse 69:45": "তবে আমি তার দক্ষিণ হস্ত ধরে ফেলতাম,",
                            "verse 69:46": "অতঃপর কেটে দিতাম তার গ্রীবা।",
                            "verse 69:47": "তোমাদের কেউ তাকে রক্ষা করতে পারতে না।",
                            "verse 69:48": "এটা খোদাভীরুদের জন্যে অবশ্যই একটি উপদেশ।",
                            "verse 69:49": "আমি জানি যে, তোমাদের মধ্যে কেউ কেউ মিথ্যারোপ করবে।",
                            "verse 69:50": "নিশ্চয় এটা কাফেরদের জন্যে অনুতাপের কারণ।",
                            "verse 69:51": "নিশ্চয় এটা নিশ্চিত সত্য।",
                            "verse 69:52": "অতএব, আপনি আপনার মহান পালনকর্তার নামের পবিত্রতা বর্ননা করুন।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 69:1": "Неизбежното!",
                            "verse 69:2": "Какво е Неизбежното?",
                            "verse 69:3": "И откъде да знаеш ти какво е Неизбежното?",
                            "verse 69:4": "Самудяните и адитите взеха за лъжа Бедствието.",
                            "verse 69:5": "Самудяните бяха погубени от Вика.",
                            "verse 69:6": "А адитите бяха погубени от бушуващ леден вихър.",
                            "verse 69:7": "Накара го Той да вилнее срещу тях седем нощи и осем дни поред, и виждаш там хората покосени, сякаш са стволове на повалени палми.",
                            "verse 69:8": "И нима виждаш някой останал от тях?",
                            "verse 69:9": "И Фараонът, и онези преди него, и сринатите [селища на Лут] вършеха грях.",
                            "verse 69:10": "И се възпротивиха на пратеника от своя Господ, затова Той с мощ ги сграбчи.",
                            "verse 69:11": "Когато водата преля, Ние ви понесохме в плаващия Ковчег,",
                            "verse 69:12": "за да го сторим поука за вас и да го запомнят помнещи уши.",
                            "verse 69:13": "И когато се протръби с Рога първия път,",
                            "verse 69:14": "и бъдат вдигнати земята и планините, и бъдат натрошени с един удар,",
                            "verse 69:15": "тогава ще се случи Събитието.",
                            "verse 69:16": "И ще се разцепи небето, и ще бъде слабо в този Ден.",
                            "verse 69:17": "И ангелите ще са по краищата му. В този Ден осмина [от тях] ще носят Трона на твоя Господ.",
                            "verse 69:18": "В този Ден ще бъдете изправени [пред Аллах]. Не ще бъде скрита и една ваша тайна.",
                            "verse 69:19": "И онзи, чиято книга му се даде в десницата, ще каже: Ето ви, прочетете моята книга!",
                            "verse 69:20": "Предполагах, че ще получа своята равносметка.",
                            "verse 69:21": "И ще живее в доволство",
                            "verse 69:22": "сред въздигната Градина.",
                            "verse 69:23": "Плодовете й ще са сведени.",
                            "verse 69:24": "Яжте и пийте със здраве за онова, което сте вършили преди, в отминалите дни!",
                            "verse 69:25": "А онзи, чиято книга му се даде в левицата, ще каже: О, да не ми бе давана моята книга",
                            "verse 69:26": "и да не бях узнал каква е моята равносметка!",
                            "verse 69:27": "О, да бе приключило всичко [със смъртта]!",
                            "verse 69:28": "Не ме избави моето богатство.",
                            "verse 69:29": "Пропадна моята власт.",
                            "verse 69:30": "Хванете го и го оковете!",
                            "verse 69:31": "После в Ада го горете!",
                            "verse 69:32": "После го нанижете на верига, дълга седемдесет лакти!",
                            "verse 69:33": "Не повярва той в Аллах, Превеликия.",
                            "verse 69:34": "И не подканваше да бъде нахранен нуждаещият се,",
                            "verse 69:35": "затова Днес няма тук за него ближен,",
                            "verse 69:36": "нито храна освен кръв и гной.",
                            "verse 69:37": "Ядат я само грешниците.",
                            "verse 69:38": "Ала не! Кълна се в това, което съзирате",
                            "verse 69:39": "и в това, което не съзирате,",
                            "verse 69:40": "наистина то е слово на достоен Пратеник,",
                            "verse 69:41": "а не е слово на поет. Но вие малко вярвате.",
                            "verse 69:42": "И не е слово на гадател. Ала малко се поучавате.",
                            "verse 69:43": "Низпослание от Господа на световете.",
                            "verse 69:44": "И ако той Ни приписваше някакви слова,",
                            "verse 69:45": "щяхме да го сграбчим с Десницата,",
                            "verse 69:46": "после да му прережем аортата.",
                            "verse 69:47": "И никой сред вас не ще Ни възпре от това.",
                            "verse 69:48": "То е напомняне за богобоязливите.",
                            "verse 69:49": "И добре знаем, че сред вас има отричащи.",
                            "verse 69:50": "То е скръб за неверниците.",
                            "verse 69:51": "То е достоверната истина.",
                            "verse 69:52": "Затова прославяй името на твоя Господ, Превеликия!"
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "真災，",
                            "verse 69:2": "真災是什麼？",
                            "verse 69:3": "你怎麼能認識真災是什麼呢？",
                            "verse 69:4": "賽莫德人和阿德人，曾否認大難。",
                            "verse 69:5": "至於賽莫德人呢，已為嚴刑所毀滅；",
                            "verse 69:6": "至於阿德人，已為怒吼的暴風所毀滅。",
                            "verse 69:7": "真主曾使暴風對著他們連刮了七夜八晝，你看阿德人倒仆在地上，好像空心的海棗樹幹一樣。",
                            "verse 69:8": "你能看見他們還有孑遺嗎？",
                            "verse 69:9": "法老和在他之前的人，以及被傾覆的城市的居民，又再犯罪，",
                            "verse 69:10": "他們曾違抗他們的主的使者，故他嚴厲懲治了他們。",
                            "verse 69:11": "當大水泛濫的時候，我讓你們乘船，",
                            "verse 69:12": "以便我以那件事為你們的教訓，以便能記憶的耳朵把它記住。",
                            "verse 69:13": "當號角一嚮，",
                            "verse 69:14": "大地和山岳都被移動，且互相碰撞一次的時候；",
                            "verse 69:15": "在那日，那件大事將發生，",
                            "verse 69:16": "天將破裂；在那日，天將成為脆弱的。",
                            "verse 69:17": "眾天神將在天的各方；在那日，在他們上面，將有八個天神，擔負你的主的寶座；",
                            "verse 69:18": "在那日，你們將被檢閱，你們的任何秘密，都無法隱藏。",
                            "verse 69:19": "用右手接受自己的功過簿的人將說：「你們拿我的功過簿去讀讀吧！",
                            "verse 69:20": "我確已猜想到我必遇見我的賬目。」",
                            "verse 69:21": "他將在愉快的生活裡，",
                            "verse 69:22": "在崇高的樂園裡，",
                            "verse 69:23": "那裡面的水果伸手可得。",
                            "verse 69:24": "「你們可以愉快地飲食，因為你們在過去的歲月中行過善。」",
                            "verse 69:25": "以左手接過自己的功過簿的人將說：「啊呀！但願我沒有接過我的功過簿，",
                            "verse 69:26": "不知道我自己的賬目！",
                            "verse 69:27": "但願塵世的死亡已了結我的一生！",
                            "verse 69:28": "我的財產於我毫無裨益，",
                            "verse 69:29": "我的權柄已從我的手中消失。」",
                            "verse 69:30": "「你們捉住他，給他帶上枷鎖，",
                            "verse 69:31": "然後把他投在烈火裡，",
                            "verse 69:32": "然後把他穿在一條七十臂長的鏈子上。」",
                            "verse 69:33": "他生前確是不信仰尊大的真主，",
                            "verse 69:34": "不勉勵人賬濟貪民；",
                            "verse 69:35": "故今日他在這裡沒有一個親戚。",
                            "verse 69:36": "除膿汁外，他沒有食物。",
                            "verse 69:37": "只有迷誤的人們才吃膿汁。",
                            "verse 69:38": "不然！我以你們所能見的萬象盟誓，",
                            "verse 69:39": "並且以你們不能見的幽玄盟誓，",
                            "verse 69:40": "這確是尊貴的使者的言辭；",
                            "verse 69:41": "並不是詩人的言辭，你們很少信仰，",
                            "verse 69:42": "也不是僕人的言辭，你們很少覺悟。",
                            "verse 69:43": "這是從全世界的主降示的。",
                            "verse 69:44": "假若他假借我的名義，捏造謠言，",
                            "verse 69:45": "我必以權力逮捕他，",
                            "verse 69:46": "然後必割斷他的大動脈，",
                            "verse 69:47": "你們中沒有一個人能保衛他。",
                            "verse 69:48": "這確是對敬畏者的教訓。",
                            "verse 69:49": "我的確知道你們中有否認的人。",
                            "verse 69:50": "這對於不信道的人們確是悔恨。",
                            "verse 69:51": "這確是真實的信念，",
                            "verse 69:52": "故你當頌揚你的主的大名。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "Nevyhnutelná!",
                            "verse 69:2": "Co je to nevyhnutelná?",
                            "verse 69:3": "Víš ty vůbec, co je to nevyhnutelná?",
                            "verse 69:4": "Jak Thamúdovci, tak i ´Ádovci roztříšťující za lež pokládali.",
                            "verse 69:5": "Co Thamúdovců se týče, ti byli ranou hromovou zahubeni,",
                            "verse 69:6": "zatímco ´Ádovci byli vichřicí svištivou, nezkrotnou skoseni.",
                            "verse 69:7": "Bůh dal jí, zničující, nad nimi vládu po osm dní a sedm nocí; a byl bys tam viděl lidi k zemi vržené, jako by to byly kmeny palem vykotlané.",
                            "verse 69:8": "A vidíš snad, že by po nich bylo něco zůstalo?",
                            "verse 69:9": "Též Faraón a ti, kdož před ním byli, i města vyvrácená se hříchy provinili",
                            "verse 69:10": "a posla Pána svého neposlouchali, takže Bůh trestem nadměrným je uchvátil.",
                            "verse 69:11": "A když se vodstva rozlila, na plující archu jsme vás přenesli,",
                            "verse 69:12": "abychom ji pro vás připomenutím učinili a aby uši pozorné to podržely.",
                            "verse 69:13": "Až bude zatroubeno na pozoun jedním zatroubením",
                            "verse 69:14": "a země a hory budou zvednuty a rozdrceny úderem jedním,",
                            "verse 69:15": "v ten den nezvratná dopadne",
                            "verse 69:16": "a nebe se rozpoltí a bude zející toho dne",
                            "verse 69:17": "a stát budou andělé na krajích jeho; v ten den osm jich nad sebou ponese trůn Pána tvého.",
                            "verse 69:18": "V ten den předvedeni budete a nezůstane u vás skryto nic tajného.",
                            "verse 69:19": "A komu bude dána kniha jeho do pravice, ten řekne: \"Zde přečtěte si knihu mou!",
                            "verse 69:20": "Já soudil jsem vždy, že s účtem svým se setkám jednou.\"",
                            "verse 69:21": "A takový bude mít žití příjemné",
                            "verse 69:22": "v zahradě vznešené,",
                            "verse 69:23": "jejíž plody na dosah budou.",
                            "verse 69:24": "Jezte a pijte v bezpečí za to, co jste již vykonali v době minulé!",
                            "verse 69:25": "A komu bude dána kniha jeho do levice, ten řekne: \"Ach, kéž by mi nebyla dána kniha má",
                            "verse 69:26": "a já se nikdy nedozvěděl účtu svého výsledek!",
                            "verse 69:27": "Ach, kéž by tato smrt byla konečná!",
                            "verse 69:28": "K ničemu dnes mi není můj majetek",
                            "verse 69:29": "a zanikla, daleko ode mne, pravomoc má!\"",
                            "verse 69:30": "Chopte se ho a v řetězy jej zakovejte,",
                            "verse 69:31": "pak v ohni pekelném jej palte",
                            "verse 69:32": "a potom řetězem sedmdesát loktů dlouhým jej svažte!\"",
                            "verse 69:33": "On věru nevěřil v Boha mocného",
                            "verse 69:34": "a nevybízel k nakrmení nuzného,",
                            "verse 69:35": "takže zde nemá dnes druha vřelého",
                            "verse 69:36": "ani krom splašek pokrmu jiného,",
                            "verse 69:37": "jež jísti budou jen těžcí hříšníci.",
                            "verse 69:38": "Hle, já přísahám při tom, co vidíte,",
                            "verse 69:39": "i při tom, co nezříte,",
                            "verse 69:40": "že toto zajisté je řeč posla vznešeného!",
                            "verse 69:41": "Nejsou to slova básníkova - jak málo vy věříte -",
                            "verse 69:42": "ani řeč věštcova - jak krátkou paměť máte -",
                            "verse 69:43": "leč je to od Pána lidstva seslání!",
                            "verse 69:44": "A kdyby si on proti vůli Naší vymýšlel nějaká rčení,",
                            "verse 69:45": "věru bychom jej vzali za jeho pravici",
                            "verse 69:46": "a pak mu prořízli jeho srdečnici",
                            "verse 69:47": "a žádný z vás by tomu nemohl zabránit.",
                            "verse 69:48": "Korán vskutku je připomenutí bohabojným",
                            "verse 69:49": "a dobře víme, že mezi vámi jsou ti, kdo nazývají jej vylhaným.",
                            "verse 69:50": "A věru on zármutku nevěřících je příčinou",
                            "verse 69:51": "a vskutku je pravdou jistotnou!",
                            "verse 69:52": "Chval tedy jméno Pána svého mocného!"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "Datgene wat plaats zal hebben",
                            "verse 69:2": "Wat is het dat plaats zal hebben?",
                            "verse 69:3": "Gij weet niet wat plaats zal hebben.",
                            "verse 69:4": "De Samoed alsook de Aad loochenden de ramp.",
                            "verse 69:5": "Wat de Samoed betreft, dezen werden door een overweldigende straf vernietigd.",
                            "verse 69:6": "En de Aad werden door een felle, geweldige wind vernietigd.",
                            "verse 69:7": "Die Hij zeven nachten en acht dagen achtereenvolgens over hen liet woeden, zodat gij hadt kunnen zien hoe het volk er door neergeworpen werd, alsof zij gevallen palmboomstammen waren.",
                            "verse 69:8": "Kunt gij enige overblijfselen van hen vinden?",
                            "verse 69:9": "Ook Pharao, en degenen die vóór hem waren, en de steden die verwoest werden begingen grote zonde;",
                            "verse 69:10": "En zij gehoorzaamden de boodschapper van hun Heer niet, daarom greep Hij hen met een vaste greep.",
                            "verse 69:11": "Ziet, toen de wateren stegen, droegen Wij u de ark binnen,",
                            "verse 69:12": "Opdat Wij dit tot een les voor u mochten maken en opdat degene die deze (gebeurtenis) kan onthouden zich deze moge herinneren.",
                            "verse 69:13": "En wanneer een enkele stoot op de bazuin zal worden geblazen,",
                            "verse 69:14": "En de aarde en de bergen van hun plaats zullen worden opgeheven en terstond zullen worden verbrijzeld,",
                            "verse 69:15": "Op die Dag zal de grote gebeurtenis plaats vinden.",
                            "verse 69:16": "En de hemelen zullen uiteen splijten, zodat deze op die Dag zwak zullen zijn.",
                            "verse 69:17": "En de engelen zullen op de zijden ervan staan. En op die Dag zullen acht engelen de troon van uw Heer boven zich houden.",
                            "verse 69:18": "Dan zult gij worden bloot gelegd en geen uwer geheimen zal verborgen blijven.",
                            "verse 69:19": "En hij, aan wie zijn boek in de rechter hand wordt gegeven, zal zeggen: \"Komt, leest mijn boek.",
                            "verse 69:20": "Voorzeker, ik wist dat ik mijn afrekening tegemoet moest gaan.\"",
                            "verse 69:21": "Deze zal dan een heerlijk leven krijgen",
                            "verse 69:22": "In een verheven tuin,",
                            "verse 69:23": "Waarvan het fruit gemakkeljik bereikbaar zal zijn.",
                            "verse 69:24": "\"Eet en drinkt smakelijk als loon voor hetgeen gij in vroeger dagen hebt gedaan.\"",
                            "verse 69:25": "Maar, hij wiens boek in de linker hand wordt gegeven, zal zeggen: \"O was mijn boek mij maar niet gegeven!",
                            "verse 69:26": "En had ik maar niet geweten wat mijn oordeel was!",
                            "verse 69:27": "O, had de dood maar aan mij een einde gemaakt!",
                            "verse 69:28": "Mijn rijkdom heeft mij niet gebaat,",
                            "verse 69:29": "Mijn macht is van mij weg gegaan.\"",
                            "verse 69:30": "Grijpt hem en boeit hem.",
                            "verse 69:31": "Werpt hem dan in de hel.",
                            "verse 69:32": "Bindt hem vervolgens met een ketting vast waarvan de lengte zeventig armlengten bedraagt;",
                            "verse 69:33": "Want hij geloofde niet in God, de Grote.",
                            "verse 69:34": "Noch moedigde hij aan, de armen te spijzigen.",
                            "verse 69:35": "Daarom heeft hij hier geen vriend;",
                            "verse 69:36": "Noch voedsel, behalve spoelsel van wonden,",
                            "verse 69:37": "Dat niemand dan de zondaren zal gebruiken.",
                            "verse 69:38": "Neen, Ik zweer bij alles wat gij ziet,",
                            "verse 69:39": "En bij alles wat gij niet ziet,",
                            "verse 69:40": "Dit is voorzeker de boodschap die een eerwaardige boodschapper heeft gebracht.",
                            "verse 69:41": "Het is geen woord van een dichter; nietig is hetgeen gij gelooft.",
                            "verse 69:42": "Noch is het de uiting van een waarzegger; gering is de lering, die gij er uit trekt.",
                            "verse 69:43": "Het is een Openbaring van de Heer der werelden.",
                            "verse 69:44": "En indien hij enige woorden in Onze naam had uitgedacht,",
                            "verse 69:45": "Dan zouden Wij hem zeker bij de rechter hand hebben gegrepen.",
                            "verse 69:46": "En daarna zijn levensader hebben afgesneden,",
                            "verse 69:47": "En geen uwer zou ons van hem hebben kunnen tegenhouden.",
                            "verse 69:48": "Voorwaar, het is een vermaning voor de godvrezenden.",
                            "verse 69:49": "En voorzeker, Wij weten dat er onder u loochenaars zijn.",
                            "verse 69:50": "Waarlijk, de ongelovigen zullen er wroeging over hebben.",
                            "verse 69:51": "En voorwaar, het is de ware zekerheid.",
                            "verse 69:52": "Verheerlijk daarom de naam van uw Heer, de Luisterrijke."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 69:1": "The Reality!",
                            "verse 69:2": "What is the Reality ?",
                            "verse 69:3": "Ah, what will convey unto thee what the reality is!",
                            "verse 69:4": "(The tribes of) Thamud and A’ad disbelieved in the judgment to come.",
                            "verse 69:5": "As for Thamud, they were destroyed by the lightning.",
                            "verse 69:6": "And as for A’ad, they were destroyed by a fierce roaring wind,",
                            "verse 69:7": "Which He imposed on them for seven long nights and eight long days so that thou mightest have seen men lying overthrown, as they were hollow trunks of palm-trees.",
                            "verse 69:8": "Canst thou (O Muhammad) see any remnant of them ?",
                            "verse 69:9": "And Pharaoh and those before him, and the communities that were destroyed, brought error,",
                            "verse 69:10": "And they disobeyed the messenger of their Lord, therefor did He grip them with a tightening grip.",
                            "verse 69:11": "Lo! when the waters rose, We carried you upon the ship",
                            "verse 69:12": "That We might make it a memorial for you, and that remembering ears (that heard the story) might remember.",
                            "verse 69:13": "And when the trumpet shall sound one blast",
                            "verse 69:14": "And the earth with the mountains shall be lifted up and crushed with one crash,",
                            "verse 69:15": "Then, on that day will the Event befall.",
                            "verse 69:16": "And the heaven will split asunder, for that day it will be frail.",
                            "verse 69:17": "And the angels will be on the sides thereof, and eight will uphold the Throne of thy Lord that day, above them.",
                            "verse 69:18": "On that day ye will be exposed; not a secret of you will be hidden.",
                            "verse 69:19": "Then, as for him who is given his record in his right hand, he will say: Take, read my book!",
                            "verse 69:20": "Surely I knew that I should have to meet my reckoning.",
                            "verse 69:21": "Then he will be in blissful state",
                            "verse 69:22": "In a high garden",
                            "verse 69:23": "Whereof the clusters are in easy reach.",
                            "verse 69:24": "(And it will be said unto those therein): Eat and drink at ease for that which ye sent on before you in past days.",
                            "verse 69:25": "But as for him who is given his record in his left hand, he will say: Oh, would that I had not been given my book",
                            "verse 69:26": "And knew not what my reckoning!",
                            "verse 69:27": "Oh, would that it had been death!",
                            "verse 69:28": "My wealth hath not availed me,",
                            "verse 69:29": "My power hath gone from me.",
                            "verse 69:30": "(It will be said): Take him and fetter him",
                            "verse 69:31": "And then expose him to hell-fire",
                            "verse 69:32": "And then insert him in a chain whereof the length is seventy cubits.",
                            "verse 69:33": "Lo! He used not to believe in Allah the Tremendous,",
                            "verse 69:34": "And urged not on the feeding of the wretched.",
                            "verse 69:35": "Therefor hath he no lover here this day,",
                            "verse 69:36": "Nor any food save filth",
                            "verse 69:37": "Which none but sinners eat.",
                            "verse 69:38": "But nay! I swear by all that ye see",
                            "verse 69:39": "And all that ye see not",
                            "verse 69:40": "That it is indeed the speech of an illustrious messenger.",
                            "verse 69:41": "It is not poet’s speech - little is it that ye believe!",
                            "verse 69:42": "Nor diviner’s speech - little is it that ye remember!",
                            "verse 69:43": "It is a revelation from the Lord of the Worlds.",
                            "verse 69:44": "And if he had invented false sayings concerning Us,",
                            "verse 69:45": "We assuredly had taken him by the right hand",
                            "verse 69:46": "And then severed his life-artery,",
                            "verse 69:47": "And not one of you could have held Us off from him.",
                            "verse 69:48": "And lo! it is a warrant unto those who ward off (evil).",
                            "verse 69:49": "And lo! We know that some among you will deny (it).",
                            "verse 69:50": "And lo! it is indeed an anguish for the disbelievers.",
                            "verse 69:51": "And lo! it is absolute truth.",
                            "verse 69:52": "So glorify the name of thy Tremendous Lord."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 69:1": "The Sure Reality!",
                            "verse 69:2": "What is the Sure Reality?",
                            "verse 69:3": "And what will make thee realise what the Sure Reality is?",
                            "verse 69:4": "The Thamud and the ’Ad People (branded) as false the Stunning Calamity!",
                            "verse 69:5": "But the Thamud,- they were destroyed by a terrible Storm of thunder and lightning!",
                            "verse 69:6": "And the ’Ad, they were destroyed by a furious Wind, exceedingly violent;",
                            "verse 69:7": "He made it rage against them seven nights and eight days in succession: so that thou couldst see the (whole) people lying prostrate in its (path), as they had been roots of hollow palm-trees tumbled down!",
                            "verse 69:8": "Then seest thou any of them left surviving?",
                            "verse 69:9": "And Pharaoh, and those before him, and the Cities Overthrown, committed habitual Sin.",
                            "verse 69:10": "And disobeyed (each) the apostle of their Lord; so He punished them with an abundant Penalty.",
                            "verse 69:11": "We, when the water (of Noah’s Flood) overflowed beyond its limits, carried you (mankind), in the floating (Ark),",
                            "verse 69:12": "That We might make it a Message unto you, and that ears (that should hear the tale and) retain its memory should bear its (lessons) in remembrance.",
                            "verse 69:13": "Then, when one blast is sounded on the Trumpet,",
                            "verse 69:14": "And the earth is moved, and its mountains, and they are crushed to powder at one stroke,-",
                            "verse 69:15": "On that Day shall the (Great) Event come to pass.",
                            "verse 69:16": "And the sky will be rent asunder, for it will that Day be flimsy,",
                            "verse 69:17": "And the angels will be on its sides, and eight will, that Day, bear the Throne of thy Lord above them.",
                            "verse 69:18": "That Day shall ye be brought to Judgment: not an act of yours that ye hide will be hidden.",
                            "verse 69:19": "Then he that will be given his Record in his right hand will say: \"Ah here! Read ye my Record!",
                            "verse 69:20": "\"I did really understand that my Account would (One Day) reach me!\"",
                            "verse 69:21": "And he will be in a life of Bliss,",
                            "verse 69:22": "In a Garden on high,",
                            "verse 69:23": "The Fruits whereof (will hang in bunches) low and near.",
                            "verse 69:24": "\"Eat ye and drink ye, with full satisfaction; because of the (good) that ye sent before you, in the days that are gone!\"",
                            "verse 69:25": "And he that will be given his Record in his left hand, will say: \"Ah! Would that my Record had not been given to me!",
                            "verse 69:26": "\"And that I had never realised how my account (stood)!",
                            "verse 69:27": "\"Ah! Would that (Death) had made an end of me!",
                            "verse 69:28": "\"Of no profit to me has been my wealth!",
                            "verse 69:29": "\"My power has perished from me!\"...",
                            "verse 69:30": "(The stern command will say): \"Seize ye him, and bind ye him,",
                            "verse 69:31": "\"And burn ye him in the Blazing Fire.",
                            "verse 69:32": "\"Further, make him march in a chain, whereof the length is seventy cubits!",
                            "verse 69:33": "\"This was he that would not believe in God Most High.",
                            "verse 69:34": "\"And would not encourage the feeding of the indigent!",
                            "verse 69:35": "\"So no friend hath he here this Day.",
                            "verse 69:36": "\"Nor hath he any food except the corruption from the washing of wounds,",
                            "verse 69:37": "\"Which none do eat but those in sin.\"",
                            "verse 69:38": "So I do call to witness what ye see,",
                            "verse 69:39": "And what ye see not,",
                            "verse 69:40": "That this is verily the word of an honoured apostle;",
                            "verse 69:41": "It is not the word of a poet: little it is ye believe!",
                            "verse 69:42": "Nor is it the word of a soothsayer: little admonition it is ye receive.",
                            "verse 69:43": "(This is) a Message sent down from the Lord of the Worlds.",
                            "verse 69:44": "And if the apostle were to invent any sayings in Our name,",
                            "verse 69:45": "We should certainly seize him by his right hand,",
                            "verse 69:46": "And We should certainly then cut off the artery of his heart:",
                            "verse 69:47": "Nor could any of you withhold him (from Our wrath).",
                            "verse 69:48": "But verily this is a Message for the God-fearing.",
                            "verse 69:49": "And We certainly know that there are amongst you those that reject (it).",
                            "verse 69:50": "But truly (Revelation) is a cause of sorrow for the Unbelievers.",
                            "verse 69:51": "But verily it is Truth of assured certainty.",
                            "verse 69:52": "So glorify the name of thy Lord Most High."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 69:1": "The Indubitable!",
                            "verse 69:2": "What is the Indubitable?",
                            "verse 69:3": "And what will teach thee what is the Indubitable?",
                            "verse 69:4": "Thamood and Ad cried lies to the Clatterer.",
                            "verse 69:5": "As for Thamood, they were destroyed by the Screamer;",
                            "verse 69:6": "and as for Ad, they were destroyed by a wind clamorous,",
                            "verse 69:7": "violent that He compelled against them seven nights and eight days, uninterruptedly, and thou mightest see the people laid prostrate in it as if they were the stumps of fallen down palm-trees.",
                            "verse 69:8": "Now dost thou see any remnant of them?",
                            "verse 69:9": "Pharaoh likewise, and those before him, and the Subverted Cities -- they committed error,",
                            "verse 69:10": "and they rebelled against the Messenger of their Lord, and He seized them with a surpassing grip.",
                            "verse 69:11": "Lo, when the waters rose, We bore you in the running ship",
                            "verse 69:12": "that We might make it a reminder for you and for heeding ears to hold.",
                            "verse 69:13": "So, when the Trumpet is blown with a single blast",
                            "verse 69:14": "and the earth and the mountains are lifted up and crushed with a single blow,",
                            "verse 69:15": "then, on that day, the Terror shall come to pass,",
                            "verse 69:16": "and heaven shall be split, for upon that day it shall be very frail,",
                            "verse 69:17": "and the angels shall stand upon its borders, and upon that day eight shall carry above them the Throne of thy Lord.",
                            "verse 69:18": "On that day you shall be exposed, not one secret of yours concealed.",
                            "verse 69:19": "Then as for him who is given his book in his right hand, he shall say, ’Here, take and read my book!",
                            "verse 69:20": "Certainly I thought that I should encounter my reckoning.’",
                            "verse 69:21": "So he shall be in a pleasing life",
                            "verse 69:22": "in a lofty Garden,",
                            "verse 69:23": "its clusters nigh to gather.",
                            "verse 69:24": "’Eat and drink with wholesome appetite for that you did long ago, in the days gone by.’",
                            "verse 69:25": "But as for him who is given his book in his left hand, he shall say, ’Would that I had not been given my book",
                            "verse 69:26": "and not known my reckoning!",
                            "verse 69:27": "Would it had been the end!",
                            "verse 69:28": "My wealth has not availed me,",
                            "verse 69:29": "my authority is gone from me.’",
                            "verse 69:30": "’Take him, and fetter him,",
                            "verse 69:31": "and then roast him in Hell,",
                            "verse 69:32": "then in a chain of seventy cubits’ length insert him!",
                            "verse 69:33": "Behold, he never believed in God the All-mighty,",
                            "verse 69:34": "and he never urged the feeding of the needy;",
                            "verse 69:35": "therefore he today has not here one loyal friend,",
                            "verse 69:36": "neither any food saving foul pus,",
                            "verse 69:37": "that none excepting the sinners eat.’",
                            "verse 69:38": "No! I swear by that you see",
                            "verse 69:39": "and by that you do not see,",
                            "verse 69:40": "it is the speech of a noble Messenger.",
                            "verse 69:41": "It is not the speech of a poet (little do you believe)",
                            "verse 69:42": "nor the speech of a soothsayer (little do you remember).",
                            "verse 69:43": "A sending down from the Lord of all Being.",
                            "verse 69:44": "Had he invented against Us any sayings,",
                            "verse 69:45": "We would have seized him by the right hand,",
                            "verse 69:46": "then We would surely have cut his life-vein",
                            "verse 69:47": "and not one of you could have defended him.",
                            "verse 69:48": "Surely it is a Reminder to the godfearing;",
                            "verse 69:49": "but We know that some of you will cry lies.",
                            "verse 69:50": "Surely it is a sorrow to the unbelievers;",
                            "verse 69:51": "yet indeed it is the truth of certainty.",
                            "verse 69:52": "Then magnify the Name of thy Lord, the All-mighty."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 69:1": "OH, THE LAYING-BARE of the truth!",
                            "verse 69:2": "How awesome that laying-bare of the truth!",
                            "verse 69:3": "And what could make thee conceive what that laying-bare of the truth will be?",
                            "verse 69:4": "THE LIE gave [the tribes of] Thamūd and ’ād to [all tidings of] that sudden calamity!",
                            "verse 69:5": "Now as for the Thamūd – they were destroyed by a violent upheaval [of the earth];",
                            "verse 69:6": "and as for the ’ād – they were destroyed by a stormwind furiously raging,",
                            "verse 69:7": "which He willed against them for seven nights and eight days without cease, so that in the end thou couldst see those people laid low [in death], as though they were so many [uprooted] trunks of hollow palm trees:",
                            "verse 69:8": "and dost thou now see any remnant of them?",
                            "verse 69:9": "And there was Pharaoh, too, and [many of] those who lived before him, and the cities that were overthrown – [all of them] indulged in sin upon sin",
                            "verse 69:10": "and rebelled against their Sustainer’s apostles: and so He took them to task with a punishing grasp exceedingly severe!",
                            "verse 69:11": "[And] behold: when the waters [of Noah’s flood] burst beyond all limits, it was We who caused you to be borne [to safety] in that floating ark,",
                            "verse 69:12": "so that We might make all this a [lasting] reminder to you all, and that every wide-awake ear might consciously take it in.",
                            "verse 69:13": "Hence, [bethink yourselves of the Last Hour,] when the trumpet [of judgment] shall be sounded with a single blast,",
                            "verse 69:14": "and the earth and the mountains shall be lifted up and crushed with a single stroke!",
                            "verse 69:15": "And so, that which must come to pass will on that Day have come to pass;",
                            "verse 69:16": "and the sky will be rent asunder – for frail will it have become on that Day",
                            "verse 69:17": "and the angels [will appear] at its ends, and, above them, eight will bear aloft on that Day the throne of thy Sustainer’s almightiness....",
                            "verse 69:18": "On that Day you shall be brought to judgment: not [even] the most hidden of your deeds will remain hidden.",
                            "verse 69:19": "Now as for him whose record shall be placed in his right hand, he will exclaim: \"Come you all! Read this my record!",
                            "verse 69:20": "Behold, I did know that [one day] I would have to face my account!\"",
                            "verse 69:21": "And so he will find himself in a happy state of life,",
                            "verse 69:22": "in a lofty paradise,",
                            "verse 69:23": "with its fruits within easy reach.",
                            "verse 69:24": "[And all who are thus blest will be told:] \"Eat and drink with good cheer in return for all [the good deeds] that you have sent ahead in days gone by!\"",
                            "verse 69:25": "But as for him whose record shall be placed in his left hand, he will exclaim: \"Oh, would that I had never been shown this my record,",
                            "verse 69:26": "and neither known this my account!",
                            "verse 69:27": "Oh, would that this [death of mine] had been the end of me!",
                            "verse 69:28": "Of no avail to me is all that I have [ever] possessed,",
                            "verse 69:29": "[and] all my power of argument has died away from me!\"",
                            "verse 69:30": "[Thereupon the command will go forth:] \"Lay hold of him, and shackle him,",
                            "verse 69:31": "and then let him enter hell,",
                            "verse 69:32": "and then thrust him into a chain [of other sinners like him – a chain] the length whereof is seventy cubits:",
                            "verse 69:33": "for, behold, he did not believe in God, the Tremendous,",
                            "verse 69:34": "and did not feel any urge to feed the needy:",
                            "verse 69:35": "and so, no friend has he here today,",
                            "verse 69:36": "nor any food save the filth",
                            "verse 69:37": "which none but the sinners eat!",
                            "verse 69:38": "BUT NAY! I call to witness all that you can see,",
                            "verse 69:39": "as well as all that you cannot see!",
                            "verse 69:40": "Behold, this [Qur’ān] is indeed the [inspired] word of a noble apostle,",
                            "verse 69:41": "and is not – however little you may [be prepared to] believe it – the word of a poet;",
                            "verse 69:42": "and neither is it – however little you may [be prepared to] take it to heart – the word of a soothsayer:",
                            "verse 69:43": "[it is] a revelation from the Sustainer of all the worlds.",
                            "verse 69:44": "Now if he [whom We have entrusted with it] had dared to attribute some [of his own] sayings unto Us,",
                            "verse 69:45": "We would indeed have seized him by his right hand,",
                            "verse 69:46": "and would indeed have cut his life-vein,",
                            "verse 69:47": "and none of you could have saved him!",
                            "verse 69:48": "And, verily, this [Qur’ān] is a reminder to all the God-conscious.",
                            "verse 69:49": "And, behold, well do We know that among you are such as will give the lie to it:",
                            "verse 69:50": "yet, behold, this [rejection] will indeed become a source of bitter regret for all who deny the truth [of God’s revelation]",
                            "verse 69:51": "for, verily, it is truth absolute!",
                            "verse 69:52": "Extol, then, the limitless glory of thy Sustainer’s mighty name!"
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 69:1": "The Imminent Happening!",
                            "verse 69:2": "What is the Imminent Happening?",
                            "verse 69:3": "And what can let you know what the Imminent happening is?",
                            "verse 69:4": "Thamūd and ‘Ād had denied (the happening of) the Shocking Event (the Day of Judgment).",
                            "verse 69:5": "As for Thamūd, they were destroyed by that (dreadful cry), which exceeded all limits.",
                            "verse 69:6": "And as for ‘Ād, they were destroyed by a violent windstorm",
                            "verse 69:7": "that He imposed on them for seven nights and eight consecutive days; so you could see them thrown on the ground, as if they were trunks of hollow palm-trees.",
                            "verse 69:8": "Now, do you see any remnant of them?",
                            "verse 69:9": "And Fir‘aun (Pharaoh) and those before him and the overthrown towns came up with evil,",
                            "verse 69:10": "and they disobeyed the messenger of their Lord, so He seized them with an extremely severe seizure.",
                            "verse 69:11": "When the water overflowed (in the Deluge of NūH), We let you (O mankind,) board the floating ship,",
                            "verse 69:12": "so that We make it a reminder for you, and so that a preserving ear (that hears their story) may preserve it.",
                            "verse 69:13": "Then, once the Trumpet will be blown for the first time,",
                            "verse 69:14": "and the earth and the mountains will be lifted and crushed into pieces with a single blow,",
                            "verse 69:15": "then on that Day the Happening will happen,",
                            "verse 69:16": "and the sky will burst apart, while it will have become frail on that day.",
                            "verse 69:17": "And the angels will be on its borders. And on that Day, the Throne of your Lord will be carried above them by eight (angels).",
                            "verse 69:18": "On that day, you will be brought forward in a way that no secret of yours will remain secret.",
                            "verse 69:19": "Now, as for him who is given his book in his right hand, he will say (to his colleagues), “Come here, read my book.",
                            "verse 69:20": "I was sure that I would encounter my reckoning.”",
                            "verse 69:21": "So he will be in a well-pleasing life",
                            "verse 69:22": "in a lofty garden,",
                            "verse 69:23": "the fruits of which will be close at hand.",
                            "verse 69:24": "(It will be said to such people,) “Eat and drink with pleasure, as a reward for what you did in advance during past days.”",
                            "verse 69:25": "As for him who will be given his book in his left hand, he will say, “ Oh, would that I had not been given my book,",
                            "verse 69:26": "and I had never known what my account is!",
                            "verse 69:27": "Oh, would that it (death) had been the end of the matter!",
                            "verse 69:28": "My wealth has not been of any use to me.",
                            "verse 69:29": "My power has gone from me for good.”",
                            "verse 69:30": "(Then it will be said to angels,) “Seize him, then put a collar around his neck,",
                            "verse 69:31": "and then, let him burn in the blazing fire.",
                            "verse 69:32": "Thereafter, fasten him with a chain the measure of which is seventy hands.”",
                            "verse 69:33": "Indeed, he did not believe in Allah, the Almighty,",
                            "verse 69:34": "and did not persuade (others) to feed the needy.",
                            "verse 69:35": "So, he has no friend here today,",
                            "verse 69:36": "nor any food except that which comes out from wounds when washing,",
                            "verse 69:37": "which is eaten by none but the sinners.",
                            "verse 69:38": "I swear by what you see,",
                            "verse 69:39": "and what you do not see,",
                            "verse 69:40": "it is surely the speech of a noble Messenger, (that he conveys from Allah).",
                            "verse 69:41": "and it is not the speech of a poet, (but) little you believe,",
                            "verse 69:42": "nor is it the speech of a soothsayer, (but) little you heed to the advice.",
                            "verse 69:43": "It is a revelation from the Lord of the worlds.",
                            "verse 69:44": "Had he (the prophet) forged some statements in Our name,",
                            "verse 69:45": "We would have certainly seized him by the right hand,",
                            "verse 69:46": "and then severed his life-artery,",
                            "verse 69:47": "and none of you could have saved him from it.",
                            "verse 69:48": "It is infact a Reminder for the God-fearing.",
                            "verse 69:49": "And, of course, We know that among you there are deniers.",
                            "verse 69:50": "And surely, it is a cause of remorse for the disbelievers.",
                            "verse 69:51": "And it is surely an absolute truth.",
                            "verse 69:52": "So, pronounce the purity of the name of your magnificent Lord."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 69:1": "The Reality.",
                            "verse 69:2": "What is the Reality?",
                            "verse 69:3": "And how would you know what the Reality is?",
                            "verse 69:4": "Thamūd and ‘ād denied the Clatterer.",
                            "verse 69:5": "As for Thamūd, they were destroyed by the [overwhelming] Roar.",
                            "verse 69:6": "And as for ‘ād, they were destroyed by a deafening violent wind.",
                            "verse 69:7": "He forced it upon them for seven nights and eight days, successively, so that you might have seen the people therein lying prostrate, as if they were the hollow trunks of palm-trees.",
                            "verse 69:8": "So do you see any remnant of them?",
                            "verse 69:9": "And Pharaoh and those of his followers and the Deviant [cities] brought iniquity.",
                            "verse 69:10": "Then they disobeyed the messenger of their Lord, so He seized them with a devastating blow.",
                            "verse 69:11": "Truly when the waters rose high, We carried you in the sailing vessel,",
                            "verse 69:12": "so that We might make it a reminder for you and that receptive ears might remember it.",
                            "verse 69:13": "Thus when the Trumpet is blown with a single blast,",
                            "verse 69:14": "and the earth and the mountains are lifted and levelled with a single levelling,",
                            "verse 69:15": "then, on that day, the [imminent] Event will come to pass,",
                            "verse 69:16": "and the heaven will be rent asunder — for it will be very frail on that day —",
                            "verse 69:17": "and the angels will be [all] over its borders, and above them — on that day eight will carry the Throne of your Lord.",
                            "verse 69:18": "On that day you will be exposed. No hidden thing of yours will remain hidden.",
                            "verse 69:19": "As for him who is given his book in his right hand, he will say: ‘Here, read my book!",
                            "verse 69:20": "I was truly certain that I would encounter my account’.",
                            "verse 69:21": "So he will enjoy a pleasant living,",
                            "verse 69:22": "in a lofty Garden,",
                            "verse 69:23": "whose clusters are in easy reach.",
                            "verse 69:24": "‘Eat and drink in enjoyment for what you did in advance in former days’.",
                            "verse 69:25": "But as for him who is given his book in his left hand, he will say, ‘O would that I had not been given my book,",
                            "verse 69:26": "and not known what my account were!",
                            "verse 69:27": "O would that it had been the [final] end.",
                            "verse 69:28": "My wealth has not availed me.",
                            "verse 69:29": "My authority has gone from me’.",
                            "verse 69:30": "‘Seize him, then fetter him,",
                            "verse 69:31": "then admit him into Hell-fire,.",
                            "verse 69:32": "then in a chain whose length is seventy cubits insert him.",
                            "verse 69:33": "Lo! he never believed in God the Tremendous,",
                            "verse 69:34": "and never urged the feeding of the needy;",
                            "verse 69:35": "therefore here today he has no [loyal] friend,",
                            "verse 69:36": "nor any food except pus,",
                            "verse 69:37": "which none shall eat but the sinners’.",
                            "verse 69:38": "So indeed I swear by all that you see,",
                            "verse 69:39": "and all that you do not see",
                            "verse 69:40": "it is indeed the speech of a noble messenger.",
                            "verse 69:41": "And it is not the speech of a poet. Little do you believe!",
                            "verse 69:42": "Nor [is it] the speech of a soothsayer. Little do you remember!",
                            "verse 69:43": "A revelation from the Lord of the Worlds.",
                            "verse 69:44": "And had he fabricated any lies against Us,",
                            "verse 69:45": "We would have assuredly seized him by the Right Hand,",
                            "verse 69:46": "then We would have assuredly severed his life-artery,",
                            "verse 69:47": "and not one of you could have defended him.",
                            "verse 69:48": "And assuredly it is a reminder for the God-fearing.",
                            "verse 69:49": "And assuredly We know that some of you are deniers.",
                            "verse 69:50": "And assuredly it is a [cause of] anguish for the disbelievers.",
                            "verse 69:51": "And assuredly it is the certain truth.",
                            "verse 69:52": "So glorify the Name of your Lord, the Tremendous."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 69:1": "The surely Inevitable Hour!",
                            "verse 69:2": "What is the surely Inevitable Hour?",
                            "verse 69:3": "And what has made you alert what (calamity) surely is the Inevitable Hour?",
                            "verse 69:4": "Thamud and ‘Ad rejected the (calamity of a) Shattering Gravitational Collision (of all the existent cosmic bodies).",
                            "verse 69:5": "So, as for the people of Thamud, they were destroyed by the extremely violent, Deafening Blast.",
                            "verse 69:6": "And as for the people of ‘Ad, they (too) were destroyed by a violently cold, roaring gale.",
                            "verse 69:7": "Allah made that (gale) seize them for consecutive seven nights and eight days. So, you could see them lying dead (during that time as if) they were hollow roots of the uprooted palm trees.",
                            "verse 69:8": "So do you see any of them surviving?",
                            "verse 69:9": "And Pharaoh and those before him and (the dwellers of) the overthrown towns (of the community of Lut [Lot]) committed grave sins.",
                            "verse 69:10": "So they (also) disobeyed the Messenger of their Lord. And Allah seized them with a mighty seizure.",
                            "verse 69:11": "Indeed, when the water (of the Deluge) overflowed the limit, We carried you in the floating Ark,",
                            "verse 69:12": "So that We make this (episode a reminding) lesson of warning for you and that the retentive ears may retain it.",
                            "verse 69:13": "Then when the Trumpet will be blown once,",
                            "verse 69:14": "And the earth and mountains will be removed (from their places), they will then be crushed to sand particles in a single crash.",
                            "verse 69:15": "Then that will be the Hour when the surely Inevitable (calamity) will occur.",
                            "verse 69:16": "And (all) the heavenly bodies will split apart and this universe will come to comprise (black) holes (by means of a force which coordinates and keeps the system going).",
                            "verse 69:17": "And the angels will be standing on its edges and above them that Day, and eight (angels or parties of angels) will be carrying the Throne of your Lord.",
                            "verse 69:18": "That Day you will be made to appear (for reckoning). Nothing of your secrets will remain hidden.",
                            "verse 69:19": "So the one who will be given his record in the right hand will say (pleased): ‘Come and read my record.",
                            "verse 69:20": "I firmly believed that I would find my account (easy).’",
                            "verse 69:21": "So he will live a pleasant life,",
                            "verse 69:22": "In an elevated lofty Paradise,",
                            "verse 69:23": "The clusters of its fruits hanging low (due to abundance).",
                            "verse 69:24": "(It will be said to them:) ‘Eat and drink rejoicing, in recompense of (your deeds) that you had sent forward during the days of your past (life).’",
                            "verse 69:25": "And as for him who will be given his record in his left hand, he will say: ‘Would that I had not been given my record!",
                            "verse 69:26": "And would that I had not known about my account!",
                            "verse 69:27": "Alas! Would that (death) had settled my affair once and for all!",
                            "verse 69:28": "Today my wealth has not been able to keep (the torment) away from me even a little.",
                            "verse 69:29": "My power and domain have (also) gone from me.’",
                            "verse 69:30": "(It will be commanded:) ‘Seize him and put him in neck-fetter.",
                            "verse 69:31": "Then cast him into Hell.",
                            "verse 69:32": "Then bind him tightly in a seventy yard long chain.",
                            "verse 69:33": "Verily, he did not believe in Allah, the Lord of Majesty.",
                            "verse 69:34": "Nor did he urge the feeding of the poor.",
                            "verse 69:35": "So Today he does not have any warm friend.",
                            "verse 69:36": "Nor has he anything to eat except filthy pus,",
                            "verse 69:37": "That no one will eat except the sinners.’",
                            "verse 69:38": "So I swear by the things that you see,",
                            "verse 69:39": "And by those things that you do not see.",
                            "verse 69:40": "Assuredly, this (Qur’an) is the (God-sent) commandment of the Exalted and Glorious Messenger ([blessings and peace be upon him] which he expounds as a Messenger and as a Vicegerent).",
                            "verse 69:41": "And it is not the poetry of a poet (composed with literary expertise). You have but little faith.",
                            "verse 69:42": "Nor is it the word of a fortune-teller (designed by skilful guesswork). You take but little advice.",
                            "verse 69:43": "(This) is sent down by the Lord of all the worlds.",
                            "verse 69:44": "And had he ascribed to Us even a (single) fabricated thing,",
                            "verse 69:45": "We would have seized him with full force and might,",
                            "verse 69:46": "Then certainly We would have cut his life artery,",
                            "verse 69:47": "Then no one of you could have held (Us) back from it.",
                            "verse 69:48": "So no doubt this (Qur’an) is direction and guidance for the Godfearing.",
                            "verse 69:49": "And surely, We know that some of you are the beliers (of this open truth).",
                            "verse 69:50": "And surely, this is (a cause of) bitter regret for the disbelievers.",
                            "verse 69:51": "And undeniably, it is the truth of Absolute Certitude.",
                            "verse 69:52": "So, (O Esteemed Beloved,) glorify your Lord, Most Magnificent, with persistence."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "Varma tuho!",
                            "verse 69:2": "Mikä on varma tuho?",
                            "verse 69:3": "Ja miten saisi sinut käsittämään, mikä varma tuho on?",
                            "verse 69:4": "Tamuud ja Aad väittivät, ettei tuomiopäivää tule.",
                            "verse 69:5": "Tamuudin kansan tuhosi ärjyvä ukonilma,",
                            "verse 69:6": "Aadin tuhosi raivoisa tuuli, joka puhalsi tavattomalla voimalla;",
                            "verse 69:7": "se raivosi heidän keskuudessaan seitsemän yötä ja seitsemän päivää suurella voimalla, niin että olisit voinut nähdä ihmisten kaatuvan maahan kuin palmujen ontot rungot.",
                            "verse 69:8": "Näetkö heistä jälkeäkään?",
                            "verse 69:9": "Farao ja ne, jotka elivät ennen häntä, sekä hävitetyt kaupungit tekivät myös syntiä",
                            "verse 69:10": "ollen tottelemattomia Herransa sananjulistajalle; siksi Hän kuritti heitä väkevin ottein.",
                            "verse 69:11": "Kun vesi tulvi, Me totisesti annoimme laivan kantaa teitä,",
                            "verse 69:12": "teille ojennukseksi ja jotta kuunteleva korva vaarin ottaisi ja muistaisi sen.",
                            "verse 69:13": "Kun, puhalletaan yhden ainoan kerran pasuunaan",
                            "verse 69:14": "ja maa sekä vuoret kohoavat ja sitten yht'äkkiä vaipuvat murskattuina alas,",
                            "verse 69:15": "sinä päivänä on suuri tuho tapahtuva,",
                            "verse 69:16": "taivas repeää; sinä päivänä se syöksyy alas.",
                            "verse 69:17": "Enkeleitä on oleva ylt'ympäri, ja kahdeksan heistä kantaa yläpuolellaan Herrasi valtaistuinta.",
                            "verse 69:18": "Sinä päivänä teidät tuodaan oikeuden eteen, ja yksikään salaisuutenne ei voi jäädä kätköön.",
                            "verse 69:19": "Se, jolle kirja on annettu hänen oikeaan käteensä, sanoo: »Tulkaa ja lukekaa kirjani!",
                            "verse 69:20": "Totisesti uskon, että koittaa tilinteon päivä.»",
                            "verse 69:21": "Ja hän on saava mieluisan elämän,",
                            "verse 69:22": "ihanassa puutarhassa,",
                            "verse 69:23": "jossa hedelmät ovat käden ulottuvilla.",
                            "verse 69:24": "»Syökää ja juokaa mielenne mukaan palkaksi siitä, mitä olette tehneet menneinä päivinä!»",
                            "verse 69:25": "Ja hän, jolle kirja on annettu vasempaan käteen, sanoo: »Oi, jospa en olisi kirjaani milloinkaan saanut,",
                            "verse 69:26": "ja jospa en olisi koskaan joutunut kokemaan, mitä tilinteko on!",
                            "verse 69:27": "Oi, jospa kuolema olisi ollut kaiken loppu!",
                            "verse 69:28": "Rikkauteni ei minua lainkaan hyödytä,",
                            "verse 69:29": "valtani on minulta häipynyt.»",
                            "verse 69:30": "»Ottakaa hänet, sitokaa hänet",
                            "verse 69:31": "ja heittäkää sitten helvettiin!",
                            "verse 69:32": "Kytkekää hänet kahleisiin, joiden pituus on seitsemänkymmentä kyynärää!",
                            "verse 69:33": "Totisesti, hän ei uskonut Jumalaan, suureen,",
                            "verse 69:34": "eikä kehoittanut ravitsemaan köyhiä;",
                            "verse 69:35": "sentähden hänellä ei ole yhtään ystävää tuona päivänä",
                            "verse 69:36": "eikä muuta ruokaa kuin likavesi,",
                            "verse 69:37": "jota vain jumalattomat nielevät.»",
                            "verse 69:38": "Mutta ei! Vannon kaiken sen nimessä, mitä näette",
                            "verse 69:39": "ja mitä eivät silmänne näe:",
                            "verse 69:40": "Totisesti, se on kunnioitettavan sananjulistajan sana",
                            "verse 69:41": "eikä mitään runoilijan puhetta - vähän te uskotte -",
                            "verse 69:42": "ei se liioin ole mitään ennustelijan puhetta - vähän te käsitätte -",
                            "verse 69:43": "se on ilmoitus Jumalalta, maailman Herralta.",
                            "verse 69:44": "Ja jos profeetta olisi sepitellyt runoja Meistä,",
                            "verse 69:45": "olisimme totisesti tarttunut häntä oikeaan käteen",
                            "verse 69:46": "ja katkaissut häneltä suuren valtasuonen,",
                            "verse 69:47": "teidän kenenkään voimatta Meitä siitä estää.",
                            "verse 69:48": "Tämä on totisesti muistutus niille, jotka karttavat pahaa.",
                            "verse 69:49": "Ja Me totisesti tiedämme, että joukossanne on sellaisia, jotka julistavat totuuden valheeksi,",
                            "verse 69:50": "ja totisesti tuleva tuomio on surkea asia epäuskoisille,",
                            "verse 69:51": "mutta se on totisesti varma todellisuus.",
                            "verse 69:52": "Ylistä siis Herrasi, suuren, nimeä!"
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 69:1": "l'Inéluctable !",
                            "verse 69:2": "Qu'est-ce que l'Inéluctable ?",
                            "verse 69:3": "Qu'est-ce qui te fera connaître ce qu'est l'Inéluctable ?",
                            "verse 69:4": "Les Thamoud et les 'Ad ont traité de mensonge le grand coup.",
                            "verse 69:5": "Pour les Thamoud, ils ont été détruits par la foudre.",
                            "verse 69:6": "Quand aux 'Ad, ils ont été détruits par un vent mugissant et impétueux",
                            "verse 69:7": "que Dieu a fait souffler contre eux durant sept nuits et huit jours sans discontinuer. Alors, tu aurais pu voir ces gens couchés à terre comme des troncs de palmiers évidés.",
                            "verse 69:8": "Peux-tu en voir qui auraient subsisté ?",
                            "verse 69:9": "Pharaon, ceux qui vécurent avant lui et les cités renversées commirent des fautes :",
                            "verse 69:10": "ils désobéirent au prophète de leur Seigneur, et Celui-ci les saisit avec une force irrésistible.",
                            "verse 69:11": "Mais Nous, lorsque l'eau déborda, Nous vous portâmes sur le vaisseau,",
                            "verse 69:12": "afin d'en faire pour vous un rappel et pour qu'une oreille attentive le retienne.",
                            "verse 69:13": "Lorsqu'on sonnera une seule fois la trompette,",
                            "verse 69:14": "lorsque la terre et les montagnes seront emportées et pulvérisées d'un seul coup,",
                            "verse 69:15": "ce Jour-là surviendra l'Evénement ;",
                            "verse 69:16": "le ciel se fendra et, ce Jour-là, il sera fragile.",
                            "verse 69:17": "Les anges se tiendront sur ses confins et, ce Jour-là, huit d'entre eux porteront au-dessus d'eux le trône de ton Seigneur.",
                            "verse 69:18": "Ce Jour-là, vous serez exposés sans qu'aucun de vos secrets reste caché.",
                            "verse 69:19": "Celui qui recevra son livre dans la main droite dira : \" Tenez, lisez mon livre !",
                            "verse 69:20": "Je pensais bien que j'aurais à rendre compte ! \",",
                            "verse 69:21": "et il vivra satisfait",
                            "verse 69:22": "dans un Jardin élevé,",
                            "verse 69:23": "dont les fruits seront à portée de main.",
                            "verse 69:24": "\" Mangez et buvez heureux, en récompense de ce que vous avez accompli durant les jours passés \".",
                            "verse 69:25": "Quant à celui qui recevra son livre dans la main gauche, il dira : \" Malheur à moi !...Puissé-je ne pas avoir reçu mon livre",
                            "verse 69:26": "et ne pas connaître mon compte !",
                            "verse 69:27": "Malheur à moi pour ce qui m'échoit !",
                            "verse 69:28": "Ma fortune ne m'a servi à rien",
                            "verse 69:29": "et mon pouvoir m'a abandonné ! \"",
                            "verse 69:30": "\" Saisissez-le et mettez-lui un carcan !",
                            "verse 69:31": "Puis jetez-le dans la Fournaise",
                            "verse 69:32": "et, ensuite, liez-le avec une chaîne de soixante-dix coudées \".",
                            "verse 69:33": "Il ne croyait pas en Dieu le Magnifique,",
                            "verse 69:34": "il n'encourageait pas à nourrir le pauvre.",
                            "verse 69:35": "Aujourd'hui, il ne lui reste aucun ami dévoué,",
                            "verse 69:36": "ni d'autre nourriture qu'un aliment fétide",
                            "verse 69:37": "dont seuls les pécheurs se nourrissent.",
                            "verse 69:38": "Ainsi donc, J'en jure par ce que vous voyez",
                            "verse 69:39": "et par ce que vous ne voyez pas :",
                            "verse 69:40": "c'est là, en vérité, la parole d'un noble Envoyé,",
                            "verse 69:41": "ce n'est pas la parole d'un poète ; comme votre foi est faible !",
                            "verse 69:42": "ce n'est pas non plus la parole d'un devin ; comme vous réfléchissez peu !",
                            "verse 69:43": "c'est une révélation du Seigneur des mondes !",
                            "verse 69:44": "S'il avait inventé contre Nous quelques paroles mensongères,",
                            "verse 69:45": "Nous l'aurions pris par la main droite,",
                            "verse 69:46": "puis Nous lui aurions tranché l'aorte",
                            "verse 69:47": "et nul d'entre vous n'aurait pu s'y opposer.",
                            "verse 69:48": "C'est là un rappel pour ceux qui craignent Dieu,",
                            "verse 69:49": "mais Nous savons que certains d'entre vous crient au mensonge !",
                            "verse 69:50": "C'est là un sujet de lamentation pour les mécréants !",
                            "verse 69:51": "C'est là la Vérité et la certitude absolue !",
                            "verse 69:52": "Glorifie le Nom de ton Seigneur, le Magnifique !"
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 69:1": "L’inévitable [l’Heure qui montre la vérité].",
                            "verse 69:2": "Qu’est-ce que l’inévitable ?",
                            "verse 69:3": "Et qui te dira ce que c’est que l’inévitable ?",
                            "verse 69:4": "Les Tamud et les Aad avaient traité de mensonge le cataclysme.",
                            "verse 69:5": "Quant aux Tamud, ils furent détruits par le [bruit] excessivement fort.",
                            "verse 69:6": "Et quant aux Aad, ils furent détruits par un vent mugissant et furieux",
                            "verse 69:7": "qu’ [Dieu] déchaîna contre eux pendant sept nuits et huit jours consécutifs; tu voyais alors les gens renversés par terre comme des souches de palmiers évidées.",
                            "verse 69:8": "En vois-tu le moindre vestige ?",
                            "verse 69:9": "Pharaon et ceux qui vécurent avant lui ainsi que les Villes renversées commirent des fautes .",
                            "verse 69:10": "Ils désobéirent au Messager de leur Seigneur. Celui-ci donc, les saisit d’une façon irrésistible.",
                            "verse 69:11": "C’est Nous qui, quand l’eau déborda , vous avons chargés sur l’Arche",
                            "verse 69:12": "afin d’en faire pour vous un rappel que toute oreille fidèle conserve.",
                            "verse 69:13": "Puis, quand d’un seul souffle, on soufflera dans la Trompe,",
                            "verse 69:14": "et que la terre et les montagnes seront soulevées puis tassées d’un seul coup;",
                            "verse 69:15": "Ce jour-là alors, l’événement se produira,",
                            "verse 69:16": "et le ciel se fendra et sera fragile, ce jour-là.",
                            "verse 69:17": "Et sur ses côtés [se tiendront] les Anges, tandis que huit, ce jour-là, porteront au-dessus d’eux le Trône de ton Seigneur.",
                            "verse 69:18": "Ce jour-là vous serez exposés; et rien de vous ne sera caché.",
                            "verse 69:19": "Quant à celui à qui on aura remis le Livre en sa main droite, il dira : «Tenez ! lisez mon livre.",
                            "verse 69:20": "J’étais sûr d’y trouver mon compte».",
                            "verse 69:21": "Il jouira d’une vie agréable :",
                            "verse 69:22": "dans un Jardin haut placé",
                            "verse 69:23": "dont les fruits sont à portées de la main.",
                            "verse 69:24": "«Mangez et buvez agréablement pour ce que vous avez avancé dans les jours passés».",
                            "verse 69:25": "Quant à celui à qui on aura remis le Livre en sa main gauche, il dira : «Hélas pour moi ! J’aurai souhaité qu’on ne m’ait pas remis mon livre,",
                            "verse 69:26": "et ne pas avoir connu mon compte...",
                            "verse 69:27": "Hélas, comme j’aurais souhaité que [ma première mort] fût la définitive.",
                            "verse 69:28": "Ma fortune ne ma servi à rien.",
                            "verse 69:29": "Mon autorité est anéantie et m’a quitté ! ».",
                            "verse 69:30": "«Saisissez-le ! Puis, mettez-lui un carcan;",
                            "verse 69:31": "ensuite, brûlez-le dans la Fournaise;",
                            "verse 69:32": "puis, liez-le avec une chaîne de soixante-dix coudées,",
                            "verse 69:33": "car il ne croyait pas en Dieu, le Très Grand.",
                            "verse 69:34": "et n’incitait pas à nourrir le pauvre.",
                            "verse 69:35": "Il n’a pour lui ici, aujourd’hui, point d’ami chaleureux [pour le protéger],",
                            "verse 69:36": "ni d’autre nourriture que du pus,",
                            "verse 69:37": "que seuls les fautifs mangeront».",
                            "verse 69:38": "Mais non... Je jure par ce que vous voyez,",
                            "verse 69:39": "ainsi que par ce que vous ne voyez pas,",
                            "verse 69:40": "que ceci [le Coran] est la parole d’un noble Messager ,",
                            "verse 69:41": "et que ce n’est pas la parole d’un poète; mais vous ne croyez que très peu,",
                            "verse 69:42": "ni la parole d’un devin, mais vous vous rappelez bien peu.",
                            "verse 69:43": "C’est une révélation du Seigneur de l’Univers.",
                            "verse 69:44": "Et s’il avait forgé quelques paroles qu’ils Nous avait attribuées,",
                            "verse 69:45": "Nous l’aurions saisi de la main droite,",
                            "verse 69:46": "ensuite, Nous lui aurions tranché l’aorte.",
                            "verse 69:47": "Et nul d’entre vous n’aurait pu lui servir de rempart.",
                            "verse 69:48": "C’est en vérité un rappel pour les pieux.",
                            "verse 69:49": "Et Nous savons qu’il y a parmi vous qui le traitent de menteur;",
                            "verse 69:50": "mais en vérité, ce sera un sujet de regret pour les mécréants,",
                            "verse 69:51": "c’est là la véritable certitude.",
                            "verse 69:52": "Glorifie donc le nom de ton Seigneur, le Très Grand !"
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "Das Unvermeidliche!",
                            "verse 69:2": "Was ist das Unvermeidliche?",
                            "verse 69:3": "Wie kannst du wissen, was das Unvermeidliche ist?",
                            "verse 69:4": "Die Thamüd sowohl wie die Àd glaubten nicht an das dräuende Unheil.",
                            "verse 69:5": "Dann, was die Thamüd anlangt, so wurden sie durch einen fürchterlichen Schall vernichtet.",
                            "verse 69:6": "Und was die Àd anlangt, so wurden sie durch einen gewaltigen Sturmwind vernichtet,",
                            "verse 69:7": "Den Er sieben Nächte und acht Tage lang ununterbrochen gegen sie wüten ließ, so daß du das Volk niedergestreckt darin hättest liegen sehn können, als waren sie hohle Schäfte von Palmbäumen.",
                            "verse 69:8": "Siehst du von ihnen einen übrig?",
                            "verse 69:9": "Und Pharao und die vor ihm waren und die umgestürzten Städte waren großen Frevels schuldig;",
                            "verse 69:10": "Und sie waren widerspenstig gegen den Gesandten ihres Herrn, darum erfaßte Er sie mit drosselndem Griff.",
                            "verse 69:11": "Siehe, als die Wasser schwollen, da trugen Wir euch in der Arche,",
                            "verse 69:12": "Daß Wir sie zu einem Mahnmal für euch machten, und daß bewahrende Ohren sie bewahren mochten.",
                            "verse 69:13": "Und wenn in die Posaune gestoßen wird mit einem einzigen Stoß",
                            "verse 69:14": "Und die Erde samt den Bergen emporgehoben und dann niedergeschmettert wird mit einem einzigen Schlag:",
                            "verse 69:15": "An jenem Tage wird das Ereignis eintreffen.",
                            "verse 69:16": "Und der Himmel wird sich spalten, denn an jenem Tage wird er brüchig werden.",
                            "verse 69:17": "Und die Engel werden zu seinen Seiten stehen, und acht (Engel) werden an jenem Tage den Thron deines Herrn über sich tragen.",
                            "verse 69:18": "An jenem Tage werdet ihr (Gott) vorgeführt werden - keines eurer Geheimnisse wird verborgen bleiben.",
                            "verse 69:19": "Was dann den anlangt, dem sein Buch (der Rechenschaft) in die Rechte gegeben wird, so wird er sprechen: «Wohlan, leset mein Buch!",
                            "verse 69:20": "Traun, ich wußte, daß ich meiner Rechenschaft begegnen würde.»",
                            "verse 69:21": "So wird er ein erfreuliches Leben haben,",
                            "verse 69:22": "In einem hohen Garten,",
                            "verse 69:23": "Dessen Früchte leicht erreichbar sind.",
                            "verse 69:24": "«Esset und trinket in Gesundheit für das, was ihr in den vergangenen Tagen gewirkt.»",
                            "verse 69:25": "Was aber den anlangt, dem sein Buch (der Rechenschaft) in die Linke gegeben wird, so wird er sprechen: «O wäre mir doch mein Buch nicht gegeben worden!",
                            "verse 69:26": "Und hätte ich doch nie erfahren, was meine Rechenschaft ist!",
                            "verse 69:27": "O hätte doch der Tod (mit mir) ein Ende gemacht!",
                            "verse 69:28": "Mein Besitz hat mir nichts genützt.",
                            "verse 69:29": "Meine Macht ist von mir gegangen.»",
                            "verse 69:30": "«Ergreifet ihn und fesselt ihn,",
                            "verse 69:31": "Dann werft ihn in die Hölle.",
                            "verse 69:32": "Dann stoßt ihn in eine Kette, deren Länge siebzig Ellen ist;",
                            "verse 69:33": "Denn er glaubte nicht an Allah, den Großen,",
                            "verse 69:34": "Und forderte nicht auf zur Speisung des Armen.",
                            "verse 69:35": "Keinen Freund hat er drum hier heute",
                            "verse 69:36": "Und keine Nahrung außer Blut, mit Wasser gemischt,",
                            "verse 69:37": "Das nur die Sünder essen.»",
                            "verse 69:38": "Nein, Ich schwöre bei dem, was ihr seht,",
                            "verse 69:39": "Und bei dem, was ihr nicht seht,",
                            "verse 69:40": "Daß dies fürwahr das Wort eines ehrenhaften Gesandten ist.",
                            "verse 69:41": "Es ist nicht das Werk eines Dichters; wenig ist's, was ihr glaubt.",
                            "verse 69:42": "Noch ist es die Rede eines Wahrsagers; wenig ist's, was ihr bedenket.",
                            "verse 69:43": "(Es ist) eine Offenbarung vom Herrn der Welten.",
                            "verse 69:44": "Und hätte er irgendwelche Aussprüche in Unserem Namen ersonnen,",
                            "verse 69:45": "Wir hätten ihn gewiß bei der Rechten gefaßt,",
                            "verse 69:46": "Und ihm dann die Herzader durchschnitten.",
                            "verse 69:47": "Und keiner von euch hätte (Uns) von ihm abhalten können.",
                            "verse 69:48": "Wahrlich, es ist eine Ermahnung für die Gottesfürchtigen.",
                            "verse 69:49": "Und Wir wissen fürwahr, daß einige unter euch Leugner sind,",
                            "verse 69:50": "Und fürwahr, es ist ein Bedauern für die Ungläubigen.",
                            "verse 69:51": "Und fürwahr, es ist die Wahrheit selbst.",
                            "verse 69:52": "Darum preise den Namen deines Herrn, des Großen!"
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "lp eqp gksus okyh ¼d+;ker½",
                            "verse 69:2": "vkSj lp eqp gksus okyh D;k pht+ gS",
                            "verse 69:3": "vkSj rqEgsa D;k ekywe fd og lp eqp gksus okyh D;k gS",
                            "verse 69:4": "¼ogh½ [kM+ [kM+kus okyh ¼ftl½ dks vkn o lewn us >qByk;k",
                            "verse 69:5": "x+jt+ lewn rks fpa?kkM+ ls gykd dj fn, x,",
                            "verse 69:6": "jgs vkn rks og cgqr Ónhn rst+ vk¡/kh ls gykd dj fn, x,",
                            "verse 69:7": "[+kqnk us mls lkr jkr vkSj vkB fnu yxkdj mu ij pyk;k rks yksxksa dks bl rjg <gs ¼eqnsZ½ iM+s ns[krk fd xks;k og [ktwjksa ds [kks[kys rus gSa",
                            "verse 69:8": "rw D;k buesa ls fdlh dks Hkh cpk [kqpk ns[krk gS",
                            "verse 69:9": "vkSj fQ+jvkÅu vkSj tks yksx mlls igys Fks vkSj og yksx ¼d+kSes ywr½ tks myVh gq;h cfLr;ksa ds jgus okys Fks lc xqukg ds dke djrs Fks",
                            "verse 69:10": "rks mu yksxksa us vius ijojfnxkj ds jlwy dh ukQ+jekuh dh rks [+kqnk us Hkh mudh cM+h l[+rh ls ys ns dj Mkyh",
                            "verse 69:11": "tc ikuh p<+us yxk rks geus rqedks d’krh ij lokj fd;k",
                            "verse 69:12": "rkfd ge mls rqEgkjs fy, ;knxkj cuk,a vkSj mls ;kn j[kus okys dku lqudj ;kn j[ksa",
                            "verse 69:13": "fQj tc lwj esa ,d ¼ckj½ Qw¡d ekj nh tk,xh",
                            "verse 69:14": "vkSj t+ehu vkSj igkM+ mBkdj ,d ckjxh ¼Vdjk dj½ jst+k jst+k dj fn, tk,¡xs rks ml jkst+ d+;ker vk gh tk,xh",
                            "verse 69:15": "vkSj vkleku QV tk,xk",
                            "verse 69:16": "rks og ml fnu cgqr Qql Qqlk gksxk vkSj Q+fj’rs muds fdukjs ij gksaxs",
                            "verse 69:17": "vkSj rqEgkjs ijojfnxkj ds v’kZ dks ml fnu vkB Q+fj’rs vius ljksa ij mBk, gksaxs",
                            "verse 69:18": "ml fnu rqe lc ds lc ¼[+kqnk ds lkeus½ is’k fd, tkvksxs vkSj rqEgkjh dksbZ iks’khnk ckr Nqih u jgsxh",
                            "verse 69:19": "rks ftldks ¼mldk uke, vkeky½ nkfgus gkFk esa fn;k tk,xk rks og ¼yksxks ls½ dgsxk yhft, esjk uke, vkeky if<+,",
                            "verse 69:20": "rks eSa rks tkurk Fkk fd eq>s esjk fglkc ¼fdrkc½ t+:j feysxk",
                            "verse 69:21": "fQj og fny ilUn ,s’k esa gksxk",
                            "verse 69:22": "cM+s vkyh’kku ckx+ esa",
                            "verse 69:23": "ftuds Qy cgqr >qds gq, d+jhc gksaxs",
                            "verse 69:24": "tks dkjxqt+kfj;k¡ rqe xqft+’krk v¸;ke essa djds vkxs Hkst pqds gks mlds flys esa et+s ls [kkvks fi;ks",
                            "verse 69:25": "vkSj ftldk uke, vkeky muds ck,¡ gkFk esa fn;k tk,xk rks og dgsxk ,s dk’k eq>s esjk uke, vey u fn;k tkrk",
                            "verse 69:26": "vkSj eq>s u ekywy gksrk fd esjk fglkc D;k gS",
                            "verse 69:27": ",s dk’k ekSr us ¼ges’kk ds fy, esjk½ dke reke dj fn;k gksrk",
                            "verse 69:28": "¼vQ+lksl½ esjk eky esjs dqN Hkh dke u vk;k",
                            "verse 69:29": "¼gk,½ esjh lYrur [+kkd esa fey x;h ¼fQj gqD+e gksxk½",
                            "verse 69:30": "bls fxj¶+rkj djds rkSd+ iguk nks",
                            "verse 69:31": "fQj bls tgUuqe esa >ksad nkss]",
                            "verse 69:32": "fQj ,d t+athj esa ftldh uki lRrj xt+ dh gS mls [+kwc tdM+ nks",
                            "verse 69:33": "¼D;ksa fd½ ;s u rks cqt+qZx [+kqnk gh ij bZeku ykrk Fkk vkSj u eksgrkt ds f[kykus ij vkeknk ¼yksxksa dks½ djrk Fkk",
                            "verse 69:34": "rks vkt u mldk dksbZ x+e[+okj gS",
                            "verse 69:35": "vkSj u ihi ds flok ¼mlds fy,½ dqN [kkuk gS",
                            "verse 69:36": "ftldks xqusgxkjksa ds flok dksbZ ugha [kk,xk",
                            "verse 69:37": "rks eq>s mu pht+ksa dh d+le gS",
                            "verse 69:38": "tks rqEgsa fn[kkbZ nsrh gSa",
                            "verse 69:39": "vkSj tks rqEgsa ugha lq>kbZ nsrh fd cs’kd ;s ¼d+qjku½",
                            "verse 69:40": ",d eksvft+t+ Qfj’rs dk yk;k gqvk iSx+ke gS",
                            "verse 69:41": "vkSj ;s fdlh Ók;j dh rqd cUnh ugha rqe yksx rks cgqr de bZeku ykrs gks",
                            "verse 69:42": "vkSj u fdlh dkfgu dh ¼[+;kyh½ ckr gS rqe yksx rks cgqr de x+kSj djrs gks",
                            "verse 69:43": "lkjs tgk¡u ds ijojfnxkj dk ukft+y fd;k gqvk ¼d+yke½ gS",
                            "verse 69:44": "vxj jlwy gekjh fuLcr dksbZ >wB ckr cuk ykrs",
                            "verse 69:45": "rks ge mudk nkfguk gkFk idM+ ysrs",
                            "verse 69:46": "fQj ge t+:j mudh xnZu mM+k nsrs",
                            "verse 69:47": "rks rqeesa ls dksbZ muls ¼eq>s jksd u ldrk½",
                            "verse 69:48": ";s rks ijgst+xkjksa ds fy, ulhgr gS",
                            "verse 69:49": "vkSj ge [+kwc tkurs gSa fd rqe esa ls dqN yksx ¼blds½ >qBykus okys gSa",
                            "verse 69:50": "vkSj blesa Ód ugha fd ;s dkfQ+jksa dh gljr dk ck,l gS",
                            "verse 69:51": "vkSj blesa Ód ugha fd ;s ;d+huu cjgd+ gS",
                            "verse 69:52": "rks rqe vius ijojfnxkj dh rlchg djks"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "Hari kiamat,",
                            "verse 69:2": "apakah hari kiamat itu?",
                            "verse 69:3": "Dan tahukah kamu apakah hari kiamat itu?",
                            "verse 69:4": "Kaum Tsamud dan ’Aad telah mendustakan hari kiamat.",
                            "verse 69:5": "Adapun kaum Tsamud maka mereka telah dibinasakan dengan kejadian yang luar biasa,",
                            "verse 69:6": "Adapun kaum ’Aad maka mereka telah dibinasakan dengan angin yang sangat dingin lagi amat kencang,",
                            "verse 69:7": "yang Allah menimpakan angin itu kepada mereka selama tujuh malam dan delapan hari terus menerus; maka kamu lihat kaum ’Aad pada waktu itu mati bergelimpangan seakan-akan mereka tunggul-tunggul pohon kurma yang telah kosong (lapuk).",
                            "verse 69:8": "Maka kamu tidak melihat seorang pun yang tinggal di antara mereka.",
                            "verse 69:9": "Dan telah datang Firaun dan orang-orang yang sebelumnya dan (penduduk) negeri-negeri yang dijungkir balikkan karena kesalahan yang besar.",
                            "verse 69:10": "Maka (masing-masing) mereka mendurhakai rasul Tuhan mereka, lalu Allah menyiksa mereka dengan siksaan yang sangat keras.",
                            "verse 69:11": "Sesungguhnya Kami, tatkala air telah naik (sampai ke gunung) Kami bawa (nenek moyang), kamu ke dalam bahtera,",
                            "verse 69:12": "agar kami jadikan peristiwa itu peringatan bagi kamu dan agar diperhatikan oleh telinga yang mau mendengar.",
                            "verse 69:13": "Maka apabila sangkakala ditiup sekali tiup,",
                            "verse 69:14": "dan diangkatlah bumi dan gunung-gunung, lalu dibenturkan keduanya sekali bentur.",
                            "verse 69:15": "Maka pada hari itu terjadilah hari kiamat,",
                            "verse 69:16": "dan terbelahlah langit, karena pada hari itu langit menjadi lemah.",
                            "verse 69:17": "Dan malaikat-malaikat berada di penjuru-penjuru langit. Dan pada hari itu delapan orang malaikat menjunjung ’Arsy Tuhanmu di atas (kepala) mereka.",
                            "verse 69:18": "Pada hari itu kamu dihadapkan (kepada Tuhanmu), tiada sesuatu pun dari keadaanmu yang tersembunyi (bagi Allah).",
                            "verse 69:19": "Adapun orang-orang yang diberikan kepadanya kitabnya dari sebelah kanannya, maka dia berkata: \"Ambillah, bacalah kitabku (ini)\".",
                            "verse 69:20": "Sesungguhnya aku yakin, bahwa sesungguhnya aku akan menemui hisab terhadap diriku.",
                            "verse 69:21": "Maka orang itu berada dalam kehidupan yang diridai,",
                            "verse 69:22": "dalam surga yang tinggi.",
                            "verse 69:23": "Buah-buahannya dekat,",
                            "verse 69:24": "(kepada mereka dikatakan): \"Makan dan minumlah dengan sedap disebabkan amal yang telah kamu kerjakan pada hari-hari yang telah lalu\".",
                            "verse 69:25": "Adapun orang yang diberikan kepadanya kitabnya dari sebelah kirinya, maka dia berkata: \"Wahai alangkah baiknya kiranya tidak diberikan kepadaku kitabku (ini),",
                            "verse 69:26": "Dan aku tidak mengetahui apa hisab terhadap diriku,",
                            "verse 69:27": "Wahai kiranya kematian itulah yang menyelesaikan segala sesuatu.",
                            "verse 69:28": "Hartaku sekali-kali tidak memberi manfa’at kepadaku.",
                            "verse 69:29": "Telah hilang kekuasaanku dariku\"",
                            "verse 69:30": "(Allah berfirman): \"Peganglah dia lalu belenggulah tangannya ke lehernya.\"",
                            "verse 69:31": "Kemudian masukkanlah dia ke dalam api neraka yang menyala-nyala.",
                            "verse 69:32": "Kemudian belitlah dia dengan rantai yang panjangnya tujuh puluh hasta.",
                            "verse 69:33": "Sesungguhnya dia dahulu tidak beriman kepada Allah Yang Maha Besar.",
                            "verse 69:34": "Dan juga dia tidak mendorong (orang lain) untuk memberi makan orang miskin.",
                            "verse 69:35": "Maka tiada seorang teman pun baginya pada hari ini di sini.",
                            "verse 69:36": "Dan tiada (pula) makanan sedikit pun (baginya) kecuali dari darah dan nanah.",
                            "verse 69:37": "Tidak ada yang memakannya kecuali orang-orang yang berdosa.",
                            "verse 69:38": "Maka Aku bersumpah dengan apa yang kamu lihat.",
                            "verse 69:39": "Dan dengan apa yang tidak kamu lihat.",
                            "verse 69:40": "Sesungguhnya Al Qur'an itu adalah benar-benar wahyu (Allah yang diturunkan kepada) Rasul yang mulia,",
                            "verse 69:41": "dan Al Qur'an itu bukanlah perkataan seorang penyair. Sedikit sekali kamu beriman kepadanya.",
                            "verse 69:42": "Dan bukan pula perkataan tukang tenung. Sedikit sekali kamu mengambil pelajaran daripadanya.",
                            "verse 69:43": "Ia adalah wahyu yang diturunkan dari Tuhan semesta alam.",
                            "verse 69:44": "Seandainya dia (Muhammad) mengada-adakan sebagian perkataan atas (nama) Kami,",
                            "verse 69:45": "Niscaya benar-benar kami pegang dia pada tangan kanannya.",
                            "verse 69:46": "Kemudian benar-benar Kami potong urat tali jantungnya.",
                            "verse 69:47": "Maka sekali-kali tidak ada seorang pun dari kamu yang dapat menghalangi (Kami), dari pemotongan urat nadi itu.",
                            "verse 69:48": "Dan sesungguhnya Al Qur'an itu benar-benar suatu pelajaran bagi orang-orang yang bertakwa.",
                            "verse 69:49": "Dan sesungguhnya kami benar-benar mengetahui bahwa di antara kamu ada orang yang mendustakan (nya).",
                            "verse 69:50": "Dan sesungguhnya Al Qur'an itu benar-benar menjadi penyesalan bagi orang-orang kafir (di akhirat).",
                            "verse 69:51": "Dan sesungguhnya Al Qur'an itu benar-benar kebenaran yang diyakini.",
                            "verse 69:52": "Maka bertasbihlah dengan (menyebut) nama Tuhan-mu Yang Maha Besar."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "L'Inevitabile !",
                            "verse 69:2": "Cos'è l'Inevitabile?",
                            "verse 69:3": "Chi mai ti dirà che cos'è l'Inevitabile?",
                            "verse 69:4": "I Thamûd e gli 'Âd tacciarono di menzogna il cataclisma,",
                            "verse 69:5": "ma i Thamûd furono sterminati da un Grido tremendo,",
                            "verse 69:6": "mentre gli 'Âd furono distrutti da un vento mugghiante, furioso,",
                            "verse 69:7": "che Allah scatenò contro di loro per sette notti e otto giorni consecutivi. Allora avresti visto quella gente riversa in terra come tronchi cavi di palma.",
                            "verse 69:8": "Ne vedi forse uno sopravvissuto?",
                            "verse 69:9": "Anche Faraone e coloro che lo precedettero e le [città] stravolte commisero peccati.",
                            "verse 69:10": "Disobbedirono al Messaggero del loro Signore ed Egli li afferrò con estrema energia.",
                            "verse 69:11": "Quando l'acqua dilagò vi caricammo sull'Arca,",
                            "verse 69:12": "affinché essa diventasse un monito ricordato da ogni orecchio che ricorda.",
                            "verse 69:13": "Quando sarà soffiato nel Corno la prima volta,",
                            "verse 69:14": "e la terra e la montagne saranno sollevate e polverizzate in un sol colpo,",
                            "verse 69:15": "in quel Giorno avverrà l'Evento,",
                            "verse 69:16": "e si spaccherà il cielo, così fragile in quel Giorno.",
                            "verse 69:17": "Staranno gli angeli ai suoi orizzonti e in quel Giorno otto [di loro] porteranno il Trono del tuo Signore.",
                            "verse 69:18": "Sfilerete [davanti ad Allah] in quel Giorno e niente di quel che celate potrà essere nascosto.",
                            "verse 69:19": "Chi avrà ricevuto il libro nella mano destra, dirà: «Prendete, leggete il mio libro.",
                            "verse 69:20": "Invero sapevo che avrei avuto il mio rendiconto!».",
                            "verse 69:21": "Egli avrà piacevole esistenza",
                            "verse 69:22": "in un Giardino elevato,",
                            "verse 69:23": "i cui frutti saranno a portata di mano.",
                            "verse 69:24": "« Mangiate e bevete in pace, è il premio per quel che avete fatto nei giorni passati ».",
                            "verse 69:25": "Chi invece avrà ricevuto il suo libro nella mano sinistra, dirà: « Ahimé, se solo non mi fosse stato consegnato il mio libro",
                            "verse 69:26": "e non avessi conosciuto il mio rendiconto!",
                            "verse 69:27": "Ahimé, quanto vorrei che essa fosse stata definitiva !",
                            "verse 69:28": "Quel che possedevo non mi ha giovato affatto.",
                            "verse 69:29": "Ho perso il mio potere».",
                            "verse 69:30": "[Diranno:] « Afferratelo e mettetelo nei ceppi,",
                            "verse 69:31": "quindi sia precipitato nella Fornace,",
                            "verse 69:32": "e poi legatelo con una catena di settanta cubiti.",
                            "verse 69:33": "Non credeva in Allah, il Supremo,",
                            "verse 69:34": "e non esortava a nutrire il povero.",
                            "verse 69:35": "Oggi non avrà qui nessun amico sincero,",
                            "verse 69:36": "né altro cibo che sanie",
                            "verse 69:37": "che solo i colpevoli mangeranno.",
                            "verse 69:38": "Lo giuro per quel che vedete,",
                            "verse 69:39": "e per quel che non vedete!».",
                            "verse 69:40": "Questa è in verità la parola di un Messaggero nobilissimo;",
                            "verse 69:41": "non è la parola di un poeta - [credetelo] per quanto poco crediate-",
                            "verse 69:42": "e neanche la parola di un indovino - per quanto poco riflettiate!",
                            "verse 69:43": "E' una Rivelazione venuta dal Signore dei Mondi.",
                            "verse 69:44": "Se [Muhammad] Ci avesse mendacemente attribuito qualche discorso ,",
                            "verse 69:45": "lo avremmo certo afferrato per la mano destra,",
                            "verse 69:46": "e quindi gli avremmo reciso l'aorta",
                            "verse 69:47": "e nessuno di voi avrebbe potuto impedirCelo.",
                            "verse 69:48": "In verità questo è un Monito per i timorati [di Allah]!",
                            "verse 69:49": "Sappiamo che tra voi c'è chi lo tratta da bugiardo;",
                            "verse 69:50": "in verità ciò sarà un rimpianto per i miscredenti;",
                            "verse 69:51": "questa è l'assoluta certezza.",
                            "verse 69:52": "Allora glorifica il Nome del tuo Signore, il Supremo."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "確かな真実，",
                            "verse 69:2": "確かな真実とは何か。",
                            "verse 69:3": "確かな真実が何であるかを，あなたに理解させるものは何か。",
                            "verse 69:4": "サムードとアード（の民）は，突然来る災厄を虚偽であるとした。",
                            "verse 69:5": "それでサムードは雷雲の嵐によって滅ぼされた。",
                            "verse 69:6": "またアードは，唸り狂う風によって滅ぼされた。",
                            "verse 69:7": "7夜8日にわたり，かれらに対し絶え間なく（嵐が）襲い，それで朽ちたナツメヤシの木のように，（凡ての）民がそこに� れているのを，あなたは見たであろう。",
                            "verse 69:8": "それであなたは，かれらの中，誰か残っている者を見るのか。",
                            "verse 69:9": "またフィルアウンやかれ以前の者や滅ぼされた諸都市（の民）も，罪を犯していた。",
                            "verse 69:10": "かれらは主の使徒に従わないので，かれは猛烈な懲罰でかれらを処罰した。",
                            "verse 69:11": "大水のとき，われが方舟であなたがたを連んだのは，",
                            "verse 69:12": "それをあなたがたへの数訓とさせ，注意深い耳がそれを（聞いて）記憶に留めるためである。",
                            "verse 69:13": "それでラッパが一吹き吹かれた時，",
                            "verse 69:14": "大地や山々は持ち上げられ，一撃で粉々に砕かれ，",
                            "verse 69:15": "その日（一大）事件が起る。",
                            "verse 69:16": "また大空は千々に裂ける。天が脆く弱い日であろう。",
                            "verse 69:17": "天使たちは，その（天の）端々におり，その日，8人（の天使）がかれらの上に，あなたの主の玉座を担うてあろう。",
                            "verse 69:18": "その日あなたがたは（審判のため）みな（剥？）き出しにされ何一つとして隠しおおせないであろう。",
                            "verse 69:19": "それで右手にその（行状）記を渡される者は言う。「ここに（来て），あなたがたはわたしの（行状）記を読め。」",
                            "verse 69:20": "「いずれわたし（信者）の清算（審判）に合うことが，本当に分っていた。」",
                            "verse 69:21": "こうしてかれは至福な生活に浸り，",
                            "verse 69:22": "高い（丘の）園の中で，",
                            "verse 69:23": "様々な果実が手近にある。",
                            "verse 69:24": "「あなたがたは，過ぎ去った日（現世）で行った（善行の）ために，満悦して食べ，且つ飲め。」（と言われよう）。",
                            "verse 69:25": "だが左手にその（行状）記を渡される者は言う。「ああ，わたしの（行状）記が渡さオになかったならば」",
                            "verse 69:26": "「わたしは自分の清算が，どんなものであるかを知らなかった。」",
                            "verse 69:27": "ああ，その（死）が（わたしの）終末であったならば，",
                            "verse 69:28": "富は，わたしに役立たなかった。",
                            "verse 69:29": "「権威は，わたしから消え失せてしまった。」",
                            "verse 69:30": "（だが厳命が下ろう。）「かれを捕えて，縛れ。」",
                            "verse 69:31": "それから燃え盛る火で，かれを焼け。",
                            "verse 69:32": "更に70腕尺の長さの鎖で，かれを巻け。",
                            "verse 69:33": "本当にかれは，偉大なるアッラーを信じず，",
                            "verse 69:34": "また貧者を養うことを勧めなかった。",
                            "verse 69:35": "それでこの日かれは，そこに友は無く，",
                            "verse 69:36": "また，穢しい腐敗物の外に食物はない，",
                            "verse 69:37": "「それを食べるのは，罪人だけである。」",
                            "verse 69:38": "われは，あなたがたが見得るものにおいて誓い，",
                            "verse 69:39": "またあなたがたが見得ないものにおいて誓う。",
                            "verse 69:40": "本当にこれは，尊貴な使徒の言葉である。",
                            "verse 69:41": "これは詩人の言葉ではない。だがあなたがたは，ほとんど信じない。",
                            "verse 69:42": "また，占い師の言葉でもない。しかしあなたがたはほとんど気にもしない。",
                            "verse 69:43": "（これは）万有の主から下された啓示である。",
                            "verse 69:44": "もしかれ（使徒）が，われに関して何らかの言葉を捏造するならば，",
                            "verse 69:45": "われはきっとかれの右手を捕え，",
                            "verse 69:46": "かれの頸動脈を必ず切るであろう",
                            "verse 69:47": "あなたがたの中，誰一人，かれを守ってやれないのである。",
                            "verse 69:48": "本当にこれは，主を畏れる者への訓戒である。",
                            "verse 69:49": "われはあなたがたの中，（それを）拒否する者を知る。",
                            "verse 69:50": "本当にこの（クルアーン）は，不信者にとっては悲しみ（の種）であろう。",
                            "verse 69:51": "だがそれは，本当に確固たる不動の真理である。",
                            "verse 69:52": "だから至大なる御方，あなたの主の御名を讃えなさい。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "실제의 날이 있나니",
                            "verse 69:2": "실제의 날이 무엇이뇨",
                            "verse 69:3": "실제의 날이 무엇인지 무엇이그대에게 가르쳐 주리요",
                            "verse 69:4": "사무드와 아드 백성은 부활의날을 부정했노라",
                            "verse 69:5": "그리하여 사무드 백성은 무 서운 천둥과 번개의 벼락으로 멸 망했으며",
                            "verse 69:6": "아드 백성은 춥고 성난 폭풍 에 의해 멸망되었노라",
                            "verse 69:7": "하나님은 일곱방과 팔일간 그들에게 연속적인 징벌을 주었나니그대는 이 백성들이 부복한 것을 보았으매 이는 쓰러 넘어진 종려 나무 같았더라",
                            "verse 69:8": "그대는 그들 중 살아 남은 어느 누구를 볼 수 있었더뇨",
                            "verse 69:9": "파라오도 그리고 그 이전의 자들과 멸망된 도시들도 계속하 여 죄악을 저질렀노라",
                            "verse 69:10": "주님이 보낸 선지자를 거역 하였기에 그분은 그들에게 혹독한 벌을 내렸노라",
                            "verse 69:11": "물이 넘쳤을 때 하나님은 너희를 방주에 태워 보냈노라",
                            "verse 69:12": "이로 하여 너희에게 교훈이 되고 귀를 가진자는 그것을 기억 하여 그 교훈을 기억하도록 하였 노라",
                            "verse 69:13": "나팔 소리가 한번 울려 퍼질때",
                            "verse 69:14": "대지의 산들이 움직이고 그 것들이 한번에 산산조각이 나며",
                            "verse 69:15": "그때에 커다란 사건이 일어 나니라",
                            "verse 69:16": "그날 하늘이 갈라지고 힘을 잃게 되노라",
                            "verse 69:17": "천사들이 주변에 줄지어 있 으며 그들 위로 여턴 천사가 그 날 주님의 권좌를 받들고 있노라",
                            "verse 69:18": "그날에는 너희가 심판을 받 은 날로 너희의 어떤 행위도 숨겨 질 수 없노라",
                            "verse 69:19": "그의 우편에 기록을 받은 자는 여기에 기록이 있나니 읽어 주 소서 라고 말하며",
                            "verse 69:20": "실로 저는 저의 계산이 어느 날 저에게 이르리라는 것을 알았 습니다 라고 하더라",
                            "verse 69:21": "그리하여 그는 축복받은 삶 을 영위하며",
                            "verse 69:22": "높은 천국에 있노라",
                            "verse 69:23": "송이송이 달린 과일이 손 가 까이에 있으며",
                            "verse 69:24": "기꺼이 먹고 마시라 이것은 너희가 지나간 기간 중에 행한 선행에 대한 보상이라",
                            "verse 69:25": "그러나 그의 좌편에 기록을 받은 자는 나의 기록이 나에게 이 르지 아니 했으면 하고 말하더라",
                            "verse 69:26": "내가 저지를 행위에 대한 벌 이 무엇인지 몰랐나이다",
                            "verse 69:27": "죽음이 나의 종말이었으면",
                            "verse 69:28": "나의 재산도 아무런 쓸모가 없으며",
                            "verse 69:29": "내가 가졌던 권세도 내게서 사라져 버렸구나",
                            "verse 69:30": "그를 포획하여 구속하라는 엄한 명령과 더불어",
                            "verse 69:31": "타오르는 불속에 그를 내던 진후",
                            "verse 69:32": "칠십 척 길이의 쇠사슬에 묶어 걷게 하라",
                            "verse 69:33": "실로 그는 위대한 하나님을 믿지도 아니하고",
                            "verse 69:34": "가난한 사람들에게 자선도 베풀지 아니 했노라",
                            "verse 69:35": "이날 이곳에서 그에게는 친 구도 없으며",
                            "verse 69:36": "그가 먹을 음식이란 피고름 섞인 것으로",
                            "verse 69:37": "죄인들만이 먹는 것들이라",
                            "verse 69:38": "너희가 보는 것으로 맹세하 며",
                            "verse 69:39": "또한 너희가 보지 못하는 것 으로 맹세하사",
                            "verse 69:40": "실로 이것은 훌륭한 선지자 에 의해 전하여진 말씀으로",
                            "verse 69:41": "한 시인의 말이 아니라 너희 중에 믿는 자가 소수라",
                            "verse 69:42": "이것은 점장이의 말도 아니거 늘 너희 중에 숙고하는 자 소수라",
                            "verse 69:43": "이것은 만유의 주님으로 부 터 내려진 계시로",
                            "verse 69:44": "만일 그가 하나님께 거역하 여 일부의 말씀을 위조하였다면",
                            "verse 69:45": "하나님은 그의 오른손을 붙 잡아",
                            "verse 69:46": "그의 동맥을 절단 했으리라",
                            "verse 69:47": "이때 너희 중 어느 누구도 하나님을 제지할 수 없으리라",
                            "verse 69:48": "실로 이것은 하나님을 두려 워 하는 자들을 위한 교훈이라",
                            "verse 69:49": "하나님은 너희중에서 그것을거역하는 자들을 알고 계시니라",
                            "verse 69:50": "실로 그것은 불신자들에게 큰 슬픔이라",
                            "verse 69:51": "실로 그것은 분명한 진리라",
                            "verse 69:52": "그러므로 위대한 그대 주님 을 찬양하라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "یه‌کێکه له ناوه‌کانی ڕۆژی قیامه‌ت ئه‌وه ده‌گه‌یه‌نێت که له‌و ڕۆژه‌دا خوای گه‌وره حه‌ق و ڕاستی به‌ته‌واوی ده‌چه‌سپێنێت.",
                            "verse 69:2": "(ئینجا پرسیار ده‌کات و زیاتر گرنگی ئه‌و ڕۆژه ده‌خاته به‌رچاو) چی بێ ئه‌و ڕۆژه‌؟!",
                            "verse 69:3": "جا تۆ چووزانی ئه‌ی پێغه‌مبه‌ر صلی الله حلیه وسلم ئه‌ی ئاده‌میزاد، ئه‌و ڕۆژه چیه‌و چۆنه‌و چ ته‌نگانه‌یه‌که‌؟",
                            "verse 69:4": "ثمود قه‌ومی صالح، عاد قه‌ومی هود ئه‌و ڕۆژه‌یان به درۆزانی.",
                            "verse 69:5": "ئینجا گه‌لی ثمودمان به‌ده‌نگێکی سامناکی گه‌وره‌ی تۆقێنه‌ر له‌ناوبران.",
                            "verse 69:6": "گه‌لی عادیش به ڕه‌شه‌بایه‌کی ساردی به‌هێزی وێرانکه‌ر له‌ناوبران.",
                            "verse 69:7": "حه‌وت شه‌وو هه‌شت ڕۆژ هه‌ڵی کرده سه‌ریان، به‌رده‌وام و به‌هێز ده‌تبینی (ئه‌گه‌ر له‌وێ بویتایه‌) ئه‌و خه‌ڵکه هه‌موو لاڵ و پاڵ لێی ده‌که‌وتن هه‌روه‌ك قه‌دی دارخورمای له ڕیشه هه‌ڵکه‌نراو، چۆن به‌ئاسانی ده‌که‌وێت و شه‌ق ده‌بات.",
                            "verse 69:8": "جا ئایا ده‌بینیت که‌سیان مابێت و که‌سیان ڕزگاری بووبێت؟!",
                            "verse 69:9": "فیرعه‌ون و ئه‌وانه‌ی پێش ئه‌ویش و دانیشتوانی دێهاته ژێره‌و ژوور بووه‌کان، به تاوان و خراپه‌وه هاتن.",
                            "verse 69:10": "هه‌ر یه‌کێك له‌وانه سه‌رپێچی و سه‌رکه‌شییان نواند به‌رامبه‌ر پێغه‌مبه‌ری په‌روه‌ردگاریان ئه‌وسا گرتنی به گرتنێکی سه‌خت.",
                            "verse 69:11": "به‌ڕاستی ئێمه کاتێك ئاو له سنوور ده‌رچوو (له کاتی تۆفانه‌که‌ی نوح دا) ئێوه‌مان له که‌شتیدا هه‌ڵگرت (باوو باپیرانی ئێوه‌).",
                            "verse 69:12": "تا بیکه‌نه یادگاری و بێدار که‌ره‌وه بۆ ئێوه و له‌گوێی بگرێت ئه‌و گوێیانه‌ی هۆشمه‌ندن.",
                            "verse 69:13": "ئینجا کاتێك یه‌کجار فوو کرا به صوردا.",
                            "verse 69:14": "زه‌وی و کێوه‌کان هه‌ڵگیران و یه‌ککه‌ڕه‌ت دران به‌یه‌کدا.",
                            "verse 69:15": "له‌و ڕۆژه‌دا ئیتر قیامه‌ت به‌رپا ده‌بێت.",
                            "verse 69:16": "ئاسمان هه‌مووی شه‌ق و په‌ق ده‌بێت و لێك ده‌ترازێت و شل و شۆڵ ده‌بێت.",
                            "verse 69:17": "فریشته‌کان له گۆشه‌و که‌ناری (جیهانی نوێ) دا ئاماده ده‌بن، ته‌ختی په‌روه‌ردگارت ئه‌و ڕۆژه هه‌شت هه‌ڵی ده‌گرێت (هه‌شت فریشته یان هه‌شت ده‌سته‌) به‌سه‌ر سه‌ریانه‌وه‌.",
                            "verse 69:18": "له‌و ڕۆژه‌دا پیشان ده‌درێن، هیچ شتێك له نهێنیه‌کانتان شاراوه نی یه‌.",
                            "verse 69:19": "جا ئه‌وه‌ی نامه‌ی کرده‌وه‌کانی درایه ده‌ستی ڕاستی، ئه‌وه (به دڵخۆشیه‌کی بێ سنووره‌وه به هاوه‌ڵ و ناسیاوانی) ده‌ڵێت: ها ئه‌وه‌تا نامه‌ی کرده‌وه‌کانم بیگرن و بخوێننه‌وه‌و ته‌ماشای بکه‌ن.",
                            "verse 69:20": "به‌ڕاستی من کاتی خۆی سوور ده‌مزانی و دڵنیابووم که به‌م لێپرسینه‌وه ده‌گه‌م!!",
                            "verse 69:21": "جا ئه‌و به‌خته‌وه‌ره له ژیانێکی پڕ له شادی و کامه‌رانیدا ده‌ژی که زۆر پێی ڕازیه‌...",
                            "verse 69:22": "له‌به‌هه‌شتی به‌رزو بڵندا، (له باخچه‌کانی سه‌ر لوطکه‌ی چیاو لاپاڵی شاخه‌کاندا له‌ناو کۆشك و ته‌لاره‌کاندا).",
                            "verse 69:23": "میوه‌هاتی زۆر به دره‌خته‌کانیه‌وه شۆڕ بۆته‌وه‌و لێکردنه‌وه‌ی ئاسانه‌و له ده‌ست ڕه‌س دایه‌.",
                            "verse 69:24": "ئینجا پێیان ده‌وترێت: بخۆن و بخۆنه‌وه نۆشتان بێت، به‌هۆی ده‌ست پێشکه‌ریتان له ڕۆژگاری ڕابردودا.",
                            "verse 69:25": "به‌ڵام ئه‌وه‌ی نامه‌ی کرده‌وه‌کانی ده‌درێته ده‌ستی چه‌پی، ئه‌وه ده‌ڵێت: خۆزگه نامه‌ی کرده‌وه‌کانم پێ نه‌درایه‌.",
                            "verse 69:26": "هه‌ر نه‌مزانیایه لێپرسینه‌وه‌م چۆن ده‌بێت.",
                            "verse 69:27": "خۆزگه مردنه‌که‌م یه‌کجاریی بوایه (ئاوا زیندوو نه‌کرامایه‌ته‌وه‌).",
                            "verse 69:28": "ئه‌وه‌ته‌، ئه‌و ماڵ و سامانه‌ی که بووم، فریام نه‌که‌وت (به‌ڵکو نه‌ماو ته‌فرو تونا بوو).",
                            "verse 69:29": "ئه‌و ده‌سه‌ڵاته‌ی که بووم له ده‌ستمدا نه‌ماو له ده‌ستم چوو.",
                            "verse 69:30": "(ئه‌وسا ئیتر فه‌رمان ده‌درێت) ئاده‌ی ئێوه بیگرن و کۆت و زنجیر له ده‌ست و قاچ و ملی بئاڵێنن.",
                            "verse 69:31": "له‌وه‌ودوا به‌ره‌و دۆزه‌خ ڕاپێچی بکه‌ن و بیبه‌ن و بیخه‌نه ناوی.",
                            "verse 69:32": "پاشان به‌زنجیرێکی حه‌فتا گه‌زی بیبه‌سنه‌وه (به کۆڵه‌که‌و ستون و پایه‌کانی ناو دۆزه‌خه‌وه‌).",
                            "verse 69:33": "چونکه به‌ڕاستی ئه‌مه کاتی خۆی ئیمان و باوه‌ڕی به‌خوای گه‌وره نه‌بوو (به ته‌مای زیندووبوونه‌وه‌و لێپرسینه‌وه نه‌بوو).",
                            "verse 69:34": "هانی که‌سی نه‌ده‌دا که خواردن و خۆراك ببه‌خشن به هه‌ژارو بێ نه‌واکان (به‌ڵکو هه‌ر خه‌می خۆی بوو).",
                            "verse 69:35": "که‌واته ئه‌مڕۆ ئا لێره هیچ دڵسۆزێکی نی یه‌.",
                            "verse 69:36": "خۆراکیشی ته‌نها له‌کێم و زوخاوی داچۆڕاو نه‌بێت هیچی تر نی یه‌.",
                            "verse 69:37": "که‌، که‌س نایخوات، جگه له تاوانباران.",
                            "verse 69:38": "سوێندم به‌و شتانه‌ی که ده‌یبینن.",
                            "verse 69:39": "به‌وه‌ش که نایبینن و نادیارن.",
                            "verse 69:40": "به‌ڕاستی ئه‌م قورئانه له زاری پێغه‌مبه‌رێکی به‌ڕێزه‌وه پێتان ڕاده‌گه‌یه‌نرێت، یاخود له ڕێگه‌ی فرستاده‌یه‌کی به‌ڕێزه‌وه پێتان ده‌گات که جوبره‌ئیلی فریشته‌یه‌.",
                            "verse 69:41": "دڵنیابن که ئه‌م قورئانه گوفتاری شاعیر نیه‌، ئه‌وه بۆ زۆر که‌متان باوه‌ڕ ده‌هێنن؟!",
                            "verse 69:42": "گوفتاری فاڵچی و زێوانیش نیه‌، ئه‌وه بۆ زۆر که‌متان یاداوه‌ری وه‌رده‌گرن؟!",
                            "verse 69:43": "به‌ڵکو ئه‌م قورئانه له‌لایه‌ن په‌روه‌ردگاری جیهانه‌کانه‌وه ڕه‌وانه‌کراوه‌و نێردراوه‌ته خواره‌وه‌.",
                            "verse 69:44": "خۆ ئه‌گه‌ر محمد صلی الله علیه وسلم هه‌ندێك قسه‌و گوفتار به‌ده‌م ئێمه‌وه هه‌ڵبه‌ستایه‌.",
                            "verse 69:45": "ئه‌وه به‌هێزو ده‌سه‌ڵاتی خۆمان ده‌مانگرت.",
                            "verse 69:46": "له‌وه‌ودوا ڕه‌گی دڵی ده‌پچڕێنین و ده‌یمرێنین.",
                            "verse 69:47": "ئه‌وسا هیچ که‌سێك نی یه له ئێوه به‌ربه‌ست و به‌رگری بکات له ئێمه‌.",
                            "verse 69:48": "به‌ڕاستی ئه‌م قورئانه یاداوه‌ری و یادخستنه‌وه‌یه بۆ پارێزکاران و خوانه‌ناسان.",
                            "verse 69:49": "ئێمه به‌ڕاستی چاك و ده‌زانین که له ئێوه‌دا که‌سانێك هه‌ن و په‌یدا ده‌بن ئه‌م قورئانه به‌درۆ ده‌زانن.",
                            "verse 69:50": "بێگومان قورئان له ڕۆژی دوایدا ده‌بێته هۆی ئاهو ناڵه‌و په‌شیمانی بێ سنوور بۆ بێ باوه‌ڕان.",
                            "verse 69:51": "به‌ڕاستی ئه‌م قورئانه حه‌ق و ڕاسته‌قینه‌یه‌کی دڵنیا به‌خشه به ئیمانداران.",
                            "verse 69:52": "که‌واته ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم، ئه‌ی ئیماندار؛ به‌رده‌وام ته‌سبیحات و ستایشی په‌روه‌ردگاری مه‌زن و گه‌وره‌ت بکه‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "Saat yang tetap berlaku itu;",
                            "verse 69:2": "Apakah dia sifat dan keadaan saat yang tetap berlaku itu?",
                            "verse 69:3": "Dan apa jalannya engkau dapat mengetahui tentang sifat dan keadaan saat yang tetap berlaku itu? (Saat itu ialah hari kiamat).",
                            "verse 69:4": "Kaum Thamud dan Aad telah mendustakan hari (kiamat) yang menggempar dan mengharukan itu.",
                            "verse 69:5": "Maka (masing-masing menerima azab dunianya) - adapun Thamud (kaum Nabi Soleh), maka mereka telah dibinasakan dengan (petir) yang melampau dahsyatnya.",
                            "verse 69:6": "Adapun Aad (kaum Nabi Hud), maka mereka telah dibinasakan dengan angin ribut yang kencang, yang melampau kencangnya, -",
                            "verse 69:7": "Yang diarahkannya menyerang mereka tujuh malam lapan hari terus-menerus; (kalaulah engkau menyaksikannya) maka engkau akan melihat kaum itu bergelimpangan mati, seolah-olah mereka batang-batang pohon kurma yang (tumbang dan) lompang.",
                            "verse 69:8": "Dengan yang demikian, dapatkah engkau melihat lagi sisa-sisa mereka (yang masih hidup)?",
                            "verse 69:9": "Dan (selain dari mereka) datanglah Firaun dan orang-orang yang terdahulu daripadanya, serta penduduk negeri-negeri yang telah ditunggang balikkan - dengan melakukan perkara-perkara yang salah.",
                            "verse 69:10": "Iaitu masing-masing menderhaka kepada Rasul (yang diutuskan oleh) Tuhan mereka, lalu Allah menyeksa mereka dengan azab yang sentiasa bertambah.",
                            "verse 69:11": "Sesungguhnya Kami, - ketika air (banjir) melampaui hadnya (serta menenggelamkan gunung-ganang), - telah mengangkut (serta menyelamatkan nenek moyang) kamu ke dalam bahtera Nabi Nuh (yang bergerak laju pelayarannya).",
                            "verse 69:12": "(Kami lakukan yang demikian) untuk Kami jadikan peristiwa itu satu pelajaran bagi kamu dan untuk didengar serta diambil ingat oleh telinga (orang-orang) yang mahu menerima pengajaran.",
                            "verse 69:13": "Kemudian (ketahuilah bahawa) apabila ditiup Sangkakala dengan sekali tiup,",
                            "verse 69:14": "Dan bumi serta gunung-ganang diangkat (dari tempatnya) lalu dihancurkan keduanya dengan sekali hancur,",
                            "verse 69:15": "Maka pada saat itu berlakulah hari kiamat,",
                            "verse 69:16": "Dan terbelahlah langit, lalu menjadilah ia pada saat itu reput (dan runtuh),",
                            "verse 69:17": "Sedang malaikat-malaikat (ditempatkan) mengawal segala penjurunya dan Arasy Tuhanmu pada saat itu dipikul oleh lapan malaikat di atas malaikat-malaikat yang mengawal itu.",
                            "verse 69:18": "Pada hari itu, kamu semua dihadapkan (untuk hitungan amal); tidak ada sesuatu pun yang tersembunyi (kepada Allah) dari perkara-perkara kamu yang tersembunyi.",
                            "verse 69:19": "Maka sesiapa yang diberikan menerima Kitab amalnya dengan tangan kanannya, maka dia akan berkata (dengan sukacitanya kepada sesiapa yang ada di sisinya): Nah! Bacalah kamu Kitab amalku ini!",
                            "verse 69:20": "Sesungguhnya aku telah mengetahui dengan yakin, bahawa aku akan menghadapi hitungan amalku (pada hari yang ditentukan)!",
                            "verse 69:21": "Maka (dengan itu) tinggallah dia dalam kehidupan yang senang lenang lagi memuaskan,",
                            "verse 69:22": "Di dalam Syurga yang tinggi (darjatnya),",
                            "verse 69:23": "Buah-buahannya dekat untuk dipetik.",
                            "verse 69:24": "(Masing-masing dipersilakan menikmatinya dengan dikatakan): Makan dan minumlah kamu makanan dan minuman sebagai nikmat yang lazat dan baik kesudahannya, dengan sebab (amal-amal soleh) yang telah kamu kerjakan pada masa yang lalu (di dunia)!",
                            "verse 69:25": "Adapun orang yang diberikan menerima Kitab amalnya dengan tangan kirinya, maka dia akan berkata (dengan sesalnya): Alangkah baiknya kalau aku tidak diberikan Kitab amalku,",
                            "verse 69:26": "Dan aku tidak dapat mengetahui hitungan amalku.",
                            "verse 69:27": "Alangkah baiknya kalau kematianku di dunia dahulu, menjadi kematian pemutus (yang menamatkan kesudahanku, tidak dibangkitkan lagi);",
                            "verse 69:28": "Harta kekayaanku tidak dapat menolongku sedikitpun;",
                            "verse 69:29": "Kuat kuasaku (dan hujjah-hujjahku membela diri), telah binasa dan hilang lenyap dariku.",
                            "verse 69:30": "(Lalu diperintahkan malaikat penjaga Neraka): Tangkaplah orang yang berdosa itu serta belenggulah dia,",
                            "verse 69:31": "Kemudian bakarlah dia di dalam Neraka Jahiim;",
                            "verse 69:32": "Selain dari itu, masukkanlah dia dalam (lingkaran) rantai besi yang ukuran panjangnya tujuh puluh hasta, (dengan membelitkannya ke badannya)!",
                            "verse 69:33": "Sesungguhnya dia dahulu tidak beriman kepada Allah Yang Maha Besar,",
                            "verse 69:34": "Dan dia juga tidak menggalakkan (dirinya dan orang lain) memberi makanan (yang berhak diterima oleh) orang miskin.",
                            "verse 69:35": "Maka pada hari ini, tidak ada baginya di sini (seorangpun dari) kaum kerabat serta sahabat handai (yang dapat menolongnya), -",
                            "verse 69:36": "Dan tidak ada makanan (baginya) melainkan dari air danur,",
                            "verse 69:37": "Yang tidak memakannya melainkan orang-orang yang melakukan perkara yang salah.",
                            "verse 69:38": "Maka Aku bersumpah: Demi segala (yang nyata) yang kamu melihatnya, -",
                            "verse 69:39": "Dan segala (yang ghaib) yang kamu tidak melihatnya, -",
                            "verse 69:40": "Bahawa sesungguhnya Al-Quran itu ialah (wahyu dari Kami) yang disampaikan oleh Rasul yang mulia.",
                            "verse 69:41": "Dan bukanlah Al-Quran itu perkataan seorang penyair (sebagaimana yang kamu dakwakan. Tetapi sayang!) amatlah sedikit kamu beriman.",
                            "verse 69:42": "Dan juga bukanlah Al-Quran itu perkataan seorang pawang (sebagaimana yang kamu katakan. Tetapi sayang!) amatlah sedikit kamu mengambil peringatan.",
                            "verse 69:43": "(Al-Quran itu) diturunkan dari Allah Tuhan sekalian alam.",
                            "verse 69:44": "Dan kalaulah (Nabi Muhammad yang menyampaikan Al-Quran itu) mengatakan atas nama Kami secara dusta - sebarang kata-kata rekaan, -",
                            "verse 69:45": "Sudah tentu Kami akan menyentapnya, dengan kekuasaan Kami, -",
                            "verse 69:46": "Kemudian sudah tentu Kami akan memutuskan tali jantungnya (supaya dia mati dengan serta-merta);",
                            "verse 69:47": "Maka tidak ada seorangpun di antara kamu yang dapat menghalang (tindakan Kami itu) daripada menimpanya.",
                            "verse 69:48": "Dan sesungguhnya (Al-Quran) itu tetap menjadi peringatan bagi orang-orang yang bertakwa.",
                            "verse 69:49": "Dan sesungguhnya Kami sedia mengetahui bahawa ada di antara kamu yang mendustakan (Al-Quran, maka Kami akan membalasnya).",
                            "verse 69:50": "Dan sesungguhnya Al-Quran itu sudah tentu akan menyebabkan penyesalan bagi orang-orang yang kafir (semasa mereka menerima balasan).",
                            "verse 69:51": "Dan sesungguhnya Al-Quran itu adalah kebenaran yang diyakini (dengan seyakin-yakinnya).",
                            "verse 69:52": "Oleh itu bertasbihlah dengan memuji nama Tuhanmu Yang Maha Besar."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "(روز رستاخيز) روزى است كه مسلما واقع مى‏شود!",
                            "verse 69:2": "چه روز واقع شدنى!",
                            "verse 69:3": "و تو چه مى‏دانى آن روز واقع شدنى چيست؟!",
                            "verse 69:4": "قوم «ثمود» و «عاد» عذاب كوبنده الهى را انكار كردند (و نتيجه شومش را ديدند)!",
                            "verse 69:5": "اما قوم «ثمود» با عذابى سركش هلاك شدند!",
                            "verse 69:6": "و اما قوم «عاد» با تندبادى طغيانگر و سرد و پرصدا به هلاكت رسيدند،",
                            "verse 69:7": "(خداوند) اين تندباد بنيان‏كن را هفت شب و هشت روز پى در پى بر آنها مسلط ساخت، (و اگر آنجا بودى) مى‏ديدى كه آن قوم همچون تنه‏هاى پوسيده و تو خالى درختان نخل در ميان اين تند باد روى زمين افتاده و هلاك شده‏اند!",
                            "verse 69:8": "آيا كسى از آنها را باقى مى‏بينى؟!",
                            "verse 69:9": "و فرعون و كسانى كه پيش از او بودند و همچنين اهل شهرهاى زير و رو شده (قوم لوط) مرتكب گناهان بزرگ شدند،",
                            "verse 69:10": "و با فرستاده پروردگارشان مخالفت كردند; و خداوند (نيز) آنها را به عذاب شديدى گرفتار ساخت!",
                            "verse 69:11": "و هنگامى كه آب طغيان كرد، ما شما را سوار بر كشتى كرديم،",
                            "verse 69:12": "تا آن را وسيله تذكرى براى شما قرار دهيم و گوشهاى شنوا آن را دريابد و بفهمد",
                            "verse 69:13": "به محض اينكه يك بار در «صور» دميده شود،",
                            "verse 69:14": "و زمين و كوه‏ها از جا برداشته شوند و يكباره در هم كوبيده و متلاشى گردند،",
                            "verse 69:15": "در آن روز «واقعه عظيم‏» روى مى‏دهد،",
                            "verse 69:16": "و آسمان از هم مى‏شكافد و سست مى‏گردد و فرومى‏ريزد!",
                            "verse 69:17": "فرشتگان در اطراف آسمان قرارمى‏گيرند (و براى انجام ماموريتها آماده مى‏شوند); و آن روز عرش پروردگارت را هشت فرشته بر فراز همه آنها حمل مى‏كنند!",
                            "verse 69:18": "در آن روز همگى به پيشگاه خدا عرضه مى‏شويد و چيزى از كارهاى شما پنهان نمى‏ماند!",
                            "verse 69:19": "پس كسى كه نامه اعمالش را به دست راستش دهند (از شدت شادى و مباهات) فرياد مى‏زند كه: «(اى اهل محشر!) نامه اعمال مرا بگيريد و بخوانيد!",
                            "verse 69:20": "من يقين داشتم كه (قيامتى در كار است و) به حساب اعمالم مى‏رسم!»",
                            "verse 69:21": "او در يك زندگى (كاملا) رضايتبخش قرار خواهد داشت،",
                            "verse 69:22": "در بهشتى عالى،",
                            "verse 69:23": "كه ميوه هايش در دسترس است!",
                            "verse 69:24": "(و به آنان گفته مى‏شود:) بخوريد و بياشاميد گوارا در برابر اعمالى كه در ايام گذشته انجام داديد!",
                            "verse 69:25": "اما كسى كه نامه اعمالش را به دست چپش بدهند مى‏گويد: «اى كاش هرگز نامه اعمالم را به من نمى‏دادند",
                            "verse 69:26": "و نمى‏دانستم حساب من چيست!",
                            "verse 69:27": "اى كاش مرگم فرا مى‏رسيد!",
                            "verse 69:28": "مال و ثروتم هرگز مرا بى‏نياز نكرد،",
                            "verse 69:29": "قدرت من نيز از دست رفت!»",
                            "verse 69:30": "او را بگيريد و دربند و زنجيرش كنيد!",
                            "verse 69:31": "سپس او را در دوزخ بيفكنيد!",
                            "verse 69:32": "بعد او را به زنجيرى كه هفتاد ذراع است ببنديد;",
                            "verse 69:33": "چرا كه او هرگز به خداوند بزرگ ايمان نمى‏آورد،",
                            "verse 69:34": "و هرگز مردم را بر اطعام مستمندان تشويق نمى‏نمود;",
                            "verse 69:35": "از اين رو امروز هم در اينجا يار مهربانى ندارد،",
                            "verse 69:36": "و نه طعامى، جز از چرك و خون!",
                            "verse 69:37": "غذايى كه جز خطاكاران آن را نمى‏خورند!",
                            "verse 69:38": "سوگند به آنچه مى‏بينيد،",
                            "verse 69:39": "و آنچه نمى‏بينيد،",
                            "verse 69:40": "كه اين گفتار رسول بزرگوارى است،",
                            "verse 69:41": "و گفته شاعرى نيست، اما كمتر ايمان مى‏آوريد!",
                            "verse 69:42": "و نه گفته كاهنى، هر چند كمتر متذكر مى‏شويد!",
                            "verse 69:43": "كلامى است كه از سوى پروردگار عالميان نازل شده است!",
                            "verse 69:44": "اگر او سخنى دروغ بر ما مى‏بست،",
                            "verse 69:45": "ما او را با قدرت مى‏گرفتيم،",
                            "verse 69:46": "سپس رگ قلبش را قطع مى‏كرديم،",
                            "verse 69:47": "و هيچ كس از شما نمى‏توانست از (مجازات) او مانع شود!",
                            "verse 69:48": "و آن مسلما تذكرى براى پرهيزگاران است!",
                            "verse 69:49": "و ما مى‏دانيم كه بعضى از شما (آن را) تكذيب مى‏كنيد!",
                            "verse 69:50": "و آن مايه حسرت كافران است!",
                            "verse 69:51": "و آن يقين خالص است!",
                            "verse 69:52": "حال كه چنين است به نام پروردگار بزرگت تسبيح گوى!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "A realidade",
                            "verse 69:2": "Que é a realidade?",
                            "verse 69:3": "E o que te fará entender o que significa a realidade?",
                            "verse 69:4": "Os povos de Samud e de Ad desmentiram a calamidade.",
                            "verse 69:5": "Quanto ao povo de Samud, foi fulminado pela centelha!",
                            "verse 69:6": "E, quanto ao povo de Ad, foi exterminado por um furioso e impetuoso furacão.",
                            "verse 69:7": "Que Deus desencadeou sobre ele, durante sete noites e oito nefastos dias, em que poderias ver aqueles homens jacentes, como se fossem troncos de tamareiras caídos.",
                            "verse 69:8": "Porventura, viste algum sobrevivente, entre eles?",
                            "verse 69:9": "E o Faraó, os seus antepassados e as cidades nefastas disseminaram o pecado.",
                            "verse 69:10": "E desobedeceram ao mensageiro do seu Senhor, pelo que Ele os castigou rudemente.",
                            "verse 69:11": "Em verdade, quando as águas transbordaram, levamo-vos na arca.",
                            "verse 69:12": "Para fazemos disso um memorial para vós, e para que o recordasse qualquer mente atenta.",
                            "verse 69:13": "Porém, quando soar um só toque da trombeta,",
                            "verse 69:14": "E a terra e as montanhas forem desintegradas e trituradas de um só golpe,",
                            "verse 69:15": "Nesse dia, acontecerá o evento inevitável.",
                            "verse 69:16": "E o céu se fenderá, e estará frágil;",
                            "verse 69:17": "E os anjos estarão perfilados e, oito deles, nesse dia, carregarão o Trono do teu Senhor.",
                            "verse 69:18": "Nesse dia sereis apresentados (ante Ele), e nenhum dos vossos segredos (Lhe) será ocultado.",
                            "verse 69:19": "Então, aquele a quem for entregue o seu registro, na destra, dirá; Ei-lo aqui! Lede o meu registro;",
                            "verse 69:20": "Sempre soube que prestaria contas!",
                            "verse 69:21": "E ele gozará de uma vida prazenteira,",
                            "verse 69:22": "Em um jardim sublime,",
                            "verse 69:23": "Cujos frutos estarão ao seu alcance.",
                            "verse 69:24": "(E será dito àqueles que lá entrarem): Comei e bebei com satisfação, pelo bem que propiciastes em dias pretéritos!",
                            "verse 69:25": "Em troca, aquele a quem for entregue o seu registro na sinistra, dirá: Ai de mim! Oxalá não me tivesse sido entregue meu registro.",
                            "verse 69:26": "Nem jamais tivesse conhecido o meu cômputo;",
                            "verse 69:27": "Oh! Oxalá a minha primeira (morte) tivesse sido a anulação;",
                            "verse 69:28": "De nada me servem os meus bens;",
                            "verse 69:29": "A minha autoridade se desvaneceu...!",
                            "verse 69:30": "(Será dito): Pegai-o, manietai-o,",
                            "verse 69:31": "E introduzi-o na fogueira!",
                            "verse 69:32": "Então, fazei-o carregar uma corrente de setenta cúbitos,",
                            "verse 69:33": "Porque não creu em Deus, Ingente,",
                            "verse 69:34": "Nem diligenciou, no sentido de alimentar os necessitados.",
                            "verse 69:35": "Assim, pois, não terá, hoje, nenhum amigo íntimo,",
                            "verse 69:36": "Nem mais alimento do que o excremento,",
                            "verse 69:37": "Que ninguém comerá, a não ser os pecadores.",
                            "verse 69:38": "Juro, pois, pelo que vedes,",
                            "verse 69:39": "E pelo que não vedes,",
                            "verse 69:40": "Que este (Alcorão) é a palavra do Mensageiro honorável.",
                            "verse 69:41": "E não a palavra de um poeta.- Quão pouco credes-",
                            "verse 69:42": "Nem tampouco é a palavra de um adivinho. Quão pouco meditais!",
                            "verse 69:43": "(Esta) é uma revelação do Senhor do Universo.",
                            "verse 69:44": "E se (o Mensageiro) tivesse inventado alguns ditos, em Nosso nome",
                            "verse 69:45": "Certamente o teríamos apanhado pela destra;",
                            "verse 69:46": "E então, Ter-lhe-íamos cortado a aorta,",
                            "verse 69:47": "E nenhum de vós teria podido impedir-Nos,",
                            "verse 69:48": "E, certamente, este (Alcorão) é uma mensagem para os tementes,",
                            "verse 69:49": "-E Nós sabemos aqueles que, dentre vós, são os desmentidores-",
                            "verse 69:50": "E ele é uma angústia para os incrédulos;",
                            "verse 69:51": "E ele é verdade convicta.",
                            "verse 69:52": "Assim sendo, glorifica o nome do teu Senhor, o Ingente."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 69:1": "\"Cea adevãratã!\"",
                            "verse 69:2": "Ce este \"cea adevãratã\"?",
                            "verse 69:3": "Dar ce te-ar putea face sã crezi cã este \"cea adevãratã\"?",
                            "verse 69:4": "Thamud și ’Ad au socotit Ziua Judecãții o minciunã!",
                            "verse 69:5": "În ce-i privește, [cei din neamul] Thamud au fost nimiciți de vijelie.",
                            "verse 69:6": "Și în ce-i privește, [cei din neamul] ’Ad au fost nimiciți de un vântșuierãtor, turbat,",
                            "verse 69:7": "Pe care [Allah] l-a dezlãnțuit împotriva lor [vreme de] șapte nopți șiopt zile, una dupã alta! Și ai fi putut sã vezi neamul [de oameni]doborâți, de parcã ar fi fost niște tru",
                            "verse 69:8": "Oare mai vezi sã fi rãmas vreo urmã din ei?",
                            "verse 69:9": "Au urmat Faraon și cei de dinaintea lui și cetãțile nimicite , care au venit cu mare pãcat .",
                            "verse 69:10": "Și astfel, ei s-au rãzvrãtit împotriva Trimisului Domnului lor și Eli-a lovit cu pedeapsã mare.",
                            "verse 69:11": "Când apele s-au revãrsat, v-am dus pe voi pe corabie ,",
                            "verse 69:12": "Pentru ca Noi sã facem din aceasta pentru voi o pomenire și pentru ca urechea care o aude sã o ținã minte.",
                            "verse 69:13": "Și când se va sufla în trâmbițã cu o singurã suflare",
                            "verse 69:14": "Și vor fi ridicate pãmântul și munții și apoi vor fi fãcuți pulbere, dintr-o singurã loviturã ,",
                            "verse 69:15": "În Ziua aceea se va produce \"cea care trebuie sã se întâmple,\"",
                            "verse 69:16": "Iar cerul se va despica, cãci el în Ziua aceea va fi slab ,",
                            "verse 69:17": "Iar îngerii vor fi la marginile sale și opt [dintre ei] vor purtaTronul Domnului tãu deasupra lor , în Ziua aceea.",
                            "verse 69:18": "În Ziua aceea vã veți înfãțișa și nimic din voi nu va fi ascuns.",
                            "verse 69:19": "În ce-l privește pe acela cãruia i se va da cartea sa în dreapta lui , el va zice: \"țineți, citiți cartea mea!",
                            "verse 69:20": "Eu am crezut cã voi primi rãsplata mea!\"",
                            "verse 69:21": "Și el va avea parte de o viațã plãcutã,",
                            "verse 69:22": "Într-o Grãdinã înãlțatã,",
                            "verse 69:23": "Cu rodurile ei atârnând în jos.",
                            "verse 69:24": "\"Mâncați și beți cu plãcere pentru ceea ce ați fãcut mai înainte,în zilele trecute!\"",
                            "verse 69:25": "În ce-l privește pe cel cãruia i se va da cartea sa în stânga lui , acela va zice: \"Vai mie! Mai bine de nu mi s-ar fi dat cartea mea",
                            "verse 69:26": "Și de n-aș fi știut care este rãsplata mea!",
                            "verse 69:27": "Mai bine dacã ar fi fost [moartea mea] nestrãmutatã!",
                            "verse 69:28": "Averea mea nu mi-a fost de nici un folos!",
                            "verse 69:29": "Puterea mea a fost spulberatã!\"",
                            "verse 69:30": "\"Luați-l și puneți-l în lanțuri ,",
                            "verse 69:31": "Apoi lãsați-l sã ardã în Iad!",
                            "verse 69:32": "Apoi legați-l pe el cu un lanț de șaptezeci de coți mãsurã!",
                            "verse 69:33": "El nu a crezut în Allah Cel Mare",
                            "verse 69:34": "Și nu a îndemnat la hrãnirea celui sãrman!",
                            "verse 69:35": "[De aceea], el nu are în aceastã Zi aici nici un prieten",
                            "verse 69:36": "Și nici mâncare, afarã de puroi,",
                            "verse 69:37": "Pe care nu-l mãnâncã decât pãcãtoșii!\"",
                            "verse 69:38": "Dar nu!... Jur pe ceea ce vedeți",
                            "verse 69:39": "Și pe ceea ce nu vedeți",
                            "verse 69:40": "Cã el este Cuvântul unui Trimis nobil",
                            "verse 69:41": "Și nu este cuvântul unui poet! Însã voi nu credeți decât prea puțin!",
                            "verse 69:42": "Și nu este cuvântul unui ghicitor! Însã voi nu vã lãsați îndem- nați decât prea puțin!",
                            "verse 69:43": "Este o revelație de la Stãpânul lumilor!",
                            "verse 69:44": "Și dacã ar fi nãscocit el unele vorbe împotriva Noastrã,",
                            "verse 69:45": "L-am fi apucat Noi de [mâna] dreaptã",
                            "verse 69:46": "Și i-am fi tãiat Noi vâna inimii",
                            "verse 69:47": "Și nimeni dintre voi nu Ne-ar fi putut opri!",
                            "verse 69:48": "El este pentru cei cu fricã o îndemnare",
                            "verse 69:49": "Și Noi știm cã unii dintre voi îl socotesc minciunã .",
                            "verse 69:50": "El este un suspin pentru cei care nu cred",
                            "verse 69:51": "Și El este Adevãrul deplin!",
                            "verse 69:52": "Deci slãvește numele Domnului tãu Cel Mare [Al-'Aziz]!"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 69:1": "Cea care înconjoară!",
                            "verse 69:2": "Ce este cea care înconjoară?",
                            "verse 69:3": "Cum vei şti tu oare ce este cea care înconjoară?",
                            "verse 69:4": "Tamudiţii şi adiţii au socotit-o pe cea care bate minciună!",
                            "verse 69:5": "Tamudiţii pieriră în tunete şi fulgere.",
                            "verse 69:6": "Adiţii pieriră în vântul şuierător, năpraznic,",
                            "verse 69:7": "pe care l-am dezlănţuit asupra lor şapte nopţi şi opt zile de prăpăd. Să fi văzut poporul acela trântit ca nişte găunoase buturugi de curmal!",
                            "verse 69:8": "Vezi, cumva, c-ar fi rămas ceva după ei?",
                            "verse 69:9": "Faraon şi cei care au trăit înaintea lui, precum şi cetăţile cele de-a-ndoaselea, au adus păcatul.",
                            "verse 69:10": "Ei nu au dat ascultare trimisului Domnului lor şi Dumnezeu i-a luat fără zăbavă.",
                            "verse 69:11": "Când apele s-au revărsat, v-am luat în arcă,",
                            "verse 69:12": "ca să vă facem vouă din aceasta o amintire pe care urechea păstrătoare să o păstreze.",
                            "verse 69:13": "Când se va suna din trâmbiţă o dată,",
                            "verse 69:14": "când pământul şi munţii vor fi căraţi şi fărâmiţaţi deodată,",
                            "verse 69:15": "cea care cade neapărat în Ziua aceea va cădea,",
                            "verse 69:16": "iar cerul se va crăpa şi se va despica în Ziua aceea.",
                            "verse 69:17": "Îngerii se vor ţine de marginile lui, iar opt dintre ei vor purta Tronul Domnului în Ziua aceea.",
                            "verse 69:18": "În Ziua aceea veţi fi întorşi pe toate părţile şi nici o taină de-a voastră nu va rămâne ascunsă.",
                            "verse 69:19": "Celui ce i se va da cartea sa în mâna dreaptă va spune: “Iată, citiţi cartea mea!",
                            "verse 69:20": "Îmi închipui că îmi voi găsi socoteala!”",
                            "verse 69:21": "El va avea un trai plăcut",
                            "verse 69:22": "într-o Grădină prea-înaltă,",
                            "verse 69:23": "cu roade de cules la îndemână.",
                            "verse 69:24": "“Mâncaţi şi beţi în pace ca răsplată a ceea ce aţi săvârşit în zilele duse.”",
                            "verse 69:25": "Celui ce i se va da cartea sa în mâna stângă va spune: “Vai mie! Ce bine ar fi fost de nu mi s-ar fi dat cartea",
                            "verse 69:26": "şi nu mi-aş fi ştiut socoteala!",
                            "verse 69:27": "Vai! Ce bine era de-ar fi fost săvârşitoare (moartea)!",
                            "verse 69:28": "Averea la nimic nu mi-a slujit",
                            "verse 69:29": "şi puterea mi-a pierit!”",
                            "verse 69:30": "“Luaţi-l şi înjugaţi-l!",
                            "verse 69:31": "Aruncaţi-l în Iad!",
                            "verse 69:32": "Legaţi-l apoi cu un lanţ de şaptezeci de coţi.”",
                            "verse 69:33": "El nu credea în Dumnezeu cel Mare",
                            "verse 69:34": "şi nu îndemna pe nimeni să ospăteze sărmanul.",
                            "verse 69:35": "Astăzi, nu mai are nici un prieten apropiat,",
                            "verse 69:36": "nici mâncare afară de ghislin",
                            "verse 69:37": "pe care o mănâncă numai păcătoşii.",
                            "verse 69:38": "Ba nu! Jur pe ceea ce vedeţi",
                            "verse 69:39": "şi pe ceea ce nu vedeţi!",
                            "verse 69:40": "Acestea sunt spusele unui trimis cinstit,",
                            "verse 69:41": "şi nu sunt spusele unui poet — atât de puţin credeţi!",
                            "verse 69:42": "şi nici ale unui prezicător — atât de puţin cugetaţi!",
                            "verse 69:43": "Ci este o Pogorâre de la Domnul lumilor!",
                            "verse 69:44": "Dacă acesta ar fi făcut născociri asupra Noastră,",
                            "verse 69:45": "l-am fi apucat cu mâna dreaptă,",
                            "verse 69:46": "apoi i-am fi tăiat vena gâtului",
                            "verse 69:47": "şi nici unul dintre voi nu ne-ar fi putut sta în cale!",
                            "verse 69:48": "Aceasta este drept amintire celor temători,",
                            "verse 69:49": "însă Noi ştim că unii dintre voi o socotesc minciună!",
                            "verse 69:50": "Ea este tânguire celor tăgăduitori!",
                            "verse 69:51": "Acesta este Adevărul cel adevărat!",
                            "verse 69:52": "Preamăreşte Numele Domnului tău cel Mare!"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "Неотвратимое!",
                            "verse 69:2": "Что есть неотвратимость?",
                            "verse 69:3": "Что даст тебе понять,Что значит неизбежность?",
                            "verse 69:4": "Люди Саму –д и А–д то, что грядет2260а,назвали ложью.",
                            "verse 69:5": "Погублены за это были самудянестрашным гулом,(Что предвещал землетрясенье).",
                            "verse 69:6": "Погублены за это были и адитыСтремительным, ревущим ураганом.",
                            "verse 69:7": "Аллах заставил бушевать егонад нимиВсе восемь дней и семь ночей подряд.(И будь ты там), ты б мог увидетьвесь народ,Что (в смерти) был подобенсрубленным стволамДуплистых пальмовых деревьев.",
                            "verse 69:8": "Ужель ты видишь хоть одну живуюдушу,(Что избежала б наказанья)?",
                            "verse 69:9": "И Фараон, и те, что жили до него,И опрокинутые города2261 (в долинеТувы) —Все совершали (тяжкие) грехи",
                            "verse 69:10": "И отвергали каждого посланникаАллаха, —За то их наказал Аллах сполна!",
                            "verse 69:11": "Когда ж из берегов своих излилисьводы,Мы понесли вас по воде в плавучем(ко’вше)2262,",
                            "verse 69:12": "Чтоб это стало всем предупрежденьемИ чтоб внимающее ухо(Урок сей) в памяти несло.",
                            "verse 69:13": "И вот когда раздастся первыйтрубный глас",
                            "verse 69:14": "И будут сдвинуты и стерты в порошокОдним ударом и земля, и горы, —",
                            "verse 69:15": "В тот День(Великое) событие случится.",
                            "verse 69:16": "Расколется небесный свод, —Ведь небо в этот День непрочнымбудет,",
                            "verse 69:17": "И восемь ангелов со всех концов егоВ тот ДеньНад ними понесут Трон вашегоВладыки.",
                            "verse 69:18": "В тот ДеньВы будете приведены на Суд(Господень),И там ничто сокрытое не утаится.",
                            "verse 69:19": "И тот, кому представятКнигу (земных деяний) в правуруку2263,Скажет: «Вот вам! Читайте мою Книгу!",
                            "verse 69:20": "Поистине, (всегда) я знал,что (День наступит),Когда я встречу свой расчет!»",
                            "verse 69:21": "Сей человек получит вечноеблаженство",
                            "verse 69:22": "В Саду возвышенном,",
                            "verse 69:23": "Где фрукты обильно клонятся(к рукам).",
                            "verse 69:24": "«И ешьте вы, и пейте тамВо здравие за то, что (на земле)В истекшие года вы совершили».",
                            "verse 69:25": "А тот, кому представят книгу в левуруку2264,Скажет: «О, если б только эту книгумне не дали!",
                            "verse 69:26": "О, если б никогда не знать мне моегорасчета!",
                            "verse 69:27": "О, если бы (земная смерть) быламоим концом!2265",
                            "verse 69:28": "Мои богатства мне не помогли!",
                            "verse 69:29": "Вся власть (души моей) исчезла!»[Затем последует приказ]:",
                            "verse 69:30": "«Взять и связать его —",
                            "verse 69:31": "И жечь его на адовом костре!",
                            "verse 69:32": "Затем заставить его шествовать в цепиДлиною в семьдесят локтей2266, —",
                            "verse 69:33": "Поистине, он не уверовал в ВеликогоАллаха,",
                            "verse 69:34": "Дать пищу бедняку не побуждал,",
                            "verse 69:35": "И для него сегодня нет здесь друга",
                            "verse 69:36": "И нет иной еды, помимо нечистот2267,",
                            "verse 69:37": "Которые никто не ест, —Помимо тех, кто во грехе».",
                            "verse 69:38": "В знак Моего (знаменья)2267а,Что взору вашему открыто,",
                            "verse 69:39": "А также в знак того, чего не зрите вы!",
                            "verse 69:40": "Поистине, сие есть словоДостойного посланника (Аллаха),",
                            "verse 69:41": "А не поэта, —О, как же мало веруете вы! —",
                            "verse 69:42": "Не прорицателя, —О, как же мало вас увещевают! —",
                            "verse 69:43": "Сие — Послание Владыки всех миров.",
                            "verse 69:44": "И если бы посланник сейСвои реченья Нашим именем нарек,",
                            "verse 69:45": "Его б схватили Мы за праву руку,",
                            "verse 69:46": "Потом Мы рассекли б сердечнуюартерию его.",
                            "verse 69:47": "И не было б ни одного из вас,Кто мог бы защитить его(от гнева вашего Владыки).",
                            "verse 69:48": "Поистине, сие — Напоминаниедля тех,Кто гнева Божьего страшится.",
                            "verse 69:49": "И знаем Мы: поистине, средь вас естьи такие,Которые сие (Напоминанье) ложьюнарекают, —",
                            "verse 69:50": "Поистине, оно — причина (всехнесчастий) для неверных.",
                            "verse 69:51": "Оно ведь истинная несомненность.",
                            "verse 69:52": "А потому славь имя Бога твоего,Всевышнего Владыки!"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "La Inevitable.",
                            "verse 69:2": "¿Qué es la Inevitable?",
                            "verse 69:3": "Y ¿cómo sabrás qué es la Inevitable?",
                            "verse 69:4": "Los tamudeos y los aditas desmintieron la Calamidad.",
                            "verse 69:5": "Los tamudeos fueron aniquilados por el Rayo.",
                            "verse 69:6": "Los aditas fueron aniquilados por un viento glacial, impetuoso,",
                            "verse 69:7": "que desencadenó contra ellos para devastarlo todo durante siete noches y ocho días. Se veía a la gente yacer en ellas como troncos de palmeras derribadas.",
                            "verse 69:8": "¿Puedes tú ver algún rastro de ellos?",
                            "verse 69:9": "Pecaron Faraón, los que fueron antes de él y las vueltas de arriba abajo.",
                            "verse 69:10": "Desobedecieron al Enviado de su Señor y Éste les sorprendió de un modo irresistible.",
                            "verse 69:11": "Cuando las aguas lo inundaron todo, os llevamos en la embarcación,",
                            "verse 69:12": "para hacer de ella un recuerdo para vosotros, para que el oído atento lo retuviera.",
                            "verse 69:13": "Cuando se toque la trompeta una sola vez,",
                            "verse 69:14": "y la tierra y las montañas sean alzadas y pulverizadas de un solo golpe,",
                            "verse 69:15": "ese día sucederá el Acontecimiento.",
                            "verse 69:16": "El cielo se henderá, pues ese día estará quebradizo.",
                            "verse 69:17": "Los ángeles estarán en sus confines y ese día ocho de ellos llevarán, encima, el Trono de tu Señor.",
                            "verse 69:18": "Ese día se os expondrá: nada vuestro quedará oculto.",
                            "verse 69:19": "Aquél que reciba su Escritura en la diestra, dirá: «¡Tomad! ¡Leed mi Escritura!",
                            "verse 69:20": "¡Ya contaba con ser juzgado!»",
                            "verse 69:21": "Gozará de una vida agradable",
                            "verse 69:22": "en un Jardín elevado,",
                            "verse 69:23": "cuyos frutos estarán al alcance de la mano.",
                            "verse 69:24": "«¡Comed y bebed en paz el fruto de lo que hicisteis en días pasados!»",
                            "verse 69:25": "Aquél que reciba su Escritura en la siniestra, dirá: «¡Ojalá no se me hubiera entregado la Escritura",
                            "verse 69:26": "y no hubiera conocido el resultado de mi juicio!",
                            "verse 69:27": "¡ Ojalá hubiera sido definitiva!",
                            "verse 69:28": "De nada me ha servido mi hacienda.",
                            "verse 69:29": "Mi poder me ha abandonado»",
                            "verse 69:30": "«¡Cogedle y ponedle una argolla al cuello!",
                            "verse 69:31": "¡Que arda, luego, en el fuego de la gehena!",
                            "verse 69:32": "¡Sujetadle, luego, a una cadena de setenta codos!»",
                            "verse 69:33": "No creía en Alá, el Grandioso,",
                            "verse 69:34": "ni animaba a dar de comer al pobre.",
                            "verse 69:35": "Hoy no tiene aquí amigo ferviente,",
                            "verse 69:36": "ni más alimento que de guislin,",
                            "verse 69:37": "que sólo los pecadores comen.",
                            "verse 69:38": "¡Pues no! ¡Juro por lo que veis",
                            "verse 69:39": "y por lo que no veis,",
                            "verse 69:40": "que es, ciertamente, la palabra de un Enviado noble!",
                            "verse 69:41": "No es la palabra de un poeta -¡qué poca fe tenéis!-",
                            "verse 69:42": "ni la palabra de un adivino -¡qué poco os dejáis amonestar!-.",
                            "verse 69:43": "Es una revelación que procede del Señor del universo.",
                            "verse 69:44": "Si Nos hubiera atribuido algunos dichos,",
                            "verse 69:45": "le habríamos tomado de la diestra;",
                            "verse 69:46": "luego, le habríamos seccionado la aorta,",
                            "verse 69:47": "y ninguno de vosotros habría podido impedirlo.",
                            "verse 69:48": "Es, sí, un Recuerdo para los temerosos de Alá.",
                            "verse 69:49": "Ya sabemos, sí, que hay entre vosotros desmentidores.",
                            "verse 69:50": "Es, sí, un motivo de lamentación para los infieles.",
                            "verse 69:51": "Pero es algo, sí, absolutamente cierto.",
                            "verse 69:52": "¡Glorifica, pues, el nombre de tu Señor, el Grandioso!."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "நிச்சயமானது.",
                            "verse 69:2": "நிச்சயமானது எது?",
                            "verse 69:3": "அன்றியும் நிச்சயமானது என்னவென்று உமக்கு அறிவித்தது எது?",
                            "verse 69:4": "ஸமூது (கூட்டத்தாரு)ம், ஆது (கூட்டத்தாரு)ம் திடுக்கிடச் செய்வதை (கியாம நாளைப்) பொய்ப்பித்தனர்.",
                            "verse 69:5": "எனவே, ஸமூது கூட்டத்தார் (அண்டம் கிடுகிடச் செய்யும்) பெரும் சப்தத்தால் அழிக்கப்பட்டனர்.",
                            "verse 69:6": "இன்னும், ஆது கூட்டத்தாரோ பேரொலியோடு வேகமாகச் சுழன்று அடித்த கொடுங்காற்றினால் அழிக்கப்பட்டனர்.",
                            "verse 69:7": "அவர்கள் மீது, அதை ஏழு இரவுகளும், எட்டுப் பகல்களும் தொடர்ந்து வீசச் செய்தான், எனவே அந்த சமூகத்தினரை, அடியுடன் சாய்ந்துவிட்ட ஈச்சமரங்களைப் போல் (பூமியில்) விழுந்து கிடப்பதை (அக்காலை நீர் இருந்திருந்தால்) பார்ப்பீர்.",
                            "verse 69:8": "ஆகவே, அவர்களில் எஞ்சிய எவரையும் நீர் காண்கிறீரா?",
                            "verse 69:9": "அன்றியும் ஃபிர்அவ்னும், அவனுக்கு முன் இருந்தோரும் தலை கீழாய்ப்புரட்டப்பட்ட ஊராரும், (மறுமையை மறுத்து) பாவங்களைச் செய்து வந்தனர்.",
                            "verse 69:10": "அதனால், அவர்கள் தம் இறைவனின் தூதருக்கு மாறு செய்தனர், ஆதலால் அவன் அவர்களைப் பலமான பிடியாகப் பிடித்துக் கொண்டான்.",
                            "verse 69:11": "தண்ணீர் பொங்கிய போது நிச்சயமாக நாம் உங்களைக் கப்பலில் ஏற்றி(க் காப்பாற்றி)னோம்.",
                            "verse 69:12": "அதை உங்களுக்கு நினைவூட்டும் ஒரு படிப்பினையாக்குவதற்கும், பேணிக்காக்கும் செவி (அதை நினைவில் ஞாபகத்தில் வைத்து)ப் பேணிக்கொள்வதற்கும் (ஆக அவ்வாறு செய்தோம்).",
                            "verse 69:13": "எனவே, ஸூரில் (எக்காளத்தில்) ஊதல் ஒருமுறை ஊதப்படும் போது:",
                            "verse 69:14": "இன்னும் பூமியும் மலைகளும் தூக்கி (எறியப்பட்டு) பின்னர் ஒன்றோடு ஒன்று மோதி அவையிரண்டும் ஒரே தூளாக ஆக்கப்பட்டால் -",
                            "verse 69:15": "அந்த நாளில் தாம் நிகழ வேண்டிய (மாபெரும் சம்பவம்) நிகழும்.",
                            "verse 69:16": "வானமும் பிளந்து, அன்னாளில் அது அடியோடு தன் சக்தியை இழந்து விடும்.",
                            "verse 69:17": "இன்னும் மலக்குகள் அதன் கோடியிலிருப்பார்கள், அன்றியும், அந்நாளில் உம்முடைய இறைவனின் அர்ஷை (வானவர்) எட்டுப்பேர் தம் மேல் சுமந்திருப்பார்கள்.",
                            "verse 69:18": "(மானிடர்களே!) அந்நாளில் நீங்கள் (இறைவன் முன்) கொண்டுபோகப்படுவீர்கள், மறைவான உங்களுடைய எந்த விஷயமும் அவனுக்கு மறைந்து விடாது.",
                            "verse 69:19": "ஆகவே, எவருடைய பட்டோலை அவருடைய வலக்கையில் கொடுக்கப்படுமோ, அவர் (மகிழ்வுடன்), \"இதோ! என் பட்டோலையைப் படியுங்கள்\" எனக் கூறுவார்.",
                            "verse 69:20": "\"நிச்சயமாக, நாம் உன்னுடைய கேள்வி கணக்கை, திட்டமாக சந்திப்பேன் என்று எண்ணியே இருந்தேன்.\"",
                            "verse 69:21": "ஆகவே, அவர் திருப்தியான சுக வாழ்க்கையில் -",
                            "verse 69:22": "உயர்ந்த சுவர்க்கத்தில் இருப்பார்.",
                            "verse 69:23": "அதன் கனி(வகை)கள் (கைக்கு எட்டியதாக) சமீபத்திருக்கும்.",
                            "verse 69:24": "\"சென்று போன நாட்களில் நீங்கள் முற்படுத்தி(யனுப்பி)ய (நல்ல அமல்களின்) காரணத்தால், நீங்கள் இப்போது மகிழ்வோடு புசியுங்கள்; இன்னும் பருகுங்கள்\" (என அவர்களுக்குக் கூறப்படும்).",
                            "verse 69:25": "ஆனால் எவனுடைய பட்டோலை அவனுடைய இடக்கையில் கொடுக்கப்படுமோ அவன் கூறுவான்; \"என்னுடைய பட்டோலை எனக்குக் கொடுக்கப்படாமல் இருந்திருக்க வேண்டுமே!",
                            "verse 69:26": "\"அன்றியும், என் கேள்வி கணக்கு என்ன என்பதை நான் அறியவில்லையே-",
                            "verse 69:27": "\"(நான் இறந்த போதே) இது முற்றிலும் முடிந்திருக்கக் கூடாதா?",
                            "verse 69:28": "\"என் செல்வம் எனக்குப் பயன்படவில்லையே!",
                            "verse 69:29": "\"என் செல்வாக்கும் அதிகாரமும் என்னை விட்டு அழிந்து விட்டதே!\" (என்று அரற்றுவான்).",
                            "verse 69:30": "\"(அப்போது) அவனைப் பிடித்து, பிறகு அவனுக்கு அரிகண்டமும் (விலங்கும்) மாட்டுங்கள்.\"",
                            "verse 69:31": "\"பின், அவனை நரகத்தில் தள்ளுங்கள்.",
                            "verse 69:32": "\"பின்னர், எழுபது முழ நீளமுள்ள சங்கிலியால் அவனைக் கட்டுங்கள்\" (என்று உத்தரவிடப்படும்).",
                            "verse 69:33": "\"நிச்சயமாக அவன் மகத்துவமிக்க அல்லாஹ்வின் மீது ஈமான் கொள்ளாதிருந்தான்.\"",
                            "verse 69:34": "\"அன்றியும், அவன் ஏழைகளுக்கு(த் தானும் உணவளிக்கவில்லை, பிறரையும்) உணவளிக்கத் தூண்டவில்லை.\"",
                            "verse 69:35": "\"எனவே, அவனுக்கு இன்றைய தினம் இங்கே (அனுதாபப்படும்) எந்த நண்பனும் இல்லை.\"",
                            "verse 69:36": "\"சீழ் நீரைத் தவிர, அவனுக்கு வேறு எந்த உணவுமில்லை.\"",
                            "verse 69:37": "\"குற்றவாளிகளைத் தவிர, வேறு எவரும் அதைப் புசியார்.\"",
                            "verse 69:38": "ஆகவே, நீங்கள் பார்ப்பவற்றின் மீதும் சத்தியம் செய்கிறேன்.",
                            "verse 69:39": "நீங்கள் பார்க்காதவற்றின் மீதும், (சத்தியம் செய்கிறேன்.)",
                            "verse 69:40": "நிச்சயமாக, இது (நாம் அருளியவாறு ஓதி வரும்) கண்ணியமிக்க தூதரின் சொல்லாகும்.",
                            "verse 69:41": "இது ஒரு கவிஞனின் சொல்லன்று (எனினும்) நீங்கள் மிகவும் சொற்பமாகவே நம்புகிறீர்கள்.",
                            "verse 69:42": "(இது) ஒரு குறிகாரனின் சொல்லுமன்று (எனினும்) நீங்கள் சொற்பமாகவே (இதை நினைந்து) நல்லறிவு பெறுகிறீர்கள்.",
                            "verse 69:43": "அகிலத்தாருக்கெல்லாம் இறைவனிடமிருந்து (இது) இறக்கியருளப்பட்டதாகும்.",
                            "verse 69:44": "அன்றியும், நம்மீது சொற்களில் சிலவற்றை இட்டுக் கட்டிக் கூறியிருப்பாரானால் -",
                            "verse 69:45": "அவருடைய வலக்கையை நாம் பற்றிப் பிடித்துக் கொண்டு-",
                            "verse 69:46": "பின்னர், அவருடைய நாடி நரம்பை நாம் தரித்திருப்போம்.",
                            "verse 69:47": "அன்றியும், உங்களில் எவரும் (நாம்) அ(வ்வாறு செய்வ)தைத் தடுப்பவர்களில்லை.",
                            "verse 69:48": "ஆகவே, நிச்சயமாக அது (குர்ஆன்) பயபக்தியுடையவர்களுக்கு நல்லுபதேசமாகும்.",
                            "verse 69:49": "ஆயினும், (அதைப்) பொய்ப்பிப்பவர்களும் உங்களில் இருக்கின்றார்கள் என்பதை நிச்சயமாக நாம் அறிவோம்.",
                            "verse 69:50": "அன்றியும், நிச்சயமாக அது காஃபிர்களுக்கு கைசேதமாக இருக்கிறது.",
                            "verse 69:51": "மேலும், அது நிச்சயமாக உறுதியான உண்மையாகும்.",
                            "verse 69:52": "ஆகவே, மகத்தான உம்முடைய இறைவனின் திருப்பெயரைக் கொண்டு (துதி செய்து) தஸ்பீஹு செய்வீராக."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "สิ่งที่จะเกิดขึ้นอย่างแน่นอน (วันกิยามะฮ์)",
                            "verse 69:2": "สิ่งที่จะเกิดขึ้นอย่างแน่นอนนั้นคืออะไร",
                            "verse 69:3": "และอันใดเล่าทำให้เจ้ารู้ได้ว่า สิ่งที่จะเกิดขึ้นอย่างแน่นอนนั้นคืออะไร ?",
                            "verse 69:4": "พวกซะมูดและพวกอ๊าดได้ปฏิเสธวันกิยามะฮ์",
                            "verse 69:5": "พวกซะมูด ถูกทำลายด้วยเสียงกำปนาทที่น่ากลัว",
                            "verse 69:6": "ส่วนพวกอ๊าด ถูกทำลายด้วยลมพายุที่หนาวเหน็บ และเสียงดังก้อง",
                            "verse 69:7": "พระองค์ทรงให้อภัยนั้นเกิดขึ้นแก่พวกเขา เจ็ดคืนกับแปดวันต่อเนื่องกัน แล้วเจ้าจะเห็นหมู่ชนนั้นนอนตายอยู่เช่นนั้นประหนึ่งต้นอินทผลัมที่กลางล้มระเนระนาด",
                            "verse 69:8": "แล้วเจ้าเห็นอะไรบ้างหลงเหลือสำหรับพวกเขา",
                            "verse 69:9": "ฟิรเอาน์และพวกก่อนหน้าเขา และพวกมุอ์ตะฟิกาต (เมืองของพวกลูฏซึ่งถูกพลิกแผ่นดิน) ได้กระทำความผิด",
                            "verse 69:10": "พวกเขาได้ฝ่าฝืนต่อร่อซู้ลแห่งพระเจ้าของพวกเขา ดังนั้นพระองค์จึงทรงลงโทษพวกเขาอย่างหนัก",
                            "verse 69:11": "เมื่อน้ำท่วมสูงขึ้น แท้จริงเราได้บรรทุกพวกเจ้าไว้ในเรือของนูห์",
                            "verse 69:12": "เพื่อเราจักได้ทำให้มันเป็นเครื่องเตือนสติแก่พวกเจ้า และหูที่สำเหนียกจะได้จดจำมันไว้อย่างแม่นยำ",
                            "verse 69:13": "ครั้นเมื่อเสียงเป่าครั้งแรกถูกเป่าขึ้นโดยสังข์ (เป็นสัญญาณแจ้งให้ทราบถึงวันกิยามะฮ์)",
                            "verse 69:14": "แผ่นดินและเทือกเขาจะถูกยกขึ้นแล้วมันทั้งสองจะถูกกระแทกกันแตกกระจายเป็นผุยผง",
                            "verse 69:15": "ในวันนั้นวันกิยามะฮ์ก็จะเกิดขึ้น",
                            "verse 69:16": "และชั้นฟ้าก็จะแยกออก แล้วมันก็จะอ่อนกำลังลงอย่างไม่เป็นระเบียบในวันนั้น",
                            "verse 69:17": "และมะลักก็จะปรากฏอยู่บนเวหาและ (มลาอิกะฮ์) จำนวนแปดท่านจะทูนบังลังก์แห่งพระเจ้าของเจ้าไว้เบื้องบนพวกเขาในวันนั้น",
                            "verse 69:18": "วันนั้นพวกเจ้าจะถูกนำมาอยู่ต่อหน้าพระองค์ ไม่มีความลับอันใดจะถูกปิดบังแก่พวกเจ้า",
                            "verse 69:19": "ส่วนผู้ที่บันทึกของเขาถูกนำมายื่นให้ทางเบื้องขวาของเขา เขาจะกล่าวว่า มาอ่านบันทึกของฉันซิ",
                            "verse 69:20": "ความจริงฉันนึกทีเดียวว่า ฉันจะได้พบบัญชีของฉัน",
                            "verse 69:21": "แล้วเขาจะมีความเป็นอยู่อย่างสุขสำราญ",
                            "verse 69:22": "ในสวนสวรรค์อันสูงส่ง",
                            "verse 69:23": "การเด็ดผลไม้ของมันอยู่แค่เอื้อมมือ",
                            "verse 69:24": "พวกเจ้าจงกิน จงดื่ม อย่างเกษมสำราญ เพราะสิ่งที่พวกเจ้าได้ปฏิบัติไว้ในวันเวลาที่ได้ผ่านมา",
                            "verse 69:25": "ส่วนผู้ที่บันทึกของเขาถูกนำมายื่นให้ทางเบื้องซ้ายของเขา เขาจะกล่าวว่า ฉันภาวนาที่จะไม่ให้บันทึกของฉันถูกนำมายื่น",
                            "verse 69:26": "และไม่รู้เสียเลยว่าบัญชีของฉันจะเป็นเช่นใด",
                            "verse 69:27": "โอ้ หากว่าความตายได้เกิดขึ้นเสียก็จะดี",
                            "verse 69:28": "ทรัพย์สมบัติของฉันไม่ได้คุ้มกันแก่ฉันเลย",
                            "verse 69:29": "อำนาจของฉันก็ได้สูญสิ้นไปจากฉันแล้ว",
                            "verse 69:30": "(จะมีคำบัญชาแก่มลาอิกะฮ์ว่า) จงนำเขาไป แล้วจำตรวนเสีย",
                            "verse 69:31": "แล้วโยนเขาเข้ากองไฟนรก",
                            "verse 69:32": "แล้วล่ามโซ่เขา ซึ่งความยาวของมันเจ็ดสิบศอก",
                            "verse 69:33": "แท้จริง เขามิได้ศรัทธาต่ออัลลอฮ์ ผู้ยิ่งใหญ่",
                            "verse 69:34": "และเขามิได้ส่งเสริมให้อาหารแก่คนขัดสน",
                            "verse 69:35": "ดังนั้น วันนี้เขาจะไม่มีมิตรสนิท ณ ที่นี้",
                            "verse 69:36": "และไม่มีอาหารอย่างใด นอกจากน้ำหนองที่ไหลมาจากแผลของชาวนรก",
                            "verse 69:37": "ไม่มีผู้ใดกินมัน นอกจากบรรดาผู้กระทำความผิด",
                            "verse 69:38": "เปล่าเลย ข้าขอสาบานต่อสิ่งที่พวกเจ้ามองเห็น",
                            "verse 69:39": "และสิ่งที่พวกเจ้ามองไม่เห็น",
                            "verse 69:40": "แท้จริงอัลกรุอานนั้นคือคำกล่าวของร่อซู้ลผู้ทรงเกียรติ",
                            "verse 69:41": "และมิใช่คำกล่าวของนักกวี ส่วนน้อยเท่านั้นที่พวกเจ้าศรัทธา",
                            "verse 69:42": "และไม่ใช่คำกล่าวของนักพยากรณ์ส่วนน้อยเท่านั้นที่พวกเจ้าใคร่ครวญ",
                            "verse 69:43": "เป็นการประทานมาจากพระเจ้าแห่งสากลโลก",
                            "verse 69:44": "และหากเขา (มุฮัมมัด) เสกสรรกล่าวคำเท็จบางคำแก่เราแล้ว",
                            "verse 69:45": "เราก็จะจับเขาด้วยความมั่นคง",
                            "verse 69:46": "แล้วเราก็จะตัดเส้นชีวิตให้ขาดไปจากเขา",
                            "verse 69:47": "ดังนั้นจะไม่มีผู้ใดในหมู่พวกเจ้าเป็นผู้คุ้มกันเขาได้",
                            "verse 69:48": "และแท้จริงอัลกุรอานนั้นเป็นข้อเตือนสติแก่บรรดาผู้ยำเกรง",
                            "verse 69:49": "และแท้จริงเรารู้อย่างแน่นอนว่ามีบรรดาผู้ปฏิเสธอัลกุรอานในหมู่พวกเจ้า",
                            "verse 69:50": "และแท้จริงอัลกุรอานนั้น เป็นการเศร้าโศกเสียใจแก่บรรดาผู้ปฏิเสธศรัทธา",
                            "verse 69:51": "และแท้จริงอัลกุรอานนั้นคือความจริงอันเที่ยงแท้แน่นอน",
                            "verse 69:52": "ดังนั้นเจ้าจงให้ความบริสุทธิ์ด้วยพระนามแห่งพระเจ้าผู้ยิ่งใหญ่"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "Gerçekleşecek olan;",
                            "verse 69:2": "(Evet) nedir o gerçekleşecek olan?",
                            "verse 69:3": "Gerçekleşecek olanın (kıyametin) ne olduğunu sen nereden bileceksin?",
                            "verse 69:4": "Semûd ve Ad kavimleri, kapılarını çalacak felâketi (kıyameti) yalan saymışlardı.",
                            "verse 69:5": "Semûd'a gelince: Onlar pek zorlu (bir sarsıntı) ile helâk edildiler.",
                            "verse 69:6": "Ad kavmi ise, uğultulu, kasıp kavuran bir fırtına ile mahvedildiler.",
                            "verse 69:7": "Allah onu, ardarda yedi gece, sekiz gün onların üzerine musallat etti. Öyle ki (eğer orada olsaydın), o kavmi, içi boş hurma kütükleri gibi oracıkta yere serilmiş halde görürdün.",
                            "verse 69:8": "Şimdi onlardan arda kalan bir şey görüyor musun?",
                            "verse 69:9": "Firavun, ondan öncekiler ve altı üstüne getirilen beldeler halkı (Lût kavmi) hep o günahı (şirki) işlediler.",
                            "verse 69:10": "Böylece Rablerinin peygamberlerine karşı geldiler, O da onları pek şiddetli bir şekilde yakalayıverdi.",
                            "verse 69:11": "Şüphesiz, su bastığı vakit sizi gemide biz taşıdık;",
                            "verse 69:12": "Onu sizin için bir ibret ve öğüt yapalım ve belleyici kulaklar onu bellesin diye.",
                            "verse 69:13": "Artık Sûr'a bir tek defa üflendiği,",
                            "verse 69:14": "Yeryüzü ve dağlar kaldırılıp birbirine tek çarpışla çarpılıp darmadağın edildiği zaman,",
                            "verse 69:15": "işte o gün olacak olur (kıyamet kopar).",
                            "verse 69:16": "Gök de yarılır ve artık o gün o, çökmeye yüz tutar.",
                            "verse 69:17": "Melekler onun (göğün) etrafındadır. O gün Rabbinin arşını, bunların da üstünde sekiz (melek) yüklenir.",
                            "verse 69:18": "(Ey insanlar! ) O gün (hesap için) huzura alınırsınız; size ait hiçbir sır gizli kalmaz.",
                            "verse 69:19": "Kitabı sağ tarafından verilen:\" Alın, kitabımı okuyun\" der.",
                            "verse 69:20": "[69.20]\" Doğrusu ben, hesabımla karşılaşacağımı zaten biliyordum.\"",
                            "verse 69:21": "Artık o, hoşnut kalacağı bir hayat içindedir,",
                            "verse 69:22": "Yüce bir cennette,",
                            "verse 69:23": "Meyveleri sarkmış halde.",
                            "verse 69:24": "(Onlara denir ki:) Geçmiş günlerde işlediklerinize (iyi amellerinize) karşılık, âfiyetle yeyin, için.",
                            "verse 69:25": "Kitabı sol tarafından verilene gelince,der ki:\" Keşke, bana kitabım verilmeseydi!\"",
                            "verse 69:26": "[69.26]\"Şu hesabımın ne olduğunu bilmeseydim!\"",
                            "verse 69:27": "Keşke onunla (ölümümle) her iş olup bitseydi!",
                            "verse 69:28": "Malım bana hiç fayda sağlamadı;",
                            "verse 69:29": "Saltanatım da benden (koptu), yok olup gitti.",
                            "verse 69:30": "Onu yakalayın da, (ellerini boynuna) bağlayın;",
                            "verse 69:31": "Sonra alevli ateşe atın onu!",
                            "verse 69:32": "Sonra da onu yetmiş arşın uzunluğunda bir zincir içinde oraya sokun!",
                            "verse 69:33": "Çünkü o, ulu Allah'a iman etmezdi,",
                            "verse 69:34": "Yoksulu doyurmaya teşvik etmezdi.",
                            "verse 69:35": "Bu sebeple, bugün burada onun candan bir dostu yoktur.",
                            "verse 69:36": "İrinden başka yiyecek de yoktur.",
                            "verse 69:37": "Onu (bile bile )hata işleyenlerden başkası yemez.",
                            "verse 69:38": "Görebildikleriniz üzerine yemin ederim,",
                            "verse 69:39": "Ve göremediklerinize ki,",
                            "verse 69:40": "Hiç şüphesiz o (Kur'an), çok şerefli bir elçinin sözüdür.",
                            "verse 69:41": "Ve o, bir şair sözü değildir. Ne de az iman ediyorsunuz!",
                            "verse 69:42": "Bir kâhin sözü de değildir (o). Ne de az düşünüyorsunuz!",
                            "verse 69:43": "(O), âlemlerin Rabbi tarafından indirilmiştir.",
                            "verse 69:44": "Eğer (Peygamber) bize atfen bazı sözler uydurmuş olsaydı,",
                            "verse 69:45": "Elbette onu kıskıvrak yakalardık.",
                            "verse 69:46": "Sonra onun can damarını koparırdık (onu yaşatmazdık).",
                            "verse 69:47": "Hiçbiriniz buna mâni de olamazdınız.",
                            "verse 69:48": "Doğrusu o (Kur'an), takvâ sahipleri için bir öğüttür.",
                            "verse 69:49": "İçinizde (onu) yalan sayanlar bulunduğunu şüphesiz bilmekteyiz.",
                            "verse 69:50": "Muhakkak o, kâfirler için bir iç yarasıdır.",
                            "verse 69:51": "Ve o, gerçekten kat'î bilginin ta kendisidir.",
                            "verse 69:52": "O halde, ulu Rabbinin adını yüceltip noksanlıklardan tenzih et. l. Bir soran inecek azabı sordu:"
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 69:1": "Ал-Ҳааққаҳ.",
                            "verse 69:2": "Ал-Ҳааққаҳ нима ўзи?!",
                            "verse 69:3": "Ал-Ҳааққаҳ нималигини сенга нима билдирди?!",
                            "verse 69:4": "Самуд ва Од қориъани ёлғонга чиқаришди. («Қориъа» ҳам қиёматнинг номларидан бири, шиддат билан эшик қоқиб келувчи маъносини англатади.)",
                            "verse 69:5": "Бас, аммо Самуд ҳаддан ошувчи билан ҳалок қилинди. («Ҳаддан ошувчи»дан мурод қаттиқ чақмоқдир.)",
                            "verse 69:6": "Ва аммо Од қаттиқ (совуқ) шамол билан ҳалок қилиндилар.",
                            "verse 69:7": "У зот уларнинг устидан бу шамолни етти кечаю саккиз кундуз бетўхтов эстириб қўйди. Бас, қавмни у ерда ҳалок бўлиб, ағдарилиб ётганини кўрасан. Улар худди хурмонинг чириган томирларига ўхшарлар.",
                            "verse 69:8": "Бас, сен улардан бирортасини боқий қолганини кўрасанми?",
                            "verse 69:9": "Фиръавн, ундан аввалгилар ва тўнтарилганлар хато қилдилар.",
                            "verse 69:10": "Бас, улар Роббиларининг Расулига осий бўлдилар. Дарҳақиқат, У зот уларни қаттиқ тутишлик билан тутди.",
                            "verse 69:11": "Албатта, Биз сув туғёнга келган пайтда сизларни кемада кўтарганмиз.",
                            "verse 69:12": "Уни сизларга эслатма қилиш учун ва англовчи қулоқлар англаб олиши учун. (Бўлиб ўтган қисса ва ҳодисалар ҳамма учун ўрнак, эслатма, ваъз-насиҳат бўлиши керак.)",
                            "verse 69:13": "Қачонки дудга биргина пуфлашла пуфланса...",
                            "verse 69:14": "Ва еру тоғлар кўтарилиб, бир мартагина силкитилса...",
                            "verse 69:15": "Бас, ўша кунда, воқеа воқеъ бўлибдир.",
                            "verse 69:16": "Ва осмон парчаланса, бас, ўша кунда, у (осмон) беҳолдир.",
                            "verse 69:17": "Ва фаришталар унинг атрофида ва ўша кунда Роббингнинг Аршини саккизтаси кўтариб турадир. (Аллоҳнинг аршини саккизта ёки саккиз турли фаришталар кўтариб турадилар. Арш ўзида иззат, султон ва моликлик маъноларини англатади. Башарият Аршнинг исмини билади, унинг ҳақиқатини Аллоҳнинг Ўзи билади.)",
                            "verse 69:18": "Бас, ўша кунда кўрикдан ўтасизлар, бирорта нарсангиз махфий қолмайдир.",
                            "verse 69:19": "Бас, кимнинг китоби ўнг тарафдан берилса, у, мана, менинг китобимни ўқиб кўринглар...",
                            "verse 69:20": "Албатта, мен ҳисоб-китобимга йўлиқишимга ишонардим, дейдир.",
                            "verse 69:21": "Бас, у розилик ҳаётидадир.",
                            "verse 69:22": "Олий жаннатдадир.",
                            "verse 69:23": "Унинг мевалари яқиндир.",
                            "verse 69:24": "Ўтган кунларда қилган нарсаларингиз туфайли енглар ва ичинглар, ош бўлсин.",
                            "verse 69:25": "Ва аммо кимнинг китоби чап тарафдан берилса, у, вой шўрим, кошки менга китобим берилмаса эди.",
                            "verse 69:26": "Ва ҳисоб-китоб қандоқлигини билмасам эди.",
                            "verse 69:27": "Қани (бу дунёдаги ўлим) охиргиси бўлса эди.",
                            "verse 69:28": "Молу мулким мени сақлаб қола олмади.",
                            "verse 69:29": "Менинг султоним ҳам ҳалок бўлди, дейдир. (Мулку султоним, мансабу обрўйим, насабу хасабим ҳамма ҳаммаси ҳалок бўлди.)",
                            "verse 69:30": "Тутинглар уни ва кишанланглар уни!!!",
                            "verse 69:31": "Сўнгра жаҳаннамга солинглар уни!!!",
                            "verse 69:32": "Сўнгра етмиш қулочли занжирга киритинг уни!!!",
                            "verse 69:33": "Чунки у улуғ Аллоҳга иймон келтирмаган эди.",
                            "verse 69:34": "Ва мискинларга таом беришга қизиқтирмаган эди. (Мискинларга таом беришга қизиқтирмаслик шунчаликка олиб келса, имкони бўлса туриб уларга таом бермаслик қанчалик гуноҳ экан–буни китобхоннинг ўзи фаҳмлайверсин.)",
                            "verse 69:35": "Бас, бугунги кунда унга бу ерда бирон чин дўст йўқ.",
                            "verse 69:36": "Ва ғислийндан ўзга таом ҳам йўқ.",
                            "verse 69:37": "У(таом)ни хатокорлардан бошқа ҳеч ким емас.",
                            "verse 69:38": "Сизлар кўриб турган нарсалар билан қасам ичурман.",
                            "verse 69:39": "Ва сизлар кўрмайдиган нарсалар билан ҳам.",
                            "verse 69:40": "Албатта у(Қуръон) карамли Расулнинг сўзидир. (Қуръони Каримни Пайғамбаримиз саллоллоҳу алайҳи васалламга нисбат берилиши У зот (с.а.в) у каломни тиловат қилувчи ва кишиларга етказувчи эканлигидандир.)",
                            "verse 69:41": "Ва у шоирнинг сўзи эмас. Сизлар жуда оз ишонасизлар.",
                            "verse 69:42": "Ва фолбиннинг ҳам сўзи эмас. Сизлар жуда оз эсларсизлар.",
                            "verse 69:43": "Оламлар Роббисидан туширилгандир.",
                            "verse 69:44": "Ва агар у Бизнинг (номимиздан) баъзи ёлғон сўзларни тўқиса.",
                            "verse 69:45": "Албатта, Биз уни қудрат билан тутармиз.",
                            "verse 69:46": "Сўнгра, албатта, унинг шоҳ томирини кесармиз.",
                            "verse 69:47": "Бас, сизлардан ҳеч ким уни тўсиб қола олмас.",
                            "verse 69:48": "Ва, албатта, у(Қуръон) тақводорлар учун эслатмадир.",
                            "verse 69:49": "Ва, албата, Биз сизларнинг ичингизда ёлғонга чиқарувчилар борлигини билиб турамиз.",
                            "verse 69:50": "Ва албатта у кофирлар учун ҳасратдир.",
                            "verse 69:51": "Ва албатта у шубҳасиз ҳақиқатдир.",
                            "verse 69:52": "Бас, улуғ Роббингнинг исмини поклаб ёд эт."
                        }
                    }
                }
            }
        }
    }
}