{
    "id": 72,
    "name_simple": "Al-Jinn",
    "revelation_place": "makkah",
    "revelation_order": 40,
    "bismillah_pre": true,
    "verses_count": 28,
    "short_text": "'Al-Jinn' is the name of this Surah as well as the title of its subject matter, for in it the event of the Jinn's hearing the Qur'an and returning to their people to preach Islam to them, has been related in detail.",
    "text": [
        "\n",
        "\"Al-Jinn \" is the name of this Surah as well as the title of its subject matter, for in it the event of the Jinn's hearing the Qur'an and returning to their people to preach Islam to them, has been related in detail.",
        "\n",
        "Period of Revelation",
        "\n",
        "According to a tradition related in Bukhari and Muslim, on the authority of Hadrat Abdullah bin Abbas, once the Holy Prophet (upon whom be peace) was going to Visit the Fair of Ukaz with some of his Companions, On the way be led the Fajr Prayer at Nakhlah. At that time a company of the jinn happened to pass that way. When they heard the Quran being recited, they tarried and listened to it attentively. This very event has been described in this Surah.",
        "\n",
        "Most of the commentators, on the basis of this tradition, believe that this relates to the Holy Prophet's well known journey to Taif, which had taken place three years before the Hijrah in the 10th year of the Prophethood. But this is not correct for several reasons. The jinn's hearing the Qur'an during the journey to Taif has been related in Al-Ahqaf 29-32. A cursory reading of those verses shows that the jinn who had believed after hearing the Qur'an on that occasion were already believers in the Prophet Moses and the previous scriptures. On the contrary, vv. 2-7 of this surah clearly show that the jinn who heard the Qur'an on this occasion were polytheists and deniers of the Hereafter and Prophethood. Then, it is confirmed historically that in his journey to Taif none accompanied the Holy Prophet except Hadrat Zaid bin Harithah. On the contrary, concerning this journey Ibn Abbas says that the Holy Prophet (upon whom be peace) was accompanied by some of his Companions.\r\nFurthermore, the traditions also agree that in that journey the jinn heard the Qur'an when the Holy Prophet had stopped at Nakhlah on his return journey from Taif to Makkah, and in this journey, according to the traditions of Ibn Abbas, the event of the jinn's hearing the Qur'an occurred when the Holy Prophet was going to Ukaz from Makkah. Therefore, in view of these reasons what seems to be correct is that in Surah Al-Ahqaf and Surah Al Jinn, one and the same event has not been narrated, but these were two separate events, which took place during two separate journeys.",
        "\n",
        "As far as Surah Al-Ahqaf is concerned, it is agreed that the event mentioned in it occurred on the return journey from Taif in the 10th year of Prophethood. As for the question, when this second event took place, its answer is not given by the tradition of Ibn Abbas, nor any other historical tradition shows as to when the Holy Prophet had gone to the Fair of Ukaz along with some of his Companions. However, a little consideration of vv. 8-10 of this surah shows that this could only be an event of the earliest stage of Prophethood. In these verses it has been stated that before the appointment of the Holy Prophet (upon whom be peace) to Divine Mission the jinn used to have one or another opportunity to eavesdrop in the heavens in order to hear news of the unseen, but after it they suddenly found that angels had been set as guards and meteorites were being shot on every side so that they could find no place of safety from where they could hear the secret news. Thereupon they had set\r\nabout searching for the unusual thing that had occurred on the earth, or was going to occur, because of which the security measures had been tightened up. Probably since then many companies of the jinn must have been moving about in search of the unusual occurrence and one of them after having heard the Qur'an from the Holy Prophet (upon whom be peace) must have formed the opinion that that was the very thing for the sake of which all the gates of the heavens had been shut against the jinn.",
        "\n",
        "Reality of Jinn",
        "\n",
        "Before one starts the study of this Surah one must clearly know what is the reality of the jinn so as to avoid any possible mental confusion. Many people of the modern times are involved in the misunderstanding that the jinn are not real, but only a figment of the ancient superstition and myths. They have not formed this opinion on the basis that they have known all the realities and truths about the universe and have thus discovered that the jinn do not exist. They cannot claim to possess any such knowledge either. But they have assumed without reason and proof that nothing exists in the universe except what they can see, whereas the sphere of human perceptions as against the vastness of this great universe is not even comparable to a drop of water as against the ocean. Here, the person who thinks that what he does not perceive, does not exist, and what exists must necessarily be perceived, in fact, provides a proof of the narrowness of his own mind. With this mode of thought,\r\nnot to speak of the jinn, man cannot even accept and acknowledge any reality, which he cannot directly experience and observe, and he cannot even admit the existence of God, to say nothing of admitting any other unseen reality.",
        "\n",
        "Those of the Muslims who have been influenced by modernism, but cannot deny the Qur'an either, have given strange interpretations of the clear statements of the Qur'an about the jinn, Iblis and Satan. They say that this does not refer to any hidden creation, which may have its own independent existence, but it sometimes implies man's own animal forces, which have been called Satan, and sometimes it implies savage and wild mountain tribes, and sometimes the people who used to listen to the Qur'an secretly. But the statements of the Qur'an in this regard are so clear and explicit that these interpretations bear no relevance to them whatever.",
        "\n",
        "The Qur'an frequently mentions the jinn and the men in a manner as to indicate that they are two separate creations. For this, see Al Araf: 38, Hud: 119, Ha Mim As-Sajdah: 25,29, Ahqaf: 18, Adh Dhariyat: 56, and the entire surah Ar-Rahman, which bears such clear evidence as to leave no room to regard the jinn as a human species.",
        "\n",
        "In Surah Al-Araf: 12, Al Hijr: 26-27 and Ar-Rahman: 14-19, it has been expressly stated that man was created out of clay and jinn out of fire.",
        "\n",
        "In Surah Al Hijr: 27, it has been said that the jinn had been created before man. The same thing is testified by the story of Adam and Iblis, which has been told at seven different places in the Qur'an, and at every place it confirms that Iblis was already there at the creation of man. Moreover, in surah Al- Kahf: 50, it has been stated that Iblis belonged to the jinn.",
        "\n",
        "In Surah Al-Araf: 27,, it has been stated in clear words that the jinn see the human beings but the human beings do not see them.",
        "\n",
        "In Surah Al Hijr: 16-18, Surah As-Saaffat: 6-10 and Surah Al-Mulk: 5, it has been said that although the jinn can ascend to the heavens, they cannot exceed a certain limit; if they try to ascend beyond that limit and try to hear what goes on in the heavens, they are not allowed to do so, and if they try to eavesdrop they are driven away by meteorites. By this the belief of the polytheistic Arabs that the jinn possess the knowledge of the unseen, or have access to Divine secrets, has been refuted. The same error has a]so been refuted in Saba: 14.",
        "\n",
        "Al-Baqarah: 30-34 and Al- Kahf: 50 show that Allah has entrusted man with the vicegerency of the earth and the men are superior to the jinn. Although the jinn also have been given certain extraordinary powers and abilities an example of which is found in An-Naml: 39, yet the animals likewise have been given some powers greater than man, but these are no argument that the animals are superior to man.",
        "\n",
        "The Qur'an also explains that the jinn, like men, are a creation possessed of power and authority, and they, just like them, can choose between obedience and disobedience, faith and disbelief. This is confirmed by the story of Satan and the event of the jinn affirming the faith as found in Surahs Al-Ahqaf and Al-Jinn.",
        "\n",
        "At scores of places in the Qur'an, it has also been stated that Iblis at the very creation of Adam had resolved to misguide mankind, and since then the Satanic jinn have been persistently trying to mislead man, but they do not have the power to overwhelm him and make him do something forcibly. However, they inspire him with evil suggestions, beguile him and make evil seem good to him. For this, see An-Nisa: 117-120, Al-Araf: 11-17, Ibrahim: 22, Al-Hijr: 30-42, An-Nahl: 98-100, Bani Israil 61-65.",
        "\n",
        "The Qur'an also tells us that in the pre Islamic ignorance the polytheistic Arabs regarded the jinn as associates of God, worshiped them and thought they were descended from God. For this, see Al-An'am: 100, Saba: 40-41, As Saffat: 158.",
        "\n",
        "From these details, it becomes abundantly clear that the jinn have their own objective existence and are a concealed creation of an entirely different species from man. Because of their mysterious qualities, ignorant people have formed exaggerated notions and concepts about them and their powers, and have even worshiped them, but the Qur'an has explained the whole truth about them, which shows what they are and what they are not.",
        "\n",
        "Theme and Topics",
        "\n",
        "In this Surah in vv. 1-15, it has been told what was the impact of the Qur'an on the company of the jinn when they heard it and what they said to their fellow jinn when they returned to them. Allah, in this connection, has not cited their whole conversation but only those particular things which were worthy of mention. That is why the style is not that of a continuous speech but sentences have been cited so as to indicate that they said this and this. If one studies these sentences spoken by the jinn carefully, one can easily understand the real object of the narration of this event of their affirming the faith and or mentioning this conversation of theirs with their people in the Qur'an. The explanations that we have given of their statements in our Notes will be of further help in understanding this object.",
        "\n",
        "After this, in vv. 16-18, the people have been admonished to the effect:\"If you refrain from polytheism and follow the way of righteousness firmly, you will be blessed; otherwise if you turn away from the admonition sent down by Allah, you will meet with a severe punishment.\" Then, in vv. 19-23, the disbelievers of Makkah have been reproached, as if to say: When the Messenger of Allah calls you towards Allah, you surround and mob him from every side, whereas the only duty of the Messenger is to convey the messages of Allah. He does not claim to have any power to bring any gain or cause any harm to the people.\" Then, in vv. 24-25 the disbelievers have been warned to the effect: \"Today you are trying to overpower and suppress the Messenger seeing that he is helpless and friendless, but a time will come when you will know who in actual fact is helpless and friendless. Whether that time is yet far off, or near at hand, the Messenger has no knowledge thereof, but it will come to pass\r\nin any case.\" In conclusion, the people have been told: The Knower of the unseen is Allah alone. The Messenger receives only that knowledge which Allah is pleased to give him. This knowledge pertains to matters connected with the performance of the duties of Prophethood and it is delivered to him in such security which does not admit of any external interference whatever.",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that opens with the revelation that a group of The Jinn listened to the Prophet reciting the Quran, believed in it, and so admonished their own race. It is names after the jinn-kind, whose account is given in its first part. The surah begins with the account of what a group of jinn said when they overheard a recitation of the Quran and realized its truth (verse 1 .). This is a lesson to the Meccan Arabs, who are also told that the Prophet can help them only by delivering the Message—God is the All Powerful One (verse 16 .). The disbelievers are threatened with what they will meet on the Day of Judgement (verse 23 ).The surah is also known as: Jinn-kind, Sprites, The Jinn's, The Spirits.",
    "name_translation": "The Jinn",
    "name_complex": "Al-Jinn",
    "surah_name_ar": "الجن",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 72:1": "Thuaj (o Muhammed!): “Mua m’u ka shpallur se disa prej xhindëve (krijesa të padukshme), kanë dëgjuar dhe kanë thënë: “Me të vërtetë, kemi dëgjuar (një) Kur’an të mrekullueshëm,",
                            "verse 72:2": "i cili udhëzon në rrugën e drejtë – e ne kemi besuar në të, dhe kurrsesi më nuk do t’i bëjmë shok askë Perëndisë sonë,",
                            "verse 72:3": "e, me të vërtetë, qoftë, lartë madhëria e Tij – Zotit tonë! Ai, nuk ka marrë për Vete as bashkëshorte as fëmijë;",
                            "verse 72:4": "(Disa) të marrët nga ne, flisnin gënjeshtra për Perëndinë,",
                            "verse 72:5": "kurse ne, kemi menduar se as njerëzit as xhindët nuk flasin gënjeshtra për Perëndinë;",
                            "verse 72:6": "e disa njerëz kanë kërkuar strehim te disa xhindë, e kjo vetëm që ua shtoi atyre tërbimin,",
                            "verse 72:7": "dhe, ata mendojnë siç mendoni edhe ju: se, Perëndia nuk do të ringjallë askë;",
                            "verse 72:8": "ne jemi ata që kemi arritur në qiell, por kemi hasur në plotë roje të forta (engjëj) dhe shigjeta të zjarrta (meteorë);",
                            "verse 72:9": "dhe uleshim rreth tij, nëpër vende të përshtatshme për të dëgjuar diçka, por ai që përgjon tani, do të hasë në shigjeta të zjarrta (meteorë) që janë në pritje (pusi),",
                            "verse 72:10": "dhe ne nuk dimë, se e keqja i qëllimohet atyre që janë në Tokë, apo Zoti i tyre don t’i udhëzojë në rrugë të mirë,",
                            "verse 72:11": "e midis nesh ka të mirë dhe ka që nuk janë të mirë, ka prej nesh kategori të ndryshme, (grupe të përçara);",
                            "verse 72:12": "dhe ne e kemi ditur se nuk do të mund t’i shpëtojmë Perëndisë në Tokë dhe nuk mund ta lodhim Atë duke ikur (në qiell);",
                            "verse 72:13": "dhe ne, posa dëgjuam udhëzimin (Kur’anin), besuam në të; e kush beson në Zotin e vet, nuk ka përse të druajë nga dëmi as nga zullumi (tërbimi);",
                            "verse 72:14": "dhe ka prej nesh muslimanë, e ka prej nesh edhe mëkatarë, e kush e ka përqafuar islamizmin, e ka zgjedhur rrugën e drejtë,",
                            "verse 72:15": "kurse, jobesimtarët, do të jenë lëndë djegëse të skëterrës”.",
                            "verse 72:16": "Sikur të qëndronin në rrugën e vërtetë, Ne do t’i furnizonim me ujë të bollshëm,",
                            "verse 72:17": "për t’i vënë me këtë në sprovë ata; e kushdo që largohet nga të përkujtuarit Zotin e tij, Zoti atë ia nënshtron dënimit të ashpër.",
                            "verse 72:18": "Xhamiat i janë kushtuar Perëndisë, dhe mos iu lutni askujt, përveç Perëndisë!",
                            "verse 72:19": "E, kur adhuruesi i Perëndisë (Muhammedi), u ngrit t’i lutet Atij, ata (xhindët) u tubuan rreth tij si të ishin shtëllungë leshi.",
                            "verse 72:20": "Thuaj (o Muhammed!): “Unë i lutem vetëm Zotit tim dhe askë s’ia bëjë shok Atij”.",
                            "verse 72:21": "Thuaj (o Muhammed!): “Unë nuk mundem t’jua largojë ndonjë dëm juve e as t’ua sjell ndonjë dobi (vetëm Perëndia ka pushtet për këtë)”.",
                            "verse 72:22": "Thuaj (o Muhammed!): “Me të vërtetë, mua askush nuk mund të më mbrojë nga dënimi i Perëndisë; as që mund të gjejë strehim tjetër kund, përveç te Ai, -",
                            "verse 72:23": "(Unë s’kam tjetër funksion) përveç që t’ua predikojë atë që vjen nga Perëndia dhe të dërguarit e Tij”. E, ai që s’dëgjon Perëndinë dhe të Dërguarin e Tij, atë e pret zjarri i skëterrës, në të cilin do të mbetet përgjithmonë. –",
                            "verse 72:24": "E, kur ata të shohin atë për çka u është tërhequr vërejtja, do ta dinë ata se kush është më i dobët (në ndihmë) dhe në numër më i vogël.",
                            "verse 72:25": "Thuaj (o Muhammed!): “Unë nuk e di, a është afër ajo që u është premtuar juve, apo Zoti im ka caktuar për të afat (më të gjatë),",
                            "verse 72:26": "vetëm Ai i di sekretet dhe Ai nuk ia zbulon sekretet e Veta askujt;",
                            "verse 72:27": "përveç atij të cilin Ai e ka zgjedhur për të dërguar (pejgamber); andaj, Ai para tij dhe pas tij, i vë ata që e ruajnë (engjëjt)",
                            "verse 72:28": "në mënyrë që t’i dijë (qartë) se a i kanë zbatuar misionet e Zotit të tyre. Ai di në hollësi çdo gjë që është te të dërguarit; Ai di numrin e çdo gjëje që ekziston."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "(Ya Peyğəmbər!) De: \"Mənə vəhy olundu ki, bir dəstə cin (Məkkə və Taif arasında sübh namazı vaxtı Qur'anı dinləyib öz həmcinslərinin yanına qayıtdıqları zaman) dedilər: \"Biz çox qəribə (təsəvvür edilməz dərəcədə gözəl olan) bir Qur'an eşitdik.",
                            "verse 72:2": "O, (xalqa) haqq yolu göstərir. Biz ona iman gətirdik və biz bir daha heç kəsi Rəbbimizə şərik qoşmayacağıq.",
                            "verse 72:3": "Həqiqətən, Rəbbimizin calalı çox ucadır. O ?zünə nə bir zövcə götürmüşdür, nə də bir uşaq!",
                            "verse 72:4": "Doğrusu, bizim səfehimiz (İblis) Allah barəsində tamamilə yalan (haqdan uzaq sözlər) söyləyirmiş.",
                            "verse 72:5": "Biz elə güman edirdik ki, nə insan, nə də cin tayfası Allah barəsində yalan danışmaz.",
                            "verse 72:6": "Həqiqətən, (Cahiliyyət dövründə) bə'zi insanlar bir para cinlərə pənah aparır, bununla da onların təkəbbürünü (azğınlığını) artırırdılar (cinlər özləri haqqında çox böyük fikirlərə düşürdülər).",
                            "verse 72:7": "Onlar (o insanlar) da siz (cinlər, yaxud o cinlər də siz insanlar) təkin elə güman edirdilər ki, Allah heç kəsi (öləndən sonra) diriltməyəcəkdir.",
                            "verse 72:8": "Biz (cinlər yuxarı aləm əhlinin söhbətinə oğrun-oğrun qulaq asmaq üçün) göyə qalxmaq istədik (səmanı yoxladıq), amma onun (mələklərdən ibarət) güclü gözətçilər və yandırıb-yaxan (axan) ulduzlarla dolu olduğunu gördük.",
                            "verse 72:9": "Biz (Muhəmməd əleyhissəlamın peyğəmbər göndərilməsindən əvvəl mələklərin söhbətinə) qulaq asmaq üçün (göyün) bə'zi yerlərində otururduq. Lakin indi kim (onların söhbətinə) qulaq asmış olsa, yandırıb-yaxan bir ulduzun onu gözlədiyini görər.",
                            "verse 72:10": "Biz bilmirik ki, (göyün gözətçi mələklərlə, axan ulduzlarla doldurulması və mələklərin söhbətinə qulaq asmağın bizə qadağan edilməsi ilə) yerdə olanlara bir pislik etmək istənilmişdir, yoxsa Rəbbi onlara bir xeyir diləmişdir.",
                            "verse 72:11": "Şübhəsiz ki, aramızda əməlisaleh olanlar da var, olmayanlar da. Biz müxtəlif firqələrə (məzhəblərə) ayrılmışıq.",
                            "verse 72:12": "Biz anladıq ki, yerdə də olsaq, (göyə də) qaçsaq, Allahdan (Allahın əzabından) canımızı qurtara bilmərik (heç yerdə, heç zaman Allahı aciz edə bilmərik).",
                            "verse 72:13": "Doğrusu, biz hidayət yolunu göstərəni (Qur'anı) dinlədiyimiz zaman ona iman gətirdik. Kim Rəbbinə iman gətirsə, nə (yaxşı əməllərinin mükafatını) əskilməsindən, nə də haqsızlığa mə'ruz qalmaqdan (başqasının günahlarının ona yüklənməsindən) qorxar.",
                            "verse 72:14": "Şübhəsiz ki, aramızda (Allaha və Onun Peyğəmbəri Muhəmməd əleyhissəlama iman gətirən) müsəlmanlar da var, (haqq yoldan) çıxanlar da. Müsəlman olanlar haqq yolu axtarıb tapanlardır.",
                            "verse 72:15": "(Haqq yoldan) çıxanlar isə Cəhənnəm üçün odun olacaqlar (orada yandırılacaqlar)\"",
                            "verse 72:16": "(Sonra mənə belə vəhy olundu: ) Əgər onlar (Məkkə müşrikləri) o yolda (islam dinində) doğru olsaydılar, Biz onlara (yeddi il davam edən quraqlıq və qıtlıq əsnasında) bol yağış verərdik ki,",
                            "verse 72:17": "Onları bununla (bu ne'mətlə) imtahana çəkək. Kim öz Rəbbini yad etməkdən üz çevirsə, (Allah) onu məşəqqətli bir əzaba düçar edər.",
                            "verse 72:18": "Şübhəsiz ki, (bütün) məscidlər Allaha məxsusdur. Allahdan başqa heç kəsə ibadət etməyin!",
                            "verse 72:19": "Allahın bəndəsi (Muhəmməd əleyhissəlam) Ona ibadət etmək (namaz qılmaq) üçün qalxdıqda (cinlər) az qalmışdı ki, onun ətrafında keçə kimi bir-birinə keçsinlər (izdihamın çoxluğundan bir-birinin üstünə minsinlər).",
                            "verse 72:20": "(Ya Peyğəmbər!) De: \"Mən ancaq öz Rəbbimə ibadət edirəm və heç kəsi Ona şərik qoşmuram!\"",
                            "verse 72:21": "De: \"Mən sizə nə bir zərər, nə də bir xeyir vermək qüdrətinə malik deyiləm! (Bunu ancaq aləmlərin Rəbbi olan Allah edə bilər!)\"",
                            "verse 72:22": "De: \"Məni Allahdan (Allahın əzabından) heç kəs qurtara bilməz və mən də Ondan başqa heç bir sığınacaq tapa bilmərəm!",
                            "verse 72:23": "(Mənim əlimdən) Allah dərgahından olanı və Onun göndərdiklərini (Qur'anı və dini hökmləri) təbliğ etməkdən başqa (heç bir şey gəlməz). Allah və Onun Peyğəmbərinə asi olanları cəhənnəm odu gözləyir. Onlar orada həmişəlik qalacaqlar!\"",
                            "verse 72:24": "Onlar təhdid olunduqlarını (qiyamətdəki, və ya Bədr vuruşundakı əzabı) gördükləri zaman kimin köməkçisinin daha zəif və sayca daha az olduğunu biləcəklər.",
                            "verse 72:25": "De: \"Mən sizin qorxudulduğunuz əzabın yaxın olduğunu, yaxud Rəbbimin onun üçün uzun bir müddət tə'yin edəcəyini bilmirəm!",
                            "verse 72:26": "Qeybi bilən ancaq Odur və ?z qeybini heç kəsə əyan etməz;",
                            "verse 72:27": "Bəyənib seçdiyi peyğəmbərdən başqa! (Qeybi nə bir mələk, nə də bir peyğəmbər bilər. Onun açarları ancaq Allahın əlindədir. Lakin Allah istədiyi peyğəmbərə bir mö'cüzə olaraq vəhy yolu ilə qeybdən bə'zi xəbərlər bildirər). Allah onların önündə və arxasında (mələklərdən ibarət) gözətçilər qoyar ki,",
                            "verse 72:28": "(Peyğəmbərlərinin) öz Rəbbinin göndərdiklərini (nə cür) təbliğ etdiyini bilsin (bəlli etsin). (Allah) onlarda olanların hamısını (peyğəmbərlərin əhvalatını və bütün əməllərini ?z elmi ilə) ehtiva etmişdir. O, hər şeyi bir-bir sayıb yazmışdır (təsbit etmişdir)!\""
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Reci: ”Meni je objavljeno da je nekoliko džina prisluškivalo i reklo: ’Mi smo, doista Kur’an, koji izaziva divljenje, slušali,",
                            "verse 72:2": "koji na pravi put upućuje - i mi smo u nj povjerovali i više nikoga nećemo Gospodaru našem ravnim smatrati’,",
                            "verse 72:3": "a On nije - neka uzvišeno bude dostojanstvo Gospodara našeg! - uzeo sebi ni druge ni djeteta;",
                            "verse 72:4": "jedan naš bezumnik je o Allahu laži govorio,",
                            "verse 72:5": "a mi smo mislili da ni ljudi ni džini o Allahu laži ne govore;",
                            "verse 72:6": "i bilo je ljudi koji su pomoć od džina tražili, pa su im tako obijest povećali;",
                            "verse 72:7": "i oni misle, kao što i vi mislite, da Allah nikoga neće oživiti;",
                            "verse 72:8": "i mi smo nastojali da nebo dotaknemo i utvrdili smo da je moćnih čuvara i zvijezda padalica puno;",
                            "verse 72:9": "i sjedili smo okolo njega po busijama da bismo što čuli, ali će onaj, ko sada prisluškuje, na zvijezdu padalicu koja vreba naići;",
                            "verse 72:10": "i mi ne znamo da li se onima na Zemlji želi zlo ili im Gospodar njihov želi dobro;",
                            "verse 72:11": "a među nama ima i dobrih i onih koji to nisu, ima nas vrsta različitih;",
                            "verse 72:12": "i mi znamo da ne možemo Allahu na Zemlji umaći i da od Njega ne možemo pobjeći;",
                            "verse 72:13": "i mi smo, čim smo Kur’an čuli, u nj povjerovali; a ko u Gospodara svoga vjeruje, ni štete ni nepravde ne treba se bojati;",
                            "verse 72:14": "i ima nas muslimana, a ima nas zalutalih; oni koji islam prihvate Pravi put su izabrali,",
                            "verse 72:15": "a nevjernici će u Džehennemu gorivo biti.\"",
                            "verse 72:16": "A da se Pravog puta drže, Mi bismo ih vodom obilnom pojili,",
                            "verse 72:17": "da bismo ih time na kušnju stavili; a onoga ko neće da se Gospodaru svome klanja On će u patnju tešku uvesti.",
                            "verse 72:18": "Džamije su Allaha radi, i ne molite se, pored Allaha, nikome!",
                            "verse 72:19": "A kad je Allahov rob ustao da mu se pomoli, oni su se u gomilama oko njega tiskati stali.",
                            "verse 72:20": "Reci: \"Ja se samo Gospodaru svome klanjam, i nikoga njemu ravnim ne smatram.\"",
                            "verse 72:21": "Reci: \"Ja nisam u stanju da od vas kakvu štetu otklonim niti da nekom od vas kakvu korist pribavim.\"",
                            "verse 72:22": "Reci: \"Mene niko od Allahove kazne ne može u zaštitu uzeti; samo u Njega ja mogu utočište naći -",
                            "verse 72:23": "samo mogu oglasiti ono što je od Allaha i poslanice Njegove.\" A onoga koji Allahu i Poslaniku Njegovu ne bude poslušan sigurno čeka vatra džehennemska; u njoj će vječno i zauvijek ostati.",
                            "verse 72:24": "I kada oni dožive ono čime im se prijeti, saznaće ko je slabiji i brojem manji.",
                            "verse 72:25": "Reci: \"Ja ne znam da li će uskoro biti ono čime vam se prijeti ili je Gospodar moj odredio da će to poslije dugo vremena biti,",
                            "verse 72:26": "On tajne zna i On tajne svoje ne otkriva nikome,",
                            "verse 72:27": "osim onome koga On za poslanika odabere; zato On i ispred njega i iza njega postavlja one koji će ga čuvati",
                            "verse 72:28": "da bi pokazao da su poslanice Gospodara svoga dostavili, On u tančine zna ono što je u njih, On zna broj svega što postoji."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "বলুনঃ আমার প্রতি ওহী নাযিল করা হয়েছে যে, জিনদের একটি দল কোরআন শ্রবণ করেছে, অতঃপর তারা বলেছেঃ আমরা বিস্ময়কর কোরআন শ্রবণ করেছি;",
                            "verse 72:2": "যা সৎপথ প্রদর্শন করে। ফলে আমরা তাতে বিশ্বাস স্থাপন করেছি। আমরা কখনও আমাদের পালনকর্তার সাথে কাউকে শরীক করব না।",
                            "verse 72:3": "এবং আরও বিশ্বাস করি যে, আমাদের পালনকর্তার মহান মর্যাদা সবার উর্ধ্বে। তিনি কোন পত্নী গ্রহণ করেননি এবং তাঁর কোন সন্তান নেই।",
                            "verse 72:4": "আমাদের মধ্যে নির্বোধেরা আল্লাহ তা’আলা সম্পর্কে বাড়াবাড়ির কথাবার্তা বলত।",
                            "verse 72:5": "অথচ আমরা মনে করতাম, মানুষ ও জিন কখনও আল্লাহ তা’আলা সম্পর্কে মিথ্যা বলতে পারে না।",
                            "verse 72:6": "অনেক মানুষ অনেক জিনের আশ্রয় নিত, ফলে তারা জিনদের আত্নম্ভরিতা বাড়িয়ে দিত।",
                            "verse 72:7": "তারা ধারণা করত, যেমন তোমরা মানবেরা ধারণা কর যে, মৃত্যুর পর আল্লাহ তা’আলা কখনও কাউকে পুনরুত্থিত করবেন না।",
                            "verse 72:8": "আমরা আকাশ পর্যবেক্ষণ করছি, অতঃপর দেখতে পেয়েছি যে, কঠোর প্রহরী ও উল্কাপিন্ড দ্বারা আকাশ পরিপূর্ণ।",
                            "verse 72:9": "আমরা আকাশের বিভিন্ন ঘাঁটিতে সংবাদ শ্রবণার্থে বসতাম। এখন কেউ সংবাদ শুনতে চাইলে সে জলন্ত উল্কাপিন্ড ওঁৎ পেতে থাকতে দেখে।",
                            "verse 72:10": "আমরা জানি না পৃথিবীবাসীদের অমঙ্গল সাধন করা অভীষ্ট, না তাদের পালনকর্তা তাদের মঙ্গল সাধন করার ইচ্ছা রাখেন।",
                            "verse 72:11": "আমাদের কেউ কেউ সৎকর্মপরায়ণ এবং কেউ কেউ এরূপ নয়। আমরা ছিলাম বিভিন্ন পথে বিভক্ত।",
                            "verse 72:12": "আমরা বুঝতে পেরেছি যে, আমরা পৃথিবীতে আল্লাহ তা’আলাকে পরাস্ত করতে পারব না এবং পলায়ন করেও তাকে অপারক করত পরব না।",
                            "verse 72:13": "আমরা যখন সুপথের নির্দেশ শুনলাম, তখন তাতে বিশ্বাস স্থাপন করলাম। অতএব, যে তার পালনকর্তার প্রতি বিশ্বাস করে, সে লোকসান ও জোর-জবরের আশংকা করে না।",
                            "verse 72:14": "আমাদের কিছুসংখ্যক আজ্ঞাবহ এবং কিছুসংখ্যক অন্যায়কারী। যারা আজ্ঞাবহ হয়, তারা সৎপথ বেছে নিয়েছে।",
                            "verse 72:15": "আর যারা অন্যায়কারী, তারা তো জাহান্নামের ইন্ধন।",
                            "verse 72:16": "আর এই প্রত্যাদেশ করা হয়েছে যে, তারা যদি সত্যপথে কায়েম থাকত, তবে আমি তাদেরকে প্রচুর পানি বর্ষণে সিক্ত করতাম।",
                            "verse 72:17": "যাতে এ ব্যাপারে তাদেরকে পরীক্ষা করি। পক্ষান্তরে যে ব্যক্তি তার পালনকর্তার স্মরণ থেকে মুখ ফিরিয়ে নেয়, তিনি তাকে উদীয়মান আযাবে পরিচালিত করবেন।",
                            "verse 72:18": "এবং এই ওহীও করা হয়েছে যে, মসজিদসমূহ আল্লাহ তা’আলাকে স্মরণ করার জন্য। অতএব, তোমরা আল্লাহ তা’আলার সাথে কাউকে ডেকো না।",
                            "verse 72:19": "আর যখন আল্লাহ তা’আলার বান্দা তাঁকে ডাকার জন্যে দন্ডায়মান হল, তখন অনেক জিন তার কাছে ভিড় জমাল।",
                            "verse 72:20": "বলুনঃ আমি তো আমার পালনকর্তাকেই ডাকি এবং তাঁর সাথে কাউকে শরীক করি না।",
                            "verse 72:21": "বলুনঃ আমি তোমাদের ক্ষতি সাধন করার ও সুপথে আনয়ন করার মালিক নই।",
                            "verse 72:22": "বলুনঃ আল্লাহ তা’আলার কবল থেকে আমাকে কেউ রক্ষা করতে পারবে না এবং তিনি ব্যতীত আমি কোন আশ্রয়স্থল পাব না।",
                            "verse 72:23": "কিন্তু আল্লাহ তা’আলার বাণী পৌছানো ও তাঁর পয়গাম প্রচার করাই আমার কাজ। যে আল্লাহ ও তাঁর রসূলকে অমান্য করে, তার জন্যে রয়েছে জাহান্নামের অগ্নি। তথায় তারা চিরকাল থাকবে।",
                            "verse 72:24": "এমনকি যখন তারা প্রতিশ্রুত শাস্তি দেখতে পাবে, তখন তারা জানতে পারবে, কার সাহায্যকারী দূর্বল এবং কার সংখ্যা কম।",
                            "verse 72:25": "বলুনঃ আমি জানি না তোমাদের প্রতিশ্রুত বিষয় আসন্ন না আমার পালনকর্তা এর জন্যে কোন মেয়াদ স্থির করে রেখেছেন।",
                            "verse 72:26": "তিনি অদৃশ্যের জ্ঞানী। পরন্ত তিনি অদৃশ্য বিষয় কারও কাছে প্রকাশ করেন না।",
                            "verse 72:27": "তাঁর মনোনীত রসূল ব্যতীত। তখন তিনি তার অগ্রে ও পশ্চাতে প্রহরী নিযুক্ত করেন",
                            "verse 72:28": "যাতে আল্লাহ তা’আলা জেনে নেন যে, রসূলগণ তাঁদের পালনকর্তার পয়গাম পৌছিয়েছেন কি না। রসূলগণের কাছে যা আছে, তা তাঁর জ্ঞান-গোচর। তিনি সবকিছুর সংখ্যার হিসাব রাখেন।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 72:1": "Кажи [о, Мухаммад]: Разкрито ми бе, че няколко джинове слушали и рекли: Чухме удивителен Коран.",
                            "verse 72:2": "Насочва той към правия път. Затова повярвахме в него и никого не ще съдружим с нашия Господ.",
                            "verse 72:3": "Той - превисоко е величието на нашия Господ! - не се е сдобивал нито със съпруга, нито със син.",
                            "verse 72:4": "Глупците измежду нас говорят измислици за Аллах.",
                            "verse 72:5": "А ние предполагахме, че хората и джиновете никога не ще изрекат лъжа за Аллах.",
                            "verse 72:6": "Някои хора търсеха убежище при някои джинове, а [хората] им надбавиха безразсъдство.",
                            "verse 72:7": "И [хората] предполагаха, както и вие предполагахте, че Аллах не ще възкреси никого.",
                            "verse 72:8": "И досегнахме небето, и открихме, че е пълно със силна стража и с изгарящи звезди.",
                            "verse 72:9": "А преди седяхме там на места, за да подслушваме. А който подслушва сега, дебне го изгаряща звезда.",
                            "verse 72:10": "И не знаем дали зло е поискано за онези, които са на земята, или техният Господ е поискал добро за тях.",
                            "verse 72:11": "Сред нас има правдиви, сред нас има и други освен това. Следваме различни пътища.",
                            "verse 72:12": "Вече сме убедени, че никога не ще обезсилим Аллах на земята и никога не ще Го обезсилим, дори да бягаме.",
                            "verse 72:13": "И когато чухме Напътствието, повярвахме в него. А който вярва в своя Господ, да не се страхува нито от ощетяване, нито от угнетяване.",
                            "verse 72:14": "Сред нас има отдали се на Аллах [мюсюлмани], но сред нас има и отклонили се [неверници]. Онези, които са се отдали на Аллах - те са избрали правия път.",
                            "verse 72:15": "А отклонилите се - те са горивото за Ада.",
                            "verse 72:16": "И ако се бяха придържали към правия път, Ние щяхме да им дадем вода в изобилие,",
                            "verse 72:17": "за да ги изпитаме с това. А който се отдръпва от споменаването на своя Господ, Той ще го въведе в тежко мъчение.",
                            "verse 72:18": "Джамиите са само за Аллах и затова не зовете никой друг заедно с Аллах!",
                            "verse 72:19": "Когато рабът на Аллах [Мухаммад] се изправи да Го позове, те едва не се струпаха около него на пълчища.",
                            "verse 72:20": "Кажи: Зова единствено моя Господ и никого не съдружавам с Него.",
                            "verse 72:21": "Кажи: Аз нито мога да ви навредя, нито да ви бъда от полза.",
                            "verse 72:22": "Кажи: Никой не може да ме защити от Аллах и не ще намеря убежище освен при Него.",
                            "verse 72:23": "Аз предавам само известие от Аллах и Негови послания. А които не се подчиняват на Аллах и на Неговия Пратеник, за тях е Огънят на Ада, там ще пребивават вечно.",
                            "verse 72:24": "Когато видят обещаното им, ще научат кой има по-слаби и по-малобройни помощници.",
                            "verse 72:25": "Кажи: Не знам близо ли е това, което ви е обещано, или е сторил за него предел моят Господ -",
                            "verse 72:26": "Знаещия неведомото. Той на никого не разкрива Своите тайни,",
                            "verse 72:27": "освен на онзи пратеник, когото е избрал. И сторва Той пред него и зад него да има [ангели] пазители,",
                            "verse 72:28": "за да знае, че са съобщили посланията на своя Господ. Обгръща Той това, което е у тях, и пресмята всяко нещо."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "你說：「我曾奉到啟示：有幾個精靈已經靜聽，並且說：『我們確已聽見奇異的《古蘭經》，",
                            "verse 72:2": "它能導人於正道，故我們信仰它，我們絕不以任何物配我們的主。",
                            "verse 72:3": "讚頌我們的主的尊嚴！超絕萬物，他沒有擇取妻室，也沒有擇取兒女。",
                            "verse 72:4": "我們中的庸愚，常以悖謬的事誣蔑真主，",
                            "verse 72:5": "我們曾猜想人和精靈絕不誣蔑真主。",
                            "verse 72:6": "曾有一些男人，求些男精靈保護他們，因而使他們更加驕傲。",
                            "verse 72:7": "那些男人曾像你們一樣猜想真主絕不使任何死者復活。」",
                            "verse 72:8": "「我們曾試探天，發現天上佈滿堅強的衛士和燦爛的星宿。",
                            "verse 72:9": "過去，我們為竊聽而常常坐在天上可坐的地方。現在誰去竊聽，誰就發現一顆燦爛的星宿在等著他。",
                            "verse 72:10": "我們不知道，究竟是大地上的萬物將遭患難呢？還是他們的主欲引他們於正道呢？",
                            "verse 72:11": "我們中有善良的，有次於善良的，我們是分為許多派別的。",
                            "verse 72:12": "我們相信，我們在大地上，絕不能使真主無奈，也絕不能逃避真主的譴責。",
                            "verse 72:13": "當我們聽見正道的時候，我們已信仰它。誰信仰主，誰不怕克扣，也不怕受辱。",
                            "verse 72:14": "我們中有順服的，有乖張的。凡順服的，都是有志於正道的。",
                            "verse 72:15": "至於乖張的，將作火獄的燃料。」",
                            "verse 72:16": "假如他們遵循正道，我必賞賜他們的豐富的雨水，",
                            "verse 72:17": "以便我以雨水考驗他們。誰退避主的教訓，他將使誰入在嚴峻的刑罰中。",
                            "verse 72:18": "一切清真寺，都是真主的，故你們應當祈禱真主，不要祈禱任何物。",
                            "verse 72:19": "當真主的僕人起來祈禱的時候，他們幾乎群起而攻之。",
                            "verse 72:20": "你說：「我只祈禱我的主，我不以任何物配他。」",
                            "verse 72:21": "你說：「我不能為你們主持禍福。」",
                            "verse 72:22": "你說：「任何人不能保護我不受真主的懲罰；除真主外，我絕不能發現任何避難所。",
                            "verse 72:23": "我只能傳達從真主降示的通知和使命。誰違抗真主和使者，誰必受火獄的刑罰，而且永居其中。",
                            "verse 72:24": "待他們看見他們所被警告的刑罰的時候，他們就知道誰是更寡助的。」",
                            "verse 72:25": "你說：「我不知道你們被警告的刑罰是臨近的呢？還是我的主將為它規定一個期限呢？",
                            "verse 72:26": "他是全知幽玄的，他不讓任何人窺見他的幽玄，",
                            "verse 72:27": "除非他所喜悅的使者，因為他派遣衛隊，在使者的前面和後面行走，",
                            "verse 72:28": "以便他知道使者確已傳達了他們的主的使命，並且周知他們所有的言行，而且統計萬物的數目。」"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Rci: \"Bylo mi vnuknuto, že skupina džinů naslouchala a řekla:, Naslouchali jsme Koránu podivuhodnému,",
                            "verse 72:2": "k přímé cestě vedoucímu, takže jsme v něj uvěřili a již nikoho nebudeme přidružovat k Pánu, svému.",
                            "verse 72:3": "A věru On - povznesena nechť je důstojnost Pána našeho - si nevzal družku ani syna žádného.",
                            "verse 72:4": "Avšak hlupák jeden z nás o Bohu vedl řeči míru přesahující,",
                            "verse 72:5": "ačkoliv jsme se dosud domnívali, že ani lidé, ani džinové o Bohu nebudou vést řeči lživé!",
                            "verse 72:6": "Mužové někteří pak z lidí u mužů z džinů útočiště vyhledali, ti však jen pošetilost jejich rozmnožili",
                            "verse 72:7": "a lidé se - podobně jako vy - že Bůh nikoho nevzkřísí, domnívali.",
                            "verse 72:8": "A prohledali jsme nebe, avšak nalezli jsme je plné stráží silných a plamenů šlehajících.",
                            "verse 72:9": "A sedávali jsme dříve u něho na místech vhodných k naslouchání, však kdokoliv z nás chce naslouchat nyní, ten shledá, že naň číhá plamen šlehající.",
                            "verse 72:10": "A my věru nevíme, zda zlo je zamýšleno pro ty, kdož na zemi dlí, či zda Pán jejich si pro ně přeje správného vedení.",
                            "verse 72:11": "Mezi námi jsou věru bezúhonní a jsou mezi námi zajisté i jiní než takoví, my na sekty jsme rozděleni.",
                            "verse 72:12": "Domníváme se, že nikdy se nám nepodaří uniknout zásahu Božímu na zemi, ba ani pomocí útěku.",
                            "verse 72:13": "A když slyšeli jsme o správném vedení, uvěřili jsme v ně; a ten, kdo v Pána svého věří, ať nebojí se ani poškození, ani útlaku.",
                            "verse 72:14": "A jsou mezi námi ti, kdož do vůle Boží se odevzdali, a jiní, kteří nespravedliví jsou. A ten, kdo do vůle Boží se odevzdal, ten ubírá se cestou správnou.",
                            "verse 72:15": "Co nespravedlivých se týká, ti peklu palivem budou.? \"",
                            "verse 72:16": "A půjdou-li touto cestou, My věru je napojíme vodou hojnou,",
                            "verse 72:17": "abychom je zkoušeli. Kdokoliv však se odvrátí od připomenutí Pána svého, toho On uvede do trestu těžkého.",
                            "verse 72:18": "A modlitebny patří Bohu; nevzývejte v nich tedy spolu s Bohem nikoho!",
                            "verse 72:19": "A když povstal služebník Boží, vzývaje Jej, tu div se proti němu nezvedli v hustém zástupu.",
                            "verse 72:20": "Rci: \"Já modlím se pouze k Pánu svému a nikoho nepřidružuji k Němu.\"",
                            "verse 72:21": "Rci: \"Nevládnu mocí způsobit vám škodu, či abyste správně byli vedeni.",
                            "verse 72:22": "Rci: \"Neochrání mě před Bohem nikdo a nenaleznu útočiště žádné kromě Něho,",
                            "verse 72:23": "kromě sdělení od Boha a Jeho poselství. Těm, kdo neposlouchají Boha a Jeho posla, těm určen je oheň pekelný a budou v něm navěky nesmrtelní.",
                            "verse 72:24": "A až spatří to, co jim bylo slíbeno, poznají, kdo pomocníky má nejslabší a kdo počtem je nejmenší.\"",
                            "verse 72:25": "Rci: \"Nevím, zda je blízko to, co vám bylo slíbeno, či zda Pán můj dá odklad tomu další;",
                            "verse 72:26": "On jediný zná nepoznatelné a nikoho do svých tajemství nezasvěcuje",
                            "verse 72:27": "kromě těch, jež oblíbil si ze Svých poslů; a před ním i za ním dozorce kráčí,",
                            "verse 72:28": "aby zjistil, zda poselství Pána svého hlásá. A On Svým věděním vše, co konají, objímá a On každou věc přesným počtem počítá."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Zeg: \"Het is aan mij geopenbaard dat een groep van djinns heeft geluisterd (naar de Koran), en zij zeiden: ’Waarlijk, wij hebben een wonderbaarlijke verkondiging gehoord!",
                            "verse 72:2": "Die tot rechtschapenheid leidt; daarom hebben wij er in geloofd, en wij zullen stellig niemand met onze Heer vereenzelvigen.",
                            "verse 72:3": "En de Majesteit van onze Heer is hoog verheven. Hij heeft noch echtgenote noch zoon.",
                            "verse 72:4": "En voorzeker, de dwaas onder ons placht over God leugen te spreken.",
                            "verse 72:5": "Doch wij hadden gemeend dat mensen en djinns nooit een leugen over God zouden uiten.",
                            "verse 72:6": "Voorzeker, waren er enige mensen die toevlucht bij sommige djinns zochten, waardoor zij hun zonden vermeerderden.",
                            "verse 72:7": "En zij meenden inderdaad, zoals jullie meenden, dat God nooit een boodschapper zou zenden.",
                            "verse 72:8": "En wij trachtten de hemel te bespieden en wij vonden deze vol sterke wachters en vlammen.",
                            "verse 72:9": "En voorzeker, wij plachten op enige plaatsen te zitten om de gesprekken te beluisteren. Maar wie nu luistert, vindt een vlam die op hem wacht.",
                            "verse 72:10": "Wij weten daardoor niet of voor degenen die op aarde zijn, een ramp wordt bedoeld of dat hun Heer hen op het goede pad wil leiden.",
                            "verse 72:11": "Er zijn onder ons die rechtvaardig zijn en er zijn onder ons die anders zijn en wij volgen verschillende wegen.",
                            "verse 72:12": "En wij beseffen dat wij God’s (plan) op aarde onmogelijk kunnen verijdelen, noch kunnen wij Hem door de vlucht ontlopen.",
                            "verse 72:13": "En toen wij de leiding hoorden, geloofden wij er in. En hij, die gelooft in zijn Heer, heeft geen vrees voor verlies of onrecht.",
                            "verse 72:14": "En er zijn onder ons Moslims die van het rechte pad zijn afgeweken. En zij die zich onderwerpen - hebben de rechte weg gezocht.",
                            "verse 72:15": "En zij die van het rechte pad afwijken, zullen brandstof der hel zijn.’\"",
                            "verse 72:16": "Indien zij zich aan het rechte pad houden zullen Wij hun water in overvloed te drinken geven,",
                            "verse 72:17": "Om hen daarmee op de proef te stellen. En wie zich van de gedachte aan zijn Heer afwendt, Hij zal hem een toenemende straf toedienen.",
                            "verse 72:18": "En zeg: \"Alle bedehuizen behoren aan God; roept daarom niemand naast God aan.\"",
                            "verse 72:19": "En toen de dienaar van God opstond om Hem te aanbidden, vielen zij hem bijna aan.",
                            "verse 72:20": "Zeg: \"Ik bid alleen tot mijn Heer en ik vereenzelvig niemand met Hem.\"",
                            "verse 72:21": "Zeg: \"Ik heb (uit mijzelf) geen macht u goed of kwaad te doen.\"",
                            "verse 72:22": "Zeg: \"Voorzeker, niemand kan mij tegen God beschermen, noch kan ik een andere schuilplaats vinden buiten Hem -",
                            "verse 72:23": "(Mij is) slechts de verkondiging van God’s boodschap opgedragen.\" En voor degenen die God en Zijn boodschapper niet gehoorzamen is het Vuur der hel, waarin zij lange tijd zullen vertoeven,",
                            "verse 72:24": "Tot zij de straf zien waarmee zij worden bedreigd, maar dan zullen zij ook weten wie zwakkere helpers en kleiner aantal heeft.",
                            "verse 72:25": "Zeg hun: \"Ik weet niet of hetgeen waarmede gij bedreigd wordt nabij is of wel dat mijn Heer het zal uitstellen voor een lange tijd.\"",
                            "verse 72:26": "Hij is de Kenner van het onzienlijke en Hij geeft niemand overvloedig kennis van Zijn geheimen.",
                            "verse 72:27": "Behalve hem die Hij als boodschapper kiest. Dan doet Hij een wacht vóór hem en achter hem gaan,",
                            "verse 72:28": "Opdat Hij moge weten dat zij (Zijn boodschappers) de boodschappen van hun Heer hebben overgebracht. En Hij omvat alles wat met hen is - en Hij heeft alles berekend."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 72:1": "Say (O Muhammad): It is revealed unto me that a company of the Jinn gave ear, and they said: Lo! we have heard a marvellous Qur’an,",
                            "verse 72:2": "Which guideth unto righteousness, so we believe in it and we ascribe no partner unto our Lord.",
                            "verse 72:3": "And (we believe) that He - exalted be the glory of our Lord! - hath taken neither wife nor son,",
                            "verse 72:4": "And that the foolish one among us used to speak concerning Allah an atrocious lie.",
                            "verse 72:5": "And lo! we had supposed that humankind and jinn would not speak a lie concerning Allah -",
                            "verse 72:6": "And indeed (O Muhammad) individuals of humankind used to invoke the protection of individuals of the jinn, so that they increased them in revolt against Allah);",
                            "verse 72:7": "And indeed they supposed, even as ye suppose, that Allah would not raise anyone (from the dead) -",
                            "verse 72:8": "And (the Jinn who had listened to the Qur’an said): We had sought the heaven but had found it filled with strong warders and meteors.",
                            "verse 72:9": "And we used to sit on places (high) therein to listen. But he who listeneth now findeth a flame in wait for him;",
                            "verse 72:10": "And we know not whether harm is boded unto all who are in the earth, or whether their Lord intendeth guidance for them.",
                            "verse 72:11": "And among us there are righteous folk and among us there are far from that. We are sects having different rules.",
                            "verse 72:12": "And we know that we cannot escape from Allah in the earth, nor can we escape by flight.",
                            "verse 72:13": "And when we heard the guidance, we believed therein, and whoso believeth in his Lord, he feareth neither loss nor oppression.",
                            "verse 72:14": "And there are among us some who have surrendered (to Allah) and there are among us some who are unjust. And whoso hath surrendered to Allah, such have taken the right path purposefully.",
                            "verse 72:15": "And as for those who are unjust, they are firewood for hell.",
                            "verse 72:16": "If they (the idolaters) tread the right path, We shall give them to drink of water in abundance",
                            "verse 72:17": "That We may test them thereby, and whoso turneth away from the remembrance of his Lord; He will thrust him into ever-growing torment.",
                            "verse 72:18": "And the places of worship are only for Allah, so pray not unto anyone along with Allah.",
                            "verse 72:19": "And when the slave of Allah stood up in prayer to Him, they crowded on him, almost stifling.",
                            "verse 72:20": "Say (unto them, O Muhammad): I pray unto Allah only, and ascribe unto Him no partner.",
                            "verse 72:21": "Say: Lo! I control not hurt nor benefit for you.",
                            "verse 72:22": "Say: Lo! none can protect me from Allah, nor can I find any refuge beside Him",
                            "verse 72:23": "(Mine is) but conveyance (of the Truth) from Allah, and His messages; and whoso disobeyeth Allah and His messenger, lo! his is fire of hell, wherein such dwell for ever.",
                            "verse 72:24": "Till (the day) when they shall behold that which they are promised (they may doubt); but then they will know (for certain) who is weaker in allies and less in multitude.",
                            "verse 72:25": "Say (O Muhammad, unto the disbelievers): I know not whether that which ye are promised is nigh, or if my Lord hath set a distant term for it.",
                            "verse 72:26": "(He is) the Knower of the Unseen, and He revealeth unto none His secret,",
                            "verse 72:27": "Save unto every messenger whom He hath chosen, and then He maketh a guard to go before him and a guard behind him",
                            "verse 72:28": "That He may know that they have indeed conveyed the messages of their Lord. He surroundeth all their doings, and He keepeth count of all things."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 72:1": "Say: It has been revealed to me that a company of Jinns listened (to the Qur’an). They said, ’We have really heard a wonderful Recital!",
                            "verse 72:2": "’It gives guidance to the Right, and we have believed therein: we shall not join (in worship) any (gods) with our Lord.",
                            "verse 72:3": "’And Exalted is the Majesty of our Lord: He has taken neither a wife nor a son.",
                            "verse 72:4": "’There were some foolish ones among us, who used to utter extravagant lies against God;",
                            "verse 72:5": "’But we do think that no man or spirit should say aught that untrue against God.",
                            "verse 72:6": "’True, there were persons among mankind who took shelter with persons among the Jinns, but they increased them in folly.",
                            "verse 72:7": "’And they (came to) think as ye thought, that God would not raise up any one (to Judgment).",
                            "verse 72:8": "’And we pried into the secrets of heaven; but we found it filled with stern guards and flaming fires.",
                            "verse 72:9": "’We used, indeed, to sit there in (hidden) stations, to (steal) a hearing; but any who listen now will find a flaming fire watching him in ambush.",
                            "verse 72:10": "’And we understand not whether ill is intended to those on earth, or whether their Lord (really) intends to guide them to right conduct.",
                            "verse 72:11": "’There are among us some that are righteous, and some the contrary: we follow divergent paths.",
                            "verse 72:12": "’But we think that we can by no means frustrate God throughout the earth, nor can we frustrate Him by flight.",
                            "verse 72:13": "’And as for us, since we have listened to the Guidance, we have accepted it: and any who believes in his Lord has no fear, either of a short (account) or of any injustice.",
                            "verse 72:14": "’Amongst us are some that submit their wills (to God), and some that swerve from justice. Now those who submit their wills - they have sought out (the path) of right conduct:",
                            "verse 72:15": "’But those who swerve,- they are (but) fuel for Hell-fire’-",
                            "verse 72:16": "(And God’s Message is): \"If they (the Pagans) had (only) remained on the (right) Way, We should certainly have bestowed on them Rain in abundance.",
                            "verse 72:17": "\"That We might try them by that (means). But if any turns away from the remembrance of his Lord, He will cause him to undergo a severe Penalty.",
                            "verse 72:18": "\"And the places of worship are for God (alone): So invoke not any one along with God;",
                            "verse 72:19": "\"Yet when the Devotee of God stands forth to invoke Him, they just make round him a dense crowd.\"",
                            "verse 72:20": "Say: \"I do no more than invoke my Lord, and I join not with Him any (false god).\"",
                            "verse 72:21": "Say: \"It is not in my power to cause you harm, or to bring you to right conduct.\"",
                            "verse 72:22": "Say: \"No one can deliver me from God (If I were to disobey Him), nor should I find refuge except in Him,",
                            "verse 72:23": "\"Unless I proclaim what I receive from God and His Messages: for any that disobey God and His Apostle,- for them is Hell: they shall dwell therein for ever.\"",
                            "verse 72:24": "At length, when they see (with their own eyes) that which they are promised,- then will they know who it is that is weakest in (his) helper and least important in point of numbers.",
                            "verse 72:25": "Say: \"I know not whether the (Punishment) which ye are promised is near, or whether my Lord will appoint for it a distant term.",
                            "verse 72:26": "\"He (alone) knows the Unseen, nor does He make any one acquainted with His Mysteries,-",
                            "verse 72:27": "\"Except an apostle whom He has chosen: and then He makes a band of watchers march before him and behind him,",
                            "verse 72:28": "\"That He may know that they have (truly) brought and delivered the Messages of their Lord: and He surrounds (all the mysteries) that are with them, and takes account of every single thing.\""
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 72:1": "Say: ’It has been revealed to me that a company of the jinn gave ear, then they said, \"We have indeed heard a Koran wonderful,",
                            "verse 72:2": "guiding to rectitude. We believe in it, and we will not associate with our Lord anyone.",
                            "verse 72:3": "He -- exalted be our Lord’s majesty! has not taken to Himself either consort or a son.",
                            "verse 72:4": "The fool among us spoke against God outrage,",
                            "verse 72:5": "and we had thought that men and jinn would never speak against God a lie.",
                            "verse 72:6": "But there were certain men of mankind who would take refuge with certain men of the jinn, and they increased them in vileness,",
                            "verse 72:7": "and they thought, even as you also thought, that God would never raise up anyone.",
                            "verse 72:8": "And we stretched towards heaven, but we found it filled with terrible guards and meteors.",
                            "verse 72:9": "We would sit there on seats to hear; but any listening now finds a meteor in wait for him.",
                            "verse 72:10": "And so we know not whether evil is intended for those in the earth, or whether their Lord intends for them rectitude.",
                            "verse 72:11": "And some of us are the righteous, and some of us are otherwise; we are sects differing.",
                            "verse 72:12": "Indeed, we thought that we should never be able to frustrate God in the earth, neither be able to frustrate Him by flight.",
                            "verse 72:13": "When we heard the guidance, we believed in it; and whosoever believes in his Lord, he shall fear neither paltriness nor vileness.",
                            "verse 72:14": "And some of us have surrendered, and some of us have deviated. Those who have surrendered sought rectitude;",
                            "verse 72:15": "but as for those who have deviated, they have become firewood for Gehenna!\"’",
                            "verse 72:16": "Would they but go straight on the way, We would give them to drink of water copious,",
                            "verse 72:17": "that We might try them therein. And whosoever turns away from the Remembrance of his Lord, He will thrust him into chastisement rigorous.",
                            "verse 72:18": "The places of worship belong to God; so call not, along with God, upon anyone.",
                            "verse 72:19": "When the servant of God stood calling on Him, they were wellnigh upon him in swarms.",
                            "verse 72:20": "Say: ’I call only upon my Lord, and I do not associate with Him anyone.",
                            "verse 72:21": "Say: ’Surely I possess no power over you, either for hurt or for rectitude.’",
                            "verse 72:22": "Say: ’From God shall protect me not anyone, and I shall find, apart from Him, no refuge,",
                            "verse 72:23": "excepting a Deliverance from God and His Messages. And whoso rebels against God and His messenger, for him there awaits the Fire of Gehenna; therein they shall dwell forever.’",
                            "verse 72:24": "Until, when they see that which they are promised, then they will know who is weaker in helpers and fewer in numbers.",
                            "verse 72:25": "Say: ’I do not know whether that which you are promised is nigh, or whether my Lord will appoint for it a space;",
                            "verse 72:26": "Knower He of the Unseen, and He discloses not His Unseen to anyone,",
                            "verse 72:27": "save only to such a Messenger as He is well-pleased with; then He despatches before him and behind him watchers,",
                            "verse 72:28": "that He may know they have delivered the Messages of their Lord; and He encompasses all that is with them, and He has numbered everything in numbers.’"
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 72:1": "SAY: \"It has been revealed to me that some of the unseen beings gave ear [to this divine writ], and thereupon said [unto their fellow-beings]: \"‘Verily, we have heard a wondrous discourse,",
                            "verse 72:2": "guiding towards consciousness of what is right; and so We have come to believe in it. And we shall never ascribe divinity to anyone beside our Sustainer,",
                            "verse 72:3": "for [we know] that sublimely exalted is our Sustainer’s majesty: no consort has He ever taken unto Himself, nor a son!",
                            "verse 72:4": "\"‘And [now we know] that the foolish among us were wont to say outrageous things about God,",
                            "verse 72:5": "and that [we were mistaken when] we thought that neither man nor [any of] the invisible forces would ever tell a lie about God.",
                            "verse 72:6": "Yet [it has always happened] that certain kinds of humans would seek refuge with certain kinds of [such] invisible forces: but these only increased their confusion",
                            "verse 72:7": "so much so that they came to think, as you [once] thought, that God would never [again] send forth anyone [as His apostle].",
                            "verse 72:8": "\"‘And [so it happened] that we reached out towards heaven: but we found it filled with mighty guards and flames,",
                            "verse 72:9": "notwithstanding that we were established in positions [which we had thought well-suited] to listening to [whatever secrets might be in] it: and anyone who now [or ever] tries to listen will [likewise] find a flame lying in wait for him!",
                            "verse 72:10": "\"‘And [now we have become aware] that we [created beings] may not know whether evil fortune is intended for [any of] those who live on earth, or whether it is their Sustainer’s will to endow them with consciousness of what is right:",
                            "verse 72:11": "just as [we do not know how it happens] that some from among us are righteous, while some of us are [far] below that: we have always followed widely divergent paths.",
                            "verse 72:12": "\"‘And, withal, we have come to know that we can never elude God [while we live] on earth, and that we can never elude Him by escaping [from life].",
                            "verse 72:13": "Hence, as soon as we heard this [call to His] guidance, we came to believe in it: and he who believes in his Sustainer need never have fear of loss or injustice.",
                            "verse 72:14": "\"‘Yet [it is true] that among us are such as have surrendered themselves to God – just as there are among us such as have abandoned themselves to wrongdoing. Now as for those who surrender themselves to Him – it is they that have attained to consciousness of what is right;",
                            "verse 72:15": "but as for those who abandon themselves to wrongdoing – they are indeed but fuel for [the fires of] hell!’\"",
                            "verse 72:16": "[KNOW,] THEN, that if they [who have heard Our call] keep firmly to the [right] path, We shall certainly shower them with blessings abundant,",
                            "verse 72:17": "so as to test them by this means: for he who shall turn away from the remembrance of his Sustainer, him will He cause to undergo suffering most grievous.",
                            "verse 72:18": "And [know] that all worship is due to God [alone]: hence, do not invoke anyone side by side with God!",
                            "verse 72:19": "Yet [thus it is] that whenever a servant of God stands up in prayer to Him, they [who are bent on denying the truth] would gladly overwhelm him with their crowds.",
                            "verse 72:20": "Say: \"I invoke my Sustainer alone, for I do not ascribe divinity to anyone beside Him.\"",
                            "verse 72:21": "Say: \"Verily, it is not in my power to cause you harm or to endow you with consciousness of what is right.\"",
                            "verse 72:22": "Say: \"Verily, no one could ever protect me from God, nor could I ever find a place to hide from Him",
                            "verse 72:23": "if I should fail to convey [to the world whatever illumination comes to me] from God and His messages.\" Now as for him who rebels against God and His Apostle – verily, the fire of hell awaits him, therein to abide beyond the count of time.",
                            "verse 72:24": "[Let them, then, wait] until the time when they behold that [doom] of which they were forewarned: for then they will come to understand which [kind of man] is more helpless and counts for less!",
                            "verse 72:25": "Say: \"I do not know whether that [doom] of which you were forewarned is near, or whether my Sustainer has set for it a distant term.\"",
                            "verse 72:26": "He [alone] knows that which is beyond the reach of a created being’s perception, and to none does He disclose aught of the mysteries of His Own unfathomable knowledge,",
                            "verse 72:27": "unless it be to an apostle whom He has been pleased to elect [therefor]: and then He sends forth [the forces of heaven] to watch over him in whatever lies open before him and in what is beyond his ken",
                            "verse 72:28": "so as to make manifest that it is indeed [but] their Sustainer’s messages that these [apostles] deliver: for it is He who encompasses [with His knowledge] all that they have [to say], just as He takes count, one by one, of everything [that exists]."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 72:1": "Say, “It has been revealed to me that a group from Jinn has listened (to the Qur’ān), and said (to their people), ‘Indeed we have heard an amazing Recital (Qur’ān)",
                            "verse 72:2": "that guides to the right way, so we have believed in it, and we will never associate a partner with our Lord.’",
                            "verse 72:3": "and (then the Jinns started talking to each other) that exalted is the Glory of our Lord; He has taken neither a wife, nor a son,",
                            "verse 72:4": "and that the fools among us used to attribute to Allah extremely absurd things,",
                            "verse 72:5": "and that we thought that the humans and the Jinn would never tell a lie about Allah, (therefore, we had followed them in shirk under this impression),",
                            "verse 72:6": "and that some guys from human beings used to seek refuge with some guys of the Jinn, and thus they increased them (the Jinns) in arrogance,",
                            "verse 72:7": "and that they (humans) thought as you (O Jinns) thought that Allah will never resurrect anyone,",
                            "verse 72:8": "and that we sought (to reach) the sky, but we found it filled with stern guards and flames,",
                            "verse 72:9": "and that we used to sit at places therein to listen; but if one will (try to) listen now, he will find a flame in ambush for him,",
                            "verse 72:10": "and that we do not know whether it is a bad end that is intended for those on earth, or their Lord has intended for them a right thing,",
                            "verse 72:11": "and that some of us are (already) righteous, and some of us are otherwise, and we were on different ways;",
                            "verse 72:12": "and that we have now believed that we can never frustrate Allah on the earth, nor can we baffle Him by escape,",
                            "verse 72:13": "and that when we heard the Guiding Discourse, we believed in it; so if one believes in his Lord, he will have no fear of either any curtailment (in his reward) or any excess (in his punishment),",
                            "verse 72:14": "and that some of us are Muslims, and some of us are unjust. Now, those who submitted to Islam have found out the right path,",
                            "verse 72:15": "As for the unjust, they have become firewood for Hell.”",
                            "verse 72:16": "“(And it is also revealed to me) that if they (the people of Makkah) had stood firm on the (right) way, We would have supplied water to them in abundance,",
                            "verse 72:17": "so that We test them thereby; and if one turns away from the remembrance of his Lord, He will thrust him into a severe torment,",
                            "verse 72:18": "and that masājid (mosques) belong to Allah; so, do not invoke anyone along with Allah,",
                            "verse 72:19": "and that when Allah’s servant stood invoking Him, they almost rushed on him in crowds.”",
                            "verse 72:20": "Say, “I invoke my Lord, and do not associate anyone with Him.”",
                            "verse 72:21": "Say, “I possess no power to cause you any harm or bring you to a right way.”",
                            "verse 72:22": "Say, “No one can ever save me from Allah, and I can never find a refuge save with Him.",
                            "verse 72:23": "However, (I have been given power) of conveying (commands) from Allah, and His messages. The one who disobeys Allah and His Messenger, for him there is the fire of Hell, wherein such people will live forever.",
                            "verse 72:24": "(The disbelievers will continue denying the truth and mock at it) until when they will see what they are promised, they will know whose supporters are weaker, and whose numbers are less.",
                            "verse 72:25": "Say, “I do not know whether that which you are promised is near, or my Lord has appointed for it a distant term.",
                            "verse 72:26": "(He is the) Knower of the Unseen. So He does not let anyone know the Unseen created by Him,",
                            "verse 72:27": "except a messenger whom He chooses (to inform through revelation), and then He appoints (angels as) watching guards before him and behind him, (so that devils may not tamper with the divine revelation,)",
                            "verse 72:28": "so that He knows that they (angels) have conveyed the messages of their Lord. And He has encompassed all that is with them, and has comprehensive knowledge of every thing by numbers."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 72:1": "Say: ‘It has been revealed to me that a company of the jinn listened, then said: “We have indeed heard a marvellous Qur’ān,",
                            "verse 72:2": "which guides to rectitude. Therefore we believe in it and we will never associate anyone with our Lord.",
                            "verse 72:3": "And [we believe] that exalted be the majesty of our Lord; He has taken neither spouse nor son.",
                            "verse 72:4": "And that the fool among us used to utter atrocious lies against God.",
                            "verse 72:5": "And we thought that humans and jinn would never utter a lie against God,",
                            "verse 72:6": "And that certain individuals of mankind used to seek the protection of certain individuals of the jinn so that they increased them in oppressiveness.",
                            "verse 72:7": "And they thought just as you thought, that God would never raise anyone.",
                            "verse 72:8": "And we made for the heaven, but we found it filled with mighty guards and meteors.",
                            "verse 72:9": "And we used to sit in [certain] places therein to listen in; but anyone listening now will find a meteor lying in wait for him.",
                            "verse 72:10": "And we do not know whether ill is intended for those who are in the earth, or whether their Lord intends for them good.",
                            "verse 72:11": "And that among us some have become righteous and some of us are otherwise; we are [made up of] different sects.",
                            "verse 72:12": "And we assume that we will never be able to elude God in the earth, nor will we be able to elude Him by fleeing.",
                            "verse 72:13": "And that when we heard the guidance, we believed in it. For whoever believes in his Lord shall fear neither loss nor oppression.",
                            "verse 72:14": "And that among us some have submitted [to God], while some of us are unjust. So whoever has submitted [to God], those are the ones who seek right guidance.",
                            "verse 72:15": "And as for those are unjust, they will be firewood for Hell!” ’.",
                            "verse 72:16": "And [it has been revealed to me] that if they adopt the [right] path, We will give them abundant water to drink,",
                            "verse 72:17": "so that We may try them therein. And whoever turns away from the remembrance of his Lord, We will admit him into a tortuous chastisement.",
                            "verse 72:18": "And [it has been revealed to me] that the places of prayer belong to God, so do not invoke anyone along with God.",
                            "verse 72:19": "And that when the servant of God rose to invoke Him, they were almost upon him in heaps.",
                            "verse 72:20": "He said, ‘I invoke only my Lord, and I do not associate anyone with Him’.",
                            "verse 72:21": "Say: ‘I truly have no power to bring you any harm or any guidance’.",
                            "verse 72:22": "Say: ‘Indeed none shall protect me from God, and I shall never find besides Him any refuge.",
                            "verse 72:23": "I have power to bring you] only a communication from God and His Messages. And whoever disobeys God and His Messenger, indeed there will be for him the fire of Hell, abiding therein forever’.",
                            "verse 72:24": "Such that when they see what they are promised, they will then know who is weaker in supporters and fewer in numbers.",
                            "verse 72:25": "Say: ‘I do not know if what you are promised is near, or if my Lord has set a [distant] length for it.",
                            "verse 72:26": "Knower [He is] of the Unseen and He does not disclose His Unseen to anyone,",
                            "verse 72:27": "except to a messenger of whom He approves. Then, He despatches before him and behind him watchers,",
                            "verse 72:28": "so that He may know that they have conveyed the Messages of their Lord, and He encompasses all that is with them and keeps count of all things’."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 72:1": "Say: ‘It has been revealed to me that a party of the jinn listened to (my recitation) carefully and then (went back to their people and) said: Surely, we have heard a wonderful Qur’an.",
                            "verse 72:2": "It shows the path of guidance. So we have believed in it and will never set up any partner with our Lord.",
                            "verse 72:3": "And that exalted is the Glory of our Lord. He has taken for Himself neither any wife nor any children.",
                            "verse 72:4": "And that only a fool from amongst us used to utter things about Allah far from the truth, crossing bounds.",
                            "verse 72:5": "And that we thought that man and jinn would never tell a lie against Allah.",
                            "verse 72:6": "And that some of the men used to take shelter with some of the jinn. So they increased defiance amongst the jinn.",
                            "verse 72:7": "And, (O party of jinn,) those men also thought just as you thought that Allah would never raise up anyone (after death).",
                            "verse 72:8": "And that we touched the heavens and found them filled with high-alert guards and stars shining and burning (like brands).",
                            "verse 72:9": "And that we used to sit on certain seats (in the heavens previously, to listen to the news), but if someone now seeks to listen, then he will find a flame of fire (waiting) for him in ambush.",
                            "verse 72:10": "And that we do not know whether some evil has been intended (by our restriction) in respect of those people who are in the earth, or their Lord intends some good for them.",
                            "verse 72:11": "And that amongst us are some who are pious and there are also some (evil) exceptions amongst us. We were (following) different ways.",
                            "verse 72:12": "And we have ascertained that we can by no means come in the way of Allah (whilst living) in the earth, nor can we thwart Him by escaping (from the earth).",
                            "verse 72:13": "And that when we listened to (the Book of) Guidance, we believed in it. Then he who believes in his Lord fears neither loss nor injustice.",
                            "verse 72:14": "And that (some) of us are obedient and (some) of us are wrongdoers as well. So he who becomes obedient, it is they who seek righteousness.",
                            "verse 72:15": "And as for the wrongdoers, they will be the fuel of Hell.’",
                            "verse 72:16": "And this (Revelation has also come to me) that if they had remained firm on the right path (the path of truth, the path of the remembrance of Allah), then We would have provided them with abundant water,",
                            "verse 72:17": "So that We put them to trial by this blessing. And whoever turns away from the remembrance of his Lord, He will cause him to enter a severe torment.",
                            "verse 72:18": "And that mosques are (specified) for Allah alone. So never worship anyone else besides Allah.",
                            "verse 72:19": "And that when the servant of Allah (Muhammad [blessings and peace be upon him]) stood up to worship Him, they thronged around him (to listen to his recitation).",
                            "verse 72:20": "Say: ‘I worship only my Lord and do not associate any partner with Him.’",
                            "verse 72:21": "Say: ‘I do not possess any power to do you harm (i.e., make you disbelieve) or to do you good (i.e., make you believe. So Allah is the real Lord. I am a mediator and means).’",
                            "verse 72:22": "Say: ‘Neither can anyone shelter me from a torment (against the command) of Allah, nor can I ever find refuge apart from Him.",
                            "verse 72:23": "But (my responsibility is) to communicate from Allah His commands and messages. And whoever disobeys Allah and His Messenger (blessings and peace be upon him), surely there is for him the Fire of Hell in which they will live forever.’",
                            "verse 72:24": "Until, when they will see that torment which is being promised to them, (then) they will come to know who is weaker in helpers and fewer in numbers.",
                            "verse 72:25": "Say: ‘I do not know whether that (Day of Rising) which is being promised to you is near, or my Lord has appointed a longer term for that.’",
                            "verse 72:26": "(He is) the Knower of the unseen. So He does not inform any (common man) of His unseen,",
                            "verse 72:27": "Except for His Messengers with whom He is well-pleased (and reveals to them alone the unseen because that is an exclusive trait of Prophethood and a Messenger’s miracle as well). So indeed He appoints protectors at both front and rear of him (the Messenger, for the security of the knowledge of the unseen),",
                            "verse 72:28": "So that Allah may bring to light that surely they (the Messengers) have communicated the messages of their Lord, and Allah has (already) encompassed what they have (of Allah’s injunctions and the knowledge of the unseen) and He has kept count of everything."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Sano: »Minulle on ilmoitettu, että osa dzinneistä kuunteli ja sanoi: 'Totisesti olemme kuulleet luettavan ihmeellistä Koraania,",
                            "verse 72:2": "joka ohjaa oikeaan, ja me uskomme siihen emmekä koskaan tahdo asettaa ketään muuta Jumalamme rinnalle.",
                            "verse 72:3": "Totisesti Hän ei - ääretön on Herramme majesteetti - ole ottanut vaimoa eikä lasta.",
                            "verse 72:4": "Vain mielettömät joukostamme sepittävät sopimattomia asioita Jumalasta;",
                            "verse 72:5": "totisesti ajattelimme, etteivät ihmiset eivätkä dzinnit lausuisi valhetta Jumalaa vastaan,",
                            "verse 72:6": "ja että ihmisten joukosta muutamilla oli tapana paeta eräiden dzinnien turviin, ja nämä yllyttivät heitä pöyhkeyteen.",
                            "verse 72:7": "Totisesti he luulivat aivan niin kuin te, että Jumala ei herätä ketään kuolleista.",
                            "verse 72:8": "(ja Koraania kuulleet dzinnit lisäsivät:) Me todellakin etsimme nousua taivaaseen, mutta havaitsimme sen olevan täynnä voimakkaita vartijoita ja liekkejä.",
                            "verse 72:9": "Katso, meillä oli tapana istua muutamilla paikoilla kuullaksemme, mutta se, joka nyt yrittää kuunnella, kohtaa hänelle varatun liekin.",
                            "verse 72:10": "Emmekä todella tiedä, onko se pahaa, mikä on tarkoitettu maan päällä eläville, vai tarkoittaako heidän Herransa heille oikeaa ohjausta.",
                            "verse 72:11": "Totisesti on joukossamme niitä, jotka ovat hyviä, ja myös sellaisia, jotka eivät ole; me olemme jakaantuneet eri lahkokuntiin.",
                            "verse 72:12": "Katso, me uskomme, ettemme milloinkaan voi päästä Jumalaa pakoon täällä maan päällä, emmekä pääse Hänestä lentämälläkään.",
                            "verse 72:13": "Totisesti uskoimme johdatukseen, kun saimme kuulla sen; ja sen, joka uskoo Herraan, ei tarvitse pelätä tappiota eikä yllättävää pahaa.",
                            "verse 72:14": "Joukostamme ovat eräät totisesti Herralle alistuneita muslimeja, ja toiset jumalattomia. Ne, jotka ovat muslimeja, ovat niitä, joiden päämääränä on vanhurskaus.",
                            "verse 72:15": "Mitä taasen tulee jumalattomiin, kuluttaa heidät helvetin tuli.",
                            "verse 72:16": "(Sano myös:) Jos he pysyvät oikealla tiellä, me annamme heille juomavettä runsain määrin",
                            "verse 72:17": "koetellaksemme heitä siten; mutta jos joku kääntyy pois unohtaen Herransa, valmistaa Hän hänelle loppumattoman vaivan.",
                            "verse 72:18": "Totisesti, temppelit kuuluvat Jumalalle, älkää siis huutako avuksi ketään muuta kuin Jumalaa!",
                            "verse 72:19": "Ja kun Jumalan palvelija nousi huutaen Hänen puoleensa, olivat he vähällä tallata hänet tungoksessa.",
                            "verse 72:20": "Sano: »Minä käännyn vain Herrani puoleen enkä aseta ketään Hänen rinnalleen.»",
                            "verse 72:21": "Sano: »Totisesti, minulla ei ole valtaa tuottaa teille pahaa eikä hyvää.»",
                            "verse 72:22": "Sano: »Totisesti, ei kukaan voi puolustaa minua asettuen Jumalaa vastaan, eikä minulla ole muuta turvapaikkaa kuin Hänen tykönään;",
                            "verse 72:23": "julistan vain Jumalan ilmoituksen ja Hänen sanomansa.» Jos joku ei noudata Jumalan ja Hänen sananjulistajansa tahtoa, odottaa häntä totisesti helvetin tuli, ja hänen on iäti oltava siinä,",
                            "verse 72:24": "aina siksi, kunnes ihmiset saavat kokea sen, millä heitä uhattiin, ja tulevat tuntemaan, kumman auttaja on heikompi ja lukumäärältään vähäisempi.",
                            "verse 72:25": "Sano: »En tiedä, onko jo lähellä se, millä teitä on uhattu, vai onko Herra siirtänyt sen määräajaksi.",
                            "verse 72:26": "Hän tietää silmiltä salatut, mutta ei ilmoita salaisuuksiaan muille",
                            "verse 72:27": "paitsi valitsemalleen sananjulistajalle, ja tälle Hän asettaa suojelijan käymään hänen edellään ja samoin hänen jäljessään",
                            "verse 72:28": "ollakseen varma, että he todella ovat julistaneet Herransa sanoman; Hän käsittää kaiken, mitä heissä on, ja Hän pitää lukua kaikesta.»"
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 72:1": "Dis [ô Muhammad] : \" Il m'a été révélé qu'une troupe de djinns ont prêté l'oreille et se sont écriés : \"Certes, nous avons entendu un Coran merveilleux !",
                            "verse 72:2": "\"Il guide dans la bonne direction ; nous y avons cru et nous n'associerons aucun être à notre Seigneur.",
                            "verse 72:3": "\"Notre Seigneur, en vérité, - que Sa grandeur soit exaltée ! - ne s'est donné ni compagne, ni enfant !",
                            "verse 72:4": "\"L'un d'entre nous, un insensé, a prononcé au sujet de Dieu des choses aberrantes.",
                            "verse 72:5": "\"Nous pensions que ni les hommes, ni les djinns ne pouvaient proférer un mensonge contre Dieu,",
                            "verse 72:6": "\"mais il y a eu parmi les hommes des individus qui se sont mis sous la protection de djinns mâles, lesquels n'ont fait qu'augmenter leur trouble.",
                            "verse 72:7": "\"Ils pensaient alors, comme vous, que Dieu ne ressusciterait personne.",
                            "verse 72:8": "\"Nous avons touché le ciel et l'avons trouvé rempli de gardiens redoutables et de dards flamboyants.",
                            "verse 72:9": "\"Nous nous étions postés sur des sièges pour écouter ; mais quiconque désormais veut écouter rencontre un dard flamboyant qui le guette.",
                            "verse 72:10": "\"Nous ne savions donc pas si l'on voulait du mal aux habitants de la terre, ou si leur Seigneur voulait qu'ils soient bien guidés.",
                            "verse 72:11": "\"Parmi nous, il y en a qui sont vertueux tandis que d'autres ne le sont pas ; nous suivons des voies divergentes.",
                            "verse 72:12": "\"Nous pensions bien que nous ne saurions affaiblir la puissance de Dieu sur la terre et que nous ne l'affaiblirions pas en prenant la fuite.",
                            "verse 72:13": "\"Aussi, lorsque nous avons entendu la Guidance, nous y avons cru. Quiconque croit en son Seigneur ne craint ni d'être lésé, ni d'être opprimé.",
                            "verse 72:14": "\"Il y en a parmi nous qui sont soumis à Dieu (muslimûn) et il y en a qui sont rebelles.\" \" Ceux qui se sont soumis ont embrassé avec ferveur la bonne direction.",
                            "verse 72:15": "Quant aux rebelles, ils seront du bois pour la Géhenne.",
                            "verse 72:16": "S'ils s'étaient maintenus sur la voie droite, Nous les aurions abreuvés d'une eau abondante,",
                            "verse 72:17": "façon de les mettre à l'épreuve. Mais quiconque se détourne du rappel de son Seigneur, Dieu l'achemine vers un châtiment implacable.",
                            "verse 72:18": "Les mosquées sont consacrées à Dieu. N'y invoquez donc personne à côté de Dieu.",
                            "verse 72:19": "Quand le Serviteur de Dieu s'est levé pour L'invoquer, peu s'en fallut qu'ils ne l'étouffent en se pressant autour de lui.",
                            "verse 72:20": "Dis [ô Muhammad] : \" Je n'invoque que mon Seigneur et je ne Lui associe personne \".",
                            "verse 72:21": "Dis : \" Je n'ai le pouvoir ni de vous faire tort ni de vous bien guider \".",
                            "verse 72:22": "Dis : \" Nul ne me protège contre Dieu, et en dehors de Lui, je ne trouverai pas d'asile,",
                            "verse 72:23": "sauf en transmettant la parole de Dieu et Ses messages \". Quant à ceux qui désobéissent à Dieu et à Son Envoyé, le feu de la Géhenne leur est destiné. Ils y demeureront à jamais !",
                            "verse 72:24": "Quand ils verront enfin la réalisation de ce qui leur a été promis, ils sauront qui est le plus faible en secours et l'inférieur en nombre.",
                            "verse 72:25": "Dis : \" Je ne sais si ce qui vous est promis est proche, ou bien si mon Seigneur lui assignera un délai.",
                            "verse 72:26": "Il connaît parfaitement le Mystère ; mais Il ne lève pour personne le voile de Son mystère,",
                            "verse 72:27": "sauf pour celui qu'Il agrée comme envoyé. Celui-là, Il le fait accompagner de gardiens placés devant et derrière lui,",
                            "verse 72:28": "afin de savoir s'ils [les envoyés] ont transmis les messages de leur Seigneur. Sa Science s'étend à tout ce qui les concerne, et Il fait le compte exact de toute chose \"."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 72:1": "Dis : «Il m’a été révélé qu’un groupe de djinns prêtèrent l’oreille, puis dirent : «Nous avons certes entendu une Lecture [le Coran] merveilleuse,",
                            "verse 72:2": "qui guide vers la droiture. Nous y avons cru, et nous n’associerons jamais personne à notre Seigneur.",
                            "verse 72:3": "En vérité notre Seigneur - que Sa grandeur soit exaltée - ne S’est donné ni compagne, ni enfant !",
                            "verse 72:4": "Notre insensé [Iblis] disait des extravagances contre Dieu.",
                            "verse 72:5": "Et nous pensions que ni les humains ni les djinns ne sauraient jamais proférer de mensonge contre Dieu.",
                            "verse 72:6": "Or, il y avait parmi les humains, des mâles qui cherchaient protection auprès des mâles paris les djinns mais cela ne fît qu’accroître leur détresse.",
                            "verse 72:7": "Et ils avaient pensé comme vous avez pensé que Dieu ne ressusciterait jamais personne.",
                            "verse 72:8": "Nous avions frôlé le ciel et Nous l’avions trouvé plein d’une forte garde et de bolides.",
                            "verse 72:9": "Nous y prenions place pour écouter. Mais quiconque prête l’oreille maintenant, trouve contre lui un bolide aux aguets.",
                            "verse 72:10": "Nous ne savons pas si on veut du mal aux habitants de la terre ou si leur Seigneur veut les mettre sur le droit chemin.",
                            "verse 72:11": "Il y a parmi nous des vertueux et [d’autre] qui le sont moins : nous étions divisés en différentes sectes.",
                            "verse 72:12": "Nous pensions bien que nous ne saurions jamais réduire Dieu à l’impuissance sur la terre et que nous ne saurions jamais le réduire à l’impuissance en nous enfuyant.",
                            "verse 72:13": "Et lorsque nous avons entendu le guide [le Coran], nous y avons cru, et quiconque croit en son Seigneur ne craint alors ni diminution de récompense ni oppression.",
                            "verse 72:14": "Il y a parmi nous les Musulmans, et il y en a les injustes [qui ont dévié]. Et ceux qui se sont convertis à l’Islam sont ceux qui ont cherché la droiture.",
                            "verse 72:15": "Et quant aux injustes, ils formeront le combustible de l’Enfer.",
                            "verse 72:16": "Et s’ils se maintenaient dans la bonne direction, Nous les aurions abreuvés, certes d’une eau abondante,",
                            "verse 72:17": "afin de les y éprouver. Et quiconque se détourne du rappel de son Seigneur, Il l’achemine vers un châtiment sans cesse croissant.",
                            "verse 72:18": "Les mosquées sont consacrées à Dieu : n’invoquez donc personne avec Dieu.",
                            "verse 72:19": "Et quand le serviteur de Dieu s’est mis debout pour L’invoquer, ils faillirent se ruer en masse sur lui. .",
                            "verse 72:20": "Dis : «Je n’invoque que mon Seigneur et ne Lui associe personne».",
                            "verse 72:21": "Dis : «Je ne possède aucun moyen pour vous faire du mal, ni pour vous mettre sur le chemin droit».",
                            "verse 72:22": "Dis : «Vraiment, personne ne saura me protéger contre Dieu; et jamais je ne trouverai de refuge en dehors de Lui.",
                            "verse 72:23": "[Je ne puis que transmettre] une communication et des messages [émanant] de Dieu. Et quiconque désobéit à Dieu et à son Messager aura le feu de l’Enfer pour y demeurer éternellement.",
                            "verse 72:24": "Puis, quand ils verront ce dont on les menaçait, ils sauront lesquels ont les secours les plus faibles et [lesquels] sont les moins nombreux.",
                            "verse 72:25": "Dis : «Je ne sais pas si ce dont vous êtes menacés est proche, ou bien, si mon Seigneur va lui assigner un délai.",
                            "verse 72:26": "[C’est Lui] qui connaît le mystère. Il ne dévoile Son mystère à personne,",
                            "verse 72:27": "sauf à celui qu’Il agrée comme Messager et qu’Il fait précéder et suivre de gardiens vigilants,",
                            "verse 72:28": "afin qu’Il sache s’ils ont bien transmis les messages de leur Seigneur. Il cerne (de Son savoir) ce qui est avec eux, et dénombre exactement toute chose»."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Sprich: «Es ward mir offenbart, daß eine Schar der Dschinn zuhörte; sie sprachen: \"Fürwahr, wir haben einen wunderbaren Koran gehört,",
                            "verse 72:2": "Der zur Rechtschaffenheit leitet; so haben wir an ihn geglaubt, und wir werden unserem Herrn nie jemanden zur Seite stellen.",
                            "verse 72:3": "Und die Majestät unseres Herrn ist hoch erhaben. Er hat Sich weder Gattin noch Sohn zugesellt.",
                            "verse 72:4": "Und die Toren unter uns pflegten abscheuliche Lügen wider Allah zu äußern.",
                            "verse 72:5": "Und wir hatten angenommen, weder Menschen noch Dschinn würden je eine Lüge über Allah sprechen.",
                            "verse 72:6": "Und freilich pflegten einige Leute unter den gewöhnlichen Menschen bei einigen Leuten unter den Dschinn Schutz zu suchen, so daß sie (letztere) in ihrer Bosheit bestärkten;",
                            "verse 72:7": "Und freilich dachten sie, ebenso wie ihr denket, Allah würde nie einen (Propheten) erwecken.",
                            "verse 72:8": "Und wir suchten den Himmel, doch wir fanden ihn mit starken Wächtern und schießenden Sternen erfüllt.",
                            "verse 72:9": "Und wir pflegten auf einigen seiner Sitze zu sitzen, um zu lauschen. Wer aber jetzt lauscht, der findet einen schießenden Stern für sich auf der Lauer.",
                            "verse 72:10": "Wir wissen nicht, ob Böses für die beabsichtigt ist, die auf Erden sind, oder ob ihr Herr Gutes für sie im Sinne hat.",
                            "verse 72:11": "Manche unter uns sind solche, die recht handeln, und manche unter uns sind weit davon entfernt; wir sind Sekten, die verschiedene Wege gehen.",
                            "verse 72:12": "Und wir wissen, daß wir auf keine Weise Allah auf Erden zuschanden machen können, noch können wir Ihm durch Flucht entrinnen.",
                            "verse 72:13": "Als wir von der Führung vernahmen, da glaubten wir an sie. Und wer an seinen Herrn glaubt, der fürchtet weder Einbuße noch Unrecht.",
                            "verse 72:14": "Und manche unter uns sind Gottergebene, und manche unter uns sind vom rechten Wege abgewichen.\"» Und die sich ergeben - diese haben den rechten Weg gesucht.",
                            "verse 72:15": "Die aber vom rechten Wege abweichen, sie werden Brennstoff der Hölle sein.",
                            "verse 72:16": "Wenn sie den (rechten) Pfad einhalten, dann werden Wir ihnen Wasser zu trinken geben in Fülle,",
                            "verse 72:17": "Um sie dadurch zu prüfen. Wer sich dann abwendet von der Ermahnung seines Herrn - Er wird ihn in eine zunehmende Strafe stoßen.",
                            "verse 72:18": "Alle Stätten der Anbetung sind Allahs; so rufet niemanden an neben Allah.",
                            "verse 72:19": "Und wenn ein Diener Allahs aufsteht, zu Ihm zu beten, dann umdrängen sie ihn, daß sie ihn fast erdrücken.",
                            "verse 72:20": "Sprich: «Ich rufe einzig meinen Herrn an, und ich stelle Ihm niemanden zur Seite.»",
                            "verse 72:21": "Sprich: «Ich habe nicht die Macht, euch Schaden zuzufügen oder Nutzen.»",
                            "verse 72:22": "Sprich: «Fürwahr, keiner kann mich vor Allah beschützen, noch kann ich eine Zuflucht finden außer Ihm.",
                            "verse 72:23": "(Mein Amt ist) nur die Übermittlung (der Offenbarung) von Allah und Seiner Botschaften.» Und die sich Allah widersetzen und Seinem Gesandten, für die ist das Feuer der Hölle, darin sie bleiben sollen auf lange Zeit.",
                            "verse 72:24": "Wenn sie dann das sehen werden, was ihnen angedroht ward, so werden sie erfahren, wer schwächer ist an Helfern und geringer an Zahl.",
                            "verse 72:25": "Sprich: «Ich weiß nicht, ob das, was euch angedroht ward, nahe ist, oder ob mein Herr eine lange Frist dafür angesetzt hat.»",
                            "verse 72:26": "Kenner des Verborgenen - Er enthüllt keinem Seine Geheimnisse,",
                            "verse 72:27": "Außer allein dem, den Er erwählt, nämlich einem Gesandten. Und dann läßt Er eine Schutzwache vor ihm schreiten und hinter ihm,",
                            "verse 72:28": "Damit Er wisse, daß sie (Seine Gesandten) die Botschaften ihres Herrn verkündet haben. Er umfaßt alles, was bei ihnen ist, und Er führt Buch über alle Dinge."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "¼,s jlwy yksxksa ls½ dg nks fd esjs ikl ^ogh",
                            "verse 72:2": "tks HkykbZ dh jkg fn[kkrk gS rks ge ml ij bZeku ys vk, vkSj vc rks ge fdlh dks vius ijojfnxkj dk Ójhd u cuk,¡xs",
                            "verse 72:3": "vkSj ;s fd gekjs ijojfnxkj dh Óku cgqr cM+h gS mlus u ¼fdlh dks½ choh cuk;k vkSj u csVk csVh",
                            "verse 72:4": "vkSj ;s fd geesa ls ckt+ csodwQ [+kqnk ds ckjs esa gn ls T+;knk yx+ks ckrsa fudkyk djrs Fks",
                            "verse 72:5": "vkSj ;s fd gekjk rks [+;ky Fkk fd vkneh vkSj ftu [+kqnk dh fuLcr >wBh ckr ugha cksy ldrs",
                            "verse 72:6": "vkSj ;s fd vknfe;ksa esa ls dqN yksx ftUukr esa ls ckt+ yksxksa dh iukg idM+k djrs Fks rks ¼blls½ mudh ljd’kh vkSj c<+ x;h",
                            "verse 72:7": "vkSj ;s fd tSlk rqEgkjk [+;ky gS oSlk mudk Hkh ,rd+kn Fkk fd [+kqnk gjfxt+ fdlh dks nksckjk ugha ft+Unk djsxk",
                            "verse 72:8": "vkSj ;s fd geus vkleku dks VVksyk rks mldks Hkh cgqr d+oh fuxsgckuksa vkSj Óksyks ls Hkjk gqvk ik;k",
                            "verse 72:9": "vkSj ;s fd igys ge ogk¡ cgqr ls ed+kekr esa ¼ckrsa½ lquus ds fy, cSBk djrs Fks exj vc dksbZ lquuk pkgs rks vius fy, Óksys rS;kj ik,xk",
                            "verse 72:10": "vkSj ;s fd ge ugha le>rs fd mlls vgys t+ehu ds gd+ esa cqjkbZ ed+lwn gS ;k muds ijojfnxkj us mudh HkykbZ dk bjknk fd;k gS",
                            "verse 72:11": "vkSj ;s fd geesa ls dqN yksx rks usdksdkj gSa vkSj dqN yksx vkSj rjg ds ge yksxksa ds Hkh rks dbZ rjg ds fQjdsa gSa",
                            "verse 72:12": "vkSj ;s fd ge le>rs Fks fd ge t+ehu esa ¼jg dj½ [+kqnk dks gjfxt+ gjk ugha ldrs gSa vkSj u Hkkx dj mldks vkftt+ dj ldrs gSa",
                            "verse 72:13": "vkSj ;s fd tc geus fgnk;r ¼dh fdrkc½ lquh rks mu ij bZeku yk, rks tks Ó[+l vius ijojfnxkj ij bZeku yk,xk rks mldks u uqd+lku dk [+kkSQ+ gS vkSj u t++qYe dk",
                            "verse 72:14": "vkSj ;s fd ge esa ls dqN yksx rks Q+jekcjnkj gSa vkSj dqN yksx ukQ+jeku rks tks yksx Q+jekcjnkj gSa rks og lh/ks jkLrs ij pysa vkSj jgsa",
                            "verse 72:15": "ukQjeku rks og tgUuqe ds dqUns cus",
                            "verse 72:16": "vkSj ¼,s jlwy rqe dg nks½ fd vxj ;s yksx lh/kh jkg ij d+k;e jgrs rks ge t+:j mudks vyx+kjksa ikuh ls lsjkc djrs",
                            "verse 72:17": "rkfd mlls mudh vkt+ekbZ’k djsa vkSj tks Ó[+l vius ijojfnxkj dh ;kn ls eq¡g eksM+sxk rks og mldks l[+r vt+kc esa >ksad nsxk",
                            "verse 72:18": "vkSj ;s fd efLtnsa [+kkl [+kqnk dh gSa rks yksxksa [+kqnk ds lkFk fdlh dh bcknu u djuk",
                            "verse 72:19": "vkSj ;s fd tc mldk cUnk ¼eksgEen½ mldh bcknr dks [kM+k gksrk gS rks yksx mlds fxnZ gqtwe djds fxj iM+rs gSa",
                            "verse 72:20": "¼,s jlwy½ rqe dg nks fd eSa rks vius ijojfnxkj dh bcknr djrk gww¡ vkSj mldk fdlh dks Ójhd ugha cukrk",
                            "verse 72:21": "¼;s Hkh½ dg nks fd eSa rqEgkjs gd+ esa u cqjkbZ gh dk ,[+rs;kj j[krk gw¡ vkSj u HkykbZ dk",
                            "verse 72:22": "¼;s Hkh½ dg nks fd eq>s [+kqnk ¼ds vt+kc½ ls dksbZ Hkh iukg ugha ns ldrk vkSj u eSa mlds flok dgha iukg dh txg ns[krk gw¡",
                            "verse 72:23": "[+kqnk dh rjQ ls ¼,gdke ds½ igq¡pk nsus vkSj mlds iSx+keksa ds flok ¼dqN ugha dj ldrk½ vkSj ftlus [+kqnk vkSj mlds jlwy dh ukQjekuh dh rks mlds fy, ;d+huu tgUuqe dh vkx gS ftlesa og ges’kk vkSj vcknqy vkckn rd jgsxk",
                            "verse 72:24": ";gk¡ rd fd tc ;s yksx mu pht+ksa dks ns[k ysaxs ftudk muls ok;nk fd;k tkrk gS rks mudks ekywe gks tk,xk fd fdlds ennxkj det+ksj vkSj fdldk Óqekj de gS",
                            "verse 72:25": "¼,s jlwy½ rqe dg nks fd eSa ugha tkurk fd ftl fnu dk rqels ok;nk fd;k tkrk gS d+jhc gS ;k esjs ijojfnxkj us mldh eqn~nr njkt+ dj nh gS",
                            "verse 72:26": "¼ogh½ x+ScokW gS vkSj viuh x+Sc dh ckrs fdlh ij t+kfgj ugha djrk",
                            "verse 72:27": "exj ftl iSx+Ecj dks ilUn Qjek, rks mlds vkxs vkSj ihNs fuxsgcku Qfj’rs eqd+jZj dj nsrk gS",
                            "verse 72:28": "rkfd ns[k ys fd mUgksaus vius ijojfnxkj ds iSx+kekr igq¡pk fn, vkSj ¼;w¡ rks½ tks dqN muds ikl gS og lc ij gkoh gS vkSj mlus rks ,d ,d pht+ fxu j[kh gSa lwj, ftu [+kRe"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Katakanlah (hai Muhammad): \"Telah diwahyukan kepadaku bahwasanya: sekumpulan jin telah mendengarkan (Al Qur’an), lalu mereka berkata: \"Sesungguhnya kami telah mendengarkan Al Qur’an yang menakjubkan,",
                            "verse 72:2": "(yang) memberi petunjuk kepada jalan yang benar, lalu kami beriman kepadanya. Dan kami sekali-kali tidak akan mempersekutukan seorangpun dengan Tuhan kami,",
                            "verse 72:3": "dan bahwasanya Maha Tinggi kebesaran Tuhan kami, Dia tidak beristeri dan tidak (pula) beranak.",
                            "verse 72:4": "Dan bahwasanya: orang yang kurang akal daripada kami dahulu selalu mengatakan (perkataan) yang melampaui batas terhadap Allah,",
                            "verse 72:5": "dan sesungguhnya kami mengira, bahwa manusia dan jin sekali-kali tidak akan mengatakan perkataan yang dusta terhadap Allah.",
                            "verse 72:6": "Dan bahwasanya ada beberapa orang laki-laki di antara manusia meminta perlindungan kepada beberapa laki-laki di antara jin, maka jin-jin itu menambah bagi mereka dosa dan kesalahan.",
                            "verse 72:7": "Dan sesungguhnya mereka (jin) menyangka sebagaimana persangkaan kamu (orang-orang kafir Mekah), bahwa Allah sekali-kali tidak akan membangkitkan seorang (rasul)pun,",
                            "verse 72:8": "dan sesungguhnya kami telah mencoba mengetahui (rahasia) langit, maka kami mendapatinya penuh dengan penjagaan yang kuat dan panah-panah api,",
                            "verse 72:9": "dan sesungguhnya kami dahulu dapat menduduki beberapa tempat di langit itu untuk mendengar-dengarkan (berita-beritanya). Tetapi sekarang barangsiapa yang (mencoba) mendengar-dengarkan (seperti itu) tentu akan menjumpai panah api yang mengintai (untuk membakarnya).",
                            "verse 72:10": "Dan sesungguhnya kami tidak mengetahui (dengan adanya penjagaan itu) apakah keburukan yang dikehendaki bagi orang yang di bumi ataukah Tuhan mereka menghendaki kebaikan bagi mereka.",
                            "verse 72:11": "Dan sesungguhnya di antara kami ada orang-orang yang saleh dan di antara kami ada (pula) yang tidak demikian halnya. Adalah kami menempuh jalan yang berbeda-beda.",
                            "verse 72:12": "Dan sesungguhnya kami mengetahui, bahwa kami sekali-kali tidak akan dapat melepaskan diri (dari kekuasaan) Allah di muka bumi dan sekali-kali tidak (pula) dapat melepaskan diri (daripada) Nya dengan lari.",
                            "verse 72:13": "Dan sesungguhnya kami tatkala mendengar petunjuk (Al Qur’an), kami beriman kepadanya. Barangsiapa beriman kepada Tuhannya, maka ia tidak takut akan pengurangan pahala dan tidak (takut pula) akan penambahan dosa dan kesalahan.",
                            "verse 72:14": "Dan sesungguhnya di antara kami ada orang-orang yang ta’at dan ada (pula) orang-orang yang menyimpang dari kebenaran. Barangsiapa yang ta’at, maka mereka itu benar-benar telah memilih jalan yang lurus.",
                            "verse 72:15": "Adapun orang-orang yang menyimpang dari kebenaran, maka mereka menjadi kayu api neraka Jahannam\".",
                            "verse 72:16": "Dan bahwasanya: jika mereka tetap berjalan lurus di atas jalan itu (agama Islam), benar-benar Kami akan memberi minum kepada mereka air yang segar (rezki yang banyak).",
                            "verse 72:17": "Untuk Kami beri cobaan kepada mereka padanya. Dan barangsiapa yang berpaling dari peringatan Tuhannya, niscaya akan dimasukkan-Nya ke dalam azab yang amat berat.",
                            "verse 72:18": "Dan sesungguhnya masjid-masjid itu adalah kepunyaan Allah. Maka janganlah kamu menyembah seseorangpun di dalamnya di samping (menyembah) Allah.",
                            "verse 72:19": "Dan bahwasanya tatkala hamba Allah (Muhammad) berdiri menyembah-Nya (mengerjakan ibadat), hampir saja jin-jin itu desak mendesak mengerumuninya.",
                            "verse 72:20": "Katakanlah: \"Sesungguhnya aku hanya menyembah Tuhanku dan aku tidak mempersekutukan sesuatupun dengan-Nya\".",
                            "verse 72:21": "Katakanlah: \"Sesungguhnya aku tidak kuasa mendatangkan sesuatu kemudharatanpun kepadamu dan tidak (pula) sesuatu kemanfa’atan\".",
                            "verse 72:22": "Katakanlah: \"Sesungguhnya aku sekali-kali tiada seorangpun yang dapat melindungiku dari (azab) Allah dan sekali-kali tiada akan memperoleh tempat berlindung selain daripada-Nya\".",
                            "verse 72:23": "Akan tetapi (aku hanya) menyampaikan (peringatan) dari Allah dan risalah-Nya. Dan barangsiapa yang mendurhakai Allah dan Rasul-Nya maka sesungguhnya baginyalah neraka Jahannam, mereka kekal di dalamnya selama-lamanya.",
                            "verse 72:24": "Sehingga apabila mereka melihat azab yang diancamkan kepada mereka, maka mereka akan mengetahui siapakah yang lebih lemah penolongnya dan lebih sedikit bilangannya.",
                            "verse 72:25": "Katakanlah: \"Aku tidak mengetahui, apakah azab yang diancamkan kepadamu itu dekat ataukah Tuhanku menjadikan bagi (kedatangan) azab itu, masa yang panjang?\".",
                            "verse 72:26": "(Dia adalah Tuhan) Yang Mengetahui yang ghaib, maka Dia tidak memperlihatkan kepada seorangpun tentang yang ghaib itu.",
                            "verse 72:27": "Kecuali kepada rasul yang diridhai-Nya, maka sesungguhnya Dia mengadakan penjaga-penjaga (malaikat) di muka dan di belakangnya.",
                            "verse 72:28": "Supaya Dia mengetahui, bahwa sesungguhnya rasul-rasul itu telah menyampaikan risalah-risalah Tuhannya, sedang (sebenarnya) ilmu-Nya meliputi apa yang ada pada mereka, dan Dia menghitung segala sesuatu satu persatu."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Di': « Mi è stato rivelato che un gruppo di dèmoni ascoltarono e dissero: \" Invero abbiamo ascoltato una Lettura meravigliosa ,",
                            "verse 72:2": "che conduce sulla retta via; abbiamo creduto in essa e non assoceremo nessuno al nostro Signore.",
                            "verse 72:3": "In verità Egli - esaltata sia la Sua Maestà - non si è preso né compagna né figlio.",
                            "verse 72:4": "Uno stolto dei nostri diceva menzogne contro Allah.",
                            "verse 72:5": "Pensavamo che né gli uomini né i dèmoni potessero proferire menzogne contro Allah.",
                            "verse 72:6": "Invero c'erano degli uomini che si rifugiavano presso i dèmoni , e questo non fece che aumentare la loro follia:",
                            "verse 72:7": "anch'essi pensavano, come lo pensavate voi, che Allah non avrebbe resuscitato nessuno .",
                            "verse 72:8": "Invero abbiamo sfiorato il cielo, ma lo abbiamo trovato munito di temibili guardiani e di bolidi fiammeggianti .",
                            "verse 72:9": "Ci sedevamo [un tempo] in sedi appropriate, per ascoltare. Ma ora chi vuole origliare trova un bolide fiammeggiante in agguato .",
                            "verse 72:10": "Noi non sappiamo se sia stata decretata una sventura per coloro che stanno sulla terra, o se il loro Signore li voglia guidare [al bene].",
                            "verse 72:11": "Tra noi ci sono dei giusti e altri che non lo sono: siamo in diverse sette.",
                            "verse 72:12": "Pensavamo che mai avremmo potuto annullare [la potenza di] Allah sulla terra e che non avremmo mai potuto sfuggire [a Lui] .",
                            "verse 72:13": "Quando udimmo la Guida, credemmo; e chi crede nel suo Signore non teme danno né offesa.",
                            "verse 72:14": "[Ora] tra noi ci sono i musulmani e i ribelli. I musulmani sono quelli che hanno scelto la Retta via.",
                            "verse 72:15": "I ribelli, invece, saranno combustibile dell'Inferno\".",
                            "verse 72:16": "Se si manterranno sulla Retta via, Noi li disseteremo di acqua abbondante",
                            "verse 72:17": "per metterli colà alla prova . Allah condurrà ad un castigo incessantemente più severo chi avrà trascurato il monito del suo Signore.",
                            "verse 72:18": "Le moschee appartengono ad Allah: non invocate nessuno insieme con Lui",
                            "verse 72:19": "Quando il servo di Allah si levò per invocarLo, poco mancò che lo stringessero [fino a soffocarlo]! » .",
                            "verse 72:20": "Di': « Non invoco altri che il mio Signore e non Gli associo alcunché».",
                            "verse 72:21": "Di': « In verità non posso né nuocervi, né giovarvi».",
                            "verse 72:22": "Di': « In verità nessuno potrà proteggermi da Allah e mai troverò rifugio all'infuori di Lui,",
                            "verse 72:23": "se non comunicando, in Nome di Allah, i Suoi messaggi». Coloro che disobbediranno ad Allah e al Suo Messaggero, avranno il fuoco dell'Inferno e vi rimarranno in perpetuo per sempre.",
                            "verse 72:24": "Quando poi vedranno quello che è stato promesso loro, allora sapranno chi avrà avuto l'alleato più debole e [chi sarà stato] numericamente esiguo!",
                            "verse 72:25": "Di': « Io non so se quello che vi è stato promesso è imminente o se il mio Signore vorrà ritardarlo:",
                            "verse 72:26": "[Egli è] Colui che conosce l'invisibile e non lo mostra a nessuno,",
                            "verse 72:27": "se non a un messaggero di cui si compiace, che fa precedere e seguire da una guardia [angelica],",
                            "verse 72:28": "per sapere se [i profeti] hanno trasmesso i messaggi del loro Signore. Gli è ben noto tutto ciò che li concerne e tiene il conto di tutte le cose»."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "言え，「わたしにこう啓示された。一団のジンが（クルアーンを）聞いて言った。『わたしたちは，本当に驚くべき読誦を聞いた。",
                            "verse 72:2": "正しい道への導きである。だからわたしたちは信仰し，主に何ものをも配さない。",
                            "verse 72:3": "尊厳にしていと高き主の御威光よ，かれは妻を娶らず，子も持たれない。",
                            "verse 72:4": "わたしたちの中の愚かな者が，アッラーに対し途方もない嘘を話していた。",
                            "verse 72:5": "しかしわたしたちは，人間もジンも，アッラーに就いて嘘を言うべきではないと考えていた。",
                            "verse 72:6": "本当に或る種の人間は，ジンの或る者に庇護を求める。しかしそれは，かれらの愚劣を助長した。",
                            "verse 72:7": "かれらもあなたがたが考えたように，アッラーは，何者も甦らされないだろうと考えていた。",
                            "verse 72:8": "わたしたちは，天（の秘密）に触れようとしたが，これは強い護衛の燃え輝く星（流星）で一杯であることが分った。",
                            "verse 72:9": "わたしたちは（盗み）聞くためにそこに坐っていた。だが聞き耳を立てる者には，警戒している燃え輝く星（流星）が待ち構えている。",
                            "verse 72:10": "わたしたちは，主が地上の者に対して悪を望まれているのか，または，かれらを正しい道に，導くことを望まれているのか知らなかった。",
                            "verse 72:11": "わたしたちの中には，正しい者もいるが，そうではない者もいて，様々な道に従っている。",
                            "verse 72:12": "だがわたしたちは，地上においてアッラーを出し抜くことは出来ないし，また逃避して，かれを失敗させることも出来ないと思っている。",
                            "verse 72:13": "わたしたちは導きを聴いて，直ぐそれを信仰した。そして主を信じる者には，恐れもなく，損うこともなく，また不正にあうこともない。",
                            "verse 72:14": "わたしたちの中には，（アッラーに）服従，帰依する者もあり，また正道から逸れる者もいる。服従，帰依した者は正しい道に志向を定める。",
                            "verse 72:15": "だが正道から逸れる者は火獄の薪となろう。』と。」",
                            "verse 72:16": "もしかれらが（正しい）道を守るならば，われは必ず豊かな雨（凡ての恩恵）をかれらに恵む。",
                            "verse 72:17": "われはそれによってかれらを試みよう。だが主を念うことから逸れる者は，厳しい懲罰に追いたてられることになる。",
                            "verse 72:18": "本当にマスジドは（凡て）アッラーの有である。それでアッラーと同位に配して他の者に祈ってはならない。",
                            "verse 72:19": "アッラーのしもべ（ムハンマド）が，かれに祈るために立った時，かれら（マッカの多神教徒）はどっと押し寄せんばかりに，かれを取り巻いた。",
                            "verse 72:20": "言ってやるがいい。「わたしは，一途にわが主に祈り，何もかれと同位に配さない。」",
                            "verse 72:21": "言ってやるがいい。「わたしには，あなたがたを害したり，益したりする力はないのである。」",
                            "verse 72:22": "言ってやるがいい。「誰もアッラーからわたしを守り切ることは出来ないし，またかれの外に，避難所を見い出すことも出来ない。",
                            "verse 72:23": "（わたしは）只アッラーからの御告げを，宣べ伝えるに過ぎない。それでアッラーとその使徒に従わない者，かれらには地獄の火があり，永遠にその中に住むであろう。」",
                            "verse 72:24": "かれらは，約束されたことを見る時になって，助力において誰が最も頼りにならないか，数においても誰が最も頼りにならないかを知るであろう。",
                            "verse 72:25": "言ってやるがいい。「わたしは，あなたがたに約束されたことが近付いているのか，それともアッラーがもう少し期間を設けられたのかを知らない。",
                            "verse 72:26": "かれ（だけ）が幽玄界を知っておられ，その秘密を誰にも漏されはしない。",
                            "verse 72:27": "かれの御気に召した使徒以外には。それで，かれは，前からも後ろからも護衛して，（使徒を）赴かせられた。",
                            "verse 72:28": "それはかれらが，果して主の御告げを伝えたかどうかをかれが知られるためであり，またかれらの持つものを取り囲んで，凡てをそれぞれ計算に数え上げられるためである。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "일러가로되 내게 말씀이 계시 되었고 한 무리의 영마가 꾸란을 듣고 말하길 실로 우리는 아름다 운 꾸란 낭송을 들었노라 하더라",
                            "verse 72:2": "그것은 바른 길로 인도하여 주 는 것이니 우리가 그것을 믿되 주님을 어떤 것과 비유하지 않노라",
                            "verse 72:3": "하나님은 가장 위대한 주님으 로 아내도 그리고 자손도 두지 않 으신 분이라",
                            "verse 72:4": "우리 가운데 우매한 자들이 있어 하나님을 거역하고 거짓하는 자 있었으나",
                            "verse 72:5": "우리는 사람도 영마도 하나님 께 거역하고 거짓말하리라 생각 지 아니 했노라",
                            "verse 72:6": "사람중에 영마의 무리에게 보호를 구하는 자 있으나 그들은 오히려 그들에게 어리석음을 더하여 주니라",
                            "verse 72:7": "그들은 너희가 생각했듯 하 나님은 어느 누구도 부활시키지 않으리라 생각했더라",
                            "verse 72:8": "우리가 하늘에 이르려고 시도하였으나 힘센 수호자들과 빛나는별들로 가득차 있음을 알았노라",
                            "verse 72:9": "실로 우리는 보이지 않는 곳 에 앉아 소식을 엿듣곤 하였으나 그렇게 엿들으려는 자는 유성이 숨어서 그를 기다리고 있음을 알 게 되리라",
                            "verse 72:10": "우리는 지상에 있는 그들 위에 재앙이 있을 것인지 아니면 주님께서 그들을 인도 하실련지 알지 못하노라",
                            "verse 72:11": "우리 중에는 의로운 자들이있고 의롭지 못한 자들이 있어 우리는 다른 길을 따르고 있노라",
                            "verse 72:12": "우리는 대지 위에서 하나님 을 초월하고 또한 그분을 피할 수 없음을 알고 있노라",
                            "verse 72:13": "우리는 복음을 들었을 때 그 것을 믿었으니 주님을 믿는 자 누 구든 어떤 손실과 수치도 두려워 하지 않노라",
                            "verse 72:14": "우리 중에 하나님께 귀의하 는 자 있고 이탈하는 자 있나니 귀의하는 자 누구든 올바른 길을 추구하노라",
                            "verse 72:15": "그러나 바른 길에서 이탈하 는 자 그들은 불지옥의 연료가 되 니라",
                            "verse 72:16": "하나님의 말씀이 있어 만일 그들이 바른 길을 걷는다면 내가 그 들 위에 풍성한 비를 내려 주리라",
                            "verse 72:17": "하나님은 그렇게 하여 그들을 시험하였나니 주님의 가르침을 외 면하는 자 있다면 그분은 그를 고 통스러운 응벌속에 들게 하리라",
                            "verse 72:18": "사원은 하나님의 것이거늘하 나님과 어떤 것도 비유하지 말라",
                            "verse 72:19": "하나님의 종이 일어나 그분께 경배하니 그들이 떼를지어 그 를 둘러 싸더라",
                            "verse 72:20": "일러가로되 실로 나는 주님 만을 경배하며 그분에게 어떤 것 도 비유하지 아니하노라",
                            "verse 72:21": "일러가로되 스스로에게 해악을 끼치는 너희를 바른길로 인도 하는 것은 나의 능력이 아니라",
                            "verse 72:22": "일러가로되 하나님에 대항하여 나를 보호하여 줄 어느 누구도없으니 나는 그분 외에 어떤 곳에서도 안식처를 구할 수 없노라",
                            "verse 72:23": "실로 나는 하나님의 계시와 메세지를 전하는 것 뿐으로 하나 님과 그분의 선지자를 거역하는 자 볼지옥에 들어가 그곳에서 영 주하리라",
                            "verse 72:24": "그들은 약속받은 것을 보게 되리니 그때 그들은 누가 더 약한자이며 어느 쪽이 열세인가를 알 게 되리라",
                            "verse 72:25": "일러가로되 너희가 약속받은 응벌이 가까이 왔는지 아니면 주 님께서 일정기간 동안 유예하셨는 지 알지 못하노라",
                            "verse 72:26": "하나님만이 보이지 않는 것 을 알 뿐으로 그분은 어느 누구에 게도 그분의 신비를 알려 주지 않 으시니라",
                            "verse 72:27": "그러나 그분이 선택한 선지 자는 제외로 그분은 한 무리의 수 호자들로 하여금 그의 앞뒤를 행 진케 하시니라",
                            "verse 72:28": "하나님은 그들이 주님의 메 세지를 전달하였는지 알고자 하심 이며 또한 그분은 그들과 함께 있 는 모든 신비들을 에워싸고 계시 며 모든 것을 숫자로 기록하시니라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "ئه‌ی محمد صلی الله علیه وسلم پێیان بڵێ: وه‌حی و نیگام پێڕاگه‌یه‌نراوه که به‌ڕاستی ده‌سته‌یه‌ك له په‌ریان گوێیان گرتووه بۆ خوێندنه‌وه‌ی قورئان و جا که ته‌واو بووه وتویانه‌: به‌ڕاستی ئێمه خوێندنه‌وه‌یه‌کی سه‌رسوڕهێنه‌رمان بیست.",
                            "verse 72:2": "هیدایه‌ت ده‌دات بۆ ڕێبازی ژیری و تێگه‌یشتن، ئێمه‌ش باوه‌ڕمان پێ کردو هه‌رگیز که‌س ناکه‌ینه شه‌ریك و هاوه‌ڵ بۆ په‌روه‌ردگارمان.",
                            "verse 72:3": "به‌ڕاستی په‌روه‌ردگاری پایه بڵندمان مه‌زن و گه‌وره‌یه‌، بێگومان ئه‌و زاته نه هاوسه‌ری بڕیارداوه نه نه‌وه‌ش.",
                            "verse 72:4": "به‌ڕاستی بێ دین و یاخیه‌که‌مان (واته ئیبلیس) شتی زۆر ناڕه‌واو نابه‌جێی بۆ خوا هه‌ڵبه‌ستووه (ده‌یه‌وێت هه‌موومان گومڕا بکات).",
                            "verse 72:5": "ئێمه گومانمان وابوو که ده‌سته‌ی ئاده‌میزادو په‌ری هه‌رگیز درۆ به‌ناوی خواوه ناکه‌ن!!",
                            "verse 72:6": "به‌ڕاستی پیاوانێك له ده‌سته‌ی ئاده‌میزاد په‌نایان ده‌برد به پیاوانێك له ده‌سته‌ی په‌ریه‌کان (په‌ریه‌کان ئه‌مه‌یان به‌هه‌لزانی) که‌چی ئه‌وه‌نده‌ی تر مانوویان کردن (به‌خورافات و شتی بێ سه‌رو به‌ر).",
                            "verse 72:7": "جا بێگومان په‌ریه‌کانیش گومانیان وه‌ك گومانی ئێوه وابوو که‌: ئیتر خوا هه‌رگیز هیچ پێغه‌مبه‌رێکی تر نانێرێت.",
                            "verse 72:8": "ئێمه‌ش به‌ڕاستی به‌ره‌و ئاسمان کشاین و هه‌ست و هۆشمان خسته‌کار، سه‌رنجماندا که پڕه له پاسه‌وانی به‌تواناو بێ شومار، نه‌یزه‌کیش به هه‌موو لایه‌کدا ده‌کشا، (دیار بوو که ڕووداوێکی گه‌وره ڕووی دابوو).",
                            "verse 72:9": "ئێمه جاران له هه‌ندێك شوێنی ئاسماندا خۆمان حه‌شارده‌دا بۆ گوێگرتن و ده‌نگوباس بیستن، به‌ڵام ئێستا ئه‌وه‌ی بیه‌وێت گوێ بگرێت یه‌کسه‌ر نه‌یزه‌کێکی بۆ ئاماده‌یه‌و بۆی ده‌هاوێژرێت و له‌ناوی ده‌بات.",
                            "verse 72:10": "جا به‌ڕاستی ئێمه نازانین ئایا نه‌خشه‌یه‌کی شه‌ڕو وێرانکاری کێشراوه بۆ دانیشتوانی سه‌ر زه‌وی، یاخود په‌روه‌ردگاریان ده‌یه‌وێت ڕێنموویی و هیدایه‌تیان بدات بۆ دینداری و سه‌رفرازی.",
                            "verse 72:11": "بێگومان ئێمه که‌سانی چاك و دیندارمان هه‌یه‌، هه‌روه‌ها که‌سانی تریش که‌به‌و شێوه‌یه نین، ئێمه جاران ڕێگه‌و ڕێبازو به‌رنامه‌ی هه‌مه جۆرمان گرتبووه‌به‌ر (به‌ڵام ئێسته به‌رنامه‌ی ئیسلام ڕون و دیاره‌).",
                            "verse 72:12": "ئێمه دڵنیا بووین که هه‌رگیز له‌ژێر ده‌سه‌ڵاتی خوا ده‌رناچن له زه‌ویدا، هه‌روه‌ها به‌هه‌ڵاتن و خۆ دزینه‌وه‌ش هه‌رگیز له ژێر ده‌سه‌ڵاتی خوا ده‌رناچین.",
                            "verse 72:13": "به‌ڕاستی ئێمه کاتێك گوێمان له بانگه‌وازی هیدایه‌ت بوو، یه‌کسه‌ر باوه‌ڕمان پێکرد، جا ئه‌وه‌ی ئیمان بهێنێت به په‌روه‌ردگاری، ئیتر ناترسێت له‌وه‌ی، کرده‌وه چاکه‌کانی بێ نرخ ته‌ماشا بکرێت، له گوناهه‌کانیشی چاوپۆشی نه‌کرێت.",
                            "verse 72:14": "به‌ڕاستی له‌ناو ئێمه‌دا که‌سانی موسوڵمان و خواناس هه‌یه‌، که‌سانی بێ دین و خوانه‌ناس و سه‌ر که‌شیش، جا ئه‌وه‌ی موسوڵمان ده‌بێت دیاره که ڕێبازی سه‌ر فرازی دۆزیوه‌ته‌وه‌.",
                            "verse 72:15": "به‌ڵام خوانه‌ناس و سه‌ر که‌شه‌کان به‌سه‌ریانه‌وه ناچێت به‌ڵکو ده‌بنه سوته‌مه‌نی دۆزه‌خ (لێره‌دا گوفتاری په‌ریه ئیمانداره‌کان ته‌واو ده‌بێت).",
                            "verse 72:16": "جا ئه‌گه‌ر ئه‌و خه‌ڵکه ڕێگه‌ی ئیسلامه‌تی و دینداری بگرنه به‌ر ئێمه بارانی پڕ به‌ره‌که‌تیان به‌سه‌ردا ده‌بارێنین.",
                            "verse 72:17": "تا له‌وه‌شدا تاقییان بکه‌ینه‌وه‌و (به ته‌واوی ده‌ر ده‌که‌وێت کێ به‌نده‌ی ڕاسته‌قینه‌یه‌و کێیش به دنیا ده‌خه‌ڵه‌تێت) جا ئه‌وه‌ی له یادو به‌رنامه‌ی په‌روه‌ردگاری لابدات، ده‌یخاته ناو سزاو ئازارێکی به‌رده‌وام.",
                            "verse 72:18": "دڵنیابن که‌: مزگه‌وته‌کان تایبه‌تی خوای گه‌وره‌ن، ده‌بێت هه‌ر ئه‌وه‌ی تێدا بپه‌رسترێت و ناوی که‌سی تر نه‌کرێته شه‌ریك و هاوتای ناوی ئه‌و زاته‌.",
                            "verse 72:19": "جا کاتێکیش به‌نده‌ی خوا محمد صلی الله علیه وسلم بانگه‌وازی بۆ شوێنکه‌وتنی به‌رنامه‌ی خوا ده‌کرد (ئه‌و خه‌ڵکه به‌ده‌سته‌ی ئاده‌میزادو په‌ریه‌وه‌) خه‌ریکبوو له ناوی به‌رن (نووری خوا بکوژێننه‌وه‌).",
                            "verse 72:20": "پێیان بڵێ: من هه‌ر به‌رده‌وام ده‌بم و هه‌ر بانگه‌واز ده‌که‌م بۆ لای په‌روه‌ردگارم، که‌سیش ناکه‌مه هاوه‌ڵ و شه‌ریکی.",
                            "verse 72:21": "هه‌روه‌ها پێیان بڵێ: من هیچ جۆره زه‌ره‌رو زیانێکم به‌ده‌ست نیه‌، هه‌روه‌ها هیدایه‌تیش به‌ده‌ست من نیه (ئه‌گه‌ر خۆتان بیر نه‌که‌نه‌وه‌، قه‌ناعه‌ت به‌زۆر نی یه‌).",
                            "verse 72:22": "بڵێ: به‌ڕاستی من هه‌رگیز هیچ که‌سێك له خوا په‌نام نادات ئه‌گه‌ر خوا بیه‌وێت تووشی زیانێکم بکات و هه‌رگیز په‌ناگایه‌کم ده‌ست ناکه‌وێت جگه لای خوا نه‌بێت.",
                            "verse 72:23": "به‌ڵکو من ته‌نها گه‌یاندنی په‌یامه‌کان و به‌رنامه‌ی خوام له‌سه‌ره‌، جا ئه‌وه‌ی له خواو پێغه‌مبه‌ره‌که‌ی یاخی ببێت ئه‌وه با دڵنیابێت که دۆزه‌خی بۆ ئاماده‌کراوه بۆ هه‌میشه‌و هه‌تاهه‌تایی.",
                            "verse 72:24": "هه‌تا کاتێك هه‌ڕه‌شه‌کان ده‌بینن، ئه‌و کاته ئیتر ده‌زانن، کێ پشتیوانی لاوازه‌و ژماره‌که‌ی که‌مه‌.",
                            "verse 72:25": "هه‌روه‌ها پێیان بڵێ: من نازانم ئایا ئه‌و هه‌ڕه‌شانه‌ی لێتان ده‌کرێت نزیکه یاخود ماوه‌یه‌کی درێژی بۆ داده‌نێت.",
                            "verse 72:26": "ئه‌و زاته زانای نهێنی و شاراوه‌کانه‌، که‌سیش له نهێنی و شاراوه‌کانی ئاگادار ناکات.",
                            "verse 72:27": "مه‌گه‌ر بۆ پێغه‌مبه‌رێك خوا خۆی ڕازی بێت (به‌وه‌ی هه‌ندێ نهێنی بزانێت)، ئه‌و کاته فریشته ده‌کاته پاسه‌وانی له به‌رو پشته‌وه (تا په‌ری و شه‌یتانه‌کان نه‌توانن زه‌فه‌ری پێ به‌رن)...",
                            "verse 72:28": "تا خوا چاك بزانێت و ئاگادار بێت له‌وه‌ی به‌ڕێکوپێکی په‌یام و ڕێنموویی په‌روه‌ردگاریان گه‌یاندووه‌، هه‌رچه‌نده خوا به‌هه‌موو ئه‌و شتانه‌ش ئاگاداره که کردوویانه و پێی هه‌ستاون و هه‌موو شتێك لای ئه‌و زاته به‌ژماره ئامار کراوه‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Katakanlah (wahai Muhammad): Telah diwahyukan kepadaku, bahawa sesungguhnya: Satu rombongan jin telah mendengar (Al-Quran yang aku bacakan), lalu mereka (menyampaikan hal itu kepada kaumnya dengan) berkata: Sesungguhnya kami telah mendengar Al-Quran (sebuah Kitab Suci) yang susunannya dan kandungannya sungguh menakjubkan!",
                            "verse 72:2": "Kitab yang memberi panduan ke jalan yang betul, lalu kami beriman kepadanya, dan kami tidak sekali-kali akan mempersekutukan sesuatu makhluk dengan Tuhan kami.",
                            "verse 72:3": "Dan (ketahuilah wahai kaum kami!) Bahawa sesungguhnya: Tertinggilah kebesaran dan keagungan Tuhan kita daripada beristeri atau beranak.",
                            "verse 72:4": "Dan (dengan ajaran Al-Quran nyatalah) bahawa sesungguhnya: (Ketua) yang kurang akal pertimbangannya dari kalangan kita telah mengatakan terhadap Allah kata-kata yang melampaui kebenaran;",
                            "verse 72:5": "Dan bahawa sesungguhnya (nyatalah kesalahan) kita menyangka bahawa manusia dan jin tidak sekali-kali akan berani mengatakan sesuatu yang dusta terhadap Allah.",
                            "verse 72:6": "Dan bahawa sesungguhnya adalah (amat salah perbuatan) beberapa orang dari manusia, menjaga dan melindungi dirinya dengan meminta pertolongan kepada ketua-ketua golongan jin, kerana dengan permintaan itu mereka menjadikan golongan jin bertambah sombong dan jahat.",
                            "verse 72:7": "Dan bahawa sesungguhnya (tidaklah benar) manusia menyangka sebagaimana yang kamu sangka, bahawa Allah tidak sekali-kali mengutuskan sebarang Rasul (atau tidak akan membangkitkan manusia pada hari kiamat).",
                            "verse 72:8": "Dan bahawa sesungguhnya kami telah berusaha mencari berita langit, lalu kami dapati langit itu penuh dengan pengawal-pengawal yang sangat kuat kawalannya, dan (dengan rejaman-rejaman) api yang menyala.",
                            "verse 72:9": "Padahal sesungguhnya kami dahulu biasa menduduki tempat-tempat (perhentian) di langit untuk mendengar (percakapan penduduknya); maka sekarang sesiapa yang cuba mendengar, akan mendapati api yang menyala yang menunggu merejamnya.",
                            "verse 72:10": "Dan bahawa sesungguhnya kami tidak mengetahui adakah (dengan adanya kawalan langit yang demikian) hendak menimpakan bala bencana kepada penduduk bumi, atau pun Tuhan mereka hendak melimpahkan kebaikan kepada mereka?",
                            "verse 72:11": "Dan bahawa sesungguhnya (memang maklum) ada di antara kita golongan yang baik keadaannya dan ada di antara kita yang lain dari itu; kita masing-masing adalah menurut jalan dan cara yang berlainan.",
                            "verse 72:12": "Dan bahawa sesungguhnya kita (sekarang) mengetahui, bahawa kita tidak sekali-kali akan dapat melepaskan diri dari balasan Allah (walau di mana sahaja kita berada) di bumi dan kita juga tidak sekali-kali akan dapat melarikan diri dari balasanNya (walau ke langit sekalipun).",
                            "verse 72:13": "Dan bahawa sesungguhnya kami, ketika mendengar petunjuk (Al-Quran), kami beriman kepadanya (dengan tidak bertangguh lagi); kerana sesiapa yang beriman kepada Tuhannya, maka tidaklah dia akan merasa bimbang menanggung kerugian (mengenai amalnya yang baik) dan juga tidak akan ditimpakan sebarang kesusahan.",
                            "verse 72:14": "Dan bahawa sesungguhnya (dengan datangnya Al-Quran, nyatalah) ada di antara kita golongan yang beragama Islam dan ada pula golongan yang (kufur derhaka dengan) menyeleweng dari jalan yang benar; maka sesiapa yang menurut Islam (dengan beriman dan taat), maka merekalah golongan yang bersungguh-sungguh mencari dan menurut jalan yang benar.",
                            "verse 72:15": "Adapun orang-orang yang menyeleweng dari jalan yang benar, maka mereka menjadi bahan bakaran bagi Neraka Jahannam.",
                            "verse 72:16": "(Nabi Muhammad diwahyukan menerangkan lagi): Dan bahawa sesungguhnya! Kalaulah mereka (manusia dan jin) itu berjalan betul di atas jalan (Islam), sudah tentu Kami (akan memberikan mereka sebab-sebab kemewahan, terutama) menurunkan hujan lebat kepada mereka.",
                            "verse 72:17": "(Pemberian yang demikian) untuk Kami menguji (dan menzahirkan bawaan dan keadaan) mereka dalam menikmati apa yang Kami berikan itu (adakah mereka bersyukur dan tetap betul menurut Islam) dan (ingatlah), sesiapa yang berpaling dari mengingati Tuhannya, (dengan berlaku ingkar derhaka, maka) Tuhan akan memasukkannya ke dalam azab yang memuncak beratnya.",
                            "verse 72:18": "Dan bahawa sesungguhnya masjid-masjid itu untuk (ibadat kepada) Allah semata-mata; maka janganlah kamu seru dan sembah sesiapapun bersama-sama Allah.",
                            "verse 72:19": "Dan bahawa sesungguhnya, ketika hamba Allah (Nabi Muhammad) berdiri mengerjakan ibadat kepadaNya, mereka hampir-hampir menindih satu sama lain mengerumuninya.",
                            "verse 72:20": "Katakanlah (wahai Muhammad): Sesungguhnya aku hanyalah beribadat kepada Tuhanku semata-mata dan aku tidak mempersekutukanNya dengan sesiapapun.",
                            "verse 72:21": "Katakanlah lagi; Sesungguhnya aku tidak berkuasa mendatangkan sebarang mudarat dan tidak juga berkuasa mendatangkan sebarang kebaikan bagi kamu.",
                            "verse 72:22": "Katakanlah lagi; Sesungguhnya aku, tidak sekali-kali akan dapat diberi perlindungan oleh sesiapapun dari (azab) Allah (jika aku menderhaka kepadaNya) dan aku tidak sekali-kali akan mendapat tempat perlindungan selain daripadaNya,",
                            "verse 72:23": "(Aku diberi kuasa) hanya menyampaikan (wahyu) dari Allah dan perintah-perintahNya (yang ditugaskan kepadaku menyampaikannya) dan sesiapa yang menderhaka kepada Allah dan ingkarkan bawaan RasulNya, maka sesungguhnya disediakan baginya Neraka Jahannam, kekallah mereka di dalamnya selama-lamanya..",
                            "verse 72:24": "(Golongan yang kufur ingkar itu tetap memandang engkau lemah dan kurang penyokong wahai Muhammad), sehingga apabila mereka melihat (azab) yang dijanjikan kepada mereka, maka (pada saat itu) mereka akan mengetahui siapakah orangnya yang lemah penolong-penolongnya dan sedikit jumlah bilangannya.",
                            "verse 72:25": "(Kalau ditanya bilakah azab itu? Maka) katakanlah: Aku tidak mengetahui samada (azab) yang dijanjikan kepada kamu itu sudah dekat atau Tuhanku menentukan bagi kedatangannya satu tempoh yang lanjut.",
                            "verse 72:26": "Tuhanlah sahaja yang mengetahui segala yang ghaib, maka Dia tidak memberitahu perkara ghaib yang diketahuiNya itu kepada sesiapapun;",
                            "verse 72:27": "Melainkan kepada mana-mana Rasul yang di redaiNya (untuk mengetahui sebahagian dari perkara ghaib yang berkaitan dengan tugasnya; apabila Tuhan hendak melakukan yang demikian) maka Dia mengadakan di hadapan dan di belakang Rasul itu malaikat-malaikat yang menjaga dan mengawasnya (sehingga perkara ghaib itu selamat sampai kepada yang berkenaan).",
                            "verse 72:28": "(Tuhan mengadakan malaikat-malaikat itu) supaya Dia mengetahui bahawa sesungguhnya (dengan jagaan mereka) Rasul-rasul itu telah menyampaikan perutusan-perutusan Tuhan mereka, (dengan sempurna); pada hal Dia memang mengetahui dengan meliputi segala keadaan yang ada pada mereka, serta Dia menghitung tiap-tiap sesuatu: Satu persatu."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "بگو: به من وحى شده است كه جمعى از جن به سخنانم گوش فراداده‏اند، سپس گفته‏اند: «ما عجيبى شنيده‏ايم",
                            "verse 72:2": "كه به راه راست هدايت مى‏كند، پس ما به آن ايمان آورده‏ايم و هرگز كسى را شريك پروردگارمان قرارنمى‏دهيم!",
                            "verse 72:3": "و اينكه بلند است مقام باعظمت پروردگار ما، و او هرگز براى خود همسر و فرزندى انتخاب نكرده است!",
                            "verse 72:4": "و اينكه سفيه ما (ابليس) درباره خداوند سخنان ناروا مى‏گفت!",
                            "verse 72:5": "و اينكه ما گمان مى‏كرديم كه انس و جن هرگز بر خدا دروغ نمى‏بندند!",
                            "verse 72:6": "و اينكه مردانى از بشر به مردانى از جن پناه مى‏بردند، و آنها سبب افزايش گمراهى و طغيانشان مى‏شدند!",
                            "verse 72:7": "و اينكه آنها گمان كردند -همان‏گونه كه شما گمان مى‏كرديد- كه خداوند هرگز كسى را (به نبوت )مبعوث نمى‏كند!",
                            "verse 72:8": "و اينكه ما آسمان را جستجو كرديم و همه را پر از محافظان قوى و تيرهاى شهاب يافتيم!",
                            "verse 72:9": "و اينكه ما پيش از اين به استراق سمع در آسمانها مى‏نشستيم; اما اكنون هر كس بخواهد استراق سمع كند، شهابى را در كمين خود مى‏يابد!",
                            "verse 72:10": "و اينكه (با اين اوضاع) ما نمى‏دانيم آيا اراده شرى درباره اهل زمين شده يا پروردگارشان خواسته است آنان را هدايت كند؟!",
                            "verse 72:11": "و اينكه در ميان ما، افرادى صالح و افرادى غير صالحند; و ما گروه‏هاى متفاوتى هستيم!",
                            "verse 72:12": "و اينكه ما يقين داريم هرگز نمى‏توانيم بر اراده خداوند در زمين غالب شويم و نمى‏توانيم از (پنجه قدرت) او بگريزيم!",
                            "verse 72:13": "و اينكه ما هنگامى كه هدايت را شنيديم به آن ايمان آورديم; و هر كس به پروردگارش ايمان بياورد، نه از نقصان مى‏ترسد و نه از ظلم!",
                            "verse 72:14": "و اينكه گروهى از ما مسلمان و گروهى ظالمند; هر كس اسلام را اختيار كند راه راست را برگزيده است،",
                            "verse 72:15": "و اما ظالمان آتشگيره و هيزم دوزخند!",
                            "verse 72:16": "و اينكه اگر آنها ( جن و انس) در راه (ايمان) استقامت ورزند، با آب فراوان سيرابشان مى‏كنيم!",
                            "verse 72:17": "هدف اين است كه ما آنها را با اين نعمت فراوان بيازماييم; و هر كس از ياد پروردگارش روى گرداند، او را به عذاب شديد و فزاينده‏اى گرفتار مى‏سازد!",
                            "verse 72:18": "و اينكه مساجد از آن خداست، پس هيچ كس را با خدا نخوانيد!",
                            "verse 72:19": "و اينكه هنگامى كه بنده خدا ( محمد (ص)) به عبادت برمى‏خاست و او را مى‏خواند، گروهى پيرامون او بشدت ازدحام مى‏كردند!»",
                            "verse 72:20": "بگو: «من تنها پروردگارم را مى‏خوانم و هيچ كس را شريك او قرار نمى‏دهم!»",
                            "verse 72:21": "بگو: «من مالك زيان و هدايتى براى شما نيستم!»",
                            "verse 72:22": "بگو: «(اگر من نيز بر خلاف فرمانش رفتار كنم) هيچ كس مرا در برابر او حمايت نمى‏كند و پناهگاهى جز او نمى‏يابم;",
                            "verse 72:23": "تنها وظيفه من ابلاغ از سوى خدا و رساندن رسالات اوست; و هر كس نافرمانى خدا و رسولش كند، آتش دوزخ از آن اوست و جاودانه در آن مى‏مانند!",
                            "verse 72:24": "(اين كار شكنى كفار همچنان ادامه مى‏يابد) تا آنچه را به آنها وعده داده شده ببينند; آنگاه مى‏دانند چه كسى ياورش ضعيفتر و جمعيتش كمتر است!",
                            "verse 72:25": "بگو: «من نمى‏دانم آنچه به شما وعده داده شده نزديك است يا پروردگارم زمانى براى آن قرارمى‏دهد؟!",
                            "verse 72:26": "داناى غيب اوست و هيچ كس را بر اسرار غيبش آگاه نمى‏سازد،",
                            "verse 72:27": "مگر رسولانى كه آنان را برگزيده و مراقبينى از پيش رو و پشت سر براى آنها قرار مى‏دهد",
                            "verse 72:28": "تا بداند پيامبرانش رسالتهاى پروردگارشان را ابلاغ كرده‏اند; و او به آنچه نزد آنهاست احاطه دارد و همه چيز را احصار كرده است!»"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Dize: Foi-me revelado que um grupo de gênios escutou (a recitação do Alcorão). Disseram: Em verdade, ouvimos um Alcorão admirável,",
                            "verse 72:2": "Que guia à verdade, pelo que nele cremos, e jamais atribuiremos parceiro alguém ao nosso Senhor;",
                            "verse 72:3": "Cremos em que - exaltada seja a Majestade do nosso Senhor - Ele jamais teve cônjuge ou prole,",
                            "verse 72:4": "E o insensato, entre nós, proferiu extravagâncias a respeito de Deus.",
                            "verse 72:5": "E jamais imaginamos que os humanos e ao gênios iriam urdir mentiras a respeito de Deus.",
                            "verse 72:6": "E, em verdade, algumas pessoas, dentre os humanos, invocaram a proteção de pessoas, dentre os gênios. Porém, estes só lhes aumentaram os desatinos.",
                            "verse 72:7": "E eles pensaram como pensastes: que Deus jamais ressuscitará alguém.",
                            "verse 72:8": "(Disseram os gênios): Quisemos inteirar-nos acerca do céu e o achamos pleno de severos guardiães e flamígeros meteoros.",
                            "verse 72:9": "E usávamos nos sentar lá, em locais (ocultos), para ouvir; e quem se dispusesse a ouvir agora, defrontar-se-ia com um flamígero meteoro, de guarda.",
                            "verse 72:10": "E nós não compreendemos se o mal era destinado àqueles que estão na terra ou se o Senhor tencionava encaminhá-los para a boa conduta.",
                            "verse 72:11": "E, entre nós (os gênios), há virtuosos e há também os que não o são, porque seguimos diferentes caminhos.",
                            "verse 72:12": "E achamos que jamais poderemos safar-nos de Deus na terra, nem tampouco iludi-Lo, fugindo (para outras paragens).",
                            "verse 72:13": "E quando escutamos a orientação, cremos nela; e quem quer que creia em seu Senhor, não há de temer fraude, nem desatino.",
                            "verse 72:14": "E, entre nós, há submissos, como os também há desencaminhados. Quanto àqueles que se submetem (à vontade de Deus), buscam a verdadeira conduta.",
                            "verse 72:15": "Quanto aos desencaminhados, esses serão combustíveis do inferno.",
                            "verse 72:16": "Mas, se tivessem sido firmes no (verdadeiro) caminho, tê-los-íamos agraciado com água abundante,",
                            "verse 72:17": "Para prová-los, com ela. Em verdade, a quem se afastar da Mensagem do seu Senhor, Ele lhe infligirá um severo castigo.",
                            "verse 72:18": "Sabei que as mesquitas são (casas) de Deus; não invoqueis, pois, ninguém, juntamente com Deus.",
                            "verse 72:19": "E quando o servo de Deus se levantou para invocá-Lo (em oração), aglomeraram-se em tomo dele.",
                            "verse 72:20": "Dize-lhes: Invoco tão somente o meu Senhor, a Quem não atribuo parceiro algum.",
                            "verse 72:21": "Dize-lhes (mais): Em verdade, não posso livrar-vos do mal, nem trazer-vos para a conduta verdadeira.",
                            "verse 72:22": "Dize-lhes (ainda): Em verdade, ninguém poderá livrar-me de Deus, nem tampouco acharei amparo algum fora d’Ele;",
                            "verse 72:23": "Somente proclamo o que de Deus recebi, bem como a Sua mensagem. E aqueles que desobedecem a Deus e ao Seu Mensageiro, certamente terão o fogo infernal, onde morarão eternamente.",
                            "verse 72:24": "(Eles duvidarão) até que, quando se depararem com o que lhes foi prometido, saberão quem tem menos socorredores e quem tem menor número (de aliados).",
                            "verse 72:25": "Dize-lhes: Ignoro se o que vos tem sido prometido é iminente, ou se o meu Senhor fixou-lhe um término remoto.",
                            "verse 72:26": "Ele é Conhecedor do incognoscível e não revela os Seus mistérios a quem quer que seja,",
                            "verse 72:27": "Salvo a um mensageiro que tenta escolhido, e faz um grupo de guardas marcharem, na frente e por trás dele,",
                            "verse 72:28": "Para certificar-se de que transmitiu as mensagens do seu Senhor, o Qual abrange tudo quanto os humanos possuem, e que toma conta de tudo."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 72:1": "Spune: \"Mi-a fost revelat mie cã o ceatã de djinni au ascultat și apoi au zis: \"Noi am auzit un Coran minunat,",
                            "verse 72:2": "Care cãlãuzește cãtre drumul cel drept! Noi credem în el și nu-i vom face Domnului nostru nici un asociat!",
                            "verse 72:3": "Pentru cã El - înalțã-se mãrirea Domnului nostru! - nu Și-a luat soațã și nici copil!",
                            "verse 72:4": "Și netrebnicul nostru a spus asupra lui Allah minciuni.",
                            "verse 72:5": "Noi am crezut cã nici oamenii, nici djinnii nu vor spune împotriva luiAllah minciuni,",
                            "verse 72:6": "Însã au fost bãrbați dintre oameni care au cãutat apãrare la bãrbații dintre djinni, dar le-a sporit lor suferința,",
                            "verse 72:7": "Și cã ei au crezut , așa cum ați crezut și voi, cã Allah nu va învia pe nimeni.",
                            "verse 72:8": "Noi am atins cerul și l-am aflat plin de pãzitori aspri și de bolizi.",
                            "verse 72:9": "Noi ne-am așezat în el pe niște locuri pentru a auzi. Însã cine se pune la ascultat acum gãsește un bolid stând la pândã pentru el.",
                            "verse 72:10": "Noi nu știm dacã se voiește rãu celor de pe pãmânt sau voieșteDomnul lor [sã-i cãlãuzeascã] pe calea cea dreaptã.",
                            "verse 72:11": "Printre noi se aflã unii drepți și [alții] mai puțin drepți; astfel și noi am fost împãrțiți în felurite cete.",
                            "verse 72:12": "Noi credem cã nu-L vom putea slãbi niciodatã pe Allah pe pãmânt și nu-L vom putea slãbi pe El, fugind noi.",
                            "verse 72:13": "Și când am auzit noi cãlãuzirea , am crezut în ea și acela carecrede în Domnul sãu sã nu se teamã nici de împuținare, nici de împovãrare!",
                            "verse 72:14": "Unii dintre noi sunt musulmani și unii dintre noi sunt nelegiuiți. Aceia dintre noi care au îmbrãțișat Islamul sunt aceia care au cãutatcalea cea dreaptã.",
                            "verse 72:15": "Cât despre cei nelegiuiți, ei sunt vreascuri de foc pentruGheena\" .",
                            "verse 72:16": "Și de vor merge ei pe calea cea dreaptã, le vom da Noi apã din belșug,",
                            "verse 72:17": "Pentru ca sã-i încercãm. Și cel ce se întoarce de la pomenireaDomnului sãu, pe acela îl va îndrepta El cãtre un chin aspru.",
                            "verse 72:18": "Moscheile sunt ale lui Allah și nu chemați pe nimeni împreunã cuAllah!",
                            "verse 72:19": "Și când s-a ridicat robul lui Allah , chemându-L pe El , aproa- pe cã s-au îmbulzit [Al-Djinn] cãtre el.",
                            "verse 72:20": "Spune: \"Eu Îl chem numai pe Domnul meu și nu-I fac Lui nici un asociat!\"",
                            "verse 72:21": "Spune: \"Eu nu pot nici sã vã fac vouã vreun rãu, nici sã vã cãlãuzesc pe calea dreaptã!\"",
                            "verse 72:22": "Spune: \"Nimeni nu mã va apãra de Allah și eu nu voi gãsi adãpost [la altcineva] afarã de El!",
                            "verse 72:23": "Eu nu pot sã aduc decât propovãduire de la Allah și mesajele Lui. Iar aceia care nu vor da ascultare lui Allah și Trimisului Sãu vor avea parte de focul Gheenei și în el vor fi veșnic sãlãșluito",
                            "verse 72:24": "Iar atunci când le vor vedea pe cele cu care sunt amenințați,atunci vor ști ei ale cui ajutoare sunt mai slabe și puține la numãr\".",
                            "verse 72:25": "Spune: \"Eu nu știu dacã sunt aproape cele cu care sunteți amenințați ori de le va hotãrî Domnul meu un termen;",
                            "verse 72:26": "[Numai El este] Știutorul necunoscutului și El nu descoperã tainaSa nimãnui,",
                            "verse 72:27": "Afarã de acela pe care îl alege ca trimis și face sã meargã înaintea lui și în urma lui pãzitori,",
                            "verse 72:28": "Pentru ca El sã știe cã ei au transmis mesajele Domnului lor. El doarã cuprinde [cu știința Sa] ceea ce se aflã la ei și socotește numãrul tuturor lucrurilor!\""
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 72:1": "Spune: “Mi s-a dezvăluit că un pâlc de ginni stătea şi asculta; apoi au spus: ‘Da, am auzit un Coran minunat",
                            "verse 72:2": "care călăuzeşte pe calea cea bună. Noi credem în el şi pe nimeni nu vom alătura Domnului nostru,",
                            "verse 72:3": "căci El — înalţă-se a Domnului nostru măreţie — nu şi-a luat nici soţie şi nici fiu,",
                            "verse 72:4": "chiar dacă un smintit dintre noi a spus nesăbuinţe despre Dumnezeu!",
                            "verse 72:5": "Noi ne închipuiam că nici oamenii şi nici ginnii nu vor spune minciuni despre Dumnezeu,",
                            "verse 72:6": "însă sunt unii bărbaţi dintre oameni care cer izbăvire unor bărbaţi dintre ginni, însă aceştia le sporeşte doar prigonirea.",
                            "verse 72:7": "Ei îşi închipuie, aşa cum vă închipuiţi şi voi, că Dumnezeu nu va învia pe nimeni.",
                            "verse 72:8": "Noi am atins cerul şi l-am aflat plin de aprigi păzitori şi limbi de foc.",
                            "verse 72:9": "Ne-am aşezat în jilţuri ca să ascultăm, însă cine ascultă află o limbă de foc pândindu-l.",
                            "verse 72:10": "Nu ştim dacă se vrea vreun rău celor de pe pământ, ori dacă Domnul lor îi vrea pe Calea cea bună",
                            "verse 72:11": "Unii dintre noi sunt drepţi, alţii nu sunt şi căi felurite urmăm.",
                            "verse 72:12": "Noi ştim că n-am putea slăbi puterea lui Dumnezeu pe pământ şi nici nu i-am putea scăpa Lui fugind.",
                            "verse 72:13": "Noi am crezut în Calea cea Dreaptă îndată ce am auzit de ea. Cel care crede în Domnul său nu se teme nici de neajunsuri şi nici de prigonire.",
                            "verse 72:14": "Şi printre noi sunt supuşi, şi printre noi sunt răzvrătiţi. Cei care s-au supus au ales Calea cea bună,",
                            "verse 72:15": "iar cei răzvrătiţi vor fi Gheenei vreascuri.",
                            "verse 72:16": "Dacă merg drept, le vom da să bea apă din belşug",
                            "verse 72:17": "pentru a-i pune la încercare. Dumnezeu va mâna la o osândă din ce în ce mai mare pe cei care se împotrivesc amintirii Domnului lor.",
                            "verse 72:18": "Locurile de închinăciune sunt ale lui Dumnezeu! Nu chema dimpreună cu Dumnezeu pe nimeni!",
                            "verse 72:19": "Când robul lui Dumnezeu s-a ridicat pentru a-i chema, era cât pe-aici să se îngrămădească pe el.’ ”",
                            "verse 72:20": "Spune: “Eu îl chem pe Domnul meu şi nu Îi alătur Lui pe nimeni.”",
                            "verse 72:21": "Spune: “Eu nu vă pot nici păgubi şi nici călăuzi.”",
                            "verse 72:22": "Spune: “Nimeni nu mă apără de Dumnezeu, iar eu nu aflu adăpost decât la El,",
                            "verse 72:23": "propovăduind din dezvăluirile lui Dumnezeu şi din soliile Sale.” Cei care nu dau ascultare lui Dumnezeu şi trimisului Său, în focul Gheenei vor veşnici.",
                            "verse 72:24": "Când vor vedea împlinirea a ceea ce li s-a făgăduit îşi vor da seama cine este cel mai slab întru ajutor şi cel mai mic întru număr.",
                            "verse 72:25": "Spune: “Nu ştiu dacă ceea ce vi s-a făgăduit este aproape ori Domnul meu vă va mai da un răgaz.”",
                            "verse 72:26": "El cunoaşte Taina întru totul, însă nu descoperă nimănui Taina Sa,",
                            "verse 72:27": "numai celui de care-i mulţumit ca trimis. El va mâna în faţa lor şi în spatele lor o pândă",
                            "verse 72:28": "ca să afle dacă ei propovăduiesc soliile Domnului lor. El cuprinde ceea ce ei au şi ţine socoteala fiecărui lucru."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Скажи: «Открыто мне, что джинновсонм,Услышав чтение, сказали:“Поистине, мы дивный слышалиКоран.",
                            "verse 72:2": "Он к Истине указывает путь,В него уверовали мыИ в поклонении АллахуДругих богов не будем измышлять.",
                            "verse 72:3": "И пусть достойно вознесетсяВеличественность нашего Владыки, —Себе ни сына, ни супруги Он не брал.",
                            "verse 72:4": "Средь нас один безумец был,Кто возмутительную (ложь)высказывал против Аллаха.",
                            "verse 72:5": "Мы думали, ни люди и ни джинныЛожь на Аллаха никогда не станутвозводить.",
                            "verse 72:6": "Конечно, средь людей бывали и такие,Которые убежища искали средиджиннов,Но те лишь увеличили безумие таких.",
                            "verse 72:7": "Они считали, как и вы2273,Что никого Аллах вам не пошлет,(Чтоб вас на путь Его наставить).",
                            "verse 72:8": "Мы прикоснулись (к таинствам) небесИ там нашли их полными могучихстражейИ светочей, (что разлетаютсясжигающим огнем).",
                            "verse 72:9": "Мы на седалищах там затаились,Чтоб слышать, (что там говорят);Но кто сейчас2274 услышать пожелает,Найдет там для себяПодстерегающий его горящий светоч.",
                            "verse 72:10": "И мы понять того не можем:Задумано ли зло для тех, кто на земле,Или Господь на путь прямой желаетих направить?",
                            "verse 72:11": "Средь нас есть те,Кто добродетелен и кто порочен, —Идем различными путями мы,",
                            "verse 72:12": "Но знаем:Могущества Аллаха на земле намне ослабитьИ (замыслов) Его не избежать.",
                            "verse 72:13": "И мы, когда услышали про путьпрямой,В него уверовали (тотчас), —Ведь тот, кто верует, —Тому неведом страхНи пред потерею (награды в День Суда),Ни перед незаслуженною (карой).",
                            "verse 72:14": "Средь нас есть те, кто Господупредался2275,Но есть и те, кто отступил.И те, которые преда’лись,Идут по верному пути“».",
                            "verse 72:15": "Но те, кто отступил, —Им быть растопкою для адова костра!",
                            "verse 72:16": "А если б удержались на прямой стезеони,Мы напоили б их водой обильной.",
                            "verse 72:17": "Мы этим испытали б их;Того ж, кто Бога своего не поминает,Подвергнет Он суровой каре.",
                            "verse 72:18": "Лишь для Аллаха все места молений!И вы других богов Емуне измышляйте.",
                            "verse 72:19": "И вот когда, к Всевышнему взывая,Поднялся раб Аллаха (Мухаммад),Они толпою плотной встали вкругнего2277.",
                            "verse 72:20": "Скажи: «Взываю я лишь к своемуВладыкеИ соучастников Ему не придаю».",
                            "verse 72:21": "Скажи: «Не властен я ни злом (васнаказать)(И ни добром) на путь вас праведныйнаставить».",
                            "verse 72:22": "Скажи: «Никто меня от Господане защитит,И не найти убежища нигде мне,Кроме как у Бога,",
                            "verse 72:23": "Коль я не передам (того, что Онвещает),Его посланий (вам не изъясню).А тем, кто будет непослушенАллаху и посланнику Его,Назначен Ад, где пребывать им вечно».",
                            "verse 72:24": "Когда же наконец они увидят то,Что было им обещано (в сей жизни),Они узнают,Кто слабее по числу (помощников)своихИ меньше по числу (собратьев).",
                            "verse 72:25": "Скажи: «Не знаю я, близка ли вамобещанная (кара)Или Аллах назначилболее далекий срок.",
                            "verse 72:26": "Ему лишь одному Незримое известно,И в сокровенное Свое Он не допуститникого,",
                            "verse 72:27": "Кроме посланника, которого Онвыбрал,И стражей перед ним и сзади,",
                            "verse 72:28": "Чтобы (с уверенностью) мог он знать,Что (в чистоте и точности)Они передают ему посланияГосподни, —Господь объемлет их во всем2278И счет ведет всему, что суще»."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Di: «Se me ha revelado que un grupo de genios estaba escuchando y decía: 'Hemos oído una Recitación maravillosa,",
                            "verse 72:2": "que conduce a la vía recta. Hemos creído en ella y no asociaremos nadie a nuestro Señor'.",
                            "verse 72:3": "Y: 'Nuestro Señor -¡exaltada sea Su grandeza!- no ha tomado compañera ni hijo'",
                            "verse 72:4": "Y: 'Nuestro loco decía contra Alá una solemne mentira'.",
                            "verse 72:5": "Y: 'Nosotros creíamos que ni los humanos ni los genios iban a proferir mentira contra Alá'.",
                            "verse 72:6": "Y: 'Había humanos varones que se refugiaban en los genios varones y éstos enloquecieron más a aquéllos'.",
                            "verse 72:7": "Y: 'Creían ellos, como vosotros, que Alá no iba a enviar a nadie'.",
                            "verse 72:8": "Y: 'Hemos palpado el cielo y lo hemos encontrado lleno de guardianes severos y de centellas'.",
                            "verse 72:9": "Y: 'Nos sentábamos allí, en sitios apropiados para oír. Pero todo aquél que escucha, al punto encuentra una centella que le acecha'.",
                            "verse 72:10": "Y: 'No sabemos si se quiere mal a los que están en la tierra o si su Señor quiere dirigirles bien'.",
                            "verse 72:11": "Y: 'Entre nosotros hay unos que son justos y otros que no. Seguimos doctrinas diferentes'.",
                            "verse 72:12": "Y: 'Creíamos que no podríamos escapar a Alá en la tierra, ni aun huyendo'.",
                            "verse 72:13": "Y: 'Cuando oímos la Dirección, creímos en ella. Quien cree en su Señor no teme daño ni injuria'.",
                            "verse 72:14": "Y: 'Entre nosotros los hay que se someten a Alá y los hay que se apartan. Los que se someten a Alá han elegido la rectitud.",
                            "verse 72:15": "Los que se apartan, en cambio, son leña para la gehena'.",
                            "verse 72:16": "Y: 'Si se hubieran mantenido en la vía recta, les habríamos dado de beber agua abundante",
                            "verse 72:17": "para probarles. A quien se desvíe de la Amonestación de su Señor, Él le conducirá a un duro castigo'.",
                            "verse 72:18": "Y: 'Los lugares de culto son de Alá. ¡No invoquéis a nadie junto con Alá!'",
                            "verse 72:19": "Y: 'Cuando el siervo de Alá se levantó para invocarle, poco les faltó para, en masa, arremeter contra él'».",
                            "verse 72:20": "Di: «Invoco sólo a mi Señor y no Le asocio nadie».",
                            "verse 72:21": "Di: «No puedo dañaros ni dirigiros».",
                            "verse 72:22": "Di: «Nadie me protegerá de Alá y no encontraré asilo fuera de Él.",
                            "verse 72:23": "Sólo un comunicado de Alá y Sus mensajes». A quien desobedezca a Alá y a Su Enviado le espera el fuego de la gehena, en el que estará eternamente, para siempre.",
                            "verse 72:24": "Hasta que, cuando vean aquello con que se les ha amenazado, sabrán quién es el que recibe auxilio más débil y quién es numéricamente inferior.",
                            "verse 72:25": "Di: «No sé si está cerca aquello con que se os ha amenazado o si mi Señor lo retardará aún.",
                            "verse 72:26": "El Conocedor de lo oculto. No descubre a nadie lo que tiene oculto,",
                            "verse 72:27": "salvo a aquél a quien acepta como enviado. Entonces, hace que le observen por delante y por detrás,",
                            "verse 72:28": "para saber si han transmitido los mensajes de su Señor. Abarca todo lo concerniente a ellos y lleva cuenta exacta de todo»"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "நிச்சயமாக, ஜின்களில் சில (திருக் குர்ஆனை) செவிமடுத்து(த் தம் இனத்தாரிடம் கூறினர்) \"நிச்சயமாக நாங்கள், மிகவும் ஆச்சரியமான ஒரு குர்ஆனை கேட்டோம்\" என்று கூறினர், என எனக்கு வஹீ அறிவிக்கப்பட்டதென்று (நபியே!) நீர் கூறுவீராக.",
                            "verse 72:2": "\"அது நேர்மையின் பால் வழிகாட்டுகிறது, ஆகவே அதைக் கொண்டு நாங்கள் ஈமான் கொண்டோம்; அன்றியும் எங்கள் இறைவனுக்கு ஒருவனையும் நாங்கள் இணையாக்கமாட்டோம்\" (என்று அந்த ஜின் கூறலாயிற்று).",
                            "verse 72:3": "\"மேலும் எங்கள் இறைவனுடைய மகிமை நிச்சயமாக மிக்க மேலானது, அவன் (எவரையும் தன்) மனைவியாகவோ மகனாகவோ எடுத்துக் கொள்ளவில்லை.",
                            "verse 72:4": "\"ஆனால் நம்மில் மூடராகிவிட்ட (சிலர்) அல்லாஹ்வின் மீது தகாத வார்த்தைகளை சொல்லிக் கொண்டிருக்கின்றனர்.",
                            "verse 72:5": "மேலும் \"மனிதர்களும் ஜின்களும் அல்லாஹ்வின் மீது பொய் கூறவே மாட்டார்கள்\" என்று நிச்சயமாக நாம் எண்ணிக் கொண்டிருந்தோம்.",
                            "verse 72:6": "\"ஆனால், நிச்சயமாக மனிதர்களிலுள்ள ஆடவர்களில் சிலர் ஜின்களிலுள்ள ஆடவர்கள் சிலரிடம் காவல் தேடிக் கொண்டிருந்தனர், இதனால் அவர்கள், (ஜின்களிலுள்ள அவ்வாடவர்களின்) மமதையை பெருக்கிவிட்டனர்.",
                            "verse 72:7": "\"இன்னும், நிச்சயமாக அவர்களும் நீங்கள் எண்ணியதைப் போலவே, அல்லாஹ் ஒருவரையும் (மறுமையில் உயிர்ப்பித்து) எழுப்பமாட்டான் என்று எண்ணிக் கொண்டு இருந்தனர்.",
                            "verse 72:8": "\"நிச்சயமாக நாம் வானத்தைத் தொட்டுப் பார்த்தோம். அது கடுமையான காவலாளிகளாலும், தீப்பந்தங்களாலும் நிரப்பப்பட்டிருப்பதை, நாங்கள் கண்டோம்.",
                            "verse 72:9": "\"(முன்னர் வானில் பேசப்படுவதைச்) செவிமடுப்பதற்காக (அதற்குள்ள சில) இடங்களில் நாங்கள் அமர்ந்திருப்போம்; ஆனால் இப்பொழுதோ எவன் அவ்வாறு செவிமடுக்க முயல்கிறானோ, அவன் தனக்காகக் காத்திருக்கும் தீப்பந்தத்தையே கண்பான்.",
                            "verse 72:10": "\"அன்றியும், பூமியிலிருப்பவர்களுக்குத் தீங்கு நாடப்பட்டிருக்கிறதா, அல்லது அவர்களுடைய இறைவன் அவர்களுக்கு நன்மையை நாடி இருக்கிறானா என்பதையும் நாங்கள் நிச்சயமாக அறிய மாட்டோம்.",
                            "verse 72:11": "\"மேலும், நிச்சயமாக நம்மில் நல்லோரும் இருக்கின்றனர், அப்படியல்லாதவர்களும் நம்மில் இருக்கின்றனர், நாம் பல்வேறு வழிகளையுடையவர்களாகவும் இருந்தோம்.",
                            "verse 72:12": "\"அன்றியும், நிச்சயமாக நாம் பூமியில் அல்லாஹ்வை இயலாமலாக்க முடியாது என்பதையும், அவனை விட்டு ஓடி (ஒளிந்து ) கொள்வதாலும் அவனை (எங்கேயும்) இயலாமலாக்க முடியாதென்பதையும், நாம் அறிந்து கொண்டோம்.",
                            "verse 72:13": "\"இன்னும், நிச்சயமாக நாம் நேர்வழியை (குர்ஆனை) செவிமடுத்த போது, நாம் அதன் மீது ஈமான் கொண்டோம்.\" எனவே எவன் தன் இறைவன் மீது ஈமான் கொள்கிறானோ, அவன் இழப்பைப் பற்றியும், அநீதியைப் பற்றியும் பயப்படமாட்டான்.",
                            "verse 72:14": "\"இன்னும், நிச்சயமாக, நம்மில் முஸ்லிம்களும் இருக்கின்றனர். நம்மில் அக்கிரமக்காரர்களும் இருக்கின்றனர் - எவர்கள் முஸ்லிம்களாகி (வழிப்பட்டார்களோ) அவர்கள் தாம் நேர்வழியைத் தேடிக் கொண்டனர்.",
                            "verse 72:15": "\"அக்கிரமக்காரர்களோ நரகத்திற்கு எரி விறகாய் விட்டனர்\" (என்று அந்த ஜின் கூறிற்று).",
                            "verse 72:16": "\"(மானிடர்களோ, ஜின்களோ) அவர்கள் (நேர்) வழியின் மீது, உறுதியுடன் நிலைத்து நின்றால், நிச்சயமாக நாம் அவர்களுக்கு மிக அதிகமாகத் தண்ணீர் புகட்டுவோம்.",
                            "verse 72:17": "\"அதைக் கொண்டு நாம் அவர்களைச் சோதிப்பதற்காக, ஆகவே, எவன் தன் இறைவனை நினைப்பதைப் புறக்கணிக்கிறானோ, அவனைக் கொடிய வேதனையில் அவன் புகுத்தி விடுவான்.",
                            "verse 72:18": "\"அன்றியும், நிச்சயமாக மஸ்ஜிதுகள் அல்லாஹ்வுக்கே இருக்கின்றன, எனவே, (அவற்றில்) அல்லாஹ்வுடன் (சேர்த்து வேறு) எவரையும் நீங்கள் பிரார்த்திக்காதீர்கள்.",
                            "verse 72:19": "\"மேலும், நிச்சயமாக அல்லாஹ்வின் அடியார் அவனைப் பிரார்த்தித்தவராக நின்றபோது, அவர்பால் அவர்கள் கூட்டம் கூட்டமாக (வந்து) நெருங்கிவிடுகின்றனர்.\"",
                            "verse 72:20": "(நபியே!) நீர் கூறும்; \"நான் பிரார்த்திப்பதெல்லாம் என்னுடைய இறைவனைத் தான்; அன்றியும், நான் அவனுக்கு எவரையும் இணை வைக்க மாட்டேன்.\"",
                            "verse 72:21": "கூறுவீராக, \"நிச்சயமாக நான் உங்களுக்கு நன்மையோ, தீமையோ, செய்ய சக்தி பெற மாட்டேன்.\"",
                            "verse 72:22": "கூறுவீராக, \"நிச்சயமாக அல்லாஹ்வை விட்டும் ஒருவரும் என்னைப் பாதுகாக்க மாட்டார்; இன்னும், அவனையன்றி ஒதுங்குந் தலத்தையும் நான் காணமுடியாது.",
                            "verse 72:23": "\"அல்லாஹ்விடமிருந்து (வருவதை) எடுத்துச் சொல்வதும், அவனுடைய தூதுவத்துவத்தையும் தவிர (எனக்கு வேறில்லை) எனவே, எவர் அல்லாஹ்வுக்கும் அவனுடைய தூதருக்கும் மாறு செய்கிறாரோ அவருக்கு நிச்சயமாக நரக நெருப்புத்தான். அதில் அவர் என்றென்றும் இருப்பர்\" என (நபியே!) நீர் கூறும்.",
                            "verse 72:24": "அவர்களுக்கு வாக்களிக்கப்பட்டதை (வேதனையை) அவர்கள் பார்க்கும் போது, எவருடைய உதவியாளர்கள் மிக பலஹீனமானவர்கள் என்பதையும், எண்ணிக்கையில் மிகக் குறைந்தவர்கள் என்பதையும் விரைவில் அறிந்து கொள்வார்கள்.",
                            "verse 72:25": "(நபியே!) நீர் கூறும், \"உங்களுக்கு வாக்களிக்கப்பட்டிருப்பது (அவ்வேதனை) சமீபமா, அல்லது என்னுடைய இறைவன் அதற்குத் தவணை ஏற்படுத்தியிருக்கிறானா என்பதை நான் அறியேன்.",
                            "verse 72:26": "\"(அவன்தான்) மறைவனாவற்றை அறிந்தவன்; எனவே, தான் மறைத்திருப்பவற்றை அவன் எவருக்கும் வெளியாக்கமாட்டான்.",
                            "verse 72:27": "\"தான் பொருந்திக் கொண்ட தூதருக்குத் தவிர - எனவே அவருக்கு முன்னும், அவருக்குப் பின்னும் பாதுகாவலர்க(ளான மலக்குக)ளை நிச்சயமாக நடத்தாட்டுகிறான்.",
                            "verse 72:28": "\"தங்களுடைய இறைவனின் தூதுத்துவச் செய்திகளை, திட்டமாக எடுத்துச் சொல்லிவிட்டார்களா? என்று அறிவதற்காக - இன்னும் அவர்களிடமுள்ளவற்றை அவன் சூழ்ந்தறிந்து கொண்டிருப்பதுடன், அவன் சகல பொருளையும் எண்ணிக்கையால் மட்டுப்படுத்தி இருக்கிறான்.\""
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "จงกล่าวเถิดมุฮัมมัดว่า ได้มีวะฮีย์ยฺมายังฉันว่า แท้จริงพวกญินจำนวนหนึ่งได้ฟังฉัน (อ่านกุรอาน) และพวกเขากล่าวว่า แท้จริงเราได้ยินกุรอานที่แปลกประหลาด",
                            "verse 72:2": "นำไปสู่ทางที่ถูกต้อง ดังนั้นพวกเราจึงศรัทธาต่ออัลกุรอานนั้น และเราจะไม่ตั้งสิ่งใดเป็นภาคีต่อพระเจ้าของเรา",
                            "verse 72:3": "และความจริงนั้น ความยิ่งใหญ่แห่งพระเจ้าของเรานั้นทรงสูงส่งยิ่ง พระองค์ไม่มีภริยาและไม่มีบุตร",
                            "verse 72:4": "และแท้จริง คนโง่ในหมู่พวกเราได้กล่าวร้ายต่ออัลลอฮ์อย่างเกินเหตุ",
                            "verse 72:5": "และแท้จริงเราคาดคิดว่า มนุษย์และญินจะไม่กล่าวเท็จต่ออัลลอฮ์เป็นอันขาด",
                            "verse 72:6": "และแท้จริงมนุษย์บางคนเคยขอความคุ้มครองจากญินบางคน ดังนั้นพวกเขา (มนุษย์) จึงทำให้พวกเขา (ญิน) เพิ่มการหยิ่งจองหองยิ่งขึ้น",
                            "verse 72:7": "และแท้จริงพวกเขา (มนุษย์) คาดคิดเช่นเดียวกับที่พวกท่าน (ญิน) คาดคิดว่าอัลลอฮ์ จะไม่ทรงแต่งตั้งผู้ใดขึ้น (เป็นร่อซู้ล)",
                            "verse 72:8": "และแท้จริงเราได้ค้นคว้าหาข่าว ณ ชั้นฟ้า แต่เราได้พบ ณ ที่นั่งเต็มไปด้วยยามเฝ้าผู้เข้มแข็งและเปลวเพลิง",
                            "verse 72:9": "และแท้จริงเราเคยนั่ง ณ สถานที่นั่งในท้องฟ้านั้นเพื่อฟัง แต่ขณะนี้ผู้ใดนั่งฟังเขาก็จะพบเปลวเพลิงถูกเตรียมไว้สำหรับเขา",
                            "verse 72:10": "และแท้จริงเราไม่รู้ดอกว่า ความชั่วร้ายนั้นจะถูกให้มีขึ้นแก่ผู้ที่อยู่ในแผ่นดินนี้ หรือว่าพระเจ้าของพวกเขาปรารถนาแนวทางที่ถูกต้องแก่พวกเขา",
                            "verse 72:11": "และแท้จริงในหมู่พวกเรานั้นมีคนดีและในหมู่พวกเราก็มีคนอื่นจากนั้น พวกเราอยู่ในแนวทางที่แตกต่างกัน",
                            "verse 72:12": "และแท้จริงเราคาดคิดว่า เราจะไม่รอดพ้นจาก (การลงโทษ) ของอัลลอฮ์ในแผ่นดินนี้ และเราจะหนีไม่รอดพ้นไปจากพระองค์",
                            "verse 72:13": "และแท้จริงเมื่อเราได้ยินอัลกุรอานเราก็ศรัทธาต่ออัลกุรอานนั้น ดังนั้นผู้ใดศรัทธาต่อพระเจ้าของเขา เขาก็จะไม่หวั่นเกรงต่อการขาดทุน และการอยุติธรรม",
                            "verse 72:14": "และแท้จริงในหมู่พวกเรามีผู้ที่เป็นมุสลิม และในหมู่พวกเรามีผู้อธรรม ดังนั้นผู้ใดนอบน้อม ชนเหล่านั้นพวกเขาได้มุ่งสู่แนวทางที่ถูกต้อง",
                            "verse 72:15": "และส่วนบรรดาผู้ที่หันห่างออกจากความจริง พวกเขาก็เป็นฟืนของไฟนรก",
                            "verse 72:16": "และหากพวกเขาธำรงมั่นอยู่บนแนวทางที่เที่ยงธรรม แน่นอนเราก็จะให้พวกเขามีริซกีกว้างขวาง",
                            "verse 72:17": "เพื่อเราจะทดสอบพวกเขาในเรื่องนี้ และผู้ใดหันห่างจากการรำลึกถึงพระเจ้าของเขา พระองค์จะให้เขาได้รับการลงโทษอันแสนสาหัส",
                            "verse 72:18": "และว่าแท้จริงบรรดามัสยิดนั้นเป็นของอัลลอฮ์ ดังนั้น พวกเจ้าอย่าวิงวอนขอผู้ใดเคียงคู่กับอัลลอฮ์",
                            "verse 72:19": "และว่าแท้จริงเมื่อบ่าวของอัลลอฮ์ (มุฮัมมัด) ยืนขึ้นกล่าววิงวอนขอต่อพระองค์พวกเขา (ญิน) ก็ได้ห้อมล้อมเขาอย่างหนาแน่น",
                            "verse 72:20": "จงกล่าวเถิดมุฮัมมัด ว่า แท้จริงฉันวิงวอนขอต่อพระเจ้าของฉัน และฉันจะมิตั้งผู้ใดเป็นภาคีต่อพระองค์",
                            "verse 72:21": "จงกล่าวเถิดมุฮัมมัดว่า แท้จริงฉันไม่มีอำนาจที่จะให้โทษและให้คุณแก่พวกท่าน",
                            "verse 72:22": "จงกล่าวเถิดมุฮัมมัดว่า ไม่มีผู้ใดจะคุ้มครองฉันให้พ้นจาก (การลงโทษของ) อัลลอฮ์ได้ และฉันจะไม่พบที่พึ่งอันใดอื่นจากพระองค์เลย",
                            "verse 72:23": "เว้นแต่ฉันจะเผยแผ่ (สิ่งที่รับ) จากอัลลอฮ์ และสาส์นของพระองค์ และผู้ใดฝ่าฝืนอัลลอฮ์ และร่อซู้ลของพระองค์แท้จริงสำหรับ เขานั้นคือไฟนรก เป็นผู้พำนักอยู่ในนั้นตลอดกาล",
                            "verse 72:24": "จนกระทั่งเมื่อพวกเขาได้เห็นสิ่งที่พวกเขาถูกสัญญาไว้ แล้วพวกเขาก็จะได้รู้ว่าใครเป็นผู้อ่อนแอยิ่งในการเป็นผู้ช่วยเหลือและมีจำนวนน้อยกว่า",
                            "verse 72:25": "จงกล่าวเถิดมุฮัมมัด ฉันไม่รู้สิ่งที่พวกท่านถูกสัญญาไว้นั้น หรือว่าพระเจ้าของฉันจะทรงกำหนดเวลาการลงโทษนั้นให้ห่างไกลออกไป",
                            "verse 72:26": "พระผู้ทรงรอบรู้สิ่งเร้นลับ ดังนั้นพระองค์จะไม่ทรงเปิดเผยสิ่งเร้นลับของพระองค์แก่ผู้ใด",
                            "verse 72:27": "นอกจากผู้ที่พระองค์ทรงยินดีเช่นร่อซู้ล ดังนั้นพระองค์จะทรงส่งผู้พิทักษ์เฝ้าดูแลข้างหน้าและข้างหลังเขา",
                            "verse 72:28": "เพื่อพระองค์จะทรงรู้ว่า แน่นอนพวกเขาได้เผยแผ่สาส์นของพระเจ้าของพวกเขาแล้ว และพระองค์ได้ทรงห้อมล้อม (รอบรู้) ทุกสิ่งที่อยู่ ณ ที่พวกเขา และพระองค์ทรงนับจำนวนทุก ๆ สิ่งไว้อย่างครบถ้วน"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 72:1": "Сен айт: «Менга ваҳий қилиндики, Албатта жинлардан (бир неча) нафари қулоқ осдилар ва дедилар: «Биз ажойиб Қуръонни эшитдик.",
                            "verse 72:2": "У тўғри йўлга ҳидоят қилур. Бас, биз унга иймон келтирдик ва ўз Роббимизга бировни ширк келтирмасмиз. (Жинлар ўз ақл-фаросатлари ила Қуръонни туширган Аллоҳ уларнинг Робилари эканлиги ва унга шерик бўлиши мумкин эмаслигини ҳам тушуниб етадилар. Макка мушрикларига ўхшаб Аллоҳга ширк келтирмасликларини таъкидлайдилар.)",
                            "verse 72:3": "Ва, албатта, Роббимизнинг азамати юксак бўлди. У ўзига хотин ва фарзанд тутгани йўқ!",
                            "verse 72:4": "Ва албатта эси пастимиз Аллоҳга ноҳақ гапларни айтарди.",
                            "verse 72:5": "Ва, албатта, биз, инс ҳам, жин ҳам Аллоҳга (нисбатан) ёлғон гапирмас, деб ўйлардик.",
                            "verse 72:6": "Албатта, инсдан баъзи кишилар, жинларнинг баъзи кишиларидан паноҳ сўрардилар. Бас, бу(жин)лар у(инс)ларнинг гуноҳ ва хорлигини зиёда қилдилар.",
                            "verse 72:7": "Ва албатта у(инс)лар худди сизлар гумон қилганингиздек, Аллоҳ бирор кишини ўлгандан сўнг тирилтирмас, деб гумон қилардилар.",
                            "verse 72:8": "Ва албатта биз осмонга (етишни) талаб қилдик. Бас, уни кучли қўриқчиларга ва учқунларга тўлган ҳолда кўрдик.",
                            "verse 72:9": "Ва, алабатта, биз у(осмон)да тинглашга қулай жойларга жойлашиб олар эдик. Энди эса, ким қулоқ солса, ўзини пойлаб турган учқунга дучор бўладир.",
                            "verse 72:10": "Ва, албатта, биз ер юзидагиларга ёмонлик ирода қилиндими ёки Роббилари уларга рушдни ирода қилдими-билмасмиз.",
                            "verse 72:11": "Ва, албатта, биздан солиҳлар ҳам ва бошқалар ҳам бор. Турли гуруҳлар бўлган эдик.",
                            "verse 72:12": "Ва, албатта, биз Аллоҳни ер юзида ожиз қолдира олмаслигимизга ва ундан қочиб қутила олмаслигимизга ишондик.",
                            "verse 72:13": "Ва, албатта, биз ҳидоятни эшитган пайтимизда унга иймон келтирдик. Кимки ўз Роббисига иймон келтирса, савоби озайиб қолишдан ҳам, унга оғир юк юкланишидан ҳам қўрқмас.",
                            "verse 72:14": "Ва, албатта, биздан мусулмонлар ва биздан адашганлар бор. Кимлар Исломга кирса, бас, улар ҳақ йўлни танлабдилар.",
                            "verse 72:15": "Ва, аммо, адашганлар, бас, жаҳаннамга ўтин бўлибдилар. (Оятда йўлдан адашганлар жаҳаннамга ёқилғи бўлишликлари ҳам аниқ, очиқ-ойдин айтилмоқда.)",
                            "verse 72:16": "Ва агар улар тўғри йўлда мустақим бўлсалар, албатта, Биз кўп сув ила суғорамиз.",
                            "verse 72:17": "У ила уларни синаш учун. Ва кимки ўз Роббиси зикридан юз ўригса, уни У зот қийин азобга соладир.",
                            "verse 72:18": "Ва, алабатта, масжидлар Аллоҳникидир. Бас, Аллоҳдан бошқага дуо қилманг. (Масжидлар Аллоҳга ибодат қилиш учун бино қилинган жойлардир, шунинг учун ҳам улар «Байтуллоҳ» –Аллоҳнинг уйи деб аталади. Бошқа дин вакиллари ўз ибодатхоналарида Аллоҳга ширк келтиришар, ягона Аллоҳдан ўзгага ҳам ибодат, дуо қилишарди. Аллоҳ таоло бу оятда Ўз Пайғамбари ва мўмин-мусулмонларни тавҳидга-фақат Аллоҳнинг Ўзига ибодат қилишга чақиради.)",
                            "verse 72:19": "Ва, албатта, Аллоҳнинг бандаси Унга ибодат қилиб турганда улар унинг атрофида от ёлидек тўпланиб, босиб юборай дейишди. (Бу оятда жинларнинг Пайғамбар алайҳиссалом ҳузурларига иккинчи бор келиб Қуръон эшитганлари пайти тасвирланяпти.)",
                            "verse 72:20": "Сен:«Албатта, мен фақат ўз Роббимга ибодат қиламан ва Унга ҳеч кимни ширк келтирмасман», деб айт.",
                            "verse 72:21": "Сен:«Албатта, мен сизлар учун зарарга ҳам, манфаатга ҳам молик эмасман»-деб айт.",
                            "verse 72:22": "Сен:«Албатта, мени ҳеч ким Аллоҳ(азоби)дан сақлаб қола олмас ва ҳаргиз Аллоҳдан ўзга пушти паноҳ топа олмасман.",
                            "verse 72:23": "Менинг вазифам, фақат, Аллоҳнинг топшириқларини етказишдир. Кимки Аллоҳга ва Унинг Пайғамбарига бўйсунмаса, унга жаҳаннам оташи бор, унда абадий қолажаклар.",
                            "verse 72:24": "Токи уларга ваъда қилинган нарсани кўрганларида, кимнинг ёрдамчиси заифу, кимнинг сони озлигини ҳам биларлар», деб айт.",
                            "verse 72:25": "Сен:«Сизларга ваъда қилинган нарса яқинми ёки Роббим унга узоқ муддат қилганми–билмайман.",
                            "verse 72:26": "У ғайбни билувчидир ва ҳеч кимни Ўз ғойбидан хабардор қилмайди.",
                            "verse 72:27": "Магар Ўзи рози бўлган Пайғамбарлар. Албатта Аллоҳ унинг олдидан ҳам, ортидан ҳам кузатиб юрувчи қўйиб қўядир.",
                            "verse 72:28": "Пайғамбарлар ўз Роббилари рисолаларини дарҳақиқат етказганликларини билиш учун ва Аллоҳ бандалар ҳузуридаги барча нарсани ихота қилиб олганлигини ва ҳамма нарсани адади, ҳисобини қилганлигини билиш учун», деб айт. (Пайғамбарлар муҳофазаси учун қўйилган фаришталар бир йўла, уларнинг Аллоҳнинг динини одамларга қандоқ етказаётганларига гувоҳ ҳам бўлиб турадилар. Аллоҳ ҳамма нарсани Ўз ихтиёрига олиб ўрагани, ҳамма нарсанинг ҳисоб-китобини қилиб туришига ҳам шоҳиддирлар.)"
                        }
                    }
                }
            }
        }
    }
}