{
    "id": 75,
    "name_simple": "Al-Qiyamah",
    "revelation_place": "makkah",
    "revelation_order": 31,
    "bismillah_pre": true,
    "verses_count": 40,
    "short_text": "The Surah has been so named after the word al-Qiyamah in the first verse. This is not only the name but also the title of this Surah, for it is devoted to Resurrection itself.",
    "text": [
        "\n",
        "The Surah has been so named after the word al-Qiyamah in the first verse. This is not only the name but also the title of this Surah, for it is devoted to Resurrection itself.",
        "\n",
        "Period of Revelation",
        "\n",
        "Although there is no tradition to indicate its period of revelation, yet there is in the subject matter of this Surah an internal evidence, which shows that it is one of the earliest Surahs to be sent down at Makkah. After verse 15 the discourse is suddenly interrupted and the Holy Prophet (upon whom be peace) told: \"Do not move your tongue to remember this Revelation hastily. It is Our responsibility to have it remembered and read. Therefore, when We are reciting it, listen to its recital carefully. Again, it is Our responsibility to explain its meaning.\" Then, from verse 20 onward the same theme which was interrupted at verse 15, is resumed. This parenthetical passage, according to both the context and the traditions, has been interposed here for the reason that when the Angel Gabriel was reciting this Surah to the Holy Prophet, the Holy Prophet, lest he should forget its words later, was repeating them at the same moment. This in fact happened at the time when the coming down\r\nand receipt of Revelation was yet a new experience for him and he was not yet fully used to receiving it calmly. There are two other instances also of this in the Qur'an. First, in Surah Ta Ha the Holy Prophet (upon whom be peace) has been told: \"And see that you do not hasten to recite the Qur'an before its revelation is completed to you.\" (v. 114). Then, in Surah Al-A'la, it has been said: \"We shall enable you to recite:, then you shall never forget. (v. 6). Later, when the Holy Prophet became fully used to receiving the Revelation well, there remained no need to give him any such instruction. That is why except for these, three, there is no other instance of this in the Qur'an.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Most of the Surahs, from here till the end of the Qur'an, in view of their content and style, seem to have been sent down in the period when after the first seven verses of Surah Al-Muddaththir, revelation of the Qur'an began like a shower of rain:Thus, in the successively revealed Surahs Islam and its fundamental concepts and moral teachings were presented so forcefully and effectively in pithy, brief sentences and the people of Makkah warned so vehemently on their errors and deviations that the Quraish chiefs were utterly confounded. Therefore, before the next Hajj season came they held the conference for devising schemes to defeat the Holy Prophet (upon whom be peace) as has been mentioned in the Introduction to the Surah Al-Muddaththir above.",
        "\n",
        "In this Surah, addressing thee deniers of the Hereafter, replies have been given to each of their doubts and objections, strong arguments have been given to prove the possibility, occurrence and necessity of the Resurrection and Hereafter, and also it has been pointed out clearly that the actual reason of the people's denying the Hereafter is not that they regard it as impossible rationally but because their selfish motives do not allow them to affirm it. At the same time, the people have been warned, as if to say: \"The event, the occurrence of which you deny, will inevitably come: all your deeds will be brought and placed before you. As a matter of fact, even before any of you sees his record, he will be knowing fully well what he has done in the world, for no man is unaware of himself, no matter what excuses and pretenses he may offer to deceive the world and deceive himself in respect of his misdeeds.\"",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that opens with the emphatic oath of the Divine One swearing by the looming day of Resurrection. It takes its name from verse 1, which mentions the Day of Resurrection. The surah dealing with the Day of Resurrection and man’s denial of that Day. God’s power is convincingly described in several vignettes (verse 3 ., verse 26 . and verse 34 .). The third paragraph instructs the Prophet on appropriate reception of the revelation (verse 16 .), and thereby serves to emphasize that the Quran is indeed God’s word.The surah is also known as: Day of Resurrection, The Rising.",
    "name_translation": "Resurrection",
    "name_complex": "Al-Qiyâmah",
    "surah_name_ar": "القيامة",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 75:1": "Betohem në Ditën e Kijametit",
                            "verse 75:2": "dhe betohem në shpirtin e atij që e qorton vetveten.",
                            "verse 75:3": "A mendon njeriu që nuk do të mund t’ia mbledhim eshtrat e tij?",
                            "verse 75:4": "Po si jo, Ne mundemi me ia bë majet e gishtave ashtu si i ka pasur.",
                            "verse 75:5": "Por, njeriu dëshiron të gabojë përderisa të jetë gjallë,",
                            "verse 75:6": "e pyet: “Kur do të jetë Dita e Kijametit?”",
                            "verse 75:7": "Kur syri (shikimi) të shqetësohet nga frika",
                            "verse 75:8": "dhe të zihet Hëna,",
                            "verse 75:9": "dhe Dielli e Hëna të bashkohen,",
                            "verse 75:10": "atë ditë njeriu, thërret: “Ku të ikim?”",
                            "verse 75:11": "Askund! S’ka strehim.",
                            "verse 75:12": "Atë ditë, strehimi është te Zoti yt,",
                            "verse 75:13": "atë ditë, njeriu informohet për veprat që i ka punuar, si dhe për ato që i ka lëshuar,",
                            "verse 75:14": "njeriu vetë do të dëshmojë kundër vetvetes,",
                            "verse 75:15": "madje – edhe në qoftë se i paraqet arsyetimet e veta, (ato nuk pranohen).",
                            "verse 75:16": "Mos nxito në të lexuarit e Kur’anit me gjunë tënde,",
                            "verse 75:17": "Ne, do t’i tubojmë pjesët e tij (Kur’ani), për ta lexuar atë (si është).",
                            "verse 75:18": "E, kur ta lexojë Xhebraili atë (Kur’anin), përcille ti leximin e tij,",
                            "verse 75:19": "e pastaj, Ne do ta shpjegojmë.",
                            "verse 75:20": "Po, me të vërtetë! Ju e doni këtë jetë,",
                            "verse 75:21": "kurse, për jetën tjetër nuk keni kujdes.",
                            "verse 75:22": "Atë ditë – disa fytyra do të shkëlqejnë,",
                            "verse 75:23": "në Zotin e tyre do të shikojnë;",
                            "verse 75:24": "atë ditë – disa fytyra janë të mrrolura,",
                            "verse 75:25": "e dinë që do t’i gjejë fatkeqësi e madhe.",
                            "verse 75:26": "E, shiko! Kur të vijë shpirti në fyt,",
                            "verse 75:27": "dhe thërret: “A ka shërues?”",
                            "verse 75:28": "dhe ai do të bindet se ai është çasti i ndarjes",
                            "verse 75:29": "dhe këmba me këmbën lidhen,",
                            "verse 75:30": "atë ditë do të sillet të Zoti yt:",
                            "verse 75:31": "“Ai nuk ka besuar dhe nuk është lutur (falë namaz),",
                            "verse 75:32": "por ka mohuar dhe është shmangë,",
                            "verse 75:33": "e pastaj ka shkuar te të afërmit (familja) e tij, duke u krenuar”.",
                            "verse 75:34": "Mjer për ty! Mjer për ty!",
                            "verse 75:35": "E, përsëri: Mjer për ty! Mjer për ty!",
                            "verse 75:36": "Vallë, a mendon njeriu se do të mbetet pa obligime (pa përgjegjësi)?",
                            "verse 75:37": "A s’ka qenë njeriu së pari pikë fare (sperme) që hudhet lehtë,",
                            "verse 75:38": "pastaj u bë gjak i doçkuar, nga i cili, Ai (Perëndia), e ka krijuar dhe e ka formur të plotë.",
                            "verse 75:39": "Dhe, prej tij i bëri çiftet: mashkullin e femrën,",
                            "verse 75:40": "e, vallë, Ai krijuesi, a nuk ka fuqi edhe t’i ngjallë të vdekurit?”"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "And içirəm qiyamət gününə;",
                            "verse 75:2": "And içirəm (günah etdiyi üçün, yaxud yaxşı əməli azdır deyə) özünü qınayan nəfsə! (Siz öləndən sonra mütləq diriləcəksiniz!)",
                            "verse 75:3": "Məgər insan elə güman edir ki, (qiyamət günü) onun sümüklərini bir yerə yığa bilməyəcəyik?!",
                            "verse 75:4": "Bəli, Biz onun barmaqlarını da (barmaq sümüklərini də, barmaqlarının uclarını da) düzəltməyə qadirik!",
                            "verse 75:5": "Lakin insan (bundan sonra da) önündəkini (qiyaməti) danmaq (pis işlər görmək) istəyər.",
                            "verse 75:6": "Və (istehza ilə): \"Qiyamət günü nə vaxt olacaqdır?\" - deyə soruşar.",
                            "verse 75:7": "Göz (heyrətdən) bərələcəyi;",
                            "verse 75:8": "Ay tutulacağı;",
                            "verse 75:9": "Günəşlə ay birləşəcəyi (hər ikisinin qərbdən çıxacağı, nurunun gedəcəyi) zaman -",
                            "verse 75:10": "Məhz o gün insan: \"Qaçıb can qurtarmağa yer haradadır?\" - deyəcəkdir.",
                            "verse 75:11": "Xeyr, (o gün) heç bir sığınacaq olmayacaqdır!",
                            "verse 75:12": "O gün (ey insan!) duracaq (pənah aparılacaq) yer ancaq Rəbbinin hüzurudur!",
                            "verse 75:13": "O gün insana öncə etdiyi və sonraya qoyduğu nə varsa (sağlığında dünyada gördüyü işlər və öləndən sonra qoyub getdiyi yaxşı, pis nə varsa, hamısı) xəbər veriləcəkdir!",
                            "verse 75:14": "Doğrusu, insan özü-özünə şahiddir!",
                            "verse 75:15": "O, hər cür üzrxahlıq etsə də, (qəbul olunmaz)!",
                            "verse 75:16": "(Ya Peyğəmbər! Cəbrail sənə Qur'an oxuduğu zaman) onu tələm-tələsik əzbərləmək üçün dilini tərpətmə! (Sən də onunla birlikdə Qur'anı təkrar etmə, yalnız dinlə!)",
                            "verse 75:17": "Cünki onu (sənin qəlbində) cəm etmək, (dilində) oxutmaq Bizə aiddir.",
                            "verse 75:18": "Biz onu (Cəbrailin dili ilə) oxutduğumuz zaman oxunmasını diqqətlə dinlə.",
                            "verse 75:19": "Sonra onu (sənə) bəyan etmək də Bizə aiddir!",
                            "verse 75:20": "Xeyr, xeyr! Siz tez keçib gedəni (fani dünyanı) sevirsiniz.",
                            "verse 75:21": "Axirəti isə tərk edirsiniz.",
                            "verse 75:22": "O gün neçə-neçə üzlər sevinib güləcək,",
                            "verse 75:23": "?z Rəbbinə baxacaqdır!",
                            "verse 75:24": "O gün neçə-neçə üzlər tutulub qaralacaq,",
                            "verse 75:25": "(Sahiblərinin) bel sümüklərinin (dəhşətli bir əzabla) qırılacağını anlayacaqdır!",
                            "verse 75:26": "Xeyr, (can) boğaza (körpücük sümüklərinə) gəlib yetişəcəyi,",
                            "verse 75:27": "\"(Onu bu bəladan) kim xilas edə bilər?\" - deyiləcəyi,",
                            "verse 75:28": "(Can üstə olan kimsə) ayrılıq dəminin gəlib çatdığını anlayacağı,",
                            "verse 75:29": "Və (ölüm qorxusundan) qıçı-qıçına dolaşacağı zaman,",
                            "verse 75:30": "Aparılacağı yer Rəbbinin hüzuru olacaqdır (ey insan)!",
                            "verse 75:31": "Beləliklə, o (kafir Əbu Cəhl) nə (Qur'anı) təsdiq etdi, nə də namaz qıldı.",
                            "verse 75:32": "Amma (Allah kəlamını) yalan saydı, (ondan) üz döndərdi.",
                            "verse 75:33": "Sonra da özünü darta-darta ailəsinin yanına getdi.",
                            "verse 75:34": "Vay sənin halına, vay!",
                            "verse 75:35": "Yenə də vay sənin halına, vay!",
                            "verse 75:36": "Məgər insan elə güman edir ki, o, başlı-başına (cəzasız) buraxılacaq?!",
                            "verse 75:37": "Məgər o tökülən bir qətrə nütfə deyildimi?!",
                            "verse 75:38": "Sonra laxtalanmış qan oldu və (Allah) onu yaradıb surət verdi (insan şəklinə saldı).",
                            "verse 75:39": "Sonra da ondan biri kişi, biri qadın olmaqla iki cift (həmtay) yaratdı.",
                            "verse 75:40": "Elə isə O Allah ölüləri diriltməyə qadir deyildirmi?!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "Kunem se Danom kada Smak svijeta nastupi",
                            "verse 75:2": "i kunem se dušom koja sebe kori.",
                            "verse 75:3": "Zar čovjek misli da kosti njegove nećemo sakupiti?",
                            "verse 75:4": "Hoćemo, Mi možemo stvoriti jagodice prsta njegovih ponovo.",
                            "verse 75:5": "Ali, čovjek hoće dok je živ da griješi,",
                            "verse 75:6": "pa pita: \"Kada će Smak svijeta biti?\"",
                            "verse 75:7": "Kad se pogled od straha ukoči",
                            "verse 75:8": "i Mjesec pomrači",
                            "verse 75:9": "i Sunce i Mjesec spoje -",
                            "verse 75:10": "tog dana čovjek će povikati: \"Kuda da se bježi?\"",
                            "verse 75:11": "Nikuda! Utočišta nema.",
                            "verse 75:12": "Toga dana biće Gospodaru tvome prepušten,",
                            "verse 75:13": "toga dana čovjek će o onome što je pripremio, a što propustio obaviješten biti,",
                            "verse 75:14": "sam čovjek će protiv sebe svjedočiti,",
                            "verse 75:15": "uzalud će mu biti što će opravdanja svoja iznositi.",
                            "verse 75:16": "Ne izgovaraj Kur’an",
                            "verse 75:17": "Mi smo dužni da ga saberemo da bi ga ti čitao.",
                            "verse 75:18": "A kada ga čitamo, ti prati čitanje njegovo,",
                            "verse 75:19": "a poslije, Mi smo dužni da ga objasnimo.",
                            "verse 75:20": "Uistinu, vi ovaj prolazni svijet volite,",
                            "verse 75:21": "a o onom drugom brigu ne vodite.",
                            "verse 75:22": "Toga dana će neka lica blistava biti,",
                            "verse 75:23": "u Gospodara svoga će gledati;",
                            "verse 75:24": "toga dana će neka lica smrknuta biti,",
                            "verse 75:25": "tešku nevolju će očekivati.",
                            "verse 75:26": "Pazi! Kada duša dopre do ključnih kosti,",
                            "verse 75:27": "i vikne se: \"Ima li vidara?\",",
                            "verse 75:28": "i on se uvjeri da je to čas rastanka",
                            "verse 75:29": "i noga se uz nogu savije,",
                            "verse 75:30": "toga dana će Gospodaru tvome priveden biti:",
                            "verse 75:31": "Nije vjerovao, nije molitvu obavljao,",
                            "verse 75:32": "nego je poricao i leđa okretao,",
                            "verse 75:33": "a onda svojima bahato odlazio.\"",
                            "verse 75:34": "Teško tebi! Teško tebi!",
                            "verse 75:35": "I još jednom: Teško tebi! Teško tebi!",
                            "verse 75:36": "Zar čovjek misli da će sam sebi prepušten biti, da neće odgovarati?",
                            "verse 75:37": "Zar nije bio kap sjemena koja se ubaci,",
                            "verse 75:38": "zatim ugrušak kome On onda razmjer odredi i skladnim mu lik učini,",
                            "verse 75:39": "i od njega onda dvije vrste, muškarca i ženu, stvori,",
                            "verse 75:40": "i zar Taj nije kadar mrtve oživiti?"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "আমি শপথ করি কেয়ামত দিবসের,",
                            "verse 75:2": "আরও শপথ করি সেই মনের, যে নিজেকে ধিক্কার দেয়-",
                            "verse 75:3": "মানুষ কি মনে করে যে আমি তার অস্থিসমূহ একত্রিত করব না?",
                            "verse 75:4": "পরন্ত আমি তার অংগুলিগুলো পর্যন্ত সঠিকভাবে সন্নিবেশিত করতে সক্ষম।",
                            "verse 75:5": "বরং মানুষ তার ভবিষ্যত জীবনেও ধৃষ্টতা করতে চায়",
                            "verse 75:6": "সে প্রশ্ন করে-কেয়ামত দিবস কবে?",
                            "verse 75:7": "যখন দৃষ্টি চমকে যাবে,",
                            "verse 75:8": "চন্দ্র জ্যোতিহীন হয়ে যাবে।",
                            "verse 75:9": "এবং সূর্য ও চন্দ্রকে একত্রিত করা হবে-",
                            "verse 75:10": "সে দিন মানুষ বলবেঃ পলায়নের জায়গা কোথায় ?",
                            "verse 75:11": "না কোথাও আশ্রয়স্থল নেই।",
                            "verse 75:12": "আপনার পালনকর্তার কাছেই সেদিন ঠাঁই হবে।",
                            "verse 75:13": "সেদিন মানুষকে অবহিত করা হবে সে যা সামনে প্রেরণ করেছে ও পশ্চাতে ছেড়ে দিয়েছে।",
                            "verse 75:14": "বরং মানুষ নিজেই তার নিজের সম্পর্কে চক্ষুমান।",
                            "verse 75:15": "যদিও সে তার অজুহাত পেশ করতে চাইবে।",
                            "verse 75:16": "তাড়াতাড়ি শিখে নেয়ার জন্যে আপনি দ্রুত ওহী আবৃত্তি করবেন না।",
                            "verse 75:17": "এর সংরক্ষণ ও পাঠ আমারই দায়িত্ব।",
                            "verse 75:18": "অতঃপর আমি যখন তা পাঠ করি, তখন আপনি সেই পাঠের অনুসরণ করুন।",
                            "verse 75:19": "এরপর বিশদ বর্ণনা আমারই দায়িত্ব।",
                            "verse 75:20": "কখনও না, বরং তোমরা পার্থিব জীবনকে ভালবাস",
                            "verse 75:21": "এবং পরকালকে উপেক্ষা কর।",
                            "verse 75:22": "সেদিন অনেক মুখমন্ডল উজ্জ্বল হবে।",
                            "verse 75:23": "তারা তার পালনকর্তার দিকে তাকিয়ে থাকবে।",
                            "verse 75:24": "আর অনেক মুখমন্ডল সেদিন উদাস হয়ে পড়বে।",
                            "verse 75:25": "তারা ধারণা করবে যে, তাদের সাথে কোমর-ভাঙ্গা আচরণ করা হবে।",
                            "verse 75:26": "কখনও না, যখন প্রাণ কন্ঠাগত হবে।",
                            "verse 75:27": "এবং বলা হবে, কে ঝাড়বে",
                            "verse 75:28": "এবং সে মনে করবে যে, বিদায়ের ক্ষণ এসে গেছে।",
                            "verse 75:29": "এবং গোছা গোছার সাথে জড়িত হয়ে যাবে।",
                            "verse 75:30": "সেদিন, আপনার পালনকর্তার নিকট সবকিছু নীত হবে।",
                            "verse 75:31": "সে বিশ্বাস করেনি এবং নামায পড়েনি;",
                            "verse 75:32": "পরন্ত মিথ্যারোপ করেছে ও পৃষ্ঠ প্রদর্শন করেছে।",
                            "verse 75:33": "অতঃপর সে দম্ভভরে পরিবার-পরিজনের নিকট ফিরে গিয়েছে।",
                            "verse 75:34": "তোমার দুর্ভোগের উপর দুর্ভোগ।",
                            "verse 75:35": "অতঃপর, তোমার দুর্ভোগের উপর দূর্ভোগ।",
                            "verse 75:36": "মানুষ কি মনে করে যে, তাকে এমনি ছেড়ে দেয়া হবে?",
                            "verse 75:37": "সে কি স্খলিত বীর্য ছিল না?",
                            "verse 75:38": "অতঃপর সে ছিল রক্তপিন্ড, অতঃপর আল্লাহ তাকে সৃষ্টি করেছেন এবং সুবিন্যস্ত করেছেন।",
                            "verse 75:39": "অতঃপর তা থেকে সৃষ্টি করেছেন যুগল নর ও নারী।",
                            "verse 75:40": "তবুও কি সেই আল্লাহ মৃতদেরকে জীবিত করতে সক্ষম নন?"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 75:1": "Кълна се в Деня на възкресението.",
                            "verse 75:2": "И кълна се в многоукоряващата [се] душа.",
                            "verse 75:3": "Нима човек смята, че Ние не ще съберем костите му?",
                            "verse 75:4": "Наистина Ние можем да възстановим и върховете на пръстите му.",
                            "verse 75:5": "Ала човек упорства в греха си",
                            "verse 75:6": "и пита: Кога е Денят на възкресението?",
                            "verse 75:7": "Тогава, когато погледът се заслепи",
                            "verse 75:8": "и луната се затъмни,",
                            "verse 75:9": "и слънцето, и луната се слеят,",
                            "verse 75:10": "човекът ще каже в този Ден: Накъде да се бяга?",
                            "verse 75:11": "Ала не! Няма убежище.",
                            "verse 75:12": "При твоя Господ в този Ден е местопребиванието.",
                            "verse 75:13": "Човекът в този Ден ще бъде известен за ранните си дела и за късните.",
                            "verse 75:14": "Да, човекът сам за себе си ще е свидетел,",
                            "verse 75:15": "дори да дава извинения.",
                            "verse 75:16": "Не си движи езика с това Слово [о, Мухаммад], за да избързаш [да го запомниш]!",
                            "verse 75:17": "Да бъде събрано [в твоите гърди] и четено [от теб] е Наша грижа.",
                            "verse 75:18": "И когато го четем, следвай неговото четене!",
                            "verse 75:19": "После неговото разясняване е Наша грижа.",
                            "verse 75:20": "Ала не! Вие обичате преходността [на земния живот]",
                            "verse 75:21": "и изоставяте отвъдния.",
                            "verse 75:22": "Едни лица в този Ден ще възсияят,",
                            "verse 75:23": "към своя Господ ще гледат,",
                            "verse 75:24": "а други в този Ден ще бъдат мрачни,",
                            "verse 75:25": "ще се убедят, че ги е сполетяла беда, пречупваща гръбнака.",
                            "verse 75:26": "А когато душата стигне гръкляна",
                            "verse 75:27": "и се рече: Кой ще те избави?,",
                            "verse 75:28": "и той се убеди, че [това] е раздялата,",
                            "verse 75:29": "и се преплете крак с крак -",
                            "verse 75:30": "тогава към твоя Господ ще е отправянето.",
                            "verse 75:31": "тогава към твоя Господ ще е отправянето.",
                            "verse 75:32": "Той нито вярваше, нито отслужваше молитвата,",
                            "verse 75:33": "а отричаше и се отвръщаше.",
                            "verse 75:34": "После отиваше при своите хора с горделива походка.",
                            "verse 75:35": "Горко ти, горко!",
                            "verse 75:36": "И отново - горко ти, горко!",
                            "verse 75:37": "Нима човек смята, че ще бъде оставен без надзор?",
                            "verse 75:38": "После бе съсирек, а Той го сътвори и осъразмери.",
                            "verse 75:39": "И създаде от нея двата пола - мъжа и жената.",
                            "verse 75:40": "Нима Той не е способен да съживи мъртвите?"
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "我以復活日盟誓，",
                            "verse 75:2": "我以自責的靈魂盟誓，",
                            "verse 75:3": "難道人猜想我絕不能集合他的骸骨嗎？",
                            "verse 75:4": "不然，（我將集合他的骸骨），而且能使他的每個手指復原。",
                            "verse 75:5": "不然，人欲長此放蕩下去。",
                            "verse 75:6": "他問復活日在甚麼時候。",
                            "verse 75:7": "當眼目昏花，",
                            "verse 75:8": "月亮昏暗，",
                            "verse 75:9": "日月相合的時候，",
                            "verse 75:10": "在那日，人將說：「逃到哪裡去呢？」",
                            "verse 75:11": "絕不然，絕無任何避難所。",
                            "verse 75:12": "在那日，唯你的主那裡，有安定之所。",
                            "verse 75:13": "在那日，各人將被告知自己前前後後做過的事情。",
                            "verse 75:14": "不然，各人對自己就是明証，",
                            "verse 75:15": "即使他多方托辭。",
                            "verse 75:16": "你不要搖動你的舌頭，以便你倉卒地誦讀它。",
                            "verse 75:17": "集合它和誦讀它，確是我的責任。",
                            "verse 75:18": "當我誦讀它的時候，你當靜聽我的誦讀。",
                            "verse 75:19": "然後解釋它，也是我的責任。",
                            "verse 75:20": "真的，你們喜愛現世的生活，",
                            "verse 75:21": "而不顧後世的生活。",
                            "verse 75:22": "而不顧後世的生活。",
                            "verse 75:23": "是仰視著他們的主的。",
                            "verse 75:24": "在那日，許多面目是愁苦的，",
                            "verse 75:25": "他們確信自己必遭大難。",
                            "verse 75:26": "真的，靈魂達到鎖骨，",
                            "verse 75:27": "有人說：「誰是祝由的？」",
                            "verse 75:28": "他確信那是離別。",
                            "verse 75:29": "（死時）脛與脛相纏結。",
                            "verse 75:30": "在那日，他只被驅趕到你的主那裡。",
                            "verse 75:31": "他沒有信道，也沒有禮拜。",
                            "verse 75:32": "他否認真理，背棄正道，",
                            "verse 75:33": "然後傲慢地走回家去。",
                            "verse 75:34": "「毀滅已逐漸地臨近你。",
                            "verse 75:35": "毀滅已逐漸地臨近你。」",
                            "verse 75:36": "難道人猜想自己是被放任的嗎？",
                            "verse 75:37": "難道他不曾是被射出精液嗎？",
                            "verse 75:38": "然後，他變成血塊，而真主加以創造他，使之成為肢體完全的人嗎？",
                            "verse 75:39": "他用精液造化兩性，男的和女的。",
                            "verse 75:40": "難道那樣的造化者不能使死人復活嗎？"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "Hle, přísahám při dni zmrtvýchvstání",
                            "verse 75:2": "a při duši, jež stálé výčitky si činí!",
                            "verse 75:3": "Myslí si člověk snad, že neshromáždíme jeho kosti?",
                            "verse 75:4": "Však ano, a dokonce schopni jsme sestavit jeho prsty!",
                            "verse 75:5": "A naopak, člověk si spíše přeje jednat i dál hříšně",
                            "verse 75:6": "a ptá se: \"Kdy vůbec ten den zmrtvýchvstání nastane?\"",
                            "verse 75:7": "Až zrak se oslepí,",
                            "verse 75:8": "až měsíc se zatmí,",
                            "verse 75:9": "až slunce s měsícem se spojí,",
                            "verse 75:10": "tehdy člověk vykřikne: \"Kam prchnout mám?\"",
                            "verse 75:11": "Však pozor! Nebude žádný úkryt znám,",
                            "verse 75:12": "u Pána tvého v ten den bude shromaždiště jen!",
                            "verse 75:13": "V ten den bude člověku sděleno, co zavčas učinil a co zameškal.",
                            "verse 75:14": "Ba co víc, člověk sám sebe bude jasně zřít,",
                            "verse 75:15": "a kdyby své omluvy mohl předložit...",
                            "verse 75:16": "Nehýbej příliš jazykem svým, když je přednášíš, ve snaze je uspíšit,",
                            "verse 75:17": "vždyť Nám přísluší je shromáždit i číst.",
                            "verse 75:18": "A když ti je předčítáme, sleduj jeho přednášení,",
                            "verse 75:19": "a potom na Nás je podat jeho objasnění.",
                            "verse 75:20": "Však pozor! Vy naopak milujete rychle plynoucí",
                            "verse 75:21": "a zanedbáváte život budoucí.",
                            "verse 75:22": "V ten den budou jedny tváře zářící",
                            "verse 75:23": "a ke svému Pánu hledící",
                            "verse 75:24": "a jiné tváře v ten den budou sinalé, tušící,",
                            "verse 75:25": "že dovrší se na nich trest páteř lámající.",
                            "verse 75:26": "Však pozor! Až duše vystoupí ke klíční kosti",
                            "verse 75:27": "a bude řečeno: \"Kdo je zaklínatel?\"",
                            "verse 75:28": "a ona si pomyslí, že toto je se světem rozluka,",
                            "verse 75:29": "a proplete se s nohou noha,",
                            "verse 75:30": "v ten den k tvému Pánu všichni hnáni budou.",
                            "verse 75:31": "On almužnu nedával ani modlitbu nekonal,",
                            "verse 75:32": "však odvracel se a za lež prohlašoval,",
                            "verse 75:33": "a pak ke své rodině pyšně kráčeje se odebral!\"",
                            "verse 75:34": "Ach běda ti, běda!",
                            "verse 75:35": "A znovu běda ti, běda!",
                            "verse 75:36": "Myslí si člověk snad, že sám sobě bude zůstaven?",
                            "verse 75:37": "Což nebyl kapkou semene vystříknutého jen?",
                            "verse 75:38": "Potom se kapkou přilnavou stal a Bůh jej stvořil a vyrovnal",
                            "verse 75:39": "a dvě pohlaví, mužské a ženské, z něho udělal.",
                            "verse 75:40": "Což není v moci jeho, aby mrtvým opět život dal?"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "Neen! Ik roep de Dag der Opstanding tot getuige.",
                            "verse 75:2": "Neen! Ik roep de zichzelf beschuldigende ziel tot getuige.",
                            "verse 75:3": "Denkt de mens dat Wij zijn beenderen niet kunnen verzamelen?",
                            "verse 75:4": "Zeker; Wij hebben de macht hem te herstellen tot in zijn vingertoppen.",
                            "verse 75:5": "Maar de mens wenst in ’t vervolg slecht te handelen.",
                            "verse 75:6": "Hij vraagt: \"Wanneer is de Dag der Opstanding?\"",
                            "verse 75:7": "Maar als het oog verblind wordt,",
                            "verse 75:8": "En de maan verduisterd zal zijn,",
                            "verse 75:9": "En de zon en de maan zullen samen gebracht worden,",
                            "verse 75:10": "Op die Dag zal de mens zeggen: \"Waarheen te vluchten?\"",
                            "verse 75:11": "Neen! Geen schuilplaats!",
                            "verse 75:12": "Slechts bij uw Heer zal dan uw toevlucht zijn.",
                            "verse 75:13": "De mens zal op die Dag worden onderricht over hetgeen hij vooruitzond of achterliet.",
                            "verse 75:14": "Neen, de mens is een bewijs tegen zichzelf.",
                            "verse 75:15": "Zelfs al biedt hij (zijn) verontschuldigingen aan.",
                            "verse 75:16": "Beweeg uw tong er niet mede om deze (woorden) haastig (opte nemen!)",
                            "verse 75:17": "Het verzamelen en het verkondigen er van rust op Ons.",
                            "verse 75:18": "Wanneer Wij dus (de Openbaring) verkondigd hebben volg dan de verkondiging.",
                            "verse 75:19": "Daarna rust de verklaring er van op Ons.",
                            "verse 75:20": "Neen, maar gij (mensen) hebt dit leven lief.",
                            "verse 75:21": "En gij geeft het Hiernamaals prijs.",
                            "verse 75:22": "Op die Dag zullen sommige gezichten verlicht zijn,",
                            "verse 75:23": "Opziende naar hun Heer;",
                            "verse 75:24": "En andere gezichten zullen op die Dag somber zijn.",
                            "verse 75:25": "Wetende dat een vreselijke ramp hen spoedig zal overkomen.",
                            "verse 75:26": "Ja! Als de ziel van de stervende tot de keel zal opstijgen,",
                            "verse 75:27": "En er zal worden gezegd: \"Wie is de geneesheer?\"",
                            "verse 75:28": "Dan weet hij dat hij scheiden moet.",
                            "verse 75:29": "En wrijft (in doodsangst) het ene been tegen het andere.",
                            "verse 75:30": "Dan wordt (hij) tot uw Heer gedreven,",
                            "verse 75:31": "Want hij (mens) nam de Waarheid niet aan, noch bad hij.",
                            "verse 75:32": "Doch hij verloochende (de profeet) en wendde zich af.",
                            "verse 75:33": "Dan ging hij trots naar zijn familie terug.",
                            "verse 75:34": "\"Wee u! Wee dus over u.\"",
                            "verse 75:35": "\"Wee u nogmaals en nog eens wee!\"",
                            "verse 75:36": "Denkt de mens dat hij zonder doel zal worden gelaten?",
                            "verse 75:37": "Was hij niet een kleine levenskiem die werd uitgestort?",
                            "verse 75:38": "Dan werd hij een klonter bloed daarna schiep en vervolmaakte Hij hem.",
                            "verse 75:39": "Daarvan (de kiem) maakt Hij een paar, man en vrouw.",
                            "verse 75:40": "Is Hij dan niet bij machte de doden te doen herleven?"
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 75:1": "Nay, I swear by the Day of Resurrection;",
                            "verse 75:2": "Nay, I swear by the accusing soul (that this Scripture is true).",
                            "verse 75:3": "Thinketh man that We shall not assemble his bones ?",
                            "verse 75:4": "Yea, verily. We are Able to restore his very fingers!",
                            "verse 75:5": "But man would fain deny what is before him.",
                            "verse 75:6": "He asketh: When will be this Day of Resurrection ?",
                            "verse 75:7": "But when sight is confounded",
                            "verse 75:8": "And the moon is eclipsed",
                            "verse 75:9": "And sun and moon are united,",
                            "verse 75:10": "On that day man will cry: Whither to flee!",
                            "verse 75:11": "Alas! No refuge!",
                            "verse 75:12": "Unto thy Lord is the recourse that day.",
                            "verse 75:13": "On that day man is told the tale of that which he hath sent before and left behind.",
                            "verse 75:14": "Oh, but man is a telling witness against himself,",
                            "verse 75:15": "Although he tender his excuses.",
                            "verse 75:16": "Stir not thy tongue herewith to hasten it.",
                            "verse 75:17": "Lo! upon Us (resteth) the putting together thereof and the reading thereof.",
                            "verse 75:18": "And when We read it, follow thou the reading;",
                            "verse 75:19": "Then lo! upon Us (resteth) the explanation thereof.",
                            "verse 75:20": "Nay, but ye do love the fleeting Now",
                            "verse 75:21": "And neglect the Hereafter.",
                            "verse 75:22": "That day will faces be resplendent,",
                            "verse 75:23": "Looking toward their Lord;",
                            "verse 75:24": "And that day will other faces be despondent,",
                            "verse 75:25": "Thou wilt know that some great disaster is about to fall on them.",
                            "verse 75:26": "Nay, but when the life cometh up to the throat",
                            "verse 75:27": "And men say: Where is the wizard (who can save him now) ?",
                            "verse 75:28": "And he knoweth that it is the parting;",
                            "verse 75:29": "And agony is heaped on agony;",
                            "verse 75:30": "Unto thy Lord that day will be the driving.",
                            "verse 75:31": "For he neither trusted, nor prayed.",
                            "verse 75:32": "But he denied and flouted.",
                            "verse 75:33": "Then went he to his folk with glee.",
                            "verse 75:34": "Nearer unto thee and nearer,",
                            "verse 75:35": "Again nearer unto thee and nearer (is the doom).",
                            "verse 75:36": "Thinketh man that he is to be left aimless ?",
                            "verse 75:37": "Was he not a drop of fluid which gushed forth ?",
                            "verse 75:38": "Then he became a clot; then (Allah) shaped and fashioned",
                            "verse 75:39": "And made of him a pair, the male and female.",
                            "verse 75:40": "Is not He (Who doeth so) Able to bring the dead to life ?"
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 75:1": "I do call to witness the Resurrection Day;",
                            "verse 75:2": "And I do call to witness the self-reproaching spirit: (Eschew Evil).",
                            "verse 75:3": "Does man think that We cannot assemble his bones?",
                            "verse 75:4": "Nay, We are able to put together in perfect order the very tips of his fingers.",
                            "verse 75:5": "But man wishes to do wrong (even) in the time in front of him.",
                            "verse 75:6": "He questions: \"When is the Day of Resurrection?\"",
                            "verse 75:7": "At length, when the sight is dazed,",
                            "verse 75:8": "And the moon is buried in darkness.",
                            "verse 75:9": "And the sun and moon are joined together,-",
                            "verse 75:10": "That Day will Man say: \"Where is the refuge?\"",
                            "verse 75:11": "By no means! No place of safety!",
                            "verse 75:12": "Before thy Lord (alone), that Day will be the place of rest.",
                            "verse 75:13": "That Day will Man be told (all) that he put forward, and all that he put back.",
                            "verse 75:14": "Nay, man will be evidence against himself,",
                            "verse 75:15": "Even though he were to put up his excuses.",
                            "verse 75:16": "Move not thy tongue concerning the (Qur’an) to make haste therewith.",
                            "verse 75:17": "It is for Us to collect it and to promulgate it:",
                            "verse 75:18": "But when We have promulgated it, follow thou its recital (as promulgated):",
                            "verse 75:19": "Nay more, it is for Us to explain it (and make it clear):",
                            "verse 75:20": "Nay, (ye men!) but ye love the fleeting life,",
                            "verse 75:21": "And leave alone the Hereafter.",
                            "verse 75:22": "Some faces, that Day, will beam (in brightness and beauty);-",
                            "verse 75:23": "Looking towards their Lord;",
                            "verse 75:24": "And some faces, that Day, will be sad and dismal,",
                            "verse 75:25": "In the thought that some back-breaking calamity was about to be inflicted on them;",
                            "verse 75:26": "Yea, when (the soul) reaches to the collar-bone (in its exit),",
                            "verse 75:27": "And there will be a cry, \"Who is a magician (to restore him)?\"",
                            "verse 75:28": "And he will conclude that it was (the Time) of Parting;",
                            "verse 75:29": "And one leg will be joined with another:",
                            "verse 75:30": "That Day the Drive will be (all) to thy Lord!",
                            "verse 75:31": "So he gave nothing in charity, nor did he pray!-",
                            "verse 75:32": "But on the contrary, he rejected Truth and turned away!",
                            "verse 75:33": "Then did he stalk to his family in full conceit!",
                            "verse 75:34": "Woe to thee, (O men!), yea, woe!",
                            "verse 75:35": "Again, Woe to thee, (O men!), yea, woe!",
                            "verse 75:36": "Does man think that he will be left uncontrolled, (without purpose)?",
                            "verse 75:37": "Was he not a drop of sperm emitted (in lowly form)?",
                            "verse 75:38": "Then did he become a leech-like clot; then did (God) make and fashion (him) in due proportion.",
                            "verse 75:39": "And of him He made two sexes, male and female.",
                            "verse 75:40": "Has not He, (the same), the power to give life to the dead?"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 75:1": "No! I swear by the Day of Resurrection.",
                            "verse 75:2": "No! I swear by the reproachful soul.",
                            "verse 75:3": "What, does man reckon We shall not gather his bones?",
                            "verse 75:4": "Yes indeed; We are able to shape again his fingers.",
                            "verse 75:5": "Nay, but man desires to continue on as a libertine,",
                            "verse 75:6": "asking, ’When shall be the Day of Resurrection?’",
                            "verse 75:7": "But when the sight is dazed",
                            "verse 75:8": "and the moon is eclipsed,",
                            "verse 75:9": "and the sun and moon are brought together,",
                            "verse 75:10": "upon that day man shall say, ’Whither to flee?’",
                            "verse 75:11": "No indeed; not a refuge!",
                            "verse 75:12": "Upon that day the recourse shall be to thy Lord.",
                            "verse 75:13": "Upon that day man shall be told his former deeds and his latter;",
                            "verse 75:14": "nay, man shall be a clear proof against himself,",
                            "verse 75:15": "even though he offer his excuses.",
                            "verse 75:16": "Move not thy tongue with it to hasten it;",
                            "verse 75:17": "Ours it is to gather it, and to recite it.",
                            "verse 75:18": "So, when We recite it, follow thou its recitation.",
                            "verse 75:19": "Then Ours it is to explain it.",
                            "verse 75:20": "No indeed; but you love the hasty world,",
                            "verse 75:21": "and leave be the Hereafter.",
                            "verse 75:22": "Upon that day faces shall be radiant,",
                            "verse 75:23": "gazing upon their Lord;",
                            "verse 75:24": "and upon that day faces shall be scowling,",
                            "verse 75:25": "thou mightest think the Calamity has been wreaked on them.",
                            "verse 75:26": "No indeed; when it reaches the clavicles",
                            "verse 75:27": "and it is said, ’Who is an enchanter?’",
                            "verse 75:28": "and he thinks that it is the parting",
                            "verse 75:29": "and leg is intertwined with leg,",
                            "verse 75:30": "upon that day unto thy Lord shall be the driving.",
                            "verse 75:31": "For he confirmed it not, and did not pray,",
                            "verse 75:32": "but he cried it lies, and he turned away,",
                            "verse 75:33": "then he went to his household arrogantly.",
                            "verse 75:34": "Nearer to thee and nearer",
                            "verse 75:35": "then nearer to thee and nearer!",
                            "verse 75:36": "What, does man reckon he shall be left to roam at will?",
                            "verse 75:37": "Was he not a sperm-drop spilled?",
                            "verse 75:38": "Then he was a blood-clot, and He created and formed,",
                            "verse 75:39": "and He made of him two kinds, male and female.",
                            "verse 75:40": "What, is He not able to quicken the dead?"
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 75:1": "NAY! I call to witness the Day of Resurrection!",
                            "verse 75:2": "But nay! I call to witness the accusing voice of man’s own conscience!",
                            "verse 75:3": "Does man think that We cannot [resurrect him and] bring his bones together again?",
                            "verse 75:4": "Yea indeed, We are able to make whole his very finger-tips!",
                            "verse 75:5": "None the less, man chooses to deny what lies ahead of him,",
                            "verse 75:6": "asking [derisively], \"When is that Resurrection Day to be?\"",
                            "verse 75:7": "But [on that Day,] when the eyesight is by fear confounded,",
                            "verse 75:8": "and the moon is darkened,",
                            "verse 75:9": "and the sun and the moon are brought together –",
                            "verse 75:10": "on that Day will man exclaim, \"Whither to flee?\"",
                            "verse 75:11": "But nay: no refuge [for thee, O man]!",
                            "verse 75:12": "With thy Sustainer, on that Day, the journey’s end will be!",
                            "verse 75:13": "Man will be apprised, on that Day, of what he has done and what he has left undone:",
                            "verse 75:14": "nay, but man shall against himself be an eye-witness,",
                            "verse 75:15": "even though he may veil himself in excuses.",
                            "verse 75:16": "MOVE NOT thy tongue in haste, [repeating the words of the revelation:]",
                            "verse 75:17": "for, behold, it is for Us to gather it [in thy heart,] and to cause it to be read [as it ought to be read].",
                            "verse 75:18": "Thus, when We recite it, follow thou its wording [with all thy mind]:",
                            "verse 75:19": "and then, behold, it will be for Us to make its meaning clear.",
                            "verse 75:20": "NAY, but [most of] you love this fleeting life,",
                            "verse 75:21": "and give no thought to the life to come [and to Judgment Day]!",
                            "verse 75:22": "Some faces will on that Day be bright with happiness,",
                            "verse 75:23": "looking up to their Sustainer;",
                            "verse 75:24": "and some faces will on that Day be overcast with despair,",
                            "verse 75:25": "knowing that a crushing calamity is about to befall them.",
                            "verse 75:26": "NAY, but when [the last breath] comes up to the throat [of a dying man],",
                            "verse 75:27": "and people ask, \"Is there any wizard [that could save him]?\"",
                            "verse 75:28": "the while he [himself] knows that this is the parting,",
                            "verse 75:29": "and is enwrapped in the pangs of death",
                            "verse 75:30": "at that time towards thy Sustainer does he feel impelled to turn!",
                            "verse 75:31": "[Useless, though, will be his repentance:] for [as long as he was alive] he did not accept the truth, nor did he pray [for enlightenment],",
                            "verse 75:32": "but, on the contrary, he gave the lie to the truth and turned away [from it],",
                            "verse 75:33": "and then went arrogantly back to what he had come from.",
                            "verse 75:34": "[And yet, O man, thine end comes hourly] nearer unto thee, and nearer",
                            "verse 75:35": "and ever nearer unto thee, and nearer!",
                            "verse 75:36": "DOES MAN, then, think that he is to be left to himself, to go about at will?",
                            "verse 75:37": "Was he not once a [mere] drop of sperm that had been spilt,",
                            "verse 75:38": "and thereafter became a germ-cell – whereupon He created and formed [it] in accordance with what [it] was meant to be,",
                            "verse 75:39": "and fashioned out of it the two sexes, the male and the female?",
                            "verse 75:40": "Is not He, then, able to bring the dead back to life?"
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 75:1": "I swear by the Day of Resurrection,",
                            "verse 75:2": "and I swear by the self-reproaching conscience, (that Resurrection is a reality.)",
                            "verse 75:3": "Does man think that We will never reassemble his bones?",
                            "verse 75:4": "Why (can We) not (do so), while We are able to reset (even) his fingertips perfectly?",
                            "verse 75:5": "But man wishes to go on violating Allah’s injunctions (even in future) ahead of him.",
                            "verse 75:6": "He asks, “When will be this Day of Resurrection?”",
                            "verse 75:7": "So, when the eyes will be dazzled,",
                            "verse 75:8": "and the moon will lose its light,",
                            "verse 75:9": "and the sun and the moon will be joined together,",
                            "verse 75:10": "on that day man will say, “Where to escape?”",
                            "verse 75:11": "Never! There will be no refuge at all.",
                            "verse 75:12": "On that day, towards your Lord will be the destination (of everyone.)",
                            "verse 75:13": "Man will be informed of what he sent ahead and what he left behind.",
                            "verse 75:14": "Rather, man will be a witness against himself,",
                            "verse 75:15": "even though he may offer his excuses.",
                            "verse 75:16": "(O Prophet,) do not move your tongue (during revelation) for (reciting) it (the Qur’ān) to receive it in hurry.",
                            "verse 75:17": "It is surely undertaken by Us to store it (in your heart), and to let it be recited (by you after revelation is completed).",
                            "verse 75:18": "Therefore, when it is recited by Us (through the angel), follow its recitation (by concentration of your heart).",
                            "verse 75:19": "Then, it is undertaken by Us to explain it.",
                            "verse 75:20": "Never, (your denial of Resurrection is never based on any sound reason!) Instead, you love that which is immediate,",
                            "verse 75:21": "and neglect the Hereafter.",
                            "verse 75:22": "Many faces, that day, will be glowing,",
                            "verse 75:23": "looking towards their Lord,",
                            "verse 75:24": "and many faces, that day, will be gloomy,",
                            "verse 75:25": "realizing that a back-breaking calamity is going to be afflicted on them.",
                            "verse 75:26": "Never, (you will never remain in this world forever!) When the soul (of a patient) reaches the clavicles,",
                            "verse 75:27": "and it is said, “Who is an enchanter (that can save him?)”",
                            "verse 75:28": "and he realizes that it is (the time of) departure (from the world,)",
                            "verse 75:29": "and one shank is intertwined with the other shank,",
                            "verse 75:30": "then on that day, it is to your Lord that one has to be driven.",
                            "verse 75:31": "So (the denier of the Hereafter) neither believed, nor prayed,",
                            "verse 75:32": "but rejected the truth and turned away (from it),",
                            "verse 75:33": "then he went to his home, puffed up with pride.",
                            "verse 75:34": "(It will be said to such a man,) Woe to you, then woe to you!",
                            "verse 75:35": "Again, woe to you, then woe to you!",
                            "verse 75:36": "Does man presume that he will be left unchecked?",
                            "verse 75:37": "Was he not an ejaculated drop of semen?",
                            "verse 75:38": "Then he became a clot of blood, then He created (him) and made (him) perfect,",
                            "verse 75:39": "and made from him two kinds, male and female.",
                            "verse 75:40": "Has He no power to give life to the dead?"
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 75:1": "Nay! I swear by the Day of Resurrection.",
                            "verse 75:2": "And, nay, I swear by the (self-)reproaching soul.",
                            "verse 75:3": "Does man suppose that We shall not assemble his bones?",
                            "verse 75:4": "Yes, indeed! We are able to reshape [even] his fingers!",
                            "verse 75:5": "Nay, but man desires to deny what lies ahead of him.",
                            "verse 75:6": "He asks, ‘When is the Day of Resurrection?’",
                            "verse 75:7": "But when the eyes are dazzled",
                            "verse 75:8": "and the moon is eclipsed,",
                            "verse 75:9": "and the sun and the moon are brought together —",
                            "verse 75:10": "on that day man will say, ‘Where is the escape?’",
                            "verse 75:11": "No indeed! There is no refuge.",
                            "verse 75:12": "On that day the recourse will be to your Lord.",
                            "verse 75:13": "On that day man will be informed of what he has sent ahead and left behind.",
                            "verse 75:14": "Rather man has insight into his [own] soul,",
                            "verse 75:15": "though he should offer his excuses.",
                            "verse 75:16": "Do not move your tongue with it to hasten it.",
                            "verse 75:17": "Assuredly it is for Us to bring it together and to recite it.",
                            "verse 75:18": "So, when We recite it, follow its recitation.",
                            "verse 75:19": "Then, it is for Us to explain it.",
                            "verse 75:20": "No indeed! Rather you love the transitory",
                            "verse 75:21": "and forsake the Hereafter.",
                            "verse 75:22": "Some faces on that day will be radiant,",
                            "verse 75:23": "looking upon their Lord.",
                            "verse 75:24": "And other faces on that day will be scowling,",
                            "verse 75:25": "certain that a spine-crushing calamity will fall on them.",
                            "verse 75:26": "No indeed! When it reaches up to the collar bones,",
                            "verse 75:27": "and it is said: ‘Where is the enchanter?’",
                            "verse 75:28": "and he suspects that it is the [time of] parting,",
                            "verse 75:29": "and the shank is intertwined with the [other] shank;",
                            "verse 75:30": "on that day to your Lord will be the driving [of the souls].",
                            "verse 75:31": "For he neither affirmed [the truth], nor prayed,",
                            "verse 75:32": "but he denied and he turned away,",
                            "verse 75:33": "then went off to his family swaggering.",
                            "verse 75:34": "[Woe be] nearer to you,",
                            "verse 75:35": "then [may woe be] nearer to you and nearer!",
                            "verse 75:36": "Does man suppose that he is to be left aimless?",
                            "verse 75:37": "Was he not a drop of emitted semen?",
                            "verse 75:38": "Then it became a clot; then He created and proportioned ,",
                            "verse 75:39": "and made of it the two sexes, the male and the female.",
                            "verse 75:40": "Is not such able to revive the dead?"
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 75:1": "I swear by the Day of Resurrection.",
                            "verse 75:2": "And I swear by the blaming self, reproaching (itself for evil deeds).",
                            "verse 75:3": "Does man think We shall not at all collect his bones (which will decompose into dust particles after his death)?",
                            "verse 75:4": "Yes, of course! We have also the power to restore and set right even his finger joints and finger tips.",
                            "verse 75:5": "Yet man still wants to continue committing sins also (in the life to come).",
                            "verse 75:6": "He asks (scornfully): ‘When is the Day of Resurrection?’",
                            "verse 75:7": "But when the eyes will be dazzled,",
                            "verse 75:8": "And the moon will be eclipsed,",
                            "verse 75:9": "And the sun and the moon will be fused (i.e., darkened) together,",
                            "verse 75:10": "On that Day man will cry out: ‘Where to flee away?’",
                            "verse 75:11": "No indeed! There is no place of refuge.",
                            "verse 75:12": "The place of refuge and repose that Day will be with your Lord alone.",
                            "verse 75:13": "That Day man will be informed of those (deeds) which he sent forward and those (repercussions) which he left behind (after his death).",
                            "verse 75:14": "In truth, man will (himself) be aware of (the affairs of) his self,",
                            "verse 75:15": "Even though he will offer all his excuses.",
                            "verse 75:16": "(O Beloved!) Do not move your tongue in a hurry (to learn the Qur’an by heart when it is revealed to you).",
                            "verse 75:17": "Assuredly, upon Us rests its collection and preservation (in your breast) and its recitation (by your tongue).",
                            "verse 75:18": "So when We complete its recitation (by the tongue of Jibril [Gabriel]), then follow that recitation.",
                            "verse 75:19": "Then surely upon Us is the clear exposition (of its implications).",
                            "verse 75:20": "The truth is, (O disbelievers,) that you love (the world) which you can readily gain.",
                            "verse 75:21": "And you have left aside the Hereafter.",
                            "verse 75:22": "Many faces will be fresh and in full bloom that Day,",
                            "verse 75:23": "Beholding (the enchanting radiance and beauty of) their Lord (unveiled).",
                            "verse 75:24": "And many faces will be deformed (depressed and dark) that Day,",
                            "verse 75:25": "Thinking that they will be subjected to such a harsh treatment that will break their backbones.",
                            "verse 75:26": "No indeed! When the soul reaches the throat,",
                            "verse 75:27": "And it is said: ‘Who can (now) treat him with magic (to cure him)?’",
                            "verse 75:28": "And (the departing soul) comes to realize that (now) is the hour of parting (with all).",
                            "verse 75:29": "And one leg clings to the other;",
                            "verse 75:30": "Towards your Lord is the departure that Day.",
                            "verse 75:31": "So (how ill-fated is he that) he neither affirmed (what the Messenger said) nor offered Prayer.",
                            "verse 75:32": "Rather he kept belying and turning away.",
                            "verse 75:33": "Then he went off towards his family in arrogance.",
                            "verse 75:34": "Woe to you (when dying), then woe to you (in the grave),",
                            "verse 75:35": "Then again woe to you (on the Last Day), then woe to you (in Hell)!",
                            "verse 75:36": "Does man think that he will be left for nothing (without any reckoning)?",
                            "verse 75:37": "Was he not (in his beginning) a sperm drop ejaculated (into the woman’s womb)?",
                            "verse 75:38": "Then it developed into a hanging mass (clinging to the womb like a nest). Then He created (in it the preliminary form of all the limbs of the body). Then He set (them) right.",
                            "verse 75:39": "Then He made from the same sperm drop two genders: male and female.",
                            "verse 75:40": "Then has He not the power to give life to the dead again?"
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "Kutsun todistajaksi ylösnousemuksen päivän,",
                            "verse 75:2": "kutsun todistajaksi omantunnon soimaavan äänen!",
                            "verse 75:3": "»Luuleeko ihminen, että Me emme kerran voi koota hänen luitaan?",
                            "verse 75:4": "Kyllä, Me kykenemme uusimaan täydellisesti hänen sormensakin.»",
                            "verse 75:5": "Ihminen tuudittaa itsensä epäuskoon tulevan elämän suhteen.",
                            "verse 75:6": "Hän kysyy: »Milloin ylösnousemuksen päivä koittaa?»",
                            "verse 75:7": "Mutta kun se päivä sumentaa hänen näkönsä",
                            "verse 75:8": "ja kuu pimenee,",
                            "verse 75:9": "kun aurinko ja kuu yhdessä sammuvat,",
                            "verse 75:10": "sinä päivänä ihminen on sanova: »Missä on paikka, mihin voisin paeta?»",
                            "verse 75:11": "Ei! Ei ole pakopaikkaa.",
                            "verse 75:12": "Sinä päivänä on ainoa turvapaikka Jumalan luona.",
                            "verse 75:13": "Sinä päivänä julistetaan ihmiselle, mitä hän on tehnyt ja mitä laiminlyönyt.",
                            "verse 75:14": "Ihminen joutuu todistuskappaleeksi omaa itseään vastaan,",
                            "verse 75:15": "vaikkapa hän miten latelisi puolustelujaan.",
                            "verse 75:16": "Älä liikuta kieltäsi tyrkyttääksesi heille sitä (Koraania) ennen aikojaan.",
                            "verse 75:17": "Totisesti Me huolehdimme sen kokoonpanosta ja julkilukemisesta.",
                            "verse 75:18": "Seuraa siis sitä järjestystä, missä Me sen saatamme julki,",
                            "verse 75:19": "Sillä Meistähän sen tulkintakin on lähtevä.",
                            "verse 75:20": "Ei, te ihmiset rakastatte nykyistä elämäänne",
                            "verse 75:21": "ja lyötte laimin tulevan elämän.",
                            "verse 75:22": "Sinä päivänä säteilevät muutamien kasvot",
                            "verse 75:23": "katsoen kohti Herraa,",
                            "verse 75:24": "ja sinä päivänä synkkenevät toisten ilmeet,",
                            "verse 75:25": "kun he tietävät, että jotakin tuhoisaa heille tapahtuu.",
                            "verse 75:26": "Ei, kun sydän nousee kurkkuun",
                            "verse 75:27": "ja kysytään: »Kuka taikuri nyt pystyy (kaiken torjumaan)?»",
                            "verse 75:28": "Ja ihminen uskoo, että hänen lähtönsä hetki on tullut",
                            "verse 75:29": "ja toinen isku tyrmää hänet toisensa jälkeen,",
                            "verse 75:30": "sinä päivänä käy hänen tiensä kohti Herraa.",
                            "verse 75:31": "Sillä hän ei uskonut eikä rukoillut,",
                            "verse 75:32": "vaan sanoi totuutta valheeksi ja käänsi sille selkänsä,",
                            "verse 75:33": "käyden sitten korskeana omiensa luo.",
                            "verse 75:34": "Voi sinua, voi!",
                            "verse 75:35": "Ja vielä! Voi sinua, voi!",
                            "verse 75:36": "Luuleeko ihminen, että hänen sallitaan kuljeksia ilman määränpäätä?",
                            "verse 75:37": "Eikö hän (aikanaan) ollut pieni siemenestä kylvetty itu?",
                            "verse 75:38": "Sitten tuli hänestä hyytynyttä verta; Jumalahan loi hänet ja teki hänet täydelliseksi",
                            "verse 75:39": "sekä muodosti kaksi sukupuolta, miehen ja naisen.",
                            "verse 75:40": "Eikö Hän kykene herättämään henkiin kuolleita?"
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 75:1": "Non !... Je jure par le Jour de la Résurrection !",
                            "verse 75:2": "Non !... Je jure par l'âme blâmante !",
                            "verse 75:3": "L'homme pense-t-il que Nous ne rassemblerons pas ses ossements ?",
                            "verse 75:4": "Que si ! Nous avons le pouvoir de restaurer ses phalanges.",
                            "verse 75:5": "Et pourtant, il préfère nier l'évidence.",
                            "verse 75:6": "Il demande : \" Quand donc viendra le Jour de la Résurrection ? \"",
                            "verse 75:7": "Lorsque la vue sera éblouie,",
                            "verse 75:8": "que la lune s'éclipsera,",
                            "verse 75:9": "que le soleil et la lune seront réunis.",
                            "verse 75:10": "Ce Jour-là, l'homme dira : \" Où fuir ? \"",
                            "verse 75:11": "Mais non ! Il n'y a pas de refuge !",
                            "verse 75:12": "Ce Jour-là, l'asile sera vers ton Seigneur ;",
                            "verse 75:13": "ce Jour-là, l'homme sera informé de tout ce qu'il aura accompli à l'avance ou en retard.",
                            "verse 75:14": "L'homme sera clairvoyant envers lui-même,",
                            "verse 75:15": "eût-il des excuses à présenter.",
                            "verse 75:16": "N'agite pas ta langue en lisant le Coran pour en hâter la récitation,",
                            "verse 75:17": "c'est à Nous qu'il appartient de le rassembler et de le lire.",
                            "verse 75:18": "Lorsque Nous le lisons, suis-en la lecture ;",
                            "verse 75:19": "c'est à Nous qu'il appartient, ensuite, de l'expliciter.",
                            "verse 75:20": "Mais non ! Vous aimez l'immédiat",
                            "verse 75:21": "et vous négligez la vie dernière.",
                            "verse 75:22": "Ce Jour-là, il y aura des visages lumineux",
                            "verse 75:23": "qui tourneront leurs regards vers leur Seigneur.",
                            "verse 75:24": "Ce Jour-là, il y aura des visages abattus",
                            "verse 75:25": "qui penseront qu'un terrible sort les attend.",
                            "verse 75:26": "Mais non ! Lorsque la vie remonte à la gorge,",
                            "verse 75:27": "que l'on s'interroge : \" Qui est le magicien ? \",",
                            "verse 75:28": "que l'on se dit : \" Voici venue la séparation ! \" ,",
                            "verse 75:29": "que la jambe se crispe contre la jambe,",
                            "verse 75:30": "ce Jour-là, chacun est poussé vers ton Seigneur.",
                            "verse 75:31": "Il n'a pas reconnu la vérité, il n'a pas prié ;",
                            "verse 75:32": "bien au contraire, il a crié au mensonge et s'est détourné ;",
                            "verse 75:33": "puis il est parti vers les siens en marchant fièrement.",
                            "verse 75:34": "L'Heure est proche de toi, et encore plus proche !",
                            "verse 75:35": "Elle est proche de toi, et encore plus proche !",
                            "verse 75:36": "L'homme pense-t-il qu'on le laissera libre ?",
                            "verse 75:37": "N'a-t-il pas été une goutte de sperme fluide ?",
                            "verse 75:38": "Ensuite elle est devenue un caillot de sang que Dieu a formé et façonné.",
                            "verse 75:39": "De celui-ci, il a fait un couple : le mâle et la femelle.",
                            "verse 75:40": "Celui qui a agi ainsi n'a-t-il pas le pouvoir de ressusciter les morts ? \""
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 75:1": "Non ! ... Je jure par le jour de la Résurrection !",
                            "verse 75:2": "Mais non ! , Je jure par l’âme qui ne cesse de se blâmer. .",
                            "verse 75:3": "L’homme, pense-t-il que Nous ne réunirons jamais ses os ?",
                            "verse 75:4": "Mais si ! Nous sommes Capable de remettre à leur place les extrémités de ses doigts. .",
                            "verse 75:5": "L’homme voudrait plutôt continuer à vivre en libertin.",
                            "verse 75:6": "Il interroge : «A quand, le Jour de la Résurrection ? »",
                            "verse 75:7": "Lorsque la vue sera éblouie,",
                            "verse 75:8": "et que la lune s’éclipsera,",
                            "verse 75:9": "et que le soleil et la lune serons réunis,",
                            "verse 75:10": "l’homme, ce jour-là, dira : «Où fuir ? »",
                            "verse 75:11": "Non ! Point de refuge !",
                            "verse 75:12": "Vers ton Seigneur sera, ce jour-là, le retour.",
                            "verse 75:13": "L’homme sera informé ce jour-là de ce qu’il aura avancé et de ce qu’il aura remis à plus tard.",
                            "verse 75:14": "Mais l’homme sera un témoin perspicace contre lui-même,",
                            "verse 75:15": "quand même il présenterait ses excuses.",
                            "verse 75:16": "Ne remue pas ta langue pour hâter sa récitation :",
                            "verse 75:17": "Son rassemblement (dans ton coeur et sa fixation dans ta mémoire) Nous incombent, ainsi que la façon de le réciter. .",
                            "verse 75:18": "Quand donc Nous le récitons , suis sa récitation.",
                            "verse 75:19": "A Nous, ensuite incombera son explication.",
                            "verse 75:20": "Mais vous aimez plutôt [la vie] éphémère,",
                            "verse 75:21": "et vous délaissez l’au-delà.",
                            "verse 75:22": "Ce jour-là, il y aura des visages resplendissants",
                            "verse 75:23": "qui regarderont leur Seigneur;",
                            "verse 75:24": "et il y aura ce jour-là, des visages assombris,",
                            "verse 75:25": "qui s’attendent à subir une catastrophe.",
                            "verse 75:26": "Mais non ! Quand [l’âme] en arrive aux clavicules",
                            "verse 75:27": "et qu’on dit : «Qui est exorciseur ? »",
                            "verse 75:28": "et qu’il [l’agonisant] est convaincu que c’est la séparation (la mort),",
                            "verse 75:29": "et que la jambe s’enlace à la jambe,",
                            "verse 75:30": "c’est vers ton Seigneur, ce jour-là que tu seras conduit.",
                            "verse 75:31": "Mais il n’a ni cru, ni fait la Salat;",
                            "verse 75:32": "par contre, il a démenti et tourné le dos,",
                            "verse 75:33": "puis il s’en est allé vers sa famille, marchant avec orgueil.",
                            "verse 75:34": "«Malheur à toi, malheur ! »",
                            "verse 75:35": "Et encore malheur à toi, malheur !",
                            "verse 75:36": "L’homme pense-t-il qu’on le laissera sans obligation à observer ?",
                            "verse 75:37": "N’était-il pas une goutte de sperme éjaculé ?",
                            "verse 75:38": "Et ensuite une adhérence Puis [Dieu] l’a créée et formée harmonieusement;",
                            "verse 75:39": "puis en a fait alors les deux éléments de couple : le mâle et la femelle ?",
                            "verse 75:40": "Celui-là (Dieu) n’est-Il pas capable de faire revivre les morts ?"
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "Nein! Ich rufe zum Zeugen den Tag der Auferstehung.",
                            "verse 75:2": "Nein! Ich rufe zum Zeugen die sich selbst anklagende Seele.",
                            "verse 75:3": "Wähnt der Mensch, daß Wir seine Gebeine nicht sammeln werden?",
                            "verse 75:4": "Fürwahr, Wir sind imstande, (sogar) seine Fingerspitzen zusammenzufügen.",
                            "verse 75:5": "Doch der Mensch wünscht, Sündhaftigkeit vor sich vorauszuschicken.",
                            "verse 75:6": "Er fragt: «Wann wird der Tag der Auferstehung sein?»",
                            "verse 75:7": "Wenn das Auge geblendet ist,",
                            "verse 75:8": "Und der Mond sich verfinstert,",
                            "verse 75:9": "Und die Sonne und der Mond vereinigt werden.",
                            "verse 75:10": "An jenem Tage wird der Mensch sprechen: «Wohin nun fliehen?»",
                            "verse 75:11": "Nein! keine Zuflucht!",
                            "verse 75:12": "(Nur) zu deinem Herrn wird an jenem Tage die Rückkehr sein.",
                            "verse 75:13": "Verkündet wird dem Menschen an jenem Tage, was er vorausgesandt und was er zurückgelassen hat.",
                            "verse 75:14": "Nein, der Mensch ist Zeuge wider sich selber,",
                            "verse 75:15": "Auch wenn er Entschuldigungen vorbringt.",
                            "verse 75:16": "Rühre nicht deine Zunge mit dieser (Offenbarung), sie zu beschleunigen.",
                            "verse 75:17": "Uns obliegt ihre Sammlung und ihre Lesung.",
                            "verse 75:18": "Drum, wenn Wir sie lesen, folge ihrer Lesung;",
                            "verse 75:19": "Dann obliegt Uns ihre Erläuterung.",
                            "verse 75:20": "Nein, ihr aber, ihr liebt das Gegenwärtige",
                            "verse 75:21": "Und vernachlässigt das Jenseits.",
                            "verse 75:22": "Manche Gesichter werden an jenem Tage leuchtend sein,",
                            "verse 75:23": "Und zu ihrem Herrn schauen;",
                            "verse 75:24": "Und manche Gesichter werden an jenem Tage gramvoll sein,",
                            "verse 75:25": "Denn sie ahnen, daß ein schreckliches Unglück ihnen demnächst widerfahren soll.",
                            "verse 75:26": "Ja! wenn (die Seele eines Sterbenden) zur Kehle emporsteigt",
                            "verse 75:27": "Und gesprochen wird: «Wer ist der Zauberer (der ihn rette)?»;",
                            "verse 75:28": "Und er weiß, daß es (die Stunde des) Scheidens ist",
                            "verse 75:29": "Und Todespein auf Todespein gehäuft wird;",
                            "verse 75:30": "Zu deinem Herrn wird an jenem Tage das Treiben sein.",
                            "verse 75:31": "Denn er spendete nicht und betete nicht,",
                            "verse 75:32": "Sondern er leugnete und wandte sich ab;",
                            "verse 75:33": "Dann ging er zu seiner Sippe mit stolzem Gang.",
                            "verse 75:34": "«Wehe dir denn! wehe!",
                            "verse 75:35": "Und abermals wehe dir! und nochmals wehe!»",
                            "verse 75:36": "Wähnt der Mensch etwa, er solle ganz ungebunden bleiben?",
                            "verse 75:37": "War er nicht ein Tropfen fließenden Samens, der verspritzt ward?",
                            "verse 75:38": "Dann wurde er ein Blutklumpen, dann bildete und vervollkommnete Er (ihn).",
                            "verse 75:39": "So schuf Er aus ihm ein Paar, den Mann und das Weib.",
                            "verse 75:40": "Und da sollte Er nicht imstande sein, die Toten ins Leben zu rufen?"
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "eSa jksts+ d+;ker dh d+le [kkrk gw¡",
                            "verse 75:2": "¼vkSj cqjkbZ ls½ eyker djus okys th dh d+le [kkrk gw¡ ¼fd rqe lc nksckjk½ t+:j ft+Unk fd, tkvksxs",
                            "verse 75:3": "D;k bUlku ;s [+;ky djrk gS ¼fd ge mldh gfM~M;ksa dks ckslhnk gksus ds ckn½ tek u djsaxs gk¡ ¼t+:j djsaxsa½",
                            "verse 75:4": "ge bl ij d+kfnj gSa fd ge mldh iksj iksj nq:Lr djsa",
                            "verse 75:5": "exj bUlku rks ;s tkurk gS fd vius vkxs Hkh ¼ges’kk½ cqjkbZ djrk tk,",
                            "verse 75:6": "iwNrk gS fd d+;ker dk fnu dc gksxk",
                            "verse 75:7": "rks tc vk¡[ks pdkpkSU/k esa vk tk,¡xh",
                            "verse 75:8": "vkSj pk¡n xgu esa yx tk,xk",
                            "verse 75:9": "vkSj lwjt vkSj pk¡n bdV~Bk dj fn, tk,¡xs",
                            "verse 75:10": "rks bUlku dgsxk vkt dgk¡ Hkkx dj tkÅ¡",
                            "verse 75:11": ";d+hu tkuksa dgha iukg ugha",
                            "verse 75:12": "ml jkst+ rqEgkjs ijojfnxkj gh ds ikl fBdkuk gS",
                            "verse 75:13": "ml fnu vkneh dks tks dqN mlds vkxs ihNs fd;k gS crk fn;k tk,xk",
                            "verse 75:14": "cfYd bUlku rks vius Åij vki xokg gS",
                            "verse 75:15": "vxjps og vius xqukgksa dh mtz o t+:j ekt+sjr i<+k djrk jgs",
                            "verse 75:16": "¼,s jlwy½ ogh ds tYnh ;kn djus okLrs viuh t+cku dks gjdr u nks",
                            "verse 75:17": "mldk tek dj nsuk vkSj i<+ok nsuk rks ;d+huh gekjs ft+Ees gS",
                            "verse 75:18": "rks tc ge mldks ¼ftcjhy dh t+ckuh½ i<+sa rks rqe Hkh ¼iwjk½ lquus ds ckn blh rjg i<+k djks",
                            "verse 75:19": "fQj ml ¼ds eqf’dykr dk le>k nsuk Hkh gekjs ft+Eesa gS½",
                            "verse 75:20": "exj ¼yksxksa½ gd+ rks ;s gS fd rqe yksx nqfu;k dks nksLr j[krs gks",
                            "verse 75:21": "vkSj vk[+ksjr dks NksM+s cSBs gks",
                            "verse 75:22": "ml jkst+ cgqr ls psgjs rks rjks rkt+k c’k’kk’k gksaxs",
                            "verse 75:23": "¼vkSj½ vius ijojfnxkj ¼dh usver½ dks ns[k jgs gksaxs",
                            "verse 75:24": "vkSj cgqrsjs eq¡g ml fnu mnkl gksaxs",
                            "verse 75:25": "le> jgsa gSa fd mu ij eqlhcr iM+us okyh gS fd dej rksM+ nsxh",
                            "verse 75:26": "lqu yks tc tku ¼cnu ls f[kap ds½ g¡lyh rd vk igq¡psxh",
                            "verse 75:27": "vkSj dgk tk,xk fd ¼bl oD+r½ dksbZ >kM+ Qw¡d djus okyk gS",
                            "verse 75:28": "vkSj ejus okys us le>k fd vc ¼lcls½ tqnkbZ gS",
                            "verse 75:29": "vkSj ¼ekSr dh rdyhQ+ ls½ fiUMyh ls fiUMyh fyiV tk,xh",
                            "verse 75:30": "ml fnu rqedks vius ijojfnxkj dh ckjxkg esa pyuk gS",
                            "verse 75:31": "rks mlus ¼x+Qyr esa½ u ¼dykes [+kqnk dh½ rlnhd+ dh u uekt+ i<+h",
                            "verse 75:32": "exj >qByk;k vkSj ¼bZeku ls½ eq¡g Qsjk",
                            "verse 75:33": "vius ?kj dh rjQ brjkrk gqvk pyk",
                            "verse 75:34": "vQlksl gS rq> ij fQj vQlksl gS fQj rqQ+ gS",
                            "verse 75:35": "rq> ij fQj rqQ+ gS",
                            "verse 75:36": "D;k bUlku ;s le>rk gS fd og ;w¡ gh NksM+ fn;k tk,xk",
                            "verse 75:37": "D;k og ¼bCrsnu½ euh dk ,d d+rjk u Fkk tks jge esa Mkyh tkrh gS",
                            "verse 75:38": "fQj yksFkM+k gqvk fQj [+kqnk us mls cuk;k",
                            "verse 75:39": "fQj mls nq:Lr fd;k fQj mldh nks fdLesa cuk;ha ¼,d½ enZ vkSj ¼,d½ vkSjr",
                            "verse 75:40": "D;k bl ij d+kfnj ugha fd ¼d+;ker esa½ eqnksZa dks ft+Unk dj ns lwj, d+;ker [+kRe"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "Aku bersumpah dengan hari kiamat,",
                            "verse 75:2": "dan aku bersumpah dengan jiwa yang amat menyesali (dirinya sendiri).",
                            "verse 75:3": "Apakah manusia mengira, bahwa kami tidak akan mengumpulkan (kembali) tulang belulangnya?",
                            "verse 75:4": "Bukan demikian, sebenarnya Kami kuasa menyusun (kembali) jari jemarinya dengan sempurna.",
                            "verse 75:5": "Bahkan manusia itu hendak membuat maksiat terus menerus.",
                            "verse 75:6": "Ia bertanya: \"Bilakah hari kiamat itu?\"",
                            "verse 75:7": "Maka apabila mata terbelalak (ketakutan),",
                            "verse 75:8": "dan apabila bulan telah hilang cahayanya,",
                            "verse 75:9": "dan matahari dan bulan dikumpulkan,",
                            "verse 75:10": "pada hari itu manusia berkata: \"Ke mana tempat lari?\"",
                            "verse 75:11": "Sekali-kali tidak! Tidak ada tempat berlindung!",
                            "verse 75:12": "Hanya kepada Tuhanmu sajalah pada hari itu tempat kembali.",
                            "verse 75:13": "Pada hari itu diberitakan kepada manusia apa yang telah dikerjakannya dan apa yang dilalaikannya.",
                            "verse 75:14": "Bahkan manusia itu menjadi saksi atas dirinya sendiri,",
                            "verse 75:15": "meskipun dia mengemukakan alasan-alasannya.",
                            "verse 75:16": "Janganlah kamu gerakkan lidahmu untuk (membaca) Al Qur'an karena hendak cepat-cepat (menguasai) nya.",
                            "verse 75:17": "Sesungguhnya atas tanggungan Kami-lah mengumpulkannya (di dadamu) dan (membuatmu pandai) membacanya.",
                            "verse 75:18": "Apabila Kami telah selesai membacakannya maka ikutilah bacaannya itu.",
                            "verse 75:19": "Kemudian, sesungguhnya atas tanggungan Kami-lah penjelasannya.",
                            "verse 75:20": "Sekali-kali janganlah demikian. Sebenarnya kamu (hai manusia) mencintai kehidupan dunia,",
                            "verse 75:21": "dan meninggalkan (kehidupan) akhirat.",
                            "verse 75:22": "Wajah-wajah (orang-orang mukmin) pada hari itu berseri-seri.",
                            "verse 75:23": "Kepada Tuhannyalah mereka melihat.",
                            "verse 75:24": "Dan wajah-wajah (orang kafir) pada hari itu muram,",
                            "verse 75:25": "mereka yakin bahwa akan ditimpakan kepadanya malapetaka yang amat dahsyat.",
                            "verse 75:26": "Sekali-kali jangan. Apabila nafas (seseorang) telah (mendesak) sampai ke kerongkongan,",
                            "verse 75:27": "dan dikatakan (kepadanya): \"Siapakah yang dapat menyembuhkan?\",",
                            "verse 75:28": "dan dia yakin bahwa sesungguhnya itulah waktu perpisahan (dengan dunia),",
                            "verse 75:29": "dan bertaut betis (kiri) dengan betis (kanan),",
                            "verse 75:30": "kepada Tuhanmulah pada hari itu kamu dihalau.",
                            "verse 75:31": "Dan ia tidak mau membenarkan (Rasul dan Al Qur’an) dan tidak mau mengerjakan shalat,",
                            "verse 75:32": "tetapi ia mendustakan (Rasul) dan berpaling (dari kebenaran),",
                            "verse 75:33": "kemudian ia pergi kepada ahlinya dengan berlagak (sombong).",
                            "verse 75:34": "Kecelakaanlah bagimu (hai orang kafir) dan kecelakaanlah bagimu,",
                            "verse 75:35": "kemudian kecelakaanlah bagimu (hai orang kafir) dan kecelakaanlah bagimu.",
                            "verse 75:36": "Apakah manusia mengira, bahwa ia akan dibiarkan begitu saja (tanpa pertanggung-jawaban)?",
                            "verse 75:37": "Bukankah dia dahulu setetes mani yang ditumpahkan (ke dalam rahim),",
                            "verse 75:38": "kemudian mani itu menjadi segumpal darah, lalu Allah menciptakannya, dan menyempurnakannya,",
                            "verse 75:39": "lalu Allah menjadikan daripadanya sepasang: laki laki dan perempuan.",
                            "verse 75:40": "Bukankah (Allah yang berbuat) demikian berkuasa (pula) menghidupkan orang mati?"
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "Lo giuro per il Giorno della Resurrezione,",
                            "verse 75:2": "lo giuro per l'anima in preda al rimorso.",
                            "verse 75:3": "Crede forse l'uomo che mai riuniremo le sue ossa?",
                            "verse 75:4": "Invece sì, possiamo persino riordinare le sue falangi.",
                            "verse 75:5": "Ma l'uomo preferisce piuttosto il libertinaggio!",
                            "verse 75:6": "Chiede: « Quando verrà il Giorno della Resurrezione?».",
                            "verse 75:7": "Quando sarà abbagliato lo sguardo,",
                            "verse 75:8": "ed eclissata la luna,",
                            "verse 75:9": "e riuniti il sole e la luna.",
                            "verse 75:10": "In quel Giorno l'uomo dirà: « Dove fuggire?».",
                            "verse 75:11": "No, non avrà rifugio alcuno.",
                            "verse 75:12": "In quel Giorno il ritorno sarà presso il tuo Signore.",
                            "verse 75:13": "In quel Giorno l'uomo sarà edotto di quel che avrà commesso.",
                            "verse 75:14": "Sì, l'uomo testimonierà contro se stesso,",
                            "verse 75:15": "pur avanzando le sue scuse.",
                            "verse 75:16": "Non agitare la tua lingua con esso, per affrettarti :",
                            "verse 75:17": "invero spetta a Noi la sua riunione e la sua recitazione .",
                            "verse 75:18": "Quando lo recitiamo, ascolta [attento] la recitazione.",
                            "verse 75:19": "Poi spetterà a Noi la sua spiegazione.",
                            "verse 75:20": "No, voi amate l'effimero [della vita terrena],",
                            "verse 75:21": "e trascurate l'Altra vita.",
                            "verse 75:22": "In quel Giorno ci saranno dei volti splendenti,",
                            "verse 75:23": "che guarderanno il loro Signore;",
                            "verse 75:24": "e in quel Giorno ci saranno volti rabbuiati,",
                            "verse 75:25": "al pensiero di subire un castigo terribile.",
                            "verse 75:26": "No, quando [l'anima] sarà giunta alle clavicole ,",
                            "verse 75:27": "sarà gridato: « Chi è esorcista ?»",
                            "verse 75:28": "Ed egli concluderà che è prossima la dipartita,",
                            "verse 75:29": "e le gambe si irrigidiranno ;",
                            "verse 75:30": "in quel Giorno il ritorno sarà verso il tuo Signore.",
                            "verse 75:31": "Ma egli non credette e non eseguì l'orazione,",
                            "verse 75:32": "tacciò invece di menzogna e voltò le spalle,",
                            "verse 75:33": "ritornando poi verso la sua gente, camminando con alterigia.",
                            "verse 75:34": "Guai a te, guai,",
                            "verse 75:35": "e ancora guai a te, guai!",
                            "verse 75:36": "Crede forse l'uomo che sarà lasciato libero?",
                            "verse 75:37": "Già non fu che una goccia di sperma eiaculata,",
                            "verse 75:38": "quindi un'aderenza, poi [Allah] lo creò e gli diede forma armoniosa;",
                            "verse 75:39": "poi ne trasse una coppia, il maschio e la femmina.",
                            "verse 75:40": "Colui [che ha fatto tutto questo] non sarebbe dunque capace di far risorgere i morti?"
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "わたしは，復活の日において誓う。",
                            "verse 75:2": "また，自責する魂において誓う。",
                            "verse 75:3": "人間は，われがかれの骨を集められないと考えるのか。",
                            "verse 75:4": "いや，われはかれの指先（の骨）まで揃えることが出来るのである。",
                            "verse 75:5": "だが人間は，かれの御前（の生活）においても，罪を犯すことを望む。",
                            "verse 75:6": "かれは，「復活の日はいつか。」と問う。",
                            "verse 75:7": "遂に目が眩む時，",
                            "verse 75:8": "月は（蝕？）けり，",
                            "verse 75:9": "太陽と月は合わせられる。",
                            "verse 75:10": "その日人間は，「どこに避難しようか。」と言う。",
                            "verse 75:11": "断じて避けられないのである。",
                            "verse 75:12": "あなたの主の御許が，その日定めの住まいである。",
                            "verse 75:13": "その日（凡ての）人間は，既に行ったことと，後に残したことに就いて各げられるであろう。",
                            "verse 75:14": "いや人間は，自分自身に対し証人である。",
                            "verse 75:15": "仮令かれが，いろいろ弁解しても。",
                            "verse 75:16": "この（クルアーンを催促するために）あなたの舌を急がしく動かしてはならない。",
                            "verse 75:17": "それを集め，それを読ませるのは，われの仕事である。",
                            "verse 75:18": "それでわれがそれを読んだ時，その読誦に従え。",
                            "verse 75:19": "更にそれを解き明かすのも，本当にわれの仕事である。",
                            "verse 75:20": "いや，あなたがたは（果ない）浮世を愛して，",
                            "verse 75:21": "来世を等閑にする。",
                            "verse 75:22": "その日，或る者たちの顔は輝き，",
                            "verse 75:23": "かれらの主を，仰ぎ見る。",
                            "verse 75:24": "またその日，或る者たちの顔は暗く，",
                            "verse 75:25": "背骨を砕く程の大災難が，かれらに降り� かることを知るであろう。",
                            "verse 75:26": "いや，（魂が）喉元に届く時，",
                            "verse 75:27": "言われよう。「誰か，呪いが出来るか。」",
                            "verse 75:28": "かれは離別（の時）であることを悟るであろう。",
                            "verse 75:29": "一つの脚は他方の脚にれ絡まり，",
                            "verse 75:30": "その日かれは，主に駆り立てられる。",
                            "verse 75:31": "かれは真理を受け入れず，また礼拝も棒げなかった，",
                            "verse 75:32": "却って（真理）を虚偽とし，背き去り，",
                            "verse 75:33": "思いあがって家族の許に赴いた。",
                            "verse 75:34": "あなた（多神教徒）に災いあれ，（本当に）災いなるかな。",
                            "verse 75:35": "重ねていう。あなたに災いあれ，（本当に）災いなるかな。",
                            "verse 75:36": "人間は，（目的もなく）その儘で放任されると思うのか。",
                            "verse 75:37": "元々かれは射出された，一滴の精液ではなかったか。",
                            "verse 75:38": "それから一塊の血となり，更にアッラーが，（均整に）形作り，",
                            "verse 75:39": "かれは，人間を男と女の両性になされたのではなかったか。",
                            "verse 75:40": "それでもかれには，死者を甦らせる御力がないとするのか。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "부활의 날을 두고 맹세하사",
                            "verse 75:2": "스스로 책망하는 영혼을 두고맹세하나니",
                            "verse 75:3": "인간은 하나님이 그의 뼈들을모을 수 없다고 생각하느뇨",
                            "verse 75:4": "하나님에게는 인간의 손가락 끝의 뼈까지도 부활시킬 수 있는 권능이 있노라",
                            "verse 75:5": "그래도 인간은 그의 앞에 남 아 있는 기간까지도 불신하려 하 며",
                            "verse 75:6": "부활의 날이 언제이뇨 라고 묻더라",
                            "verse 75:7": "그리하여 시야는 현혹되고",
                            "verse 75:8": "달은 어둠속에 묻히며",
                            "verse 75:9": "태양과 달이 함께 모이는 날",
                            "verse 75:10": "은신처가 어디입니까 라고 그날 인간은 질문하나",
                            "verse 75:11": "그들에게는 은신처가 없노라",
                            "verse 75:12": "그날은 주님에게로만 돌아갈거처 뿐이라",
                            "verse 75:13": "그날 인간은 그가 앞서 행한모든 것과 후에 미루어졌던 모든 것을 알게 되매",
                            "verse 75:14": "그때 인간은 그가 스스로의 증인이 되노라",
                            "verse 75:15": "어떤 변명도 그에게 유용하 지 않노라",
                            "verse 75:16": "꾸란을 계시 받음에 서둘러 그대의 혀를 움직이지 말라",
                            "verse 75:17": "하나님이 그것을 모아 그대 로 하여금 암송케 하리니",
                            "verse 75:18": "하나님이 그것을 읽은 후에 그대가 따라 읽으라",
                            "verse 75:19": "그런 후 하나님이 그것을 설명하여 주리라",
                            "verse 75:20": "그러나 너희는 지나가는 현 세의 삶을 사랑하고",
                            "verse 75:21": "내세를 게을리 하도다",
                            "verse 75:22": "그날 일부는 그들의 얼굴에 빛을 발산하며",
                            "verse 75:23": "그들의 주님을 향하여 있고",
                            "verse 75:24": "그날 일부는 그들의 얼굴에 슬픔과 고뇌로 가득차며",
                            "verse 75:25": "그들 위에 얼마의 큰 재앙이 임박했음을 알게 되도다",
                            "verse 75:26": "그때 영혼이 목구멍까지 이 르매",
                            "verse 75:27": "그를 구할 마술사가 누구이 뇨 라는 소리가 들리니",
                            "verse 75:28": "그는 이별할 시간이라는 것 을 확신하고",
                            "verse 75:29": "한 다리가 다른 것에 포개어 져",
                            "verse 75:30": "그날 주님께로 운반되어 가 노라",
                            "verse 75:31": "그것은 그가 확증하지 아니 하고 예배를 드리지 아니하며",
                            "verse 75:32": "진리를 거역하고 외면했으며",
                            "verse 75:33": "완전히 기만된 그의 무리를 오만하게 따랐기 때문이라",
                            "verse 75:34": "너희에게 재앙이 있으리라",
                            "verse 75:35": "더하여 너희에게 재앙이 있 으리라",
                            "verse 75:36": "아무 목적없이 방황토록 내 버려 두리라 인간은 생각하느뇨",
                            "verse 75:37": "그는 단지 흘러나온 정액의 한 방울에 불과하지 않느뇨",
                            "verse 75:38": "그리하여 응혈이 되매 그분 은 그를 완전한 형상으로 지으시 고",
                            "verse 75:39": "남성과 여성으로 자웅을 두 셨으매",
                            "verse 75:40": "그러한 능력을 가진 그분이 죽은 자를 살게 할 수 없단 말이뇨"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "سوێند ده‌خۆم به ڕۆژی قیامه‌ت.",
                            "verse 75:2": "سوێند ده‌خۆم به ویژدانی زیندوو و نه‌فسی ڕه‌خنه له خۆگر که لۆمه‌ی خۆی ده‌کات.",
                            "verse 75:3": "ئایا ئینسان واده‌زانێت هه‌رگیز ئێسکه‌کانی کۆناکه‌ینه‌وه‌؟!",
                            "verse 75:4": "به‌ڵێ، له‌وه زیاتریش ده‌که‌ین و توانامان هه‌یه که نه‌خشه ورده‌کانی سه‌ر په‌نجه‌کانی به‌دی بهێنینه‌وه‌.",
                            "verse 75:5": "نه‌خێر، با گومانی وانه‌بات، به‌ڵکو ئاده‌میزاد ده‌یه‌وێت گوناهو تاوان بکاته پیشه‌ی خۆی به‌درێژایی ژیانی، یاخود ده‌یه‌وێت قیامه‌ت له به‌رده‌میدا به‌رپا ببێت ئینجا باوه‌ڕی پێ بهێنێت!",
                            "verse 75:6": "بێ باکانه ده‌پرسێت: کوا، که‌ی ڕۆژی قیامه‌ت به‌رپا ده‌بێت؟! (به‌خه‌یاڵی خۆی زۆر به دووری ده‌زانێت).",
                            "verse 75:7": "کاتێك دێت، چاو ئه‌بڵه‌ق ده‌بێت.",
                            "verse 75:8": "مانگیش ده‌گیرێت و تاریك ده‌بێت (ئه‌ویش هه‌ڵده‌وه‌شێت).",
                            "verse 75:9": "(یاسای بوونه‌وه‌ر تێك ده‌چێت و) خۆرو مانگ کۆ ده‌کرێنه‌وه‌و ده‌درێن به‌یه‌کدا.",
                            "verse 75:10": "ئه‌و ڕۆژه ئینسان ده‌ڵێت: (ئه‌ی هاوار) بۆ کوێ ڕا بکه‌م، له کوێوه خۆم ڕزگار بکه‌م.",
                            "verse 75:11": "نه‌خێر ئیتر ده‌ربازبوون نیه (ڕزگار بوون ئه‌سته‌مه‌).",
                            "verse 75:12": "تۆ ئیتر ده‌بێت لای په‌روه‌ردگارت ئاماده‌بیت و له‌وێ ئۆقره بگریت (بۆ لێپرسینه‌وه‌).",
                            "verse 75:13": "له‌و ڕۆژه‌دا ئاده‌میزاد هه‌واڵی هه‌موو ئه‌و کارو کرده‌وانه‌ی پێده‌درێت که ده‌ست پێشکه‌ریی کردووه (یاخود به ته‌ما بووه بیکات و دوای خستووه‌، یاخود هه‌واڵی کرده‌وه‌ی ڕابووردووی و ئاسه‌واری دوای خۆی پێ ده‌درێت).",
                            "verse 75:14": "به‌ڵکو ئینسان خۆی شایه‌ته به‌سه‌ر خۆیه‌وه (ئه‌ندامه‌کان شایه‌تن به‌سه‌ریه‌وه‌).",
                            "verse 75:15": "هه‌رچه‌نده چه‌نده‌ها پاکانه بکات و بیانوو بهێنێته‌وه (بێ سوودو بێ که‌ڵکه‌).",
                            "verse 75:16": "په‌له مه‌که‌و زمانت مه‌جوڵێنه‌، بۆ ئه‌وه‌ی په‌له بکه‌یت له وه‌رگرتنیدا.",
                            "verse 75:17": "به‌ڕاستی له‌سه‌ر ئێمه‌یه کۆکردنه‌وه‌و خوێندنه‌وی.",
                            "verse 75:18": "جا کاتێك ئێمه ده‌یخوێنینه‌وه تۆش شوێنمان بکه‌وه له خوێندنه‌وه‌یدا.",
                            "verse 75:19": "پاشان به‌ڕاستی ڕوون کردنه‌وه‌شی له‌سه‌ر ئێمه‌یه‌.",
                            "verse 75:20": "نه‌خێر، وانی یه (زیندووکردنه‌وه لێپرسینه‌وه هه‌ر ده‌بێت) دیاره ئێوه هه‌ر ئه‌م دنیایه‌تان خۆش ده‌وێت که به‌په‌له به‌سه‌ر ده‌چێت.",
                            "verse 75:21": "قیامه‌ت و به‌هه‌شت پشتگوێ ده‌خه‌ن و وازی لێده‌هێنن.",
                            "verse 75:22": "به‌مه‌رجێك ئه‌و ڕۆژه‌، ڕووخسارانێك گه‌شاوه‌و ناسك و ئاسووده‌ن.",
                            "verse 75:23": "چونکه (هه‌ریه‌که بۆ خۆی) ته‌ماشای په‌روه‌ردگاری ده‌کات (له ته‌ماشاکردنی تێر نابێت).",
                            "verse 75:24": "هه‌ر له‌و ڕۆژه‌شدا ڕووخسارانێکی تر ڕه‌ش داگیرساو گرژو تاڵ و دێزن.",
                            "verse 75:25": "چاوه‌ڕوانن کاره‌ساتێکی پشت شکێنیان به‌سه‌ردا بهێنرێت.",
                            "verse 75:26": "نه‌خێر ئه‌و خه‌ڵکه هه‌روا ژیانیان به‌رده‌وام نابێت به‌ڵکو کاتێك دێت که ڕۆحی یه‌ك به‌یه‌کیان ده‌گاته گه‌رووی.",
                            "verse 75:27": "ئه‌وسا ده‌وترێت، کێ فریاد ڕه‌سیه‌تی؟",
                            "verse 75:28": "به‌ڵام له‌و کاته‌دا، ئه‌و که‌سه‌ی له‌سه‌ره مه‌رگدایه دڵنیابه که ئیتر هیچ شتێك فریای ناکه‌وێت و کاتی ماڵئاواییه‌.",
                            "verse 75:29": "ئیتر قاچ و لوولاق به‌یه‌کدا ده‌ئاڵێن.",
                            "verse 75:30": "ئه‌وساو له‌و ڕۆژه‌دا بۆ لای په‌روه‌ردگارت ڕاپێچ ده‌کرێیت و ده‌برێیت.",
                            "verse 75:31": "نه‌بڕوای هێناو نه نوێژێکی به‌جوانی خوێند.",
                            "verse 75:32": "به‌ڵکو بڕوای نه‌هێناو پشتی تێکرد.",
                            "verse 75:33": "پاشان هه‌موو جار به له‌نجه‌و لارو خۆبادانه‌وه ده‌گه‌ڕایه‌وه بۆ ناو که‌سوکاری و که‌شخه‌ی ده‌کرد.",
                            "verse 75:34": "(جا ئه‌م دۆزه‌خه‌) بۆ تۆ شیاوتره‌و له‌بارتره‌.",
                            "verse 75:35": "پاشان هه‌ر ئه‌و سزایه بۆ تۆ شیاوتره‌و له‌بارتره‌.",
                            "verse 75:36": "ئایا ئاده‌میزاد واده‌زانێت هه‌روا وازی لێده‌هێنرێت به‌خۆڕایی (لێپرسینه‌وه‌ی نابێت؟!).",
                            "verse 75:37": "باشه‌، ئایا کاتی خۆی نوتفه‌یه‌ك نه‌بووه له‌مه‌نی که ده‌ڕژێنرایه شوێنی خۆی (که منداڵانی دایکه‌).",
                            "verse 75:38": "پاشان خۆ هه‌ڵواسه‌رێك بوو گه‌شه‌ی کردوو و ڕۆح و ده‌زگاکانی ده‌ره‌وه‌و ناوه‌وه‌ی به‌ڕێکوپێکی پێبه‌خشی.",
                            "verse 75:39": "ئینجا هه‌ر له‌و مه‌نی یه هه‌ردوو جووت نێرو مێ ی دروست کردووه (که ته‌واوکاری یه‌کترن).",
                            "verse 75:40": "ئایا ئه‌و زاته‌ی ئه‌وه بکات ناتوانێت مردووه‌کان زیندوو بکاته‌وه‌؟!"
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "Aku bersumpah dengan hari kiamat;",
                            "verse 75:2": "Dan Aku bersumpah dengan \"Nafsul Lawwaamah\" (bahawa kamu akan dibangkitkan sesudah mati)!",
                            "verse 75:3": "Patutkah manusia (yang kafir) menyangka bahawa Kami tidak akan dapat mengumpulkan tulang-tulangnya (dan menghidupkannya semula)?",
                            "verse 75:4": "Bukan sebagaimana yang disangka itu, bahkan Kami berkuasa menyusun (dengan sempurnanya segala tulang) jarinya, (tulang yang lebih halus dari yang lain).",
                            "verse 75:5": "(Kebenaran itu bukan tidak ada buktinya), bahkan manusia (yang ingkar) sentiasa suka hendak meneruskan perbuatan kufur dan maksiat (di sepanjang hayatnya, sehingga dia tidak mengakui adanya hari kiamat).",
                            "verse 75:6": "Dia bertanya (secara mengejek): Bilakah datangnya hari kiamat itu?",
                            "verse 75:7": "Maka (jawabnya: Hari kiamat akan datang) apabila pemandangan menjadi terpendar-pendar (kerana gerun takut),",
                            "verse 75:8": "Dan bulan hilang cahayanya,",
                            "verse 75:9": "Dan matahari serta bulan dihimpunkan bersama,",
                            "verse 75:10": "(Maka) pada hari itu, berkatalah manusia (yang ingkarkan hari kiamat): Ke manakah hendak melarikan diri?",
                            "verse 75:11": "Tak usahlah bertanya demikian! Tidak ada lagi tempat perlindungan!",
                            "verse 75:12": "Pada hari itu, kepada Tuhanmulah sahaja terserahnya ketetapan segala perkara.",
                            "verse 75:13": "Pada hari itu, manusia diberitahu akan apa yang dia telah lakukan dan apa yang dia telah tinggalkan.",
                            "verse 75:14": "Bahkan manusia itu, (anggotanya) menjadi saksi terhadap dirinya sendiri,",
                            "verse 75:15": "Walaupun dia memberikan alasan-alasannya (untuk membela diri).",
                            "verse 75:16": "Janganlah engkau (wahai Muhammad) Kerana hendakkan cepat menghafaz Quran yang diturunkan kepadamu menggerakkan lidahmu membacanya (sebelum selesai dibacakan kepadamu).",
                            "verse 75:17": "Sesungguhnya Kamilah yang berkuasa mengumpulkan Al-Quran itu (dalam dadamu) dan menetapkan bacaannya (pada lidahmu);",
                            "verse 75:18": "Oleh itu, apabila Kami telah menyempurnakan bacaannya (kepadamu, dengan perantaraan Jibril), maka bacalah menurut bacaannya itu;",
                            "verse 75:19": "Kemudian, sesungguhnya kepada Kamilah terserah urusan menjelaskan kandungannya (yang memerlukan penjelasan).",
                            "verse 75:20": "Sedarlah wahai orang-orang yang lalai. (Sebenarnya kamu tidak ingatkan kesudahan kamu) bahkan kamu sentiasa mencintai (Kesenangan dan kemewahan dunia) yang cepat habisnya.",
                            "verse 75:21": "Dan kamu tidak menghiraukan (bekalan untuk) hari akhirat (yang kekal abadi kehidupannya).",
                            "verse 75:22": "Pada hari akhirat itu, muka (orang-orang yang beriman) berseri-seri;",
                            "verse 75:23": "Melihat kepada Tuhannya.",
                            "verse 75:24": "Dan pada hari itu, muka (orang-orang kafir) muram hodoh,",
                            "verse 75:25": "Sambil percaya dengan yakin bahawa mereka akan ditimpa malapetaka (azab seksa) yang membinasakan.",
                            "verse 75:26": "Sedarlah (janganlah mengutamakan dunia dan melupakan akhirat. Ingatlah akan hal orang yang hendak mati) apabila rohnya sampai ke pangkal kerongkong,",
                            "verse 75:27": "Dan (orang-orang yang hadir di sisinya heboh) berkata: Siapakah yang dapat menawar jampi (dan mengubatnya)?",
                            "verse 75:28": "Dan dia sendiri yakin, bahawa sesungguhnya saat itu saat perpisahan;",
                            "verse 75:29": "Serta kedahsyatan bertindih-tindih;",
                            "verse 75:30": "(Maka) kepada Tuhanmulah pada waktu itu engkau dibawa (untuk menerima balasan).",
                            "verse 75:31": "(Oleh sebab orang yang kufur ingkar tidak percayakan hari akhirat) maka dia tidak mengakui kebenaran (yang diwajibkan meyakininya) dan dia tidak mengerjakan sembahyang (yang difardhukan mengerjakannya)!",
                            "verse 75:32": "Akan tetapi dia mendustakan dan berpaling ingkar!",
                            "verse 75:33": "Kemudian dia pergi kepada keluarganya dengan berlagak sombong megah.",
                            "verse 75:34": "(Wahai orang yang kufur ingkar!) sudahlah dekat kepadamu kebinasaanmu, sudahlah dekat!",
                            "verse 75:35": "Kemudian api Nerakalah lebih layak bagimu, lebih layak.",
                            "verse 75:36": "Patutkah manusia menyangka, bahawa dia akan ditinggalkan terbiar (dengan tidak diberikan tanggungjawab dan tidak dihidupkan menerima balasan)?",
                            "verse 75:37": "Bukankah dia berasal dari air mani yang dipancarkan (ke dalam rahim)?",
                            "verse 75:38": "Kemudian air mani itu menjadi sebuku darah beku, sesudah itu Tuhan menciptakannya, dan menyempurnakan kejadiannya (sebagai manusia)?",
                            "verse 75:39": "Lalu Tuhan menjadikan daripadanya dua jenis lelaki dan perempuan.",
                            "verse 75:40": "Adakah (Tuhan yang menjadikan semuanya) itu tidak berkuasa menghidupkan orang-orang yang mati? (Tentulah berkuasa)!"
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "سوگند به روز قيامت،",
                            "verse 75:2": "و سوگند به (نفس لوامه و) وجدان بيدار و ملامتگر (كه رستاخيز حق است)!",
                            "verse 75:3": "آيا انسان مى‏پندارد كه هرگز استخوانهاى او را جمع نخواهيم كرد؟!",
                            "verse 75:4": "آرى قادريم كه (حتى خطوط سر) انگشتان او را موزون و مرتب كنيم!",
                            "verse 75:5": "(انسان شك در معاد ندارد) بلكه او مى‏خواهد (آزاد باشد و بدون ترس از دادگاه قيامت) در تمام عمر گناه كند!",
                            "verse 75:6": "(از اين رو) مى‏پرسد: «قيامت كى خواهد بود»!",
                            "verse 75:7": "(بگو:) در آن هنگام كه چشمها از شدت وحشت به گردش درآيد،",
                            "verse 75:8": "و ماه بى‏نور گردد،",
                            "verse 75:9": "و خورشيد و ماه يك جا جمع شوند،",
                            "verse 75:10": "آن روز انسان مى‏گويد: «راه فرار كجاست؟!»",
                            "verse 75:11": "هرگز چنين نيست، راه فرار و پناهگاهى وجود ندارد!",
                            "verse 75:12": "آن روز قرارگاه نهايى تنها بسوى پروردگار تو است;",
                            "verse 75:13": "و در آن روز انسان را از تمام كارهايى كه از پيش يا پس فرستاده آگاه مى‏كنند!",
                            "verse 75:14": "بلكه انسان خودش از وضع خود آگاه است،",
                            "verse 75:15": "هر چند (در ظاهر) براى خود عذرهايى بتراشد!",
                            "verse 75:16": "زبانت را بخاطر عجله براى خواندن آن ( ) حركت مده،",
                            "verse 75:17": "چرا كه جمع‏كردن و خواندن آن بر عهده ماست!",
                            "verse 75:18": "پس هر گاه آن را خوانديم، از خواندن آن پيروى كن!",
                            "verse 75:19": "سپس بيان و (توضيح) آن (نيز) بر عهده ماست!",
                            "verse 75:20": "چنين نيست كه شما مى‏پنداريد (و دلايل معاد را كافى نمى‏دانيد); بلكه شما دنياى زودگذر را دوست داريد (و هوسرانى بى‏قيد و شرط را)!",
                            "verse 75:21": "و آخرت را رها مى‏كنيد!",
                            "verse 75:22": "(آرى) در آن روز صورتهايى شاداب و مسرور است،",
                            "verse 75:23": "و به پروردگارش مى‏نگرد!",
                            "verse 75:24": "و در آن روز صورتهايى عبوس و در هم كشيده است،",
                            "verse 75:25": "زيرا مى‏داند عذابى در پيش دارد كه پشت را در هم مى‏شكند!",
                            "verse 75:26": "چنين نيست (كه انسان مى‏پندارد! او ايمان نمى‏آورد) تا موقعى كه جان به گلوگاهش رسد،",
                            "verse 75:27": "و گفته شود: «آيا كسى هست كه (اين بيمار را از مرگ) نجات دهد؟!»",
                            "verse 75:28": "و به جدائى از دنيا يقين پيدا كند،",
                            "verse 75:29": "و ساق پاها (از سختى جان‏دادن) به هم بپيچد!",
                            "verse 75:30": "(آرى) در آن روز مسير همه بسوى (دادگاه) پروردگارت خواهد بود!",
                            "verse 75:31": "(در آن روز گفته مى‏شود:) او هرگز ايمان نياورد و نماز نخواند،",
                            "verse 75:32": "بلكه تكذيب كرد و روى‏گردان شد،",
                            "verse 75:33": "سپس بسوى خانواده خود بازگشت در حالى كه متكبرانه قدم برمى‏داشت!",
                            "verse 75:34": "(با اين اعمال) عذاب الهى براى تو شايسته‏تر است، شايسته‏تر!",
                            "verse 75:35": "سپس عذاب الهى براى تو شايسته‏تر است، شايسته‏تر!",
                            "verse 75:36": "آيا انسان گمان مى‏كند بى‏هدف رها مى‏شود؟!",
                            "verse 75:37": "آيا او نطفه‏اى از منى كه در رحم ريخته مى‏شود نبود؟!",
                            "verse 75:38": "سپس بصورت خون بسته در آمد، و خداوند او را آفريد و موزون ساخت،",
                            "verse 75:39": "و از او دو زوج مرد و زن آفريد!",
                            "verse 75:40": "آيا چنين كسى قادر نيست كه مردگان را زنده كند؟!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 75:1": "Nu! Jur pe Ziua Învierii!",
                            "verse 75:2": "Și nu! Jur pe sufletul care singur se învinuiește!",
                            "verse 75:3": "Oare socotește omul cã Noi nu vom aduna din nou oasele sale?",
                            "verse 75:4": "Ba da! Noi suntem în stare sã potrivim la loc și vârfurile degetelor sale!",
                            "verse 75:5": "Însã omul voiește mai degrabã sã pãcãtuiascã înainte .",
                            "verse 75:6": "El întreabã: \"Când va fi Ziua Învierii?\"",
                            "verse 75:7": "Atunci când vederea va fi orbitã",
                            "verse 75:8": "Și Luna se va întuneca",
                            "verse 75:9": "Și Soarele și Luna vor fi deopotrivã .",
                            "verse 75:10": "În Ziua aceea, omul va zice: \"Unde este scãparea?\"",
                            "verse 75:11": "Nici vorbã! Nu va fi loc de scãpare!",
                            "verse 75:12": "Numai la Domnul tãu va fi în Ziua aceea întoarcerea!",
                            "verse 75:13": "În Ziua aceea, i se va vesti omului ceea ce a dat mai înainte și ceea ce a lãsat pentru mai târziu.",
                            "verse 75:14": "Ba omul va fi o mãrturie limpede împotriva lui însuși,",
                            "verse 75:15": "Chiar dacã el va aduce dezvinovãțirile sale.",
                            "verse 75:16": "Nu mișca limba ta pentru ca sã-l grãbești!",
                            "verse 75:17": "Noi suntem datori cu strângerea lui și cu recitarea lui ,",
                            "verse 75:18": "Iar când Noi îl vom recita, urmeazã recitarea sa!",
                            "verse 75:19": "Apoi, Noi suntem datori cu tâlcuirea lui.",
                            "verse 75:20": "Dar nu! Voi iubiți [viața] cea trecãtoare",
                            "verse 75:21": "Și sunteți nepãsãtori fațã de Viața de Apoi!",
                            "verse 75:22": "În Ziua aceea, vor fi unele chipuri luminoase,",
                            "verse 75:23": "Care vor privi spre Domnul lor,",
                            "verse 75:24": "Iar alte chipuri vor fi în Ziua aceea întunecate,",
                            "verse 75:25": "Așteptând sã li se întâmple o nenorocire.",
                            "verse 75:26": "Dar nu! Când [sufletul] va ajunge la clavicule",
                            "verse 75:27": "Și se va zice: \"Cine este tãmãduitor?\"",
                            "verse 75:28": "Și el va crede cã aceasta este despãrțirea [de viațã],",
                            "verse 75:29": "Și piciorul se va încolãci cu piciorul [gambele] ,",
                            "verse 75:30": "În Ziua aceea la Domnul tãu vei fi condus!",
                            "verse 75:31": "Însã el nici nu a crezut , nici nu a fãcut Rugãciunea.",
                            "verse 75:32": "Ci, dimpotrivã, el a învinuit de minciunã și a întors spatele,",
                            "verse 75:33": "Apoi s-a dus spre familia sa, pãșind cu îngâmfare.",
                            "verse 75:34": "Vai ție, vai!",
                            "verse 75:35": "Și încã o datã: Vai ție, vai!",
                            "verse 75:36": "Oare omul își închipuie cã el va fi lãsat în voie?",
                            "verse 75:37": "Oare nu a fost el o picãturã din sãmânța vãrsatã?",
                            "verse 75:38": "Apoi a fost un cheag de sânge, apoi [Allah] l-a plãmãdit și i-a dat chip armonios",
                            "verse 75:39": "Și a fãcut din el doi soți - bãrbat și muiere?",
                            "verse 75:40": "Și oare Acesta [Allah] nu are putere sã-i învie pe cei morți?"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 75:1": "Nu! Jur pe Ziua Învierii!",
                            "verse 75:2": "Nu! Jur pe sufletul mereu-dojenitor!",
                            "verse 75:3": "Omul socoate că nu-i vom strânge la un loc oasele?",
                            "verse 75:4": "Ba da! Noi avem putinţa de a-i potrivi şi oscioarele degetelor sale.",
                            "verse 75:5": "Înainte de aceasta însă, omul doreşte întotdeauna desfrâul.",
                            "verse 75:6": "El întreabă: “Când va veni Ziua Învierii?”",
                            "verse 75:7": "Atunci când vederea fi-va fulgerată,",
                            "verse 75:8": "când luna fi-va acoperită,",
                            "verse 75:9": "când soarele şi luna împreună fi-vor puşi.",
                            "verse 75:10": "În Ziua aceea omul va spune: “Încotro este oare scăparea?”",
                            "verse 75:11": "Ba nu! Nu este nici un cotlon de ascunzătoare.",
                            "verse 75:12": "În Ziua aceea, numai la Domnul tău găsi-vei alinare.",
                            "verse 75:13": "În Ziua aceea, omului i se va da ştire cu ce a ieşit înainte şi cu ce a rămas în urmă.",
                            "verse 75:14": "Omul asupra lui însuşi este mărturie vădită,",
                            "verse 75:15": "chiar dacă îşi deşartă dezvinuirile.",
                            "verse 75:16": "Nu-ţi mişca limba, atunci când îl citeşti zorindu-te la capăt să ajungi!",
                            "verse 75:17": "Noi trebuie să-l strângem la un loc şi să-l citim!",
                            "verse 75:18": "Şi dacă l-am citit, să-l citim iarăşi!",
                            "verse 75:19": "Căci Nouă ne este lăsat să-l facem pe înţeles!",
                            "verse 75:20": "Ba nu! Voi iubiţi degrabă-trecătoarea",
                            "verse 75:21": "şi daţi la spate Viaţa de Apoi.",
                            "verse 75:22": "În Ziua aceea, vor fi chipuri luminate",
                            "verse 75:23": "către Domnul lor căutând.",
                            "verse 75:24": "În Ziua aceea, vor fi chipuri întunecate,",
                            "verse 75:25": "la ce le va face zdrobitoarea de coaste, cugetând.",
                            "verse 75:26": "Ba nu! Când sufletul va sta să iasă,",
                            "verse 75:27": "i se va spune: “Cine este vrăjitor?”",
                            "verse 75:28": "Când omul îşi dă seama că desprinderea este aproape,",
                            "verse 75:29": "şi picioarele i se vor strânge unul într-altul,",
                            "verse 75:30": "în Ziua aceea, către Domnul tău vei fi mânat.",
                            "verse 75:31": "El nu a crezut şi nici nu s-a rugat,",
                            "verse 75:32": "ci a hulit şi spatele a întors,",
                            "verse 75:33": "apoi ţanţoş la ai săi a mers",
                            "verse 75:34": "Vai ţie! Vai!",
                            "verse 75:35": "Şi iarăşi: Vai ţie! Vai!",
                            "verse 75:36": "Socoate omul oare că va fi lăsat de izbelişte?",
                            "verse 75:37": "N-a fost el oare o picătură de sămânţă lepădată,",
                            "verse 75:38": "iar apoi un cheag de sânge? Dumnezeu l-a creat şi l-a cizelat,",
                            "verse 75:39": "apoi din el o pereche a făcut: bărbat şi femeie.",
                            "verse 75:40": "Oare Cel ce a făcut aceasta n-ar avea putinţa să dăruiască morţilor viaţă?"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "О да! Днем Воскресения клянусь2285,",
                            "verse 75:2": "Клянусь душой, исполненной(само)укора,(Зовущей воздержаться от греха)!",
                            "verse 75:3": "Ужель уверен человек, что Мы костейего не соберем,(Когда они уже истлели)?",
                            "verse 75:4": "Не только так!Мы можем его пальцев кончикисобратьВ порядке совершенном.",
                            "verse 75:5": "Но хочет человек распутничать(в грехах)За время, (что отпущено ему) в сейжизни.",
                            "verse 75:6": "И вопрошает он:«Когда ж День Воскресения наступит?»",
                            "verse 75:7": "Тогда всяк ослепится взор,",
                            "verse 75:8": "И в темень скатится луна,",
                            "verse 75:9": "И солнце, и луна(В затмении иль восхождении)сойдутся вместе, —",
                            "verse 75:10": "В тот ДеньВоскликнет человек:«Где (мне) убежища (искать)?»",
                            "verse 75:11": "Но нет же! Никаких убежищ!",
                            "verse 75:12": "И лишь у твоего ВладыкиВ тот День —(Последнее) пристанище твое.",
                            "verse 75:13": "И человеку возвестятВ тот День,Что он себе вперед уготовалИ что (без выполнения) оставил.",
                            "verse 75:14": "И будет человекВ тот ДеньСам показания давать против себя.",
                            "verse 75:15": "И даже если он представит извиненья,(Они Аллахом приняты не будут).",
                            "verse 75:16": "(О Мухаммад!) Ты не спешипереложить(Ниспосланные откровения Корана)на язык,(Боясь, что ускользнут они).",
                            "verse 75:17": "На Нас лежит соединение (частей)и чтение (Корана).",
                            "verse 75:18": "Когда же Мы тебе его читаем2286,(Внимательно его) словам ты следуй!",
                            "verse 75:19": "На Нас лежит и разъяснение его.",
                            "verse 75:20": "Но нет! Мила вам суета и тще’та (этойжизни),",
                            "verse 75:21": "И оставляете вы жизнь вторую(без вниманья).",
                            "verse 75:22": "В тот ДеньСияющими будут лица у одних,",
                            "verse 75:23": "Взирающих на своего Владыку.",
                            "verse 75:24": "Другие ж лица в этот ДеньПечаль и мрак покроют",
                            "verse 75:25": "В предвестии беды, ломающей хребет.",
                            "verse 75:26": "Когда (душа при выходе из тела)Подступит к самой горловине",
                            "verse 75:27": "(И прозвучит):«Кто может исцелить его?Кто сможет жизнь ему вернуть?»,",
                            "verse 75:28": "Тогда познает человек,Что это — час разлуки (с жизнью).",
                            "verse 75:29": "И тут одна его голеньПримкнет к другой голени.",
                            "verse 75:30": "И лишь к Владыке твоемуВ тот День — пригон.",
                            "verse 75:31": "Ведь он не веровал, и не молился,",
                            "verse 75:32": "И верой пренебрег, и отвернулся,",
                            "verse 75:33": "Затем в самодовольствии кичливомПрошествовал перед своей семьей.",
                            "verse 75:34": "Так горе же тебе, (о человек)!О, горе!",
                            "verse 75:35": "И вновь: о, горе, (человек), тебе!О, горе!",
                            "verse 75:36": "Ужель считает человек,Что он оставлен без призора?",
                            "verse 75:37": "Ужель он не был каплей спермы,Что изливается (стрелой)?2286а",
                            "verse 75:38": "Ужель потом не стал(Червеобразным) сгустком,Из коего Господь и сотворил его,и соразмерил,",
                            "verse 75:39": "И из него два (пола) извели: мужскойи женский?",
                            "verse 75:40": "(Так что ж!)Ужель умерших Он не можетвоскресить?(Воистину, Он — может!)"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "¡No! ¡Juro por el día de la Resurreción!",
                            "verse 75:2": "¡Que no! ¡Juro por el alma que reprueba!",
                            "verse 75:3": "¿Cree el hombre que no juntaremos sus huesos?",
                            "verse 75:4": "¡Claro que sí! Somos capaces de recomponer sus dedos.",
                            "verse 75:5": "Pero el hombre preferiría continuar viviendo como un libertino.",
                            "verse 75:6": "Pregunta: «¿Cuándo será el día de la Resurrección?»",
                            "verse 75:7": "Cuando se ofusque la vista,",
                            "verse 75:8": "se eclipse la luna,",
                            "verse 75:9": "se reúnan el sol y la luna,",
                            "verse 75:10": "ese día, el hombre dirá: «Y ¿adónde escapar?»",
                            "verse 75:11": "¡No! ¡No habrá escape!",
                            "verse 75:12": "Ese día, el lugar de descanso estará junto a tu Señor.",
                            "verse 75:13": "Ese día, ya se le informará al hombre de lo que hizo y de lo que dejó de hacer.",
                            "verse 75:14": "¡Más aún! El hombre testificará contra sí mismo,",
                            "verse 75:15": "aun cuando presente sus excusas.",
                            "verse 75:16": "No muevas la lengua al recitarlo para precipitarla!",
                            "verse 75:17": "¡Somos Nosotros los encargados de juntarlo y de recitarlo!",
                            "verse 75:18": "Y, cuando lo recitemos, ¡sigue la recitación!",
                            "verse 75:19": "Luego, a Nosotros nos toca explicarlo.",
                            "verse 75:20": "Pero ¡no! En lugar de eso, amáis la vida fugaz",
                            "verse 75:21": "y descuidáis la otra vida.",
                            "verse 75:22": "Ese día, unos rostros brillarán,",
                            "verse 75:23": "mirando a su Señor,",
                            "verse 75:24": "mientras que otros, ese día, estarán tristes,",
                            "verse 75:25": "pensando que una calamidad les alcance.",
                            "verse 75:26": "¡No! Cuando suba hasta las clavículas,",
                            "verse 75:27": "se diga: «¿quién es encantador?»,",
                            "verse 75:28": "crea llegado el momento de la separación",
                            "verse 75:29": "y se junte una pierna con otra,",
                            "verse 75:30": "ese día la marcha será hacia tu Señor.",
                            "verse 75:31": "No creyó, ni oró,",
                            "verse 75:32": "antes bien, desmintió y se desvió.",
                            "verse 75:33": "Luego, se volvió a los suyos con andar altanero.",
                            "verse 75:34": "¡Ay de ti! ¡Ay!",
                            "verse 75:35": "¡Sí! ¡Ay de ti! ¡Ay!",
                            "verse 75:36": "¿Cree el hombre que no van a ocuparse de él?",
                            "verse 75:37": "¿No fue una gota de esperma eyaculada",
                            "verse 75:38": "y, luego, un coágulo de sangre? Él lo creó y le dio forma armoniosa.",
                            "verse 75:39": "E hizo de él una pareja: varón y hembra.",
                            "verse 75:40": "Ese tal ¿no será capaz de devolver la vida a los muertos?"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "கியாம நாளின் மீது நான் சத்தியம் செய்கின்றேன்.",
                            "verse 75:2": "நிந்தித்துக் கொண்டிருக்கும் ஆன்மாவின் மீதும் நான் சத்தியம் செய்கின்றேன்.",
                            "verse 75:3": "(மரித்து உக்கிப்போன) மனிதனின் எலும்புகளை நாம் ஒன்று சேர்க்கவே மாட்டோம் என்று மனிதன் எண்ணுகின்றானா?",
                            "verse 75:4": "அன்று, அவன் நுனி விரல்களையும் (முன்னிருந்தவாறே) செவ்வையாக்க நாம் ஆற்றலுடையோம்.",
                            "verse 75:5": "எனினும் மனிதன் தன் எதிரே வர விருப்பதை (கியாம நாள்) பொய்ப்பிக்கவே நாடுகிறான்.",
                            "verse 75:6": "\"கியாம நாள் எப்போழுது வரும்?\" என்று (ஏளனமாகக்) கேட்கிறான்.",
                            "verse 75:7": "ஆகவே, பார்வையும் மழுங்கி-",
                            "verse 75:8": "சந்திரன் ஒளியும் மங்கி-",
                            "verse 75:9": "சூரியனும் சந்திரனும் ஒன்று சேர்க்கப்பட்டுவிடும் .",
                            "verse 75:10": "அந்நாளில் \"(தப்பித்துக் கௌ;ள) எங்கு விரண்டோடுவது?\" என்று மனிதன் கேட்பான்.",
                            "verse 75:11": "\"இல்லை, இல்லை! தப்ப இடமேயில்லை!\" (என்று கூறப்படும்).",
                            "verse 75:12": "அந்நாளில் உம் இறைவனிடம் தான் தங்குமிடம் உண்டு.",
                            "verse 75:13": "அந்நாளில், மனிதன் முற்படுத்தி (அனுப்பி)யதையும், (உலகில்) பின் விட்டு வைத்ததையும் பற்றி அறிவிக்கப்படுவான்.",
                            "verse 75:14": "எனினும் மனிதன் தனக்கு எதிராகவே சாட்சி கூறுபவனாக இருக்கிறான்.",
                            "verse 75:15": "அவன் தன்(பிழைகளை மறைக்க) புகல்களை எடுத்துப் போட்ட போதிலும்!",
                            "verse 75:16": "(நபியே!) அவசரப்பட்டு அதற்காக (குர்ஆனை ஓதவதற்காக) உம் நாவை அசைக்காதீர்கள்.",
                            "verse 75:17": "நிச்சயமாக அதனை (குர்ஆனை) ஒன்று சேர்ப்பதும், (நீர்) அதை ஓதும்படிச் செய்வதும் நம் மீதே உள்ளன.",
                            "verse 75:18": "எனவே (ஜிப்ரயீலின் வாயிலாக), அதனை நாம் ஓதி விட்டோமாயின், அப்பால், அதன் ஓதுதலை பின் தொடர்ந்து (ஓதிக்) கொள்ளுங்கள்.",
                            "verse 75:19": "பின்னர், அதனை விளக்குவது நிச்சயமாக நம்மீதே உள்ளது.",
                            "verse 75:20": "எனினும் (மனிதர்களே!) நிச்சயமாக நீங்கள் அவசரப்படுவதையே பிரியப்படுகிறீர்கள்.",
                            "verse 75:21": "ஆகவேதான் (இம்மையைப் பற்றிக் கொண்டு) மறுமையை விட்டு விடுகிறீர்கள்.",
                            "verse 75:22": "அந்நாளில் சில முகங்கள் (மகிழ்ச்சியால்) செழுமையாக இருக்கும்.",
                            "verse 75:23": "தம்முடைய இறைவனளவில் நோக்கிய வையாக இருக்கும்.",
                            "verse 75:24": "ஆனால், அந்நாளில் வேறு சில முகங்களோ (துக்கத்தால்) சுண்டியிருக்கும்.",
                            "verse 75:25": "இடுப்பை ஒடிக்கும் ஒரு பேராபத்து தம்மீது ஏற்படப் போவதாக அவை உறுதி கொண்டிருக்கும்.",
                            "verse 75:26": "அவ்வாறல்ல! (மரண வேளையில் அவன் உயிர்) தொண்டைக்குழியை அடைந்து விட்டால்,",
                            "verse 75:27": "\"மந்திரிப்பவன் யார்?\" எனக் கேட்கப்படுகிறது.",
                            "verse 75:28": "ஆனால், அவனோ நிச்சயமாக அதுதான் தன் பிரிவு (காலம்) என்பதை உறுதி கொள்கிறான்.",
                            "verse 75:29": "இன்னும் கெண்டைக்கால் கெண்டைக்காலுடன் பின்னிக் கொள்ளும்.",
                            "verse 75:30": "உம் இறைவன் பால் அந்நாளில் தான் இழுத்துச் செல்லப்படுதல் இருக்கிறது.",
                            "verse 75:31": "ஆனால் (அம்மனிதனோ சன்மார்க்கத்தின் மீது) உறுதிகொள்ளவுமில்லை, அவன் தொழவுமில்லை.",
                            "verse 75:32": "ஆகவே, அவன் பொய்ப்பித்து முகம் திருப்பியுங் கொண்டான்.",
                            "verse 75:33": "பின்னர், அவன் தன் குடும்பத்தாரிடம் - மமதையோடு சென்று விட்டான்.",
                            "verse 75:34": "கேடு உனக்கே! (மனிதனே! உனக்குக்) கேடுதான்!",
                            "verse 75:35": "பின்னரும், உனக்கே கேடு! அப்பாலும் கேடுதான்.",
                            "verse 75:36": "வெறுமனே விட்டுவிடப் படுவான் என்று மனிதன் எண்ணிக் கொள்கிறானா?",
                            "verse 75:37": "(கர்ப்பக் கோளறைக்குள்) சொட்டுச் சொட்டாய் ஊற்றப்படும் இந்திரியத்துளியாக அவன் இருக்கவில்லையா?",
                            "verse 75:38": "பின்னர் அவன் 'அலக்' என்ற நிலையில் இருந்தான், அப்பால் (இறைவன் அவனைப்) படைத்து செவ்வையாக்கினான்.",
                            "verse 75:39": "பின்னர் அதிலிருந்து ஆண், பெண் என்ற இரு ஜோடியை அவன் உண்டாக்கினான்.",
                            "verse 75:40": "(இவ்வாறு படைக்கும்) அவன் மரித்தோரை உயிர்ப்பிக்கும் ஆற்றல் உடையவன் அல்லவா?"
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "ข้าสาบานต่อวันกิยามะฮ์",
                            "verse 75:2": "และข้าขอสาบานต่อชีวิตที่ประณามตนเอง",
                            "verse 75:3": "มนุษย์คิดหรือว่า เราจะไม่รวบรวมกระดูกของเขากระนั้นหรือ ?",
                            "verse 75:4": "แน่นอนทีเดียวเราสามารถที่จะทำให้ปลายนิ้วมือของเขาอยู่ในสภาพที่สมบูรณ์",
                            "verse 75:5": "แต่ว่ามนุษย์นั้นประสงค์ที่จะทำความชั่ว",
                            "verse 75:6": "เขาถามว่า เมื่อใดเถ่าวันแห่งการฟื้นคืนชีพ (จะเกิดขึ้น)",
                            "verse 75:7": "แต่เมื่อสายตามืดมัว",
                            "verse 75:8": "และเมื่อดวงจันทร์ถูกบดบังอยู่ในความมืด",
                            "verse 75:9": "และเมื่อดวงอาทิตย์และดวงจันทร์ถูกนำมารวมกัน",
                            "verse 75:10": "วันนั้นมนุษย์จะกล่าวขึ้นว่าไหนเล่าทางหนี ?",
                            "verse 75:11": "เปล่าเลย ! ไม่มีที่พึ่งพิงดอก",
                            "verse 75:12": "ในวันนั้น ยังพระเจ้าของเจ้าเท่านั้น คือที่พักอันสงบสุข",
                            "verse 75:13": "วันนั้นมนุษย์จะถูกแจ้งให้ทราบถึงสิ่งที่ได้กระทำไว้ล่วงหน้าและภายหลัง",
                            "verse 75:14": "เปล่าเลย ! มนุษย์นั้นเป็นพยานต่อตัวของเขาเอง",
                            "verse 75:15": "ถึงแม้ว่าเขาจะเสนอข้อแก้ตัวของเขาก็ตาม",
                            "verse 75:16": "เจ้าอย่ากระดิกลิ้นของเจ้าเนื่องด้วยอัลกุรอานเพื่อเจ้าจะรีบเร่งจดจำ",
                            "verse 75:17": "แท้จริง หน้าที่ของเราคือการรวบรวมอัลกุรอาน (ให้อยู่ในทรวงอกของเจ้า) และการอ่านเพื่อให้จดจำ",
                            "verse 75:18": "ดังนั้นเมื่อเราอ่านอัลกุรอาน เจ้าก็จงติดตามการอ่านนั้น",
                            "verse 75:19": "แล้วแท้จริงหน้าที่ของเราคือ การอธิบายอัลกุรอาน",
                            "verse 75:20": "เปล่าเลย ! แต่ว่าพวกเจ้ารักการมีชีวิตอยู่ในโลกนี้",
                            "verse 75:21": "และพวกเจ้าจะทิ้งปรโลก",
                            "verse 75:22": "ในวันนั้นหลาย ๆ ใบหน้าจะเบิกบาน",
                            "verse 75:23": "จ้องมองไปยังพระเจ้าของมัน",
                            "verse 75:24": "และในวันนั้นหลาย ๆ ใบหน้าจะเศร้าสลด",
                            "verse 75:25": "มันคิดว่าความหายนะอันใหญ่หลวงจะเกิดขึ้นแก่มัน",
                            "verse 75:26": "เปล่าเลย ! เมื่อวิญญาณขึ้นมาถึงคอหอย",
                            "verse 75:27": "และมีผู้กล่าวว่า ใครเล่าเป็นผู้ทำให้เขาฟื้นขึ้นเหมือนเดิม",
                            "verse 75:28": "และเขามั่นใจว่า แท้จริงเขาต้องจากไป",
                            "verse 75:29": "และขาข้างหนึ่งทับขาอีกข้างหนึ่ง (เพราะความกลัว)",
                            "verse 75:30": "วันนั้น จะมีการนำพาไปยังพระเจ้าของเจ้า",
                            "verse 75:31": "เพราะว่าเขาไม่เชื่อมั่น และไม่ละหมาด",
                            "verse 75:32": "แต่เขาปฏิเสธและผินหลังกลับ",
                            "verse 75:33": "แล้วเขาก็เดินอย่างองอาจไปหาพรรคพวกของเขาอย่างหยิ่งยะโส",
                            "verse 75:34": "ความวิบัติจงมีแด่เจ้าเถิด แล้วก็ความวิบัติจงมีแด่เจ้าเถิด",
                            "verse 75:35": "แล้วก็ความวิบัติจงมีแด่เจ้าเถิด แล้วก็ความวิบัติจงมีแด่เจ้าเถิด",
                            "verse 75:36": "มนุษย์คิดหรือว่า เขาจะถูกปล่อยไว้โดยไร้จุดหมายกระนั้นหรือ ?",
                            "verse 75:37": "เขามิได้เป็นน้ำกามหยดหนึ่งจากน้ำอสุจิที่ถูกพุ่งออกมากระนั้นหรือ ?",
                            "verse 75:38": "แล้วเขาได้เป็นก้อนเลือดก้อนหนึ่งแล้วพระองค์ทรงบังเกิดแล้วก็ทรงทำให้ได้สัดส่วนสมบูรณ์",
                            "verse 75:39": "แล้วพระองค์ทรงทำให้เขาเป็นคู่ เป็นเพศชายและเพศหญิง",
                            "verse 75:40": "ดังนั้น พระองค์จะไม่สามารถที่จะให้คนตายมีชีวิตขึ้นมาอีกกระนั้นหรือ ?"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "Kıyamet gününe yemin ederim.",
                            "verse 75:2": "Kendini kınayan (pişmanlık duyan) nefse yemin ederim (diriltilip hesaba çekileceksiniz).",
                            "verse 75:3": "İnsan, kendisinin kemiklerini biraraya toplayamayacağımızı mı sanır?",
                            "verse 75:4": "Evet, bizim, onun parmak uçlarını bile aynen eski haline getirmeye gücümüz yeter.",
                            "verse 75:5": "Fakat insan önündekini (kıyameti) yalanlamak ister.",
                            "verse 75:6": "\"Kıyamet günü ne zamanmış?\" diye sorar.",
                            "verse 75:7": "İşte, göz kamaştığı,",
                            "verse 75:8": "[75.8]Ay tutulduğu,",
                            "verse 75:9": "[75.9]Güneşle ay biraraya getirildiği zaman!",
                            "verse 75:10": "O gün insan, \"Kaçacak yer neresi!\" diyecektir.",
                            "verse 75:11": "Hayır, hayır! (Kaçıp) sığınacak yer yoktur!",
                            "verse 75:12": "O gün varıp durulacak yer, sadece Rabbinin huzurudur.",
                            "verse 75:13": "O gün insana, ileri götürdüğü ve geri bıraktığı ne varsa bildirilir.",
                            "verse 75:14": "Artık insan, kendi kendinin şahididir.",
                            "verse 75:15": "İsterse özürlerini sayıp döksün.",
                            "verse 75:16": "(Resûlüm!) onu (vahyi) çarçabuk almak için dilini kımıldatma.",
                            "verse 75:17": "Şüphesiz onu, toplamak (senin kalbine yerleştirmek) ve onu okutmak bize aittir.",
                            "verse 75:18": "O halde, biz onu okuduğumuz zaman, sen onun okunuşunu takip et.",
                            "verse 75:19": "Sonra şüphen olmasınki, onu açıklamak da bize aittir.",
                            "verse 75:20": "Hayır! Doğrusu siz, çarçabuk geçeni (dünya hayatını ve nimetlerini) seviyorsunuz da,",
                            "verse 75:21": "Ahireti bırakıyorsunuz.",
                            "verse 75:22": "Yüzler vardır ki, o gün ışıl ışıl parıldayacaktır.",
                            "verse 75:23": "Rablerine bakacaklardır (O'nu göreceklerdir).",
                            "verse 75:24": "Yüzler de vardır ki, o gün buruşacaktır;",
                            "verse 75:25": "Kendilerinin, bel kemiklerini kıran bir felâkete uğratılacağını sezeceklerdir.",
                            "verse 75:26": "Artık gözünüzü açın! Ne zaman ki can köprücük kemiğine dayanır,",
                            "verse 75:27": "\"Tedavi edebilecek kimdir?\" denir.",
                            "verse 75:28": "(Can çekişen) bunun gerçek bir ayrılış olduğunu anlar.",
                            "verse 75:29": "Ve bacak bacağa dolaşır.",
                            "verse 75:30": "İşte o gün sevkedilecek yer, sadece Rabbinin huzurudur.",
                            "verse 75:31": "İşte o, (Peygamber'in getirdiğini) doğru kabul etmemiş, namaz da kılmamıştı.",
                            "verse 75:32": "Aksine yalan saymış ve yüz çevirmişti.",
                            "verse 75:33": "Sonra da çalım sata sata yürüyerek kendi ehline (taraftarlarına) gitmişti.",
                            "verse 75:34": "Lâyıktır (o azap) sana, lâyık!",
                            "verse 75:35": "Evet, lâyıktır sana (o azap) lâyık!",
                            "verse 75:36": "İnsan, kendisinin başıboş bırakılacağını mı sanır!",
                            "verse 75:37": "O, (döl yatağına) akıtılan meninin içinden bir nutfe (sperm) değil miydi?",
                            "verse 75:38": "Sonra bu, alaka (aşılanmış yumurta) olmuş, derken Allah onu (insan biçiminde) yaratıp şekillendirmişti.",
                            "verse 75:39": "Ondan da iki eşi, yani erkek ve dişiyi var etmişti.",
                            "verse 75:40": "Peki (bunları yapan) Allah'ın, ölüleri tekrar diriltmeye gücü yetmez mi?"
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 75:1": "Қиёмат куни билан қасам.",
                            "verse 75:2": "Ва маломатчи нафс билан қасам.",
                            "verse 75:3": "(Кофир) Инсон Бизни, унинг суякларини жамлай олмас, деб ўйларми?",
                            "verse 75:4": "Ҳа, Биз унинг бармоқ учларини ҳам асл ҳолига келтиришга қодирмиз.",
                            "verse 75:5": "Балки инсон келажакда фисқу фужур қилишни хоҳлайдир.",
                            "verse 75:6": "У: «Қиёмат куни қачон?» деб сўрайдир.",
                            "verse 75:7": "Қачонки кўз даҳшатда лол қолса.",
                            "verse 75:8": "Ва ой тутилса.",
                            "verse 75:9": "Ва қуёш билан ой жамланса.",
                            "verse 75:10": "Ўшал кунда инсон, қочар жой қайда? деб қолар.",
                            "verse 75:11": "Йўқ! Қочадиган жой йўқ!",
                            "verse 75:12": "У кунда истиқрор фақат Роббинг ҳузурида бўлар.",
                            "verse 75:13": "У кунда инсонга аввалу охир қилганининг хабари берилар.",
                            "verse 75:14": "Ҳа, инсон ўз нафсига қарши ўзи шоҳиддир.",
                            "verse 75:15": "Гарчи узр-маъзурларини тўкиб соладир.",
                            "verse 75:16": "Сен шошилиб, у(Қуръон) билан, тилингни қимирлатма.",
                            "verse 75:17": "Албатта, уни жамлаш ва ўқиб бериш Бизнинг зиммамиздадир.",
                            "verse 75:18": "Бас, Биз уни ўқисак, қироатига зеҳн солиб тур.",
                            "verse 75:19": "Сўнгра уни баён қилиб бериш ҳам Бизнинг зиммамиздадир.",
                            "verse 75:20": "Йўқ! Балки сизлар шошар дунёни яхши кўрасизлар.",
                            "verse 75:21": "Ва охиратни тарк этасизлар.",
                            "verse 75:22": "У кунда бор чиройли юзлар.",
                            "verse 75:23": "Роббисига назар солувчилар.",
                            "verse 75:24": "Ва у кунда бор тиришиб-буришган юзлар.",
                            "verse 75:25": "Ўзига умуртқасин синдирар иш бўлишига ишонар.",
                            "verse 75:26": "Йўқ! жон ҳалқумга келганда.",
                            "verse 75:27": "Ва, қутқарувчи ким? деганда.",
                            "verse 75:28": "Ва, албатта, у фироқлигин билганда.",
                            "verse 75:29": "Ва болдирлар бир-бирига алмашганда.",
                            "verse 75:30": "У кунда ҳайдаб борар жой фақат Роббинггадир. (Яъни, жони ҳалқумига келиб қолганда, уни ҳаётда олиб қолиш учун барча чора кўрилади, Ким қутқараркин, деб илтижо қилинади. Лекин иложи бўлмай фироқ вақти келганига ишонч ҳосил бўлади. Жон чиққанда эса оёқлар жонсиз бўлиб бир-бирига чалмашади.)",
                            "verse 75:31": "Бас, у тасдиқламади ва намоз ўқимади.",
                            "verse 75:32": "Ва лекин ёлғонга чиқарди ва юз ўгирди.",
                            "verse 75:33": "Сўнг ўз аҳлига керилиб борди.",
                            "verse 75:34": "Ҳолингга вой бўлсин сенинг, вой бўлсин!",
                            "verse 75:35": "Яна ҳолингга вой бўлсин сенинг, вой бўлсин!",
                            "verse 75:36": "Инсон беҳуда тарк қилинишнинг ҳисобини қилурми?",
                            "verse 75:37": "У манийдан оққан нутфа бўлмаганмиди?",
                            "verse 75:38": "Сўнг алақа бўлди. Бас бекаму-кўст этиб яратди.",
                            "verse 75:39": "Бас ундан жуфтни–эркак ва аёлни яратди.",
                            "verse 75:40": "Шундай зот ўликларни тирилтиришга қодир эмасми?!"
                        }
                    }
                }
            }
        }
    }
}