{
    "id": 76,
    "name_simple": "Al-Insan",
    "revelation_place": "madinah",
    "revelation_order": 98,
    "bismillah_pre": true,
    "verses_count": 31,
    "short_text": "This Surah is called Ad-Dahr as well as Al-Insan after the words occurring in the first verse.",
    "text": [
        "\n",
        "This Surah is called Ad-Dahr as well as Al-Insan after the words occurring in the first verse.",
        "\n",
        "Period of Revelation",
        "\n",
        "Most of the commentators, including Allama Zamakhshari, Imam Razi, Qadi, Baidawi, Allama Nizam ad-Din Nisaburi, Hafiz Ibn Kathir and many others, regard it as a Makki Surah, and, according to Allama Alusi, the same is the opinion of the majority of scholars. However, some commentators hold the view that the Surah was revealed at Madinah, and some others say that it was revealed at Makkah but vv. 8-10 of it were sent down at Madinah.",
        "\n",
        "As far as the subject matter and the style of the Surah are concerned, these are very different from those of the Madani Surahs. A little study of it rather shown that it is not only a Makki Surah but it was revealed during the earliest period at Makkah, which began just after the revelation of the first seven verses of Surah Al-Muddaththir. As for vv. 8-10, they are so naturally set in the theme of the Surah that if they are read in their proper context, no one can say that the theme preceding and following them had been sent down 15 to 16 years earlier but these three verses which were revealed many years later were inserted here unnaturally.",
        "\n",
        "In fact, the basis of the idea that this Surah; or some verses of it were revealed at Madinah, is a tradition which has related from Ibn Abbas (may Allah bless him). He says that once Hadrat Hasan and Husain fell ill The Holy Prophet and some of his Companions visited them. They wished Hadrat Ali to make a vow to Allah for the recovery of the two children. Thereupon, Hadrat Ali, Hadrat Fatimah and Fiddah their maid servant, vowed a fast of three days if Allah restored the children to health. The children recovered by the grace of Allah and the three of them began to fast as avowed. As there was nothing to eat in the house, Hadrat Ali borrowed three measures (sa') of barley from somebody (according to another tradition, earned through labor). When on the first day they sat down to eat after breaking the fast, a poor man came and begged for food. They gave all their food to him, drank water and retired to bed. The next day when they again sat down to eat after breaking the fast,\r\nan orphan came and begged for something. They again gave away the whole food to him, drank water and went to bed. On the third day when they were just going to eat after breaking the fast, a captive came up and begged for food likewise. Again the whole food was given away to him. On the fourth day Hadrat Ali took both the children with him and went before the Holy Prophet (upon whom be peace). The Holy Prophet (on whom be peace) seeing the weak condition of the three, returned with them to the house of Hadrat Fatimah and found her lying in a corner half dead with hunger. This moved him visibly. In the meantime the Angel Gabriel (peace be on him) came and said; \"Look, Allah has congratulated you on the virtues of the people of your house!\"When the Holy Prophet asked what it was, he recited this whole Surah in response. (According to Ibn Mahran's tradition, he recited it from verse 5 till the end. But the tradition which Ibn Marduyah has related from Ibn Abbas only says that the\r\nverse Wa yut'imun-at ta'am... was sent down concerning Hadrat Ali and Hadrat Fatimah; there is no mention of this story in it). This whole story has been narrated by Ali bin Ahmad al-Wahidi in his Commentary of the Qur'an, entitled Al'Basit, and probably from the same it has been taken by Zamakhshari, Razi, Nisaburi and others.",
        "\n",
        "In the first place, this tradition is very weak as regards its chain of transmission. Then, from the point of view of its subject matter also, it is strange that when a poor man, or an orphan, or a captive, comes to beg for food, he is given all the food. He could be given one member's food and the five of them could share the rest of it among themselves:Then this also is incredible that illustrious persons like Hadrat Ali and Hadrat Fatimah, who possessed perfect knowledge of Islam, should have regarded it as an act of virtue to keep the two children, who had just recovered their health and were still weak, hungry for three consecutive days. Moreover, in respect of the captives also, it has never been a practice under the Islamic government that they should be left to beg for food for themselves. For if they were prisoners of the government, the government itself was responsible to arrange food and clothing for them, and if they were in an individual's custody, he was made\r\nresponsible to feed and clothe them. Therefore, it was not possible that in Madinah a captive should have gone about begging food from door to door. However, overlooking the weaknesses of transmission and the probability of subject matter, even if the narrative is accepted as it goes, at the most what it shows is that when the people of the Holy Prophet's house acted righteously as they did, Gabriel came and gave him the good news that Allah had much appreciated their act of virtue, for they had acted precisely in the righteous way that Allah had commanded in these verses of Surah Ad-Dahr. This does not necessitate that these verses too were sent down on that very occasion. The same is the case with many traditions concerning the occasion of revelation. When about a certain verse it is said that it was sent down on a particular occasion, it in fact does not mean that the verse was sent down on the very occasion the incident took place. But it means that the verse applies precisely\r\nand exactly to the incident. Imam Suyuti in Al-Itqan has quoted this from Hafiz Ibn Taimiyyah: \"When the reporters say that a verse was sent down concerning a particular incident, it sometimes implies that the same incident (or matter) occasioned its revelation, and sometimes that the verse applies to the matter although it may not have occasioned its revelation.\"Further on he quotes Imam Badr ad-Din Zarkashi's view from his Al-Burhan fi Ulum al-Quran :\"It is well known in respect of the Companions and their immediate successors that when one of them says that a verse was sent down concerning a particular matter, it means that the ruling contained in it applied to that matter and not that the matter itself occasioned the revelation of the verse. Thus, it only uses the ruling of the verse for the purpose of reasoning and not for stating a fact.\" (Al-Itqan fi Ulum al-Quran, vol. I, p. 31, Ed. 1929).",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "The theme of this Surah is to inform man of his true position in the world and to tell him that if he understood his true position rightly and adopted the attitude of gratefulness, he would meet with such and such good end, and if he adopted the way of disbelief, he would meet with such and such evil ends In the longer Surahs of the Qur'an this same theme has been presented at length, but a special characteristic of the style of the earliest Surahs revealed at Makkah is that the subjects dealt with at length in the later period, \"have been presented in a brief but highly effective way in this period in such concise, elegant sentences as may automatically be preserved in the memory of the hearers.",
        "\n",
        "In this Surah, first of all man has been reminded that there was a time when he was nothing; then a humble beginning of him was made with a mixed drop of sperm and ovum of which even his mother was not aware; even she did not know that he had been conceived nor anyone else seeing the microscopic cell could say that it was a man, who in future would become the best of creation on the earth. After this, man has been warned, so as to say: \"Beginning your creation in this way We have developed and shaped you into what you are today in order to test and try you in the world. That is why, unlike other creatures, you were made intelligent and sensible and were shown both the way of gratitude and the way of ingratitude clearly so that you may show, in the interval that you have been granted here for work, whether you have emerged as a grateful servant from the test or an unbelieving, Un- grateful wretch!\"",
        "\n",
        "Then, just in one sentence, it has been stated decisively what will be the fate to be met with in the Hereafter by those who emerged as unbelievers from this test.",
        "\n",
        "After this, in vv. 5-22 continuously, the blessings with which those who do full justice to servitude in the world, will be favored, have been mentioned in full detail. In these verses, not only have their best rewards been mentioned but they have also been told briefly what are the acts on the basis of which they would become worthy of those rewards. Another special characteristic of the earliest Surahs revealed at Makkah is that besides introducing in them briefly the fundamental beliefs and concepts of Islam, here and there, those moral qualities and virtuous acts have been mentioned, which are praiseworthy according to Islam, and also those evils of deed and morality of which Islam strives to cleanse human life. And these two things have not been mentioned with a view to show what good or evil result is entailed by them in the transitory life of the world, but they have been mentioned only to point out what enduring results they will produce in the eternal and everlasting\r\nlife of the Hereafter, irrespective of whether an evil quality may prove useful or a good quality may prove harmful in the world.",
        "\n",
        "This is the subject matter of the first section (vv. 1-22). In the second section, addressing the Holy Prophet (upon whom be peace), three things have been stated: first, that \"it is in fact We Ourself Who are revealing this Qur'an piecemeal to you, and this is intended to inform the disbelievers, not you, that the Qur'an is not being fabricated by Muhammad (upon whom be Allah's peace and blessings) but it is \"We Who are revealing it, and it is Our Own wisdom which requires that We should reveal it piece by piece and not all at once.\"Second, the Holy Prophet has been told: \"No matter how long ,it may take for the decree of your Lord to be enforced and no matter what afflictions may befall you in the meantime, in any case you should continue to perform your mission of Apostleship patiently, and not to yield to the pressure tactics of any of these wicked and unbelieving people.\"The third thing he has been told is: \"Remember Allah day and night, perform the Prayer and spend your\r\nnights in the worship of Allah, for it is these things which sustain and strengthen those who call to Allah in the face of iniquity and disbelief.\"",
        "\n",
        "Then in one single sentence, the actual cause of the disbelievers wrong attitude has been stated: they have forgotten the Hereafter and are enamored of the world. In the second sentence, they have been warned to the effect: \"You have not come into being by yourself: We have created you. You have not made these broad chests, and strong, sturdy hands and feet for yourselves, it is We Who made these for you; and it so lies in Our power to treat you as We please. We can distort your figures, We can destroy you and replace you by some other nation. We can cause you to die and can recreate you in whatever form We like.\"",
        "\n",
        "In conclusion, it has been said: This is an Admonition: whoever wills may accept it and take a path to his Lord. But man's own will and desire is not everything in the world. No one's will and desire can be fulfilled unless Allah (also) so wills. And Allah's willing is not haphazard: whatever He wills, He wills it on the basis of His knowledge and wisdom. He admits into His mercy whomever He regards as worthy of His mercy on the basis of His knowledge and wisdom, and He has prepared a painful torment for those whom He finds unjust and wicked.",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that opens with a question posed to arrogant Man about his utter nothingness before God brought him into existence. It takes its name from the word “man” (al-insān) mentioned in verse 1. The surah speaks of how man is tested (verse 2 .) and what the results will be for the evildoers (verse 4) and for the righteous (verse 5 .). The Prophet is urged to persevere in his devotion and to bear with patience (verse 23 .).The surah is also known as: Every (Man).",
    "name_translation": "Man",
    "name_complex": "Al-Insân",
    "surah_name_ar": "الأنسان",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 76:1": "Pa dyshim ka qenë kohë e gjatë (ajo), e që njeriu nuk është përmendur (nuk ka ekzistuar).",
                            "verse 76:2": "Me të vërtetë, Ne e kemi krijuar njeriun nga një farë e përzier (spermës); për ta provuar, dhe e bëmë atë që të dëgjojë dhe të shoh;",
                            "verse 76:3": "Na, ia treguam atij rrugën, e ai (do të jetë) ose mirënjohës ose jomirënjohës;",
                            "verse 76:4": "Na, me të vërtetë, për jobesimtarët kemi përgatitur zingjirë e pranga dhe flakë të zjarrit.",
                            "verse 76:5": "Sigurisht, të ndershmit besimtarë do të pinë nga kupa (në xhennet), pije të përbërë me kambor.",
                            "verse 76:6": "Nga burimi që vetëm adhuruesit e Perëndisë pinë, dhe të cilin mund ta çojnë (bartin) kah të duan;",
                            "verse 76:7": "ata (njerëz) që e zbatojnë premtimin dhe i druajnë Ditës, tmerri i së cilës përhapet gjithëkah,",
                            "verse 76:8": "dhe i ushqejnë të varfërit, bonjakët dhe të zënët robë (në luftë), madje edhe pse janë vetë nevojtarë për te (ushqim).",
                            "verse 76:9": "(Thonë ata): “Na, ju ushqejmë vetëm për hir të Zotit. Na – për këtë, nuk duam shpërblim as falenderim!",
                            "verse 76:10": "Na i druajmë Zotit tonë atë Ditë kur fytyrat janë të vrenjtura dhe të ashpra”.",
                            "verse 76:11": "Perëndia i ruan ata nga tmerret e asaj Dite; Ai atyre u jep shkëlqim (në fytyrat e tyre) dhe gëzim,",
                            "verse 76:12": "dhe, për durimin e tyre (në të drejtë), Ai i shpërblen ata me xhennet dhe (petka) të mëndafshta:",
                            "verse 76:13": "(ata) të mbështetur në kanape, nuk do ta ndjejnë as vapën (e Diellit) dhe as të ftohtit (e dimërit),",
                            "verse 76:14": "dhe do t’u jetë afër tyre hija e pemëve, frutet e të cilave do të mund t’i shfrytëzojnë (kapin) lehtë.",
                            "verse 76:15": "Do të shërbehen ata nga enët e argjendta dhe kupat (si shtamba) e tejdukshme,",
                            "verse 76:16": "të tejdukshme, nga argjendi, madhësinë e të cilave (do ta zgjedhin) sipas dëshirës.",
                            "verse 76:17": "Në të (xhennet) do të pinë shishe pijesh të përziera me Zenxhebil",
                            "verse 76:18": "nga burimi i xhennetit, (pija) e quajtur Selsebil.",
                            "verse 76:19": "Atyre do t’u shërbejnë djelmoshat (shërbyesit) përherë të rinj, - që, kur t’i shikosh, duken se janë margaritarë të shpërndarë.",
                            "verse 76:20": "Dhe, kahdo të shikosh (në xhennet), do të shohësh komoditet e begati të gjerë.",
                            "verse 76:21": "Ata do të janë të veshur me petka të holla mëndafshi të gjelbërt, dhe nga mëndafsi i trashë, të stolisur me bylyzykë të argjendtë, dhe do t’u jap Zoti i tyre të pinë pije të pastërta (të mrekullueshme).",
                            "verse 76:22": "(Ju thuhet atyre): “Ky është shpërblimi juaj; përpjekja juaj (në vepra të mira) është e falenderuar.",
                            "verse 76:23": "Me të vërtetë, Na ta kemi shpallur Kur’anin ty në intervale (kohë pas kohe),",
                            "verse 76:24": "Duro (prite) vendimin e Zotit tënd, e mos dëgjo as mëkatarët, as jobesimtarët!",
                            "verse 76:25": "Dhe, përmende emrin e Zotit tënd në mëngjes dhe në mbrëmje,",
                            "verse 76:26": "dhe, në një pjesë të natës kryej detyrat (falu) për Zotin, dhe falenderoje Atë natën, gjatë!",
                            "verse 76:27": "E, me të vërtetë, këta (jobesimtarët) e duan jetën e këtushme, e nuk e përfillin Ditën e vështirë (Kijametin) që do t’u vie.",
                            "verse 76:28": "Na i kemi krijuar ata dhe Na ua kemi dhënë forcën (e trupit të tyre).",
                            "verse 76:29": "Kjo, me të vërtetë, është këshillë, e kush të dojë, ndjekë rrugën që shpie te Zoti i tij, -",
                            "verse 76:30": "por ju nuk mund të duani, përveç nëse don Perëndia – se, Perëndia, me të vërtetë, është i Plotëdijshëm dhe i Gjithëdijshëm,",
                            "verse 76:31": "atë që don Ai, e shpie në mëshirën e Vet, e jobesimtarëve u ka përgatitur vuajtje të rënda."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "İnsanın elə bir dövrü olub keçmişdir ki, o, xatırlanmağa layiq bir şey olmamışdır! (Yaxud insanın elə bir dövrü olub keçmişdir ki, o həmin dövrdə xatırlanası bir şey olmasın?! Əlbəttə, olmuşdur. İnsan əvvəlcə mövcud deyildi. Sonra o, yə'ni ulu babamız Adəm torpaqdan və sudan yoğrulub insan şəklinə salınmış, ona ruh verilmiş və o, həyat sürməyə başlamışdır. İnsanın nə üçün yaradıldığını əvvəlcə nə göy əhli, nə də o özü bilirdi. Tədriclə mələklər və o özü nə üçün yaradıldığını anladı).",
                            "verse 76:2": "Həqiqətən, Biz insanı (sonrakı mərhələdə ata-anasının toxumundan ibarət) qarışıq bir nütfədən yaratdıq. Biz onu (dünyada özünü necə aparacağı, hər şeyin xaliqi olan Allaha itaət edib-etməyəcəyi ilə) imtahana çəkəcəyik. Biz onu eşidən, görən yaratdıq.",
                            "verse 76:3": "Biz ona haqq yolu göstərdik. İstər (ne'mətlərimizə) minnətdar olsun, istər nankor (bu onun öz işidir).",
                            "verse 76:4": "Biz kafirlər üçün zəncirlər, qandallar və alovlu bir atəş hazırlamışıq.",
                            "verse 76:5": "Şübhəsiz ki, yaxşı əməl və itaət sahibləri (Cənnətdə) kafur qatılmış (şərabla dolu) qədəhdən içəcəklər.",
                            "verse 76:6": "O (kafur) elə bir çeşmədir ki, Allahın bəndələri ondan içəcək və onu (istədikləri yerə) asanlıqla axıdacaqlar.",
                            "verse 76:7": "Onlar (Cənnətə nail olacaq müttəqilər) elə kimsələrdirlər ki, verdikləri sözü (etdikləri nəziri) yerinə yetirər və dəhşətli (aləmi) bürüyəcək (şəri hər tərəfə yayılacaq) gündən (qiyamət günündən) qoxarlar.",
                            "verse 76:8": "Onlar öz iştahaları çəkdiyi (özləri yemək istədikləri) halda (və ya: Allah rizasını qazanmaq uğrunda) yeməyi yoxsula, yetimə və əsirə yedirərlər.",
                            "verse 76:9": "(Və sonra da yedirtdikləri kimsələrə belə deyərlər: ) \"Biz sizi ancaq Allah rizasından ötrü yedirdirik. Biz sizdən (bu ehsan müqabilində) nə bir mükafat, nə də bir təşəkkür istəyirik.",
                            "verse 76:10": "Həqiqətən, biz Rəbbimizdən, çox sərt (müdhiş), cətin gündən (üzlərin dəhşətdən eybəcər kökə düşəcəyi, çöhrələrin tutulub qaralacağı qiyamət günündən) qorxuruq!\"",
                            "verse 76:11": "Allah da onları o günün şərindən qoruyacaq, onlara gözəllik və sevinc bəxş edəcəkdir (üzlərinə təravət verəcək, qəlblərini sevindirəcəkdir).",
                            "verse 76:12": "Və onları etdikləri səbr müqabilində Cənnətlə və (geyəcəkləri) ipəklə mükafatlandıracaqdır.",
                            "verse 76:13": "Onlar orada (o cənnətlərdə) taxtlara söykənəcək, orada nə günəş (qızmar isti), nə də sərt soyuq görəcəklər.",
                            "verse 76:14": "(Cənnət ağaclarının) kölgələri üstlərinə düşəcək, meyvələri də onların ixtiyarında olacaqdır (istədikləri yerdə, istədikləri zaman onları dərib yeyə biləcəklər).",
                            "verse 76:15": "(Cənnətdəki xidmətçilər) onların ətrafında gümüş qablar və büllur qədəhlərlə dolanacaqlar.",
                            "verse 76:16": "Gümüşdən olan (çox şəffaf olduğu üçün bayırından içərisi görünən) elə billur (qədəhlərlə) ki, (xidmətçilər) onları (sahiblərinə) münasib ölçüdə etmişlər.",
                            "verse 76:17": "Orada onlara zəncəfil qatılmış (zəncəfil dadı verən cənnət şərabı ilə dolu) badə də içirdiləcəkdir.",
                            "verse 76:18": "(Zəncəfil) orada (Cənnətdə) bir çeşmədir ki, (suyu boğazdan çox rahat keçdiyi üçün) Səlsəbil adlanır.",
                            "verse 76:19": "Onların dövrəsində həmişəcavan (xidmətçi) oğlanlar olacaqdır. Onları gördükdə, sanki (ətrafa) səpilmiş inci olduqlarını zənn edərsən.",
                            "verse 76:20": "(Orada) hara baxsan, ne'mət və böyük bir mülk görərsən.",
                            "verse 76:21": "(Cənnət əhlinin) əyinlərində taftadan və atlazdan (nazik və qalın ipəkdən) yaşıl libaslar olacaq, onlara gümüşdən bilərziklər taxılacaqdır. Rəbbi onlara çox pak bir şərab içirdəcəkdir.",
                            "verse 76:22": "(Onlara belə deyiləcəkdir: ) \"Bu sizin (dünyada etdiyiniz yaxşı əməllərə görə) mükafatınızdır. Zəhmətiniz (Allah yanında) məqbuldur (təqdirəlayiqdir)!\"",
                            "verse 76:23": "(Ya Peyğəmbər!) Həqiqətən, Biz Qur'anı sənə tədriclə (ayə-ayə, surə-surə) nazil etdik.",
                            "verse 76:24": "Elə isə Rəbbinin hökmünə səbr et və onlardan (Məkkə müşriklərindən) günahkar və nankor olana boyun əymə!",
                            "verse 76:25": "Səhər-axşam Rəbbinin adını zikr et! (Səhər, günorta və ikindi namazlarını qıl!)",
                            "verse 76:26": "Gecənin bir qismində Ona səcdə et (axşam, gecə namazlarını qıl) və gecə uzunu da Onu təqdis edib şə'ninə tə'riflər de! (Təhəccüd namazını qılıb gecəni ibadət içində keçir!)",
                            "verse 76:27": "Həqiqətən, bunlar (Məkkə müşrikləri) tez keçib gedəni (fani dünyanı) sevər, ağır günə (qiyamət gününə) dal çevirərlər.",
                            "verse 76:28": "Onları yaradan da, güclü-qüvvətli edən də (oynaqlarını bir-birinə bağlayan da) Bizik. Əgər istəsək, onları özləri kimilərlə əvəz edərik.",
                            "verse 76:29": "Həqiqətən, bu (surə) bir öyüd-nəsihətdir. Kim istəsə, Rəbbinə tərəf bir yol tutar (ibadət və itaətlə Allaha yaxınlaşar).",
                            "verse 76:30": "(Ey insanlar! Onu da bilin ki) Allah istəməsə, siz (bunu) istəyə bilməzsiniz. (Ancaq Allah istəsə, istəyə bilərsiniz). Həqiqətən, Allah (hər şeyi) biləndir, hikmət sahibidir!",
                            "verse 76:31": "(Allah) istədiyi kimsən ?z mərhəmətinə qovuşdurar. Zalımlara gəldikdə isə, (Allah) onlar üçün (axirətdə) şiddətli bir əzab hazırlamışdır!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "Zar je to davno bilo kad čovjek nije bio spomena vrijedan?",
                            "verse 76:2": "Mi čovjeka od smjese sjemena stvaramo da bismo ga na kušnju stavili i činimo da on čuje i vidi;",
                            "verse 76:3": "Mi mu na Pravi put ukazujemo, a njegovo je da li će zahvalan ili nezahvalan biti;",
                            "verse 76:4": "Mi smo za nevjernike okove i sindžire i oganj razbuktali pripremili.",
                            "verse 76:5": "Čestiti će iz pehara piti kamforom začinjeno piće",
                            "verse 76:6": "sa izvora iz kojeg će samo Allahovi štićenici piti, i koji će kuda hoće bez muke razvoditi.",
                            "verse 76:7": "Oni su zavjet ispunjavali plašeći se Dana čija će kob svuda prisutna biti,",
                            "verse 76:8": "i hranu su davali - mada su je i sami željeli - siromahu i siročetu i sužnju.",
                            "verse 76:9": "Mi vas samo za Allahovu ljubav hranimo, od vas ni priznanja ni zahvalnosti ne tražimo!",
                            "verse 76:10": "Mi se Gospodara našeg bojimo, onog Dana kada će lica smrknuta i namrgođena biti.\"",
                            "verse 76:11": "I njih će Allah strahote toga Dana sačuvati i blaženstvo i radost im darovati",
                            "verse 76:12": "i Džennetom i svilom ih za ono što su trpjeli nagraditi:",
                            "verse 76:13": "naslonjeni na divanima, oni u njemu ni mraz ni žegu neće osjetiti,",
                            "verse 76:14": "i blizu će im hladovina njegova biti, a plodovi njegovi će im na dohvat ruke stajati.",
                            "verse 76:15": "Služiće ih iz srebrenih posuda i čaša prozirnih,",
                            "verse 76:16": "prozirnih, od srebra, čiju će veličinu prema željama njihovim odrediti.",
                            "verse 76:17": "U njemu će iz čaše piće inbirom",
                            "verse 76:18": "sa izvora u Džennetu, koji će se Selsebil zvati.",
                            "verse 76:19": "Služiće ih vječno mlada posluga - da ih vidiš, pomislio bi da su biser prosuti.",
                            "verse 76:20": "I kud god pogledaš, vidjećeš udobnost i carstvo prostrano.",
                            "verse 76:21": "Na njima će biti odijela od tanke zelene svile, i od teške svile, nakićeni narukvicama od srebra, i daće im Gospodar njihov da piju čisto piće.",
                            "verse 76:22": "To vam je nagrada; vaš trud je dostojan blagodarnosti!",
                            "verse 76:23": "Od vremena do vremena Mi objavljujemo Kur’an tebi,",
                            "verse 76:24": "zato izdrži do odluke Gospodara tvoga, i ne slušaj ni grješnika ni nevjernika njihova!",
                            "verse 76:25": "I spominji ime Gospodara svoga ujutro i predvečer,",
                            "verse 76:26": "i u jednom dijelu noći radi njega molitvu obavljaj, i dugo ga noću hvali?",
                            "verse 76:27": "A ovi, oni život na ovom svijetu vole doista, a ništa ih se ne tiče Dan tegobni, koji ih čeka.",
                            "verse 76:28": "Mi ih stvaramo i zglobove im vezujemo, a ako htjednemo, zamijenićemo ih njima sličnim.",
                            "verse 76:29": "Ovo je pouka, pa ko hoće držaće se puta koji Gospodaru njegovu vodi -",
                            "verse 76:30": "a vi ćete htjeti samo ono što Allah hoće - Allah, uistinu, sve zna i mudar je,",
                            "verse 76:31": "On koga hoće uvodi u milost Svoju, a nevjernicima je pripremio tešku patnju."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "মানুষের উপর এমন কিছু সময় অতিবাহিত হয়েছে যখন সে উল্লেখযোগ্য কিছু ছিল না।",
                            "verse 76:2": "আমি মানুষকে সৃষ্টি করেছি মিশ্র শুক্রবিন্দু থেকে, এভাবে যে, তাকে পরীক্ষা করব অতঃপর তাকে করে দিয়েছি শ্রবণ ও দৃষ্টিশক্তিসম্পন্ন।",
                            "verse 76:3": "আমি তাকে পথ দেখিয়ে দিয়েছি। এখন সে হয় কৃতজ্ঞ হয়, না হয় অকৃতজ্ঞ হয়।",
                            "verse 76:4": "আমি অবিশ্বাসীদের জন্যে প্রস্তুত রেখেছি শিকল, বেড়ি ও প্রজ্বলিত অগ্নি।",
                            "verse 76:5": "নিশ্চয়ই সৎকর্মশীলরা পান করবে কাফুর মিশ্রিত পানপাত্র।",
                            "verse 76:6": "এটা একটা ঝরণা, যা থেকে আল্লাহর বান্দাগণ পান করবে-তারা একে প্রবাহিত করবে।",
                            "verse 76:7": "তারা মান্নত পূর্ণ করে এবং সেদিনকে ভয় করে, যেদিনের অনিষ্ট হবে সুদূরপ্রসারী।",
                            "verse 76:8": "তারা আল্লাহর প্রেমে অভাবগ্রস্ত, এতীম ও বন্দীকে আহার্য দান করে।",
                            "verse 76:9": "তারা বলেঃ কেবল আল্লাহর সন্তুষ্টির জন্যে আমরা তোমাদেরকে আহার্য দান করি এবং তোমাদের কাছে কোন প্রতিদান ও কৃতজ্ঞতা কামনা করি না।",
                            "verse 76:10": "আমরা আমাদের পালনকর্তার তরফ থেকে এক ভীতিপ্রদ ভয়ংকর দিনের ভয় রাখি।",
                            "verse 76:11": "অতঃপর আল্লাহ তাদেরকে সেদিনের অনিষ্ট থেকে রক্ষা করবেন এবং তাদেরকে দিবেন সজীবতা ও আনন্দ।",
                            "verse 76:12": "এবং তাদের সবরের প্রতিদানে তাদেরকে দিবেন জান্নাত ও রেশমী পোশাক।",
                            "verse 76:13": "তারা সেখানে সিংহাসনে হেলান দিয়ে বসবে। সেখানে রৌদ্র ও শৈত্য অনুভব করবে না।",
                            "verse 76:14": "তার বৃক্ষছায়া তাদের উপর ঝুঁকে থাকবে এবং তার ফলসমূহ তাদের আয়ত্তাধীন রাখা হবে।",
                            "verse 76:15": "তাদেরকে পরিবেশন করা হবে রূপার পাত্রে এবং স্ফটিকের মত পানপাত্রে।",
                            "verse 76:16": "রূপালী স্ফটিক পাত্রে, পরিবেশনকারীরা তা পরিমাপ করে পূর্ণ করবে।",
                            "verse 76:17": "তাদেরকে সেখানে পান করানো হবে ‘যানজাবীল’ মিশ্রিত পানপাত্র।",
                            "verse 76:18": "এটা জান্নাতস্থিত ‘সালসাবীল’ নামক একটি ঝরণা।",
                            "verse 76:19": "তাদের কাছে ঘোরাফেরা করবে চির কিশোরগণ। আপনি তাদেরকে দেখে মনে করবেন যেন বিক্ষিপ্ত মনি-মুক্তা।",
                            "verse 76:20": "আপনি যখন সেখানে দেখবেন, তখন নেয়ামতরাজি ও বিশাল রাজ্য দেখতে পাবেন।",
                            "verse 76:21": "তাদের আবরণ হবে চিকন সবুজ রেশম ও মোটা সবুজ রেশম এবং তাদেরকে পরিধান করোনো হবে রৌপ্য নির্মিত কংকণ এবং তাদের পালনকর্তা তাদেরকে পান করাবেন ‘শরাবান-তহুরা’।",
                            "verse 76:22": "এটা তোমাদের প্রতিদান। তোমাদের প্রচেষ্টা স্বীকৃতি লাভ করেছে।",
                            "verse 76:23": "আমি আপনার প্রতি পর্যায়ক্রমে কোরআন নাযিল করেছি।",
                            "verse 76:24": "অতএব, আপনি আপনার পালনকর্তার আদেশের জন্যে ধৈর্য্য সহকারে অপেক্ষা করুন এবং ওদের মধ্যকার কোন পাপিষ্ঠ কাফেরের আনুগত্য করবেন না।",
                            "verse 76:25": "এবং সকাল-সন্ধ্যায় আপন পালনকর্তার নাম স্মরণ করুন।",
                            "verse 76:26": "রাত্রির কিছু অংশে তাঁর উদ্দেশে সিজদা করুন এবং রাত্রির দীর্ঘ সময় তাঁর পবিত্রতা বর্ণনা করুন।",
                            "verse 76:27": "নিশ্চয় এরা পার্থিব জীবনকে ভালবাসে এবং এক কঠিন দিবসকে পশ্চাতে ফেলে রাখে।",
                            "verse 76:28": "আমি তাদেরকে সৃষ্টি করেছি এবং মজবুত করেছি তাদের গঠন। আমি যখন ইচ্ছা করব, তখন তাদের পরিবর্তে তাদের অনুরূপ লোক আনব।",
                            "verse 76:29": "এটা উপদেশ, অতএব যার ইচ্ছা হয় সে তার পালনকর্তার পথ অবলম্বন করুক।",
                            "verse 76:30": "আল্লাহর অভিপ্রায় ব্যতিরেকে তোমরা অন্য কোন অভিপ্রায় পোষণ করবে না। আল্লাহ সর্বজ্ঞ প্রজ্ঞাময়।",
                            "verse 76:31": "তিনি যাকে ইচ্ছা তাঁর রহমতে দাখিল করেন। আর যালেমদের জন্যে তো প্রস্তুত রেখেছেন মর্মন্তুদ শাস্তি।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 76:1": "Не премина ли човекът през период от време, когато той бе нещо неназовано?",
                            "verse 76:2": "Сътворихме Ние човека от частица сперма с примеси, за да го изпитаме, и го сторихме чуващ, зрящ.",
                            "verse 76:3": "Ние му показахме пътя - или признателен, или неблагодарник.",
                            "verse 76:4": "Приготвихме Ние за неверниците вериги, окови и пламъци.",
                            "verse 76:5": "Праведниците пият от чаши с добавено питие от Камфор -",
                            "verse 76:6": "извор, от който пият рабите на Аллах - пускат го в обилие да бликва.",
                            "verse 76:7": "Те изпълняват обета и се страхуват от Деня, злото на който се разпростира.",
                            "verse 76:8": "И дават храна - въпреки че и те я обичат - на нуждаещ се и на сирак, и на пленник:",
                            "verse 76:9": "Храним ви в името на Аллах. Не искаме от вас нито отплата, нито признателност.",
                            "verse 76:10": "Страхуваме се от [мъчението на] Нашия Господ в Деня свъсен, зловещ.",
                            "verse 76:11": "Но Аллах ще ги предпази от злото на този Ден, и ще им дари сияние и щастие.",
                            "verse 76:12": "И ще ги възнагради - защото бяха търпеливи - с Градина и с коприна,",
                            "verse 76:13": "облегнати там на престоли. Не ще виждат там ни зной, ни мраз.",
                            "verse 76:14": "Близо над тях ще са нейните сенки и ще са сведени плодовете й ниско.",
                            "verse 76:15": "Ще бъдат обслужвани със съдове от сребро и с кристални чаши",
                            "verse 76:16": "от сребърен кристал. Ще им се отмерва с мярка.",
                            "verse 76:17": "И ще им се дава там да пият от питие, смесено с джинджифил,",
                            "verse 76:18": "от извор там, наречен Салсабил,",
                            "verse 76:19": "и ще ги обикалят вечномлади юноши - когато ги видиш, ще ги помислиш за разпръснати бисери.",
                            "verse 76:20": "Където и да погледнеш там, ще видиш блаженство и огромно владение.",
                            "verse 76:21": "Ще бъдат облечени в зелени одежди от коприна и брокат, и ще носят украшения - гривни от сребро, и ще им дава техният Господ да пият от чиста напитка.",
                            "verse 76:22": "Това е награда за вас. Вашето старание заслужи признание.",
                            "verse 76:23": "Ние ти низпослахме Корана постепенно.",
                            "verse 76:24": "Затова и ти [о, Мухаммад] бъди търпелив към повелята на твоя Господ, и не се покорявай на никой грешник от тях, или на неверник!",
                            "verse 76:25": "И споменавай името на своя Господ и сутрин, и вечер,",
                            "verse 76:26": "и в част от нощта Му се покланяй, и дълго нощем Го прославяй!",
                            "verse 76:27": "Тези обичат преходността и нехаят за тежкия Ден пред тях.",
                            "verse 76:28": "Ние ги сътворихме и укрепихме телата им, а ако пожелаем, напълно ще ги заменим с подобни на тях.",
                            "verse 76:29": "Това е поучение. Който желае, поема пътя към своя Господ.",
                            "verse 76:30": "Тогава ще пожелавате само онова, което Аллах желае. Аллах е всезнаещ, премъдър.",
                            "verse 76:31": "Той въвежда когото пожелае в Своята милост, а за угнетителите е приготвил болезнено мъчение."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "人確實經歷一個時期，不是一件可以記念的事物。",
                            "verse 76:2": "我確已用混合的精液創造人，並加以試驗，將他創造成聰明的。",
                            "verse 76:3": "我確已指引他正道，他或是感謝，或是辜負。",
                            "verse 76:4": "我確已為不信者預備許多鐵鏈、鐵圈和火獄。",
                            "verse 76:5": "善人們必得飲含有樟腦的醴泉，",
                            "verse 76:6": "即真主的眾僕所飲的一道泉水，他們將使它大量涌出。",
                            "verse 76:7": "他們履行誓願，並畏懼災難普降日。",
                            "verse 76:8": "他們為喜愛真主而賑濟貧民、孤兒、俘虜。",
                            "verse 76:9": "「我們只為愛戴真主而賑濟你們，我們不望你們的報酬和感謝。",
                            "verse 76:10": "我們的確畏懼從我們的主發出的嚴酷的一日。」",
                            "verse 76:11": "故真主將為他們防禦那日的災難，並賞賜他們光華和快樂。",
                            "verse 76:12": "他將因他們的堅忍而以樂園和絲綢報酬他們。",
                            "verse 76:13": "他們在樂園中，靠在床上，不覺炎熱，也不覺嚴寒。",
                            "verse 76:14": "樂園的蔭影覆庇著他們，樂園的果實，他們容易採摘。",
                            "verse 76:15": "將有人在他們之間傳遞銀盤和玻璃杯——",
                            "verse 76:16": "晶瑩如玻璃的銀杯，他們預定每杯的容量。",
                            "verse 76:17": "他們得用那些杯飲含有薑汁的醴泉，",
                            "verse 76:18": "即樂園中有名的清快泉。",
                            "verse 76:19": "許多長生不老的少年，輪流著服侍他們。當你看見那些少年的時候，你以為他們是些散漫的珍珠。",
                            "verse 76:20": "當你觀看那裡的時候，你會看見恩澤和大國。",
                            "verse 76:21": "他們將穿著綾羅錦緞的綠袍，他們將享受銀鐲的裝飾，他們的主，將以純潔的飲料賞賜他們。",
                            "verse 76:22": "（將對他們說：）「這確是你們的報酬，你們的勞績是有報酬的。」",
                            "verse 76:23": "我確已將《古蘭經》零星地降示你，",
                            "verse 76:24": "故你應當忍受你的主的判決。你不要順從他們中任何犯罪的人，或孤恩的人。",
                            "verse 76:25": "你應當朝夕記念你的主的尊名，",
                            "verse 76:26": "夜裡，你應當以小部份時間向他叩頭，以大部份時間讚頌他。",
                            "verse 76:27": "這等人的確愛好現世，而忽視未來的嚴重的一日。",
                            "verse 76:28": "我創造了他們，並使他們的體格堅實。如果我意欲，我將以像他們一樣的人代替他們。",
                            "verse 76:29": "這確是教誨，誰願意覺悟，誰可以選擇一條通達他的主的道路。",
                            "verse 76:30": "除真主意欲外，你們決不意欲。真主是全知的，是至睿的。",
                            "verse 76:31": "他使他所意欲的人，入在他的慈恩中。至於不義的人們，他已為他們預備了痛苦的刑罰。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "Zdaž uběhla nad člověkem chvíle času, kdy nebyl věcí pojmenovanou?",
                            "verse 76:2": "Věru jsme člověka stvořili z kapky semene, ze směsí, zkoušejíce jej. A slyšícím a vidoucím jsme jej učinili",
                            "verse 76:3": "a na správnou cestu - ať vděčný je, či nevděčný - jsme jej uvedli.",
                            "verse 76:4": "Pro nevěřící jsme pak řetězy, okovy a plamen šlehající připravili,",
                            "verse 76:5": "zatímco zbožní popíjet z poháru budou, v němž kafr je přimísen,",
                            "verse 76:6": "z pramene, z něhož služebníci Boží pijí jen, a v hojnosti tryskajícím ven.",
                            "verse 76:7": "A oni důsledně své přísliby plnili a obávali se dne, jehož zlo se rozletí široce,",
                            "verse 76:8": "a krmili jídlem přes lásku svou k němu chuďasa, sirotka i zajatce.",
                            "verse 76:9": "My krmíme vás z lásky k Bohu a nechceme od vás ani odměny, ani díku velkého,",
                            "verse 76:10": "my obáváme se od Pána svého dne mračného, pohrom plného.\"",
                            "verse 76:11": "Avšak Bůh je ochránil přede zlem dne toho a zahrnul je jasem a radostí",
                            "verse 76:12": "a odměnil je za to, co vytrpěli, zahradou rajskou a oděvy z hedvábí;",
                            "verse 76:13": "tam na poduškách odpočívat budou a nespatří tam ani slunce žár, ani mráz spalující",
                            "verse 76:14": "a blízko nad nimi budou stromů stíny a nízko budou se sklánět plody visící",
                            "verse 76:15": "a mezi nimi kolovat budou nádoby stříbrné a poháry křišťálové",
                            "verse 76:16": "z křišťálu stříbrného, mírou vhodnou naplněné.",
                            "verse 76:17": "Napájeni budou z číší, v nichž zázvor je přimíchán,",
                            "verse 76:18": "z pramene rajského, jenž Salsabíl je nazýván.",
                            "verse 76:19": "Mezi nimi obcházet budou chlapci mládí věčného; při pohledu na ně bys myslil, že jsou to perly rozsypané.",
                            "verse 76:20": "A když tam pohlédneš, uzříš slasti rozličné a panství rozlehlé.",
                            "verse 76:21": "Oděni budou do šatů z atlasu zeleného a z brokátu a ozdobeni budou náramky stříbrnými a Pán jejich napájet je bude nápojem čirým.",
                            "verse 76:22": "Toto vše věru je vám dáno za odměnu a z vděčnosti za vaše úsilí.",
                            "verse 76:23": "Zajisté jsme ti seslali Korán sesláním;",
                            "verse 76:24": "vytrvej tedy do rozsudku Pána svého a neposlouchej mezi nimi toho, kdo hříšníkem je či nevěřícím!",
                            "verse 76:25": "Jména Pána svého za jitra a za večera vzpomínej,",
                            "verse 76:26": "i v části noci! A před Ním na zem padej a za noci dlouho Jeho slávu pěj!",
                            "verse 76:27": "Ti, kdož milují tento svět pomíjivý, nedbají na den obtížný, jejž mají před sebou.",
                            "verse 76:28": "My jsme je stvořili a jejich údy posílili; a kdybychom chtěli, vystřídali bychom vás vám podobnými snadnou výměnou.",
                            "verse 76:29": "Toto je věru připomenutí; a kdo si přeje, ať k Pánu svému cestu nastoupí,",
                            "verse 76:30": "však přát si toho nebudete, pokud Bůh tak nebude chtíti. A Bůh věru je vševědoucí, moudrý,",
                            "verse 76:31": "koho chce, do milosti Své uvádí, zatímco pro nespravedlivé trest připravil bolestný!"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "Voorzeker, er is voor de mens een tijdperk geweest toen hij geen vermeldenswaardig ding was.",
                            "verse 76:2": "Wij hebben de mens uit een gemengde levenskiem geschapen en hebben hem horende en ziende gemaakt om hem op de proef te stellen.",
                            "verse 76:3": "Wij hebben hem de weg getoond, hij moge dankbaar of wel ondankbaar zijn.",
                            "verse 76:4": "Voorwaar, Wij hebben voor de ongelovigen ketenen, ijzeren halsbanden en een laaiend Vuur bereid.",
                            "verse 76:5": "Maar de deugdzamen drinken uit een beker (een drank) gemengd met Kamfer.",
                            "verse 76:6": "De dienaren van God drinken uit een bron, welke zij in overvloed doen stromen.",
                            "verse 76:7": "Zij vervullen de gelofte, en vrezen een Dag waarvan het kwaad verstrekkend is.",
                            "verse 76:8": "En zij geven voedsel, uit liefde voor Hem, aan de armen, de wees en de gevangenen.",
                            "verse 76:9": "(Zeggende): \"Wij voeden u slechts ter wille van God. Wij verlangen geen beloning noch dank van u.",
                            "verse 76:10": "Wij vrezen van onze Heer een moeilijke en drukkende Dag.\"",
                            "verse 76:11": "Daarom zal God hen voor het kwade van die Dag beschermen en zal hun blijdschap en geluk schenken.",
                            "verse 76:12": "En Hij zal hen voor hun standvastigheid belonen met een tuin en kleren van zijde.",
                            "verse 76:13": "Zich daarin nedervlijende op sofa’s zullen zij het noch te koud noch te warm hebben.",
                            "verse 76:14": "En de schaduw der bomen zal dicht over hen zijn en de trossen fruit zullen gemakkelijk bereikbaar worden gemaakt.",
                            "verse 76:15": "En zilveren vaten zullen aan hen worden rondgereikt, en bekers",
                            "verse 76:16": "Kristalhelder, uit zilver, in de juiste maat vervaardigd.",
                            "verse 76:17": "En daarin zal hun een drank worden gegeven, vermengd met Gember.",
                            "verse 76:18": "Van een bron genaamd: Salsabiel.",
                            "verse 76:19": "En jonge mensen, die niet verouderen, zullen om hen rondgaan (om hen te bedienen). Wanneer gij hen ziet, denkt gij dat zij verstrooide paarlen zijn.",
                            "verse 76:20": "En waarheen gij ook kijkt, zult gij een zaligheid voelen en een groot koninkrijk aanschouwen.",
                            "verse 76:21": "Zij zullen klederen van fijne groene zijde en zwaar brocaat dragen en zilveren armbanden. En hun Heer zal hun een zuivere drank geven.",
                            "verse 76:22": "(Hij zal zeggen): \"Dit is uw loon, omdat uw streven waardevol was.\"",
                            "verse 76:23": "Voorwaar, Wij hebben de Koran aan u bij gedeelten geopenbaard.",
                            "verse 76:24": "Wees daarom geduldig volgens het gebod van uw Heer en gehoorzaam niemand die onder hen zondig of ongelovig is.",
                            "verse 76:25": "En gedenk de naam van uw Heer ’s morgens en ’s avonds.",
                            "verse 76:26": "En aanbid Hem gedurende (een deel) van de nacht en prijs Zijn eer gedurende een groot deel ervan.",
                            "verse 76:27": "Waarlijk, de ongelovigen houden van de voorbijgaande wereld en denken niet aan de zware Dag (des Oordeels).",
                            "verse 76:28": "Wij zijn het Die hen geschapen hebben en hun lichaamsbouw hebben gesterkt. En indien Wij willen, kunnen Wij hen door gelijksoortige schepselen vervangen.",
                            "verse 76:29": "Voorwaar, dit is een vermaning. Wie het daarom wenst, kieze een weg die tot zijn Heer leidt.",
                            "verse 76:30": "En gij zult niets anders willen dan hetgeen God wil. Voorwaar, God is Alwetend, Alwijs.",
                            "verse 76:31": "Hij laat tot Zijn barmhartigheid ingaan wie Hij wil, en voor de onrechtvaardigen heeft Hij een pijnlijke straf bereid."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 76:1": "Hath there come upon man (ever) any period of time in which he was a thing unremembered ?",
                            "verse 76:2": "Lo! We create man from a drop of thickened fluid to test him; so We make him hearing, knowing.",
                            "verse 76:3": "Lo! We have shown him the way, whether he be grateful or disbelieving.",
                            "verse 76:4": "Lo! We have prepared for disbelievers manacles and carcans and a raging fire.",
                            "verse 76:5": "Lo! the righteous shall drink of a cup whereof the mixture is of Kafur,",
                            "verse 76:6": "A spring wherefrom the slaves of Allah drink, making it gush forth abundantly,",
                            "verse 76:7": "(Because) they perform the vow and fear a day whereof the evil is wide-spreading,",
                            "verse 76:8": "And feed with food the needy wretch, the orphan and the prisoner, for love of Him,",
                            "verse 76:9": "(Saying): We feed you, for the sake of Allah only. We wish for no reward nor thanks from you;",
                            "verse 76:10": "Lo! we fear from our Lord a day of frowning and of fate.",
                            "verse 76:11": "Therefor Allah hath warded off from them the evil of that day, and hath made them find brightness and joy;",
                            "verse 76:12": "And hath awarded them for all that they endured, a Garden and silk attire;",
                            "verse 76:13": "Reclining therein upon couches, they will find there neither (heat of) a sun nor bitter cold.",
                            "verse 76:14": "The shade thereof is close upon them and the clustered fruits thereof bow down.",
                            "verse 76:15": "Goblets of silver are brought round for them, and beakers (as) of glass",
                            "verse 76:16": "(Bright as) glass but (made) of silver, which they (themselves) have measured to the measure (of their deeds).",
                            "verse 76:17": "There are they watered with a cup whereof the mixture is of Zanjabil,",
                            "verse 76:18": "(The water of) a spring therein, named Salsabil.",
                            "verse 76:19": "There wait on them immortal youths, whom, when thou seest, thou wouldst take for scattered pearls.",
                            "verse 76:20": "When thou seest, thou wilt see there bliss and high estate.",
                            "verse 76:21": "Their raiment will be fine green silk and gold embroidery. Bracelets of silver will they wear. Their Lord will slake their thirst with a pure drink.",
                            "verse 76:22": "(And it will be said unto them): Lo! this is a reward for you. Your endeavour (upon earth) hath found acceptance.",
                            "verse 76:23": "Lo! We, even We, have revealed unto thee the Qur’an, a revelation;",
                            "verse 76:24": "So submit patiently to thy Lord’s command, and obey not of them any guilty one or disbeliever.",
                            "verse 76:25": "Remember the name of thy Lord at morn and evening.",
                            "verse 76:26": "And worship Him (a portion) of the night. And glorify Him through the livelong night.",
                            "verse 76:27": "Lo! these love fleeting life, and put behind them (the remembrance of) a grievous day.",
                            "verse 76:28": "We, even We, created them, and strengthened their frame. And when We will, We can replace them, bringing others like them in their stead.",
                            "verse 76:29": "Lo! this is an Admonishment, that whosoever will may choose a way unto his Lord.",
                            "verse 76:30": "Yet ye will not, unless Allah willeth. Lo! Allah is Knower, Wise.",
                            "verse 76:31": "He maketh whom He will to enter His mercy, and for evil-doers hath prepared a painful doom."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 76:1": "Has there not been over Man a long period of Time, when he was nothing - (not even) mentioned?",
                            "verse 76:2": "Verily We created Man from a drop of mingled sperm, in order to try him: So We gave him (the gifts), of Hearing and Sight.",
                            "verse 76:3": "We showed him the Way: whether he be grateful or ungrateful (rests on his will).",
                            "verse 76:4": "For the Rejecters we have prepared chains, yokes, and a blazing Fire.",
                            "verse 76:5": "As to the Righteous, they shall drink of a Cup (of Wine) mixed with Kafur,-",
                            "verse 76:6": "A Fountain where the Devotees of God do drink, making it flow in unstinted abundance.",
                            "verse 76:7": "They perform (their) vows, and they fear a Day whose evil flies far and wide.",
                            "verse 76:8": "And they feed, for the love of God, the indigent, the orphan, and the captive,-",
                            "verse 76:9": "(Saying),\"We feed you for the sake of God alone: no reward do we desire from you, nor thanks.",
                            "verse 76:10": "\"We only fear a Day of distressful Wrath from the side of our Lord.\"",
                            "verse 76:11": "But God will deliver them from the evil of that Day, and will shed over them a Light of Beauty and (blissful) Joy.",
                            "verse 76:12": "And because they were patient and constant, He will reward them with a Garden and (garments of) silk.",
                            "verse 76:13": "Reclining in the (Garden) on raised thrones, they will see there neither the sun’s (excessive heat) nor (the moon’s) excessive cold.",
                            "verse 76:14": "And the shades of the (Garden) will come low over them, and the bunches (of fruit), there, will hang low in humility.",
                            "verse 76:15": "And amongst them will be passed round vessels of silver and goblets of crystal,-",
                            "verse 76:16": "Crystal-clear, made of silver: they will determine the measure thereof (according to their wishes).",
                            "verse 76:17": "And they will be given to drink there of a Cup (of Wine) mixed with Zanjabil,-",
                            "verse 76:18": "A fountain there, called Salsabil.",
                            "verse 76:19": "And round about them will (serve) youths of perpetual (freshness): If thou seest them, thou wouldst think them scattered Pearls.",
                            "verse 76:20": "And when thou lookest, it is there thou wilt see a Bliss and a Realm Magnificent.",
                            "verse 76:21": "Upon them will be green Garments of fine silk and heavy brocade, and they will be adorned with Bracelets of silver; and their Lord will give to them to drink of a Wine Pure and Holy.",
                            "verse 76:22": "\"Verily this is a Reward for you, and your Endeavour is accepted and recognised.\"",
                            "verse 76:23": "It is We Who have sent down the Qur’an to thee by stages.",
                            "verse 76:24": "Therefore be patient with constancy to the Command of thy Lord, and hearken not to the sinner or the ingrate among them.",
                            "verse 76:25": "And celebrate the name or thy Lord morning and evening,",
                            "verse 76:26": "And part of the night, prostrate thyself to Him; and glorify Him a long night through.",
                            "verse 76:27": "As to these, they love the fleeting life, and put away behind them a Day (that will be) hard.",
                            "verse 76:28": "It is We Who created them, and We have made their joints strong; but, when We will, We can substitute the like of them by a complete change.",
                            "verse 76:29": "This is an admonition: Whosoever will, let him take a (straight) Path to his Lord.",
                            "verse 76:30": "But ye will not, except as God wills; for God is full of Knowledge and Wisdom.",
                            "verse 76:31": "He will admit to His Mercy whom He will; But the wrong-doers,- for them has He prepared a grievous Penalty."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 76:1": "Has there come on man a while of time when he was a thing unremembered?",
                            "verse 76:2": "We created man of a sperm-drop, a mingling, and We made him hearing, seeing.",
                            "verse 76:3": "Surely We guided him upon the way whether he be thankful or unthankful.",
                            "verse 76:4": "Surely We have prepared for the unbelievers chains, fetters, and a Blaze.",
                            "verse 76:5": "Surely the pious shall drink of a cup whose mixture is camphor,",
                            "verse 76:6": "a fountain whereat drink the servants of God, making it to gush forth plenteously.",
                            "verse 76:7": "They fulfil their vows, and fear a day whose evil is upon the wing;",
                            "verse 76:8": "they give food, for the love of Him, to the needy, the orphan, the captive:",
                            "verse 76:9": "’We feed you only for the Face of God; we desire no recompense from you, no thankfulness;",
                            "verse 76:10": "for we fear from our Lord a frowning day, inauspicious.",
                            "verse 76:11": "So God has guarded them from the evil of that day, and has procured them radiancy and gladness,",
                            "verse 76:12": "and recompensed them for their patience with a Garden, and silk;",
                            "verse 76:13": "therein they shall recline upon couches, therein they shall see neither sun nor bitter cold;",
                            "verse 76:14": "near them shall be its shades, and its clusters hung meekly down,",
                            "verse 76:15": "and there shall be passed around them vessels of silver, and goblets of crystal,",
                            "verse 76:16": "crystal of silver that they have measured -- very exactly.",
                            "verse 76:17": "And therein they shall be given to drink a cup whose mixture is ginger,",
                            "verse 76:18": "therein a fountain whose name is called Salsabil.",
                            "verse 76:19": "Immortal youths shall go about them; when thou seest them, thou supposest them scattered pearls,",
                            "verse 76:20": "when thou seest them then thou seest bliss and a great kingdom.",
                            "verse 76:21": "Upon them shall be green garments of silk and brocade; they are adorned with bracelets of silver, and their Lord shall give them to drink a pure draught.",
                            "verse 76:22": "Behold, this is a recompense for you, and your striving is thanked.’",
                            "verse 76:23": "Surely We have sent down the Koran on thee, a sending down;",
                            "verse 76:24": "so be thou patient under the judgment of thy Lord, and obey not one of them, sinner or unbeliever.",
                            "verse 76:25": "And remember the Name of thy Lord at dawn and in the evening",
                            "verse 76:26": "and part of the night; bow down before Him and magnify Him through the long night.",
                            "verse 76:27": "Surely these men love the hasty world, and leave be behind them a heavy day.",
                            "verse 76:28": "We created them, and We strengthened their joints; and, when We will, We shall exchange their likes.",
                            "verse 76:29": "Surely this is a Reminder; so he who will, takes unto his Lord a way.",
                            "verse 76:30": "But you will not unless God wills; surely God is ever All-knowing, All-wise.",
                            "verse 76:31": "For He admits into His mercy whomsoever He will; as for the evildoers, He has prepared for them a painful chastisement."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 76:1": "HAS THERE [not] been an endless span of time before man [appeared – a time] when he was not yet a thing to be thought of?",
                            "verse 76:2": "Verily, it is We who have created man out of a drop of sperm intermingled, so that We might try him [in his later life]: and therefore We made him a being endowed with hearing and sight.",
                            "verse 76:3": "Verily, We have shown him the way: [and it rests with him to prove himself] either grateful or ungrateful.",
                            "verse 76:4": "[Now,] behold, for those who deny the truth We have readied chains and shackles, and a blazing flame",
                            "verse 76:5": "[whereas,] behold, the truly virtuous shall drink from a cup flavoured with the calyx of sweet-smelling flowers:",
                            "verse 76:6": "a source [of bliss] whereof God’s servants shall drink, seeing it flow in a flow abundant.",
                            "verse 76:7": "[The truly virtuous are] they [who] fulfil their vows, and stand in awe of a Day the woe of which is bound to spread far and wide,",
                            "verse 76:8": "and who give food – however great be their own want of it – unto the needy, and the orphan, and the captive,",
                            "verse 76:9": "[saying, in their hearts,] \"We feed you for the sake of God alone: we desire no recompense from you, nor thanks:",
                            "verse 76:10": "behold, we stand in awe of our Sustainer’s judgment on a distressful, fateful Day!\"",
                            "verse 76:11": "And so, God will preserve them from the woes of that Day, and will bestow on them brightness and joy,",
                            "verse 76:12": "and will reward them for all their patience in adversity with a garden [of bliss] and with [garments of] silk.",
                            "verse 76:13": "In that [garden] they will on couches recline, and will know therein neither [burning] sun nor cold severe,",
                            "verse 76:14": "since its [blissful] shades will come down low over them, and low will hang down its clusters of fruit, most easy to reach.",
                            "verse 76:15": "And they will be waited upon with vessels of silver and goblets that will [seem to] be crystal",
                            "verse 76:16": "crystal-like, [but] of silver – the measure whereof they alone will determine.",
                            "verse 76:17": "And in that [paradise] they will be given to drink of a cup flavoured with ginger,",
                            "verse 76:18": "[derived from] a source [to be found] therein, whose name is \"Seek Thy Way.\"",
                            "verse 76:19": "And immortal youths will wait upon them: when thou seest them, thou wouldst deem them to be scattered pearls;",
                            "verse 76:20": "and when thou seest [anything that is] there, thou wilt see [only] bliss and a realm transcendent.",
                            "verse 76:21": "Upon those [blest] will be garments of green silk and brocade; and they will be adorned with bracelets of silver. And their Sustainer will give them to drink of a drink most pure.",
                            "verse 76:22": "[And they will be told:] \"Verily, all this is your reward, since your endeavour [in life] has met with [God’s] goodly acceptance!\"",
                            "verse 76:23": "VERILY, [O believer,] it is We who have bestowed from on high this Qur’ān upon thee, step by step – truly a bestowal from on high!",
                            "verse 76:24": "Await, then, in all patience thy Sustainer’s judgment, and pay no heed to any of them who is a willful sinner or an ingrate;",
                            "verse 76:25": "and bear in mind thy Sustainer’s name at morn and evening",
                            "verse 76:26": "and during some of the night, and prostrate thyself before Him, and extol His limitless glory throughout the long night.",
                            "verse 76:27": "Behold, they [who are unmindful of God] love this fleeting life, and leave behind them [all thought of] a grief-laden Day.",
                            "verse 76:28": "[They will not admit to themselves that] it is We who have created them and strengthened their make – and [that], if it be Our will, We can replace them entirely with others of their kind.",
                            "verse 76:29": "VERILY, all this is an admonition: whoever, then, so wills, may unto his Sustainer find a way.",
                            "verse 76:30": "But you cannot will it unless God wills [to show you that way]: for, behold, God is indeed all-knowing, wise.",
                            "verse 76:31": "He admits unto His grace everyone who wills [to be admitted]; but as for the evildoers – for them has He readied grievous suffering [in the life to come]."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 76:1": "There has come upon man a period of time in which he was nothing worth mentioning.",
                            "verse 76:2": "We have created man from a mixed sperm-drop to put him to a test; then We made him able to hear, able to see.",
                            "verse 76:3": "We have shown him the way to be either grateful or ungrateful.",
                            "verse 76:4": "We have prepared, for the disbelievers, shackles and iron-collars and a blazing Fire.",
                            "verse 76:5": "Indeed, the righteous will have a drink from a goblet, blended with (a drink from) Camphor",
                            "verse 76:6": "that will be a spring from which Allah’s servants will drink, making it flow (wherever they wish) profusely.",
                            "verse 76:7": "They (are the ones who) fulfill their vows, and fear a day whose evil (events) will spread far and wide,",
                            "verse 76:8": "and they give food, out of their love for Him (Allah), to the needy, and the orphan, and the captive,",
                            "verse 76:9": "(saying to them,) “We feed you only for the sake of Allah; we have no intention of (receiving) either a return from you or thanks.",
                            "verse 76:10": "In fact, we are fearful of a day, from the side of our Lord, that will be frowning, extremely malignant.”",
                            "verse 76:11": "So Allah will save them from the evil of that day, and will grant them bloom and delight,",
                            "verse 76:12": "and will give them, in return for their patience, Paradise and (garments of) silk,",
                            "verse 76:13": "wherein they will be reclining on couches, feeling neither heat of the sun nor intense cold.",
                            "verse 76:14": "And shades of gardens will be hanging low on them, and their fruits will be placed totally under their command.",
                            "verse 76:15": "Circulated among them will be vessels of silver, and cups that will be (as transparent as) crystals,",
                            "verse 76:16": "-crystals (as shining as if made) of silver, measured by those (who filled them) with due measure.",
                            "verse 76:17": "And they will be served with goblet of a drink blended with ginger,",
                            "verse 76:18": "(acquired from) a spring therein called Salsabīl.",
                            "verse 76:19": "And circling around them will be serving boys, blessed with eternal youth; when you would see them, you would take them as scattered pearls.",
                            "verse 76:20": "When you will look around there, you will see the Bliss and a magnificent realm.",
                            "verse 76:21": "Upon them will be garments of green sundus (a kind of fine silk), and of istabraq (a kind of thick silk), and they will be adorned by bracelets of silver. Their Lord will give them a pure beverage to drink:",
                            "verse 76:22": "“This is a reward for you, and your effort has been appreciated.”",
                            "verse 76:23": "Indeed we have revealed to you the Qur’ān through a gradual process.",
                            "verse 76:24": "So, be steadfast patiently in (obeying) your Lord’s command, and do not obey any one of them who is sinner or ungrateful.",
                            "verse 76:25": "And pronounce the name of Allah morning and evening.",
                            "verse 76:26": "And in some parts of night prostrate yourself before Him, and pronounce His purity for long times at night.",
                            "verse 76:27": "In fact these people love that which is immediate, and neglect a Heavy Day ahead of them.",
                            "verse 76:28": "We have created them and have made their joints strong. And whenever We will, We would replace them with others like them, a total replacement.",
                            "verse 76:29": "Indeed, this is a reminder; so let anyone who so wishes, adopt a way to his Lord.",
                            "verse 76:30": "And you will not so wish unless Allah so wills. Indeed Allah is All-Knowing, All-Wise.",
                            "verse 76:31": "He admits whomsoever He wills to His mercy. As for the wrongdoers, He has prepared for them a painful punishment."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 76:1": "Has there [ever] been for man a period of time in which he was a thing unmentioned?",
                            "verse 76:2": "Verily We created man from a drop of mixed fluid, so that We may test him. So We made him hearing, seeing.",
                            "verse 76:3": "Verily We have guided him to the way, whether he be grateful or ungrateful.",
                            "verse 76:4": "We have assuredly prepared for the disbelievers chains, and fetters, and a hell-fire.",
                            "verse 76:5": "Truly the righteous will drink from a cup whose mixture is camphor;",
                            "verse 76:6": "a spring from which the servants of God drink, making it gush forth plenteously.",
                            "verse 76:7": "They fulfil their vows and fear a day the evil of which will be widespread.",
                            "verse 76:8": "And they give food, despite [their] love of it to the needy, and the orphan, and the prisoner.",
                            "verse 76:9": "‘We feed you only for the sake of God. We do not desire any reward from you, nor any thanks.",
                            "verse 76:10": "Indeed we fear from our Lord a day of frowning, calamitous’.",
                            "verse 76:11": "God has therefore shielded them from the evil of that day, and has granted them radiancy and joy.",
                            "verse 76:12": "And He has rewarded them for their patience with a Garden and silk,",
                            "verse 76:13": "reclining therein upon couches. They will not find therein either sun or bitter cold.",
                            "verse 76:14": "And close over them will be its shades and its clusters [of fruits] will hang low.",
                            "verse 76:15": "And they will be waited upon from all around them with vessels of silver, and goblets of crystal —",
                            "verse 76:16": "crystal of silver, which they have measured in a precise measure.",
                            "verse 76:17": "And they will be given to drink therein a cup whose mixture is ginger,",
                            "verse 76:18": "a spring therein named Salsabīl.",
                            "verse 76:19": "And they will be waited upon by immortal youths, whom, when you see them you will suppose them to be scattered pearls.",
                            "verse 76:20": "And when you look there, you will see bliss and a great kingdom.",
                            "verse 76:21": "Upon them will be garments of fine green silk and [heavy] silk brocade. And they will be adorned with bracelets of silver and their Lord will give them a pure drink to drink.",
                            "verse 76:22": "‘Verily this is a reward for you, and your endeavour has been appreciated’.",
                            "verse 76:23": "Assuredly We have revealed the Qur’ān to you as a gradual revelation.",
                            "verse 76:24": "So submit patiently to your Lord’s decree, and do not obey of them any sinner or disbeliever.",
                            "verse 76:25": "And mention the Name of your Lord at dawn and with the declining of the sun,",
                            "verse 76:26": "and prostrate to Him for a portion of the night, and glorify Him the length of the night.",
                            "verse 76:27": "Assuredly these love the transitory [life] and leave behind them a burdensome day.",
                            "verse 76:28": "We created them and made firm their frames, and, whenever We will, We can completely replace them with others like them.",
                            "verse 76:29": "This is indeed a reminder. Let him who will, then, choose a way to his Lord.",
                            "verse 76:30": "But you will not, unless God wills. Assuredly God is ever Knower, Wise.",
                            "verse 76:31": "He admits whomever He will into His mercy, and as for the evildoers, He has prepared for them a painful chastisement."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 76:1": "Surely, there has passed over man a period of time when he was not a thing worth mentioning.",
                            "verse 76:2": "Surely, We created man from a fertilized ovum that We keep turning and examining (from one stage to the next till birth). So We have made him (in the order of) hearing (then) seeing.",
                            "verse 76:3": "Indeed, We also showed him the way (to understanding and insight for distinguishing between the truth and falsehood) whether he (now) becomes thankful or continues to be ungrateful.",
                            "verse 76:4": "Verily, We have prepared for the disbelievers chains (for the feet), neck-fetters and the Blazing Fire (of Hell).",
                            "verse 76:5": "Surely, the sincerely devoted and obedient will drink from the cups (of the holy drink) mixed with kafur (to enhance its aroma, colour and taste).",
                            "verse 76:6": "(Kafur is) a spring (in Paradise) that (the privileged) servants of Allah (i.e., Awliya’ Allah) will drink from, and will (also) make it flow to wherever they will desire in the form of small brooks (to make others drink of it).",
                            "verse 76:7": "(These privileged servants of Allah are those) who fulfil their vows and keep fearing that Day whose severity spreads afar.",
                            "verse 76:8": "And they give (their own) food, in deep love of Allah, to the needy, the orphan and prisoner (out of sacrifice, despite their own desire and need for it),",
                            "verse 76:9": "(And say:) ‘We are feeding you only to please Allah. We do not seek any recompense from you nor (wish for) any thanks.",
                            "verse 76:10": "We fear from our Lord the Day which will make (the faces) look very dark (and) ugly.’",
                            "verse 76:11": "So Allah will save them from the terror of that Day (for their fear of Allah) and will grant them freshness, bloom and blush (on their faces) and ecstasy and delight (in their hearts),",
                            "verse 76:12": "And will bless them with Gardens (to live in) and silky clothes (to wear), a reward for their patience.",
                            "verse 76:13": "Reclining in it against cushions on raised couches, they will find there neither intense cold nor heat.",
                            "verse 76:14": "And the shades (of trees in Paradise) will close upon them, and the bunches of their (fruits) will be hanging low.",
                            "verse 76:15": "And (the servants) will go round them with vessels of silver and (pure and clean) goblets of shining glass,",
                            "verse 76:16": "And glasses made of silver which they will have filled with exact measures (according to everyone’s desire).",
                            "verse 76:17": "And they will be made to drink there cups of (the holy drink) mixed with Zanjabil.",
                            "verse 76:18": "(Zanjabil is) a spring in this (Paradise) named Salsabil.",
                            "verse 76:19": "And going round them will be (innocent) adolescents who will remain ever-young. When you will see them, you will consider them as scattered pearls.",
                            "verse 76:20": "And when you will look (at Paradise), you will find blessings (in abundance) and a mighty kingdom (all around).",
                            "verse 76:21": "They will be clad in green, fine silk and rich brocade attire, and they will be made to wear silver bracelets, and their Lord will make them drink a holy beverage.",
                            "verse 76:22": "Surely, that will be your reward and your hard work is acknowledged.",
                            "verse 76:23": "Indeed, We have revealed the Qur’an to you piecemeal.",
                            "verse 76:24": "So (continue to) be patient for the sake of your Lord’s command and do not give your ear to any liar, sinner or disbeliever or thankless person from amongst them.",
                            "verse 76:25": "And remember the Name of your Lord morning and evening.",
                            "verse 76:26": "And prostrate yourself before His presence for some hours of the night, and glorify Him during (the rest of) the long hours of the night.",
                            "verse 76:27": "Surely, these (world-mongers) love the gains that are achievable right away. And they have put behind their backs (the remembrance of) the very hard Day.",
                            "verse 76:28": "(They do not realize that) We alone have created them and have made their every joint strong, and We can replace them whenever We may please with the people like them.",
                            "verse 76:29": "Indeed, this (Qur’an) is a Reminder. So whoever desires may adopt the way to (reach) his Lord.",
                            "verse 76:30": "And you cannot wish anything yourselves except what Allah wills. Indeed, Allah is All-Knowing, Most Wise.",
                            "verse 76:31": "He admits whom He wills to (the circle of) His mercy, and He has prepared a grievous torment for the wrongdoers."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "Eikö ole kulunut pitkä aika, ennenkuin ihmisestä tuli jotakin mainitsemisen arvoista?",
                            "verse 76:2": "Me olemme totisesti luonut ihmisen siemenestä yhdistäen sen toiseen. Me aiomme kasvattaa häntä, ja niin olemme antanut hänelle kuulon ja näön.",
                            "verse 76:3": "Totisesti olemme ohjannut hänet polulle, olkoonpa hän kiitollinen tai kiittämätön.",
                            "verse 76:4": "Totisesti olemme valmistanut uskottomille kahleet ja ketjut sekä helvetin tulen.",
                            "verse 76:5": "Totisesti saavat hurskaat juoda maljasta, johon on kätketty heidän (sisäinen) vapautuksensa,",
                            "verse 76:6": "lähteestä, josta Jumalan palvelijat juovat runsain määrin.",
                            "verse 76:7": "He täyttävät lupauksensa ja pelkäävät päivää, jonka tuho leviää ylt'ympäri;",
                            "verse 76:8": "rakkaudesta Häneen he ruokkivat köyhää, orpoa ja vangittua.",
                            "verse 76:9": "»Me ruokimme teitä vain Jumalan tähden; me emme vaadi teiltä palkkaa emmekä kiitosta,",
                            "verse 76:10": "totisesti pelkäämme surun ja murheen päivää, jonka Herramme lähettää.»",
                            "verse 76:11": "Siksi Jumala säästää heidät tuon päivän tuholta ja antaa heidän osakseen iloa ja onnea;",
                            "verse 76:12": "Hän palkitsee heitä heidän lujuutensa tähden paratiisilla ja silkkivaatteilla.",
                            "verse 76:13": "Näihin puettuina ja leväten nojakorokkeilla he eivät tunne hellettä eivätkä purevaa kylmää,",
                            "verse 76:14": "vaan puutarhan varjot lepäävät tiheinä heidän yllään, ja sen hedelmät ovat käden ulottuvilla.",
                            "verse 76:15": "Siellä kiertävät hopeamaljat ja kristallipikarit,",
                            "verse 76:16": "jotka ovat kuin läpikuultava lasi ja jotka täytetään runsain mitoin.",
                            "verse 76:17": "He saavat juoda inkiväärillä höystetyn maljan",
                            "verse 76:18": "lähteestä, jota siellä kutsutaan Salsabiliksi.",
                            "verse 76:19": "Ja heidän ympärillään liikkuvat ikinuoret olennot, joita nähdessäsi sinusta tuntuu, kuin he olisivat ylt'ympäri siroiteltuja helmiä.",
                            "verse 76:20": "Ja kun saat nähdä sen, olet näkevä autuuden ja suuren kuningaskunnan.",
                            "verse 76:21": "Heidän vaatetuksenaan on viheriä, hieno silkki ja paksu, kultakudoksinen sametti. He saavat kantaa hopeaisia rannerenkaita, ja heidän Herransa virvoittaa heitä puhtaalla juomalla.",
                            "verse 76:22": "Tämä on totisesti oleva palkkanne, sillä ponnistelunne palkitaan.",
                            "verse 76:23": "Totisesti olemme lähettänyt sinulle tämän Koraanin vähitellen useina ilmoituksina.",
                            "verse 76:24": "Pysy siis lujana odottaen kärsivällisesti Herrasi tuomiota äläkä tottele ketään syntistä tai kiittämätöntä heidän joukostaan.",
                            "verse 76:25": "Ylistä Herrasi nimeä aamuin ja illoin!",
                            "verse 76:26": "Polvistu yön aikana Häntä palvomaan ja ylistä Häntä myöhään yöhön!",
                            "verse 76:27": "Totisesti muut ihmiset rakastavat tätä maallista elämää eivätkä pidä lukua turmion päivästä.",
                            "verse 76:28": "Me olemme luonut heidät ja vahvistanut heidän jäsenensä, ja jos tahdomme, voimme heidän sijaansa aikaansaada täysin heidän kaltaisiaan olentoja.",
                            "verse 76:29": "Totisesti tämä on kehoitus, ja se, joka tahtoo, löytää tien Herransa luokse.",
                            "verse 76:30": "Mutta teitä se ei miellytä, ellei Jumala kuitenkin niin määrää; totisesti, Jumalan on tieto, viisaus.",
                            "verse 76:31": "Hän sulkee armoonsa kenet haluaa, mutta jumalattomille Hän on varannut tuskan ja kurituksen."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 76:1": "Ne s'est-il pas écoulé pour l'homme un laps de temps durant lequel il n'était pas fait mention de lui [parmi les choses existantes] ?",
                            "verse 76:2": "Certes, Nous avons créé l'homme, pour l'éprouver, à partir d'un fluide composite, et Nous lui avons donné l'ouïe et la vue.",
                            "verse 76:3": "Nous l'avons guidé sur le bon chemin, qu'il soit reconnaissant, ou qu'il soit ingrat.",
                            "verse 76:4": "Certes, Nous avons préparé pour les mécréants des chaînes, des carcans et un brasier.",
                            "verse 76:5": "Les hommes purs boiront à une coupe dont le mélange sera de camphre,",
                            "verse 76:6": "venant d'une source à laquelle les serviteurs de Dieu boiront tout en la faisant jaillir en abondance.",
                            "verse 76:7": "Ceux-là accomplissaient fidèlement leurs vœux et redoutaient un Jour dont le mal se répandrait partout.",
                            "verse 76:8": "Ils nourrissaient le pauvre, l'orphelin et le captif, pour l'amour de Dieu, [disant :]",
                            "verse 76:9": "\" Nous vous nourrissons pour plaire à Dieu, n'attendant de vous ni récompense, ni gratitude.",
                            "verse 76:10": "Oui, nous redoutons de la part de notre Seigneur un Jour menaçant et calamiteux. \"",
                            "verse 76:11": "Mais Dieu les a protégés du malheur de ce jour, et Il les a baignés de clarté et de joie.",
                            "verse 76:12": "Il les a récompensés pour leur patience en leur donnant un jardin et des vêtements de soie.",
                            "verse 76:13": "Là, accoudés sur des lits d'apparat, ils n'auront à subir ni soleil ardent, ni froid mordant.",
                            "verse 76:14": "Ses ombrages les couvriront et ses grappes de fruits se pencheront vers eux pour être cueillies.",
                            "verse 76:15": "On fera circuler parmi eux des vaisseaux d'argent et des coupes de cristal,",
                            "verse 76:16": "de cristal argenté qui seront remplies à la juste mesure.",
                            "verse 76:17": "On leur en fera boire un gobelet dont le mélange sera de gingembre,",
                            "verse 76:18": "puisé à une source proche nommée \" Salsabîl \".",
                            "verse 76:19": "Des éphèbes immortels circuleront autour d'eux. Lorsque tu les verras, tu penseras que ce sont des perles détachées,",
                            "verse 76:20": "et lorsque tu regarderas là-bas, tu verras un délice et un vaste royaume.",
                            "verse 76:21": "Ils porteront des vêtements verts, de satin et de brocart. Ils seront parés de bracelets d'argent. Leur Seigneur les désaltèrera d'une boisson pure :",
                            "verse 76:22": "\" Cela vous est accordé comme une récompense. Votre zèle a été reconnu ! \"",
                            "verse 76:23": "Oui, Nous avons fait descendre sur toi le Coran comme Révélation.",
                            "verse 76:24": "Accepte donc patiemment le décret de ton Seigneur, et n'obéis à aucun d'entre eux qui soit pécheur ingrat ou mécréant invétéré.",
                            "verse 76:25": "Invoque le Nom de ton Seigneur le matin et le soir.",
                            "verse 76:26": "La nuit, prosterne-toi devant Lui et glorifie-Le longuement.",
                            "verse 76:27": "Ces gens aiment la vie éphémère et ils délaissent un Jour grave.",
                            "verse 76:28": "Nous les avons créés et Nous avons fixé solidement leurs jointures. Pourtant, si Nous le voulions, Nous les remplacerions par des êtres semblables à eux.",
                            "verse 76:29": "Ceci est vraiment un Rappel. Que celui qui le veut prenne donc un chemin vers son Seigneur ;",
                            "verse 76:30": "mais vous ne le voudrez que si Dieu le veut. Dieu, certes, sait tout et Il est sage.",
                            "verse 76:31": "Il fait entrer qui Il veut dans Sa miséricorde. Et pour les iniques, Il a préparé un châtiment douloureux."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 76:1": "S’est-il écoulé pour l’homme un laps de temps durant lequel il n’était même pas une chose mentionnable ?",
                            "verse 76:2": "En effet, Nous avons créé l’homme d’une goutte de sperme mélangé [aux composantes diverses] pour le mettre à l’épreuve. [C’est pourquoi] Nous l’avons fait entendant et voyant.",
                            "verse 76:3": "Nous l’avons guidé dans le chemin, - qu’il soit reconnaissant ou ingrat -",
                            "verse 76:4": "Nous avons préparé pour les infidèles des chaînes, des carcans et une fournaise ardente.",
                            "verse 76:5": "Les vertueux boiront d’une coupe dont le mélange sera de camphre,",
                            "verse 76:6": "d’une source de laquelle boiront les serviteurs de Dieu et ils la feront jaillir en abondance. .",
                            "verse 76:7": "Ils accomplissent leurs voeux et ils redoutent un jour dont le mal s’étendra partout.",
                            "verse 76:8": "et offrent la nourriture, malgré son amour , au pauvre, à l’orphelin et au prisonnier,",
                            "verse 76:9": "(disant) : «C’est pour le visage de Dieu que nous vous nourrissons : nous ne voulons de vous ni récompense ni gratitude.",
                            "verse 76:10": "Nous redoutons, de notre Seigneur, un jour terrible et catastrophique».",
                            "verse 76:11": "Dieu les protégera donc du mal de ce jour-là, et leur fera rencontrer la splendeur et la joie,",
                            "verse 76:12": "et les rétribuera pour ce qu’ils auront enduré, en leur donnant le Paradis et des [vêtements] de soie,",
                            "verse 76:13": "ils y seront accoudés sur des divans, n’y voyant ni soleil ni froid glacial .",
                            "verse 76:14": "Ses ombrages les couvriront de près, et ses fruits inclinés bien bas [à portée de leurs mains].",
                            "verse 76:15": "Et l’on fera circuler parmi eux des récipients d’argent et des coupes cristallines,",
                            "verse 76:16": "en cristal d’argent, dont le contenu a été savamment dosé.",
                            "verse 76:17": "Et là, ils seront abreuvés d’une coupe dont le mélange sera de gingembre,",
                            "verse 76:18": "puisé là-dedans à une source qui s’appelle Salsabil.",
                            "verse 76:19": "Et parmi eux, circuleront des garçons éternellement jeunes. Quand tu les verras, tu les prendras pour des perles éparpillées.",
                            "verse 76:20": "Et quand tu regarderas là-bas, tu verras un délice et un vaste royaume.",
                            "verse 76:21": "Ils porteront des vêtements verts de satin et de brocart. Et ils seront parés de bracelets d’argent. Et leur Seigneur les abreuvera d’une boisson très pure.",
                            "verse 76:22": "Cela sera pour vous une récompense, et votre effort sera reconnu.",
                            "verse 76:23": "En vérité c’est Nous qui avons fait descendre sur toi le Coran graduellement.",
                            "verse 76:24": "Endure donc ce que ton Seigneur a décrété, et n’obéis ni au pécheur, parmi eux, ni au grand mécréant.",
                            "verse 76:25": "Et invoque le nom de ton Seigneur, matin et après-midi;",
                            "verse 76:26": "et prosterne-toi devant Lui une partie de la nuit; et glorifie Le de longues [heures] pendant la nuit.",
                            "verse 76:27": "Ces gens-là aiment [la vie] éphémère (la vie sur terre) et laissent derrière eux un jour bien lourd [le jour du Jugement].",
                            "verse 76:28": "C’est Nous qui les avons créés et avons fortifié leur constitution. Quand Nous voulons, cependant, Nous les remplaçons [facilement] par leurs semblables.",
                            "verse 76:29": "Ceci est un rappel. Que celui qui veut prenne donc le chemin vers son Seigneur !",
                            "verse 76:30": "Cependant, vous ne saurez vouloir, à moins que Dieu veuille. Et Dieu est Omniscient et Sage.",
                            "verse 76:31": "Il fait entrer qui Il veut dans Sa miséricorde. Et quant aux injustes, Il leur a préparé un châtiment douloureux."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "Wahrlich, es kam über den Menschen eine Zeit, da er nichts Nennenswertes war.",
                            "verse 76:2": "Wir erschufen den Menschen aus einem Mischtropfen, auf daß Wir ihn prüfen möchten; dann gaben Wir ihm Gehör und Gesicht.",
                            "verse 76:3": "Wir haben ihm den Weg gezeigt, ob er nun dankbar oder undankbar sei.",
                            "verse 76:4": "Wahrlich, Wir haben für die Ungläubigen Ketten, eiserne Nackenfesseln und ein flammendes Feuer bereitet.",
                            "verse 76:5": "Die Gerechten aber trinken aus einem Becher, dem Kampfer beigemischt ist -",
                            "verse 76:6": "Eine Quelle, von der die Diener Allahs trinken. und die sie hervorsprudeln lassen in reichlichem Sprudel.",
                            "verse 76:7": "Sie vollbringen das Gelübde, und sie fürchten einen Tag, dessen Übel sich weithin ausbreitet.",
                            "verse 76:8": "Und sie geben Speise, aus Liebe zu Ihm, dem Armen, der Waise und dem Gefangenen,",
                            "verse 76:9": "(Indem sie sprechen :) «Wir speisen euch nur um Allahs willen. Wir begehren von euch weder Lohn noch Dank.",
                            "verse 76:10": "Wir fürchten von unserem Herrn einen Tag des Finsterblickens und des Unheils.»",
                            "verse 76:11": "Drum wird Allah sie vor dem Übel jenes Tags bewahren und ihnen Freude und Glück bescheren.",
                            "verse 76:12": "Und Er wird sie für ihre Standhaftigkeit belohnen mit einem Garten und seidnen (Gewändern),",
                            "verse 76:13": "Darin auf erhöhten Sitzen lehnend, werden sie dort weder Gluthitze noch Eiseskälte erfahren.",
                            "verse 76:14": "Und seine Schatten werden dicht über ihnen sein, und seine gebüschelten Früchte werden leicht erreichbar gemacht.",
                            "verse 76:15": "Und Trinkgefäße aus Silber werden unter ihnen kreisen, und Pokale von Glas,",
                            "verse 76:16": "(Durchsichtig wie) Glas, doch aus Silber, und sie werden ihren Umfang bemessen nach dem Maß.",
                            "verse 76:17": "Und es wird ihnen dort ein Becher zu trinken gereicht werden, dem Ingwer beigemischt ist -",
                            "verse 76:18": "Eine Quelle darinnen, Salsabíl geheißen.",
                            "verse 76:19": "Und es werden ihnen dort Jünglinge aufwarten, die kein Alter berührt. Wenn du sie siehst, du hältst sie für Perlen, verstreute;",
                            "verse 76:20": "Und wenn du dort in irgendeine Richtung schauest, so wirst du Glückseligkeit und ein großes Reich erblicken.",
                            "verse 76:21": "An ihnen werden Gewänder sein von feiner, grüner Seide und schwerem Brokat. Sie werden mit silbernen Spangen geschmückt sein. Und ihr Herr wird sie mit einem reinen Trank laben.",
                            "verse 76:22": "«Das ist euer Lohn, und euer Bemühen ist angenommen worden.»",
                            "verse 76:23": "Wahrlich, Wir Selbst haben dir den Koran stückweise offenbart.",
                            "verse 76:24": "So warte geduldig auf den Befehl deines Herrn und gehorche keinem, der ein Sünder oder ein Ungläubiger unter ihnen ist.",
                            "verse 76:25": "Und gedenke des Namens deines Herrn am Morgen und am Abend.",
                            "verse 76:26": "Und während der Nacht wirf dich nieder vor Ihm und preise Seine Herrlichkeit einen langen Teil der Nacht hindurch.",
                            "verse 76:27": "Fürwahr, diese lieben das Gegenwärtige und setzen den unvermeidlichen Tag hintan.",
                            "verse 76:28": "Wir haben sie erschaffen und stark gemacht ihre Beschaffenheit; und wenn Wir wollen, Wir können andere ihresgleichen an ihre Stelle setzen.",
                            "verse 76:29": "Wahrlich, dies ist eine Ermahnung. So möge, wer da will, einen Weg zu seinem Herrn nehmen.",
                            "verse 76:30": "Und ihr wollt, weil Allah will. Wahrlich, Allah ist allwissend, allweise.",
                            "verse 76:31": "Er läßt, wen Er will, in Seine Barmherzigkeit eingehen, und für die Frevler hat Er qualvolle Strafe bereitet."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "cs’kd bUlku ij ,d ,slk oD+r vk pqdk gS fd og dksbZ pht+ d+kfcys ft+Ø u Fkk",
                            "verse 76:2": "geus bUlku dks e[+kywr uqRQs+ ls iSnk fd;k fd mls vkt+ek;s rks geus mls lqurk ns[krk cuk;k",
                            "verse 76:3": "vkSj mldks jkLrk Hkh fn[kk fn;k ¼vc og½ [+okg Óqdz xqt+kj gks [+okg u ÓqØk",
                            "verse 76:4": "geus dkfQ+jksa ds t+athjs] rkSd vkSj ngdrh gq;h vkx rS;kj dj j[kh gS",
                            "verse 76:5": "cs’kd usdksdkj yksx Ójkc ds og lkxj fi;saxs ftlesa dkQw+j dh vkesft+’k gksxh ;s ,d p’ek gS ftlesa ls [+kqnk ds ¼[k+kl½ cUns fi;saxs",
                            "verse 76:6": "vkSj tgk¡ pkgsaxs cgk ys tk,¡xs",
                            "verse 76:7": ";s og yksx gSa tks ut+jsa iwjh djrs gSa vkSj ml fnu ls ftudh l[+rh gj rjg QSyh gksxh Mjrs gSa",
                            "verse 76:8": "vkSj mldh eksgCcr esa eksgrkt vkSj ;rhe vkSj vlhj dks [kkuk f[kykrs gSa",
                            "verse 76:9": "¼vkSj dgrs gSa fd½ ge rks rqedks cl [+kkfyl [+kqnk ds fy, f[kykrs gSa ge u rqe ls cnys ds [+kkLrxkj gSa vkSj u ÓqØ xqt+kjh ds",
                            "verse 76:10": "gedks rks vius ijojfnxkj ls ml fnu dk Mj gS ftlesa eq¡g cu tk,¡xs ¼vkSj½ psgjs ij gokb;k¡ mM+rh gksaxh",
                            "verse 76:11": "rks [+kqnk mUgsa ml fnu dh rdyhQ+ ls cpk ysxk vkSj mudks rkt+xh vkSj [+kq’kfnyh vrk Qjek,xk",
                            "verse 76:12": "vkSj muds lcz ds cnys ¼csfg’r ds½ ckx+ vkSj js’ke ¼dh iks’kkd½ vrk Q+jek,xk",
                            "verse 76:13": "ogk¡ og r[+rksa ij rfd, yxk, ¼cSBs½ gksaxs u ogk¡ ¼vkQrkc dh½ /kwi ns[ksaxs vkSj u f’kn~nr dh lnhZ",
                            "verse 76:14": "vkSj ?kus nj[+rksa ds lk, mu ij >qds gq, gksaxs vkSj esoksa ds xqPNs muds cgqr d+jhc gj rjg muds ,[+rs;kj esa",
                            "verse 76:15": "vkSj muds lkeus pk¡nh ds lkx+j vkSj Óh’ks ds fugk;r Ó¶+Q+kQ+ fxykl dk nkSj py jgk gksxk",
                            "verse 76:16": "vkSj Óh’ks Hkh ¼dk¡p ds ugha½ pk¡nh ds tks Bhd vUnkt+s ds eqrkfcd cuk, x, gSa",
                            "verse 76:17": "vkSj ogk¡ mUgsa ,slh Ójkc fiykbZ tk,xh ftlesa tutchy ¼ds ikuh½ dh vkesft+’k gksxh",
                            "verse 76:18": ";s csg’r esa ,d p’ek gS ftldk uke lylchy gS",
                            "verse 76:19": "vkSj muds lkeus ges’kk ,d gkyr ij jgus okys ukStoky yM+ds pDdj yxkrs gksaxs fd tc rqe mudks ns[kks rks le>ks fd fc[kjs gq, eksrh gSa",
                            "verse 76:20": "vkSj tc rqe ogk¡ fuxkg mBkvksxs rks gj rjg dh usver vkSj vt+heq’k ’kku lYrur ns[kksxs",
                            "verse 76:21": "muds Åij lCt+ Øsc vkSj vryl dh iks’kkd gksxh vkSj mUgsa pk¡nh ds daxu iguk, tk,¡xs vkSj mudk ijojfnxkj mUgsa fugk;r ikdht+k Ójkc fiyk,xk",
                            "verse 76:22": ";s ;d+huh rqEgkjs fy, gksxk vkSj rqEgkjh ¼dkjxqt+kfj;ksa ds½ flys esa vkSj rqEgkjh dksf’k’k d+kfcys ÓqØ xqt+kjh gS",
                            "verse 76:23": "¼,s jlwy½ geus rqe ij d+qjku dks j¶+rk j¶+rk djds ukft+y fd;k",
                            "verse 76:24": "rks rqe vius ijojfnxkj ds gqDe ds bUrt+kj esa lcz fd, jgks vkSj mu yksxksa esa ls xqukgxkj vkSj uk’kqØs dh iSjoh u djuk",
                            "verse 76:25": "lqcg Óke vius ijojfnxkj dk uke ysrs jgks",
                            "verse 76:26": "vkSj dqN jkr x, mldk ltnk djks vkSj cM+h jkr rd mldh rLchg djrs jgks",
                            "verse 76:27": ";s yksx ;d+huu nqfu;k dks ilUn djrs gSa vkSj cM+s Hkkjh fnu dks vius ils iq’r NksM+ cSBs gSa",
                            "verse 76:28": "geus mudks iSnk fd;k vkSj muds vkt+k dks et+cwr cuk;k vkSj vxj ge pkgsa rks muds cnys mUgha ds tSls yksx ys vk,¡",
                            "verse 76:29": "cs’kd ;s dq+jku ljklj ulhgr gS rks tks Ó[+l pkgs vius ijojfnxkj dh jkg ys",
                            "verse 76:30": "vkSj tc rd [+kqnk dks eat+wj u gks rqe yksx dqN Hkh pkg ugha ldrs cs’kd [+kqnk cM+k okfd+Qdkj nkuk gS",
                            "verse 76:31": "ftldks pkgs viuh jger esa nkf[+ky dj ys vkSj t+kfyeksa ds okLrs mlus nnZukd vt+kc rS;kj dj j[kk gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "Bukankah telah datang atas manusia satu waktu dari masa, sedang dia ketika itu belum merupakan sesuatu yang dapat disebut?",
                            "verse 76:2": "Sesungguhnya Kami telah menciptakan manusia dari setetes mani yang bercampur yang Kami hendak mengujinya (dengan perintah dan larangan), karena itu Kami jadikan dia mendengar dan melihat.",
                            "verse 76:3": "Sesungguhnya Kami telah menunjukinya jalan yang lurus; ada yang bersyukur dan ada pula yang kafir.",
                            "verse 76:4": "Sesungguhnya Kami menyediakan bagi orang-orang kafir rantai, belenggu dan neraka yang menyala-nyala.",
                            "verse 76:5": "Sesungguhnya orang-orang yang berbuat kebajikan minum dari gelas (berisi minuman) yang campurannya adalah air kafur.",
                            "verse 76:6": "(yaitu) mata air (dalam surga) yang daripadanya hamba-hamba Allah minum, yang mereka dapat mengalirkannya dengan sebaik-baiknya.",
                            "verse 76:7": "Mereka menunaikan nazar dan takut akan suatu hari yang azabnya merata di mana-mana.",
                            "verse 76:8": "Dan mereka memberikan makanan yang disukainya kepada orang miskin, anak yatim dan orang yang ditawan.",
                            "verse 76:9": "Sesungguhnya Kami memberi makanan kepadamu hanyalah untuk mengharapkan keridhaan Allah, kami tidak menghendaki balasan dari kamu dan tidak pula (ucapan) terima kasih.",
                            "verse 76:10": "Sesungguhnya Kami takut akan (azab) Tuhan kami pada suatu hari yang (di hari itu) orang-orang bermuka masam penuh kesulitan.",
                            "verse 76:11": "Maka Tuhan memelihara mereka dari kesusahan hari itu, dan memberikan kepada mereka kejernihan (wajah) dan kegembiraan hati.",
                            "verse 76:12": "Dan Dia memberi balasan kepada mereka karena kesabaran mereka (dengan) surga dan (pakaian) sutera,",
                            "verse 76:13": "di dalamnya mereka duduk bertelekan di atas dipan, mereka tidak merasakan di dalamnya (teriknya) matahari dan tidak pula dingin yang bersangatan.",
                            "verse 76:14": "Dan naungan (pohon-pohon surga itu) dekat di atas mereka dan buahnya dimudahkan memetiknya semudah-mudahnya.",
                            "verse 76:15": "Dan diedarkan kepada mereka bejana-bejana dari perak dan piala-piala yang bening laksana kaca,",
                            "verse 76:16": "(yaitu) kaca-kaca (yang terbuat) dari perak yang telah diukur mereka dengan sebaik-baiknya.",
                            "verse 76:17": "Di dalam surga itu mereka diberi minum segelas (minuman) yang campurannya adalah jahe.",
                            "verse 76:18": "(Yang didatangkan dari) sebuah mata air surga yang dinamakan salsabil.",
                            "verse 76:19": "Dan mereka dikelilingi oleh pelayan-pelayan muda yang tetap muda. Apabila kamu melihat mereka kamu akan mengira mereka, mutiara yang bertaburan.",
                            "verse 76:20": "Dan apabila kamu melihat di sana (surga), niscaya kamu akan melihat berbagai macam keni’matan dan kerajaan yang besar.",
                            "verse 76:21": "Mereka memakai pakaian sutera halus yang hijau dan sutera tebal dan dipakaikan kepada mereka gelang terbuat dari perak, dan Tuhan memberikan kepada mereka minuman yang bersih.",
                            "verse 76:22": "Sesungguhnya ini adalah balasan untukmu, dan usahamu adalah disyukuri (diberi balasan).",
                            "verse 76:23": "Sesungguhnya Kami telah menurunkan Al Qur'an kepadamu (hai Muhammad) dengan berangsur-angsur.",
                            "verse 76:24": "Maka bersabarlah kamu untuk (melaksanakan) ketetapan Tuhanmu, dan janganlah kamu ikuti orang yang berdosa dan orang yang kafir di antara mereka.",
                            "verse 76:25": "Dan sebutlah nama Tuhanmu pada (waktu) pagi dan petang.",
                            "verse 76:26": "Dan pada sebagian dari malam, maka sujudlah kepada-Nya dan bertasbihlah kepada-Nya pada bagian yang panjang di malam hari.",
                            "verse 76:27": "Sesungguhnya mereka (orang kafir) menyukai kehidupan dunia dan mereka tidak memperdulikan kesudahan mereka, pada hari yang berat (hari akhirat).",
                            "verse 76:28": "Kami telah menciptakan mereka dan menguatkan persendian tubuh mereka, apabila Kami menghendaki, Kami sungguh-sungguh mengganti (mereka) dengan orang-orang yang serupa dengan mereka.",
                            "verse 76:29": "Sesungguhnya (ayat-ayat) ini adalah suatu peringatan, maka barang siapa menghendaki (kebaikan bagi dirinya) niscaya dia mengambil jalan kepada Tuhannya.",
                            "verse 76:30": "Dan kamu tidak mampu (menempuh jalan itu), kecuali bila dikehendaki Allah. Sesungguhnya Allah adalah Maha Mengetahui lagi Maha Bijaksana.",
                            "verse 76:31": "Dia memasukkan siapa yang dikehendaki-Nya ke dalam rahmat-Nya (surga). Dan bagi orang-orang zalim disediakan-Nya azab yang pedih."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "E' forse trascorso un lasso di tempo in cui l'uomo non sia stato una creatura degna di menzione ?",
                            "verse 76:2": "Invero creammo l'uomo, per metterlo alla prova, da una goccia di sperma eterogenea e abbiamo fatto sì che sentisse e vedesse",
                            "verse 76:3": "e gli abbiamo indicato la Retta Via, sia esso riconoscente o ingrato.",
                            "verse 76:4": "In verità abbiamo preparato per i miscredenti catene, gioghi e la Fiamma.",
                            "verse 76:5": "In verità i giusti berranno da una coppa in cui è un miscuglio di [acqua e di] Kafûr ,",
                            "verse 76:6": "[attinta da una] fonte da cui berranno i servi di Allah, che la faranno fluire con abbondanza,",
                            "verse 76:7": "coloro che assolvono ai loro voti e temono il giorno il cui male si propagherà ovunque,",
                            "verse 76:8": "[loro] che, nonostante il loro bisogno , nutrono il povero, l'orfano e il prigioniero;",
                            "verse 76:9": "[e interiormente affermano:] « E' solo per il volto di Allah, che vi nutriamo; non ci aspettiamo da voi né ricompensa, né gratitudine.",
                            "verse 76:10": "Invero noi temiamo un Giorno terribile e catastrofico da parte del nostro Signore».",
                            "verse 76:11": "Allah li preserverà dal male di quel Giorno e verserà su di loro splendore e gioia,",
                            "verse 76:12": "li compenserà del loro perseverare con il Giardino e la seta .",
                            "verse 76:13": "Adagiati su alti divani, non dovranno subire né il sole, né il freddo pungente.",
                            "verse 76:14": "Le sue ombre li copriranno e i suoi frutti penderanno a portata di mano.",
                            "verse 76:15": "Verranno serviti da un vassoio d'argento e coppe di cristallo,",
                            "verse 76:16": "di cristallo e d'argento, convenientemente riempite.",
                            "verse 76:17": "E berranno colà, da una coppa contenente una mistura di zenzero,",
                            "verse 76:18": "[attinta] da una fonte di quel luogo chiamata Salsabîl .",
                            "verse 76:19": "Saranno serviti da fanciulli di eterna giovinezza: vedendoli, ti sembreranno perle sparse.",
                            "verse 76:20": "Quando lo vedrai, vedrai delizia e un vasto regno.",
                            "verse 76:21": "Indosseranno abiti verdi di seta finissima e broccato. Saranno ornati con bracciali d'argento e il loro Signore darà loro una bevanda purissima.",
                            "verse 76:22": "In verità questo vi sarà concesso in ricompensa e il vostro sforzo sarà riconosciuto.",
                            "verse 76:23": "In verità siamo stati Noi a far scendere gradualmente il Corano su di te.",
                            "verse 76:24": "Sii paziente [nell'attesa] del Decreto del tuo Signore e non obbedire al peccatore e all'ingrato dei loro.",
                            "verse 76:25": "Menziona il Nome del tuo Signore, al mattino e alla sera,",
                            "verse 76:26": "e durante la notte prosternati a Lui e glorificaLo a lungo nella notte.",
                            "verse 76:27": "Coloro che amano l'effimero trascurano un Giorno grave .",
                            "verse 76:28": "Siamo stati Noi a crearli e a consolidare le loro giunture. Se volessimo, li sostituiremmo con altri loro simili.",
                            "verse 76:29": "In verità questo è un Monito. Chi vuole, intraprenda dunque la via che conduce al suo Signore.",
                            "verse 76:30": "Ma voi lo vorrete solo se Allah lo vuole . Allah è sapiente e saggio.",
                            "verse 76:31": "Introduce chi vuole nella Sua misericordia, mentre per gli ingiusti ha preparato un doloroso castigo."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "人間には，なにものとも呼べない，長い時期があったではないか。",
                            "verse 76:2": "本当にわれはかれを試みるため混合した一滴の精液から人間を創った。それでわれは聴覚と視覚をかれに授けた。",
                            "verse 76:3": "われは，人間に（正しい）道を示した。感謝する者（信じる者）になるか，信じない者になるか，と。",
                            "verse 76:4": "不信心者には，われは鎖と首枷と烈火を準備して置いた。",
                            "verse 76:5": "（信者の）善行者は，カーフールを混ぜた杯（の飲物）を飲むであろう。",
                            "verse 76:6": "（それは）アッラーのしもべたちが飲む泉のことで，われは思いのままに滾々と（泉を）涌き出させる。",
                            "verse 76:7": "かれら（善行者）は誓いを果し，災厄の広がる日を恐れている。",
                            "verse 76:8": "またかれらは，かれを敬愛するために，貧者と孤児と捕虜に食物を与える。",
                            "verse 76:9": "（そして言う。）「わたしたちは，アッラーの御喜びを願って，あなたがたを養い，あなたがたに報酬も感謝も求めません。",
                            "verse 76:10": "わたしたちは，主の苦渋に満ちた御怒りの日を恐れます」。",
                            "verse 76:11": "それでアッラーは，その日の災厄からかれらを守り，素晴しい喜びを与えられる。",
                            "verse 76:12": "かれらが耐え忍んだので，かれは楽園と絹（の衣）でかれらに報われ，",
                            "verse 76:13": "その（楽園の）中で，寝床の上にゆったりと身を伸ばし，かれらは酷暑の太陽も，水る寒気もおぼえないであろう。",
                            "verse 76:14": "（樹木の）木陰はかれらの上を覆い，（果実の）房は慎ましく垂れ下る。",
                            "verse 76:15": "銀の水差しとガラスの杯は，かれらの間に回されよう。",
                            "verse 76:16": "ガラス（の杯と見えたの）は銀で造られていて，かれらは好みの量をそれに満たす。",
                            "verse 76:17": "かれらはそこて，生姜を混ぜた杯の飲物を与えられよう。",
                            "verse 76:18": "そこに，サルサビールと名付けられる泉がある。",
                            "verse 76:19": "また永遠の少年たちがかれらの間を往米し，あなたがかれらを見ると，(捲?)き散らされた真珠であると思うであろう。",
                            "verse 76:20": "あなたは視線を向けると至福の壮大な三国を認めるであろう。",
                            "verse 76:21": "かれらは美しい緑色の絹と錦の外衣を纒い，銀の腕輪で飾られ，主はかれらに純良な飲物を飲ませられる。",
                            "verse 76:22": "「本当にこれはあなたがたに対する報奨である。あなたがたの努力が受け入られたのである。」（と仰せられよう）。",
                            "verse 76:23": "われこそは，段階をおってあなたにクルアーンを下したものである。",
                            "verse 76:24": "だから（伝道に専念し），あなたの主の審判を耐え忍んで待て。かれらの中の罪ある者や，不信心者に従ってはならない。",
                            "verse 76:25": "朝な夕な，あなたの主の御名を唱念しなさい。",
                            "verse 76:26": "そして夜の一部をかれにサジダし，長夜のしじまに，かれを讃えなさい。",
                            "verse 76:27": "本当にこれらの者は，束の間の生活を愛し，重大な日を背後に捨て去る。",
                            "verse 76:28": "かれを創り，その四肢を堅く縛ぎ止めたのはわれである。われが欲するならば，かれらと類似の外のもので置き替えることも出来るのである。",
                            "verse 76:29": "本当にこれは一つの訓戒である。だから誰でも望む者には，かれの主への道をとらせなさい。",
                            "verse 76:30": "だがアッラーが御望みにならなければ，あなたがたは欲しないであろう。アッラーは全知にして英明であられる。",
                            "verse 76:31": "かれは，御心に適う者を慈悲に浴させ，また不義の徒に対しては痛烈な懲罰を備えられる。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "인간에 관하여 언급할 만한 어떤 것도 없었던 오랜 기간이 흘렀노라",
                            "verse 76:2": "실로 하나님은 혼합된 한방울의 정액으로써 인간을 창조하사 그를 시험하기 위해서라 그리하 여 하나님은 인간에게 청각과 시 력을 부여하고",
                            "verse 76:3": "길을 제시하여 주었으되 인 간이 감사하고 불신하는 것은 그 의 선택이라",
                            "verse 76:4": "그러나 불신자들에게는 쇠사 슬과 멍에와 타오르는 불지옥을 준비하였고",
                            "verse 76:5": "의로운 자들을 위해서는 그들이 마실 카푸르가 혼합된 술을 마실 잔을 준비하셨노라",
                            "verse 76:6": "그것은 하나님의 종들이 마 실 샘물로 그들이 원하는대로 길 러오니라",
                            "verse 76:7": "그들은 약속을 수행하였고 멀리서 퍼져 다가올 사악한 어떤 그날을 두려워 했으며",
                            "verse 76:8": "그들은 하나님을 사랑하여 가난한 자와 고아와 포로들에게 먹 을 음식을 제공하며",
                            "verse 76:9": "우리는 하나님만을 위해 여러분에게 음식을 제공할 뿐 어떤 보상이나 감사도 원치 아니합니다 라고 말하고",
                            "verse 76:10": "실로 우리는 주님께서 엄하고 크게 노여워 하실 어느 날을 두려워합니다 라고 하더라",
                            "verse 76:11": "그러나 하나님은 그날의 사악함으로부터 그들을 구하사 그들에게 기쁨과 행복을 주실 것이라",
                            "verse 76:12": "이는 그들이 인내하였기 때문으로 그분께서 천국과 명주의 의상으로 그들을 보상하실 것이 니",
                            "verse 76:13": "그들은 천국의 높은 안락의자에 기대어 작열하는 태양의 열 사와 추위도 맛보지 아니 하노라",
                            "verse 76:14": "천국의 그늘이 그들 위로 내려져 있으며 과일들은 그들의 손 이 닿기에 가까운 곳에 있으며",
                            "verse 76:15": "은과 수정으로된 잔들이 그 들 사이를 오가고",
                            "verse 76:16": "그들은 수정같은 맑은 은잔 에 좋을 만큼 따라 마시더라",
                            "verse 76:17": "잔자빌이 혼합된 술잔이 그 들에게 주어지고",
                            "verse 76:18": "그곳에는 쌀싸빌이라는 우 물이 있으며",
                            "verse 76:19": "그들 주위를 도는 청순한 소년들을 너희가 보리니 너희는 그들이 뿌려논 진주들처럼 생각하리라",
                            "verse 76:20": "너희가 그곳을 볼 때 너희는 그곳에서 축복과 위대한 왕국을 목격하리라",
                            "verse 76:21": "그들은 초록색 명주와 두꺼 운 금실로 짠 명주를 걸치고 은팔 찌로 장식을 하고 있으며 주님은 그들로 하여금 성스러운 음료수를 마시게 하더라",
                            "verse 76:22": "실로 이것이 너희를 위한 보 상으로 너희의 노력은 이처럼 보 상되니라",
                            "verse 76:23": "하나님이 그대에게 단계적으 로 꾸란을 계시했노라",
                            "verse 76:24": "주님의 명령에 인내하고 죄 인들이나 은혜를 모르는 자들에게 귀를 기울이지말며",
                            "verse 76:25": "아침 저녁으로 주님을 염원 하고",
                            "verse 76:26": "밤중에는 그분께 부복하여 경배하며 긴 밤을 통하여 그분을 영광되게 하라",
                            "verse 76:27": "실로 이들은 잠시 지나가는 현세를 사랑할 뿐 고통스러울 어 느 날은 소홀히 할 뿐이라",
                            "verse 76:28": "하나님이 그들을 창조하고 강하게 하였으나 하나님이 원할 때 그들을 완전히 대체할 수 있노라",
                            "verse 76:29": "실로 이것이 하나의 교훈이 거늘 원하는 자 누구든지 주님으 로 이르는 길을 따르도록 하라",
                            "verse 76:30": "너희가 원하는 것 하나님의 허락없이는 아니 되나니 실로 하나님은 아심과 지혜로 충만하시니라",
                            "verse 76:31": "하나님은 그분이 원하는 자 를 그분의 은혜속에 들게 하시나 사악한 자들을 위해서는 고통스러 운 응벌을 준비하셨노라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "به‌ڕاستی ماوه‌یه‌کی زۆر له ڕۆژگار به‌سه‌ر ئاده‌میزادا هات که شتێکی وانه‌بوو ناو ببرێت.",
                            "verse 76:2": "بێگومان ئێمه ئینسانمان دروستکرد له تێکه‌ڵه‌یه‌ك (له سه‌ره‌مێکوته‌یه‌کی بچووك و هێلکۆکه‌یه‌ك) له کاتێکدا ده‌مانه‌وێت تاقی بکه‌ینه‌وه‌، هه‌ر بۆیه ده‌زگای بیستن و بینینمان پێبه‌خشی.",
                            "verse 76:3": "به‌ڕاستی ئێمه ڕێنمووییمان کرد بۆ ڕێگه‌ی ڕاست، به ئازادی ده‌توانێت ببێته که‌سایه‌تیه‌کی ئیماندارو سوپاسگوزار، یان بێ باوه‌ڕو خوانه‌ناس.",
                            "verse 76:4": "به‌ڕاستی با بزانێت که ئێمه چه‌نده‌ها کۆت و زنجیرو ئاگری هه‌ڵگیرساومان ئاماده‌کردووه بۆ بێ باوه‌ڕان.",
                            "verse 76:5": "بێگومان چاکان و پاکانیش له په‌رداخێکی پڕ شه‌رابدا ده‌خۆنه‌وه‌، که ئاوێته‌که‌ی له سه‌رچاوه‌ی کافووره‌وه‌یه‌.",
                            "verse 76:6": "که کانی یه‌که به‌نده‌کانی خوا لێی ده‌خۆنه‌وه له هه‌ر شوێنێکدا بیانه‌وێت هه‌ڵی ده‌قوڵێنن و فواره ده‌کات.",
                            "verse 76:7": "ئه‌و به‌خته‌وه‌رانه‌، یه‌کێك له سیفاتیان ئه‌وه‌یه‌: وه‌فا به‌نه‌زر ده‌که‌ن، یاخود به‌ڵێنێکیاندا وه‌فادارن و ئه‌نجامی ده‌ده‌ن و بیمیان هه‌یه له ڕۆژێك که شه‌ڕی لێ ده‌بارێت و پرشو بڵاوه‌...",
                            "verse 76:8": "هه‌روه‌ها نان و خۆراك ده‌به‌خشن، ئه‌گه‌رچی خۆشه‌ویستیش بێت لایان، به‌هه‌ژارو هه‌تیوو دیله‌کان.",
                            "verse 76:9": "ده‌ڵێن: بێگومان ئێمه ئه‌م خۆراکه‌تان هه‌ر له‌به‌ر خواو بۆ به‌ده‌ستهێنانی ڕه‌زامه‌ندی ئه‌و پێده‌به‌خشین، نه پاداشتمان لێتان ده‌وێت نه سوپاس.",
                            "verse 76:10": "هه‌روه‌ها ده‌ڵێن: ئه‌م کاره بۆیه ده‌که‌ین چونکه له ڕۆژێکی تاڵ و گرژو ڕه‌ش و تاریك ده‌ترسین، که په‌روه‌ردگارمان پێشی ده‌هێنێت.",
                            "verse 76:11": "جا خوای گه‌وره‌ش له شه‌ڕو ناخۆشی و نه‌هامه‌تی ئه‌و ڕۆژه پاڕاستنی و ڕووی گه‌ش و شادمانی پێبه‌خشین.",
                            "verse 76:12": "له پاداشتی خۆگری و ئارامگریاندا به‌هه‌شت و ئاوریشمی پێبه‌خشین.",
                            "verse 76:13": "ئه‌و به‌خته‌وه‌رانه له‌سه‌ر کورسی و قه‌نه‌فه ڕازاوه‌کان شانیان داداوه‌، نه گه‌رمای خۆر بێزاریان ده‌کات، نه کزه باو سه‌رما سه‌غڵه‌تیان ده‌کات.",
                            "verse 76:14": "سێبه‌ری دره‌خته جوانه‌کان به‌سه‌ر شوێنه خۆشه‌کانیاندا سه‌ری فرو هێناوه‌و لێکردنه‌وه‌ی میوه‌کانیش ئاسانه‌و ملکه‌چ کراوه‌.",
                            "verse 76:15": "هه‌روه‌ها له سوراحی و دۆلکه‌ی زیودا شه‌رابیان بۆ ده‌گێڕن که ده‌کرێته ئه‌و کوپ و په‌رداخانه‌وه که له شووشه‌و کریستاڵی تایبه‌ت دروستکراون.",
                            "verse 76:16": "هه‌موو دام و ده‌زگای خواردن و خواردنه‌وه‌کان له شووشه‌ی زیوی دروستکراون به‌شێوه‌یه‌کی جوان و دڵڕفێن.",
                            "verse 76:17": "هه‌روه‌ها شه‌رابێکی تریان پێشکه‌ش ده‌کرێت که ئاوێته‌که‌ی زه‌نجه‌بیله‌.",
                            "verse 76:18": "که سه‌رچاوه‌یه‌که له به‌هه‌شتدا به سه‌لسه‌بیل ناو ده‌برێت.",
                            "verse 76:19": "ئینجا نه‌وجه‌وانانی هه‌میشه لاوو ڕووخۆش و جوان و پاك، به‌ناویاندا ده‌گه‌ڕێن (قسه‌ی خۆش و سروودی به‌تام ده‌ڵێن) کاتێك ده‌یانبینیت وا ده‌زانیت مروارین و به‌و ناوه‌دا بڵاو بوونه‌ته‌وه‌.",
                            "verse 76:20": "کاتێکیش به‌هه‌ر لایه‌کدا چاوده‌گێڕیت، ئه‌وه نازو نیعمه‌تی نه‌بڕاوه‌و بێ ئه‌ندازو ده‌سه‌ڵاتێکی گه‌وره ده‌بینیت له باخ و باخات و کۆشك و ته‌لارو دیمه‌نی جوان و فراوانی بێ سنوور.",
                            "verse 76:21": "پۆشاکی به‌خته‌وه‌ران ئاوریشمی سه‌وزی ته‌نکه که به‌سه‌ر پۆشاکی ئاوریشمی ئه‌ستووردا له‌به‌ریان کردووه‌، به بازنی زیوی ڕازێنراونه‌ته‌وه‌، ئینجا له‌لایه‌ن په‌روه‌ردگاریانه‌وه شه‌رابی پاك و بێگه‌رد و خاوێنیان پێشکه‌ش کراوه‌.",
                            "verse 76:22": "پاشان په‌روه‌ردگاریان پێیان ده‌فه‌رموێت: به‌ڕاستی ئه‌م پاداشته شایسته‌ی ئێوه‌یه‌، هه‌وڵ و کۆشش و کارو کرده‌وه‌ی ئێوه شایانی سوپاس و ڕێزه‌.. (بێگومان خوای گه‌وره به‌م سوپاسگوزاریه ئه‌وه‌نده‌ی تر به‌خته‌وه‌ران و دڵخۆش ده‌کات).",
                            "verse 76:23": "دڵنیاش به ئه‌ی محمد صلی الله علیه وسلم هه‌ر ئێمه قورئانمان بۆ تۆ دابه‌زاندووه به‌ش به‌ش (تا خه‌ڵکی پێ بێدار بکه‌یته‌وه‌).",
                            "verse 76:24": "که‌واته خۆڕاگربه بۆ فه‌رمانی په‌روه‌ردگارت، نه‌که‌یت ملکه‌چ و فه‌رمانبه‌رداری تاوانباران و بێ باوه‌ڕان بیت له‌وان.",
                            "verse 76:25": "ئینجا به‌رده‌وام یادی په‌روه‌ردگارت بکه‌و ناوی پیرۆزی با ویردی سه‌رزارت بێت، له به‌ره‌به‌یان و ده‌مه‌و ئێواراندا.",
                            "verse 76:26": "له شه‌وگاریشدا سوژده‌ی بۆ ببه‌و ته‌سبیحات و ستایشی له هه‌ندێکی شه‌ودا زۆر بکه‌.",
                            "verse 76:27": "به‌ڕاستی زۆربه‌ی ئه‌و خه‌ڵکه سه‌رگه‌ردانه حه‌زیان له ژیانی ئه‌م دنیا ته‌مه‌ن کۆتایه‌یه که به‌خێرایی تێ ده‌په‌ڕێت و ڕۆژێکی سه‌خت و سه‌نگین پشتگوێ ده‌خه‌ن و حسابی بۆ ناکه‌ن.",
                            "verse 76:28": "بۆ بیرناکه‌نه‌وه‌، خۆ هه‌ر ئێمه دروستمان کردوون ئه‌ندامه‌کانی له‌شیانمان پێکه‌وه به‌ستووه‌، کاتێکیش بمانه‌وێت ئه‌مانه لاده‌به‌ین و به‌که‌سانی تر سه‌ر زه‌وی ئاوه‌دان ده‌که‌ینه‌وه‌.",
                            "verse 76:29": "به‌ڕاستی ئه‌م سووره‌ته و سه‌رجه‌م ئایه‌ته‌کانی قورئان ئامۆژگارییه‌، جا ئه‌وه‌ی ئاره‌زووی به‌هه‌شتی هه‌یه‌، ئه‌وه بۆ لای خوا ڕێگه‌و ڕێباز ده‌گرێته به‌ر.",
                            "verse 76:30": "دڵنیاش بن: ئێوه هیچتان پێناکرێت و هیچ کارێکتان پێ ئه‌نجام نادرێت مه‌گه‌ر خوا ویستی له‌سه‌ربێت، بێگومان ئه‌و خوایه زاناو دانایه ده‌زانێت کێ شایسته‌ی هیدایه‌ته‌، داناشه له هیدایه‌تدانی به‌نده چاکه‌کاندا.",
                            "verse 76:31": "ئینجا ئه‌و که‌سه‌ی خوا بیه‌وێت و خۆشی هه‌وڵبدات، ده‌یخاته ژێر سایه‌ی ڕه‌حمه‌تی خۆیه‌وه‌و بۆ سته‌مکارانیش سزای به‌ئێشی ئاماده کردووه‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "Bukankah telah berlalu kepada manusia satu ketika dari masa (yang beredar), sedang dia (masih belum wujud lagi dan) tidak menjadi sesuatu benda yang disebut-sebut, (maka mengapa kaum musyrik itu mengingkari hari akhirat)?",
                            "verse 76:2": "Sesungguhnya Kami telah aturkan cara mencipta manusia bermulanya dari air mani yang bercampur (dari pati benih lelaki dan perempuan), serta Kami tetap mengujinya (dengan kewajipan-kewajipan); oleh itu maka Kami jadikan dia berkeadaan mendengar dan melihat.",
                            "verse 76:3": "Kerana keadaan itu tidak mencukupi, maka) sesungguhnya Kami telah menunjukkan kepadanya (melalui akal dan Rasul) akan jalan-jalan (yang benar dan yang salah; maka terserahlah kepadanya) samada dia bersyukur (dengan beriman dan taat), ataupun dia berlaku kufur (dengan mengingkari kebenaran atau menderhaka).",
                            "verse 76:4": "(Dalam pada itu), sesungguhnya Kami telah menyediakan bagi sesiapa yang berlaku kufur (atau menderhaka): Beberapa rantai dan belenggu serta Neraka yang menjulang-julang.",
                            "verse 76:5": "Sesungguhnya orang-orang yang berbakti (dengan taat dan kebajikan), akan meminum dari piala: Sejenis minuman yang bercampur dengan \"Kafur\", -",
                            "verse 76:6": "Iaitu sebuah mata air (di Syurga), yang diminum daripadanya oleh hamba-hamba Allah (yang taat); mereka boleh mengalirkannya (di tempat-tempat tinggal mereka) dengan aliran yang semudah-mudahnya dan menurut kemahuannya.",
                            "verse 76:7": "(Mereka dikurniakan kesenangan itu kerana) mereka menyempurnakan nazarnya (apatah lagi yang diwajibkan Tuhan kepadanya), serta mereka takutkan hari (akhirat) yang azab seksanya merebak di sana sini.",
                            "verse 76:8": "Mereka juga memberi makan benda-benda makanan yang dihajati dan disukainya, kepada orang miskin dan anak yatim serta orang tawanan,",
                            "verse 76:9": "(Sambil berkata dengan lidah atau dengan hati): Sesungguhnya kami memberi makan kepada kamu kerana Allah semata-mata; kami tidak berkehendakkan sebarang balasan dari kamu atau ucapan terima kasih,",
                            "verse 76:10": "Kami sebenarnya takutkan Tuhan kami, takut Dia kenakan kami azab hari yang padanya muka orang-orang yang bersalah: Masam berkerut-kerut.",
                            "verse 76:11": "Dengan sebab (mereka menjaga diri dari kesalahan), maka Allah selamatkan mereka dari kesengsaraan hari yang demikian keadaannya, serta memberikan kepada mereka keindahan yang berseri-seri (di muka) dan perasaan ria gembira (di hati).",
                            "verse 76:12": "Dan kerana kesabaran mereka (mengerjakan suruhan Allah dan meninggalkan laranganNya), mereka dibalas oleh Allah dengan Syurga dan (persalinan dari) sutera.",
                            "verse 76:13": "Mereka berehat di dalam Syurga dengan berbaring di atas pelamin-pelamin (yang berhias), mereka tidak nampak di situ adanya matahari (usahkan hawa panasnya), dan tidak juga merasai suasana yang terlampau sejuk;",
                            "verse 76:14": "Sedang naungan pohon-pohon Syurga itu dekat kepada mereka dan buah-buahannya pula dimudahkan (untuk mereka memetiknya) dengan semudah-mudahnya.",
                            "verse 76:15": "Dan (selain itu) diedarkan kepada mereka (oleh pelayan-pelayannya): Bijana dari perak dan piala-piala minuman yang keadaannya laksana kaca (nampak jelas isinya) -",
                            "verse 76:16": "(Keadaannya laksana) kaca, (sedang ia) dari perak; pelayan-pelayan itu menentukan kadar isinya sekadar yang cukup betul dengan kehendak penggunanya.",
                            "verse 76:17": "Dan mereka dalam Syurga itu, diberi minum sejenis minuman yang campurannya dari \"Zanjabil\",",
                            "verse 76:18": "Iaitu sebuah mata air dalam Syurga, yang disebutkan sifatnya sebagai \"Salsabil\".",
                            "verse 76:19": "Dan mereka dilayani oleh anak-anak muda lelaki yang tetap kekal (dalam keadaan mudanya), yang sentiasa beredar di sekitar mereka; apabila engkau melihat anak-anak muda itu, nescaya engkau menyangkanya mutiara yang bertaburan.",
                            "verse 76:20": "Dan apabila engkau melihat di sana (dalam Syurga itu), engkau melihat nikmat yang melimpah-limpah dan kerajaan yang besar (yang tidak ada bandingannya).",
                            "verse 76:21": "Mereka di dalam Syurga memakai pakaian hijau yang diperbuat dari sutera halus dan sutera tebal (yang bertekat), serta mereka dihiasi dengan gelang-gelang tangan dari perak dan mereka diberi minum oleh Tuhan mereka dengan sejenis minuman (yang lain) yang bersih suci.",
                            "verse 76:22": "(Serta dikatakan kepada mereka): Sesungguhnya (segala pemberian) ini adalah untuk kamu sebagai balasan dan adalah usaha amal kamu (di dunia dahulu) diterima dan dihargai (oleh Allah).",
                            "verse 76:23": "Sesungguhnya Kami telah menurunkan Al-Quran kepadamu (wahai Muhammad), dengan beransur-ansur.",
                            "verse 76:24": "Oleh itu hendaklah engkau bersabar menerima hukum Tuhanmu (memberi tempoh kepada golongan yang menentangmu) dan janganlah engkau menurut kehendak orang yang berdosa di antara mereka atau orang yang kufur ingkar.",
                            "verse 76:25": "Dan sebutlah dengan lidah atau dengan hati akan nama Tuhanmu (di dalam dan di luar sembahyang), pada waktu pagi dan petang;",
                            "verse 76:26": "Dan (dengan apa keadaan pun maka) pada sebahagian dari waktu malam sujudlah kepada Tuhan (dengan mengerjakan sembahyang) dan (seboleh-bolehnya) bertasbihlah memujiNya (dengan mengerjakan sembahyang Tahajjud), pada sebahagian yang panjang dari waktu malam.",
                            "verse 76:27": "Sesungguhnya orang-orang (yang menentangmu) itu sentiasa mencintai (kesenangan dan kemewahan dunia) yang cepat habisnya, serta mereka membelakangkan (tidak menghiraukan bekalan) untuk hari akhirat yang amat berat (penderitaannya kepada orang-orang yang tidak bertakwa).",
                            "verse 76:28": "Kamilah yang menciptakan mereka serta menguatkan tulang sendi dan urat saraf mereka; (Kami berkuasa membinasakan mereka) dan apabila Kami kehendaki, Kami gantikan (mereka dengan) orang-orang yang serupa dengan mereka, dengan penggantian yang sebaik-baiknya.",
                            "verse 76:29": "Sesungguhnya (segala keterangan yang disebutkan) ini, menjadi peringatan; maka sesiapa yang mahukan (kebaikan dirinya) bolehlah dia mengambil jalan yang menyampaikan kepada keredaan Allah (dengan iman dan taat).",
                            "verse 76:30": "Dan tiadalah kamu berkemahuan (melakukan sesuatu perkara) melainkan dengan cara yang dikehendaki Allah; sesungguhnya Allah adalah Maha Mengetahui, lagi Maha Bijaksana (mengaturkan sebarang perkara yang dikehendakiNya).",
                            "verse 76:31": "Dia memasukkan sesiapa yang dikehendakiNya (menurut aturan yang ditetapkan) ke dalam rahmatNya (dengan ditempatkannya di dalam Syurga) dan orang-orang yang zalim, Dia menyediakan untuk mereka azab seksa yang tidak terperi sakitnya."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "آيا زمانى طولانى بر انسان گذشت كه چيز قابل ذكرى نبود؟!",
                            "verse 76:2": "ما انسان را از نطفه مختلطى آفريديم، و او را مى‏آزماييم; (بدين جهت) او را شنوا و بينا قرار داديم!",
                            "verse 76:3": "ما راه را به او نشان داديم، خواه شاكر باشد (و پذيرا گردد) يا ناسپاس!",
                            "verse 76:4": "ما براى كافران، زنجيرها و غلها و شعله‏هاى سوزان آتش آماده كرده‏ايم!",
                            "verse 76:5": "به يقين ابرار (و نيكان) از جامى مى‏نوشند كه با عطر خوشى آميخته است،",
                            "verse 76:6": "از چشمه‏اى كه بندگان خاص خدا از آن مى‏نوشند، و از هر جا بخواهند آن را جارى مى‏سازند!",
                            "verse 76:7": "آنها به نذر خود وفا مى‏كنند، و از روزى كه شر و عذابش گسترده است مى‏ترسند،",
                            "verse 76:8": "و غذاى (خود) را با اينكه به آن علاقه (و نياز) دارند، به «مسكين‏» و «يتيم‏» و «اسير» مى‏دهند!",
                            "verse 76:9": "(و مى‏گويند:) ما شما را بخاطر خدا اطعام مى‏كنيم، و هيچ پاداش و سپاسى از شما نمى‏خواهيم!",
                            "verse 76:10": "ما از پروردگارمان خائفيم در آن روزى كه عبوس و سخت است!",
                            "verse 76:11": "(بخاطر اين عقيده و عمل) خداوند آنان را از شر آن روز نگه مى‏دارد و آنها را مى‏پذيرد در حالى كه غرق شادى و سرورند!",
                            "verse 76:12": "و در برابر صبرشان، بهشت و لباسهاى حرير بهشتى را به آنها پاداش مى‏دهد!",
                            "verse 76:13": "اين در حالى است كه در بهشت بر تختهاى زيبا تكيه كرده‏اند، نه آفتاب را در آنجا مى‏بينند و نه سرما را!",
                            "verse 76:14": "و در حالى است كه سايه‏هاى درختان بهشتى بر آنها فرو افتاده و چيدن ميوه‏هايش بسيار آسان است!",
                            "verse 76:15": "و در گرداگرد آنها ظرفهايى سيمين و قدحهايى بلورين مى‏گردانند (پر از بهترين غذاها و نوشيدنى‏ها)،",
                            "verse 76:16": "ظرفهاى بلورينى از نقره، كه آنها را به اندازه مناسب آماده كرده‏اند!",
                            "verse 76:17": "و در آنجا از جامهايى سيراب مى‏شوند كه لبريز از شراب طهورى آميخته با زنجبيل است،",
                            "verse 76:18": "از چشمه‏اى در بهشت كه نامش سلسبيل است!",
                            "verse 76:19": "و بر گردشان (براى پذيرايى) نوجوانانى جاودانى مى‏گردند كه هرگاه آنها را ببينى گمان مى‏كنى مرواريد پراكنده‏اند!",
                            "verse 76:20": "و هنگامى كه آنجا را ببينى نعمتها و ملك عظيمى را مى‏بينى!",
                            "verse 76:21": "بر اندام آنها ( بهشتيان) لباسهايى است از حرير نازك سبزرنگ، و از ديباى ضخيم، و با دستبندهايى از نقره آراسته‏اند، و پروردگارشان شراب طهور به آنان مى‏نوشاند!",
                            "verse 76:22": "اين پاداش شماست، و سعى و تلاش شما مورد قدردانى است!",
                            "verse 76:23": "مسلما ما را بر تو نازل كرديم!",
                            "verse 76:24": "پس در (تبليغ و اجراى) حكم پروردگارت شكيبا (و با استقامت) باش، و از هيچ گنهكار يا كافرى از آنان اطاعت مكن!",
                            "verse 76:25": "و نام پروردگارت را هر صبح و شام به ياد آور!",
                            "verse 76:26": "و در شبانگاه براى او سجده كن، و مقدارى طولانى از شب، او را تسبيح گوى!",
                            "verse 76:27": "آنها زندگى زودگذر دنيا را دوست دارند، در حالى كه روز سختى را پشت سر خود رها مى‏كنند!",
                            "verse 76:28": "ما آنها را آفريديم و پيوندهاى وجودشان را محكم كرديم، و هر زمان بخواهيم جاى آنان را به گروه ديگرى مى‏دهيم!",
                            "verse 76:29": "اين يك تذكر و يادآورى است، و هر كس بخواهد (با استفاده از آن) راهى به سوى پروردگارش برمى‏گزيند!",
                            "verse 76:30": "و شما هيچ چيز را نمى‏خواهيد مگر اينكه خدا بخواهد، خداوند دانا و حكيم بوده و هست!",
                            "verse 76:31": "و هر كس را بخواهد (و شايسته بداند) در رحمت (وسيع) خود وارد مى‏كند، و براى ظالمان عذاب دردناكى آماده ساخته است!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "Acaso, não transcorreu um longo período, desde que o homem nada era?",
                            "verse 76:2": "Em verdade, criamos o homem, de esperma misturado, para prová-lo, e o dotamos de ouvidos e vistas.",
                            "verse 76:3": "Em verdade, assinalamos-lhe uma senda, quer fosse agradecido, quer fosse ingrato.",
                            "verse 76:4": "Em verdade, aos incrédulos, destinamos correntes, grilhões e o tártaro.",
                            "verse 76:5": "Em verdade, os justos beberão, em uma taça, um néctar, mesclado com cânfora.",
                            "verse 76:6": "De uma fonte, da qual beberão todos os servos de Deus. Eles a fazem fluir abundantemente,",
                            "verse 76:7": "Porque cumprem os seus votos e temem o dia em que o mal estará espalhado,",
                            "verse 76:8": "E porque, por amor a Ele, alimentam o necessitado, o órfão e o cativo.",
                            "verse 76:9": "(Dizendo): Certamente vos alimentamos por amor a Deus; não vos exigimos recompensa, nem gratidão.",
                            "verse 76:10": "Em verdade, tememos, da parte do nosso Senhor, o dia da aflição calamitosa.",
                            "verse 76:11": "Mas Deus os preservará do mal daquele dia, e os receberá com esplendor e júbilo;",
                            "verse 76:12": "E os recompensará, por sua perseverança, com um vergel e (vestimentas de) seda,",
                            "verse 76:13": "Onde, reclinados sobre almofadas, não sentirão calor nem frio excessivos,",
                            "verse 76:14": "E as sombras (do vergel) os cobrirão, e os cachos (de frutos) estarão pendurados, em humildade.",
                            "verse 76:15": "E serão servidos em taças de prata e em copos diáfanos,",
                            "verse 76:16": "Feitos de prata, semelhantes a cristal, que lhe serão fornecidos em abundância.",
                            "verse 76:17": "E ali ser-lhes-á servido um copo de néctar, cuja mescla será de gengibre,",
                            "verse 76:18": "De uma fonte (no Paraíso), chamada Salsabil.",
                            "verse 76:19": "E os servirão mancebos imortais; quando os vires, parecer-te-ão pérolas dispersas.",
                            "verse 76:20": "E quando olhares além, verás glórias e um magnífico reino.",
                            "verse 76:21": "Sobre eles haverá vestimentas verdes, de tafetá e de brocado, estarão enfeitados com braceletes de prata e o seu Senhor lhes saciará a sede com uma bebida pura!",
                            "verse 76:22": "Sabei que esta será a vossa recompensa, e os vossos esforços serão reconhecidos.",
                            "verse 76:23": "Em verdade, temos-te revelado (ó Mensageiro), o Alcorão, por etapas,",
                            "verse 76:24": "Persevera, pois, até o Juízo do teu Senhor, e não obedeças a nenhum dos pecadores ou incrédulos,",
                            "verse 76:25": "E celebra o nome do teu Senhor, de manhã e à tarde.",
                            "verse 76:26": "E adora-O, e glorifica-O durante grande parte da noite.",
                            "verse 76:27": "Em verdade, (quanto aos outros) preferem a efêmera vida terrena e tentam afastar a lembrança de um dia (que será) pesado.",
                            "verse 76:28": "Nós os criamos e fortalecemos as suas estruturas; porém se quiséssemos, suplantá-los-íamos inteiramente por outros, semelhantes a eles.",
                            "verse 76:29": "Em verdade, esta é uma admoestação: e, quem quiser, poderá encaminhar-se até à senda do seu Senhor.",
                            "verse 76:30": "Porém, só o conseguireis se Deus o permitir, porque é Prudente, Sapientíssimo.",
                            "verse 76:31": "Ele admite em Sua misericórdia quem Lhe apraz; porém, destinou aos iníquos, um doloroso castigo."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 76:1": "Oare nu a avut omul parte de o bucatã de timp când el nu era ceva vrednic de a fi pomenit?",
                            "verse 76:2": "Nu l-am creat pe om dintr-o picãturã de amestecuri, ca sã-l încercãm, și l-am fãcut pe el cu auz și cu vedere?",
                            "verse 76:3": "Noi l-am cãlãuzit pe drum, fie cã el va fi mulțumitor, fie cã el vafi nemulțumitor.",
                            "verse 76:4": "Noi am pregãtit pentru necredincioși lanțuri, fiare și un Foc cu vâlvãtãi.",
                            "verse 76:5": "Cei evlavioși vor bea dintr-un pahar, al cãrui amestec va fi cu camfor,",
                            "verse 76:6": "Dintr-un izvor din care beau robii lui Allah, fãcându-l sã țâșneascã mereu.",
                            "verse 76:7": "Ei își țin legãmintele și se tem de o Zi, al cãrei rãu se întinde peste tot.",
                            "verse 76:8": "Și-l hrãnesc cu mâncare, în ciuda dragostei pentru ea, pe cel sãrman și pe orfan și pe prizonier,",
                            "verse 76:9": "[Zicând]: “Noi vã hrãnim pentru a dobândi Fața lui Allah și nu voim de la voi nici rãsplatã, nici mulțumire!",
                            "verse 76:10": "Noi ne temem de o Zi posomorâtã și tristã de la Domnul nostru!\"",
                            "verse 76:11": "Allah îi va apãra pe ei de rãul acelei Zile și-i va face pe ei sã aibã parte de luminã și bucurie;",
                            "verse 76:12": "Și îi va rãsplãti pe ei pentru cã au rãbdat, cu o Grãdinã și cu[veșminte] de mãtase,",
                            "verse 76:13": "Rezemându-se pe divanuri, fãrã sã vadã în ea nici soare arzãtor, nici ger.",
                            "verse 76:14": "Și asupra lor se vor lãsa în jos umbrele ei, iar fructele ei vor atârna, [fiind la îndemâna lor].",
                            "verse 76:15": "Și se va trece printre ei cu vase de argint și cu pocaluri cristaline,",
                            "verse 76:16": "Cristaluri de argint fãcute cu mãsurã precisã,",
                            "verse 76:17": "Și li se va da sã bea [acolo] dintr-un pocal al cãrui amestec va fi cu ghimbir,",
                            "verse 76:18": "[Scos] acolo dintr-un izvor ce se cheamã Salsabil.",
                            "verse 76:19": "Vor trece printre ei bãieți veșnic tineri, care, când îi vezi, crezi cã sunt mãrgãritare înșirate.",
                            "verse 76:20": "Și când te vei uita acolo, vei afla plãcere și mare împãrãție.",
                            "verse 76:21": "Vor purta veșminte din mãtase verde și brocart și vor fi împodobițicu brãțãri de argint. Și Domnul lor le va da sã bea dintr-o bãuturã curatã .",
                            "verse 76:22": "Aceasta va fi pentru voi rãsplata și râvna voastrã va primi mulțumire.",
                            "verse 76:23": "Noi ți-am trimis ție Coranul treptat,",
                            "verse 76:24": "Așadar, fii rãbdãtor și așteaptã judecata Domnului tãu și nu da ascultare vreunui pãcãtos sau necredincios dintre ei !",
                            "verse 76:25": "Și pomenește numele Domnului tãu dimineața și seara",
                            "verse 76:26": "Și prosterneazã-te dinaintea Lui și o parte din noapte și laudã-Lpe El și în timpul nopții îndelung!",
                            "verse 76:27": "Aceștia iubesc viața trecãtoare și lasã în urma lor o Zi grea.",
                            "verse 76:28": "Noi i-am creat pe ei și am întãrit fãptura lor, însã dacã voim, Noiîi putem înlocui pe ei numaidecât cu alții asemenea lor.",
                            "verse 76:29": "Aceasta este o Îndemnare și cine voiește apucã drumul cãtreDomnul sãu.",
                            "verse 76:30": "Însã voi nu puteți voi decât dacã binevoiește Allah, cãci Allah esteAtoateștiutor [și] Înțelept [Alim, Hakim].",
                            "verse 76:31": "El lasã sã intre pe cine voiește sub îndurarea Sa, iar nelegiuiților le-a pregãtit chin dureros."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 76:1": "Nu a trecut oare peste om o vreme când nu este nimic amintit?",
                            "verse 76:2": "Noi am creat omul, pentru a-l pune la încercare, dintr-o picătură de sămânţă şi amestecuri. Noi i-am dat auzul şi văzul.",
                            "verse 76:3": "L-am călăuzit pe Calea cea Dreaptă, fie că va fi mulţumitor, fie că va fi tăgăduitor.",
                            "verse 76:4": "Tăgăduitorilor le-am pregătit lanţuri, juguri şi Jăratec.",
                            "verse 76:5": "Neprihăniţii vor bea dintr-un pocal o licoare cu camfor.",
                            "verse 76:6": "Robii lui Dumnezeu vor bea din izvoare pe care le vom face să ţâşnească din belşug,",
                            "verse 76:7": "căci ei îşi împlinesc făgăduinţele, se tem de o zi al cărui rău se va răspândi în tot locul.",
                            "verse 76:8": "Ei dau de mâncare din dragoste pentru El, sărmanului, orfanului şi prinsului:",
                            "verse 76:9": "“Noi vă dăm de mâncare de dragul lui Dumnezeu şi nu vrem de la voi nici răsplată, nici mulţumire.",
                            "verse 76:10": "Nouă ne este frică de Domnul nostru în ziua cea cruntă şi nimicitoare.”",
                            "verse 76:11": "Dumnezeu i-a ferit însă de răul acelei Zile şi le va da să întâlnească numai voioşie şi bucurie.",
                            "verse 76:12": "El îi va răsplăti pentru răbdarea lor cu o grădină şi cu mătase.",
                            "verse 76:13": "Culcaţi pe paturi de nuntă nu vor suferi nici de soarele arzător şi nici de gerul pişcător.",
                            "verse 76:14": "Umbra se va lăsa peste ei, iar fructele se vor apleca să fie culese.",
                            "verse 76:15": "Printre ei vor umbla vase de argint şi pocaluri de cleştar,",
                            "verse 76:16": "de cleştar şi de argint, umplute cu măsură.",
                            "verse 76:17": "Vor bea dintr-un pocal un amestec de ghimbir,",
                            "verse 76:18": "şi dintr-un izvor numit acolo Salsabil.",
                            "verse 76:19": "Flăcăiandrii nemuritori se vor învârti în jurul lor — văzându-i vei crede că sunt mărgăritare neînşirate!",
                            "verse 76:20": "Când vei privi în jur, vei vedea desfătare şi o mare împărăţie.",
                            "verse 76:21": "Ei vor purta veşminte verzi, de satin şi de brocart şi vor fi împodobiţi cu brăţări de argint. Domnul lor le va da să bea o băutură prea-curată.",
                            "verse 76:22": "“Toate acestea vă vor fi vouă răsplată a trudei voastre drept mulţumire!”",
                            "verse 76:23": "Noi am pogorât asupra ta Coranul.",
                            "verse 76:24": "Rabdă pentru Domnul tău! Nu da ascultare nici păcătosului şi nici tăgăduitorului dintre ei!",
                            "verse 76:25": "Aminteşte Numele Domnului tău în zori şi în amurg!",
                            "verse 76:26": "Noaptea, prosternează-te înaintea Lui şi preamăreşte-L noapte lungă.",
                            "verse 76:27": "Ei iubesc degrabă-trecătoarea şi dau la spate o Zi grea.",
                            "verse 76:28": "Noi i-am creat şi le-am întărit încheieturile, însă dacă vrem, îi putem înlocui cu alţii asemenea lor.",
                            "verse 76:29": "Aceasta este o amintire! Cel care vrea, apucă spre Domnul său pe o cale,",
                            "verse 76:30": "însă voi nu voiţi decât ceea ce Dumnezeu voieşte. Dumnezeu este Cunoscător, Înţelept.",
                            "verse 76:31": "El lasă să intre pe cine voieşte în milostivenia Sa, iar celor nedrepţi le-a pregătit o dureroasă osândă."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "Ужель над человеком не прошелТот долгий срок, когда он былничем?2287",
                            "verse 76:2": "Мы человека сотворилиИз капли смеси;Чтоб испытать его,Мы одарили его зрением и слухом2288.",
                            "verse 76:3": "И Мы (всеведением Нашим)2288аОпределили ему путь:Быть благодарным (Господу)или неверным.",
                            "verse 76:4": "Назначили Мы для неверныхЯрмо, оковы и пылающий Огонь.",
                            "verse 76:5": "А праведные будут пить из чашНапиток с добавлением кафура2289,",
                            "verse 76:6": "Что из источника служителей АллахаСтруею льется непрерывной.",
                            "verse 76:7": "Они свои обеты исполняют,Страшася Дня, когда (расплатаза грехи)(В тот День)Поглотит всех и вся.",
                            "verse 76:8": "Вздыхая о еде, они накормят все жИ сироту, и пленника, и бедняка:",
                            "verse 76:9": "«Мы кормим вас лишь для того,Чтобы снискать довольствие Аллаха,Не требуя ни благодарности от вас,ни воздаянья.",
                            "verse 76:10": "Поистине, страшимся мыДня бедствия и скорби,(Что ниспадет) по воленашего Владыки».",
                            "verse 76:11": "И потому Аллах избавил ихот бедствия и скорби того Дня,Пролив на лик их свет блаженства2290и радости (благословенной),",
                            "verse 76:12": "За постоянство и терпимость ихВознаградил их Садом и шелками.",
                            "verse 76:13": "(В Саду), на ложах возлегая,Им не терпеть уж боле никогдаНи зноя солнца и ни холода луны2291.",
                            "verse 76:14": "Прикроет их (деревьев) тень;В смиренье полном перед нимиСклонятся гроздья (райских) фруктов.",
                            "verse 76:15": "Им из серебряных сосудов(Льют питье) в хрустальные бокалы",
                            "verse 76:16": "Из кубов серебра, сверкающиххрустальным блеском,Которые несут отметины о мере.",
                            "verse 76:17": "И им дадут испить из чаш с добавкойимбиря",
                            "verse 76:18": "Напиток, что там бьет фонтаномиз ключа,Который именуют Сальсабиль.",
                            "verse 76:19": "Со всех сторон ихОтроки, навечно (молодые), будутублажать,Взглянув на коих вы сочтете,(Что чистотой своей и красотой)Они рассыпанным жемчужинамподобны.",
                            "verse 76:20": "А коль ты взглянешь, ты узришьуслады (Рая)И ширь великую (владений Божьих).",
                            "verse 76:21": "Облечены они в зеленые одеждыИз шелка (тонкого) и (расписной)парчи,Украшены браслетами из серебра,И им Господь их даст испитьНапиток (райской) чистоты.",
                            "verse 76:22": "(И прозвучит):«Сие, поистине, награда вам,И ваше тщание (на промысле Аллаха)(Им) принято и воздано’».",
                            "verse 76:23": "(Поистине, о Мухаммад!),Мы по частям тебе Коранниспосылаем,",
                            "verse 76:24": "(А потому) —Ты терпеливо жди указа твоегоВладыкиИ не прислушивайся к тем средь них,Кто грешен иль неверен (предАллахом).",
                            "verse 76:25": "И поминай Владыку твоегоИ по утрам, и в час вечерний.",
                            "verse 76:26": "И ночью ниц пади пред Ним,И славь Его всей ночью долгой.",
                            "verse 76:27": "Но их прельщает (тще’та) проходящей(жизни),И тяжким Днем (Последнего Суда)они пренебрегают.",
                            "verse 76:28": "Мы сотворили их и укрепилив целостном единстве,Но, если пожелаем Мы,Мы их заменим полною заменой —Подобными (по лику, но праведнымипред Аллахом).",
                            "verse 76:29": "Вот таково предупреждение(Господне),И всяк, кто этого желает,Пусть следует стезей, ведущейв Его Рай.",
                            "verse 76:30": "Но ни одно желанье ваше(В сей жизни) не найдет путиИначе, как по изволению Аллаха, —Ведь мудр и всезнающ Он!",
                            "verse 76:31": "Введет Он в Свою милость того, когосочтет,А скверным уготовил тяжкую расплату."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "¿Ha pasado el hombre por un período de tiempo en que no era nada digno de mención?",
                            "verse 76:2": "Hemos creado al hombre de una gota, de ingredientes, para ponerle a prueba. Le hemos dado el oído, la vista.",
                            "verse 76:3": "Agradecido o desagradecido, le hemos dirigido por el Camino.",
                            "verse 76:4": "Para los infieles hemos preparado cadenas, argollas y fuego de gehena.",
                            "verse 76:5": "Los justos beberán de copas de una mezcla alcanforada.",
                            "verse 76:6": "de una fuente de la que beberán los siervos de Alá y que harán manar en abundancia.",
                            "verse 76:7": "Fueron fieles a sus promesas y temieron un día cuyo mal será de alcance universal.",
                            "verse 76:8": "Por mucho amor que tuvieran al alimento, se lo daban al pobre, al huérfano y al cautivo:",
                            "verse 76:9": "«Os damos de comer sólo por agradar a Alá. No queremos de vosotros retribución ni gratitud.",
                            "verse 76:10": "Tememos, de nuestro Señor, un día terrible, calamitoso».",
                            "verse 76:11": "Alá les preservará del mal de ese día y les llenará de esplendor y alegría.",
                            "verse 76:12": "Les retribuira, por haber tenido paciencia, con un Jardín y con vestiduras de seda.",
                            "verse 76:13": "Reclinados allí en sofás, estarán resguardados allí del calor y del frío excesivo.",
                            "verse 76:14": "Cerca de ellos, les cubrirán sus sombras; sus frutos podrán ser cogidos muy fácilmente.",
                            "verse 76:15": "Se harán circular entre ellos vasijasa de plata y copas de cristal,",
                            "verse 76:16": "de un cristal de plata, de medidas determinadas.",
                            "verse 76:17": "Allí se les servirá una copa que contendrá una mezcla de jengibre,",
                            "verse 76:18": "tomada de una fuente de allí, que se llama Salsabil.",
                            "verse 76:19": "Y circularán entre ellos criados jóvenes de eterna juventud. Viéndoles, se les creería perlas desparramadas.",
                            "verse 76:20": "Cuando se mira allá, no se ve sino delicia y suntuosidad.",
                            "verse 76:21": "Vestirán de verde satén y de brocado y llevarán brazaletes de plata. Su Señor les servirá una bebida pura.",
                            "verse 76:22": "«Esto se os ha dado como retribución. Vuestro esfuerzo ha sido agradecido».",
                            "verse 76:23": "Somos Nosotros Quienes te llemos revelado el Corán de hecho.",
                            "verse 76:24": "Espera, pues, paciente, la decisión f de tu Señor y no obedezcas a quien de ellos sea pecador o desagradecido.",
                            "verse 76:25": "¡Y menciona el nombre de tu Señor mañana y tarde!",
                            "verse 76:26": "¡Por la noche, prostérnate ante Él! ¡Glorifícale largamente por la noche!",
                            "verse 76:27": "Éstos aman la vida fugaz y descuidan un día grave.",
                            "verse 76:28": "Nosotros los hemos creado y hemos fortalecido su constitución. Si quisiéramos, podríamos sustituirlos por otros semejantes.",
                            "verse 76:29": "Esto es un Recuerdo. El que quiera ¡que emprenda camino hacia su Señor!",
                            "verse 76:30": "Pero vosotros no lo querréis, a menos que Alá quiera. Alá es omnisciente, sabio.",
                            "verse 76:31": "lntroduce en Su misericordia a quien Él quiere. Pero a los impíos les ha preparado un castigo doloroso."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "திட்டமாக மனிதன் மீது காலத்தில் ஒரு நேரம் வந்து, அதில் அவன் இன்ன பொருள் என்று குறிப்பிட்டுக் கூறுவற்கில்லாத நிலையில் இருக்கவில்லையா?",
                            "verse 76:2": "(பின்னர் ஆண், பெண்) கலப்பான இந்திரியத்துளியிலிருந்து நிச்சயமாக மனிதனை நாமே படைத்தோம் - அவனை நாம் சோதிப்பதற்காக, அவனைக் கேட்பவனாகவும், பார்ப்பவனாகவும் ஆக்கினோம்.",
                            "verse 76:3": "நிச்சயமாக, நாம் அவனுக்கு வழியைக் காண்பித்தோம்; (அதைப் பின்பற்றி) நன்றி உள்ளவனாக இருக்கின்றான்; அல்லது (அதைப்புறக்கணித்து) நன்றியற்றவனாக இருக்கின்றான்.",
                            "verse 76:4": "காஃபிர்களுக்குச் சங்கிலிகளையும், அரிகண்டங்களையும், கொழுந்து விட்டெரியும் நரக நெருப்பையும் நிச்சயமாக நாம் தயார் செய்திருக்கின்றோம்.",
                            "verse 76:5": "நிச்சயமாக நல்லவர்கள் (சுவர்க்கத்தில்) குவளைகளிலிருந்து (பானம்) அருந்துவார்கள்; அதன் கலப்பு காஃபூராக (கற்பூரமாக) இருக்கும்,",
                            "verse 76:6": "(காஃபூர்) ஒரு சுனையாகும்; அதிலிருந்து அல்லாஹ்வின் நல்லடியார்கள் அருந்துவார்கள். அதை (அவர்கள் விரும்பும் இடங்களுக்கெல்லாம்) ஓடைகளாக ஓடச் செய்வார்கள்.",
                            "verse 76:7": "அவர்கள் தாம் (தங்கள்) நேர்ச்சைகளை நிறை வேற்றி வந்தார்கள்; (கியாம) நாளை அவர்கள் அஞ்சி வந்தார்கள். அதன் தீங்கு (எங்கும்) பரவியிருக்கும்.",
                            "verse 76:8": "மேலும், அ(வ்விறை)வன் மீதுள்ள பிரியத்தினால் ஏழைகளுக்கும், அநாதைகளுக்கும், சிறைப்பட்டோருக்கும் உணவளிப்பார்கள்.",
                            "verse 76:9": "\"உங்களுக்கு நாங்கள் உணவளிப்பதெல்லாம், அல்லாஹ்வின் முகத்திற்காக (அவன் திருப்பொருத்தத்திற்காக); உங்களிடமிருந்து பிரதிபலனையோ (அல்லது நீங்கள்) நன்றி செலுத்த வேண்டுமென்பதையோ நாங்கள் நாடவில்லை\" (என்று அவர்கள் கூறுவர்).",
                            "verse 76:10": "\"எங்கள் இறைவனிடமிருந்து, (எங்கள்) முகங் கடுகடுத்துச் சுண்டிவிடும் நாளை நிச்சயமாக நாங்கள் பயப்படுகிறோம்\" (என்றும் கூறுவர்).",
                            "verse 76:11": "எனவே, அல்லாஹ் அந்நாளின் தீங்கை விட்டும் அவர்களைப் பாதுகாத்து அவர்களுக்கு முகச் செழுமையையும், மனமகிழ்வையும் அளிப்பான்.",
                            "verse 76:12": "மேலும், அவர்கள் பொறுமையுடன் இருந்ததற்காக அவர்களுக்கு சுவர்க்கச் சோலைகளையும், பட்டாடைகளையும் அவன் நற்கூலியாகக் கொடுத்தான்.",
                            "verse 76:13": "அவர்கள் அங்குள்ள ஆசனங்களில் சாய்ந்து (மகிழ்ந்து) இருப்பார்கள்; சூரியனையோ, கடுங் குளிரையோ அதில் அவர்கள் காணமாட்டார்கள்.",
                            "verse 76:14": "மேலும், அதன் (மர) நிழல்கள், அவர்கள் மீது நெருங்கியதாக இருக்கும்; அன்றியும், அதன் பழங்கள் மிகத் தாழ்வாகத் தாழ்ந்திருக்கும்.",
                            "verse 76:15": "(பானங்கள்) வெள்ளிப் பாத்திரங்களையும், பளிங்குக் கிண்ணங்களையும் (கொண்டு) அவர்கள் மீது சுற்றிக் கொண்டு வரப்படும்.",
                            "verse 76:16": "(அவை பளிங்கல்ல) வெள்ளியினாலான, பளிங்கைப் போன்ற தெளிவான கிண்ணங்கள். அவற்றைத் தக்க அளவாக அமைந்திருப்பார்கள்.",
                            "verse 76:17": "மேலும் அ(ச்சுவர்க்கத்)தில் ஸன்ஜபீல் (என்னும் இஞ்சி) கலந்த ஒரு கிண்ண(த்தில் பான)ம் புகட்டப்படுவார்கள்.",
                            "verse 76:18": "'ஸல்ஸபீல்' என்ற பெயருடைய ஓர் ஊற்றும் அங்கு இருக்கிறது.",
                            "verse 76:19": "இன்னும், (அந்த சுவர்க்கவாசிகளைச்) சுற்றி எப்போதும் (இளமையோடு) இருக்கும் சிறுவர்கள் (சேவை செய்து) வருவார்கள்; அவர்களை நீர் காண்பீரானால் சிதறிய முத்துகளெனவே அவர்களை நீர் எண்ணுவீர்.",
                            "verse 76:20": "அன்றியும், (அங்கு) நீர் பார்த்தீராயின், இன்ப பாக்கியங்களையும், மாபெரும் அரசாங்கத்தையும் அங்கு காண்பீர்.",
                            "verse 76:21": "அவர்களின் மீது ஸுன்துஸு, இஸ்தப்ரக் போன்ற பச்சை நிற பூம்பட்டாடைகள் இருக்கும்; இன்னும் அவர்கள் வெள்ளியாலாகிய கடகங்கள் அணிவிக்கப்பட்டிருப்பர், அன்றியும், அவர்களுடைய இறைவன் அவர்களுக்குப் பரிசுத்தமான பானமும் புகட்டுவான்.",
                            "verse 76:22": "\"நிச்சயமாக இது உங்களுக்கு நற்கூலியாக இருக்கும்; உங்களுடைய முயற்சியும் ஏற்றுக் கொள்ளப்பட்டதாயிற்று\" (என்று அவர்களிடம் கூறப்படும்).",
                            "verse 76:23": "நிச்சயமாக நாம் தான் உம்மீது இந்தக் குர்ஆனை சிறுகச் சிறுக இறக்கி வைத்தோம்.",
                            "verse 76:24": "ஆகவே, உம்முடைய இறைவனின் கட்டளைக்காகப் பொறுமையுடன் (எதிர் பார்த்து) இருப்பீராக, அன்றியும், அவர்களில் நின்று எந்தப் பாவிக்கோ அல்லது நன்றியற்றவனுக்கோ நீர் வழிபடாதீர்.",
                            "verse 76:25": "காலையிலும், மாலையிலும் உம்முடைய இறைவனின் திருநாமத்தை தஸ்பீஹு (துதி) செய்து கொண்டிருப்பீராக.",
                            "verse 76:26": "இன்னும் இரவிலும் அவனுக்கு ஸுஜூது செய்வீராக, அன்றியும் இரவில் நெடுநேரம் அவனுக்கு தஸ்பீஹு(துதி) செய்வீராக.",
                            "verse 76:27": "நிச்சயமாக இவர்கள் விரைந்து சென்று விடுவ(தான இவ்வுலகத்)தையே நேசிக்கின்றனர், அப்பால் பளுவான (மறுமை) நாளைத் தங்களுக்குப் பின்னே விட்டு(ப் புறக்கணித்து) விடுகின்றனர்.",
                            "verse 76:28": "நாமே அவர்களைப் படைத்து அவர்களுடைய அமைப்பையும் கெட்டிப்படுத்தினோம்; அன்றியும் நாம் விரும்பினால் அவர்கள் போன்றவர்களை (அவர்களுக்குப் பதிலாக) மாற்றிக் கொண்டு வருவோம்.",
                            "verse 76:29": "நிச்சயமாக இது ஒரு நல்லுபதேசமாகும்; எனவே யார் விரும்புகிறாரோ அவர் தம்முடைய இறைவன் பால் (செல்லும்) வழியைத் தேர்ந்தெடுத்துக் கொள்வாராக.",
                            "verse 76:30": "எனினும், அல்லாஹ் நாடினாலன்றி, நீங்கள் நாட மாட்டீர்கள்; நிச்சயமாக அல்லாஹ் நன்கறிந்தவன், ஞானம் மிக்கவன்.",
                            "verse 76:31": "அவன், தான் விரும்புபவரை தன்னுடைய ரஹ்மத்தில் புகுத்துகிறான்; அன்றியும் அநியாயக்காரர்களுக்கு நோவினை செய்யும் வேதனையை அவர்களுக்காகச் சித்தம் செய்து வைத்திருக்கின்றான்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "แน่นอนกาลเวลาที่ยาวนานได้เกิดขึ้นแก่มนุษย์ เมื่อเขามิได้เป็นสิ่งที่ถูกกล่าวถึงเลย",
                            "verse 76:2": "แท้จริงเราได้สร้างมนุษย์จากน้ำเชื้อผสมหยดหนึ่ง เพื่อเราได้ทดสอบเขา ดังนั้นเราจึงทำให้เขาเป็นผู้ได้ยิน เป็นผู้ได้เห็น",
                            "verse 76:3": "แท้จริงเราได้ชี้แนะแนวทางให้แก่เขาแล้ว บางทีเขาก็เป็นผู้กตัญญู และบางทีเขาก็เป็นผู้เนรคุณ",
                            "verse 76:4": "แท้จริงเราได้เตรียมโซ่ตรวน และกุญแจมือ และไฟที่ลุกโชติช่วงไว้สำหรับบรรดาผู้ปฏิเสธศรัทธา",
                            "verse 76:5": "แท้จริงบรรดาผู้ทรงคุณธรรมนั้น จะได้ดื่มจากแก้วน้ำ ซึ่งผสมด้วยการบูรหอม",
                            "verse 76:6": "เป็นตาน้ำพุที่ปวงบ่าวของอัลลอฮ์จะได้ดื่ม พวกเขาทำให้มันพวยพุ่งออกมาอย่างล้นเหลือ",
                            "verse 76:7": "พวกเขาปฏิบัติตามคำสัตย์สาบาน และกลัวต่อวันหนึ่งที่ความชั่วร้ายของมันจะกระจายไปทั่ว",
                            "verse 76:8": "และพวกเขาให้อาหารเนื่องด้วยความรักต่อพระองค์แก่คนยากจน เด็กกำพร้าและเชลยศึก",
                            "verse 76:9": "(พวกเขากล่าวว่า) แท้จริงเราให้อาหารแก่พวกท่าน โดยหวังความโปรดปรานของอัลลอฮ์ เรามิได้หวังการตอบแทนและการขอบคุณจากพวกท่านแต่ประการใด",
                            "verse 76:10": "แท้จริงเรากลัวต่อพระเจ้าของเราซึ่งเป็นวันแห่งหน้านิ่วคิ้วขมวดและแสนสาหัส",
                            "verse 76:11": "ดังนั้น อัลลอฮ์จะทรงปกป้องพวกเขาให้พ้นจากความชั่วร้ายของวันนั้น และจะทรงให้พวกเขาพบกับความสดชื่นและความปิติ",
                            "verse 76:12": "และพระองค์จะทรงตอบแทนแก่พวกเขาด้วยสวนสวรรค์ และอาภรณ์ไหมแพรเนื่องเพราะพวกเขาอดทน",
                            "verse 76:13": "นอนเอกเขนก อยู่บนเก้าอี้นวมยาวในสวนสวรรค์ พวกเขาจะไม่พบเห็นแสงอาทิตย์ และความเหน็บหนาว",
                            "verse 76:14": "และร่มเงาของสวนสวรรค์จะปกคลุมพวกเขาอย่างใกล้ชิด และผลไม่ในสวนสวรรค์ถูกโน้มต่ำลงมาใกล้พวกเขา",
                            "verse 76:15": "และมีภาชนะที่ทำด้วยเงิน และแก้วน้ำที่ทำด้วยแก้วใสถูกวนเวียนรอบๆพวกเขา",
                            "verse 76:16": "แก้วที่ทำด้วยเงินโดยพวกเขาจะเติมมันตามสัดส่วนที่พวกเขาต้องการ",
                            "verse 76:17": "และในสวนสวรรค์นั้นพวกจะได้รับเครื่องดื่มจากแก้วซึ่งผสมด้วยขิง",
                            "verse 76:18": "ในสวนสวรรค์มีตาน้ำพุที่มีชื่อว่า ซัลสะบีล",
                            "verse 76:19": "และมีเด็กวัยรุ่นวนเวียนรอบๆ พวกเขา เมื่อเจ้าเห็นพวกเขา เจ้าคิดว่าพวกเขาเป็นไข่มุกที่เรียงราย",
                            "verse 76:20": "และเมื่อเจ้ามองไปยังที่นั่นเจ้าจะพบแต่ความสุข และอาณาจักรอันกว้างใหญ่ไพศาล",
                            "verse 76:21": "บนพวกเขามีอาภรณ์สีเขียวทำด้วยผ้าไหมละเอียด และผ้าไหมหยาบ และถูกประดับด้วยกำไลเงิน และพระเจ้าของพวกเขาจะทรงให้พวกเขาได้ดื่มเครื่องดื่มอันบริสุทธิ์ยิ่ง",
                            "verse 76:22": "แท้จริงนี่คือ การตอบแทนแก่พวกเจ้า และการบากบั่นของพวกเจ้านั้นเป็นที่ยอมรับด้วยความยินดี",
                            "verse 76:23": "แท้จริงเราได้ประทานอัลกุรอานให้แก่เจ้าเป็นขั้นตอน",
                            "verse 76:24": "ดังนั้น เจ้าจงอดทนคอยข้อตัดสินของพระเจ้าของเจ้า และอย่าเชื่อฟังผู้ประพฤติชั่ว และผู้ปฏิเสธศรัทธาคนใดในหมู่พวกเขา",
                            "verse 76:25": "และจงรำลึกถึงพระนามของพระเจ้าของเจ้าทั้งในยามเช้าและยามเย็น",
                            "verse 76:26": "และจากส่วนหนึ่งของกลางคืนก็จงสุญดต่อพระองค์ และจงแซ่ซ้องสดุดีพระองค์ ในยามกลางคืนอันยาวนาน",
                            "verse 76:27": "แท้จริง ชนเหล่านี้ (พวกปฏิเสธศรัทธา) รักชีวิตชั่วคราว และปล่อยทิ้งวันอันหนักหน่วงไว้เบื้องหลังพวกเขา",
                            "verse 76:28": "เราได้บังเกิดพวกเขา และเราได้ทำให้เรือนร่างของพวกเขามั่นคงแข็งแรง และหากเราประสงค์ เราก็จะเปลี่ยนพวกอื่นเยี่ยงพวกเขา",
                            "verse 76:29": "แท้จริง นี่คือข้อตักเตือนสติ ดังนั้นผู้ใดต้องการก็ให้เขายึดแนวทางสู่พระเจ้าของเขา",
                            "verse 76:30": "แต่พวกเจ้าจะไม่สมความปรารถนาได้ เว้นแต่ที่อัลลอฮ์ เป็นผู้ทรงรอบรู้ ผู้ทรงปรีชาญาณ",
                            "verse 76:31": "พระองค์จะทรงให้ผู้ที่พระองค์ทรงประสงค์เข้าสู่ความเมตตาของพระองค์ แต่บรรดาผู้อธรรมนั้น พระองค์ทรงเตรียมการลงโทษอันเจ็บปวดไว้สำหรับพวกเขา"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "İnsanın üzerinden, henüz kendisinin anılan bir şey olmadığı uzun bir süre geçmedi mi?",
                            "verse 76:2": "Gerçek şu ki, biz insanı katışık bir nutfeden (erkek ve kadının dölünden) yarattık; onu imtihan edelim diye, kendisini işitir ve görür kıldık.",
                            "verse 76:3": "Şüphesiz biz ona (doğru) yolu gösterdik. İster şükredici olsun ister nankör.",
                            "verse 76:4": "Doğrusu biz, kâfirler için zincirler; demir halkalar ve alevli bir ateş hazırladık.",
                            "verse 76:5": "İyiler ise, kâfûr katılmış bir kadehten (cennet şarabı) içerler.",
                            "verse 76:6": "(Bu,) Allah'ın has kullarının içtikleri ve akıttıkça akıttıkları bir pınardır.",
                            "verse 76:7": "O kullar, şiddeti her yere yayılmış olan bir günden korkarak verdikleri sözü yerine getirirler.",
                            "verse 76:8": "Onlar, kendi canları çekmesine rağmen yemeği yoksula, yetime ve esire yedirirler.",
                            "verse 76:9": "\"Biz sizi Allah rızası için doyuruyoruz; sizden ne bir karşılık ne de bir teşekkür bekliyoruz.\"",
                            "verse 76:10": "\"Biz, çetin ve belâlı bir günde Rabbimizden (O'nun azabına uğramaktan) korkarız\" (derler).",
                            "verse 76:11": "İşte bu yüzden Allah onları o günün fenalığından esirger; (yüzlerine) parlaklık, (gönüllerine) sevinç verir.",
                            "verse 76:12": "Sabretmelerine karşılık onlara cenneti ve (cennetteki) ipekleri lütfeder.",
                            "verse 76:13": "Orada koltuklara kurulmuş olarak bulunurlar; ne yakıcı sıcak görülür orada, ne de dondurucu soğuk.",
                            "verse 76:14": "(Cennet ağaçlarının) gölgeleri, üzerlerine sarkar; kolayca koparılabilen meyveleri istifadelerine sunulur.",
                            "verse 76:15": "Yanlarında gümüşten kaplar ve billûr kupalar dolaştırılır.",
                            "verse 76:16": "Gümüşten öyle kadehler ki onları istedikleri ölçüde tayin ve takdir etmişlerdir.",
                            "verse 76:17": "Onlara orada bir kâseden içirilir ki (bu şarabın) karışımında zencefil vardır.",
                            "verse 76:18": "(Bu şarap) orada bir pınardandır ki adına Selsebîl denir.",
                            "verse 76:19": "O insanların etrafında öyle ölümsüz genç nedîmler dolaşır ki, onları gördüğünde, etrafa saçılıp dağılmış inciler sanırsın.",
                            "verse 76:20": "Ne yana bakarsan bak, (yığınla) nimet ve ulu bir saltanat görürsün.",
                            "verse 76:21": "Üzerlerinde yeşil ipekten ince ve kalın elbiseler vardır; gümüş bilezikler takınmışlardır. Rableri onlara tertemiz bir içki içirir.",
                            "verse 76:22": "(Onlara şöyle denir:) Bu, sizin için bir mükâfattır. Sizin gayretiniz karşılığını bulmuştur.",
                            "verse 76:23": "(Resûlüm!) Kur'an'ı sana biz, evet biz indirdik.",
                            "verse 76:24": "Artık Rabbinin hükmüne (boyun eğip) sabret; onlardan hiçbir günahkâra, yahut hiçbir nanköre boyun eğme.",
                            "verse 76:25": "[76.25]Sabah akşam Rabbinin ismini yâdet.",
                            "verse 76:26": "Gecenin bir kısmında O'na secde et; gecenin uzun bir bölümünde de O'nu tesbih et.",
                            "verse 76:27": "Şu insanlar, çarçabuk geçen dünyayı seviyorlar da önlerindeki çetin bir günü (ahireti) ihmal ediyorlar.",
                            "verse 76:28": "Onları biz yarattık; onların yaratılışını sapasağlam yaptık. Dilediğimizde (kendilerini yok eder) yerlerine benzerlerıni getiririz.",
                            "verse 76:29": "Şüphesiz ki bu bir öğüttür. Aırtık dileyen Rabbine bir yol tutar.",
                            "verse 76:30": "Sizler ancak Rabbinizin dilemesi (izin vermesi) sayesinde (bir şeyi) dileyebilirsiniz. Şüphesiz Allah her şeyi bilendir, hikmet sahibidir.",
                            "verse 76:31": "O, dilediğini rahmetine dahil eder. Zalimlere gelince, onlar için elem verici bir azap hazırlamıştır. l. Yemin olsun, (iyiliklerle) birbiri peşinden gönderilenlere;"
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 76:1": "Ҳақиқатда инсонга, у эсга олинадиган нарса бўлмаган бир замон келмадими?",
                            "verse 76:2": "Албатта, Биз инсонни аралаш нутфадан яратдик. Синаш учун, бас, уни эшитадиган, кўрадиган қилдик.",
                            "verse 76:3": "Албатта, Биз унга йўл кўрсатдик. (У эса) ёки шукр қилувчи, ёки куфр қилувчи бўлди.",
                            "verse 76:4": "Албатта, Биз кофирлар учун занжирлар, кишанлар ва ёниб турган оловни тайёрлаб қўйдик.",
                            "verse 76:5": "Албатта, яхшилар каафур аралаштирилган қадаҳдан ичарлар. (Каафур–ичимликни хушбў ва хуштаъм қилувчи модда бўлиб араблар у аралашган шаробни энг яхши шароб ҳисоблашади.)",
                            "verse 76:6": "Бир булоқданики, ундан Аллоҳнинг бандалари отилтириб ичарлар.",
                            "verse 76:7": "Улар назрга вафо қиларлар ва ёмонлиги кенг тарқаладиган кундан қўрқарлар.",
                            "verse 76:8": "Ўзлари таомни яхши кўриб турсалар ҳам, уни мискин, етим ва асирга берарлар.(Аброрларнинг хислати нима экан! Улар ҳаттоки ўзларига таом керак бўлиб, ҳожатлари тушиб турса ҳам, мискин, етим, асирларни ўзларидан устун қўйиб, таомни уларга берадилар.)",
                            "verse 76:9": "«Албатта, Биз сизларни фақат Аллоҳнинг розилиги учун овқатлантирамиз. Бунинг эвазига сизлардан мукофот ёки ташуккур хоҳласмиз.",
                            "verse 76:10": "Албатта, биз қўрқинчли, шиддатли, узун кунда ўз Роббимиздан қўрқамиз», (дерлар).",
                            "verse 76:11": "Бас, уларни Роббилари ўшал кун шарридан сақлади ва уларга хушрўйлик ҳамда хурсандчилик ато қилди.",
                            "verse 76:12": "Ва сабр қилганликлари учун уларни боғу роғ ва ипаклар билан мукофотлади.",
                            "verse 76:13": "У ерда сўриларда суянган ҳолдалар. У ерда қуёшни ҳам, совуқни ҳам кўрмаслар.",
                            "verse 76:14": "Ва устиларига у(жаннат)нинг соялари яқиндир ҳамда унинг мевалари жуда ҳам осон қилингандир.",
                            "verse 76:15": "Ва уларга кумуш идишлар ва биллурлардан бўлган қадаҳлар айлантириб турилар.",
                            "verse 76:16": "Биллурлар, кумушсиймон, (соқийлар) ўлчовини келтирар.",
                            "verse 76:17": "Ва улар у ерда аралашмаси занжабил бўлган қадаҳдан суғорилар",
                            "verse 76:18": "Уердаги салсабийл, деб номланган булоқдан. (Занжабийл–ерга томир отган ўсимлик тури бўлиб, томири туйилиб хушбўй модда ясалади: араблар ундан ўз ичимликларига қўшиб ичишни жуда-жуда севадилар. Ичувчининг томоғидан ҳузур бағишлаб, осонлик билан ўтувчи шаробни араблар салсабийл деб атайдилар. «Салсабийлан» дейилганда шунга ишора қилиняпти.)",
                            "verse 76:19": "Ва уларнинг атрофида абадий ёш болалар айланурлар, агар уларни кўрсанг, сочилган маржон, деб ўйларсан.",
                            "verse 76:20": "Ва агар кўрсанг, у ерда неъматни ва улкан мулкни кўрарсан.",
                            "verse 76:21": "Уларнинг устиларида яшил сундусдан (юпқа ипакдан) ва истобрақдан (қалин ипакдан) кийимлар бор ва кумуш билакузуклар-ла ясанганлар ва Роббилари уларни пок шароб билан суғорар.",
                            "verse 76:22": "Албатта, бу сизга мукофот бўлди, ва амалингиз қабул бўлмшдир.",
                            "verse 76:23": "Албатта, Биз сенга Қуръонни бўлак-бўлак қилиб туширдик.",
                            "verse 76:24": "Бас, Роббинг ҳукмига сабр қил ва улардан гуноҳкор ёки кофирларига итоат қилма.",
                            "verse 76:25": "Эртаю кеч Роббинг исмини зикр қил.",
                            "verse 76:26": "Ва кечасида ҳам Унга сажда қил ва узоқ кечаларда Унга тасбиҳ айт. (Тафсирчилар «букратан»дан мурод Бамдод намози, «асийло»дан мурод пешин ва аср намози, «Ва минал лайли» Шом ва Хуфтон намозлари. «Лайлан товийло»дан мурод кечаси бедорлик билан ўқилган намоз деганлар.)",
                            "verse 76:27": "Албатта, анавилар шошган дунё)ни яхши кўрарлар ва оғир кунни ортларида қолдирарлар.",
                            "verse 76:28": "Биз уларни яратдик ва яратилишларини мстаҳкам қилдик. Ва агар хоҳласак уларнинг ўринларига ўхшашларини келтирурмиз.",
                            "verse 76:29": "Албатта, бу(сура)эслатмадир. Бас, ким хоҳласа ўз Роббисига йўл оладир.",
                            "verse 76:30": "Ва Аллоҳ хоҳласагина, сизлар ҳам хоҳларсиз. Албатта, Аллоҳ билувчи ва ҳикматли зотдир.",
                            "verse 76:31": "У кимни хоҳласа Ўз раҳматига киритадир ва золимлар учун аламли азоблар тайёрлаб қўйгандир."
                        }
                    }
                }
            }
        }
    }
}