{
    "id": 78,
    "name_simple": "An-Naba",
    "revelation_place": "makkah",
    "revelation_order": 80,
    "bismillah_pre": true,
    "verses_count": 40,
    "short_text": "The Surah derived its name from the word an-Naba in the second verse. This is not only a name but also a title of its subject matter, for Naba implies the news of Resurrection and Hereafter and the whole Surah is devoted to the same theme.",
    "text": [
        "\n",
        "The Surah derived its name from the word an-Naba in the second verse. This is not only a name but also a title of its subject matter, for Naba implies the news of Resurrection and Hereafter and the whole Surah is devoted to the same theme.",
        "\n",
        "Period of Revelation",
        "\n",
        "As we have explained in the introduction to Surah Al-Mursalat, the theme of all the Surahs, from Al-Qiyamah to An-Naziat, closely resembles one another's, and all these seem to have been revealed in the earliest period at Makkah.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme also is the same as of Surah Al-Mursalat, i. e. to affirm the Resurrection and Hereafter, and to warn the people of the consequences of acknowledging or disacknowledging it.",
        "\n",
        "When the Holy Prophet (upon whom be peace) first started to preach Islam in Makkah, his message consisted of three elements: (1) That none be held as an associate with Allah in Godhead; (2) that Allah had appointed him as His Messenger; (3) that this world will come to an end one day and then another world will be established when all the former and the latter generations will be resurrected with the same bodies in which they lived and worked in the world; then they will be called to account for their beliefs and deeds and those who emerge as believing and righteous in this accountability will go to Paradise and those who are proved to be disbelieving and wicked will live in Hell for ever.",
        "\n",
        "Of these although the first thing was highly unpleasant for the people of Makkah, yet in any case they were not disbelievers in the existence of Allah. They believed in His Being the Supreme Sustainer, Creator and Providence and also admitted that all those beings whom they regarded as their deities, were themselves Allah's creatures. Therefore, in this regard the only thing they disputed was whether they had any share in the attributes and powers of Divinity and in the Divine Being itself or not.",
        "\n",
        "As for the second thing, the people of Makkah were not prepared to accept it. However, what they could not possibly deny was that during the 40 years life that the Holy Prophet (upon whom be peace) had lived among them before his claim to Prophethood, they had never found him a lying deceitful person or the one who would adopt unlawful methods for selfish ends. They themselves admitted that he was a man possessed of wisdom, righteousness and moral superiority. Therefore, in spite of charging him with a thousand false accusations, nothing to say of making others believe, they were finding it difficult even for themselves to believe that although he was an honest and upright man in every other affair and dealing of life, yet, God forbid, a liar only in his claim to be a Prophet.",
        "\n",
        "Thus, the first two things were not in fact so perplexing for the people of Makkah as the third thing. When this was presented before them, they mocked it most of all, expressed unusual wonder at it, and regarding it as remote from reason and impossible, started talking against it as incredible, even inconceivable, in their assemblies. But in order to bring them to the way of Islam it was absolutely essential that the doctrine of the Hereafter should be instilled into their minds, for without belief in this doctrine, it was not at all possible that they could adopt a serious attitude with regard to the truth and falsehood, could change their standard of values in respect of good and evil, and giving up worship of the world, could be inclined to follow the way that Islam urged them to follow. That is why in the earliest Surahs revealed at Makkah the doctrine of the Hereafter has been impressed and stressed more than anything else. However, the arguments for it have been given in\r\nsuch a way that the doctrine of the Oneness of God (Tauhid) also is impressed on the minds automatically. This also contains brief arguments, here and there, to confirm the truth of the Holy Messenger of Allah and the Qur'an.",
        "\n",
        "After understanding well why the theme of the Hereafter has been so frequently repeated in the Surahs of this period, let us now have a look at the subject matter of this Surah. In it first of all, allusion has been made to the common talk and the doubts that were being expressed in every street of Makkah and in every assembly of the people of Makkah on hearing the news about Resurrection. Then, the deniers have been asked: \"Don't you see this earth which We have spread as a carpet for you? Don't you see the high mountains which we have so firmly placed in the earth?Don't you consider your own selves how We have created you as pairs of men and women?Don't you consider your sleep by which We make you seek a few hours rest after every few hours labour and toil so as to keep you fit for work in the world? Don't you see the alternation of the night and day which We are so regularly perpetuating precisely according to your needs and requirements?Don't you see the strongly fortified\r\nsystem of the heavens above you? Don't you see the sun by means of which you are receiving your light and heat? Don't you see the rains which fall from the clouds and help produce corns and vegetables and luxuriant gardens? Do these things only tell you that the power of the Almighty Being Who has created them, will be unable to bring about Resurrection and establish the Next World? Then, from the supreme wisdom which is clearly working in this world around you, do you only understand this that although each part of it and each function of it is purposive, yet life is meaningless? Nothing could be more absurd and meaningless that after appointing man to the office of foreman and granting him vast powers of appropriation, in this workhouse, when he leaves the world after fulfilling his role, he should be let off without any accountability. He should neither be rewarded and granted pension on satisfactory work, nor subjected to any accountability and punishment on unsatisfactory\r\nperformance of duty.",
        "\n",
        "After giving these arguments it has been emphatically stated that the Day of Judgment shall certainly come to pass on its appointed time. No sooner is the Trumpet sounded than whatever is being foretold shall appear before the eyes, and whether you believe in it today, or not, at that time you will come out in your multitudes from wherever you would be lying dead and buried to render your account. Your denial cannot in any way avert this inevitable event.",
        "\n",
        "Then, in vv. 21-30; it has been stated that every single misdeed of those who do not expect any accountability to take place and have thus belied Our Revelations, lies reckoned and recorded with Us, and Hell is ever lying an ambush to punish them and punish them fully for all their doings. Then, in vv. 31-36, the best rewards of those who lived as responsible people in the world and have provided for their Hereafter beforehand have been mentioned. They have been reassured that they will not only be rewarded richly for their services but in addition they will also be given sufficient gifts.",
        "\n",
        "In conclusion, the Divine Court in the Hereafter has been depicted, making it plain that there will be no question of somebody's being adamant in the matter of getting his followers and associates forgiven, none will speak without leave, and leave will be granted on the condition that intercession be made only for the one to whom leave of intercession will have been given, and the intercessor will say only what is right. Moreover, leave for intercession will be given only for those who had acknowledged the Truth in the world but were sinners; rebels of God and rejectors of the Truth will deserve no intercession at all.",
        "\n",
        "The discourse has been concluded with this warning: The Day the coming of which is being foretold, shall certainly come to pass. Do not think it is yet far off, it is close at hand. Now, whoever wills, let him believe in it and take the way towards his Lord. But he who disbelieves, in spite of the warning, \"will have all his deeds placed before him: and he will exclaim regretfully: \"Oh, would that I were not born in the world!\" At that time, his regrets will be about the same world of which he is so enamored today!",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that mentions The [Great] Tiding of the coming of the Day og Judgment, the truth of which people yet dispute. It takes its name from the expression “the great tiding” (al-nabaʾ al-ʿaẓīm). The disbelievers often asked incredulously about the Resurrection. This surah gives evidence of God’s power, then explains what will happen on the Day of Resurrection, and the respective fates of believers and disbelievers.The surah is also known as: The Announcement, The Great News, The Important News, The News.",
    "name_translation": "The Tiding",
    "name_complex": "An-Naba’",
    "surah_name_ar": "النبأ",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 78:1": "Për çka pyesin ata njëri-tjetrin? –",
                            "verse 78:2": "Për lajmin e madh,",
                            "verse 78:3": "për të cilin ata kanë mendime të ndryshme.",
                            "verse 78:4": "Jo, jo, ata, me siguri, do ta dinë!",
                            "verse 78:5": "E pastaj, sërish, me të vërtetë, do ta dinë!",
                            "verse 78:6": "A nuk u kemi bërë ne Tokën shtrat?",
                            "verse 78:7": "E malet shtyll?",
                            "verse 78:8": "Ne ju kemi krijuar dy lloje (mashkull e femër),",
                            "verse 78:9": "dhe gjumin tuaj ua kemi bërë çlodhje,",
                            "verse 78:10": "kure natën ua kemi bërë mbulesë,",
                            "verse 78:11": "dhe ditën e kemi caktuar për jetesë (ekonomizim),",
                            "verse 78:12": "dhe mbi ju kemi ndërtuar shtratë qiej të fortë.",
                            "verse 78:13": "Dhe kemi krijur kandil (diell) të shëndritshëm!",
                            "verse 78:14": "Ne, nga retë, u leshojmë ujëra të mëdha (shira)",
                            "verse 78:15": "për rritjen e drithërave dhe bimëve,",
                            "verse 78:16": "dhe kopshteve të dendura.,",
                            "verse 78:17": "Me të vërtetë, Dita e sqarimit, është caktuar,",
                            "verse 78:18": "Dita kur do të fryhet në buri (Sur), e do të vini ju, grupe-grupe,",
                            "verse 78:19": "dhe qielli do të hapet dhe do të bëhet dyer,",
                            "verse 78:20": "dhe malet lëvizin e bëhen si hije e ajrit (fatamorganë).",
                            "verse 78:21": "Me të vërtetë, Skëterra do të bëhet pusi,",
                            "verse 78:22": "për të këqinjtë vendbanim, -",
                            "verse 78:23": "që aty të mbeten përgjithmonë:",
                            "verse 78:24": "në të, nuk do të shijojnë as freskim, as pije,",
                            "verse 78:25": "përpos ujit të vluar dhe qelbësirave,",
                            "verse 78:26": "(si) shpërblim gjegjës (i veprave të tyre).",
                            "verse 78:27": "Ata, me të vërtetë, nuk kanë menduar në dhënie të llogarisë,",
                            "verse 78:28": "dhe argumentet Tona i kanë mohuar krejtësisht,",
                            "verse 78:29": "por Ne, çdo gjë e kemi numërura dhe shënuar.",
                            "verse 78:30": "“Andaj, shijoni, Ne do t’ju shtojmë vetëm dënimin”.",
                            "verse 78:31": "E, me të vërtetë, për ata që i kanë druajtur Perëndisë, u janë përgatitur vende kënaqësie:",
                            "verse 78:32": "kopshte dhe vreshta,",
                            "verse 78:33": "dhe vajza të reja, të njëjtës moshë,",
                            "verse 78:34": "dhe kupa të plota.",
                            "verse 78:35": "Nuk do të dëgjojnë atje (në xhennet) biseda të kota as gënjeshtra,",
                            "verse 78:36": "(ky është) shpërblimi i Zotit tënd, i dhënë sipas llogarisë (së veprave të tyre),",
                            "verse 78:37": "Zotit të qiejve dhe të Tokës, dhe çka gjendet në mes tyre, Mëshiruesi, të cilit askush nuk do të mund t’i bëzejë (flas),",
                            "verse 78:38": "në Ditën kur Xhebraili dhe engjëjt do të jenë të rreshtuar, e nuk do të flas askush, përpos atij që do t’i lejojë Mëshiruesi, e që do të thonë të vërtetën.",
                            "verse 78:39": "Ajo është Ditë e pashmangshme, e kush të dojë, do ta marr strehimin te Zoti i vet.",
                            "verse 78:40": "Me të vërtetë, Ne u kemi paralajmëruar se është i afërt dënimi, në Ditën kur njeriu do t’i shohë veprat e tija, dhe, kur jobesimtari, do të thotë: “Ah, të isha dhé!”"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "(Bu müşriklər) bir-birindən nə haqqında soruşurlar?",
                            "verse 78:2": "Böyük bir xəbər (qiyamət günü) haqqında!",
                            "verse 78:3": "Elə bir xəbər ki, onun barəsində ixtilafdadırlar.",
                            "verse 78:4": "Xeyr, onlar (qiyamətin haqq olduğunu) mütləq biləcəklər!",
                            "verse 78:5": "Bir də (deyirəm) xeyr, onlar (qiyamətin haqq olduğunu) mütləq biləcəklər!",
                            "verse 78:6": "Məgər Biz yeri döşək etmədikmi?!",
                            "verse 78:7": "Dağları da dirək?!",
                            "verse 78:8": "Biz sizləri (erkək və dişi olmaqla) cüt-cüt yaratdıq.",
                            "verse 78:9": "Yuxunuzu da istirahət etdik.",
                            "verse 78:10": "Biz gecəni (hər şeyi bürüyən) örtük etdik.",
                            "verse 78:11": "Gündüzü isə dolanışlıq (ruzi qazanmaq) vaxtı etdik.",
                            "verse 78:12": "Ustünüzdə yeddi (qat) möhkəm (göy) qurduq.",
                            "verse 78:13": "Sizin üçün çox parlaq bir çıxar (günəş) yaratdıq.",
                            "verse 78:14": "(Küləklərin sıxdığı) buludlardan şırıl-şırıl tökülən yağmur endirdik ki,",
                            "verse 78:15": "Onunla dən və bitki yetişdirək,",
                            "verse 78:16": "Eləcə də (ağacları bir-birinə) sarmaşan bağlar.",
                            "verse 78:17": "Həqiqətən, (haqla batili) ayırd etmə günü (əzəldən müəyyən edilmiş) bir vaxtdır!",
                            "verse 78:18": "Sur çalınacağı gün (qəbirlərinizdən çıxıb) dəstə-dəstə (məhşərə) gələcəksiniz.",
                            "verse 78:19": "(O gün) göy qapı-qapı (mələklərin yerə enməsi üçün göydə yarıqlar) açılacaqdır.",
                            "verse 78:20": "Dağlar yerindən qopardılıb (havada toz kimi uçaraq) ilğıma dönəcəkdir.",
                            "verse 78:21": "Həqiqətən, Cəhənnəm (mələklərin hazır durub kafirləri gözlədiyi) pusqudur!",
                            "verse 78:22": "O, azğınların məskənidir.",
                            "verse 78:23": "Onlar orada sonsuz müddət qalacaqlar.",
                            "verse 78:24": "Onlar orada nə bir sərinlik (görəcək), nə də içməyə bir şey tapacaqlar;",
                            "verse 78:25": "Qaynar sudan və irindən başqa!-",
                            "verse 78:26": "(Dünyadakı əmələrinə) uyğun cəza olaraq.",
                            "verse 78:27": "Cünki onlar haqq-hesab çəkiləcəyinə ümid bəsləmirdilər (qiyamət gününə inanmır, onun əzabından qorxmurdular).",
                            "verse 78:28": "Ayələrimizi də elə hey təkzib edirdilər.",
                            "verse 78:29": "Biz hər şeyi (bir-bir) sayıb (lövhi-məhfuzda) yazmışıq (və ya: əməl dəftərində yazıb təsbit etmişik).",
                            "verse 78:30": "İndi (ey kafirlər!) dadın əzabı. Biz sizə əzabdan başqa bir şey artırmayacağıq!",
                            "verse 78:31": "Həqiqətən, müttəqilərin nicat yeri (Cənnət),",
                            "verse 78:32": "Bağçalar və üzüm bağları,",
                            "verse 78:33": "Sinələri yenicə qabarmış (dolmuş, tumurcuqlanmış, gözəllikdə və məlahətdə bir-birinə bənzər) həmyaşıd qızlar.",
                            "verse 78:34": "(Cənnət şərabı ilə) dolu qədəhlər gözləyir!",
                            "verse 78:35": "Onlar orada (Cənnətdə) nə boş söz, nə də yalan eşidəcəklər.",
                            "verse 78:36": "(Bu, müttəqilərə) Rəbbindən olan mükafat, artıqlaması ilə verilən bəxşişdir -",
                            "verse 78:37": "Göylərin, yerin və onların arasındakıların Rəhman olan Rəbbindən (göndərilən bəxşişdir). Onlar (məxluqat) Onun hüzurunda heç bir söz deməyə qadir olmazlar!",
                            "verse 78:38": "Ruhun (Cəbrailin) və mələklərin səf-səf duracağı gün Rəhmanın izin verdiyi kimsələrdən başqa heç kəs danışmayacaq, danışan da doğrunu deyəcəkdir!",
                            "verse 78:39": "Bu, haqq olan gündür. Kim dilərsə, (iman gətirib ibadət və itaət etməklə) Rəbbinə tərəf qayıdan bir yol tutar!",
                            "verse 78:40": "Həqiqətən, Biz sizi yaxın bir əzabla (qiyamət gününün əzabı ilə) qorxutduq. O gün insan öz əlləri ilə etdiyi (yaxşı, pis) əməlləri görəcək, kafir isə: \"Kaş (bu əzabı görməmək üçün) torpaq olaydım!\" - deyəcəkdir."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "O čemu oni jedni druge pitaju?",
                            "verse 78:2": "O vijesti velikoj,",
                            "verse 78:3": "o kojoj oni različita mišljenja imaju.",
                            "verse 78:4": "To nije dobro, oni će saznati sigurno!",
                            "verse 78:5": "I još jednom, to nije dobro, oni će saznati sigurno!",
                            "verse 78:6": "Zar Zemlju posteljom nismo učinili,",
                            "verse 78:7": "i planine stupovima,",
                            "verse 78:8": "i vas kao parove stvorili,",
                            "verse 78:9": "i san vaš počinikom učinili,",
                            "verse 78:10": "i noć pokrivačem dali,",
                            "verse 78:11": "i dan za privređivanje odredili,",
                            "verse 78:12": "i iznad vas sedam silnih sazdali,",
                            "verse 78:13": "i svjetiljku plamteću postavili?",
                            "verse 78:14": "Mi iz oblaka vodu obilno spuštamo",
                            "verse 78:15": "i činimo da uz njenu pomoć raste žito i bilje,",
                            "verse 78:16": "i bašče guste.",
                            "verse 78:17": "Dan sudnji je, zaista, već određen,",
                            "verse 78:18": "Dan kada će se u Rog puhnuti, pa ćete vi, sve skupina po skupina, dolaziti,",
                            "verse 78:19": "i nebo će se otvoriti i mnogo kapija imati,",
                            "verse 78:20": "i planine će se zdrobiti i priviđenje će biti.",
                            "verse 78:21": "Džehennem će zasjeda postati,",
                            "verse 78:22": "nasilnicima mjesto povratka -",
                            "verse 78:23": "u kome će zauvijek ostati:",
                            "verse 78:24": "u njemu svježine neće osjetiti, ni pića okusiti,",
                            "verse 78:25": "osim vrele vode i kapljevine,",
                            "verse 78:26": "kazne prikladne.",
                            "verse 78:27": "Oni nisu očekivali da će račun polagati",
                            "verse 78:28": "i dokaze Naše su pretjerano poricali,",
                            "verse 78:29": "a Mi smo sve pobrojali i zapisali -",
                            "verse 78:30": "pa trpite, mučenje ćemo vam sve gorim učiniti.",
                            "verse 78:31": "A onima koji su se Allaha bojali želje će se ostvariti:",
                            "verse 78:32": "bašče i vinogradi,",
                            "verse 78:33": "i djevojke mlade, godina istih,",
                            "verse 78:34": "i pehari puni.",
                            "verse 78:35": "Tamo prazne besjede i neistinu neće slušati,",
                            "verse 78:36": "Gospodar tvoj će ih darom obilnim nagraditi,",
                            "verse 78:37": "Gospodar nebesa i Zemlje i onoga što je između njih, Milostivi, kome neće smjeti niko prvi riječ prozboriti",
                            "verse 78:38": "na Dan kada Džibril i meleki budu u redove poredani, kada će samo onaj kome Milostivi dozvoli govoriti, a istinu će reći.",
                            "verse 78:39": "To je neizbježan Dan, pa ko hoće, Gospodaru svome će, kao utočištu, poći.",
                            "verse 78:40": "Mi vas na skoru patnju upozoravamo, na Dan u kome će čovjek djela ruku svojih vidjeti, a nevjernik uzviknuti: \"Da sam, bogdo, zemlja ostao!\""
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "তারা পরস্পরে কি বিষয়ে জিজ্ঞাসাবাদ করছে?",
                            "verse 78:2": "মহা সংবাদ সম্পর্কে,",
                            "verse 78:3": "যে সম্পর্কে তারা মতানৈক্য করে।",
                            "verse 78:4": "না, সত্ত্বরই তারা জানতে পারবে,",
                            "verse 78:5": "অতঃপর না, সত্বর তারা জানতে পারবে।",
                            "verse 78:6": "আমি কি করিনি ভূমিকে বিছানা",
                            "verse 78:7": "এবং পর্বতমালাকে পেরেক?",
                            "verse 78:8": "আমি তোমাদেরকে জোড়া জোড়া সৃষ্টি করেছি,",
                            "verse 78:9": "তোমাদের নিদ্রাকে করেছি ক্লান্তি দূরকারী,",
                            "verse 78:10": "রাত্রিকে করেছি আবরণ।",
                            "verse 78:11": "দিনকে করেছি জীবিকা অর্জনের সময়,",
                            "verse 78:12": "নির্মান করেছি তোমাদের মাথার উপর মজবুত সপ্ত-আকাশ।",
                            "verse 78:13": "এবং একটি উজ্জ্বল প্রদীপ সৃষ্টি করেছি।",
                            "verse 78:14": "আমি জলধর মেঘমালা থেকে প্রচুর বৃষ্টিপাত করি,",
                            "verse 78:15": "যাতে তদ্দ্বারা উৎপন্ন করি শস্য, উদ্ভিদ।",
                            "verse 78:16": "ও পাতাঘন উদ্যান।",
                            "verse 78:17": "নিশ্চয় বিচার দিবস নির্ধারিত রয়েছে।",
                            "verse 78:18": "যেদিন শিংগায় ফুঁক দেয়া হবে, তখন তোমরা দলে দলে সমাগত হবে।",
                            "verse 78:19": "আকাশ বিদীর্ণ হয়ে; তাতে বহু দরজা সৃষ্টি হবে।",
                            "verse 78:20": "এবং পর্বতমালা চালিত হয়ে মরীচিকা হয়ে যাবে।",
                            "verse 78:21": "নিশ্চয় জাহান্নাম প্রতীক্ষায় থাকবে,",
                            "verse 78:22": "সীমালংঘনকারীদের আশ্রয়স্থলরূপে।",
                            "verse 78:23": "তারা তথায় শতাব্দীর পর শতাব্দী অবস্থান করবে।",
                            "verse 78:24": "তথায় তারা কোন শীতল এবং পানীয় আস্বাদন করবে না;",
                            "verse 78:25": "কিন্তু ফুটন্ত পানি ও পূঁজ পাবে।",
                            "verse 78:26": "পরিপূর্ণ প্রতিফল হিসেবে।",
                            "verse 78:27": "নিশ্চয় তারা হিসাব-নিকাশ আশা করত না।",
                            "verse 78:28": "এবং আমার আয়াতসমূহে পুরোপুরি মিথ্যারোপ করত।",
                            "verse 78:29": "আমি সবকিছুই লিপিবদ্ধ করে সংরক্ষিত করেছি।",
                            "verse 78:30": "অতএব, তোমরা আস্বাদন কর, আমি কেবল তোমাদের শাস্তিই বৃদ্ধি করব।",
                            "verse 78:31": "পরহেযগারদের জন্যে রয়েছে সাফল্য।",
                            "verse 78:32": "উদ্যান, আঙ্গুর,",
                            "verse 78:33": "সমবয়স্কা, পূর্ণযৌবনা তরুণী।",
                            "verse 78:34": "এবং পূর্ণ পানপাত্র।",
                            "verse 78:35": "তারা তথায় অসার ও মিথ্যা বাক্য শুনবে না।",
                            "verse 78:36": "এটা আপনার পালনকর্তার তরফ থেকে যথোচিত দান,",
                            "verse 78:37": "যিনি নভোমন্ডল, ভূমন্ডল ও এতদুভয়ের মধ্যবর্তী সবকিছুর পালনকর্তা, দয়াময়, কেউ তাঁর সাথে কথার অধিকারী হবে না।",
                            "verse 78:38": "যেদিন রূহ ও ফেরেশতাগণ সারিবদ্ধভাবে দাঁড়াবে। দয়াময় আল্লাহ যাকে অনুমতি দিবেন, সে ব্যতিত কেউ কথা বলতে পারবে না এবং সে সত্যকথা বলবে।",
                            "verse 78:39": "এই দিবস সত্য। অতঃপর যার ইচ্ছা, সে তার পালনকর্তার কাছে ঠিকানা তৈরী করুক।",
                            "verse 78:40": "আমি তোমাদেরকে আসন্ন শাস্তি সম্পর্কে সতর্ক করলাম, যেদিন মানুষ প্রত্যেক্ষ করবে যা সে সামনে প্রেরণ করেছে এবং কাফের বলবেঃ হায়, আফসোস-আমি যদি মাটি হয়ে যেতাম।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 78:1": "За какво се питат един друг?",
                            "verse 78:2": "За Великата вест,",
                            "verse 78:3": "за която са в разногласие.",
                            "verse 78:4": "Ала не! Те ще узнаят.",
                            "verse 78:5": "И пак - не! Те ще узнаят.",
                            "verse 78:6": "Не сторихме ли Ние земята постеля",
                            "verse 78:7": "и планините - подпори?",
                            "verse 78:8": "И ви сътворихме по двойки,",
                            "verse 78:9": "и сторихме съня ви покой,",
                            "verse 78:10": "и сторихме нощта покров,",
                            "verse 78:11": "и сторихме деня за препитание,",
                            "verse 78:12": "и съградихме над вас седем непоклатими небеса,",
                            "verse 78:13": "и сторихме [слънцето] горящ светилник,",
                            "verse 78:14": "и изсипваме от дъждовните облаци обилна вода,",
                            "verse 78:15": "за да извадим чрез нея зърна и растения,",
                            "verse 78:16": "и гъсти градини.",
                            "verse 78:17": "Денят на разделението е уречен -",
                            "verse 78:18": "Денят, когато се протръби с Рога и ще дойдете на тълпи,",
                            "verse 78:19": "и ще се разтвори небето, и ще стане на двери,",
                            "verse 78:20": "и планините ще бъдат раздвижени, и ще станат на мираж.",
                            "verse 78:21": "Адът е в очакване",
                            "verse 78:22": "за престъпващите - място за завръщане,",
                            "verse 78:23": "където ще останат столетия.",
                            "verse 78:24": "Не ще вкусят там нито прохлада, нито питие,",
                            "verse 78:25": "освен вряща вода и гной -",
                            "verse 78:26": "съответстващо въздаяние.",
                            "verse 78:27": "Не се надяваха те на равносметка.",
                            "verse 78:28": "И взимаха за пълна лъжа Нашите знамения.",
                            "verse 78:29": "Но всяко нещо вписахме в книга.",
                            "verse 78:30": "Затова вкусете! Не ще увеличим за вас друго освен мъчението.",
                            "verse 78:31": "За богобоязливите има убежище [-Рая] -",
                            "verse 78:32": "градини и лозя,",
                            "verse 78:33": "и с напъпили гърди - девствени връстнички,",
                            "verse 78:34": "и пълни чаши.",
                            "verse 78:35": "Не ще чуват там нито празнословие, нито лъжа -",
                            "verse 78:36": "въздаяние от твоя Господ - достатъчен дар,",
                            "verse 78:37": "Господа на небесата и на земята, и на всичко между тях, Всемилостивия. Не ще могат с Него да говорят",
                            "verse 78:38": "в Деня, в който Духът [Джибрил] и ангелите ще се възправят в редица. Не ще продумат, освен комуто Всемилостивият позволи, и той правдиво ще говори.",
                            "verse 78:39": "Този е Денят на истината. А който пожелае, да търси пристан при своя Господ.",
                            "verse 78:40": "Предупредихме ви за близко мъчение в Деня, в който всеки ще види какво е сторил преди с ръцете си. И неверникът ще каже: О, да можех да съм прах!"
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "他們互相詢問，詢問什麼？",
                            "verse 78:2": "詢問那重大的消息，",
                            "verse 78:3": "就是他們所爭論的消息。",
                            "verse 78:4": "絕不然！他們將來就知道了。",
                            "verse 78:5": "絕不然，他們將來就知道了。",
                            "verse 78:6": "難道我沒有使大地如搖籃，",
                            "verse 78:7": "使山巒如木梉嗎？",
                            "verse 78:8": "我曾把你們造成配偶，",
                            "verse 78:9": "我曾使你們從睡眠中得到休息，",
                            "verse 78:10": "我曾以黑夜為帷幕，",
                            "verse 78:11": "我以白晝供謀生，",
                            "verse 78:12": "我曾在你們上面建造了七層堅固的天，",
                            "verse 78:13": "我創造一盞明燈，",
                            "verse 78:14": "我從含水的雲裡，降下滂沱大雨，",
                            "verse 78:15": "以便我借它而生出百谷和草木，",
                            "verse 78:16": "以及茂密的園圃。",
                            "verse 78:17": "判決之日，確是指定的日期，",
                            "verse 78:18": "在那日，號角將被吹嚮，你們就成群而來；",
                            "verse 78:19": "天將被開辟，有許多門戶；",
                            "verse 78:20": "山巒將被移動，而變成幻影；",
                            "verse 78:21": "火獄確是伺候著，",
                            "verse 78:22": "它是悖逆者的歸宿；",
                            "verse 78:23": "他們將在其中逗留長久的時期。",
                            "verse 78:24": "他們在其中不能睡眠，不得飲料，",
                            "verse 78:25": "只飲沸水和膿汁。",
                            "verse 78:26": "那是一個很適當的報酬。",
                            "verse 78:27": "他們的確不怕清算，",
                            "verse 78:28": "他們曾否認我的跡象，",
                            "verse 78:29": "我曾將萬事記錄在一本天經裡。",
                            "verse 78:30": "（將對他們說：）「你們嘗試吧！我只增加你們所受的刑罰。」",
                            "verse 78:31": "敬畏的人們必有一種收獲，",
                            "verse 78:32": "許多園圃和葡萄，",
                            "verse 78:33": "和兩乳圓潤，年齡劃一的少女，",
                            "verse 78:34": "和滿杯的醴泉。",
                            "verse 78:35": "他們在那裡面聽不到惡言和謊話。",
                            "verse 78:36": "那是從你的主發出的報酬——充足的賞賜。",
                            "verse 78:37": "他是天地萬物的主，是至仁的主，他們不敢向他陳說。",
                            "verse 78:38": "在精神和眾天神排班肅立之日，他們不得說話，唯至仁主所特許而且能說正話的，才敢發言。",
                            "verse 78:39": "那是必有的日子，誰意欲，誰就擇取一個向他的主的歸宿。",
                            "verse 78:40": "我的確警告你們一種臨近的刑罰，在那日，各人將要看見自己所已做的工作，不信道的人們將要說：「啊！但願我原是塵土。」"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "Nač se vzájemně vyptávají?",
                            "verse 78:2": "Na zvěst nesmírnou,",
                            "verse 78:3": "o níž se mezi sebou přou.",
                            "verse 78:4": "Však pozor, záhy poznají,",
                            "verse 78:5": "a znovu: však pozor, záhy poznají!",
                            "verse 78:6": "Což zemi jsme jak lože nerozprostřeli",
                            "verse 78:7": "a hory jejími podpěrami neučinili?",
                            "verse 78:8": "A v párech jsme vás stvořili",
                            "verse 78:9": "a spánek váš učinili přestávkou",
                            "verse 78:10": "a noc pokrývkou",
                            "verse 78:11": "a den pro získání obživy jsme vám stanovili",
                            "verse 78:12": "a nad vámi sedm pevných postavili",
                            "verse 78:13": "a lampu oslňující tam umístili.",
                            "verse 78:14": "A z mračen déšť vytlačujících jsme vodu v hojnosti seslali vám,",
                            "verse 78:15": "abychom z ní dali vyrůst obilí a rostlinám",
                            "verse 78:16": "i hustě zarostlým zahradám.",
                            "verse 78:17": "Den rozhodnutí věru přijde v čase určeném;",
                            "verse 78:18": "v ten den na pozoun bude zatroubeno a v zástupech dostavíte se",
                            "verse 78:19": "a nebe se otevře a branami stane se",
                            "verse 78:20": "a hory se do pohybu dají a budou přeludem.",
                            "verse 78:21": "A peklo bude věru na číhané,",
                            "verse 78:22": "útulek pro vzpurné,",
                            "verse 78:23": "a v něm zůstanou věky celé",
                            "verse 78:24": "a chládku tam neokusí ani nápoje",
                            "verse 78:25": "kromě vody vroucí a hnijící,",
                            "verse 78:26": "což odměnou bude odpovídající.",
                            "verse 78:27": "Vždyť oni v zúčtování nedoufali",
                            "verse 78:28": "a za výmysl Naše znamení lživě prohlašovali,",
                            "verse 78:29": "však spočítali jsme věc každou a pořídili záznam.",
                            "verse 78:30": "Ochutnejte! Nic než trest dnes nepřidáme vám!",
                            "verse 78:31": "Pro bohabojné však je místo blažené,",
                            "verse 78:32": "zahrady a sady révy vinné,",
                            "verse 78:33": "dívky s plnými ňadry, věkem s nimi stejné,",
                            "verse 78:34": "a poháry po okraj naplněné.",
                            "verse 78:35": "Neuslyší tam plané tlachání ani žádné lhaní,",
                            "verse 78:36": "odměnou od Pána tvého dar to dobře rozpočtený!",
                            "verse 78:37": "Od Pána nebes a země a všeho, co mezi nimi je, Milosrdného, svolené k promluvě nedostanou",
                            "verse 78:38": "V den, kdy duch a andělé stát v řadě budou, nehovoříce - kromě těch, jimž Milosrdný to povolí a kteří jen pravdu pronesou.",
                            "verse 78:39": "Tento den skutečností je a kdo chce, nechť připraví si k Pánu svému cestu;",
                            "verse 78:40": "a věru varování jsme vám již dali o blízkém trestu v den, kdy člověk spatří, co rukama svýma předtím učinil, a kdy nevěřící zvolá: \"Ach, kéž bych jen prachem byl!\""
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "Waarover vragen zij?",
                            "verse 78:2": "Over de grote aankondiging,",
                            "verse 78:3": "Waaromtrent zij (van mening) verschillen?",
                            "verse 78:4": "Waarlijk, zij zullen het spoedig te weten komen.",
                            "verse 78:5": "Nogmaals zij zullen het weldra te weten komen.",
                            "verse 78:6": "Hebben Wij de aarde niet als een bed gespreid?",
                            "verse 78:7": "En de bergen als palen opgezet?",
                            "verse 78:8": "En hebben Wij u niet in paren geschapen?",
                            "verse 78:9": "En hebben Wij uw slaap niet tot rusten bestemd?",
                            "verse 78:10": "En hebben Wij de nacht niet als een mantel gemaakt.",
                            "verse 78:11": "En hebben Wij de dag niet voor (het zoeken) naar levensonderhoud gemaakt?",
                            "verse 78:12": "En hebben Wij niet zeven sterke (hemelen) boven u gebouwd;",
                            "verse 78:13": "En daarin een stralende lamp geplaatst?",
                            "verse 78:14": "En zenden Wij niet vanuit de wolken regen neder die voortstroomt.",
                            "verse 78:15": "Opdat Wij daardoor graan en plantengroei voortbrengen.",
                            "verse 78:16": "En weelderige tuinen?",
                            "verse 78:17": "Voorzeker, de Dag der beslissing is bepaald;",
                            "verse 78:18": "De Dag waarop de bazuin wordt geblazen; dan zult gij in scharen komen.",
                            "verse 78:19": "En de hemel wordt geopend en zal vele poorten hebben.",
                            "verse 78:20": "En de bergen verdwijnen en worden tot een luchtspiegeling.",
                            "verse 78:21": "Voorzeker de hel ligt in een hinderlaag.",
                            "verse 78:22": "Een tehuis voor de opstandigen.",
                            "verse 78:23": "Die daarin lange tijd zullen vertoeven.",
                            "verse 78:24": "Zij zullen daar geen koelte hebben en geen dronk smaken,",
                            "verse 78:25": "Behalve kokend water en een stinkende vloeistof die verschrikkelijk koud is.",
                            "verse 78:26": "Een passende vergelding (voor hun daden).",
                            "verse 78:27": "Zij verwachtten geen rekening.",
                            "verse 78:28": "En verwierpen Onze tekenen geheel.",
                            "verse 78:29": "En Wij hebben alles in een boek neergeschreven.",
                            "verse 78:30": "Smaakt dus de straf! Wij zullen u slechts hierin doen toenemen.",
                            "verse 78:31": "Voorwaar, er is triomf voor de rechtvaardigen,",
                            "verse 78:32": "Beschutte tuinen en wijnbergen.",
                            "verse 78:33": "En jeugdige gezellen, gelijk in leeftijd.",
                            "verse 78:34": "En een gevulde beker.",
                            "verse 78:35": "Zij horen daar geen ijdele gesprekken noch leugens!",
                            "verse 78:36": "Een beloning van uw Heer, een toereikende gave,",
                            "verse 78:37": "Van de Heer der hemelen en der aarde en van alles wat daar tussen is, de Barmhartige. Niemand zal Hem kunnen aanspreken.",
                            "verse 78:38": "De Dag waarop de Geest en de (andere) engelen in gelederen opgesteld staan, zullen zij niet spreken, met uitzondering van hem aan wie de Barmhartige het toestaat en die alleen zal spreken wat recht is.",
                            "verse 78:39": "Die Dag is de werkelijkheid. Daarom, laat hij die het wil een toevlucht bij zijn Heer zoeken.",
                            "verse 78:40": "Voorwaar, Wij hebben u voor een straf die nabij is gewaarschuwd; de Dag waarop de mens zal zien wat hij heeft uitgevoerd en (waarop) de ongelovige zal zeggen: \"O, ware ik maar stof geweest!\""
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 78:1": "Whereof do they question one another ?",
                            "verse 78:2": "(It is) of the awful tidings,",
                            "verse 78:3": "Concerning which they are in disagreement.",
                            "verse 78:4": "Nay, but they will come to know!",
                            "verse 78:5": "Nay, again, but they will come to know!",
                            "verse 78:6": "Have We not made the earth an expanse,",
                            "verse 78:7": "And the high hills bulwarks ?",
                            "verse 78:8": "And We have created you in pairs,",
                            "verse 78:9": "And have appointed your sleep for repose,",
                            "verse 78:10": "And have appointed the night as a cloak,",
                            "verse 78:11": "And have appointed the day for livelihood.",
                            "verse 78:12": "And We have built above you seven strong (heavens),",
                            "verse 78:13": "And have appointed a dazzling lamp,",
                            "verse 78:14": "And have sent down from the rainy clouds abundant water,",
                            "verse 78:15": "Thereby to produce grain and plant,",
                            "verse 78:16": "And gardens of thick foliage.",
                            "verse 78:17": "Lo! the Day of Decision is a fixed time,",
                            "verse 78:18": "A day when the trumpet is blown and ye come in multitudes,",
                            "verse 78:19": "And the heaven is opened and becometh as gates,",
                            "verse 78:20": "And the hills are set in motion and become as a mirage.",
                            "verse 78:21": "Lo! hell lurketh in ambush,",
                            "verse 78:22": "A home for the rebellious.",
                            "verse 78:23": "They will abide therein for ages.",
                            "verse 78:24": "Therein taste they neither coolness nor (any) drink",
                            "verse 78:25": "Save boiling water and a paralysing cold:",
                            "verse 78:26": "Reward proportioned (to their evil deeds).",
                            "verse 78:27": "For lo! they looked not for a reckoning;",
                            "verse 78:28": "They called Our revelations false with strong denial.",
                            "verse 78:29": "Everything have We recorded in a Book.",
                            "verse 78:30": "So taste (of that which ye have earned). No increase do We give you save of torment.",
                            "verse 78:31": "Lo! for the duteous is achievement -",
                            "verse 78:32": "Gardens enclosed and vineyards,",
                            "verse 78:33": "And maidens for companions,",
                            "verse 78:34": "And a full cup.",
                            "verse 78:35": "There hear they never vain discourse, nor lying -",
                            "verse 78:36": "Requital from thy Lord - a gift in payment -",
                            "verse 78:37": "Lord of the heavens and the earth, and (all) that is between them, the Beneficent; with Whom none can converse.",
                            "verse 78:38": "On the day when the angels and the Spirit stand arrayed, they speak not, saving him whom the Beneficent alloweth and who speaketh right.",
                            "verse 78:39": "That is the True Day. So whoso will should seek recourse unto his Lord.",
                            "verse 78:40": "Lo! We warn you of a doom at hand, a day whereon a man will look on that which his own hands have sent before, and the disbeliever will cry: \"Would that I were dust!\""
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 78:1": "Concerning what are they disputing?",
                            "verse 78:2": "Concerning the Great News,",
                            "verse 78:3": "About which they cannot agree.",
                            "verse 78:4": "Verily, they shall soon (come to) know!",
                            "verse 78:5": "Verily, verily they shall soon (come to) know!",
                            "verse 78:6": "Have We not made the earth as a wide expanse,",
                            "verse 78:7": "And the mountains as pegs?",
                            "verse 78:8": "And (have We not) created you in pairs,",
                            "verse 78:9": "And made your sleep for rest,",
                            "verse 78:10": "And made the night as a covering,",
                            "verse 78:11": "And made the day as a means of subsistence?",
                            "verse 78:12": "And (have We not) built over you the seven firmaments,",
                            "verse 78:13": "And placed (therein) a Light of Splendour?",
                            "verse 78:14": "And do We not send down from the clouds water in abundance,",
                            "verse 78:15": "That We may produce therewith corn and vegetables,",
                            "verse 78:16": "And gardens of luxurious growth?",
                            "verse 78:17": "Verily the Day of Sorting out is a thing appointed,",
                            "verse 78:18": "The Day that the Trumpet shall be sounded, and ye shall come forth in crowds;",
                            "verse 78:19": "And the heavens shall be opened as if there were doors,",
                            "verse 78:20": "And the mountains shall vanish, as if they were a mirage.",
                            "verse 78:21": "Truly Hell is as a place of ambush,",
                            "verse 78:22": "For the transgressors a place of destination:",
                            "verse 78:23": "They will dwell therein for ages.",
                            "verse 78:24": "Nothing cool shall they taste therein, nor any drink,",
                            "verse 78:25": "Save a boiling fluid and a fluid, dark, murky, intensely cold,",
                            "verse 78:26": "A fitting recompense (for them).",
                            "verse 78:27": "For that they used not to fear any account (for their deeds),",
                            "verse 78:28": "But they (impudently) treated Our Signs as false.",
                            "verse 78:29": "And all things have We preserved on record.",
                            "verse 78:30": "\"So taste ye (the fruits of your deeds); for no increase shall We grant you, except in Punishment.\"",
                            "verse 78:31": "Verily for the Righteous there will be a fulfilment of (the heart’s) desires;",
                            "verse 78:32": "Gardens enclosed, and grapevines;",
                            "verse 78:33": "Companions of equal age;",
                            "verse 78:34": "And a cup full (to the brim).",
                            "verse 78:35": "No vanity shall they hear therein, nor Untruth:-",
                            "verse 78:36": "Recompense from thy Lord, a gift, (amply) sufficient,",
                            "verse 78:37": "(From) the Lord of the heavens and the earth, and all between, (God) Most Gracious: None shall have power to argue with Him.",
                            "verse 78:38": "The Day that the Spirit and the angels will stand forth in ranks, none shall speak except any who is permitted by (God) Most Gracious, and He will say what is right.",
                            "verse 78:39": "That Day will be the sure Reality: Therefore, whoso will, let him take a (straight) return to his Lord!",
                            "verse 78:40": "Verily, We have warned you of a Penalty near, the Day when man will see (the deeds) which his hands have sent forth, and the Unbeliever will say, \"Woe unto me! Would that I were (metre) dust!\""
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 78:1": "Of what do they question one another?",
                            "verse 78:2": "Of the mighty tiding",
                            "verse 78:3": "whereon they are at variance.",
                            "verse 78:4": "No indeed; they shall soon know!",
                            "verse 78:5": "Again, no indeed; they shall soon know!",
                            "verse 78:6": "Have We not made the earth as a cradle",
                            "verse 78:7": "and the mountains as pegs?",
                            "verse 78:8": "And We created you in pairs,",
                            "verse 78:9": "and We appointed your sleep for a rest;",
                            "verse 78:10": "and We appointed night for a garment,",
                            "verse 78:11": "and We appointed day for a livelihood.",
                            "verse 78:12": "And We have built above you seven strong ones,",
                            "verse 78:13": "and We appointed a blazing lamp",
                            "verse 78:14": "and have sent down out of the rainclouds water cascading",
                            "verse 78:15": "that We may bring forth thereby grain and plants,",
                            "verse 78:16": "and gardens luxuriant.",
                            "verse 78:17": "Surely the Day of Decision is an appointed time,",
                            "verse 78:18": "the day the Trumpet is blown, and you shall come in troops,",
                            "verse 78:19": "and heaven is opened, and become gates,",
                            "verse 78:20": "and the mountains are set in motion, and become a vapour.",
                            "verse 78:21": "Behold, Gehenna has become an ambush,",
                            "verse 78:22": "for the insolent a resort,",
                            "verse 78:23": "therein to tarry for ages,",
                            "verse 78:24": "tasting therein neither coolness nor any drink",
                            "verse 78:25": "save boiling water and pus",
                            "verse 78:26": "for a suitable recompense.",
                            "verse 78:27": "They indeed hoped not for a reckoning,",
                            "verse 78:28": "and they cried loud lies to Our signs;",
                            "verse 78:29": "and everything We have numbered in a Book.",
                            "verse 78:30": "’Taste! We shall increase you not save in chastisement.’",
                            "verse 78:31": "Surely for the godfearing awaits a place of security,",
                            "verse 78:32": "gardens and vineyards",
                            "verse 78:33": "and maidens with swelling breasts, like of age,",
                            "verse 78:34": "and a cup overflowing.",
                            "verse 78:35": "Therein they shall hear no idle talk, no cry of lies,",
                            "verse 78:36": "for a recompense from thy Lord, a gift, a reckoning,",
                            "verse 78:37": "Lord of the heavens and earth, and all that between them is, the All-merciful of whom they have no power to speak.",
                            "verse 78:38": "Upon the day when the Spirit and the angels stand in ranks they shall speak not, save him to whom the All-merciful has given leave, and who speaks aright.",
                            "verse 78:39": "That is the true day; so whosoever wills takes unto his Lord a resort.",
                            "verse 78:40": "Lo, We have warned you of a nigh chastisement, upon the day when a man shall behold what his hands have forwarded, and the unbeliever shall say, ’O would that I were dust!’"
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 78:1": "ABOUT WHAT do they [most often] ask one another?",
                            "verse 78:2": "About the awesome tiding [of resurrection],",
                            "verse 78:3": "on which they [so utterly] disagree.",
                            "verse 78:4": "Nay, but in time they will come to understand !",
                            "verse 78:5": "And once again: Nay, but in time they will come to understand!",
                            "verse 78:6": "HAVE WE NOT made the earth a resting-place [for you],",
                            "verse 78:7": "and the mountains [its] pegs?",
                            "verse 78:8": "And We have created you in pairs;",
                            "verse 78:9": "and We have made your sleep [a symbol of] death",
                            "verse 78:10": "and made the night [its] cloak",
                            "verse 78:11": "and made the day [a symbol of] life.",
                            "verse 78:12": "And We have built above you seven firmaments,",
                            "verse 78:13": "and have placed [therein the sun,] a lamp full of blazing splendour.",
                            "verse 78:14": "And from the wind-driven clouds We send down waters pouring in abundance,",
                            "verse 78:15": "so that We might bring forth thereby grain, and herbs,",
                            "verse 78:16": "and gardens dense with foliage.",
                            "verse 78:17": "VERILY, the Day of Distinction [between the true and the false] has indeed its appointed time:",
                            "verse 78:18": "the Day when the trumpet [of resurrection] is sounded and you all come forward in multitudes;",
                            "verse 78:19": "and when the skies are opened and become [as wide-flung] gates;",
                            "verse 78:20": "and when the mountains are made to vanish as if they had been a mirage.",
                            "verse 78:21": "[On that Day,] verily, hell will lie in wait [for those who deny the truth] –",
                            "verse 78:22": "a goal for all who are wont to transgress the bounds of what is right!",
                            "verse 78:23": "In it shall they remain for a long time.",
                            "verse 78:24": "Neither coolness shall they taste therein nor any [thirst-quenching] drink –",
                            "verse 78:25": "only burning despair and ice-cold darkness:",
                            "verse 78:26": "a meet requital [for their sins]!",
                            "verse 78:27": "Behold, they were not expecting to be called to account,",
                            "verse 78:28": "having given the lie to Our messages one and all:",
                            "verse 78:29": "but We have placed on record every single thing [of what they did].",
                            "verse 78:30": "[And so We shall say:] \"Taste, then, [the fruit of your evil doings,] for now We shall bestow on you nothing but more and more suffering!\"",
                            "verse 78:31": "[But,] verily, for the God-conscious there is supreme fulfilment in store:",
                            "verse 78:32": "luxuriant gardens and vineyards,",
                            "verse 78:33": "and splendid companions well-matched,",
                            "verse 78:34": "and a cup [of happiness] overflowing.",
                            "verse 78:35": "No empty talk will they hear in that [paradise], nor any lie.",
                            "verse 78:36": "[All this will be] a reward from thy Sustainer, a gift in accordance with [His Own] reckoning –",
                            "verse 78:37": "[a reward from] the Sustainer of the heavens and the earth and all that is between them, the Most Gracious! [And] none shall have it in their power to raise their voices unto Him",
                            "verse 78:38": "on the Day when all [human] souls and all the angels will stand up in ranks: none will speak but he to whom the Most Gracious will have given leave; and [everyone] will say [only] what is right.",
                            "verse 78:39": "That will be the Day of Ultimate Truth: whoever wills, then, let him take the path that leads towards his Sustainer!",
                            "verse 78:40": "Verily, We have warned you of suffering near at hand – [suffering] on the Day when man shall [clearly] see what his hands have sent ahead, and when he who has denied the truth shall say, \"Oh, would that I were mere dust...!\""
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 78:1": "About what are they asking each other?",
                            "verse 78:2": "About the Great Event",
                            "verse 78:3": "in which they dispute!",
                            "verse 78:4": "Indeed they will soon know.",
                            "verse 78:5": "Again, indeed they will soon know.",
                            "verse 78:6": "Did We not make the earth a floor,",
                            "verse 78:7": "and the mountains bulwarks?",
                            "verse 78:8": "And We have created you in pairs,",
                            "verse 78:9": "and made your sleep a source of rest,",
                            "verse 78:10": "and made the night a covering,",
                            "verse 78:11": "and made the day a source of livelihood.",
                            "verse 78:12": "And We have built seven strong (skies),",
                            "verse 78:13": "and created a luminous lamp (the sun).",
                            "verse 78:14": "And We have sent down abundant water from the rain-laden clouds,",
                            "verse 78:15": "so that We bring out therewith grain and vegetation,",
                            "verse 78:16": "and thick gardens.",
                            "verse 78:17": "Surely the Day of Decision is an appointed time,",
                            "verse 78:18": "a day when the trumpet will be blown, so you will come in multitudes,",
                            "verse 78:19": "and the sky will be opened, so it will become as gates,",
                            "verse 78:20": "and the mountains will be set in motion, so they will be as mirage.",
                            "verse 78:21": "Surely Jahannam (the Hell) lurks in ambush.",
                            "verse 78:22": "(It is) abode for the rebellious people",
                            "verse 78:23": "who will be abiding in it for ages.",
                            "verse 78:24": "They will taste nothing cool in it, nor a drink,",
                            "verse 78:25": "except boiling water and pus,",
                            "verse 78:26": "this being a punishment, fully commensurate (with their deeds).",
                            "verse 78:27": "They did not expect (to face) accounting (of their deeds),",
                            "verse 78:28": "and they rejected Our signs totally.",
                            "verse 78:29": "And everything (from their deeds) is thoroughly recorded by Us in writing.",
                            "verse 78:30": "“So now taste! We will add nothing to you but torment.”",
                            "verse 78:31": "Of course, the God-fearing will have great achievement,",
                            "verse 78:32": "-gardens and grapes,",
                            "verse 78:33": "and buxom maidens of matching age,",
                            "verse 78:34": "and goblets filled up to the brim.",
                            "verse 78:35": "They will not hear any vain talk therein, nor lies,",
                            "verse 78:36": "this being a reward from their Lord, a well calculated grant,",
                            "verse 78:37": "(from) the Lord of the heavens and the earth and what is between them, the All-Merciful. No one will have power to address Him,",
                            "verse 78:38": "on the Day when the Spirit and the angels will stand in rows. They will not speak, except the one who is permitted by the RaHmān (the All-Merciful Allah) and speaks aright.",
                            "verse 78:39": "That is the Day that is sure to come. So whoever so wishes may take refuge with his Lord.",
                            "verse 78:40": "We have warned you of an approaching torment (that will be inflicted) on a day when one will see what his hands have sent ahead, and the disbeliever will say, “O would that I had turned into dust.”"
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 78:1": "About what are they questioning one another?",
                            "verse 78:2": "About the awesome tiding,",
                            "verse 78:3": "concerning which they are at variance.",
                            "verse 78:4": "No indeed! they will come to know.",
                            "verse 78:5": "Again, no indeed! They will come to know!",
                            "verse 78:6": "Have We not made the earth a cradle,",
                            "verse 78:7": "and the mountains pegs?",
                            "verse 78:8": "And created you in pairs?",
                            "verse 78:9": "and made your sleep for rest?",
                            "verse 78:10": "and made the night a cloak?",
                            "verse 78:11": "and made the day for livelihood?",
                            "verse 78:12": "and built above you seven mighty ones?",
                            "verse 78:13": "and set a radiant lamp?",
                            "verse 78:14": "and sent down from the rain-clouds cascading water?",
                            "verse 78:15": "that with it We may bring forth grains and plants,",
                            "verse 78:16": "and gardens of intertwining foliage?",
                            "verse 78:17": "Verily the Day of Decision is the tryst,",
                            "verse 78:18": "the day the Trumpet is blown and you come in droves,",
                            "verse 78:19": "and the heaven is opened and becomes as gates,",
                            "verse 78:20": "and the mountains are set in motion, and become as a mirage.",
                            "verse 78:21": "Verily Hell lurks in ambush",
                            "verse 78:22": "for the rebellious [it is] a resort,",
                            "verse 78:23": "to remain therein for ages,",
                            "verse 78:24": "tasting in it neither coolness, nor drink,",
                            "verse 78:25": "except boiling water and pus,",
                            "verse 78:26": "as a fitting requital.",
                            "verse 78:27": "Indeed they never feared any reckoning,",
                            "verse 78:28": "and they denied Our signs mendaciously,",
                            "verse 78:29": "and everything have We kept count of in a Book.",
                            "verse 78:30": "‘So [now] taste! For We will increase you in nothing but chastisement’.",
                            "verse 78:31": "Truly for the God-fearing there will be a triumph:",
                            "verse 78:32": "gardens and vineyards,",
                            "verse 78:33": "and buxom maidens of equal age,",
                            "verse 78:34": "and a brimming cup.",
                            "verse 78:35": "They will not hear in it any vain talk or lies —",
                            "verse 78:36": "[this will be] a reward from your Lord, a gift that is sufficing",
                            "verse 78:37": "[from] the Lord of the heavens and the earth and all that is between them, the Compassionate One Whom they will not be able to address",
                            "verse 78:38": "on the day when the Spirit and the angels stand arrayed. They will not speak, except him whom the Compassionate One permits, and who says what is right.",
                            "verse 78:39": "That is the True Day. So whoever wishes [to], let him seek resort with his Lord.",
                            "verse 78:40": "Lo! We have warned you of a chastisement that is near, the day when a person will behold what his hands have sent ahead and the disbeliever will say, ‘O would that I were dust!’"
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 78:1": "What is (it) they are questioning about one another?",
                            "verse 78:2": "(Are they asking) of the Great News,",
                            "verse 78:3": "About which they differ?",
                            "verse 78:4": "(That News is) not at all (deniable). They will soon know (that reality).",
                            "verse 78:5": "(We) once more (assert: Dissent and denial are) in no way (right). They will come to know soon.",
                            "verse 78:6": "Have We not made the earth a place to stay for (life) and to earn living and deeds?",
                            "verse 78:7": "And (have We not) erected mountains raised (out of it)?",
                            "verse 78:8": "And (ponder:) We (have) created you in pairs (for reproduction).",
                            "verse 78:9": "And We (have) made your sleep (a means of bodily) rest,",
                            "verse 78:10": "And We (have) made the night a covering (by virtue of its darkness).",
                            "verse 78:11": "And We (have) made the day (a time) for (earning) livelihood.",
                            "verse 78:12": "And (now study the spatial universe as well). We built above you seven strong (firmaments).",
                            "verse 78:13": "And We made (the sun a massive) fountainhead of light and heat.",
                            "verse 78:14": "And We poured water in torrents from rain-laden clouds,",
                            "verse 78:15": "So that by means of this (downpour), We bring forth (from the earth) grain and vegetation,",
                            "verse 78:16": "And (grow) thick gardens.",
                            "verse 78:17": "(Observing these signs of Our Might, know that) the Day of Judgment (i.e., Resurrection too) is certainly a fixed time.",
                            "verse 78:18": "The Day when the Trumpet will be blown, you will flock (in the holy presence of Allah) in droves.",
                            "verse 78:19": "And the (layers of) heaven will be torn, and (owing to the rip) they will become (as if) all doors.",
                            "verse 78:20": "And the mountains (after being reduced to dust) will be blown off (into the atmosphere); so they will be (eliminated like) a mirage.",
                            "verse 78:21": "Surely, Hell is a place of ambush.",
                            "verse 78:22": "(That) is the abode of rebels.",
                            "verse 78:23": "They will abide there for recurrent, infinite periods.",
                            "verse 78:24": "They will taste in it neither coolness (of any sort) nor any drink,",
                            "verse 78:25": "Except boiling water and suppurated fluid oozing (from the wounds of the inmates of Hell),",
                            "verse 78:26": "A compensation commensurate with (their revolt),",
                            "verse 78:27": "For they had no fear of Reckoning (on the Last Day) in the least.",
                            "verse 78:28": "And they used to utterly deny Our signs.",
                            "verse 78:29": "And We have preserved everything (major or minor) in writing.",
                            "verse 78:30": "(O disbelievers, you excelled in rebellion and disbelief in the world.) Now taste the outcome (of your actions). We shall keep increasing but the torment upon you.",
                            "verse 78:31": "Surely, the Godfearing will triumph.",
                            "verse 78:32": "(For them) there will be gardens and grapes,",
                            "verse 78:33": "And well-matched young maidens,",
                            "verse 78:34": "And overflowing cups (of holy beverage).",
                            "verse 78:35": "There, these (people) will neither hear any foolish talk nor belie (one another).",
                            "verse 78:36": "From your Lord this is the reward which is an (amply) sufficient bestowal (in proportion to your works).",
                            "verse 78:37": "He is the Lord of (all) the heavens and the earth and whatever is between them, the Most Kind. (But on the Last Day, the effect and impact of His mighty power and most high authority will be such that) none (from His creation) will dare converse with Him.",
                            "verse 78:38": "That Day Gabriel (the Spirit of peace and security) and (all) angels will stand in ranks, none able to speak except he whom the Most Kind (Lord) would already have awarded sanction (to intercede) and who also said the right thing (in keeping with the teachings of Islam, during his life of the world).",
                            "verse 78:39": "This is the Day of truth. So, whoever longs may obtain an abode (of mercy and nearness) in the presence of his Lord.",
                            "verse 78:40": "We have, indeed, warned you of the impending torment. On that Day, everyone will see whatever (acts) he has sent ahead and (every) disbeliever will say: ‘Would that I were dust (and escaped this punishment)!’"
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "Mitä he kyselevät toinen toiseltaan?",
                            "verse 78:2": "Suurta sanomaako,",
                            "verse 78:3": "josta he ovat eri mieltä?",
                            "verse 78:4": "Ei, pian he saavat sen tietää.",
                            "verse 78:5": "Vieläkin: ei! He tulevat sen pian kokemaan.",
                            "verse 78:6": "Emmekö ole luonut maan lakeudeksi",
                            "verse 78:7": "ja vuoret tukipilareiksi?",
                            "verse 78:8": "Me olemme luonut teidät parittain",
                            "verse 78:9": "ja säätänyt unen teille virkistykseksi,",
                            "verse 78:10": "yön Me loimme teille verhoksi",
                            "verse 78:11": "ja päivän Me annoimme elatuksen hankkimiseen.",
                            "verse 78:12": "Yläpuolellenne olemme asettanut seitsemän vahvaa henkivaltaa",
                            "verse 78:13": "ja laittanut valoa säteilevän lampun;",
                            "verse 78:14": "raskaista pilvistä Me lähetämme vuolaita virtoja",
                            "verse 78:15": "kasvattaaksemme viljan ja kasvit",
                            "verse 78:16": "sekä tiheinä vihannoivat puutarhat.",
                            "verse 78:17": "Totisesti tuomion päivä on määrätty,",
                            "verse 78:18": "päivä, jona puhalletaan pasuunaan ja te nousette joukoittain,",
                            "verse 78:19": "päivä, jolloin taivas aukeaa ja siihen ilmenee joukko portteja,",
                            "verse 78:20": "jolloin vuoret siirtyvät paikoiltaan ja muuttuvat kuin varjoiksi.",
                            "verse 78:21": "Totisesti, helvetti silloin omaansa odottaa,",
                            "verse 78:22": "se on määränpää syntisiä varten,",
                            "verse 78:23": "he viruvat siellä vuosikausia,",
                            "verse 78:24": "saamatta nauttia viileätä juomaa;",
                            "verse 78:25": "heidän juomansa on kiehuvaa tai jääkylmää,",
                            "verse 78:26": "se on palkka, joka vastaa heidän syntejänsä.",
                            "verse 78:27": "He eivät totisesti uskoneet joutuvansa teoistaan tilille,",
                            "verse 78:28": "vaan sanoivat julistustamme valheeksi, totuutta vääristellen.",
                            "verse 78:29": "Mutta meillä on kaikki merkittynä muistiin.",
                            "verse 78:30": "»Maistakaa siis! Me emme lisää teille muuta kuin kuritusta.»",
                            "verse 78:31": "Totisesti odottaa voitto niitä, jotka pelkäävät Jumalaa,",
                            "verse 78:32": "heidän ovat hedelmä- ja viinitarhat,",
                            "verse 78:33": "nuoruutta uhkuvat neidot, heidän ikäisensä,",
                            "verse 78:34": "ja puhdasta viiniä täydet pikarit.",
                            "verse 78:35": "Ei heille siellä turhuutta puhuta eikä valheita jutella.",
                            "verse 78:36": "Se on Herrasi antama palkka, ansioiden mukainen lahja,",
                            "verse 78:37": "Herran, jonka ovat taivaat ja maa ja kaikki niiden välisessä avaruudessa, laupiaan Armahtajan, jota he eivät rohkene puhutella.",
                            "verse 78:38": "Sinä päivänä, jolloin henki ja enkelit seisovat riveissä, eivät muut saa puhua kuin se, jonka Laupias sallii ja joka lausuu totuuden.",
                            "verse 78:39": "Tuo päivä on totuuden päivä, ja se, joka parhaimman valitsee, turvautuu Herraan.",
                            "verse 78:40": "Totisesti olemme varoittanut teitä lähestyvästä kurituksesta, päivästä, jolloin ihminen saa nähdä, mikä on hänen kättensä työ, ja epäuskoinen huudahtaa: »Ah, jospa olisin maan tomua!»"
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 78:1": "Sur quoi s'interrogent-ils mutuellement ?",
                            "verse 78:2": "Sur l'Annonce solennelle",
                            "verse 78:3": "au sujet de laquelle ils sont en désaccord.",
                            "verse 78:4": "Et pourtant, bientôt ils sauront !",
                            "verse 78:5": "De vrai, bientôt ils sauront !",
                            "verse 78:6": "N'avons-nous pas disposé la terre comme une couche",
                            "verse 78:7": "et les montagnes comme des piquets ?",
                            "verse 78:8": "Nous vous avons créés par couples,",
                            "verse 78:9": "Nous avons fait de votre sommeil un temps de repos,",
                            "verse 78:10": "Nous avons fait de la nuit une couverture,",
                            "verse 78:11": "Nous avons fait du jour le moment de la vie,",
                            "verse 78:12": "Nous avons construit au-dessus de vous sept [cieux] solides,",
                            "verse 78:13": "et Nous avons placé un luminaire éblouissant.",
                            "verse 78:14": "Nous avons fait descendre des nuées une eau abondante,",
                            "verse 78:15": "pour en faire sortir des céréales, des plantes",
                            "verse 78:16": "et des jardins luxuriants.",
                            "verse 78:17": "Certes, le Jour de la Décision arrivera au terme fixé.",
                            "verse 78:18": "Ce Jour-là, on soufflera dans la trompette et vous viendrez en foule.",
                            "verse 78:19": "Le ciel sera ouvert et nombreuses seront les portes ;",
                            "verse 78:20": "les montagnes seront mises en mouvement et deviendront un mirage.",
                            "verse 78:21": "Certes, la Géhenne se tient aux aguets,",
                            "verse 78:22": "comme le lieu de retour pour les rebelles.",
                            "verse 78:23": "Ils y demeureront des âges,",
                            "verse 78:24": "sans y goûter ni fraîcheur, ni boisson,",
                            "verse 78:25": "juste une eau bouillante et un liquide fétide.",
                            "verse 78:26": "Ce sera une rétribution équitable.",
                            "verse 78:27": "Ils ne pensaient pas devoir rendre des comptes,",
                            "verse 78:28": "et persistaient à traiter Nos signes de menterie.",
                            "verse 78:29": "Or, Nous avons consigné toute chose dans un livre.",
                            "verse 78:30": "Goûtez donc car, pour vous, Nous n'augmenterons rien d'autre que le tourment.",
                            "verse 78:31": "Certes, pour ceux qui craignent Dieu, ce sera une béatitude :",
                            "verse 78:32": "des vergers et des vignes,",
                            "verse 78:33": "des jouvencelles d'une égale jeunesse,",
                            "verse 78:34": "des coupes débordantes.",
                            "verse 78:35": "Ils n'entendront là ni paroles futiles, ni menteries :",
                            "verse 78:36": "c'est une récompense de ton Seigneur, un don bien décompté",
                            "verse 78:37": "de la part du Seigneur des cieux et de la terre, et de ce qui est entre les deux, du Miséricordieux avec Lequel ils ne pourront engager de discussion.",
                            "verse 78:38": "Le Jour venu, l'Esprit et les anges se tiendront debout sur un rang. Ils ne parleront pas, sauf ceux à qui le Miséricordieux l'aura permis et qui diront des paroles justes.",
                            "verse 78:39": "Ce sera le Jour de Vérité. Que quiconque le désire prenne le chemin du retour vers son Seigneur.",
                            "verse 78:40": "Certes, Nous vous avons avertis d'un châtiment prochain, pour le Jour où l'homme considérera ce que ses mains lui auront acquis et où le mécréant s'écriera : \" Malheur à moi ! Que ne suis-je poussière ! \""
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 78:1": "Sur quoi s’interrogent-ils mutuellement ?",
                            "verse 78:2": "Sur la grande nouvelle,",
                            "verse 78:3": "à propos de laquelle ils divergent.",
                            "verse 78:4": "Eh bien non ! Ils sauront bientôt.",
                            "verse 78:5": "Encore une fois, non ! Ils sauront bientôt.",
                            "verse 78:6": "N’avons-Nous pas fait de la terre une couche ?",
                            "verse 78:7": "et (placé) les montagnes comme des piquets ?",
                            "verse 78:8": "Nous vous avons créés en couples,",
                            "verse 78:9": "et désigné votre sommeil pour votre repos,",
                            "verse 78:10": "et fait de la nuit un vêtement,",
                            "verse 78:11": "et assigné le jour pour les affaires de la vie,",
                            "verse 78:12": "et construit au-dessus de vous sept (cieux) renforcés,",
                            "verse 78:13": "et [y] avons placé une lampe (le soleil) très ardente,",
                            "verse 78:14": "et fait descendre des nuées une eau abondante",
                            "verse 78:15": "pour faire pousser par elle grains et plantes",
                            "verse 78:16": "et jardins luxuriants.",
                            "verse 78:17": "Le Jour de la Décision [du Jugement] a son terme fixé.",
                            "verse 78:18": "Le jour où l’on soufflera dans la Trompe, vous viendrez par troupes,",
                            "verse 78:19": "et le ciel sera ouvert et [présentera] des portes,",
                            "verse 78:20": "et les montagnes seront mises en marche et deviendront un mirage.",
                            "verse 78:21": "L’Enfer demeure aux aguets,",
                            "verse 78:22": "refuge pour les transgresseurs.",
                            "verse 78:23": "Ils y demeureront pendant des siècles successifs.",
                            "verse 78:24": "Ils n’y goûteront ni fraîcheur ni breuvage,",
                            "verse 78:25": "Hormis une eau bouillante et un pus",
                            "verse 78:26": "comme rétribution équitable.",
                            "verse 78:27": "Car ils ne s’attendaient pas à rendre compte,",
                            "verse 78:28": "et traitaient de mensonges, continuellement, Nos versets,",
                            "verse 78:29": "alors que Nous avons dénombré toutes choses en écrit.",
                            "verse 78:30": "Goûtez donc. Nous n’augmenterons pour vous que le châtiment !",
                            "verse 78:31": "Pour les pieux ce sera une réussite :",
                            "verse 78:32": "jardins et vignes,",
                            "verse 78:33": "et des (belle) aux seins arrondis, d’une égale jeunesse,",
                            "verse 78:34": "et coupes débordantes.",
                            "verse 78:35": "Ils n’y entendront ni futilités ni mensonges.",
                            "verse 78:36": "A titre de récompense de ton Seigneur et à titre de don abondant",
                            "verse 78:37": "du Seigneur des cieux et de la terre et de ce qui existe entre eux, le Tout Miséricordieux; ils n’osent nullement Lui adresser la parole.",
                            "verse 78:38": "Le jour où l’Esprit et les Anges se dresseront en rangs, nul ne saura parler, sauf celui à qui le Tout Miséricordieux aura accordé la permission, et qui dira la vérité.",
                            "verse 78:39": "Ce jour-là est inéluctable. Que celui qui veut prenne donc refuge auprès de son Seigneur.",
                            "verse 78:40": "Nous vous avons avertis d’un châtiment bien proche, le jour où l’homme verra ce que ses deux mains ont préparé; et l’infidèle dira : «Hélas pour moi ! Comme j’aurais aimé n’être que poussière»."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "Wonach befragen sie einander?",
                            "verse 78:2": "Nach dem großen Ereignis,",
                            "verse 78:3": "Über das sie uneinig sind.",
                            "verse 78:4": "Nein! sie werden es bald erfahren.",
                            "verse 78:5": "Und abermals nein! sie werden es bald erfahren.",
                            "verse 78:6": "Haben Wir nicht die Erde zu einem Bette gemacht,",
                            "verse 78:7": "Und die Berge zu Pflöcken?",
                            "verse 78:8": "Und Wir haben euch in Paaren erschaffen,",
                            "verse 78:9": "Und Wir haben euch den Schlaf zur Ruhe gemacht",
                            "verse 78:10": "Und die Nacht zu einer Hülle",
                            "verse 78:11": "Und den Tag zum Erwerb des Unterhalts.",
                            "verse 78:12": "Und Wir haben über euch sieben starke (Himmel) erbaut;",
                            "verse 78:13": "Und Wir haben eine hellbrennende Lampe gemacht.",
                            "verse 78:14": "Und Wir senden aus den Regenwolken Wasser in Strömen hernieder,",
                            "verse 78:15": "Auf daß Wir damit Korn und Kraut hervorbringen mögen",
                            "verse 78:16": "Und üppige Gärten.",
                            "verse 78:17": "Fürwahr, der Tag der Entscheidung ist festgesetzt;",
                            "verse 78:18": "Der Tag, da in die Posaune gestoßen wird und ihr kommt in Scharen,",
                            "verse 78:19": "Und der Himmel öffnet sich und wird (wie) Tore,",
                            "verse 78:20": "Und die Berge schwinden dahin und werden zur Luftspiegelung.",
                            "verse 78:21": "Wahrlich, die Hölle ist ein Hinterhalt -",
                            "verse 78:22": "Ein Heim für die Widerspenstigen,",
                            "verse 78:23": "Die auf endlose Zeit darin bleiben müssen.",
                            "verse 78:24": "Sie werden dort weder Erquickung noch Getränk kosten,",
                            "verse 78:25": "Es sei denn siedendes Wasser und stinkende Flüssigkeit:",
                            "verse 78:26": "Eine angemessene Belohnung.",
                            "verse 78:27": "Sie fürchteten keine Rechenschaft",
                            "verse 78:28": "Und verwarfen gänzlich Unsere Zeichen.",
                            "verse 78:29": "Und jegliches Ding haben Wir in einem Buche aufgezeichnet.",
                            "verse 78:30": "«Kostet drum (die Strafe); Wir werden euch nicht anders mehren als in der Pein.»",
                            "verse 78:31": "Wahrlich, für die Rechtschaffenen ist Glückseligkeit -",
                            "verse 78:32": "Gärten, umhegte, und Rebenberge.",
                            "verse 78:33": "Und Jungfrauen, Altersgenossinnen,",
                            "verse 78:34": "Und übervolle Schalen.",
                            "verse 78:35": "Dort hören sie weder eitles Gerede noch Lüge.",
                            "verse 78:36": "Eine Belohnung von deinem Herrn - eine Gabe entsprechend (ihren Werken) -,",
                            "verse 78:37": "Dem Herrn der, Himmel und der Erde und alles dessen, was zwischen den beiden ist, dem Gnadenreichen. Sie werden nicht vermögen, Ihn anzureden.",
                            "verse 78:38": "Am Tage, da der Geist und die Engel in Reihen stehen, da werden sie nicht sprechen dürfen, ausgenommen der, dem der Gnadenreiche es erlaubt und der nur das Rechte redet.",
                            "verse 78:39": "Jener Tag kommt gewiß. So möge, wer da will, bei seinem Herrn Einkehr halten.",
                            "verse 78:40": "Wahrlich, Wir haben euch gewarnt vor einer Strafe, die nah bevorsteht: einem Tage, da der Mensch erblicken wird, was seine Hände vorausgeschickt haben, und der Ungläubige sprechen wird: «O wäre ich doch Staub!»"
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": ";s yksx vkil esa fdl pht+ dk gky iwNrs gSa",
                            "verse 78:2": ",d cM+h [+kcj dk gky",
                            "verse 78:3": "ftlesa yksx ,[+rsykQ dj jgs gSa",
                            "verse 78:4": "ns[kks mUgsa vud+jhc gh ekywe gks tk,xk",
                            "verse 78:5": "fQj bUgsa vud+jhc gh t+:j ekywe gks tk,xk",
                            "verse 78:6": "D;k geus t+ehu dks fcNkSuk",
                            "verse 78:7": "vkSj igkM+ksa dks ¼t+ehu½ dh es[k+s ugha cuk;k",
                            "verse 78:8": "vkSj geus rqe yksxksa dks tksM+k tksM+k iSnk fd;k",
                            "verse 78:9": "vkSj rqEgkjh uhan dks vkjke ¼dk ckbl½ d+jkj fn;k",
                            "verse 78:10": "vkSj jkr dks ijnk cuk;k",
                            "verse 78:11": "vkSj ge gh us fnu dks ¼dlc½ evk’k ¼dk oD+r½ cuk;k",
                            "verse 78:12": "vkSj rqEgkjs Åij lkr et+cwr ¼vkleku½ cuk,",
                            "verse 78:13": "vkSj ge gh us ¼lwjt½ dks jkS’ku fpjkx+ cuk;k",
                            "verse 78:14": "vkSj ge gh us cknyksa ls ewlyk/kkj ikuh cjlk;k",
                            "verse 78:15": "rkfd mlds t+fj, ls nkus vkSj lct+h",
                            "verse 78:16": "vkSj ?kus ?kus ckx+ iSnk djsa",
                            "verse 78:17": "cs’kd QSlys dk fnu eqd+jZj gS",
                            "verse 78:18": "ftl fnu lwj Qw¡dk tk,xk vkSj rqe yksx fxjksg fxjksg gkft+j gksxs",
                            "verse 78:19": "vkSj vkleku [kksy fn, tk,¡xs",
                            "verse 78:20": "rks ¼mlesa½ njokt+s gks tk,¡xs vkSj igkM+ ¼viuh txg ls½ pyk, tk,¡xs rks jsr gksdj jg tk,¡xs",
                            "verse 78:21": "cs’kd tgUuqe ?kkr esa gS",
                            "verse 78:22": "ljd’kksa dk ¼ogh½ fBdkuk gS",
                            "verse 78:23": "mlesa eqn~nrksa iM+s >hadrs jgsaxsa",
                            "verse 78:24": "u ogk¡ BUMd dk et+k p[ksaxs vkSj u [kkSyrs gq, ikuh",
                            "verse 78:25": "vkSj cgrh gq;h ihi ds flok dqN ihus dks feysxk",
                            "verse 78:26": "¼;s mudh dkjLrkfu;ksa dk½ iwjk iwjk cnyk gS",
                            "verse 78:27": "cs’kd ;s yksx vk[+ksjr ds fglkc dh mEehn gh u j[krs Fks",
                            "verse 78:28": "vkSj bu yksxks gekjh vk;rksa dks cqjh rjg >qByk;k",
                            "verse 78:29": "vkSj geus gj pht+ dks fy[k dj eut+cr dj j[kk gS",
                            "verse 78:30": "rks vc rqe et+k p[kks gerks rqe ij vt+kc gh c<+krs tk,¡xs",
                            "verse 78:31": "cs’kd ijgst+xkjksa ds fy, cM+h dke;kch gS",
                            "verse 78:32": "¼;kfu csg’r ds½ ckx+ vkSj vaxwj",
                            "verse 78:33": "vkSj og vkSjrsa ftudh mBrh gq;h tokfu;k¡",
                            "verse 78:34": "vkSj ckge getksfy;k¡ gSa vkSj Ójkc ds ycjst+ lkx+j",
                            "verse 78:35": "vkSj Ójkc ds ycjst+ lkx+j ogk¡ u csgwnk ckr lqusaxs vkSj u >wB",
                            "verse 78:36": "¼;s½ rqEgkjs ijojfnxkj dh rjQ ls dkQ+h buke vkSj flyk gS",
                            "verse 78:37": "tks lkjs vkleku vkSj t+ehu vkSj tks bu nksuksa ds chp esa gS lcdk ekfyd gS cM+k esgjcku yksxksa dks mlls ckr dk iwjk u gksxk",
                            "verse 78:38": "ftl fnu ftcjhy vkSj Qfj’rs ¼mlds lkeus½ ij ck¡/k dj [kM+s gksaxs ¼ml fnu½ mlls dksbZ ckr u dj ldsxk exj ftls [+kqnk btkt+r ns vkSj og fBdkus dh ckr dgs",
                            "verse 78:39": "og fnu cjgd+ gS rks tks Ó[+l pkgs vius ijojfnxkj dh ckjxkg esa ¼viuk½ fBdkuk cuk,",
                            "verse 78:40": "geus rqe yksxksa dks vud+jhc vkus okys vt+kc ls Mjk fn;k ftl fnu vkneh vius gkFkksa igys ls Hksts gq, ¼vkeky½ dks ns[ksxk vkSj dkfQ+j dgsxk dk’k eSa [k+kd gks tkrk"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "Tentang apakah mereka saling bertanya-tanya?",
                            "verse 78:2": "Tentang berita yang besar,",
                            "verse 78:3": "yang mereka perselisihkan tentang ini.",
                            "verse 78:4": "Sekali-kali tidak; kelak mereka akan mengetahui,",
                            "verse 78:5": "kemudian sekali-kali tidak; kelak mereka akan mengetahui.",
                            "verse 78:6": "Bukankah Kami telah menjadikan bumi itu sebagai hamparan?,",
                            "verse 78:7": "dan gunung-gunung sebagai pasak?,",
                            "verse 78:8": "dan Kami jadikan kamu berpasang-pasangan,",
                            "verse 78:9": "dan Kami jadikan tidurmu untuk istirahat,",
                            "verse 78:10": "dan Kami jadikan malam sebagai pakaian,",
                            "verse 78:11": "dan Kami jadikan siang untuk mencari penghidupan,",
                            "verse 78:12": "dan Kami bangun di atas kamu tujuh buah (langit) yang kokoh,",
                            "verse 78:13": "dan Kami jadikan pelita yang amat terang (matahari),",
                            "verse 78:14": "dan Kami turunkan dari awan air yang banyak tercurah,",
                            "verse 78:15": "supaya Kami tumbuhkan dengan air itu biji-bijian dan tumbuh-tumbuhan,",
                            "verse 78:16": "dan kebun-kebun yang lebat?",
                            "verse 78:17": "Sesungguhnya Hari Keputusan adalah suatu waktu yang ditetapkan,",
                            "verse 78:18": "yaitu hari (yang pada waktu itu) ditiup sangkakala lalu kamu datang berkelompok-kelompok,",
                            "verse 78:19": "dan dibukalah langit, maka terdapatlah beberapa pintu,",
                            "verse 78:20": "dan dijalankanlah gunung-gunung maka menjadi fatamorganalah ia.",
                            "verse 78:21": "Sesungguhnya neraka Jahanam itu (padanya) ada tempat pengintai,",
                            "verse 78:22": "lagi menjadi tempat kembali bagi orang-orang yang melampaui batas,",
                            "verse 78:23": "mereka tinggal di dalamnya berabad-abad lamanya,",
                            "verse 78:24": "mereka tidak merasakan kesejukan di dalamnya dan tidak (pula mendapat) minuman,",
                            "verse 78:25": "selain air yang mendidih dan nanah,",
                            "verse 78:26": "sebagai pembalasan yang setimpal.",
                            "verse 78:27": "Sesungguhnya mereka tidak takut kepada hisab,",
                            "verse 78:28": "dan mereka mendustakan ayat-ayat Kami dengan sesungguh-sungguhnya,",
                            "verse 78:29": "dan segala sesuatu telah Kami catat dalam suatu kitab.",
                            "verse 78:30": "Karena itu rasakanlah. Dan Kami sekali-kali tidak akan menambah kepada kamu selain daripada azab.",
                            "verse 78:31": "Sesungguhnya orang-orang yang bertakwa mendapat kemenangan,",
                            "verse 78:32": "(yaitu) kebun-kebun dan buah anggur,",
                            "verse 78:33": "dan gadis-gadis remaja yang sebaya,",
                            "verse 78:34": "dan gelas-gelas yang penuh (berisi minuman).",
                            "verse 78:35": "Di dalamnya mereka tidak mendengar perkataan yang sia-sia dan tidak (pula perkataan) dusta.",
                            "verse 78:36": "Sebagai balasan dari Tuhanmu dan pemberian yang cukup banyak,",
                            "verse 78:37": "Tuhan Yang memelihara langit dan bumi dan apa yang ada di antara keduanya; Yang Maha Pemurah. Mereka tidak dapat berbicara dengan Dia.",
                            "verse 78:38": "Pada hari, ketika ruh dan para malaikat berdiri bershaf-shaf, mereka tidak berkata-kata kecuali siapa yang telah diberi izin kepadanya oleh Tuhan Yang Maha Pemurah; dan ia mengucapkan kata yang benar.",
                            "verse 78:39": "Itulah hari yang pasti terjadi. Maka barang siapa yang menghendaki, niscaya ia menempuh jalan kembali kepada Tuhannya.",
                            "verse 78:40": "Sesungguhnya Kami telah memperingatkan kepadamu (hai orang kafir) siksa yang dekat, pada hari manusia melihat apa yang telah diperbuat oleh kedua tangannya; dan orang kafir berkata: \"Alangkah baiknya sekiranya aku dahulu adalah tanah\"."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "Su cosa si interrogano a vicenda?",
                            "verse 78:2": "Sul grande Annuncio,",
                            "verse 78:3": "a proposito del quale sono discordi.",
                            "verse 78:4": "No, presto verranno e sapranno.",
                            "verse 78:5": "Ancora no, presto sapranno.",
                            "verse 78:6": "Non facemmo della terra una culla,",
                            "verse 78:7": "delle montagne pioli?",
                            "verse 78:8": "Vi abbiamo creato in coppie",
                            "verse 78:9": "e facciamo del vostro sonno un riposo,",
                            "verse 78:10": "della notte un indumento,",
                            "verse 78:11": "e del giorno un mezzo per le incombenze della vita.",
                            "verse 78:12": "Costruimmo sopra di voi sette solidi [cieli]",
                            "verse 78:13": "e vi ponemmo una lampada ardente ;",
                            "verse 78:14": "facciamo scendere dalle nuvole un'acqua abbondante",
                            "verse 78:15": "per suscitare grano e vegetazione",
                            "verse 78:16": "e giardini lussureggianti.",
                            "verse 78:17": "Invero il Giorno della Decisione è stabilito.",
                            "verse 78:18": "Il Giorno in cui verrà soffiato nel Corno, accorrerete a frotte;",
                            "verse 78:19": "sarà spalancato il cielo e [sarà tutto] porte ,",
                            "verse 78:20": "e le montagne saranno messe in marcia, diventando un miraggio.",
                            "verse 78:21": "Invero l'Inferno è in agguato,",
                            "verse 78:22": "asilo per i ribelli.",
                            "verse 78:23": "Vi dimoreranno per [intere] generazioni ,",
                            "verse 78:24": "senza gustare né freschezza né bevanda,",
                            "verse 78:25": "eccetto acqua bollente o liquido infetto.",
                            "verse 78:26": "Giusto compenso,",
                            "verse 78:27": "[poiché] non si aspettavano il rendiconto;",
                            "verse 78:28": "sfrontatamente tacciavano di menzogna i Nostri segni,",
                            "verse 78:29": "mentre di ogni cosa abbiamo tenuto conto per iscritto.",
                            "verse 78:30": "E allora gustate [il tormento]! A voi non accresceremo null'altro che il castigo.",
                            "verse 78:31": "In verità avranno successo i timorati:",
                            "verse 78:32": "giardini e vigne,",
                            "verse 78:33": "fanciulle dai seni pieni e coetanee,",
                            "verse 78:34": "calici traboccanti.",
                            "verse 78:35": "Non udranno colà né vanità né menzogna:",
                            "verse 78:36": "compenso del tuo Signore, dono adeguato",
                            "verse 78:37": "da parte del Signore dei cieli e della terra e di ciò che vi è frammezzo, del Compassionevole, Cui non oseranno rivolgere la parola.",
                            "verse 78:38": "Il Giorno in cui lo Spirito e gli angeli si ergeranno in schiere, nessuno oserà parlare, eccetto colui cui il Compassionevole l'avrà permesso e che dirà cose vere.",
                            "verse 78:39": "Quel Giorno [verrà] ineluttabilmente. Si rifugi quindi presso il suo Signore chi vuole.",
                            "verse 78:40": "In verità vi abbiamo avvertito di un castigo imminente, il Giorno in cui l'uomo vedrà quello che le sue mani avranno preparato e dirà il miscredente: « Ahimé, fossi io polvere! »."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "何事に就いて， かれらは尋ね合うのか。",
                            "verse 78:2": "偉大な消息に就いて。",
                            "verse 78:3": "それに就いて，かれらは意見が果なる。",
                            "verse 78:4": "いや，かれらはやがて知ろう．",
                            "verse 78:5": "いや，いや，かれらはやがて知るであろう。",
                            "verse 78:6": "われは大地を，広々としなかったか。",
                            "verse 78:7": "また山々を，杭としたてはないか。",
                            "verse 78:8": "われはあなたがたを両性に創り，",
                            "verse 78:9": "また休息のため，あなたがたの睡眠を定め，",
                            "verse 78:10": "夜を覆いとし，",
                            "verse 78:11": "昼を生計の手段として定めた。",
                            "verse 78:12": "またわれは，あなたがたの上に堅固に7層（の天）を打ち建て，",
                            "verse 78:13": "輝やかしい灯し火を（その中に）字置き，",
                            "verse 78:14": "われは雲から豊かに雨を降らせ，",
                            "verse 78:15": "それによって，殻物や野菜を萠え出させ，",
                            "verse 78:16": "様々な園を茂らせる。",
                            "verse 78:17": "本当に裁きの日は定められていて，",
                            "verse 78:18": "その日，ラッパが吹かれるとあなたがたは群をなして出て来る。",
                            "verse 78:19": "天は開かれて数々の門となり，",
                            "verse 78:20": "山々は移されて蜃気楼のようになる。",
                            "verse 78:21": "本当に地獄は，待ち伏せの場であり，",
                            "verse 78:22": "背信者の落ち着く所，",
                            "verse 78:23": "かれらは何時までもその中に住むであろう。",
                            "verse 78:24": "そこで涼しさも味わえず，（どんな）飲物もない，",
                            "verse 78:25": "煮えたぎる湯と膿の外には。",
                            "verse 78:26": "（かれらのため）相応しい報奨である。",
                            "verse 78:27": "本当にかれらは，（その行いに対する）清算を希望しないでいた。",
                            "verse 78:28": "またかれらはわが印を嘘であると言って，強く拒否した。",
                            "verse 78:29": "われは一切のことを，天の書に留めている。",
                            "verse 78:30": "だからあなたがたは（自分の行いの結果を）味わえ。われは懲罰を増加するばかりである。",
                            "verse 78:31": "本当に主を畏れる者には，安全な場所（楽園）がある。",
                            "verse 78:32": "緑の園や，ブドウ園，",
                            "verse 78:33": "胸の脹れた同じ年頃の乙女たち，",
                            "verse 78:34": "またなみなみと（溢？）れる杯。",
                            "verse 78:35": "そこではつまらぬ話や偽り言を聞かない。",
                            "verse 78:36": "これらはあなたの主からの報奨，賜物の決算である。",
                            "verse 78:37": "天と地，そしてその間の凡てのものの主，慈悲深き御方（からの賜物であり），誰もかれに語りかけることは出来ない。",
                            "verse 78:38": "聖霊と天使たちが，整列して立つ日，慈悲深き御方から御許しを得て正しいことを言う者以外には，誰も口をきくことが出来ない。",
                            "verse 78:39": "それは真実の日である。だから誰でも望む者は，主の御許に戻るがいい。",
                            "verse 78:40": "本当にわれは，懲罰が近いと，あなたがたに警告した。その日，人は，自分の両方の手が前もって行ったもの（所業）を見るであろう。不信者は，「ああ，情けない，わたしが塵であったならば。」と言うであろう。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "이 말 이후에 그들은 어떤 메세지를 믿으려 하느뇨",
                            "verse 78:2": "위대한 소식에 관하여 질문 하느뇨",
                            "verse 78:3": "그것에 관하여 그들은 의견을달리하나",
                            "verse 78:4": "실로 그들은 곧 알게 되리라",
                            "verse 78:5": "실로 그들은 곧 알게 되리라",
                            "verse 78:6": "하나님이 대지를 두매 넓다 랗게 두셨으며",
                            "verse 78:7": "산들을 두매 기둥으로 두었고",
                            "verse 78:8": "너희를 창조하매 자웅으로 두 셨으며",
                            "verse 78:9": "수면을 두매 너희 휴식을 위 해 두었고",
                            "verse 78:10": "밤을 두매 의상으로 두었으 며",
                            "verse 78:11": "낮을 두매 일용할 양식을 얻도록 두었노라",
                            "verse 78:12": "하나님은 너희위에 칠천을 두었으며",
                            "verse 78:13": "그 안에 찬란한 빛을 두고",
                            "verse 78:14": "풍부한 비구름을 보내어",
                            "verse 78:15": "이로 하여 곡식과 채소들을 생산케 하고",
                            "verse 78:16": "울창한 정원들이 되도록 하 지 아니 했더뇨",
                            "verse 78:17": "실로 분류하는 그날은 정하 여진 것으로",
                            "verse 78:18": "나팔이 울리는 그날 너희는 떼를 지어 앞으로 나오게 되며",
                            "verse 78:19": "하늘은 문이 열리는 것처럼 열리고",
                            "verse 78:20": "산들은 신기루처럼 사라지며",
                            "verse 78:21": "지옥은 기다리고 있으니",
                            "verse 78:22": "사악한 자들을 위한 목적지라",
                            "verse 78:23": "그들은 그곳에서 영주하니라",
                            "verse 78:24": "그들은 그곳에서 시원함도 맛보지 못할 것이며 마실 음료수 도 없으며",
                            "verse 78:25": "오직 끓어 오르는 액체와 검 고 어두운 혹독한 액체 뿐으로",
                            "verse 78:26": "이것이 그들을 위한 적절한 보상이라",
                            "verse 78:27": "그들은 그들의 행위에 대한 어떤 계산도 두려워 하지 아니하 고",
                            "verse 78:28": "하나님의 말씀을 거짓이라 부정하였으매",
                            "verse 78:29": "하나님은 모든 것을 기륵보관 하시니라",
                            "verse 78:30": "그러므로 너희 행위의 결과 들을 맛보라 응벌 외에는 너희에 게 더하여주지 아니 하리라",
                            "verse 78:31": "그러나 의로운 자들은 승리 한 것이 있나니",
                            "verse 78:32": "천국과 포도들이 있고",
                            "verse 78:33": "나이가 같은 청순한 배우자 가 있으며",
                            "verse 78:34": "넘치는 잔이 있도다",
                            "verse 78:35": "그들은 그곳에서 어떤 무익 한 대화나 거짓된 말도 듣지 아니 하며",
                            "verse 78:36": "주님의 계산에 따라 보상을 받노라",
                            "verse 78:37": "하늘과 대지와 그 사이에 있 는 만물의 주님이신 가장 자비로 운 하나님께 어느 누구도 그분의 능력에 견주지 못하리라",
                            "verse 78:38": "영혼과 천사들이 앞으로 줄 지어 서는 그날 자비로우신 하나님의 허락을 얻어 사실을 말할 자 외에는 어느 누구도 말할 수 없나니",
                            "verse 78:39": "그날이 진리의 날이 될 것이라 그러므로 원하는 자는 그로 하여금 주님께 귀의토록 하리라",
                            "verse 78:40": "실로 하나님께서 너희에게 다가올 응벌에 관하여 경고했나니인간은 그가 행한 그 행위들을 지켜볼 그날 불신자들은 저에게 재 앙이 있나니 차라리 \\xC3D으로 돌아 갔으면 하고 말하리라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "(ئه‌ی خه‌ڵکه‌) ده‌رباره‌ی چی له یه‌کتر ده‌پرسن؟",
                            "verse 78:2": "ده‌رباره‌ی هه‌واڵه گه‌وره و گرنگه‌که‌!! (که ڕۆژی قیامه‌ته‌).",
                            "verse 78:3": "له حاڵێکدا له ئه‌وانه ڕاو بۆچوونیان جیاوازه ده‌رباره‌ی.",
                            "verse 78:4": "نه‌خێر، وا بۆیان نالوێت، له داهاتوویه‌کی نزیکدا خۆیان ده‌بیننه‌وه و هه‌موو ڕاستیه‌کانیان بۆ ده‌رده‌که‌وێت.",
                            "verse 78:5": "به‌ڵێ! له‌وه‌و دوا، له داهاتوویه‌کی نزیکدا خۆیان ده‌بیننه‌وه و ڕاستیه‌کانیان بۆ ده‌رده‌که‌وێت.",
                            "verse 78:6": "(پێش باسی قیامه‌ت په‌روه‌ردگار گه‌شتێکیان به ناو دروستکراوه‌کان و دیارده‌کاندا پێده‌کات ده‌پرسێت: ئایا زه‌ویمان وه‌ک لانکه بۆ فه‌راهه‌نگ نه‌هێناون؟",
                            "verse 78:7": "(ئایا) کێوه‌کانمان وه‌ک مێخ بۆ دانه‌کوتاون؟ (تا زه‌وی بپارێزێت له فشاری بورکان و ماده تواوه‌کانی ناو ناخی، هه‌روه‌رها هه‌تا له‌نگه‌ری ڕابگرێت و چه‌نده‌ها سودی ترتان پێ بگه‌یه‌نێت).",
                            "verse 78:8": "(ئایا) نێوه‌مان به جووت دروست نه‌کردووه‌؟",
                            "verse 78:9": "خه‌وتنمان بۆ نه‌کردوون به‌هۆی سره‌وتن؟",
                            "verse 78:10": "(ئایا) شه‌وگارمان بۆ نه‌کردوون به‌داپۆشه‌ر وه‌ک پۆشاک، تاتیایدا بشاردرێنه‌وه‌؟",
                            "verse 78:11": "(ئایا) ڕۆژیشمان بۆ نه‌کردوونه‌ته کاتی به ده‌ستهێنانی ڕزق و ڕۆزی؟",
                            "verse 78:12": "(ئایا) حه‌وت چین ئاسمانی به هێز و پته‌ومان به ڕا سه‌رتانه‌وه دروست نه‌کردووه‌؟",
                            "verse 78:13": "چرایه‌کی پرشنگدارمان بۆ فه‌راهه‌م نه‌هێناون؟ (که مه‌به‌ست خۆره‌)",
                            "verse 78:14": "‎ (ئایا) له هه‌وره گوشراوه‌کان بارانێکی زۆرمان نه‌باراندووه‌؟",
                            "verse 78:15": "تا به هۆی ئه‌و بارانه‌وه جۆره‌ها دانه‌وێڵه و ڕووه‌ک بڕوێنین.",
                            "verse 78:16": "هه‌روه‌ها چه‌نده‌ها باخی چڕو پڕو له‌یه‌ک ئاڵاو به‌دی نه‌هێناوه‌.",
                            "verse 78:17": "(ئینجا دێته سه‌ر باسی هه‌واڵه گرنگ و سامناکه‌که‌): به‌‎ڕاستی ڕۆژی جیاکرنه‌وه‌، کاتێكیدیاری کراوه (بۆ جیاکردنه‌وه‌ی چاکان له خراپان، ئیمانداران له کافران، سته‌مکاران له سته‌ملێکراوان).",
                            "verse 78:18": "ئه‌و ڕۆژه‌ی که فوو ده‌کرێت به (صور) دا، جا پۆل پۆل و ده‌سته ده‌سته به‌ره‌و مه‌یدانی لێپرسینه‌وه بێ په‌روا دێن.",
                            "verse 78:19": "ئاسمان ده‌کرێته‌وه و ده‌بێته ده‌روازه و ده‌رگا (بۆ دابه‌زینی فریشته‌کان).",
                            "verse 78:20": "کێوه‌کانیش هه‌ڵده‌که‌نرێن و ده‌ڕۆن به ئاسماندا وه‌ک تراویلکه و سه‌رابێکی گه‌وره‌.",
                            "verse 78:21": "بێگومان دۆزه‌خیش ده‌مێکه چاوه‌ڕێی ئه‌و ڕۆژه‌یه و خۆی بۆ مه‌ڵاسداوه‌.",
                            "verse 78:22": "ده‌بێته مه‌نزڵگای خوانه‌ناس و یاخیه‌کان.",
                            "verse 78:23": "هه‌زاره‌ها ساڵی دوورو درێژ و نه‌بڕاوه‌ی تێدا ده‌به‌نه‌سه‌ر...",
                            "verse 78:24": "له‌ناویدا ناچێژن فێنکاییه‌ک، یا خواردنه‌وه‌یه‌کی به‌تام...",
                            "verse 78:25": "جگه له ئاوی له کوڵ و کێم و زووخاو.",
                            "verse 78:26": "که ئه‌وه‌ش پاداشتێكی له‌بارو پڕاو پڕه (بۆ خوانه‌ناسان).",
                            "verse 78:27": "چونکه ئه‌وانه کاتی خۆی به‌ته‌مای ئه‌م ڕۆژه و لێپرسینه‌وه‌یه نه‌بوون، حه‌زیان له باسی نه‌ده‌کرد.",
                            "verse 78:28": "به‌ڵکو زۆر به‌توندی دژایه‌تی ئایه‌ته‌کانی ئێمه‌یان ده‌رکرد و به درۆیان ده‌زانی..",
                            "verse 78:29": "ئێمه‌ش هه‌موو شتێکمان له‌سه‌ریان سه‌رژمێری کردووه و به‌وردیی تۆمارمان کردووه‌.",
                            "verse 78:30": "(پاشان پێیان ده‌وترێت) ده بچێژن (ئه‌ی خوانه‌ناسان) له سزاو ئازار و ئه‌شکه‌نجه به‌ولاوه‌، جا هه‌رگیز هیچی ترتان بۆ زیاد ناکه‌ین.",
                            "verse 78:31": "به‌ڕاستی بۆ خواناس و پارێزکاران سه‌رفرازی و خۆشێ و شادی و کامه‌رانی فراوان ئاماده‌یه‌.",
                            "verse 78:32": "چه‌نده‌ها باخچه‌ی جوان و جۆری ترێ.",
                            "verse 78:33": "(له‌و جێگه و ڕێگه خۆشانه‌دا هاوسه‌ر و هاوده‌می) ئافره‌تانی سینه جوان و (دیمه جوان) هاوته‌مه‌ن ئاماده‌یه‌.",
                            "verse 78:34": "له‌گه‌ڵ کاسه‌ی پڕ له شه‌رابی تایبه‌تیدا.",
                            "verse 78:35": "له‌و به‌هه‌شته‌دا هیچ جۆره قسه‌یه‌کی پڕو پووچ و درۆ و ده‌له‌سه‌یه‌ک نابیستن.",
                            "verse 78:36": "ئه‌مه‌ش هه‌مووی پاداشتێکه له‌لایه‌ن په‌روه‌ردگارته‌وه (ئه‌ی ئیماندار)، به‌خششێکه به حسابێکی ورد ده‌به‌خشرێت (به به‌خته‌وه‌ران).",
                            "verse 78:37": "‎ (له‌لایه‌ن) په‌روه‌ردگاری میهره‌بانی ئاسمانه‌کان و زه‌وی و هه‌رچی له نێوانیاندا هه‌یه‌، (ئه‌و ڕۆژه‌) که‌س ناتوانێت له‌به‌رده‌م زاتی په‌روه‌ردگاردا بدوێت.",
                            "verse 78:38": "ڕۆژێک دێت جوبڕه‌ئیل و فه‌ریشته‌کان به ڕیز ده‌وه‌ستن و ورته‌یان لێنایه‌ت و هیچ قسه ناکه‌ن، مه‌گه‌ر ئه‌وه‌یان که خوای میهره‌بان مۆڵه‌تی بدات و قسه‌ی جوان و به‌جێ پێشکه‌ش بکات.",
                            "verse 78:39": "ئه‌و ڕۆژه ڕۆژێکی حه‌ق و ڕاسته و به‌ڕێوه‌یه‌.. جا ئه‌وه‌ی ده‌یه‌وێت با به‌ره‌و لای په‌روه‌ردگاری ڕێگه بگرێته به‌ر.",
                            "verse 78:40": "به‌ڕاستی ئێمه ئێوه‌مان ئاگادار کردووه له‌وه‌ی که سزایه‌کی نزیک به‌ڕێوه‌یه‌، ئه‌و ڕۆژه ڕۆژێکه که ئاده‌میزاد سه‌یری ده‌ستپێشخه‌ری خۆی ده‌کات، خوانه‌ناسیش ده‌ڵێت.. خۆزگه هه‌ر خاک بوومایه (ئاوا زیندوو نه‌کرامایه‌ته‌وه و گیرم نه‌خواردایه‌)."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "Tentang apakah mereka bertanya-tanya?",
                            "verse 78:2": "Tentang berita yang besar, (berita kebangkitan manusia hidup semula menerima balasannya).",
                            "verse 78:3": "Yang mereka (ragu-ragu dan) berselisihan mengenainya.",
                            "verse 78:4": "Jangan! (Janganlah mereka bersikap demikian!) Mereka akan mengetahui (dengan yakin tentang kebenaran hari balasan itu).",
                            "verse 78:5": "Sekali lagi jangan! (Janganlah mereka berselisihan!) Mereka akan mengetahui kelak (tentang apa yang akan menimpa mereka).",
                            "verse 78:6": "(Mengapa kamu ragu-ragukan kekuasaan Kami menghidupkan semula orang-orang yang telah mati?) Bukankah Kami telah menjadikan bumi (terbentang luas) sebagai hamparan?",
                            "verse 78:7": "Dan gunung-ganang sebagai pancang pasaknya?",
                            "verse 78:8": "Dan Kami telah menciptakan kamu berpasang-pasang?",
                            "verse 78:9": "Dan Kami telah menjadikan tidur kamu untuk berehat?",
                            "verse 78:10": "Dan Kami telah menjadikan malam (dengan gelapnya) sebagai pakaian (yang melindungi)?",
                            "verse 78:11": "Dan Kami telah menjadikan siang (dengan cahaya terangnya) masa untuk mencari rezeki?",
                            "verse 78:12": "Dan Kami telah membina di atas kamu tujuh petala (langit) yang kuat kukuh?",
                            "verse 78:13": "Dan Kami telah mengadakan matahari menjadi lampu yang terang-benderang cahayanya?",
                            "verse 78:14": "Dan Kami telah menurunkan dari awan, air (hujan) yang mencurah-curah, -",
                            "verse 78:15": "Untuk Kami mengeluarkan dengan air itu, biji-bijian dan tumbuh-tumbuhan, -",
                            "verse 78:16": "Serta kebun-kebun yang subur bertaut-taut pokoknya?",
                            "verse 78:17": "Sesungguhnya hari pemutusan hukum itu, adalah satu masa yang ditentukan,",
                            "verse 78:18": "Iaitu masa ditiup sangkakala, lalu kamu (bangkit hidup) serta datang berpuak-puak (ke Padang Mahsyar);",
                            "verse 78:19": "Dan (pada masa itu) langit dipecah belahkan sehingga tiap-tiap belahannya menjadi ibarat pintu yang terbuka luas,",
                            "verse 78:20": "Dan gunung-ganang, setelah dihancurkan, diterbangkan ke angkasa, lalu menjadilah ia bayangan semata-mata seperti riak sinaran panas di padang pasir.",
                            "verse 78:21": "Sesungguhnya Neraka Jahannam adalah disediakan;",
                            "verse 78:22": "Untuk orang-orang yang melampaui batas hukum Tuhan, sebagai tempat kembalinya.",
                            "verse 78:23": "Mereka tinggal di dalamnya berkurun-kurun lamanya.",
                            "verse 78:24": "Mereka tidak dapat merasai udara yang sejuk di dalamnya dan tidak pula sebarang minuman;",
                            "verse 78:25": "Kecuali air panas yang menggelegak dan air danur yang mengalir,",
                            "verse 78:26": "Sebagai balasan yang sesuai (dengan amal mereka yang buruk).",
                            "verse 78:27": "Kerana sesungguhnya mereka dahulu tidak menaruh ingatan terhadap hari hitungan amal,",
                            "verse 78:28": "Dan mereka telah mendustakan dengan sesungguh-sungguhnya akan ayat-ayat keterangan Kami;",
                            "verse 78:29": "Dan tiap-tiap sesuatu dari bawaan hidupnya, telah Kami hitung secara bertulis.",
                            "verse 78:30": "(Setelah mereka masuk ke dalam Neraka, dikatakan kepada mereka: Oleh sebab kamu telah mendustakan ayat-ayat Kami) maka rasalah kamu (azab yang disediakan), kerana Kami tidak akan melakukan selain dari menambah berbagai azab kepada kamu.",
                            "verse 78:31": "Sesungguhnya orang-orang yang bertakwa, disediakan Syurga tempat mereka beroleh apa yang mereka ingini.",
                            "verse 78:32": "(Mereka akan beroleh) taman-taman bunga dan kebun-kebun buah-buahan, terutama anggur;",
                            "verse 78:33": "Dan perawan-perawan yang sebaya umurnya;",
                            "verse 78:34": "Serta piala atau gelas yang penuh dengan minuman;",
                            "verse 78:35": "Mereka tidak mendengar di dalam Syurga itu perkataan yang sia-sia dan tiada pula perkataan yang dusta;",
                            "verse 78:36": "Sebagai balasan dari Tuhanmu, iaitu satu limpah kurnia yang dikira cukup (menurut yang dijanjikanNya),",
                            "verse 78:37": "Tuhan yang mentadbirkan tujuh petala langit dan bumi serta apa yang ada di antara keduanya, Tuhan Yang Maha Pemurah, tidak ada sesiapapun diberi kuasa berkata-kata denganNya (untuk memohon pertimbangan tentang balasan atau pengurniaan itu);",
                            "verse 78:38": "(Tambahan pula) pada masa Jibril dan malaikat-malaikat yang lain berdiri bersaf-saf (menunggu perintah Tuhan), tidak ada yang berani berkata-kata (memohon pertimbangan) melainkan yang telah diizinkan baginya oleh Tuhan Yang Maha Pemurah, serta ia berkata benar.",
                            "verse 78:39": "Itulah keterangan-keterangan mengenai hari (kiamat) yang sungguh tetap berlakunya; maka sesiapa yang mahukan kebaikan dirinya, dapatlah dia mengambil jalan dan cara kembali kepada Tuhannya (dengan iman dan amal yang soleh)!",
                            "verse 78:40": "Sesungguhnya (dengan keterangan-keterangan yang tersebut), Kami memberi amaran kepada kamu mengenai azab yang dekat (masa datangnya), iaitu hari seseorang melihat apa yang telah diusahakannya dan orang yang kafir akan berkata (pada hari itu): Alangkah baiknya kalau aku menjadi tanah (supaya aku tidak dibangkitkan untuk dihitung amalku dan menerima balasan)."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "آنها از چه چيز از يكديگر سؤال مى‏كنند؟!",
                            "verse 78:2": "از خبر بزرگ و پراهميت (رستاخيز)!",
                            "verse 78:3": "همان خبرى كه پيوسته در آن اختلاف دارند!",
                            "verse 78:4": "چنين نيست كه آنها فكر مى‏كنند، و بزودى مى‏فهمند!",
                            "verse 78:5": "باز هم چنين نيست كه آنها مى‏پندارند، و بزودى مى‏فهمند (كه قيامت حق است)!",
                            "verse 78:6": "آيا زمين را محل آرامش (شما) قرار نداديم؟!",
                            "verse 78:7": "و كوه‏ها را ميخهاى زمين؟!",
                            "verse 78:8": "و شما را بصورت زوجها آفريديم!",
                            "verse 78:9": "و خواب شما را مايه آرامشتان قرار داديم،",
                            "verse 78:10": "و شب را پوششى (براى شما)،",
                            "verse 78:11": "و روز را وسيله‏اى براى زندگى و معاش!",
                            "verse 78:12": "و بر فراز شما هفت (آسمان) محكم بنا كرديم!",
                            "verse 78:13": "و چراغى روشن و حرارت‏بخش آفريديم!",
                            "verse 78:14": "و از ابرهاى باران‏زا آبى فراوان نازل كرديم،",
                            "verse 78:15": "تا بوسيله آن دانه و گياه بسيار برويانيم،",
                            "verse 78:16": "و باغهايى پردرخت!",
                            "verse 78:17": "(آرى) روز جدايى، ميعاد همگان است!",
                            "verse 78:18": "روزى كه در «صور» دميده مى‏شود و شما فوج فوج (به محشر) مى‏آييد!",
                            "verse 78:19": "و آسمان گشوده مى‏شود و بصورت درهاى متعددى درمى‏آيد!",
                            "verse 78:20": "و كوه‏ها به حركت درمى‏آيد و بصورت سرابى مى‏شود!",
                            "verse 78:21": "مسلما (در آن روز) جهنم كمينگاهى است بزرگ،",
                            "verse 78:22": "و محل بازگشتى براى طغيانگران!",
                            "verse 78:23": "مدتهاى طولانى در آن مى‏مانند!",
                            "verse 78:24": "در آنجا نه چيز خنكى مى‏چشند و نه نوشيدنى گوارايى،",
                            "verse 78:25": "جز آبى سوزان و مايعى از چرك و خون!",
                            "verse 78:26": "اين مجازاتى است موافق و مناسب (اعمالشان)!",
                            "verse 78:27": "چرا كه آنها هيچ اميدى به حساب نداشتند،",
                            "verse 78:28": "و آيات ما را بكلى تكذيب كردند!",
                            "verse 78:29": "و ما همه چيز را شمارش و ثبت كرده‏ايم!",
                            "verse 78:30": "پس بچشيد كه چيزى جز عذاب بر شما نمى‏افزاييم!",
                            "verse 78:31": "مسلما براى پرهيزگاران نجات و پيروزى بزرگى است:",
                            "verse 78:32": "باغهايى سرسبز، و انواع انگورها،",
                            "verse 78:33": "و حوريانى بسيار جوان و هم‏سن و سال،",
                            "verse 78:34": "و جامهايى لبريز و پياپى (از شراب طهور)!",
                            "verse 78:35": "در آنجا نه سخن لغو و بيهوده‏اى مى‏شنوند و نه دروغى!",
                            "verse 78:36": "اين كيفرى است از سوى پروردگارت و عطيه‏اى است كافى!",
                            "verse 78:37": "همان پروردگار آسمانها و زمين و آنچه در ميان آن دو است، پروردگار رحمان! و (در آن روز) هيچ كس حق ندارد بى اجازه او سخنى بگويد (يا شفاعتى كند)!",
                            "verse 78:38": "« روزى كه «روح‏» و «ملائكه‏» در يك صف مى‏ايستند و هيچ يك، جز به اذن خداوند رحمان، سخن نمى‏گويند، و (آنگاه كه مى‏گويند) درست مى‏گويند!",
                            "verse 78:39": "آن روز حق است; هر كس بخواهد راهى به سوى پروردگارش برمى‏گزيند!",
                            "verse 78:40": "و ما شما را از عذاب نزديكى بيم داديم! اين عذاب در روزى خواهد بود كه انسان آنچه را از قبل با دستهاى خود فرستاده مى‏بيند، و كافر مى‏گويد: «اى كاش خاك بودم (و گرفتار عذاب نمى‏شدم)!»"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 78:1": "Despre ce întreabã întraolaltã?",
                            "verse 78:2": "Despre vestea cea mare,",
                            "verse 78:3": "În privința cãreia sunt în neînțelegere!",
                            "verse 78:4": "Ei, bine, nu! Ei o sã afle cât de curând!",
                            "verse 78:5": "Și încã o datã: Nu! Ei o sã afle!",
                            "verse 78:6": "Oare nu am fãcut Noi pãmântul un pat",
                            "verse 78:7": "Și munții ca țãruși?",
                            "verse 78:8": "V-am creat pe voi perechi",
                            "verse 78:9": "Și v-am lãsat vouã somnul pentru odihnã",
                            "verse 78:10": "Și am fãcut din noapte un veșmânt",
                            "verse 78:11": "Și am fãcut ziua pentru agonisirea hranei",
                            "verse 78:12": "Și am durat deasupra voastrã șapte [ceruri] întãrite",
                            "verse 78:13": "Și am fãcut o lampã aprinsã",
                            "verse 78:14": "Și am pogorât din nori apã din belșug,",
                            "verse 78:15": "Pentru ca sã facem sã se iveascã grâne și ierburi, cu ajutorul ei,",
                            "verse 78:16": "Și grãdini dese.",
                            "verse 78:17": "Ziua Judecãții va fi un termen [pentru adunare]!",
                            "verse 78:18": "O Zi în care se va suna în trâmbițã și veți veni în cete,",
                            "verse 78:19": "Și se va deschide cerul cu niște porți",
                            "verse 78:20": "Și munții vor fi clintiți din loc și vor fi ca un miraj ,",
                            "verse 78:21": "Iar Gheena va fi loc de pândã",
                            "verse 78:22": "Și va fi adãpost pentru nelegiuiți,",
                            "verse 78:23": "Pentru a petrece în ea veacuri la rând;",
                            "verse 78:24": "Nu vor gusta în ea rãcoare și nici bãuturã,",
                            "verse 78:25": "Ci numai apã clocotitã și puroi,",
                            "verse 78:26": "Ca rãsplatã dreaptã!",
                            "verse 78:27": "Ei nu se așteaptã sã dea socotealã",
                            "verse 78:28": "Și țin de minciunã versetele Noastre, fãrã întrerupere,",
                            "verse 78:29": "În vreme ce toate lucrurile sunt adunate într-o carte.",
                            "verse 78:30": "“Gustați, așadar! Și nu vã vom spori vouã decât chinul!”",
                            "verse 78:31": "Însã pentru cei evlavioși va fi o izbândã:",
                            "verse 78:32": "Grãdini și struguri,",
                            "verse 78:33": "[Fete frumoase] cu sânii rotunjiți - toate la fel de tinere -",
                            "verse 78:34": "Și pocale pline.",
                            "verse 78:35": "Nu vor auzi în ele vorbe deșarte și nici minciuni.",
                            "verse 78:36": "[Aceasta este] rãsplatã de la Domnul tãu și un dar îmbelșugat",
                            "verse 78:37": "De la Stãpânul cerurilor și al pãmântului și al celor care se aflã între ele, Cel Milostiv [Ar-Rahman]. Și ei nu vor cuteza sã-I spunã Luio vorbã.",
                            "verse 78:38": "O Zi în care Duhul și îngerii se vor așeza în rând și nimeni nu va vorbi, afarã de acela cãruia Cel Milostiv [Ar-Rahman] îi va da îngãduințã și care va spune adevãrul.",
                            "verse 78:39": "Aceastã Zi este adevãratã. Deci, acela care voiește, trebuie sã caute adãpost la Domnul sãu.",
                            "verse 78:40": "Noi v-am prevenit despre o osândã apropiatã, în Ziua când omul va vedea ce au fãcut mâinile sale mai înainte, iar necredinciosul va zice: “Vai mie! Ce bine dacã aș fi țãrânã!”"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 78:1": "Despre ce se întreabă unii pe alţii?",
                            "verse 78:2": "Despre Vestea cea Mare",
                            "verse 78:3": "asupra căreia se ceartă.",
                            "verse 78:4": "Ba nu!... Curând ei vor avea ştire!",
                            "verse 78:5": "Şi iarăşi, curând ei vor avea ştire!",
                            "verse 78:6": "Nu am făcut Noi pământul leagăn,",
                            "verse 78:7": "iar munţii ţăruşi?",
                            "verse 78:8": "Noi v-am creat pe voi cu pereche.",
                            "verse 78:9": "Şi v-am făcut vouă somnul odihnă.",
                            "verse 78:10": "Noi am făcut noaptea veşmânt,",
                            "verse 78:11": "şi am făcut ziua pentru trai.",
                            "verse 78:12": "Am zidit deasupra voastră şapte tării.",
                            "verse 78:13": "Am făcut o candelă dogoritoare.",
                            "verse 78:14": "Şi din nori am trimis apă şuvoi",
                            "verse 78:15": "ca să dea la iveală grâne şi ierburi",
                            "verse 78:16": "şi grădini îmbelşugate.",
                            "verse 78:17": "Da, Ziua Cumpenei este hotărâtă.",
                            "verse 78:18": "În Ziua când se va sufla în trâmbiţă, veţi veni în cete.",
                            "verse 78:19": "Cerul se va deschide şi vor fi numai porţi.",
                            "verse 78:20": "Munţii se vor pune în mişcare şi vor fi numai năluciri.",
                            "verse 78:21": "Gheena ce stă la pândă",
                            "verse 78:22": "va fi liman ticăloşilor",
                            "verse 78:23": "care vor zăcea acolo veacuri de-a rândul",
                            "verse 78:24": "fără să guste răcoare ori băutură,",
                            "verse 78:25": "ci numai apă clocotită şi băutură împuţită,",
                            "verse 78:26": "căci aceasta le va fi răsplată cuvenită.",
                            "verse 78:27": "Ei nu aşteptau nici o Judecată,",
                            "verse 78:28": "căci socoteau semnele Noastre minciuni.",
                            "verse 78:29": "Noi am ţinut însă socoteala la tot într-o carte.",
                            "verse 78:30": "Gustaţi, aşadar! Noi vouă nu vă vom mări decât osânda!",
                            "verse 78:31": "Cei temători vor avea un loc fericit:",
                            "verse 78:32": "grădini şi podgorii,",
                            "verse 78:33": "fete cu sânul împlinit, lor însoţitoare,",
                            "verse 78:34": "pocale ce se revarsă.",
                            "verse 78:35": "Nu vor auzi acolo deşertăciuni ori minciuni.",
                            "verse 78:36": "Aceasta este răsplata de la Domnul tău, un dar bine socotit,",
                            "verse 78:37": "de la Domnul cerurilor şi al pământului şi a ceea ce este între ele; al Milostivului ce nimănui nu-i este dat să-i vorbească.",
                            "verse 78:38": "În Ziua când Duhul şi îngerii vor sta aşezaţi în rând nu vor vorbi decât cei cărora Milostivul le va îngădui şi vor spune doar ceea ce se cuvine.",
                            "verse 78:39": "Ziua aceea este Adevărul. Cel care vrea, va afla la Domnul său liman.",
                            "verse 78:40": "Noi v-am prevenit pe voi asupra apropiatei osânde din Ziua în care omul se va uita la ceea ce au făptuit mâinile sale şi când tăgăduitorul va zice: “Ce bine era de-aş fi fost ţărână!”"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "¿Por qué cosa se preguntan unos a otros?",
                            "verse 78:2": "Por la enorme Noticia,",
                            "verse 78:3": "acerca de la cual discrepan.",
                            "verse 78:4": "¡No! ¡Ya verán...!",
                            "verse 78:5": "¡No y no! ¡Ya verán...!",
                            "verse 78:6": "¿No hemos hecho de la tierra lecho",
                            "verse 78:7": "y de las montañas estacas?",
                            "verse 78:8": "Y os hemos creado por parejas,",
                            "verse 78:9": "hecho de vuestro sueño descanso,",
                            "verse 78:10": "de la noche vestidura,",
                            "verse 78:11": "del día medio de subsistencia.",
                            "verse 78:12": "Y hemos edificado encima de vosotros siete cielos firmes,",
                            "verse 78:13": "y colocado una lámpara resplandeciente.",
                            "verse 78:14": "Y hemos hecho bajar de las nubes un agua abundante",
                            "verse 78:15": "para, mediante ella, sacar grano, plantas",
                            "verse 78:16": "y frondosos jardines.",
                            "verse 78:17": "El día del Fallo está ya señalado.",
                            "verse 78:18": "Día en que se tocará la trompeta y acudiréis en masa.",
                            "verse 78:19": "El cielo se abrirá, todo puertas;",
                            "verse 78:20": "las montañas, puestas en marcha, serán espejismo.",
                            "verse 78:21": "La gehena, al acecho,",
                            "verse 78:22": "será refugio de los rebeldes,",
                            "verse 78:23": "que permanecerán en ella durante generaciones,",
                            "verse 78:24": "sin probar frescor ni bebida,",
                            "verse 78:25": "fuera de agua muy caliente y hediondo líquido,",
                            "verse 78:26": "retribución adecuada.",
                            "verse 78:27": "No contaban con el ajuste de cuentas",
                            "verse 78:28": "y desmintieron descaradamente Nuestros signos,",
                            "verse 78:29": "siendo así que habíamos consignado todo en una Escritura.",
                            "verse 78:30": "«¡Gustad, pues! ¡No haremos sino aumentaros el castigo!»",
                            "verse 78:31": "En cambio, a los temerosos de Alá se les deparará el éxito:",
                            "verse 78:32": "vergeles y viñedos,",
                            "verse 78:33": "de turgidos senos, de una misma edad,",
                            "verse 78:34": "copa desbordante.",
                            "verse 78:35": "No oirán allí vaniloquio, ni falsedad.",
                            "verse 78:36": "Es una retribución de tu Señor, regalo bien pensado",
                            "verse 78:37": "del Señor de los cielos, de la tierra y de lo que entre ellos está, del Compasivo, a Quien no podrán dirigir la palabra.",
                            "verse 78:38": "Día en que el Espíritu y los ángeles estarán de pie, en fila, sin hablar, excepto aquél a quien el Compasivo se lo permita y diga algo oportuno.",
                            "verse 78:39": "Ese será el día de la Verdad. El que quiera. encontrará refugio junto a su Señor.",
                            "verse 78:40": "Os hemos prevenido contra un castigo cercano, el día que el hombre medite en sus obras pasadas y diga el infiel: «¡Ojalá fuera yo tierra!»"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "எதைப்பற்றி அவர்கள் ஒருவருக்கொருவர் கேட்டுக்கொள்கின்றனர்?",
                            "verse 78:2": "மகத்தான அச்செய்தியைப் பற்றி,",
                            "verse 78:3": "எதைப்பற்றி அவர்கள் வேறுபட்(ட கருத்துக்கள் கொண்)டிருக்கிறார்களோ அதைப் பற்றி,",
                            "verse 78:4": "அவ்வாறன்று! அவர்கள் விரைவில் அறிந்துகொள்வார்கள்.",
                            "verse 78:5": "பின்னரும் (சந்தேகமின்றி) அவர்கள் விரைவிலேயே அறிந்துகொள்வார்கள்.",
                            "verse 78:6": "நாம் இப்பூமியை விரிப்பாக ஆக்கவில்லையா?",
                            "verse 78:7": "இன்னும், மலைகளை முளைகளாக ஆக்கவில்லையா?",
                            "verse 78:8": "இன்னும் உங்களை ஜோடி ஜோடியாகப் படைத்தோம்.",
                            "verse 78:9": "மேலும், உங்களுடைய தூக்கத்தை இளைப்பாறுதலாக ஆக்கினோம்.",
                            "verse 78:10": "அன்றியும், இரவை உங்களுக்கு ஆடையாக ஆக்கினோம்.",
                            "verse 78:11": "மேலும், பகலை உங்கள் வாழ்க்கை (வசதிகளைத் தேடிக்கொள்ளும் காலம்) ஆக்கினோம்.",
                            "verse 78:12": "உங்களுக்குமேல் பலமான ஏழுவானங்களை உண்டாக்கினோம்.",
                            "verse 78:13": "ஒளிவீசும் விளக்கை(சூரியனை)யும் (அங்கு) அமைத்தோம்.",
                            "verse 78:14": "அன்றியும், கார்மேகங்களிலிருந்து பொழியும் மழையையும் இறக்கினோம்.",
                            "verse 78:15": "அதைக் கொண்டு தானியங்களையும், தாவரங்களையும் நாம் வெளிப்படுத்துவதற்காக.",
                            "verse 78:16": "(கிளைகளுடன்) அடர்ந்த சோலைகளையும் (வெளிப்படுத்துவதற்காக).",
                            "verse 78:17": "நிச்சயமாகத் தீர்ப்புக்குரிய நாள், நேரங்குறிக்கப்பட்டதாகவே இருக்கிறது.",
                            "verse 78:18": "ஸூர் (எக்காளம்) ஊதப்படும் அந்நாளில் நீங்கள் அணிஅணியாக வருவீர்கள்.",
                            "verse 78:19": "இன்னும், வானம் திறக்கப்பட்டு பல வாசல்களாகிவிடும்.",
                            "verse 78:20": "மலைகள் பெயர்க்கப்பட்டு கானல் நீராகிவிடும்.",
                            "verse 78:21": "நிச்சயமாக நரகம் எதிர்பார்த்துக் கொண்டிருக்கின்றது.",
                            "verse 78:22": "வரம்பு மீறிவர்களுக்குத் தங்குமிடமாக.",
                            "verse 78:23": "அதில் அவர்கள் பல யுகங்களாகத் தங்கியிருக்கும் நிலையில்.",
                            "verse 78:24": "அவர்கள் அதில் குளிர்ச்சியையோ, குடிப்பையோ சுவைக்கமாட்டார்கள்.",
                            "verse 78:25": "கொதிக்கும் நீரையும் சீழையும் தவிர.",
                            "verse 78:26": "(அதுதான் அவர்களுக்குத்) தக்க கூலியாகும்.",
                            "verse 78:27": "நிச்சயமாக அவர்கள் கேள்வி கணக்கில் நம்பிக்கை கொள்ளாமலேயே இருந்தனர்.",
                            "verse 78:28": "அன்றியும் அவர்கள் நம் வசனங்களைப் பொய்யெனக் கூறி பொய்யாக்கிக் கொண்டிருந்தார்கள்.",
                            "verse 78:29": "நாம் ஒவ்வொரு பொருளையும் பதிவேட்டில் பதிவு செய்திருக்கின்றோம்.",
                            "verse 78:30": "\"ஆகவே சுவையுங்கள் - வேதனையைத் தவிர வேறு எதனையும் உங்களுக்கு நாம் அதிகப் படுத்த மாட்டோம்\" (என்று அவர்களுக்குக் கூறப்படும்).",
                            "verse 78:31": "நிச்சயமாக பயபக்தியுடையவர்களுக்கு வெற்றிப் பாக்கியம் இருக்கிறது.",
                            "verse 78:32": "தோட்டங்களும், திராட்சைப் பழங்களும்.",
                            "verse 78:33": "ஒரே வயதுள்ள கன்னிகளும்.",
                            "verse 78:34": "பானம் நிறைந்த கிண்ணங்களும், (இருக்கின்றன).",
                            "verse 78:35": "அங்கு அவர்கள் வீணானவற்றையும், பொய்ப்பித்தலையும் கேட்கமாட்டார்கள்.",
                            "verse 78:36": "(இது) உம்முடைய இறைவனிடமிருந்து (அளிக்கப் பெறும்) கணக்குப் படியான நன்கொடையாகும்.",
                            "verse 78:37": "(அவனே) வானங்களுக்கும், பூமிக்கும் அவ்விரண்டிற்கும் இடையேயுள்ள வற்றிற்கும் இறைவன்; அர்ரஹ்மான் - அவனிடம் பேச எவரும் அதிகாரம் பெறமாட்டார்கள்.",
                            "verse 78:38": "ரூஹு (என்ற ஜிப்ரயீலு)ம், மலக்குகளும் அணியணியாக நிற்கும் நாளில் அர்ரஹ்மான் எவருக்கு அனுமதி கொடுகிறானோ அவர்களைத் தவிர்த்து வேறெவரும் பேசமாட்டார்கள் - அ(த்தகைய)வரும் நேர்மையானதையே கூறுவார்.",
                            "verse 78:39": "அந்நாள் சத்தியமானது. ஆகவே, எவர் விரும்புகிறாரோ, அவர் தம் இறைவனிடம் தங்குமிடத்தை ஏற்படுத்திக் கொள்வாராக.",
                            "verse 78:40": "நிச்சயமாக, நெருங்கி வரும் வேதனையைப்பற்றி உங்களுக்கு எச்சரிக்கை செய்கிறோம் - மனிதன் தன் இருகைகளும் செய்து முற்படுத்தியவற்றை - அமல்களை - அந்நாளில் கண்டு கொள்வான் - மேலும் காஃபிர் \"அந்தோ கைசேதமே! நான் மண்ணாகிப் போயிருக்க வேண்டுமே!\" என்று (பிரலாபித்துக்) கூறுவான்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "พวกเขาต่างถามกันถึงเรื่องอะไร?",
                            "verse 78:2": "(ถาม) ถึงข่าวอันยิ่งใหญ่สำคัญ",
                            "verse 78:3": "ซึ่งเป็นข่าวที่พวกเขาขัดแย้งกันอยู่",
                            "verse 78:4": "เปล่าเลย พวกเขาจะได้รู้",
                            "verse 78:5": "แล้วก็เปล่าเลย พวกเขาจะได้รู้",
                            "verse 78:6": "เรามิได้ทำให้แผ่นดินเป็นพื้นราบดอกหรือ?",
                            "verse 78:7": "และมิได้ให้เทือกเขาเป็นหลักตรึงไว้ดอกหรือ?",
                            "verse 78:8": "และเราได้บังเกิดพวกเจ้าให้เป็นคู่ครองกัน",
                            "verse 78:9": "และเราได้ทำให้การนอนของพวกเจ้าเป็นการพักผ่อน",
                            "verse 78:10": "และเราได้ทำให้กลางคืนคล้ายเครื่องปกปิดร่างกาย",
                            "verse 78:11": "และเราได้ทำให้กลางวันเป็นที่แสวงหาเครื่องยังชีพ",
                            "verse 78:12": "และเราได้สร้างไว้เหนือพวกเจ้าสิ่งที่แข็งแรงทั้งเจ็ด (ชั้นฟ้า)",
                            "verse 78:13": "และเราได้ทำให้มีดวงประทีปหนึ่งมีแสงสว่างจ้า",
                            "verse 78:14": "และเราได้หลั่งน้ำลงมาอย่างมากมายจากเมฆฝน",
                            "verse 78:15": "เพื่อว่าเราจะให้งอกเงยด้วยน้ำนั้นซึ่งเมล็ดพืชและพืชผัก",
                            "verse 78:16": "และบรรดาเรือกสวนอันหนาแน่น",
                            "verse 78:17": "แท้จริงวันแห่งการตัดสินนั้นเป็นเวลาที่ถูกกำหนดไว้",
                            "verse 78:18": "วันที่แตรจะถูกเป่า แล้วพวกเจ้าก็จะมากันเป็นหมู่ ๆ",
                            "verse 78:19": "และชั้นฟ้าจะถูกเปิดออก แล้วก็จะมีประตูหลายบาน",
                            "verse 78:20": "และเทือกเขาจะถูกให้เคลื่อนออกไปแล้วก็กลายเป็นภาพลวง",
                            "verse 78:21": "แท้จริงนรกญะฮันนัมนั้นเป็นที่สอดส่อง",
                            "verse 78:22": "เป็นที่กลับไปสำหรับบรรดาผู้ละเมิด",
                            "verse 78:23": "พวกเขาจะพำนักอยู่ในนั้นเป็นเวลานาน",
                            "verse 78:24": "พวกเขาจะไม่ได้ลิ้มรสความเย็นและเครื่องดื่มใด ๆ ในนรกนั้น",
                            "verse 78:25": "นอกจากน้ำเดือดและน้ำเลือดน้ำหนองเท่านั้น",
                            "verse 78:26": "ทั้งนี้เป็นการตอบแทนอย่างคู่ควร",
                            "verse 78:27": "เพราะพวกเขามิได้หวังว่าจะมีการชำระสอบสวน",
                            "verse 78:28": "และพวกเขาปฏิเสธสัญญาณต่าง ๆ ของเราอย่างสิ้นเชิง",
                            "verse 78:29": "และทุก ๆ สิ่งนั้นเราได้จารึกมันไว้อย่างครบถ้วนในบันทึก",
                            "verse 78:30": "ดังนั้น พวกเจ้าจงลิ้มรส (การลงโทษ) เถิด เราจะไม่เพิ่มอันใดแก่พวกเจ้านอกจากการทรมานเท่านั้น",
                            "verse 78:31": "แท้จริงสำหรับบรรดาผู้ยำเกรงนั้นจะได้รับชัยชนะ",
                            "verse 78:32": "เรือกสวนหลากหลายและองุ่น",
                            "verse 78:33": "และบรรดาสาววัยรุ่นที่มีอายุคราวเดียวกัน",
                            "verse 78:34": "และแก้วที่มีเครื่องดื่มเต็มเปี่ยม",
                            "verse 78:35": "ในสวนสวรรค์นั้นพวกเขาจะไม่ได้ยินคำพูดไร้สาระและคำกล่าวเท็จ",
                            "verse 78:36": "ทั้งนี้เป็นการประทานให้อย่างพอเพียง",
                            "verse 78:37": "พระเจ้าแห่งชั้นฟ้าทั้งหลายและแผ่นดิน และสิ่งที่อยู่ในระหว่างทั้งสอง คือพระผู้ทรงกรุณาปรานี พวกเขาไม่มีอำนาจที่จะกล่าวคำพูดใด ๆ ต่อพระองค์",
                            "verse 78:38": "วันซึ่งญิบรีลและมลาอิกะฮ์จะยืนเป็นแถวเดียวกัน พวกเขาจะไม่พูด นอกจากผู้ที่พระผู้ทรงกรุณาปรานีทรงอนุญาตให้แก่เขา และเขาจะพูดแต่สิ่งที่ถูกต้องเท่านั้น",
                            "verse 78:39": "นั่นคือวันแห่งความจริง ดังนั้น ผู้ใดประสงค์ก็ให้เขายึดทางกลับไปสู่พระเจ้าของเขาเถิด",
                            "verse 78:40": "แท้จริงเราได้เตือนพวกเจ้าแล้วถึงการลงโทษอันใกล้ วันที่มนุษย์จะมองไปยังสิ่งที่สองมือของเขาได้ประกอบไว้ และผู้ปฏิเสธศรัทธาจะกล่าวว่า โอ้ถ้าฉันเป็นฝุ่นดินเสียก็จะดี"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 78:1": "Нима ҳақида сўрашади?",
                            "verse 78:2": "Улкан, муҳим хабар ҳақида (сўрашади).",
                            "verse 78:3": "Шундай хабарки, у(мушрик)лар) унинг ҳақида ихтилоф қиларлар.",
                            "verse 78:4": "Йўқ! Улар тезда биларлар!",
                            "verse 78:5": "Яна йўқ! Улар тезда биларлар! (Мушриклар азобни тортганларида қайта тирилиш нима эканлигини, унинг бўлиши ҳеч шубҳасиз ҳақ эканини албатта биладилар.)",
                            "verse 78:6": "Ерни тўшаб қўймадикми?",
                            "verse 78:7": "Ва тоғларни қозиқ (қилиб қўймадикми?).",
                            "verse 78:8": "Ва сизларни жуфт қилиб яратдик.",
                            "verse 78:9": "Ва уйқуларингизни роҳат қилиб қўйдик.",
                            "verse 78:10": "Ва кечасини либос қилиб қўйдик.",
                            "verse 78:11": "Ва кундузни тириклик қилдик.",
                            "verse 78:12": "Тепаларнгизга етти мустаҳкам (осмон)ни бино қилдик.",
                            "verse 78:13": "Ва шуъла таратувчи чироқ ҳам қилдик.",
                            "verse 78:14": "Ва сиқилган(булут)лардан оқувчи сувлар туширдик.",
                            "verse 78:15": "У(сув) билан дон ва наботот чиқаришимиз учун.",
                            "verse 78:16": "Ва дарахтлари бир-бирига киришган бўстонлар.",
                            "verse 78:17": "Албатта, ажрим куни вақти белгиланган эди.",
                            "verse 78:18": "У кунда сурга пуфланур ва сизлар тўп-тўп бўлиб келурсизлар.",
                            "verse 78:19": "Осмон ёрилиб, эшик-эшиклар очилур.",
                            "verse 78:20": "Тоғлар ўрнидан кўчирилиб, саробга айланур.",
                            "verse 78:21": "Албатта, жаҳаннам пойлаб турувчи эди.",
                            "verse 78:22": "Туғёнга кетганларга қайтар жойдир.",
                            "verse 78:23": "Улар унда замонлар бўйи қолувчилардир.",
                            "verse 78:24": "Улар унда совуқни ҳам, шаробни ҳам татий олмаслар.",
                            "verse 78:25": "Магар қайноқ сув ва йирингни (татирлар).",
                            "verse 78:26": "Мувофиқ жазо ўлароқ.",
                            "verse 78:27": "Чунки улар ҳисоб-китоб бўлишига ишонмасдилар.",
                            "verse 78:28": "Ва Бизнинг оятлариимизни ёлғон дейишган эди, ёлғон!.",
                            "verse 78:29": "Биз барча нарсани китобга жамлаб қўйганмиз.",
                            "verse 78:30": "Бас, татиб кўринглар, сизларга азобдан бошқа ҳеч нарсани зиёда қилмасмиз.",
                            "verse 78:31": "Албатта, тақводорларга ютуқ бордир:",
                            "verse 78:32": "Боғ-роғлар, узумзорлар бордир.",
                            "verse 78:33": "Ва янги бўйи етган бир хил ёшдаги қизлар бордир.",
                            "verse 78:34": "Ва тўлдирилган қадаҳлар бордир.",
                            "verse 78:35": "У ерда бекорчи гапларни ҳам, ёлғон гапларни ҳам эшитмаслар.",
                            "verse 78:36": "Роббингдан мукофот, совға ҳисобидандир.",
                            "verse 78:37": "У осмонлар, ер ва уларнинг орасидаги барча нарсаларнинг Роббиси, Роҳмандир, Унинг ҳузурида ҳеч ким хитоб қилишга қодир бўлмас.",
                            "verse 78:38": "Ўша кунда Руҳ ва фаришталар саф бўлиб турадир. Роҳман изн берганлар ва тўғри сўзлаганлардан ўзгалар гапира олмаслар.",
                            "verse 78:39": "У ҳақ кундир. Ким хоҳласа, ўз Роббисига қайтар йўл оладир.",
                            "verse 78:40": "Албатта, Биз сизларни яқин келажакдаги азобдан қўрқитдик. У кунда, ҳар киши (қўли) тақдим қилган нарсага назар соладир. Ва кофир «кошки тупроқ бўлиб кетсам»,–дейдир."
                        }
                    }
                }
            }
        }
    }
}