{
    "id": 79,
    "name_simple": "An-Nazi'at",
    "revelation_place": "makkah",
    "revelation_order": 81,
    "bismillah_pre": true,
    "verses_count": 46,
    "short_text": "It is derived from the word wan-nazi`at with which the Surah opens.",
    "text": [
        "\n",
        "It is derived from the word wan-nazi\\`at with which the Surah opens.",
        "\n",
        "Period of Revelation",
        "\n",
        "According to Hadrat Abdullah bin Abbas, this Surah was sent down after Surah An-Naba. Its subject matter also testifies that it belongs to the earliest period at Makkah.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme is affirmation of Resurrection and the life hereafter; It also warns of the consequences of belying the Messenger of God.",
        "\n",
        "The Surah opens with oaths sworn by the angels who take the soul at deaths and those who hasten to carryout Allah's Commands, and those who conduct the affairs of the universe according to Divine Will, to assure that the Resurrection will certainly come to pass and the second life after death will certainly take place. For the angels who are employed to pluck out the soul today can also be employed to restore the soul tomorrow, and the angels who promptly execute Allah's Commands and conduct the affairs of the universe today can also upset the order of the universe tomorrow by orders of the same God and can also bring about a new order.",
        "\n",
        "After this the people have been told, so as to say: \"This work which you regard as absolutely impossible, is not any difficult for Allah, for which He may have to make lengthy preparations. Just a single jolt will upset this system of the world and a second jolt will be enough to cause you to appear as living beings in the new world. At that time the same people who were wont to deny it, would be trembling with fear and seeing with awe struck eyes all that they thought was impossible.",
        "\n",
        "Then, relating the story of the Prophet Moses and Pharaoh briefly, the people have been warned to the effect: \"You know full well what fate the Pharaoh met in consequence of belying the Messenger and rejecting the guidance brought by him and endeavoring to defeat his mission by trickery and deceit. If you do not learn any lesson from it and do not change your ways and attitude accordingly, you also will have to meet the same fate.",
        "\n",
        "Then, in vv. 27-33, arguments have been given for the Hereafter and life after death. In this regard, the deniers have been asked the question:\"Is your resurrection a more difficult task or the creation of the huge Universe which spreads around you to infinite distances with myriads of its stars and planets? Your recreation cannot be difficult for the God for Whom this was an easy task. Thus, after presenting in a single sentence, a decisive argument for the possibility of the Hereafter, attention has been drawn to the earth and its provisions that have been arranged in it for the sustenance of man and animal and of which everything testifies that it has been created with great wisdom for fulfilling some special purpose. Pointing to this the question has been left for the intellect of man to ponder for itself and form the opinion whether calling man to account after having delegated authority and responsibilities to a creature like him in this wise system would be more in\r\nkeeping with the demands of wisdom, or that he should die after committing all sorts of misdeeds in the world and should perish and mix in the dust for ever and should never be called to account as to how he employed the authority and fulfilled the responsibilities entrusted to him. Instead of discussing this question, in vv. 34-41, it has been said: \"When the Hereafter is established, men's eternal future will be determined on the criterion as to which of them rebelled against his God transgressing the bounds of service and made the material benefits and pleasures his objective of life and which of them feared standing before his Lord and refrained from fulfilling the unlawful desires of the self.\" This by itself provides the right answer to the above question to every such person who considers it honestly, free from stubbornness. For the only rational, logical and moral demand of giving authority and entrusting responsibilities to man in the world is that he should be called to\r\naccount on this very basis ultimately and rewarded or punished accordingly.",
        "\n",
        "In conclusion, the question of the disbelievers of Makkah as to when Resurrection will take place, has been answered. They asked the Holy Prophet this question over and over again. In reply it has been said that the knowledge of the time of its occurrence rests with Allah alone. The Messenger is there only to give the warning that it will certainly come. Now whoever wishes may mend his ways, fearing its coming, and whoever wishes may behave and conduct himself as he likes, fearless of its coming. When the appointed time comes, those very people who loved the life of this world and regarded its pleasures as the only object of life, would feel that they had stayed in the world only for an hour or so. Then they will realize how utterly they had ruined their future for ever for the sake of the short lived pleasures of the world.",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that opens with the oath of the Divine One swearing by The Wresters, the angelic pullers, who shall harshly wrest out the souls of the unbelievers at their appointed time of death. It takes its name from “the wresters” (al-nāziʿāt) mentioned in verse 1. The main theme of the surah is the possibility and inevitability of the Resurrection, its results, and its timing. The story of Moses and Pharaoh acts as encouragement to the Prophet and a warning to the disbelievers.The surah is also known as: (Soul-)Snatchers, Extractors, The Angelic Pullers, The Forceful Chargers, The Pluckers, The Soul-Snatchers, Those That Rise, Those Who Pull and Withdraw, Those Who Tear Out.",
    "name_translation": "The Wresters",
    "name_complex": "An-Nâzi‘ât",
    "surah_name_ar": "النازعات",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 79:1": "Betohem në ata (engjëj) që i marrin shpirtërat ashpër (jombesimtarëve)",
                            "verse 79:2": "dhe në ata që i marrin butësisht (besimtarëve)",
                            "verse 79:3": "dhe në ata (engjëj) që notojnë në hapësirë (në mes Tokës e qiellit),",
                            "verse 79:4": "si dhe në ata (engjëj) që garojnë (për kryerjen e urdhërave),",
                            "verse 79:5": "dhe betohem në ata (engjëj) që i rregullojnë ato që nuk janë të rregulluara,",
                            "verse 79:6": "në Ditën kur Toka do të dridhet nga tërmeti,",
                            "verse 79:7": "ps të cilit pason tjetri. –",
                            "verse 79:8": "Atë ditë, zemrat do të jenë të tronditura,",
                            "verse 79:9": "e shikimet e tyre të përulura.",
                            "verse 79:10": "Ata (jobesimtarët) thonë: “A, me të vërtetë, do të kthehemi ne – në jetë (në gjendjen e mëparshme)?",
                            "verse 79:11": "A thua edhe kur të bëhemi eshtra të kalbur?”",
                            "verse 79:12": "E thonë: “E atëherë (të kthyerit), do të jemi të humbur.",
                            "verse 79:13": "E do të jetë ajo (ringjallja) vetëm një thirrje,",
                            "verse 79:14": "dhe, ja ata përnjëherësh (të gjallë) në Tokë.",
                            "verse 79:15": "A të ka ardhur ty (o Muhammed) lajmi për Musain,",
                            "verse 79:16": "kur Zoti i tij e ka thirrë atë në luginën e shenjtë të Tuvasë:",
                            "verse 79:17": "“Shko te Faraoni, se ai, me të vërtetë, është tërbuar,",
                            "verse 79:18": "dhe thuaj (Faraonit): ‘A don ti të pastrohesh (nga të këqiat),",
                            "verse 79:19": "dhe të udhëzoj te Zoti yt, që t’i druhesh (për të mos bërë të këqia)?",
                            "verse 79:20": "Dhe, ia tregoi (Musai-Faraonit) mrekullinë më të madhe,",
                            "verse 79:21": "por ai e mohoi dhe e kundërshtoi,",
                            "verse 79:22": "pastaj u kthye,",
                            "verse 79:23": "u përpoq dhe i tuboi njerëzit e thirri:",
                            "verse 79:24": "“Unë jam zoti juaj suprem (më i lartë)!",
                            "verse 79:25": "dhe, Perëndia, ia ekspozoi atij dënimin e kësaj bote dhe të botës tjetër.",
                            "verse 79:26": "Kjo është këshillë për ata që i druajnë Perëndisë.",
                            "verse 79:27": "E, çka është më vështirë: krijimi i juaj apo i qiellit? Ai e ka ndërtuar (qiellin),",
                            "verse 79:28": "lart e ka ngritur kupën e tij dhe e ka përsosur,",
                            "verse 79:29": "dhe netët e tij i ka bërë të errta, kurse ditët të ndritshme,",
                            "verse 79:30": "e pastaj e rrafshoi (shtriu) Tokën,",
                            "verse 79:31": "dhe nga ajo (toka) i nxorri ujërat dhe kullosat,",
                            "verse 79:32": "dhe malet i bëri të palëvizshme (i forcoi)",
                            "verse 79:33": "për gjallërinë tuaj dhe të bagëtive tuaja.",
                            "verse 79:34": "E, kur të arrijë vështirësia më e madhe,",
                            "verse 79:35": "Dita kur njeriu e kujton atë çka ka punuar,",
                            "verse 79:36": "dhe i tregohet skëterra çdokujt që sheh,",
                            "verse 79:37": "atëherë, ai që ka qenë kërcënues,",
                            "verse 79:38": "dhe e ka preferuar (dashtë më shumë) jetën e kësaj bote,",
                            "verse 79:39": "pë te, me të vërtetë, vendbanim është skëterra.",
                            "verse 79:40": "Kurse, ai që i druan madhërisë së Zotit të tij dhe e frenon vete nga epshet,",
                            "verse 79:41": "me të vërtetë, vendbanim i tij është xhenneti.",
                            "verse 79:42": "Të pyesin ty për Kijametin: “Kur do të ndodhë?”",
                            "verse 79:43": "Cka ka rëndësi për ty ta përmendësh atë?!",
                            "verse 79:44": "Vetëm Zoti yt di për te.",
                            "verse 79:45": "Ti je vetëm paralajmërues i atyre që i druajnë atij (Kijametit);",
                            "verse 79:46": "kurse, atë ditë, që do ta shohin atë (Kijametin), atyre do t’u duket se kanë qëndruar në këtë botë, vetëm një mbrëmje apo një mëngjes (të asaj mbrëmjeje)."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "And olsun (kafirlərin canını) zorla alanlara;",
                            "verse 79:2": "And olsun (mö'minlərin canını) rahatlıqla alanlara;",
                            "verse 79:3": "And olsun sür'ətlə üzənlərə;",
                            "verse 79:4": "And olsun (bir-birini) ötdükcə ötənlərə;",
                            "verse 79:5": "And olsun işə əncam çəkənlərə (Allahın əmri ilə dünyanın işlərini idarə edən mələklərə ki, qiyamət haqdır və siz qiyamət günü dirilib haqq-hesab üçün Allahın hüzurunda duracaqsınız)!",
                            "verse 79:6": "O gün sarsılan sarsılacaq (surun birinci üfürülməsi ilə yer, göy lərzəyə gələcək),",
                            "verse 79:7": "Onun ardınca bir sarsıntı da olacaqdır! (Sur ikinci dəfə üfürüləcəkdir. İsrafil suru birinci dəfə çaldıqda hər şey məhv olacaq, ikinci dəfə çaldıqda isə hamı diriləcəkdir. Bunların arası dünya vaxtı ilə müqayisədə qırx il çəkəcəkdir).",
                            "verse 79:8": "O gün ürəklər qorxub titrəyəcək,",
                            "verse 79:9": "Gözləri (o ürəklərin sahib olduğu gözlər dəhşətdən) zəlilcəsinə yerə dikiləcəkdir.",
                            "verse 79:10": "(Qiyaməti inkar edən kafirlər dünyada istehza ilə) deyirlər: \"Doğrudanmı biz (öləndən sonra dirilib) əvvəlki vəziyyətimizə qaytarılacağıq?!",
                            "verse 79:11": "?zü də çürümüş sümüklər olduğumuz zamanmı?!\"",
                            "verse 79:12": "Onlar deyirlər: \"Elə isə bu ziyanlı dönüşdür (çünki onun arxasında şiddətli bir əzab durur).",
                            "verse 79:13": "(Ey kafirlər! Bu, Allah üçün çətin deyildir). Doğrudan da, o (surun axırıncı dəfə çalınması) ancaq tək bir dəhşətli səsdir (nə'rədir)!",
                            "verse 79:14": "Onlar dərhal (qəbirlərindən çıxıb) dümdüz bir yerdə olacaqlar!",
                            "verse 79:15": "(Ya Peyğəmbər!) Musanın hekayəti (söhbəti) sənə gəlib çatdımı?",
                            "verse 79:16": "O zaman ki, Rəbbi ona müqəddəs Tuva vadisində belə xitab etdi:",
                            "verse 79:17": "\"Fir'onun yanına get. Cünki o, (allahlıq iddiasına düşməklə, xalqa zülm etməklə) çox azmışdır (həddini aşmışdır).",
                            "verse 79:18": "Və de: \"(Günahlardan) təmizlənmək istəyirsənmi?",
                            "verse 79:19": "Səni Rəbbinə tərəf gətirimmi ki, (Ondan) qorxasan?\"",
                            "verse 79:20": "(Musa gəlib Allahın buyuruğunu Fir'ona ərz elədi) və ona (özünün həqiqi peyğəmbər olmasına dəlalət edən) ən böyük mö'cüzəni (əsanın dönüb əjdaha olmasını) göstərdi.",
                            "verse 79:21": "Lakin (Fir'on Musanı) təkzib edib (ona) asi oldu.",
                            "verse 79:22": "Sonra geri dönüb (özünə buyurulanlardan üz döndərərək fitnə-fəsad törətməyə, Musaya qarşı tədbir tökməyə) tələsdi.",
                            "verse 79:23": "Və (ə'yan-əşrafını, bütün təbəələrini) toplayıb (onlara) belə xitab etdi:",
                            "verse 79:24": "\"Həqiqətən, mən sizin ən uca Rəbbinizəm!\"",
                            "verse 79:25": "Allah da onu axirət və dünya əzabına giriftar etdi. (Yaxud: Allah ona axırıncı və əvvəlinci sözlərinin cəzasını verdi).",
                            "verse 79:26": "Şübhəsiz ki, bunda (Allahdan) qorxan kimsələr üçün ibrət dərsi vardır.",
                            "verse 79:27": "(Ey kafirlər!) Sizi yaratmaq çətindir, yoxsa göyü ki (Allah) onu yaratdı;",
                            "verse 79:28": "Qübbəsini ucaltdı, düzəldib nizama saldı;",
                            "verse 79:29": "Gecəsini qaranlıq, gündüzünü işıqlı etdi?!",
                            "verse 79:30": "Bundan sonra da yeri döşəyib (yayıb) düzəltdi (üstündə gəzmək və yaşamaq üçün onu yararlı hala saldı).",
                            "verse 79:31": "Ondan suyunu və otlağını çıxartdı.",
                            "verse 79:32": "(Orada) dağları yerləşdirdi.",
                            "verse 79:33": "(Bütün bunlar) sizin və heyvanlarınızın istifadəsi üçündür.",
                            "verse 79:34": "O böyük bəla (qiyamət) gələndə,",
                            "verse 79:35": "O gün insan nələr etdiyini (dünyadakı bütün yaxşı, pis əməllərini) yadına salacaqdır.",
                            "verse 79:36": "Cəhənnəm də hər görənə görünəcəkdir.",
                            "verse 79:37": "Kim (dünyada) azğınlıq etmişsə,",
                            "verse 79:38": "Dünyanı (axirətdən) üstün tutmuşsa,",
                            "verse 79:39": "Şübhəsiz ki, onun məskəni Cəhənnəmdir!",
                            "verse 79:40": "Amma kim (qiyamət günü) Rəbbinin hüzurunda durmaqdan qorxmuş və nəfsinə istəyini (şəfvəti) qadağan etmişsə,",
                            "verse 79:41": "Həqiqətən, onun yurdu Cənnətdir!",
                            "verse 79:42": "(Ya Peyğəmbər! Müşriklər) səndən o saatın nə vaxt gələcəyi (qiyamətin nə vaxt qopacağı) barəsində soruşarlar.",
                            "verse 79:43": "Sən onu (onun vaxtını) nə bilirsən?!",
                            "verse 79:44": "Onu sonuna qədər (bütün təfərrüatı ilə) bilmək ancaq sənin Rəbbinə məxsusdur.",
                            "verse 79:45": "Sən ancaq ondan (qiyamətdən) xəbərdar edib çəkindirənsən!",
                            "verse 79:46": "Onu (qiyaməti) gördükləri gün (dünyada və ya qəbir evində) yalnız bir axşam, yaxud bir səhər qaldıqlarını sanacaqlar!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "Tako Mi onih koji čupaju grubo,",
                            "verse 79:2": "i onih koji vade blago,",
                            "verse 79:3": "i onih koji plove brzo",
                            "verse 79:4": "pa naređenja izvršavaju žurno",
                            "verse 79:5": "i sređuju ono što nije sređeno...",
                            "verse 79:6": "na Dan kada se Zemlja potresom zatrese,",
                            "verse 79:7": "za kojim će slijediti sljedeći -",
                            "verse 79:8": "srca toga dana biće uznemirena,",
                            "verse 79:9": "a pogledi njihovi oboreni.",
                            "verse 79:10": "Ovi pitaju: \"Zar ćemo, zaista, biti opet ono što smo sada?",
                            "verse 79:11": "Zar kad truhle kosti postanemo?\",",
                            "verse 79:12": "i još kažu: \"E tada bismo mi bili izgubljeni!\"",
                            "verse 79:13": "A biće to samo povik jedan,",
                            "verse 79:14": "i evo njih - na Zemlji.",
                            "verse 79:15": "Da li je do tebe doprla vijest o Musau,",
                            "verse 79:16": "kad ga je Gospodar njegov u svetoj dolini Tuva zovnuo,",
                            "verse 79:17": "Idi faraonu, on se osilio,",
                            "verse 79:18": "i reci: ’Da li bi ti da se očistiš,",
                            "verse 79:19": "da te o Gospodaru tvome poučim, pa da Ga se bojiš?’\"",
                            "verse 79:20": "I onda mu je najveće čudo pokazao,",
                            "verse 79:21": "ali je on porekao i nije poslušao,",
                            "verse 79:22": "već se okrenuo i potrudio",
                            "verse 79:23": "i sabrao",
                            "verse 79:24": "Ja sam gospodar vaš najveći! - on je rekao,",
                            "verse 79:25": "i Allah ga je i za ove i za one prijašnje riječi kaznio.",
                            "verse 79:26": "To je pouka za onoga koji se bude Allaha bojao.",
                            "verse 79:27": "A šta je teže: vas ili nebo stvoriti? On ga je sazdao,",
                            "verse 79:28": "svod njegov visoko digao i usavršio,",
                            "verse 79:29": "noći njegove mračnim, a dane svjetlim učinio.",
                            "verse 79:30": "Poslije toga je Zemlju poravnao,",
                            "verse 79:31": "iz nje je vodu i pašnjake izveo,",
                            "verse 79:32": "i planine nepomičnim učinio -",
                            "verse 79:33": "na uživanje vama i stoci vašoj.",
                            "verse 79:34": "A kada dođe nevolja najveća,",
                            "verse 79:35": "Dan kada se čovjek bude sjećao onoga što je radio",
                            "verse 79:36": "i kada se Džehennem svakome ko vidi bude ukazao,",
                            "verse 79:37": "onda će onome koji je obijestan bio",
                            "verse 79:38": "i život na ovome svijetu više volio",
                            "verse 79:39": "Džehennem prebivalište postati sigurno.",
                            "verse 79:40": "A onome koji je pred dostojanstvom Gospodara svoga strepio i dušu od prohtjeva uzdržao",
                            "verse 79:41": "Džennet će boravište biti sigurno.",
                            "verse 79:42": "Pitaju te o Smaku svijeta: \"Kada će se dogoditi?\"",
                            "verse 79:43": "Ti ne znaš, pa kako da o njemu zboriš,",
                            "verse 79:44": "o njemu samo Gospodar tvoj zna.",
                            "verse 79:45": "Tvoja opomena će koristiti samo onome koji ga se bude bojao,",
                            "verse 79:46": "a njima će se učiniti, onoga Dana kada ga dožive, da su samo jedno večer ili jedno jutro njezino ostali."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "শপথ সেই ফেরেশতাগণের, যারা ডুব দিয়ে আত্মা উৎপাটন করে,",
                            "verse 79:2": "শপথ তাদের, যারা আত্মার বাঁধন খুলে দেয় মৃদুভাবে;",
                            "verse 79:3": "শপথ তাদের, যারা সন্তরণ করে দ্রুতগতিতে,",
                            "verse 79:4": "শপথ তাদের, যারা দ্রুতগতিতে অগ্রসর হয় এবং",
                            "verse 79:5": "শপথ তাদের, যারা সকল কর্মনির্বাহ করে, কেয়ামত অবশ্যই হবে।",
                            "verse 79:6": "যেদিন প্রকম্পিত করবে প্রকম্পিতকারী,",
                            "verse 79:7": "অতঃপর পশ্চাতে আসবে পশ্চাদগামী;",
                            "verse 79:8": "সেদিন অনেক হৃদয় ভীত-বিহবল হবে।",
                            "verse 79:9": "তাদের দৃষ্টি নত হবে।",
                            "verse 79:10": "তারা বলেঃ আমরা কি উলটো পায়ে প্রত্যাবর্তিত হবই-",
                            "verse 79:11": "গলিত অস্থি হয়ে যাওয়ার পরও?",
                            "verse 79:12": "তবে তো এ প্রত্যাবর্তন সর্বনাশা হবে!",
                            "verse 79:13": "অতএব, এটা তো কেবল এক মহা-নাদ,",
                            "verse 79:14": "তখনই তারা ময়দানে আবির্ভূত হবে।",
                            "verse 79:15": "মূসার বৃত্তান্ত আপনার কাছে পৌছেছে কি?",
                            "verse 79:16": "যখন তার পালনকর্তা তাকে পবিত্র তুয়া উপ্যকায় আহবান করেছিলেন,",
                            "verse 79:17": "ফেরাউনের কাছে যাও, নিশ্চয় সে সীমালংঘন করেছে।",
                            "verse 79:18": "অতঃপর বলঃ তোমার পবিত্র হওয়ার আগ্রহ আছে কি?",
                            "verse 79:19": "আমি তোমাকে তোমার পালনকর্তার দিকে পথ দেখাব, যাতে তুমি তাকে ভয় কর।",
                            "verse 79:20": "অতঃপর সে তাকে মহা-নিদর্শন দেখাল।",
                            "verse 79:21": "কিন্তু সে মিথ্যারোপ করল এবং অমান্য করল।",
                            "verse 79:22": "অতঃপর সে প্রতিকার চেষ্টায় প্রস্থান করল।",
                            "verse 79:23": "সে সকলকে সমবেত করল এবং সজোরে আহবান করল,",
                            "verse 79:24": "এবং বললঃ আমিই তোমাদের সেরা পালনকর্তা।",
                            "verse 79:25": "অতঃপর আল্লাহ তাকে পরকালের ও ইহকালের শাস্তি দিলেন।",
                            "verse 79:26": "যে ভয় করে তার জন্যে অবশ্যই এতে শিক্ষা রয়েছে।",
                            "verse 79:27": "তোমাদের সৃষ্টি অধিক কঠিন না আকাশের, যা তিনি নির্মাণ করেছেন?",
                            "verse 79:28": "তিনি একে উচ্চ করেছেন ও সুবিন্যস্ত করেছেন।",
                            "verse 79:29": "তিনি এর রাত্রিকে করেছেন অন্ধকারাচ্ছন্ন এবং এর সূর্যোলোক প্রকাশ করেছেন।",
                            "verse 79:30": "পৃথিবীকে এর পরে বিস্তৃত করেছেন।",
                            "verse 79:31": "তিনি এর মধ্য থেকে এর পানি ও ঘাম নির্গত করেছেন,",
                            "verse 79:32": "পর্বতকে তিনি দৃঢ়ভাবে প্রতিষ্ঠিত করেছেন,",
                            "verse 79:33": "তোমাদের ও তোমাদের চতুস্পদ জন্তুদের উপকারার্থে।",
                            "verse 79:34": "অতঃপর যখন মহাসংকট এসে যাবে।",
                            "verse 79:35": "অর্থাৎ যেদিন মানুষ তার কৃতকর্ম স্মরণ করবে",
                            "verse 79:36": "এবং দর্শকদের জন্যে জাহান্নাম প্রকাশ করা হবে,",
                            "verse 79:37": "তখন যে ব্যক্তি সীমালংঘন করেছে;",
                            "verse 79:38": "এবং পার্থিব জীবনকে অগ্রাধিকার দিয়েছে,",
                            "verse 79:39": "তার ঠিকানা হবে জাহান্নাম।",
                            "verse 79:40": "পক্ষান্তরে যে ব্যক্তি তার পালনকর্তার সামনে দন্ডায়মান হওয়াকে ভয় করেছে এবং খেয়াল-খুশী থেকে নিজেকে নিবৃত্ত রেখেছে,",
                            "verse 79:41": "তার ঠিকানা হবে জান্নাত।",
                            "verse 79:42": "তারা আপনাকে জিজ্ঞাসা করে, কেয়ামত কখন হবে?",
                            "verse 79:43": "এর বর্ণনার সাথে আপনার কি সম্পর্ক ?",
                            "verse 79:44": "এর চরম জ্ঞান আপনার পালনকর্তার কাছে।",
                            "verse 79:45": "যে একে ভয় করে, আপনি তো কেবল তাকেই সতর্ক করবেন।",
                            "verse 79:46": "যেদিন তারা একে দেখবে, সেদিন মনে হবে যেন তারা দুনিয়াতে মাত্র এক সন্ধ্যা অথবা এক সকাল অবস্থান করেছে।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 79:1": "Кълна се в изтръгващите [душите] с все сила",
                            "verse 79:2": "и в изваждащите [ги] нежно,",
                            "verse 79:3": "и в спускащите се бързо,",
                            "verse 79:4": "и в гонещите се в надпревара,",
                            "verse 79:5": "и в изпълняващите повелите!",
                            "verse 79:6": "В Деня, когато [се протръби с първия Рог] ще се разтърси тресящата се ,",
                            "verse 79:7": "ще последва второто .",
                            "verse 79:8": "Някои сърца в този Ден ще тръпнат.",
                            "verse 79:9": "Погледите им ще бъдат сведени.",
                            "verse 79:10": "Ще кажат: Нима ще бъдем върнати към предишното,",
                            "verse 79:11": "нима, след като бяхме прогнили кости?",
                            "verse 79:12": "Ще кажат: Това тогава е завръщане със загуба.",
                            "verse 79:13": "То е само едно протръбяване -",
                            "verse 79:14": "и ето всички - възкръснали!",
                            "verse 79:15": "[О, Мухаммад], стигна ли до теб разказът за Муса?",
                            "verse 79:16": "Когато неговият Господ го призова в свещената долина Туа:",
                            "verse 79:17": "Иди при Фараона! Той престъпи.",
                            "verse 79:18": "И кажи: Не ще ли се пречистиш,",
                            "verse 79:19": "да те напътя към твоя Господ и да се побоиш?",
                            "verse 79:20": "И му показа [Муса] най-голямото знамение.",
                            "verse 79:21": "И взе го за лъжа, и се възпротиви.",
                            "verse 79:22": "После се отвърна с упорство.",
                            "verse 79:23": "И насъбра [хората си], и прогласи.",
                            "verse 79:24": "Каза: Аз съм вашият господ, върховният.",
                            "verse 79:25": "И Аллах го сграбчи с наказание в отвъдния и в земния живот.",
                            "verse 79:26": "В това има поучение за всеки богобоязлив.",
                            "verse 79:27": "Вие ли сте по-трудни за сътворяване или небето? Той го съгради.",
                            "verse 79:28": "Въздигна неговия свод и го изравни,",
                            "verse 79:29": "и потъмни нощта му, и изведе утрото му,",
                            "verse 79:30": "и земята след това разпростря.",
                            "verse 79:31": "Извади от нея водите и пасбищата й,",
                            "verse 79:32": "и планините поби",
                            "verse 79:33": "за ползване от вас и от вашия добитък.",
                            "verse 79:34": "И когато настъпи Голямото прииждане,",
                            "verse 79:35": "тогава в Деня човек ще си припомни за какво се е старал,",
                            "verse 79:36": "и Адът ще бъде показан на всеки, който вижда...",
                            "verse 79:37": "За който е престъпвал",
                            "verse 79:38": "и е предпочел земния живот,",
                            "verse 79:39": "обиталището е Адът.",
                            "verse 79:40": "За който се е страхувал да не застане пред своя Господ [с грях] и е въздържал душата от страстта,",
                            "verse 79:41": "обиталището е Раят.",
                            "verse 79:42": "Питат те [о, Мухаммад] за Часа: Кога ще настъпи?",
                            "verse 79:43": "Какво [знание имаш] ти да го споменеш?",
                            "verse 79:44": "При твоя Господ е пределът му.",
                            "verse 79:45": "Ти си само предупредител за всеки, който се страхува от него.",
                            "verse 79:46": "В Деня, когато го видят, те сякаш ще са пребивавали само една привечер или утрин."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "誓以急掣的，",
                            "verse 79:2": "輕曳的，",
                            "verse 79:3": "奔馳的，",
                            "verse 79:4": "先驅的，",
                            "verse 79:5": "決策的，",
                            "verse 79:6": "當震動者震動，",
                            "verse 79:7": "而續髮者續髮之日，",
                            "verse 79:8": "在那日，許多心將忐忑不安，",
                            "verse 79:9": "許多眼將不敢仰視。",
                            "verse 79:10": "他們說：「我們必定復元嗎？",
                            "verse 79:11": "那是在我們已變成朽骨的時候嗎？」",
                            "verse 79:12": "他們說：「然則，那是一次虧折的復原。」",
                            "verse 79:13": "那只是一次吼聲，",
                            "verse 79:14": "他們忽然在地面之上。",
                            "verse 79:15": "穆薩的故事已來臨你了嗎？",
                            "verse 79:16": "當時，他的主，曾在聖谷杜洼中召喚他說：",
                            "verse 79:17": "「你到法老那裡去吧！他確是悖逆的。",
                            "verse 79:18": "你對他說：『你願意成為純潔的人嗎？",
                            "verse 79:19": "你願意我引導你認識你的主，而你畏懼他嗎？』」",
                            "verse 79:20": "他把那最大的跡象昭示了法老，",
                            "verse 79:21": "但他否認，而且違抗。",
                            "verse 79:22": "然後，他轉身而奔走。",
                            "verse 79:23": "於是，召集民眾，而且喊叫，",
                            "verse 79:24": "說：「我是你們的至尊的主。」",
                            "verse 79:25": "故真主以後世和今世的刑罰懲治他。",
                            "verse 79:26": "對於畏懼的人們，此中確有一種鑒戒。",
                            "verse 79:27": "你們是更難造的呢？還是天是更難造的呢？他曾建造了天，",
                            "verse 79:28": "他升起它的高度，而成全它的形體，",
                            "verse 79:29": "他使它的夜間黑暗，並顯出它的光明。",
                            "verse 79:30": "此後，他將地面展開，",
                            "verse 79:31": "他使地面涌出泉水來，生出植物來。",
                            "verse 79:32": "他使山巒穩定，",
                            "verse 79:33": "以便你們和你們的牲畜獲得享受。",
                            "verse 79:34": "大難來臨的時候，",
                            "verse 79:35": "就是人將記起自己所作的善惡，",
                            "verse 79:36": "火獄將為能見的人顯露出來的日子。",
                            "verse 79:37": "悖逆",
                            "verse 79:38": "而且選擇今世生活的人，",
                            "verse 79:39": "火獄必為他的歸宿。",
                            "verse 79:40": "至於怕站在主的御前受審問，並戒除私慾的人，",
                            "verse 79:41": "樂園必為他的歸宿。",
                            "verse 79:42": "他們問你復活時在什麼時候實現，",
                            "verse 79:43": "你怎能說明它呢？",
                            "verse 79:44": "惟有你的主能知它的究竟。",
                            "verse 79:45": "你的警告只有裨於畏懼它的人，",
                            "verse 79:46": "他們在見它的那日，好像在墳裡只逗留過一朝或一夕。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "Při silou vytrhujících,",
                            "verse 79:2": "při čile prohánějících,",
                            "verse 79:3": "při plavně se nesoucích,",
                            "verse 79:4": "při usilovně se předbíhajících,",
                            "verse 79:5": "při rozkazy uspořádávajících!",
                            "verse 79:6": "V den, kdy rozezní se znějící",
                            "verse 79:7": "a přijde po ní následující,",
                            "verse 79:8": "v ten den se všechna srdce rozbuší",
                            "verse 79:9": "a zraky jejich se hanbou zkruší!",
                            "verse 79:10": "Říkají: \"Což vskutku budeme vráceni v stav původní,",
                            "verse 79:11": "až staneme se kostmi zpráchnivělými?\"",
                            "verse 79:12": "A připojí: \"To věru návrat byl by záhubný!\"",
                            "verse 79:13": "A ozve se jen zvuk jediný,",
                            "verse 79:14": "a hle, octnou se bdící na zemi!",
                            "verse 79:15": "Zdaž donesla se ti o Mojžíšovi zpráva,",
                            "verse 79:16": "když Pán jeho naň zavolal v údolí posvátném Tuwá:",
                            "verse 79:17": "K Faraónovi se vydej, neb on věru zpupným se projevil,",
                            "verse 79:18": "a rci mu: \"Což se nepatří, aby ses očistil",
                            "verse 79:19": "a já abych tě dovedl k Pánu tvému a ty se Ho bál?\"",
                            "verse 79:20": "A znamení největší mu ukázal,",
                            "verse 79:21": "však ten za lež je prohlásil a neposlušný byl,",
                            "verse 79:22": "pak zády se otočil a pryč pospíšil",
                            "verse 79:23": "a lidi své si shromáždil a pak prohlásil:",
                            "verse 79:24": "Já vaším pánem jsem nejvyšším!",
                            "verse 79:25": "A učinil jej Bůh na onom i tomto světě trestem varovným,",
                            "verse 79:26": "a pro toho, kdo naplněn je bázní, to věru bude poučením!",
                            "verse 79:27": "Jste obtížnější pro stvoření vy, anebo nebe? On je vystavěl,",
                            "verse 79:28": "v klenbu je vyzvedl a vhodně vyrovnal,",
                            "verse 79:29": "temnotou noc jeho zahalil a jasu dennímu z něho vzejít dal",
                            "verse 79:30": "a zemi posléze rozprostřel,",
                            "verse 79:31": "a aby voda i pastviny na ní vzešly, způsobil",
                            "verse 79:32": "a také hory tam zakotvil,",
                            "verse 79:33": "aby užitek v tom pro vás i vaše stáda byl.",
                            "verse 79:34": "A až nadejde ten převrat nesmírný",
                            "verse 79:35": "v den, kdy člověk si vzpomene na všechno své snažení,",
                            "verse 79:36": "tehdy předvedeno bude peklo tomu, kdo uvidí.",
                            "verse 79:37": "Ti, kdož vzpurní byli",
                            "verse 79:38": "a život pozemský si oblíbili,",
                            "verse 79:39": "těm věru peklo za útulek připravili.",
                            "verse 79:40": "Však ten, jenž postavení Pána svého se bál a duši svou před vášní spasil,",
                            "verse 79:41": "ten věru v zahradě rajské svůj bude mít azyl.",
                            "verse 79:42": "Budou se tě na Hodinu, a kdy má nastat, ptát;",
                            "verse 79:43": "proč ty máš se vlastně o ní zmiňovat?",
                            "verse 79:44": "Vždyť Pánu tvému patří lhůta její konečná!",
                            "verse 79:45": "Ty jen varovatelem jsi toho, jenž obavu z ní má.",
                            "verse 79:46": "A v den, kdy spatří ji, bude se jim zdát, jako by v hrobech svých víc než večer či jitro nestrávili."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "Bij hen die zich volledig inspannen,",
                            "verse 79:2": "En bij hen die hun werk met vreugde verrichten,",
                            "verse 79:3": "En bij hen die snelle vorderingen maken.",
                            "verse 79:4": "En bij hen die de eersten willen zijn",
                            "verse 79:5": "En bij hen die de zaak regelen.",
                            "verse 79:6": "De Dag waarop de bevende (aarde) zal beven,",
                            "verse 79:7": "Hierop zal volgen, wat volgen moet.",
                            "verse 79:8": "Op die Dag zullen de harten kloppen.",
                            "verse 79:9": "En de ogen zullen nedergeslagen zijn.",
                            "verse 79:10": "Zij (de ongelovigen) zeggen: \"Zullen wij werkelijk tot onze vroegere toestand worden teruggebracht,",
                            "verse 79:11": "Zelfs al zijn wij vergane beenderen geworden?\"",
                            "verse 79:12": "Zij zeggen: \"Dan zou deze opstanding een ondergang zijn.\"",
                            "verse 79:13": "Daar is slechts één dreigende roep.",
                            "verse 79:14": "En ziet, zij zijn opgewekt.",
                            "verse 79:15": "Heeft het verhaal van Mozes u niet bereikt?",
                            "verse 79:16": "Toen zijn Heer hem in het heilige dal van Towa toeriep, (zeggende):",
                            "verse 79:17": "\"Ga naar Pharao; want hij is opstandig.",
                            "verse 79:18": "En zeg tot hem: Zoudt gij u willen reinigen?",
                            "verse 79:19": "En ik zal u tot uw Heer leiden opdat gij Hem moogt vrezen.\"",
                            "verse 79:20": "Toen toonde hij hem (Pharao) het grote teken,",
                            "verse 79:21": "Maar deze verwierp het en gehoorzaamde niet;",
                            "verse 79:22": "Maar wendde zich daarna haastig af.",
                            "verse 79:23": "En hij (Pharao) verzamelde de zijnen en riep uit:",
                            "verse 79:24": "(Zeggende), \"Ik ben uw Heer de Allerhoogste.\"",
                            "verse 79:25": "Daarop greep God hem aan met een voorbeeldige straf voor de toekomst en voor die tijd.",
                            "verse 79:26": "Waarlijk daarin is een les voor hem die vreest.",
                            "verse 79:27": "Zijt gij moeilijker te scheppen dan de hemel die Hij heeft gebouwd?",
                            "verse 79:28": "Hij verhief hem hoog en maakte hem volmaakt.",
                            "verse 79:29": "En Hij maakte de nacht donker en bracht het daglicht voort;",
                            "verse 79:30": "En ook de aarde spreidde hij uit.",
                            "verse 79:31": "Daaruit bracht Hij water en weide voort.",
                            "verse 79:32": "En Hij maakte de bergen onwrikbaar.",
                            "verse 79:33": "Een voorziening voor u en voor uw vee.",
                            "verse 79:34": "Maar als de grote ramp zal komen,",
                            "verse 79:35": "De Dag waarop de mens zich zal herinneren hetgeen hij heeft gedaan,",
                            "verse 79:36": "En de hel zal zichtbaar gemaakt worden voor hem die ziet.",
                            "verse 79:37": "Dan zal (voor hem) die opstandig is geweest,",
                            "verse 79:38": "En die het leven dezer wereld verkoos,",
                            "verse 79:39": "Brandend Vuur zijn tehuis zijn.",
                            "verse 79:40": "Doch voor hem die vreesde voor zijn Heer te staan, en die zijn ziel van begeerten onthield,",
                            "verse 79:41": "Zal het paradijs zeker zijn verblijf zijn.",
                            "verse 79:42": "Zij vragen u omtrent het Uur: \"Wanneer zal het komen?\"",
                            "verse 79:43": "Maar datgene waarmede gij u bezighoudt",
                            "verse 79:44": "De uitkomst daarvan is bij uw Heer.",
                            "verse 79:45": "Gij zijt slechts een waarschuwer voor hem die vreest.",
                            "verse 79:46": "Op de dag waarop zij dit zullen zien, (zal het zijn) alsof zij slechts een avond of een morgen (op de aarde) hadden vertoefd."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 79:1": "By those who drag forth to destruction,",
                            "verse 79:2": "By the meteors rushing,",
                            "verse 79:3": "By the lone stars floating,",
                            "verse 79:4": "By the angels hastening,",
                            "verse 79:5": "And those who govern the event,",
                            "verse 79:6": "On the day when the first trump resoundeth.",
                            "verse 79:7": "And the second followeth it,",
                            "verse 79:8": "On that day hearts beat painfully",
                            "verse 79:9": "While eyes are downcast",
                            "verse 79:10": "(Now) they are saying: Shall we really be restored to our first state",
                            "verse 79:11": "Even after we are crumbled bones ?",
                            "verse 79:12": "They say: Then that would be a vain proceeding.",
                            "verse 79:13": "Surely it will need but one shout,",
                            "verse 79:14": "And lo! they will be awakened.",
                            "verse 79:15": "Hath there come unto thee the history of Moses ?",
                            "verse 79:16": "How his Lord called him in the holy vale of Tuwa,",
                            "verse 79:17": "(Saying:) Go thou unto Pharaoh - Lo! he hath rebelled -",
                            "verse 79:18": "And say (unto him): Hast thou (will) to grow (in grace) ?",
                            "verse 79:19": "Then I will guide thee to thy Lord and thou shalt fear (Him).",
                            "verse 79:20": "And he showed him the tremendous token.",
                            "verse 79:21": "But he denied and disobeyed,",
                            "verse 79:22": "Then turned he away in haste,",
                            "verse 79:23": "Then gathered he and summoned",
                            "verse 79:24": "And proclaimed: \"I (Pharaoh) am your Lord the Highest.\"",
                            "verse 79:25": "So Allah seized him (and made him) an example for the after (life) and for the former.",
                            "verse 79:26": "Lo! herein is indeed a lesson for him who feareth.",
                            "verse 79:27": "Are ye the harder to create, or is the heaven that He built ?",
                            "verse 79:28": "He raised the height thereof and ordered it;",
                            "verse 79:29": "And He made dark the night thereof, and He brought forth the morn thereof.",
                            "verse 79:30": "And after that He spread the earth,",
                            "verse 79:31": "And produced therefrom the water thereof and the pasture thereof,",
                            "verse 79:32": "And He made fast the hills,",
                            "verse 79:33": "A provision for you and for your cattle.",
                            "verse 79:34": "But when the great disaster cometh,",
                            "verse 79:35": "The day when man will call to mind his (whole) endeavour,",
                            "verse 79:36": "And hell will stand forth visible to him who seeth,",
                            "verse 79:37": "Then, as for him who rebelled",
                            "verse 79:38": "And chose the life of the world,",
                            "verse 79:39": "Lo! hell will be his home.",
                            "verse 79:40": "But as for him who feared to stand before his Lord and restrained his soul from lust,",
                            "verse 79:41": "Lo! the Garden will be his home.",
                            "verse 79:42": "They ask thee of the Hour: when will it come to port ?",
                            "verse 79:43": "Why (ask they) ? What hast thou to tell thereof ?",
                            "verse 79:44": "Unto thy Lord belongeth (knowledge of) the term thereof.",
                            "verse 79:45": "Thou art but a warner unto him who feareth it.",
                            "verse 79:46": "On the day when they behold it, it will be as if they had but tarried for an evening or the morn thereof."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 79:1": "By the (angels) who tear out (the souls of the wicked) with violence;",
                            "verse 79:2": "By those who gently draw out (the souls of the blessed);",
                            "verse 79:3": "And by those who glide along (on errands of mercy),",
                            "verse 79:4": "Then press forward as in a race,",
                            "verse 79:5": "Then arrange to do (the Commands of their Lord),",
                            "verse 79:6": "One Day everything that can be in commotion will be in violent commotion,",
                            "verse 79:7": "Followed by oft-repeated (commotions):",
                            "verse 79:8": "Hearts that Day will be in agitation;",
                            "verse 79:9": "Cast down will be (their owners’) eyes.",
                            "verse 79:10": "They say (now): \"What! shall we indeed be returned to (our) former state?",
                            "verse 79:11": "\"What! - when we shall have become rotten bones?\"",
                            "verse 79:12": "They say: \"It would, in that case, be a return with loss!\"",
                            "verse 79:13": "But verily, it will be but a single (Compelling) Cry,",
                            "verse 79:14": "When, behold, they will be in the (full) awakening (to Judgment).",
                            "verse 79:15": "Has the story of Moses reached thee?",
                            "verse 79:16": "Behold, thy Lord did call to him in the sacred valley of Tuwa:-",
                            "verse 79:17": "\"Go thou to Pharaoh for he has indeed transgressed all bounds:",
                            "verse 79:18": "\"And say to him, ’Wouldst thou that thou shouldst be purified (from sin)?-",
                            "verse 79:19": "\"’And that I guide thee to thy Lord, so thou shouldst fear Him?’\"",
                            "verse 79:20": "Then did (Moses) show him the Great Sign.",
                            "verse 79:21": "But (Pharaoh) rejected it and disobeyed (guidance);",
                            "verse 79:22": "Further, he turned his back, striving hard (against God).",
                            "verse 79:23": "Then he collected (his men) and made a proclamation,",
                            "verse 79:24": "Saying, \"I am your Lord, Most High\".",
                            "verse 79:25": "But God did punish him, (and made an) example of him, - in the Hereafter, as in this life.",
                            "verse 79:26": "Verily in this is an instructive warning for whosoever feareth (God).",
                            "verse 79:27": "What! Are ye the more difficult to create or the heaven (above)? (God) hath constructed it:",
                            "verse 79:28": "On high hath He raised its canopy, and He hath given it order and perfection.",
                            "verse 79:29": "Its night doth He endow with darkness, and its splendour doth He bring out (with light).",
                            "verse 79:30": "And the earth, moreover, hath He extended (to a wide expanse);",
                            "verse 79:31": "He draweth out therefrom its moisture and its pasture;",
                            "verse 79:32": "And the mountains hath He firmly fixed;-",
                            "verse 79:33": "For use and convenience to you and your cattle.",
                            "verse 79:34": "Therefore, when there comes the great, overwhelming (Event),-",
                            "verse 79:35": "The Day when man shall remember (all) that he strove for,",
                            "verse 79:36": "And Hell-Fire shall be placed in full view for (all) to see,-",
                            "verse 79:37": "Then, for such as had transgressed all bounds,",
                            "verse 79:38": "And had preferred the life of this world,",
                            "verse 79:39": "The Abode will be Hell-Fire;",
                            "verse 79:40": "And for such as had entertained the fear of standing before their Lord’s (tribunal) and had restrained (their) soul from lower desires,",
                            "verse 79:41": "Their abode will be the Garden.",
                            "verse 79:42": "They ask thee about the Hour,-’When will be its appointed time?",
                            "verse 79:43": "Wherein art thou (concerned) with the declaration thereof?",
                            "verse 79:44": "With thy Lord in the Limit fixed therefor.",
                            "verse 79:45": "Thou art but a Warner for such as fear it.",
                            "verse 79:46": "The Day they see it, (It will be) as if they had tarried but a single evening, or (at most till) the following morn!"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 79:1": "By those that pluck out vehemently",
                            "verse 79:2": "and those that draw out violently,",
                            "verse 79:3": "by those that swim serenely",
                            "verse 79:4": "and those that outstrip suddenly",
                            "verse 79:5": "by those that direct an affair!",
                            "verse 79:6": "Upon the day when the first blast shivers",
                            "verse 79:7": "and the second blast follows it,",
                            "verse 79:8": "hearts upon that day shall be athrob",
                            "verse 79:9": "and their eyes shall be humbled.",
                            "verse 79:10": "They shall say, ’What, are we being restored as we were before?",
                            "verse 79:11": "What, when we are bones old and wasted?’",
                            "verse 79:12": "They shall say, ’That then were a losing return!’",
                            "verse 79:13": "But it shall be only a single scare,",
                            "verse 79:14": "and behold, they are awakened.",
                            "verse 79:15": "Hast thou received the story of Moses?",
                            "verse 79:16": "When his Lord called to him in the holy valley, Towa:",
                            "verse 79:17": "’Go to Pharaoh; he has waxed insolent.",
                            "verse 79:18": "And say, \"Hast thou the will to purify thyself;",
                            "verse 79:19": "and that I should guide thee to thy Lord, then thou shalt fear?\"’",
                            "verse 79:20": "So he showed him the great sign,",
                            "verse 79:21": "but he cried lies, and rebelled,",
                            "verse 79:22": "then he turned away hastily,",
                            "verse 79:23": "then he mustered",
                            "verse 79:24": "and proclaimed, and he said, ’I am your Lord, the Most High!’",
                            "verse 79:25": "So God seized him with the chastisement of the Last World and the First.",
                            "verse 79:26": "Surely in that is a lesson for him who fears!",
                            "verse 79:27": "What, are you stronger in constitution or the heaven He built?",
                            "verse 79:28": "He lifted up its vault, and levelled it,",
                            "verse 79:29": "and darkened its night, and brought forth its forenoon;",
                            "verse 79:30": "and the earth-after that He spread it out,",
                            "verse 79:31": "therefrom brought forth its waters and its pastures,",
                            "verse 79:32": "and the mountains He set firm,",
                            "verse 79:33": "an enjoyment for you and your flocks.",
                            "verse 79:34": "Then, when the Great Catastrophe comes",
                            "verse 79:35": "upon the day when man shall remember what he has striven,",
                            "verse 79:36": "and Hell is advanced for whoever sees,",
                            "verse 79:37": "then as for him who was insolent",
                            "verse 79:38": "and preferred the present life,",
                            "verse 79:39": "surely Hell shall be the refuge.",
                            "verse 79:40": "But as for him who feared the Station of his Lord and forbade the soul its caprice,",
                            "verse 79:41": "surely Paradise shall be the refuge.",
                            "verse 79:42": "They will question thee concerning the Hour, when it shall berth.",
                            "verse 79:43": "What art thou about, to mention it?",
                            "verse 79:44": "Unto thy Lord is the final end of it.",
                            "verse 79:45": "Thou art only the warner of him who fears it.",
                            "verse 79:46": "It shall be as if; on the day they see it, they have but tarried for an evening, or its forenoon."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 79:1": "CONSIDER those [stars] that rise only to set,",
                            "verse 79:2": "and move [in their orbits] with steady motion,",
                            "verse 79:3": "and float [through space] with floating serene,",
                            "verse 79:4": "and yet overtake [one another] with swift overtaking:",
                            "verse 79:5": "and thus they fulfil the [Creator’s] behest!",
                            "verse 79:6": "[HENCE, think of] the Day when a violent convulsion will convulse [the world],",
                            "verse 79:7": "to be followed by further !",
                            "verse 79:8": "On that Day will [men’s] hearts be throbbing,",
                            "verse 79:9": "[and] their eyes downcast....",
                            "verse 79:10": "[And yet,] some say, \"What! Are we indeed to be restored to our former state –",
                            "verse 79:11": "even though we may have become [a heap of] crumbling bones?\"",
                            "verse 79:12": "[And] they add, \"That, then, would be a return with loss!\"",
                            "verse 79:13": "[But,] then, that [Last Hour] will be [upon them of a sudden, as if it were] but a single accusing cry –",
                            "verse 79:14": "and then, lo, they will be fully awakened [to the truth]!",
                            "verse 79:15": "HAS THE STORY of Moses ever come within thy ken?",
                            "verse 79:16": "Lo! His Sustainer called out to him in the twice-hallowed valley:",
                            "verse 79:17": "\"Go unto Pharaoh – for, verily, he has transgressed all bounds of what is right –",
                            "verse 79:18": "and say [unto him], ‘Art thou desirous of attaining to purity?",
                            "verse 79:19": "[If so,] then I shall guide thee towards [a cognition of] thy Sustainer, so that [henceforth] thou wilt stand in awe [of Him].’\"",
                            "verse 79:20": "And thereupon he [went to Pharaoh and] made him aware of the great wonder [of God’s grace].",
                            "verse 79:21": "But [Pharaoh] gave him the lie and rebelliously rejected [all guidance],",
                            "verse 79:22": "and brusquely turned his back [on Moses];",
                            "verse 79:23": "and then he gathered [his great ones], and called [unto his people],",
                            "verse 79:24": "and said, \"I am your Lord All-Highest!\"",
                            "verse 79:25": "And thereupon God took him to task, [and made him] a warning example in the life to come as well as in this world.",
                            "verse 79:26": "In this, behold, there is a lesson indeed for all who stand in awe [of God].",
                            "verse 79:27": "[O MEN!] Are you more difficult to create than the heaven which He has built?",
                            "verse 79:28": "High has He reared its vault and formed it in accordance with what it was meant to be;",
                            "verse 79:29": "and He has made dark its night and brought forth its light of day.",
                            "verse 79:30": "And after that, the earth: wide has He spread its expanse,",
                            "verse 79:31": "and has caused its waters to come out of it, and its pastures,",
                            "verse 79:32": "and has made the mountains firm:",
                            "verse 79:33": "[all this] as a means of livelihood for you and your animals.",
                            "verse 79:34": "AND SO, when the great, overwhelming event [of resurrection] comes to pass –",
                            "verse 79:35": "on that Day man will [clearly] remember all that he has ever wrought;",
                            "verse 79:36": "and the blazing fire [of hell] will be laid open before all who [are destined to] see it.",
                            "verse 79:37": "For unto him who shall have transgressed the bounds of what is right,",
                            "verse 79:38": "and preferred the life of this world [to the good of his soul],",
                            "verse 79:39": "that blazing fire will truly be the goal!",
                            "verse 79:40": "But unto him who shall have stood in fear of his Sustainer’s Presence, and held back his inner self from base desires,",
                            "verse 79:41": "paradise will truly be the goal!",
                            "verse 79:42": "THEY WILL ASK thee [O Prophet] about the Last Hours: \"When will it come to pass?\"",
                            "verse 79:43": "[But] how couldst thou tell anything about it,",
                            "verse 79:44": "[seeing that] with thy Sustainer alone rests the beginning and the end [of all knowledge] thereof?",
                            "verse 79:45": "Thou art but [sent] to warn those who stand in awe of it.",
                            "verse 79:46": "On the Day when they behold it, [it will seem to them] as if they had tarried [in this world] no longer than one evening or [one night, ending with] its morn!"
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "Fix": ""
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 79:1": "I swear by those (angels) who pull out (the souls of the infidels) with extreme force,",
                            "verse 79:2": "and by those (angels) who untie the knot (of the souls of the believers) smoothly,",
                            "verse 79:3": "and by those who float (in the atmosphere) swiftly,",
                            "verse 79:4": "then proceed forward quickly,",
                            "verse 79:5": "then manage (to do) everything (they are ordered to do,)",
                            "verse 79:6": "(you will be resurrected) on the Day when the shocking event (i.e. the first blowing of the trumpet) will shock (everything),",
                            "verse 79:7": "followed by the next one (i.e. the second blowing of the trumpet.)",
                            "verse 79:8": "On that day, hearts (of people) will be throbbing,",
                            "verse 79:9": "with their eyes downcast.",
                            "verse 79:10": "They (the infidels) say, “Are we going to be brought back to our former state (of Life)?",
                            "verse 79:11": "Is it when we are turned into decayed bones?”",
                            "verse 79:12": "They say, “If so, that will be a harmful homecoming.”",
                            "verse 79:13": "In fact, it will be only a single harsh voice,",
                            "verse 79:14": "and in no time they will be (brought) into the plain (of Hashr).",
                            "verse 79:15": "Has there come to you the narrative about Mūsā?",
                            "verse 79:16": "(Recall) when his Lord called to him in the blessed valley of Tuwā:",
                            "verse 79:17": "“Go to Fir‘aun (Pharaoh). Indeed, he has crossed all bounds.",
                            "verse 79:18": "And say (to him,) ‘Would you like to purify yourself,",
                            "verse 79:19": "and that I should guide you to your Lord, so that you fear (Him)?’”",
                            "verse 79:20": "So, he (Mūsā) showed him the biggest sign.",
                            "verse 79:21": "But he rejected and disobeyed,",
                            "verse 79:22": "then he turned back, and tried hard (to refute the Messenger),",
                            "verse 79:23": "then he gathered (his people) and shouted",
                            "verse 79:24": "and said, “I am your supreme lord.”",
                            "verse 79:25": "So, Allah seized him for an exemplary punishment in the Hereafter and the present world.",
                            "verse 79:26": "Indeed, there is a lesson for him who fears (Allah).",
                            "verse 79:27": "Is your creation more difficult or that of the sky? He has built it,",
                            "verse 79:28": "He has raised its height, then made it proper,",
                            "verse 79:29": "and darkened its night, and brought forth its daylight,",
                            "verse 79:30": "and, after that, He spread out the earth.",
                            "verse 79:31": "From it, He brought out its water and its meadows,",
                            "verse 79:32": "and firmly fixed the mountains,",
                            "verse 79:33": "(all this) as a benefit to you and your cattle.",
                            "verse 79:34": "So when the Greatest Havoc will take place",
                            "verse 79:35": "on the day when man will recall what he did,",
                            "verse 79:36": "and the Hell will be exposed for all who see,",
                            "verse 79:37": "then for the one who had rebelled,",
                            "verse 79:38": "and preferred the worldly life (to the Hereafter),",
                            "verse 79:39": "the Hell will be the abode,",
                            "verse 79:40": "whereas for the one who feared to stand before his Lord, and restrained his self from the (evil) desire,",
                            "verse 79:41": "the Paradise will be the abode.",
                            "verse 79:42": "They ask you (O Prophet,) about the Hour (the Day of Judgment) as to when it will take place.",
                            "verse 79:43": "In which capacity are you to tell this?",
                            "verse 79:44": "With your Lord is the final word about it.",
                            "verse 79:45": "You are only a warner for anyone who fears it.",
                            "verse 79:46": "The day they will see it, it will seem to them as if they did not live (in the world) but only for one afternoon or for the morning thereof."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 79:1": "By those that wrest violently;",
                            "verse 79:2": "by those that draw out gently;",
                            "verse 79:3": "by those that glide serenely;",
                            "verse 79:4": "by those that race forward;",
                            "verse 79:5": "and by those that direct the affair:",
                            "verse 79:6": "the day when the Tremor quakes,",
                            "verse 79:7": "and is followed by the Aftershock;",
                            "verse 79:8": "on that day hearts will be trembling,",
                            "verse 79:9": "their eyes humbled.",
                            "verse 79:10": "They will say: ‘Are we indeed being restored as before?",
                            "verse 79:11": "What! When we have been decayed bones?’",
                            "verse 79:12": "They will say, ‘That then would be a ruinous return!’",
                            "verse 79:13": "But it will be only a single blast:",
                            "verse 79:14": "behold, then, they will be upon the surface of the earth.",
                            "verse 79:15": "Have you received the story of Moses,",
                            "verse 79:16": "when his Lord called out to him in the holy valley of Tuwā?",
                            "verse 79:17": "‘Go to Pharaoh; he has indeed become rebellious,",
                            "verse 79:18": "and say, “Would you purify yourself",
                            "verse 79:19": "and allow me to guide you to your Lord so that you may have fear [of Him]?” ’",
                            "verse 79:20": "So he showed him the greatest sign.",
                            "verse 79:21": "But he denied and disobeyed.",
                            "verse 79:22": "Then he turned his back, going about in haste.",
                            "verse 79:23": "Then he gathered, and proclaimed,",
                            "verse 79:24": "and said, ‘I am your most high lord!’",
                            "verse 79:25": "So God seized him as punishment for the latter and for the former.",
                            "verse 79:26": "Assuredly in that there is a moral for him who fears.",
                            "verse 79:27": "Are you harder to create or the heaven which He has built?",
                            "verse 79:28": "He made it rise high and levelled it,",
                            "verse 79:29": "and darkened its night, and brought forth its day;",
                            "verse 79:30": "and after that He spread out the earth;",
                            "verse 79:31": "from it He has brought forth its waters and its pastures,",
                            "verse 79:32": "and has set firm the mountains",
                            "verse 79:33": "as a [source of] sustenance for you and your flocks.",
                            "verse 79:34": "So when the Greatest Catastrophe befalls,",
                            "verse 79:35": "the day when man will remember his efforts,",
                            "verse 79:36": "and the Hell-fire is revealed for all to see:",
                            "verse 79:37": "as for him who was rebellious,",
                            "verse 79:38": "and preferred the life of this world,",
                            "verse 79:39": "Hell-fire will indeed be the abode.",
                            "verse 79:40": "But as for him who feared the stance before his Lord, and forbade the soul from [pursuing] desire,",
                            "verse 79:41": "Paradise will indeed be the abode.",
                            "verse 79:42": "They will ask you about the Hour: when will it set in?",
                            "verse 79:43": "What have you to do with the mention of it?",
                            "verse 79:44": "With your Lord it belongs ultimately.",
                            "verse 79:45": "You are only a warner for the one who fears it.",
                            "verse 79:46": "The day they see it, it will be as if they had only tarried for an evening or the morning thereof."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 79:1": "By the (angels) who violently snatch out (the souls of the disbelievers from each tendon and ligament of their body), Or By the waves of energy that pierce into matter and break up the chemical bonds fiercely,",
                            "verse 79:2": "And by the (angels) who unweave sinews (of the believers’ organisms) gently and peacefully, Or By the waves of energy that disintegrate gently and peacefully the chemical bonds within matter,",
                            "verse 79:3": "And by the (angels) who swiftly glide (between the heavens and the earth), Or By the waves of energy that move around freely in space and atmosphere,",
                            "verse 79:4": "Then by the (angels) who with burst of speed sprint past others, Or By the waves of energy that surpass other waves in speed, force and assimilation,",
                            "verse 79:5": "Then by the (angels) who manage different affairs well, Or By the waves of energy that, through mutual dynamism and coordination, maintain equilibrium and keep the balance of the management going for the survival of the system of the universe,",
                            "verse 79:6": "(When they will be commanded to devastate the system of the universe) that Day, everything in motion (in the universe) will tremor into violent convulsion,",
                            "verse 79:7": "Chased by a succeeding convulsion.",
                            "verse 79:8": "That Day, hearts (of the people) will pound with agony and terror.",
                            "verse 79:9": "Their eyes will be downcast (with dread and horror).",
                            "verse 79:10": "The disbelievers say: ‘Shall we be reverted to the former life?",
                            "verse 79:11": "(Shall we be given life even) when we shall have become rotten (hollow) bones?’",
                            "verse 79:12": "They say: ‘This (return) would then be a losing return.’",
                            "verse 79:13": "Then it will be rending (of all heavenly bodies) asunder with single extremely horrible explosion.",
                            "verse 79:14": "Then they (all) will forgather suddenly in the open expanse (for assembly).",
                            "verse 79:15": "Has the account of Musa (Moses) reached you?",
                            "verse 79:16": "When His Lord called out to him in the sacred valley of Tuwa,",
                            "verse 79:17": "(And commanded:) ‘Go to Pharaoh. He has transgressed all bounds.’",
                            "verse 79:18": "Then say (to him): ‘Do you wish that you should be purified?",
                            "verse 79:19": "And (do you desire that) I guide you to your Lord so that you may fear (Him)?’",
                            "verse 79:20": "Then Musa (Moses) showed him the great sign.",
                            "verse 79:21": "But he denied it and disobeyed.",
                            "verse 79:22": "Then, turning away (from the truth), he launched struggle (in rivalry against Musa ).",
                            "verse 79:23": "So he gathered (people) and started calling out,",
                            "verse 79:24": "And said: ‘I am your lord, most high.’",
                            "verse 79:25": "Then Allah seized him in (dual) punishment of this world and the Hereafter.",
                            "verse 79:26": "Surely, in this (incident) there is a great lesson of warning for him who fears (Allah).",
                            "verse 79:27": "Is it you who are harder to create, or (the entire) galactic universe that He has built?",
                            "verse 79:28": "He raised high all the heavenly spheres (planets, after creating them in the infinite cosmos), then moderated, equipoised and stabilized (their composition, construction, functions and movements).",
                            "verse 79:29": "And He is the One Who blackened the night of heavenly space (i.e., darkened the entire spatial environment like a murky night) and emitted (after creating) the light of these (planets from this space).",
                            "verse 79:30": "And He is the One Who, later, (after the creation of the planet sun) separated (from it) the earth, flung it with centrifugal force (and spread its expanse to make it inhabitable).",
                            "verse 79:31": "He is the One Who drew water from the earth (separately), and brought forth its vegetable kingdom (from the rest of the dry regions).",
                            "verse 79:32": "And He is the One Who (putting together different elements) raised from the earth firmly fixed mountains.",
                            "verse 79:33": "(He did all this) for the benefit of you and your livestock.",
                            "verse 79:34": "Then, whilst (the universe) attains (to its acme through evolution), there will befall the great all-encompassing calamity (the Hour of Resurrection).",
                            "verse 79:35": "That Day man will retrospect his (every) effort and action.",
                            "verse 79:36": "And Hell will be made manifest to everyone who can see.",
                            "verse 79:37": "Then he who transgressed the limits,",
                            "verse 79:38": "And preferred the life of the world (to the Hereafter),",
                            "verse 79:39": "Hell will truly be (his) abode.",
                            "verse 79:40": "But as for him who feared standing in the presence of his Lord and forbade (his ill-commanding) self its appetites and lusts,",
                            "verse 79:41": "Paradise will surely be (his) abode.",
                            "verse 79:42": "(The disbelievers) ask you about the Hour of Rising: ‘When will it come to pass?’",
                            "verse 79:43": "What should be your concern in talking about (its appointed time)?",
                            "verse 79:44": "Its ultimate limit is up to your Lord (i.e., as in the beginning, only Oneness will survive in the end as well).",
                            "verse 79:45": "You are but a Warner to him who fears it.",
                            "verse 79:46": "So the Day when they will see it, they (will feel as if they) did not tarry (in the world) but for one evening or one morning."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "Niiden nimessä, jotka kaikin voimin (jousiaan) jännittävät,",
                            "verse 79:2": "niiden (nuolten), jotka vinhasti eteenpäin syöksyvät,",
                            "verse 79:3": "niiden (ratsujen), jotka nopeasti laukkaavat,",
                            "verse 79:4": "ja jotka ensimmäisinä kiitävät,",
                            "verse 79:5": "sekä vihdoin niiden (johtajaan), jotka voiton turvaavat.",
                            "verse 79:6": "Sinä päivänä, jolloin järkkyvä maa järkkyy",
                            "verse 79:7": "ja se tapahtuu, minkä tuleman pitää,",
                            "verse 79:8": "sinä päivänä sydämet vavahtavat",
                            "verse 79:9": "ja katseet painuvat alas.",
                            "verse 79:10": "He arvelevat: »Palautetaanko meidät todella entiseen tilaamme?",
                            "verse 79:11": "Kuinka! Kun jo luummekin ovat lahonneet!»",
                            "verse 79:12": "He sanovat: »Sellainen paluu olisi turmiota tuottava.»",
                            "verse 79:13": "Mutta kaikki muuttuu pelkäksi huudoksi",
                            "verse 79:14": "ja katso, he heräävät!",
                            "verse 79:15": "Eikö teille julistettu sanomaa Mooseksesta?",
                            "verse 79:16": "Kuinka hänen Herransa kahdesti kutsui häntä pyhässä laaksossa:",
                            "verse 79:17": "»Mene faraon luo! Hän on totisesti synteihin vaipunut.",
                            "verse 79:18": "Ja sano: 'Tahdotko puhdistua?",
                            "verse 79:19": "Minä johdan sinut Herrasi luo, jotta pelkäisit Häntä.'»",
                            "verse 79:20": "Ja hän näytti faraolle suuren tunnusmerkin,",
                            "verse 79:21": "mutta tämä hylkäsi totuuden eikä totellut.",
                            "verse 79:22": "Sitten käänsi hän hänelle äkkiä selkänsä,",
                            "verse 79:23": "kokosi joukon ihmisiä ja huusi heille",
                            "verse 79:24": "sanoen: »Minä olen teidän ylin herranne.»",
                            "verse 79:25": "Silloin Jumala yllätti hänet rangaisten sekä tässä että tulevassa elämässä.",
                            "verse 79:26": "Totisesti on tässä varoittava esimerkki sille, joka pelkää Jumalaa.",
                            "verse 79:27": "Kumpi on vaikeampi luoda, teidät vai taivas, jonka Hän on rakentanut?",
                            "verse 79:28": "Hän on sen korkealle kohottanut ja sille muodon antanut:",
                            "verse 79:29": "yöksi Hän täyttää sen pimeydellä, ja siitä hän vetää taas esiin päivänvalon.",
                            "verse 79:30": "Ja sitten hän ulotti maan avaraksi",
                            "verse 79:31": "ja kohotti sen vedet pinnalle sekä levitti laitumet;",
                            "verse 79:32": "vuoret Hän sijoitti lujasti paikoilleen,",
                            "verse 79:33": "kaiken tämän teidän ja karjanne hyväksi.",
                            "verse 79:34": "Mutta kun valtava tuhon päivä tulee,",
                            "verse 79:35": "päivä, jona ihminen muistaa, mitä hän on tavoitellut,",
                            "verse 79:36": "ja helvetti paljastuu näkeväiselle,",
                            "verse 79:37": "silloin se, joka väärintekijä on",
                            "verse 79:38": "ja pitää parempana maallista elämää,",
                            "verse 79:39": "saa totisesti helvetin asunnokseen.",
                            "verse 79:40": "Mutta se, joka pelkää Herransa tulemista ja hillitsee sielunsa alhaiset himot,",
                            "verse 79:41": "saa totisesti paratiisin asunnokseen.",
                            "verse 79:42": "Tuota hetkeä he kysyvät sinulta; milloin sen pitää tuleman?",
                            "verse 79:43": "Mutta kuinka voit sen sanoa?",
                            "verse 79:44": "Onhan sen tulo Herrasi käsissä.",
                            "verse 79:45": "Sinä olet vain varoittaja jokaiselle, joka sitä kavahtaa.",
                            "verse 79:46": "Päivänä, jolloin he saavat nähdä sen, on heistä kuin he olisivat odottaneet sitä vain illan tai aamun."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 79:1": "Par ceux qui arrachent avec violence,",
                            "verse 79:2": "Par ceux qui s'activent avec soin,",
                            "verse 79:3": "Par ceux qui nagent avec rapidité,",
                            "verse 79:4": "Par ceux qui prennent les devants",
                            "verse 79:5": "et mettent en oeuvre le décret !",
                            "verse 79:6": "Le Jour où surviendra la première commotion,",
                            "verse 79:7": "suivie d'une seconde,",
                            "verse 79:8": "ce jour-là les cœurs seront saisis de crainte,",
                            "verse 79:9": "et leurs yeux humblement baissés.",
                            "verse 79:10": "Ils diront : \" Est-il vrai que nous serons ramenés à notre état antérieur",
                            "verse 79:11": "alors même que nous serons des ossements décharnés ? \"",
                            "verse 79:12": "\" Ce serait un retour désastreux ! \", diront-ils encore.",
                            "verse 79:13": "Mais il suffira que retentisse un seul cri",
                            "verse 79:14": "pour qu'ils se retrouvent éveillés.",
                            "verse 79:15": "T'est-elle parvenue, l'histoire de Moïse",
                            "verse 79:16": "lorsque son Seigneur l'appela dans la vallée sainte de Tuwa ?",
                            "verse 79:17": "\" Va trouver Pharaon, qui est vraiment rebelle,",
                            "verse 79:18": "et dis-lui : \" Es-tu disposé à te purifier,",
                            "verse 79:19": "à ce que je te guide vers ton Seigneur et que tu Le craignes ? \"",
                            "verse 79:20": "Puis il lui montra le signe majeur.",
                            "verse 79:21": "Mais Pharaon cria au mensonge et s'insurgea ;",
                            "verse 79:22": "puis il tourna précipitamment le dos.",
                            "verse 79:23": "Il fit rassembler des hommes et lança une proclamation,",
                            "verse 79:24": "disant : \" Je suis votre souverain suprême ! \"",
                            "verse 79:25": "Dieu lui infligea alors le tourment de l'Au-delà et de l'Ici-bas.",
                            "verse 79:26": "Certes, il y a là un enseignement pour quiconque éprouve la crainte.",
                            "verse 79:27": "A-t-il été plus difficile de vous créer que de créer le ciel ? Il l'a édifié,",
                            "verse 79:28": "Il en a élevé la voûte et Il l'a ordonné harmonieusement.",
                            "verse 79:29": "Il a assombri sa nuit et a fait luire sa clarté matinale.",
                            "verse 79:30": "La terre, ensuite, Il l'a étendue.",
                            "verse 79:31": "Il a fait surgir son eau et ses pâturages.",
                            "verse 79:32": "Il a solidement amarré les montagnes",
                            "verse 79:33": "pour votre bien-être et celui de vos troupeaux.",
                            "verse 79:34": "Lorsque surviendra le grand cataclysme,",
                            "verse 79:35": "le Jour où l'homme se souviendra de ce qu'il s'efforçait d'atteindre",
                            "verse 79:36": "et où la Fournaise se montrera aux yeux de tous,",
                            "verse 79:37": "alors, pour celui qui se sera révolté,",
                            "verse 79:38": "pour celui qui aura donné la préférence à la vie de ce monde,",
                            "verse 79:39": "la Fournaise sera un refuge.",
                            "verse 79:40": "Mais pour celui qui aura redouté de comparaître devant son Seigneur et qui aura préservé son âme de la passion,",
                            "verse 79:41": "c'est le Paradis qui sera un refuge.",
                            "verse 79:42": "Ils t'interrogent au sujet de l'Heure : \" A quand sa venue ? \"",
                            "verse 79:43": "Comment pourrais-tu en parler ?",
                            "verse 79:44": "C'est à ton Seigneur d'en fixer le terme.",
                            "verse 79:45": "Toi, tu n'es que l'avertisseur de ceux qui la craignent.",
                            "verse 79:46": "Le jour où ils la verront, ce sera comme s'ils n'étaient demeurés [dans leurs tombes] qu'un soir ou une matinée."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 79:1": "Par ceux qui arrachent violemment !",
                            "verse 79:2": "Et par ceux qui recueillent avec douceur !",
                            "verse 79:3": "Et par ceux qui voguent librement,",
                            "verse 79:4": "puis s’élancent à toute vitesse,",
                            "verse 79:5": "et règlent les affaires !",
                            "verse 79:6": "Le jour où [la terre] tremblera [au premier son du clairon]",
                            "verse 79:7": "immédiatement suivi du deuxième.",
                            "verse 79:8": "Ce jour-là, il y aura des coeurs qui seront agités d’effroi,",
                            "verse 79:9": "et leurs regards se baisseront.",
                            "verse 79:10": "Ils disent : «Quoi ! Serons-nous ramenés à notre vie première,",
                            "verse 79:11": "quand nous serons ossements pourris ? »",
                            "verse 79:12": "Ils disent : «ce sera alors un retour ruineux ! »",
                            "verse 79:13": "Il n’y aura qu’une sommation,",
                            "verse 79:14": "et voilà qu’ils seront sur la terre (ressuscités).",
                            "verse 79:15": "Le récit de Moïse t’est-il parvenu ?",
                            "verse 79:16": "Quand son Seigneur l’appela, dans Touwa, la vallée sanctifiée :",
                            "verse 79:17": "«Va vers Pharaon. Vraiment, il s’est rebellé !",
                            "verse 79:18": "Puis dis-lui : «Voudrais-tu te purifier ?",
                            "verse 79:19": "et que je te guide vers ton Seigneur afin que tu Le craignes ? »",
                            "verse 79:20": "Il lui fit voir le très grand miracle.",
                            "verse 79:21": "Mais il le qualifia de mensonge et désobéit;",
                            "verse 79:22": "Ensuite, il tourna le dos, s’en alla précipitamment,",
                            "verse 79:23": "rassembla [les gens] et leur fit une proclamation,",
                            "verse 79:24": "et dit : «C’est moi votre Seigneur, le très-Haut».",
                            "verse 79:25": "Alors Dieu le saisit de la punition exemplaire de l’au-delà et de celle d’ici-bas.",
                            "verse 79:26": "Il y a certes là un sujet de réflexion pour celui qui craint.",
                            "verse 79:27": "êtes-vous plus durs à créer ? ou le ciel, qu’Il a pourtant construit ?",
                            "verse 79:28": "Il a élevé bien haut sa voûte, puis l’a parfaitement ordonné;",
                            "verse 79:29": "Il a assombri sa nuit et fait luire son jour.",
                            "verse 79:30": "Et quant à la terre, après cela, Il l’a étendue :",
                            "verse 79:31": "Il a fait sortir d’elle son eau et son pâturage,",
                            "verse 79:32": "et quant aux montagnes, Il les a ancrées,",
                            "verse 79:33": "pour votre jouissance, vous et vos bestiaux.",
                            "verse 79:34": "Puis quand viendra le grand cataclysme,",
                            "verse 79:35": "le jour où l’homme se rappellera à quoi il s’est efforcé,",
                            "verse 79:36": "l’Enfer sera pleinement visible à celui qui regardera...",
                            "verse 79:37": "Quant à celui qui aura dépassé les limites",
                            "verse 79:38": "et aura préféré la vie présente,",
                            "verse 79:39": "alors, l’Enfer sera son refuge.",
                            "verse 79:40": "Et pour celui qui aura redouté de comparaître devant son Seigneur, et préservé son âme de la passion,",
                            "verse 79:41": "le Paradis sera alors son refuge.",
                            "verse 79:42": "Ils t’interrogent au sujet de l’Heure : «Quand va-t-elle jeter l’ancre»",
                            "verse 79:43": "Quelle [science] en as-tu pour le leur dire ?",
                            "verse 79:44": "Son terme n’est connu que de ton Seigneur.",
                            "verse 79:45": "Tu n’es que l’avertisseur de celui qui la redoute.",
                            "verse 79:46": "Le jour où ils la verront, il leur semblera n’avoir demeuré qu’un soir ou un matin."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "Bei den mit aller Macht (zur Wahrheit) Ziehenden,",
                            "verse 79:2": "Und bei denen, die (ihre) Knoten fest binden,",
                            "verse 79:3": "Und den schnell einher Schwebenden,",
                            "verse 79:4": "Dann bei den Voraneilenden und Übertreffenden,",
                            "verse 79:5": "Dann bei den die Sachen Lenkenden.",
                            "verse 79:6": "Am Tage, wenn die bebende (Erde) schwanken wird,",
                            "verse 79:7": "(Und) ein zweites (Beben) drauf folgt,",
                            "verse 79:8": "Herzen werden an jenem Tage zittern,",
                            "verse 79:9": "Und ihre Augen werden niedergeschlagen sein.",
                            "verse 79:10": "Sie sprechen: «Sollen wir wirklich in unseren früheren Zustand zurückgebracht werden?",
                            "verse 79:11": "Wie! selbst wenn wir verwestes Gebein sind?»",
                            "verse 79:12": "Sie sprechen: «Das wäre dann eine verlustbringende Wiederkehr.»",
                            "verse 79:13": "Es wird nur ein einziger Schrei der Drohung sein",
                            "verse 79:14": "Und siehe, sie werden sich (alle) zusammen im Freien scharen.",
                            "verse 79:15": "Ist die Kunde von Moses zu dir gedrungen?",
                            "verse 79:16": "Da sein Herr ihn im heiligen Tale Tuwá rief:",
                            "verse 79:17": "«Geh hin zu Pharao, denn er ist widerspenstig,",
                            "verse 79:18": "Und sprich: \"Willst du dich nicht reinigen?",
                            "verse 79:19": "Und ich werde dich zu deinem Herrn führen, auf daß du dich fürchtest.\"»",
                            "verse 79:20": "So zeigte er ihm das große Zeichen,",
                            "verse 79:21": "Er aber leugnete und blieb ungehorsam,",
                            "verse 79:22": "Dann kehrte er den Rücken, um zu streiten.",
                            "verse 79:23": "Er sammelte (sein Volk) und rief auf,",
                            "verse 79:24": "Und sprach: «Ich bin euer höchster Herr.»",
                            "verse 79:25": "Da erfaßte ihn Allah zur Strafe für jene und diese Welt.",
                            "verse 79:26": "Hierin ist wahrlich eine Lehre für den, der fürchtet.",
                            "verse 79:27": "Seid ihr denn schwerer zu erschaffen oder der Himmel, den Er gebaut?",
                            "verse 79:28": "Er hat seine Höhe gehoben und dann ihn vollkommen gemacht.",
                            "verse 79:29": "Und Er machte seine Nacht finster und ließ sein Tageslicht hervorgehen;",
                            "verse 79:30": "Und währenddessen breitete Er die Erde aus.",
                            "verse 79:31": "Und Er brachte ihr Wasser aus ihr hervor und ihr Weideland.",
                            "verse 79:32": "Und die Berge, sie festigte Er -",
                            "verse 79:33": "Als eine Versorgung für euch und für euer Vieh.",
                            "verse 79:34": "Doch wenn das große Unheil kommt,",
                            "verse 79:35": "Der Tag, da der Mensch sich (all) das ins Gedächtnis zurückrufen wird, was er erstrebt,",
                            "verse 79:36": "Und die Hölle aufgedeckt wird für den, der sieht.",
                            "verse 79:37": "Dann, was den angeht, der trotzt,",
                            "verse 79:38": "Und der das Leben hienieden vorzieht,",
                            "verse 79:39": "Brennendes Feuer soll fürwahr (seine) Wohnstatt sein.",
                            "verse 79:40": "Was aber den anlangt, der das Stehen vor seinem Herrn fürchtet und die eigne Seele von niedrem Gelüst abhält,",
                            "verse 79:41": "So wird der Garten sicherlich (seine) Wohnstatt sein.",
                            "verse 79:42": "Sie fragen dich wegen der «Stunde»: «Wann kommt sie wohl?»",
                            "verse 79:43": "Doch was hast du mit ihrer Verkündung zu schaffen?",
                            "verse 79:44": "Das endgültige Wissen darum ist allein deinem Herrn (vorbehalten).",
                            "verse 79:45": "Du bist nur ein Warner für den, der sie fürchtet.",
                            "verse 79:46": "Am Tage, an dem sie sie schauen (da wird es sein), als hätten sie (in der Welt) nicht länger geweilt als einen Abend oder den Morgen darauf."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "mu ¼Q+fj’rksa½ dh d+le",
                            "verse 79:2": "tks ¼dq¶+Q+kj dh :g½ Mwc dj l[+rh ls [khap ysrs gSa",
                            "verse 79:3": "vkSj mudh d+le tks ¼eksfeuhu dh tku½ vklkuh ls [kksy nsrs gSa",
                            "verse 79:4": "vkSj mudh d+le tks ¼vkleku t+ehu ds njfe;ku½ iSjrs fQjrs gSa",
                            "verse 79:5": "fQj ,d ds vkxs c<+rs gSa",
                            "verse 79:6": "fQj ¼nqfu;k ds½ bUrt+ke djrs gSa ¼mudh d+le½ fd d+;ker gks dj jgsxh",
                            "verse 79:7": "ftl fnu t+ehu dks Hkwpky vk,xk fQj mlds ihNs vkSj t+yt+yk vk,xk",
                            "verse 79:8": "ml fnu fnyksa dks /kM+du gksxh",
                            "verse 79:9": "mudh vk¡[ksa ¼funker ls½ >qdh gq;h gksaxh",
                            "verse 79:10": "dq¶+Q+kj dgrs gSa fd D;k ge myVs ik¡o ¼ft+Unxh dh rjQ+½ fQj ykSVsaxs",
                            "verse 79:11": "D;k tc ge [kks[ky gfM~M;k¡ gks tk,¡xs",
                            "verse 79:12": "dgrs gSa fd ;s ykSVuk rks cM+k uqd+lku nsg gS",
                            "verse 79:13": "og ¼d+;ker½ rks ¼xks;k½ cl ,d l[+r ph[+k gksxh",
                            "verse 79:14": "vkSj yksx ;d ckjxh ,d eSnku ¼g’kz½ esa ekStwn gksaxs",
                            "verse 79:15": "¼,s jlwy½ D;k rqEgkjs ikl ewlk dk fdLlk Hkh igq¡pk gS",
                            "verse 79:16": "tc mudks ijojfnxkj us rwok ds eSnku esa iqdkjk fd fQ+jvkÅu ds ikl tkvks",
                            "verse 79:17": "og ljd’k gks x;k gS",
                            "verse 79:18": "¼vkSj mlls½ dgks fd D;k rsjh [+okfg’k gS fd ¼dqÝ ls½ ikd gks tk,",
                            "verse 79:19": "vkSj eSa rq>s rsjs ijojfnxkj dh jkg crk nw¡ rks rq>dks [+kkSQ ¼iSnk½ gks",
                            "verse 79:20": "x+jt+ ewlk us mls ¼vlk dk cM+k½ ekSftt+k fn[kk;k",
                            "verse 79:21": "rks mlus >qByk fn;k vkSj u ekuk",
                            "verse 79:22": "fQj ihB Qsj dj ¼f[+kykQ+ dh½ rnchj djus yxk",
                            "verse 79:23": "fQj ¼yksxksa dks½ tek fd;k vkSj cqyUn vkokt+ ls fpYyk;k",
                            "verse 79:24": "rks dgus yxk eSa rqe yksxksa dk lcls cM+k ijojfnxkj gw¡",
                            "verse 79:25": "rks [+kqnk us mls nqfu;k vkSj vk[+ksjr ¼nksuksa½ ds vt+kc esa fxj¶rkj fd;k",
                            "verse 79:26": "cs’kd tks Ó[+l ¼[+kqnk ls½ Mjs mlds fy, bl ¼fdLls½ essa bcjr gS",
                            "verse 79:27": "Hkyk rqEgkjk iSnk djuk T+;knk eqf’dy gS ;k vkleku dk",
                            "verse 79:28": "fd mlh us mldks cuk;k mldh Nr dks [+kwc Å¡pk j[kk",
                            "verse 79:29": "fQj mls nq:Lr fd;k vkSj mldh jkr dks rkjhd cuk;k vkSj ¼fnu dks½ mldh /kwi fudkyh",
                            "verse 79:30": "vkSj mlds ckn t+ehu dks QSyk;k",
                            "verse 79:31": "mlh esa ls mldk ikuh vkSj mldk pkjk fudkyk",
                            "verse 79:32": "vkSj igkM+ksa dks mlesa xkM+ fn;k",
                            "verse 79:33": "¼;s lc lkeku½ rqEgkjs vkSj rqEgkjs pkjik;ks ds Q+k;ns ds fy, gS",
                            "verse 79:34": "rks tc cM+h l[+r eqlhcr ¼d+;ker½ vk ekStwn gksxh",
                            "verse 79:35": "ftl fnu bUlku vius dkeksa dks dqN ;kn djsxk",
                            "verse 79:36": "vkSj tgUuqe ns[kus okyksa ds lkeus t+kfgj dj nh tk,xh",
                            "verse 79:37": "rks ftlus ¼nqfu;k esa½ lj mBk;k Fkk",
                            "verse 79:38": "vkSj nqfu;koh ft+Unxh dks rjthg nh Fkh",
                            "verse 79:39": "mldk fBdkuk rks ;d+huu nkst+[+k gS",
                            "verse 79:40": "exj tks Ó[+l vius ijojfnxkj ds lkeus [kM+s gksus ls Mjrk vkSj th dks uktk;t+ [+okfg’kksa ls jksdrk jgk",
                            "verse 79:41": "rks mldk fBdkuk ;d+huu csg’r gS",
                            "verse 79:42": "¼,s jlwy½ yksx rqe ls d+;ker ds ckjs esa iwNrs gSa",
                            "verse 79:43": "fd mldk dgha Fky csM+k Hkh gS",
                            "verse 79:44": "rks rqe mlds ft+Ø ls fdl fQ+Ø esa gks",
                            "verse 79:45": "ml ¼ds bYe½ dh bUrsgk rqEgkjs ijojfnxkj gh rd gS rks rqe cl tks mlls Mjs mldks Mjkus okys gks",
                            "verse 79:46": "ftl fnu og yksx bldks ns[ksaxs rks ¼le>saxs fd nqfu;k esa½ cl ,d Óke ;k lqcg Bgjs Fks"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "Demi (malaikat-malaikat) yang mencabut (nyawa) dengan keras,",
                            "verse 79:2": "dan (malaikat-malaikat) yang mencabut (nyawa) dengan lemah-lembut,",
                            "verse 79:3": "dan (malaikat-malaikat) yang turun dari langit dengan cepat,",
                            "verse 79:4": "dan (malaikat-malaikat) yang mendahului dengan kencang,",
                            "verse 79:5": "dan (malaikat-malaikat) yang mengatur urusan (dunia).",
                            "verse 79:6": "(Sesungguhnya kamu akan dibangkitkan) pada hari ketika tiupan pertama menggoncangkan alam,",
                            "verse 79:7": "tiupan pertama itu diiringi oleh tiupan kedua.",
                            "verse 79:8": "Hati manusia pada waktu itu sangat takut,",
                            "verse 79:9": "pandangannya tunduk.",
                            "verse 79:10": "(Orang-orang kafir) berkata: \"Apakah sesungguhnya kami benar-benar dikembalikan kepada kehidupan yang semula?",
                            "verse 79:11": "Apakah (akan dibangkitkan juga) apabila kami telah menjadi tulang-belulang yang hancur lumat?\"",
                            "verse 79:12": "Mereka berkata: \"Kalau demikian, itu adalah suatu pengembalian yang merugikan\".",
                            "verse 79:13": "Sesungguhnya pengembalian itu hanyalah dengan satu kali tiupan saja,",
                            "verse 79:14": "maka dengan serta merta mereka hidup kembali di permukaan bumi.",
                            "verse 79:15": "Sudahkah sampai kepadamu (ya Muhammad) kisah Musa.",
                            "verse 79:16": "Tatkala Tuhannya memanggilnya di lembah suci ialah Lembah Thuwa;",
                            "verse 79:17": "\"Pergilah kamu kepada Fir’aun, sesungguhnya dia telah melampaui batas,",
                            "verse 79:18": "dan katakanlah (kepada Fir’aun): ’Adakah keinginan bagimu untuk membersihkan diri (dari kesesatan)’",
                            "verse 79:19": "Dan kamu akan kupimpin ke jalan Tuhanmu agar supaya kamu takut kepada-Nya?\"",
                            "verse 79:20": "Lalu Musa memperlihatkan kepadanya mu’jizat yang besar.",
                            "verse 79:21": "Tetapi Fir’aun mendustakan dan mendurhakai.",
                            "verse 79:22": "Kemudian dia berpaling seraya berusaha menantang (Musa).",
                            "verse 79:23": "Maka dia mengumpulkan (pembesar-pembesarnya) lalu berseru memanggil kaumnya.",
                            "verse 79:24": "(Seraya) berkata: \"Akulah tuhanmu yang paling tinggi\".",
                            "verse 79:25": "Maka Allah mengazabnya dengan azab di akhirat dan azab di dunia.",
                            "verse 79:26": "Sesungguhnya pada yang demikian itu terdapat pelajaran bagi orang yang takut (kepada Tuhannya).",
                            "verse 79:27": "Apakah kamu yang lebih sulit penciptaannya ataukah langit? Allah telah membangunnya,",
                            "verse 79:28": "Dia meninggikan bangunannya lalu menyempurnakannya,",
                            "verse 79:29": "dan Dia menjadikan malamnya gelap gulita dan menjadikan siangnya terang benderang.",
                            "verse 79:30": "Dan bumi sesudah itu dihamparkan-Nya.",
                            "verse 79:31": "Ia memancarkan daripadanya mata airnya dan (menumbuhkan) tumbuh-tumbuhannya.",
                            "verse 79:32": "Dan gunung-gunung dipancangkan-Nya dengan teguh,",
                            "verse 79:33": "(semua itu) untuk kesenanganmu dan untuk binatang-binatang ternakmu.",
                            "verse 79:34": "Maka apabila malapetaka yang sangat besar (hari kiamat) telah datang.",
                            "verse 79:35": "Pada hari (ketika) manusia teringat akan apa yang telah dikerjakannya,",
                            "verse 79:36": "dan diperlihatkan neraka dengan jelas kepada setiap orang yang melihat.",
                            "verse 79:37": "Adapun orang yang melampaui batas,",
                            "verse 79:38": "dan lebih mengutamakan kehidupan dunia,",
                            "verse 79:39": "maka sesungguhnya nerakalah tempat tinggal (nya).",
                            "verse 79:40": "Dan adapun orang-orang yang takut kepada kebesaran Tuhannya dan menahan diri dari keinginan hawa nafsunya,",
                            "verse 79:41": "maka sesungguhnya surgalah tempat tinggal (nya).",
                            "verse 79:42": "(Orang-orang kafir) bertanya kepadamu (Muhammad) tentang hari berbangkit, kapankah terjadinya?.",
                            "verse 79:43": "Siapakah kamu (sehingga) dapat menyebutkan (waktunya)?",
                            "verse 79:44": "Kepada Tuhanmulah dikembalikan kesudahannya (ketentuan waktunya).",
                            "verse 79:45": "Kamu hanyalah pemberi peringatan bagi siapa yang takut kepadanya (hari berbangkit).",
                            "verse 79:46": "Pada hari mereka melihat hari berbangkit itu, mereka merasa seakan-akan tidak tinggal (di dunia) melainkan (sebentar saja) di waktu sore atau pagi hari."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "Per gli strappanti violenti !",
                            "verse 79:2": "Per i correnti veloci !",
                            "verse 79:3": "Per i nuotanti leggeri !",
                            "verse 79:4": "Per i sopravvanzanti con foga",
                            "verse 79:5": "per sistemare ogni cosa !",
                            "verse 79:6": "Il Giorno in cui risuonerà il Risuonante ,",
                            "verse 79:7": "al quale seguirà il successivo ,",
                            "verse 79:8": "il quel Giorno tremeranno i cuori",
                            "verse 79:9": "e saranno abbassati gli sguardi.",
                            "verse 79:10": "Dicono: « Saremo ricondotti [sulla terra]",
                            "verse 79:11": "quando già saremo ossa marcite?».",
                            "verse 79:12": "Dicono: « Sarebbe questo un disastroso ritorno!».",
                            "verse 79:13": "Ci sarà un solo grido ,",
                            "verse 79:14": "ed eccoli risvegliati, sulla superficie [della terra] .",
                            "verse 79:15": "Non ti giunse [o Muhammad] la storia di Mosè?",
                            "verse 79:16": "Quando lo chiamò il suo Signore, nella valle santa di Tuwâ:",
                            "verse 79:17": "«Va' da Faraone, invero è divenuto un ribelle!».",
                            "verse 79:18": "E digli : \" Sei disposto a purificarti ,",
                            "verse 79:19": "sicché io ti guidi verso il tuo Signore e tu [Lo] tema?\".",
                            "verse 79:20": "Gli mostrò poi il segno più grande.",
                            "verse 79:21": "Ma quello tacciò di menzogna e disobbedì,",
                            "verse 79:22": "poi volse le spalle e si distolse.",
                            "verse 79:23": "Convocò [i notabili] e proclamò:",
                            "verse 79:24": "«Sono io il vostro signore, l'altissimo».",
                            "verse 79:25": "Lo colpì Allah con il castigo nell'altra vita e in questa.",
                            "verse 79:26": "In ciò vi è motivo di riflessione per chi è timorato [di Allah].",
                            "verse 79:27": "Sareste voi più difficili da creare o il cielo che [Egli] ha edificato?",
                            "verse 79:28": "Ne ha innalzato la volta e le ha dato perfetta armonia,",
                            "verse 79:29": "ha fatto oscura la sua notte e ha fatto brillare il chiarore del suo giorno.",
                            "verse 79:30": "Dopo di ciò ha esteso la terra:",
                            "verse 79:31": "ne ha tratto l'acqua e i pascoli,",
                            "verse 79:32": "e le montagne le ha ancorate,",
                            "verse 79:33": "sì che ne godeste voi e il vostro bestiame .",
                            "verse 79:34": "Poi, quando verrà il grande cataclisma,",
                            "verse 79:35": "il Giorno in cui l'uomo ricorderà in cosa si è impegnato,",
                            "verse 79:36": "e apparirà la Fornace per chi potrà vederla,",
                            "verse 79:37": "colui che si sarà ribellato,",
                            "verse 79:38": "e avrà preferito la vita terrena,",
                            "verse 79:39": "avrà invero la Fornace per rifugio.",
                            "verse 79:40": "E colui che avrà paventato di comparire davanti al suo Signore e avrà preservato l'animo suo dalle passioni,",
                            "verse 79:41": "avrà invero il Giardino per rifugio.",
                            "verse 79:42": "T'interpellano a proposito dell'Ora: « Quando giungerà?»",
                            "verse 79:43": "Che [scienza] ne hai per informarli?",
                            "verse 79:44": "Al tuo Signore il termine.",
                            "verse 79:45": "Tu non sei che un ammonitore per coloro che la paventano.",
                            "verse 79:46": "Il Giorno in cui la vedranno, sarà come se fossero rimasti [sulla terra] una sera o un mattino."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "荒々しく（罪深い者の魂を）引き離すものだおいて（誓う），",
                            "verse 79:2": "優しく（信仰深い者の魂を）引き出すものにおいて，",
                            "verse 79:3": "泳ぐように（慈悲の使いに）滑走するものにおいて，",
                            "verse 79:4": "先を争って前進するものにおいて，",
                            "verse 79:5": "（主の命令で）事を処理するものにおいて（誓う）。",
                            "verse 79:6": "その日（第一のラッパで），震動が（凡てのものを）揺がし，",
                            "verse 79:7": "次のラッパ（で震動）が，続く。",
                            "verse 79:8": "（不信者の）心は，その日戦き震え，",
                            "verse 79:9": "目を伏せるであろう。",
                            "verse 79:10": "かれらは言う。「わたしたちは初め（生前）の状態に，本当に返るのでしょうか。",
                            "verse 79:11": "何と，わたしたちは朽ち果てた骨になってしまったのに。」",
                            "verse 79:12": "かれらは言う。「その場合（復活），損な戻りです。」",
                            "verse 79:13": "（復活は），只一声の叫びである。",
                            "verse 79:14": "見よ，かれらは目覚めて（地上に）現われる。",
                            "verse 79:15": "ムーサーの物語が，あなたに届いたか。",
                            "verse 79:16": "主がトワーの聖谷に，かれを呼ばれた時を思い起せ。",
                            "verse 79:17": "（かれは仰せられた。）「あなたはフィルアウンの許に行け。本当にかれは目にあまる者である。",
                            "verse 79:18": "そしてかれに言ってやるがいい。『あなたは（罪から）清められたいのか。",
                            "verse 79:19": "わたしはあなたを，主の御許に導く。あなたは（かれを）畏れなさい。』」",
                            "verse 79:20": "（ムーサーは）偉大な印をかれに示した。",
                            "verse 79:21": "だがかれ（フィルアウン）はそれを嘘であるとし，（導きに）従わなかった。",
                            "verse 79:22": "背を向けて急いで去った。",
                            "verse 79:23": "かれ（フィルアウン）は，（その民を）集め宣言して，",
                            "verse 79:24": "言った。「わたしはあなたがたの主，至高者である。」",
                            "verse 79:25": "そこでアッラーはかれを懲しめ，来世と現世の生活に懲罰を加えられた。",
                            "verse 79:26": "本当にこの中には（主を）畏れる者への一つの教訓がある。",
                            "verse 79:27": "あなたがたは（かれが）うち建てられた天（の創造）が，あなたがたを創ることより難しいとでも思うのか。",
                            "verse 79:28": "かれはそれを高く掲げ，それから整え，",
                            "verse 79:29": "夜を暗くなされ，また，光明を現わされる。",
                            "verse 79:30": "その後，大地を延べ広げられた。",
                            "verse 79:31": "そこから水と牧場を現われさせ，",
                            "verse 79:32": "また山々をそれにしっかりと据えられ，",
                            "verse 79:33": "あなたがたとあなたがたの家畜のための，用益に供される。",
                            "verse 79:34": "それで大きい災厄が来ると，",
                            "verse 79:35": "その日，人々は（現世で）その努力したことを思い出し，",
                            "verse 79:36": "また獄火は，誰でも見る（程の）者に（ありありと）現わされる。",
                            "verse 79:37": "その時，酷く目にあまった者，",
                            "verse 79:38": "またこの世の生活を重んじていた者は，",
                            "verse 79:39": "本当に火獄がその住まいであろう。",
                            "verse 79:40": "だが主の御前に立つことを恐れた者，また低劣な欲望に対し（自分の）魂を抑制した者は，",
                            "verse 79:41": "本当に楽園がその住まいであろう。",
                            "verse 79:42": "かれらはその時に就いて，あなたに問う。「それが到来するのは，何時（の日）ですか。」",
                            "verse 79:43": "あなたは，何によってそれを告げられようか。",
                            "verse 79:44": "その終末（の知識）は，あなたの主にあるだけ。",
                            "verse 79:45": "あなたは，それを恐れる者への，一人の警告者に過ぎない。",
                            "verse 79:46": "かれらがそれを見る日，（墓の中に）滞留していたのは，一夕か一朝に過ぎなかったように思うであろう。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "사악한 자들의 영혼을 강력하게 끌어가는 천사들을 두고 맹세 하사",
                            "verse 79:2": "축복받은 자들의 형혼을 부드 럽게 인도하는 천사들을 두고 맹 세하며",
                            "verse 79:3": "계시를 전달하는 천사를 두고 맹세하며",
                            "verse 79:4": "경주하여 인도하는 천사들을 두고 맹세하며",
                            "verse 79:5": "하나님의 명령들을 수행하는 천사들을 두고 맹세하나니",
                            "verse 79:6": "어느날 동요하게 될 모든 것 은 크게 동요하고",
                            "verse 79:7": "뒤를 이어 동요가 반복되도다",
                            "verse 79:8": "그날의 마음들은 두근거리고",
                            "verse 79:9": "그들의 눈들은 밑으로 척져있 으며",
                            "verse 79:10": "저희가 실로 이전의 상태로 돌아갈 수 있느뇨 라고 말하며",
                            "verse 79:11": "우리가 부패한 뼈들만 남는 데도 그러하느뇨",
                            "verse 79:12": "그리하면 그것이 실로 잃은 귀로가 되리라 말하더라",
                            "verse 79:13": "그러나 그것은 단 한번이 될 것이라",
                            "verse 79:14": "그때 그들은 심판을 위하여 깨어나 있지 않느뇨",
                            "verse 79:15": "모세의 이야기가 그대에게 이르렀느뇨",
                            "verse 79:16": "주님께서 성스러운 계곡 뚜 와로 그를 불러",
                            "verse 79:17": "파라오에게 가라 실로 그는 모든 영역을 벗어난 자이니",
                            "verse 79:18": "그에게 이르러 죄악으로 부터스스로를 청결케 하고자 하느뇨",
                            "verse 79:19": "그리하면 내가 당신을 주님께로 인도하여 주리니 당신은 그 분만을 두려워 하라고 하라",
                            "verse 79:20": "그래서 모세는 그에게 큰 예증을 보였더라",
                            "verse 79:21": "그러나 파라오는 그 진리를 거역하고 오만해 하였으며",
                            "verse 79:22": "등을 돌리고 서둘러 떠나",
                            "verse 79:23": "사람들을 불러 모아 소리쳐 말하길",
                            "verse 79:24": "내가 가장 높이 있는 너희 주님이라 하였으니",
                            "verse 79:25": "하나님은 그에게 내세와 현 세의 벌을 내리셨느니라",
                            "verse 79:26": "실로 이 안에는 하나님을 두려워하는 자들을 위한 교훈이 있 노라",
                            "verse 79:27": "너희를 창조하는 것이 더 어렵느뇨 아니면 그분이 세우신 하 늘이겠느뇨",
                            "verse 79:28": "하나님은 하늘을 가장 높이 두시고 거기에 질서와 온전함을 두셨노라",
                            "verse 79:29": "그분은 밤을 어둡게 두사 빛을 두셨노라",
                            "verse 79:30": "대지를 두시되 넓다랗게 펼 치시어",
                            "verse 79:31": "그곳으로 부터 물과 초목을 생산케 하셨으며",
                            "verse 79:32": "산들을 두시되 온전하게 고 정하셨으니",
                            "verse 79:33": "너희와 가축들에게 유용케 하기 위해서라",
                            "verse 79:34": "그러나 대 재앙이 다가올 때",
                            "verse 79:35": "그날은 인간이 행한 것들을 회상하는 날이며",
                            "verse 79:36": "지옥이 보는 자 앞에 나타날때",
                            "verse 79:37": "오만하며 불신하고",
                            "verse 79:38": "현세의 삶만을 좋아했던 자 들에게는",
                            "verse 79:39": "거주지가 불지옥이 될 것이라",
                            "verse 79:40": "그러나 주님앞에 서는 것을 두려워하고 저속한 욕망들로부터 자신을 자제하였던 자들에게는",
                            "verse 79:41": "거주지가 천국이 될 것이라",
                            "verse 79:42": "그들은 그때가 언제 있을 것이냐고 그대에게 질문하나",
                            "verse 79:43": "그것을 언급하는 것이 그대 에게 관계되는 일이뇨",
                            "verse 79:44": "종말은 그대 주님만 아시는 것으로",
                            "verse 79:45": "그대는 그것을 두려워 하는 자에게 경고하는 경고자에 불과하니라",
                            "verse 79:46": "그것을 보는 날 그들은 저녁이나 아침시간의 정도 머문 것 같이 느껴질 것이라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "سویند به‌و فریشتانه‌ی که گیانی خه‌ڵکی ده‌کێشن، یان به‌و ئه‌ستێرانه‌ی که له قوڵایی ئاسماندا ده‌دره‌وشێنه‌وه و ده‌سوڕێنه‌وه.",
                            "verse 79:2": "سوێند به‌و فریشتانه‌ی که گیانی ئیمانداران ده‌کێشن به چالاکی و بێ وچان ده‌سوڕێنه‌وه (که‌س فه‌رامۆش ناکه‌ن).",
                            "verse 79:3": "سوێند به‌و فریشتانه‌ی که به گورجی فه‌رمانی خوا جێبه‌جێ ده‌که‌ن، یان به‌و ئه‌ستێرانه‌ی که له بۆشایی دا مه‌له ده‌که‌ن و ده‌سوڕێنه‌وه‌.",
                            "verse 79:4": "هه‌روه‌ها سوێند به‌و فریشتانه‌ی که ڕۆحی ئیمانداران به‌په‌له به به‌هه‌شت شاد ده‌که‌ن و ڕۆحی کافرانیش به دۆزه‌خ ده‌گه‌یه‌نن، هه‌روه‌ها پێشبڕکێ ده‌که‌ن و گورج و گۆڵ و ئاماده‌ن بۆ ئه‌نجامدانی هه‌ر کارێك پێیان ده‌سپێردرێت.",
                            "verse 79:5": "سوێند به‌و فریشتانه‌ی (که به‌ویستی خوا) کارو فه‌رمان جێبه‌جێ ده‌که‌ن به رێك و پێکی.",
                            "verse 79:6": "(سوێند به‌وانه هه‌مووی) له ڕۆژێکدا (فوو ده‌کرێت به صوردا، ده‌ستبه‌جێ) زه‌وی به توندی ته‌کان ده‌دات و ده‌که‌وێته له‌رزه و ژێره‌و ژوور ده‌بێت.",
                            "verse 79:7": "دوایی دووباره فووی پیاده‌کرێته‌وه (مردووان زیندوو ده‌کرێنه‌وه و جیهانی هه‌میشه‌یی به‌رپا ده‌بێت).",
                            "verse 79:8": "له‌و ڕۆژه‌دا دڵانێك به خێرایی لێ ده‌ده‌ن، زۆر ده‌ترسن و زۆر په‌رێشانن.",
                            "verse 79:9": "خاوه‌نی ئه‌و دڵانه له ڕیسوایی و خه‌جاڵه‌تی و شه‌رمه‌زاریدا چاویان شۆڕه و ڕوویان نایه‌ت سه‌ر هه‌ڵببڕن.",
                            "verse 79:10": "(ئه‌مانه کاتی خۆی) ده‌یانوت: باشه ئێمه له‌م گۆڕانه ده‌ردێین و زیندووده‌کرێینه‌وه‌؟...",
                            "verse 79:11": "کاتێك بووینه ئێسکی ڕزیوو پرتوکاو؟!",
                            "verse 79:12": "(به گاڵته پێکردن و بێ بڕواییه‌وه‌) ده‌یانوت: ئه‌گه‌ر وابێت، گه‌ڕانه‌وه‌یه‌کی زۆر زیانبه‌خشه‌!!",
                            "verse 79:13": "(با خوانه‌ناسان چاك بزانن) به‌ڕاستی ته‌نها گه‌ڕانه‌وه‌یه یه‌ك تێخوڕینه‌.",
                            "verse 79:14": "جا ده‌ستبه‌جێ هه‌ر هه‌موو ئه‌و خه‌ڵکه بێدارده‌بنه‌وه و زیندووده‌بنه‌وه و له گۆڕه‌پانی لێپرسینه‌وه‌دا ئاماده ده‌بن.",
                            "verse 79:15": "(ئینجا دێته سه‌ر باسی سه‌رگوزه‌شته‌ی حه‌زره‌تی موساو دڵخۆشی پێغه‌مبه‌ر (صلی الله علیه وسلم) ده‌داته‌وه و ده‌فه‌رموێت): ئایا به‌سه‌رهاتی موسات پێگه‌یشتووه‌؟!",
                            "verse 79:16": "کاتێک په‌روه‌ردگاری له دۆڵی (طوی) دا بانگی کرد و گفتوگۆی له‌گه‌ڵدا کرد و فه‌رمانی پێدا:",
                            "verse 79:17": "بچۆ بۆ لای فیرعه‌ون (چونکه‌) به‌ڕاستی له سنوور ده‌رچووه و سته‌می بێ ئه‌ندازه‌یه‌.",
                            "verse 79:18": "پێی بڵێ: باشه ئه‌وه ناکرێت دڵ و ده‌روون و کردارو ره‌فتارت پاك و جوان و پوخته بێت!",
                            "verse 79:19": "تا ڕێنموویت بکه‌م بۆ ناسینی په‌روه‌ردگارت، تا ترسی (سزای) ئه‌و زاته‌ت هه‌بێت و سته‌م نه‌که‌یت).",
                            "verse 79:20": "(دیاره فیرعه‌ون داوای به‌ڵگه‌ی کردوه‌) ئه‌ویش موعجیزه گه‌وره‌که‌ی نیشانداوه (که دار عاساکه‌یه‌).",
                            "verse 79:21": "(به‌ڵام) به درۆی زانی و یاخی بوو.",
                            "verse 79:22": "له‌وه‌ودوا پشتی هه‌ڵگردو که‌وته هه‌وڵ و تێکۆشان (بۆ به‌رهه‌ڵستی موسا و دژایه‌تی ئیمان).",
                            "verse 79:23": "خه‌ڵکی کۆکرده‌وه و به‌ده‌نگی به‌رز وتی:",
                            "verse 79:24": "من په‌روه‌ردگاری هه‌ره به‌رزو بڵندی ئێوه‌م!!",
                            "verse 79:25": "ئه‌وسا خوا دووچاری سزای قیامه‌ت و دنیای کرد.",
                            "verse 79:26": "به‌ڕاستی ئا له‌و به‌سه‌رهاته‌دا په‌ندو ئامۆژگاری هه‌یه بۆ هه‌رکه‌سێک له خوا بترسێت. (ئینجا دێته سه‌ر باسی هه‌ندێک له دروستکراوانی که به‌ڵگه‌ن له‌سه‌ر ده‌سه‌ڵات و گه‌وره‌یی ئه‌و زاته‌).",
                            "verse 79:27": "باشه ئاخر زیندووکردنه‌وه‌ی ئێوه سه‌خترو گرانتره‌، یان به‌دیهێنانی ئه‌م ئاسمانه‌، که هه‌ر خۆی به‌رپای کردووه (که پڕه له ئه‌ستێره‌وهه‌ساره‌ی گه‌وره‌ی هه‌مه‌جۆر).",
                            "verse 79:28": "به‌به‌رزیه‌وه رایگرتووه و به‌وپه‌ڕی ڕێکو پێکی به‌دیهێناوه (به ڕاسه‌رتانه‌وه‌).",
                            "verse 79:29": "شه‌وگاره‌که‌ی تاریك کردووه‌، کاتی چێشته‌نگاویش ڕووناک خۆری ده‌رخستووه‌.",
                            "verse 79:30": "دواتر زه‌ویشی به‌شێوه‌یه‌کی هێلکه‌یی به‌دیهێناوه‌.",
                            "verse 79:31": "ئاوی لێده‌رهێناوه و له‌وه‌ڕگای بۆ ماڵات فه‌راهه‌م هێناوه‌.",
                            "verse 79:32": "کێوه‌کانیشی به تۆکمه‌یی دامه‌زراندووه‌.",
                            "verse 79:33": "(هه‌موو ئه‌مانه‌مان دروست کردووه‌) تا ببێته هۆی ئه‌وه‌ی که خۆتان و ماڵاته‌کانیشتان سوودی لێ وه‌ربگرن.",
                            "verse 79:34": "جا کاتێك به‌ڵا گه‌وره‌که پێشهات، که ته‌نگانه سامناکه‌که ڕوویدا، (مه‌به‌ست ڕۆژی قیامه‌ته‌).",
                            "verse 79:35": "ئه‌و ڕۆژه ئاده‌میزاد دێته‌وه یادی که چی کردووه و چی ئه‌نجامداوه.",
                            "verse 79:36": "دۆزه‌خ نیشان ده‌درێت و ده‌رده‌خرێت بۆ هه‌رکه‌سێك که ببینێت...",
                            "verse 79:37": "جا ئه‌وه‌ی خوانه‌ناس و یاخی و له‌سنوور ده‌رچوو بێت...",
                            "verse 79:38": "ژیانی دنیای زیاتر له قیامه‌ت مه‌به‌ست بووبێت...",
                            "verse 79:39": "ئه‌وه بێگومان ئه‌و دۆزه‌خه جێگه‌ی مانه‌وه و حه‌وانه‌وه‌یه‌تی!!",
                            "verse 79:40": "به‌ڵام ئه‌وه‌ی له پایه‌و شکۆی په‌روه‌ردگاری ترسابێت و حیسابی بۆ کردبێت و جڵه‌وی نه‌فسی گرتبێته‌وه له هه‌موو هه‌واو هه‌وه‌س و ئاره‌زوویه‌کی نادروست...",
                            "verse 79:41": "بێگومان هه‌ر به‌هه‌شت جێگه‌ی مانه‌وه و حه‌وانه‌وه و گوزه‌رانیه‌تی.",
                            "verse 79:42": "پرسیارت لێ ده‌که‌ن { ئه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم) } ده‌رباره‌ی قیامه‌ت، که که‌ی؟ چ کاتێك به‌رپا ده‌بێت؟",
                            "verse 79:43": "جا تۆ له‌کوێ ده‌زانیت که‌ی به‌رپا ده‌بێت!! تۆ له کوی و ئه‌و باسه له‌کوێ؟",
                            "verse 79:44": "بێگومان کۆتایی دنیاو به‌رپابوونی قیامه‌ت، هه‌ر په‌روه‌ردگارت ده‌یزانێت.",
                            "verse 79:45": "بێگومان ئه‌رکی تۆ ته‌نها بێدارکه‌ره‌وه‌ی ئه‌و که‌سانه‌یه که له‌و زاته ده‌ترسن.",
                            "verse 79:46": "ئه‌و ڕۆژه‌ی که قیامه‌ت به‌رپا ده‌بێت، بێ باوه‌ڕان واده‌زانن که ته‌نها سه‌ر له ئێواره‌یه‌ك یان سه‌ر له به‌یانیه‌ك درێژه‌ی ژیانی دنیایان بووه‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "Demi (makhluk-makhluk) yang mencabut (apa yang ditugaskan mencabutnya) dengan cara yang sekasar-kasarnya;",
                            "verse 79:2": "Dan yang menarik (apa yang ditugaskan menariknya) dengan cara yang selembut-lembutnya;",
                            "verse 79:3": "Dan demi (makhluk-makhluk) yang cergas bergerak (menerima perintah) dengan gerak yang secergas-cergasnya;",
                            "verse 79:4": "Lalu masing-masing berlumba-lumba dahulu-mendahului (menjalankan tugasnya) dengan cara yang sesungguh-sungguhnya;",
                            "verse 79:5": "Serta menyempurnakan tadbir urusan alam yang diperintahkan kepadanya; (sumpah demi sumpah, sesungguhnya kamu akan dibangkitkan hidup semula pada hari kiamat).",
                            "verse 79:6": "Pada masa berlakunya tiupan sangkakala yang pertama yang menggoncangkan alam, (sehingga mati segala yang bernyawa dan punah-ranah sekalian makhluk selain dari yang dikecualikan),",
                            "verse 79:7": "Tiupan yang pertama itu diikuti oleh tiupan yang kedua, (yang menyebabkan orang-orang yang mati semuanya hidup semula serta keluar dari kubur masing-masing);",
                            "verse 79:8": "Hati (manusia) pada hari itu berdebar-debar takut,",
                            "verse 79:9": "Pemandangannya tunduk gerun.",
                            "verse 79:10": "Mereka (yang ingkar) berkata: Sungguhkah kita akan dikembalikan hidup seperti keadaan di dunia dahulu?",
                            "verse 79:11": "Bolehkah (dihidupkan semula) sesudah kita menjadi tulang yang reput?",
                            "verse 79:12": "Mereka berkata lagi (secara mengejek: Kalaulah berlaku) yang demikian, sudah tentu kembalinya kita (hidup semula) itu satu perkara yang merugikan!",
                            "verse 79:13": "(Menghidupkan semula tidaklah sukar), kerana berlakunya perkara itu hanyalah dengan satu jeritan (yang terbit dari tiupan sangkakala yang kedua);",
                            "verse 79:14": "Yang menyebabkan mereka dengan serta-merta berada di muka bumi yang putih rata.",
                            "verse 79:15": "Sudahkah sampai kepadamu (wahai Muhammad) perihal Nabi Musa?",
                            "verse 79:16": "Ketika dia diseru oleh Tuhannya di \"Wadi Tuwa\" yang suci;",
                            "verse 79:17": "(Lalu diperintahkan kepadanya): Pergilah kepada Firaun, sesungguhnya dia telah melampaui batas (dalam kekufuran dan kezalimannya);",
                            "verse 79:18": "Serta katakanlah kepadanya: Adakah engkau suka hendak mensucikan dirimu (dari kekufuran)?",
                            "verse 79:19": "Dan mahukah, aku tunjuk kepadamu jalan mengenal Tuhanmu, supaya engkau merasa takut (melanggar perintahNya)?",
                            "verse 79:20": "(Setelah Nabi Musa menyempurnakan perintah Tuhannya dan Firaun pun meminta bukti kebenarannya); maka Nabi Musa memperlihatkan kepada Firaun: Mukjizat yang besar.",
                            "verse 79:21": "Lalu Firaun mendustakan (Nabi Musa) dan menderhaka (kepada Allah);",
                            "verse 79:22": "Kemudian dia berpaling ingkar sambil menjalankan usahanya (menentang Nabi Musa).",
                            "verse 79:23": "Lalu dia menghimpunkan orang-orangnya dan menyeru;",
                            "verse 79:24": "Dengan berkata: Akulah tuhan kamu, yang tertinggi.",
                            "verse 79:25": "Maka Allah menyeksa Firaun di akhirat dan di dunia ini, dengan azab yang menakutkan sesiapa yang mengetahuinya.",
                            "verse 79:26": "Sesungguhnya yang demikian itu mengandungi pelajaran yang mendatangkan iktibar bagi orang-orang yang takut (melanggar perintah Tuhannya).",
                            "verse 79:27": "(Wahai golongan yang ingkarkan kebangkitan hidup semula!) Kamukah yang sukar diciptakan atau langit? Tuhan telah membinanya (dengan Kukuh)!",
                            "verse 79:28": "Dia telah meninggikan bangunan langit itu lalu menyempurnaKannya,",
                            "verse 79:29": "Dan Dia menjadikan malamnya gelap-gelita, serta menjadikan siangnya terang-benderang.",
                            "verse 79:30": "Dan bumi sesudah itu dihamparkannya (untuk kemudahan penduduknya);",
                            "verse 79:31": "Dia mengeluarkan dari bumi itu: Airnya dan tumbuh-tumbuhannya;",
                            "verse 79:32": "Dan gunung-ganang pula dikukuhkan letaknya (di bumi, sebagai pancang pasak yang menetapnya);",
                            "verse 79:33": "(Semuanya itu) untuk kegunaan kamu dan binatang-binatang ternak kamu.",
                            "verse 79:34": "Maka apabila datang hari yang bencananya amat besar;",
                            "verse 79:35": "Iaitu hari manusia akan mengingati apa yang telah diusahakannya;",
                            "verse 79:36": "Dan Neraka diperlihatkan kepada sesiapa sahaja yang dapat melihatnya;",
                            "verse 79:37": "Maka (dapatlah masing-masing mengetahui kesudahannya); adapun orang yang melampau (perbuatan derhakanya);",
                            "verse 79:38": "Serta dia mengutamakan kehidupan dunia semata-mata;",
                            "verse 79:39": "Maka sesungguhnya Neraka Jahannamlah tempat kediamannya.",
                            "verse 79:40": "Adapun orang yang takutkan keadaan semasa dia berdiri di mahkamah Tuhannya, (untuk dihitung amalnya), serta dia menahan dirinya dari menurut hawa nafsu;",
                            "verse 79:41": "Maka sesungguhnya Syurgalah tempat kediamannya.",
                            "verse 79:42": "Mereka (yang ingkar) selalu bertanya kepadamu (wahai Muhammad) tentang hari kiamat: Bilakah masa datangnya?",
                            "verse 79:43": "Apa hubungannya tugasmu dengan (soal) menerangkan masa kedatangan hari kiamat itu?",
                            "verse 79:44": "Kepada Tuhanmu lah terserah kesudahan ilmu mengenainya.",
                            "verse 79:45": "Tugasmu hanyalah memberi amaran kepada orang yang takut akan huru-hara hari kiamat itu.",
                            "verse 79:46": "(Sangatlah dahsyatnya huru-hara hari itu, sehingga orang-orang yang bersalah merasa) pada masa melihatnya: Seolah-olah mereka tidak tinggal di dunia melainkan sekadar satu petang atau paginya sahaja."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "سوگند به فرشتگانى كه (جان مجرمان را بشدت از بدنهايشان) برمى‏كشند،",
                            "verse 79:2": "و فرشتگانى كه (روح مؤمنان) را با مدارا و نشاط جدا مى‏سازند،",
                            "verse 79:3": "و سوگند به فرشتگانى كه (در اجراى فرمان الهى) با سرعت حركت مى‏كنند،",
                            "verse 79:4": "و سپس بر يكديگر سبقت مى‏گيرند،",
                            "verse 79:5": "و آنها كه امور را تدبير مى‏كنند!",
                            "verse 79:6": "آن روز كه زلزله‏هاى وحشتناك همه چيز را به لرزه درمى‏آورد،",
                            "verse 79:7": "و بدنبال آن، حادثه دومين ( صيحه عظيم محشر) رخ مى‏دهد،",
                            "verse 79:8": "دلهايى در آن روز سخت مضطرب است،",
                            "verse 79:9": "و چشمهاى آنان از شدت ترس فروافتاده است!",
                            "verse 79:10": "(ولى امروز) مى‏گويند: «آيا ما به زندگى مجدد بازمى‏گرديم؟!",
                            "verse 79:11": "آيا هنگامى كه استخوانهاى پوسيده‏اى شديم (ممكن است زنده شويم)؟!»",
                            "verse 79:12": "مى‏گويند: «اگر قيامتى در كار باشد، بازگشتى است زيانبار!»",
                            "verse 79:13": "ولى (بدانيد) اين بازگشت تنها با يك صيحه عظيم است!",
                            "verse 79:14": "ناگهان همگى بر عرصه زمين ظاهر مى‏گردند!",
                            "verse 79:15": "آيا داستان موسى به تو رسيده است؟!",
                            "verse 79:16": "در آن هنگام كه پروردگارش او را در سرزمين مقدس «طوى‏» ندا داد (و گفت):",
                            "verse 79:17": "به سوى فرعون برو كه طغيان كرده است!",
                            "verse 79:18": "و به او بگو: «آيا مى‏خواهى پاكيزه شوى؟!",
                            "verse 79:19": "و من تو را به سوى پروردگارت هدايت كنم تا از او بترسى (و گناه نكنى)؟!»",
                            "verse 79:20": "سپس موسى بزرگترين معجزه را به او نشان داد!",
                            "verse 79:21": "اما او تكذيب و عصيان كرد!",
                            "verse 79:22": "سپس پشت كرد و پيوسته (براى محو آيين حق) تلاش نمود!",
                            "verse 79:23": "و ساحران را جمع كرد و مردم را دعوت نمود،",
                            "verse 79:24": "و گفت: «من پروردگار برتر شما هستم!»",
                            "verse 79:25": "از اين رو خداوند او را به عذاب آخرت و دنيا گرفتار ساخت!",
                            "verse 79:26": "در اين عبرتى است براى كسى كه (از خدا) بترسد!",
                            "verse 79:27": "آيا آفرينش شما (بعد از مرگ) مشكل‏تر است يا آفرينش آسمان كه خداوند آن را بنا نهاد؟!",
                            "verse 79:28": "سقف آن را برافراشت و آن را منظم ساخت،",
                            "verse 79:29": "و شبش را تاريك و روزش را آشكار نمود!",
                            "verse 79:30": "و زمين را بعد از آن گسترش داد،",
                            "verse 79:31": "و از آن آب و چراگاهش را بيرون آورد،",
                            "verse 79:32": "و كوه‏ها را ثابت و محكم نمود!",
                            "verse 79:33": "همه اينها براى بهره‏گيرى شما و چهارپايانتان است!",
                            "verse 79:34": "هنگامى كه آن حادثه بزرگ رخ دهد،",
                            "verse 79:35": "در آن روز انسان به ياد كوششهايش مى‏افتد،",
                            "verse 79:36": "و جهنم براى هر بيننده‏اى آشكار مى‏گردد،",
                            "verse 79:37": "اما آن كسى كه طغيان كرده،",
                            "verse 79:38": "و زندگى دنيا را مقدم داشته،",
                            "verse 79:39": "مسلما دوزخ جايگاه اوست!",
                            "verse 79:40": "و آن كس كه از مقام پروردگارش ترسان باشد و نفس را از هوى بازدارد،",
                            "verse 79:41": "قطعا بهشت جايگاه اوست!",
                            "verse 79:42": "و از تو درباره قيامت مى‏پرسند كه در چه زمانى واقع مى‏شود؟!",
                            "verse 79:43": "تو را با يادآورى اين سخن چه كار؟!",
                            "verse 79:44": "نهايت آن به سوى پروردگار تو است (و هيچ كس جز خدا از زمانش آگاه نيست)!",
                            "verse 79:45": "كار تو فقط بيم‏دادن كسانى است كه از آن مى‏ترسند!",
                            "verse 79:46": "آنها در آن روز كه قيام قيامت را مى‏بينند چنين احساس مى‏كنند كه گويى توقفشان (در دنيا و برزخ) جز شامگاهى يا صبح آن بيشتر نبوده است!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "Pelos que arrebatam violentamente",
                            "verse 79:2": "Pelos que extraem veementemente;",
                            "verse 79:3": "Pelos que gravitam serenamente;",
                            "verse 79:4": "Pelos que procuram sobrepujar repentinamente,",
                            "verse 79:5": "Arranjadores (para a execução) das ordens (do seu Senhor)!",
                            "verse 79:6": "No dia em que tudo o que poderá se comover, estará em comoção,",
                            "verse 79:7": "E em que acontecerá, pela segunda vez (a comoção),",
                            "verse 79:8": "Nesse dia, os corações baterão agitados,",
                            "verse 79:9": "Enquanto os olhares estarão humildes.",
                            "verse 79:10": "Dirão: Quê! Porventura voltaremos ao nosso estado primitivo,",
                            "verse 79:11": "Mesmo que também sejamos ossos deteriorados?",
                            "verse 79:12": "Dirão (mais): Tal será, então, um retorno de perdas!",
                            "verse 79:13": "Porém, certamente, será um só grito,",
                            "verse 79:14": "E, ei-los plenamente acordados.",
                            "verse 79:15": "Conheces (ó Mensageiro) a história de Moisés?",
                            "verse 79:16": "Seu Senhor o chamou, no vale sagrado de Tôwa,",
                            "verse 79:17": "(E lhe disse): Vai ao Faraó, porque ele transgrediu,",
                            "verse 79:18": "e dize-lhe: Desejas purificar-te,",
                            "verse 79:19": "e encaminhar-te até o teu Senhor, para O temeres?",
                            "verse 79:20": "E Moisés lhe mostrou o grande sinal,",
                            "verse 79:21": "Porém (o Faraó) desmentiu (aquilo) e se rebelou;",
                            "verse 79:22": "Então, rechaçou-o, contendendo tenazmente.",
                            "verse 79:23": "Em seguida, congregou (a gente) e discursou,",
                            "verse 79:24": "Proclamando: Sou o vosso senhor supremo!",
                            "verse 79:25": "Porém, Deus lhe infligiu o castigo e (fez dele) um exemplo para o outro mundo e para o presente.",
                            "verse 79:26": "Certamente, nisto há um exemplo para o temente.",
                            "verse 79:27": "Quê! Porventura a vossa criação é mais difícil ou é a do céu, que Ele erigiu?",
                            "verse 79:28": "Elevou a sua abóbada e, por conseguinte, a ordenou,",
                            "verse 79:29": "Escureceu a noite e, (consequentemente) clareou o dia;",
                            "verse 79:30": "E depois disso dilatou a terra,",
                            "verse 79:31": "Da qual fez brotar a água e os pastos;",
                            "verse 79:32": "E fixou, firmemente, as montanhas,",
                            "verse 79:33": "Para o proveito vosso e do vosso gado.",
                            "verse 79:34": "Mas, quando chegar o grande evento,",
                            "verse 79:35": "O dia em que o homem se há de recordar de tudo quanto tiver feito,",
                            "verse 79:36": "E a fogueira for exposta visivelmente, para quem a quiser ver,",
                            "verse 79:37": "Então, o que tiver transgredido,",
                            "verse 79:38": "E preferido a vida terrena,",
                            "verse 79:39": "Esse certamente terá a fogueira por morada.",
                            "verse 79:40": "Ao contrário, quem tiver temido o comparecimento ante o seu Senhor e se tiver refreado em relação à luxúria,",
                            "verse 79:41": "Terá o Paraíso por abrigo.",
                            "verse 79:42": "Interrogar-te-ão acerca da Hora: Quando aportará?",
                            "verse 79:43": "Com quem está tu (envolvido), com tal declaração?",
                            "verse 79:44": "Só ao teu Senhor incumbe tal conhecimento.",
                            "verse 79:45": "Tu és comente um admoestador, para quem a teme.",
                            "verse 79:46": "No dia em que a virem, parecer-lhes-á não terem permanecido no mundo mais do que um entardecer ou um amanhecer da mesma."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 79:1": "Pe cei care smulg cu putere",
                            "verse 79:2": "Și pe cei care iau cu blândețe",
                            "verse 79:3": "Și pe cei care plutesc iute, în libertate ,",
                            "verse 79:4": "Și pe cei care se grãbesc, întrecându-se ,",
                            "verse 79:5": "Și pe cei care orânduiesc lucrurile!",
                            "verse 79:6": "În Ziua aceea, se va cutremura pãmântul, [la primul sunet de trâmbițã],",
                            "verse 79:7": "Pe care îl va urma numaidecât urmãtorul .",
                            "verse 79:8": "În Ziua aceea, vor fi inimi cuprinse de spaimã,",
                            "verse 79:9": "Dar privirile lor vor fi plecate.",
                            "verse 79:10": "Ei [sunt cei care în viața pãmânteascã] spuneau: \"Oare noi vom fi întorși la viața de dinainte,",
                            "verse 79:11": "Când noi vom fi niște oase putrede?\"",
                            "verse 79:12": "Ei ziceau: \"Aceasta va fi, așadar, o întoarcere pierdutã!\"",
                            "verse 79:13": "Atunci va fi numai un sunet înfiorãtor",
                            "verse 79:14": "Și iatã-i pe ei pe pãmânt, [întorși la viațã]!",
                            "verse 79:15": "Oare a ajuns pânã la tine povestea lui Moise?",
                            "verse 79:16": "Când l-a chemat Domnul sãu în valea cea sfântã, Tova,",
                            "verse 79:17": "[Zicându-i]: \"Du-te la Faraon, cãci el se întrece!\"",
                            "verse 79:18": "Și spune-i: \"Vrei sã te curãțești",
                            "verse 79:19": "Și sã te cãlãuzesc cãtre Domnul tãu, pentru ca tu sã fii cu fricã[de El]?\"",
                            "verse 79:20": "Și el i-a arãtat lui minunea cea mai mare,",
                            "verse 79:21": "Însã el a socotit-o minciunã și nu s-a supus,",
                            "verse 79:22": "Ci a întors spatele și a plecat degrabã,",
                            "verse 79:23": "A adunat [oamenii] și a strigat.",
                            "verse 79:24": "Și a zis: \"Eu sunt Domnul vostru cel mai înalt!\"",
                            "verse 79:25": "Atunci l-a lovit pe el Allah cu pedeapsa Lumii de Apoi și a acestei lumi.",
                            "verse 79:26": "Întru aceasta este o pildã pentru cel ce se teme.",
                            "verse 79:27": "Sunteți voi mai greu de fãcut sau cerul pe care l-a înãlțat El?",
                            "verse 79:28": "El a ridicat bolta lui și l-a orânduit pe deplin,",
                            "verse 79:29": "El a fãcut întunecatã noaptea lui și a scos la ivealã ziua lui",
                            "verse 79:30": "Și pãmântul, dupã aceea, l-a întins",
                            "verse 79:31": "Și a fãcut sã iasã din el apa lui și pãșunea lui.",
                            "verse 79:32": "Și a întãrit munții lui,",
                            "verse 79:33": "Drept înzestrare pentru voi și pentru dobitoacele voastre.",
                            "verse 79:34": "Iar când va veni nenorocirea cea mai mare ,",
                            "verse 79:35": "Ziua în care omul își va aduce aminte de cele pentru care atrudit",
                            "verse 79:36": "Și se va arãta Iadul pentru cel care vede...",
                            "verse 79:37": "În ce-l privește pe cel care s-a întrecut",
                            "verse 79:38": "Și a pus mai presus viața din aceastã lume,",
                            "verse 79:39": "Iadul va fi sãlașul lui!...",
                            "verse 79:40": "Iar în ce-l privește pe cel care se teme de Ziua când se va înfãțișaDomnului sãu și și-a oprit sufletul de la pofte,",
                            "verse 79:41": "Raiul îi va fi sãlaș!...",
                            "verse 79:42": "Te întreabã ei despre Ceas, când va fi termenul lui?",
                            "verse 79:43": "Ce poți tu pomeni despre el?",
                            "verse 79:44": "La Domnul tãu este termenul lui.",
                            "verse 79:45": "Tu ești numai un prevenitor pentru cel care se teme de el,",
                            "verse 79:46": "Iar în Ziua când îl vor vedea, li se va pãrea lor cã ei nu au petrecut decât numai o searã sau o dimineațã."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 79:1": "Pe cei ce smulg cu tărie!",
                            "verse 79:2": "Pe cei ce trag cu gingăşie!",
                            "verse 79:3": "Pe cei ce înalţă cu uşurinţă!",
                            "verse 79:4": "Pe cei ce o iau înainte!",
                            "verse 79:5": "Pe cei ce mânuiesc totul!",
                            "verse 79:6": "În Ziua când cutremurul va cutremura",
                            "verse 79:7": "şi altul asemenea îi va urma,",
                            "verse 79:8": "în Ziua aceea, inimile se vor îngrozi",
                            "verse 79:9": "şi privirile se vor smeri.",
                            "verse 79:10": "Oamenii vor spune: “Vom fi iarăşi ce-am fost, noi, cei din groapă,",
                            "verse 79:11": "când putrede oase vom fi fiind?”",
                            "verse 79:12": "Vor spune: “Aceasta este o păgubitoare întoarcere!”",
                            "verse 79:13": "Un singur răcnet",
                            "verse 79:14": "şi iată-i pe faţa pământului!",
                            "verse 79:15": "A venit la voi spusa lui Moise?",
                            "verse 79:16": "Domnul său l-a chemat în valea sfântă Tova:",
                            "verse 79:17": "“Du-te la Faraon, căci este un ticălos",
                            "verse 79:18": "şi spune-i: ‘Eşti gata să te mântui?",
                            "verse 79:19": "Eu te voi călăuzi la Domnul tău, teme-te!’ ”",
                            "verse 79:20": "Apoi i-a arătat semnul cel mare.",
                            "verse 79:21": "Faraon a hulit şi nu a dat ascultare,",
                            "verse 79:22": "apoi zorit a întors spatele.",
                            "verse 79:23": "El şi-a adunat poporul şi i-a strigat:",
                            "verse 79:24": "“Eu sunt Domnul vostru, Preaînaltul!”",
                            "verse 79:25": "Dumnezeu l-a făcut pildă de pedeapsă în Viaţa de Apoi şi în Viaţa de Acum.",
                            "verse 79:26": "Întru aceasta este o amintire pentru cel care se teme de Dumnezeu.",
                            "verse 79:27": "Sunteţi voi oare mai greu de creat decât cerul pe care l-a zidit?",
                            "verse 79:28": "Dumnezeu a înălţat bolta şi a rânduit-o desăvârşit;",
                            "verse 79:29": "El i-a dat nopţii întunericul, El i-a izvodit zilei lumina.",
                            "verse 79:30": "Apoi a întins pământul,",
                            "verse 79:31": "şi din el a dat la iveală apa şi păşunile.",
                            "verse 79:32": "A pironit munţii,",
                            "verse 79:33": "zestre vouă şi turmelor voastre.",
                            "verse 79:34": "Când va veni Potopul cel Mare,",
                            "verse 79:35": "în Ziua aceea omul îşi va aminti pentru ce s-a trudit.",
                            "verse 79:36": "Iadul va fi scos pentru cel care trebuie să-l vadă!",
                            "verse 79:37": "Celui ticăloşit",
                            "verse 79:38": "şi legat de Viaţa de Acum,",
                            "verse 79:39": "Iadul îi va fi liman.",
                            "verse 79:40": "Celui care se teme de înălţimea Domnului său şi opreşte pofta din sufletul său,",
                            "verse 79:41": "Raiul îi va fi liman.",
                            "verse 79:42": "Ei te vor întreba despre Ceas: “Când se va opri?”",
                            "verse 79:43": "Ce le-ai putea tu aminti?",
                            "verse 79:44": "Întru Domnul tău este sfârşitul lui.",
                            "verse 79:45": "Tu nu faci decât să-i predici celui care se teme.",
                            "verse 79:46": "În Ziua când îl vor vedea, li se va părea că au zăcut numai o seară ori numai o dimineaţă."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "В знак тех2294, кто с силой исторгает(души грешных),",
                            "verse 79:2": "И тех, кто с мягкостью из праведныхих извлекает,",
                            "verse 79:3": "Скользящих плавно (и незримопо миссиям Господним),",
                            "verse 79:4": "Опережающих в своем скольженье,",
                            "verse 79:5": "Порядок (строгий) учреждая(по повелению Аллаха).",
                            "verse 79:6": "В тот День,(Когда под трубный глас)Великим сотрясеньем(Земля и горы) сотрясутся2295",
                            "verse 79:7": "И вслед за ним второй раздастсяглас2296.",
                            "verse 79:8": "В тот ДеньВолнение охватит все сердца2297,",
                            "verse 79:9": "Потупленными будут взоры2298,",
                            "verse 79:10": "И возгласят они2299:«Ужель вернемся мы в земноесостоянье?",
                            "verse 79:11": "Теперь, когда истлели наши кости?»",
                            "verse 79:12": "И скажут: «В случае такомВозврат сей будет лишь убытком!»",
                            "verse 79:13": "Поистине, раздастся лишь единыйвскрик,",
                            "verse 79:14": "И пробужденье вечное2300 для всехнастанет.",
                            "verse 79:15": "К тебе пришел рассказ о Мусе,",
                            "verse 79:16": "Когда Господь его воззвал к немув святой долине Тува:",
                            "verse 79:17": "«Ступай ты к Фараону, —Ведь преступил он все пределы.",
                            "verse 79:18": "Скажи ему:„Не хочешь ли себя очистить(от греха)?",
                            "verse 79:19": "И я тебя направлю к Владыке твоему,И станешь ты страшиться Его (гнева)“».",
                            "verse 79:20": "И тут он2301 пред его глазамиЗнаменье2302 величайшее представил,",
                            "verse 79:21": "Но Фараон отверг егоИ оставался непокорным;",
                            "verse 79:22": "Потом спиной он повернулся,Усердствуя (против Аллаха).",
                            "verse 79:23": "Потом собрал своих людей,и возгласил,",
                            "verse 79:24": "И (так) сказал:«Я — высочайший ваш владыка!»",
                            "verse 79:25": "И взял Аллах его (жестоким)наказаньемИ в жизни ближней, и в далекой.",
                            "verse 79:26": "И в этом — назидание, поистине,для тех,Которые страшатся (разгневить)Аллаха.",
                            "verse 79:27": "И что ж! Труднее было вас создатьИли небесный свод (построить)?",
                            "verse 79:28": "Его построил Он.И совершенным сделал.",
                            "verse 79:29": "Его залил Он мраком ночиИ выявил (великолепие егосиянием) дневного света.",
                            "verse 79:30": "Потом Он землю распростер",
                            "verse 79:31": "И из нее исторгнул воду и луга,",
                            "verse 79:32": "Установил недвижно горы",
                            "verse 79:33": "Для пользы вам и вашему скоту.",
                            "verse 79:34": "А потому, когда Миг величайший,Всеобъемлющий наступит,",
                            "verse 79:35": "В День,Когда воспомнит человек,К чему в трудах своих стремился,",
                            "verse 79:36": "И огненное пламя АдаПредстанет пред очами всех, ктовидит, —",
                            "verse 79:37": "Тогда для тех, кто (Господа) отверг",
                            "verse 79:38": "И отдал предпочтенье жизниближней,",
                            "verse 79:39": "Поистине, жилищем станет Ад.",
                            "verse 79:40": "Для тех же, кто из страха передГосподом предстатьГреховные желания умерил,",
                            "verse 79:41": "Поистине, жилищем Рай предстанет.",
                            "verse 79:42": "Они тебя о Часе вопрошают:«Когда придет назначенное время?»",
                            "verse 79:43": "К чему тебе касаться этого (вопроса)?",
                            "verse 79:44": "Лишь у Владыки твоего —Предел конечный.",
                            "verse 79:45": "А ты, (о Мухаммад!), лишьувещатель тех,Которые Его страшатся.",
                            "verse 79:46": "В тот День,Когда они его увидят,Они подумают, что длился(смертный сон их)Не дольше полдня или утра."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "¡Por los que arrancan violentamente!",
                            "verse 79:2": "¡Por los que van rápidamente!",
                            "verse 79:3": "¡Por los que nadan libremente!",
                            "verse 79:4": "¡Por los que van a la cabeza!",
                            "verse 79:5": "¡Por los que llevan un asunto!",
                            "verse 79:6": "El día que ocurra el temblor,",
                            "verse 79:7": "sucedido por el siguiente,",
                            "verse 79:8": "ese día, los corazones se estremecerán,",
                            "verse 79:9": "se humillarán las miradas.",
                            "verse 79:10": "Dicen: «¿Es verdad que seremos restituidos a nuestra primera condición,",
                            "verse 79:11": "luego de convertirnos en pútridos huesos?»",
                            "verse 79:12": "Dicen: «¡Sería un retorno pernicioso!»",
                            "verse 79:13": "No habrá más que un solo Grito",
                            "verse 79:14": "y ¡helos despiertos!",
                            "verse 79:15": "¿Te has enterado de la historia de Moisés?",
                            "verse 79:16": "Cuando su Señor le llamó en el valle sagrado de Tuwa:",
                            "verse 79:17": "«Ve a Faraón. Se ha excedido.",
                            "verse 79:18": "Y di: '¿Estás dispuesto a purificarte",
                            "verse 79:19": "y a que te dirija a tu Señor y, así, tengas miedo?»",
                            "verse 79:20": "Le mostró el signo tan grande.",
                            "verse 79:21": "Pero él desmintió y desobedeció.",
                            "verse 79:22": "Luego, volvió la espalda bruscamente.",
                            "verse 79:23": "Y convocó y dirigió una proclama.",
                            "verse 79:24": "Dijo: «Soy yo vuestro altísimo Señor».",
                            "verse 79:25": "Alá le infligió el castigo de la otra vida y de ésta.",
                            "verse 79:26": "Hay en ello, sí, motivo de reflexión para quien tenga miedo de Alá.",
                            "verse 79:27": "¿Sois vosotros más difíciles de crear que el cielo que él ha edificado?",
                            "verse 79:28": "Alzó su bóveda y le dio forma armoniosa.",
                            "verse 79:29": "Obscureció la noche y sacó la mañana.",
                            "verse 79:30": "Extendió, luego, la tierra,",
                            "verse 79:31": "sacó de ella el agua y los pastos,",
                            "verse 79:32": "fijó las montañas.",
                            "verse 79:33": "Para disfrute vuestro y de vuestros rebaños.",
                            "verse 79:34": "Pero, cuando venga la tan grande Calamidad,",
                            "verse 79:35": "el día que recuerde el hombre sus esfuerzos",
                            "verse 79:36": "y se haga aparecer el fuego de la gehena a quien pueda ver,",
                            "verse 79:37": "quien se haya mostrado rebelde",
                            "verse 79:38": "y preferido la vida de acá",
                            "verse 79:39": "tendrá por morada el fuego de la gehena,",
                            "verse 79:40": "mientras que quien haya temidoí comparecer ante su Señor y preservado su alma de la pasión",
                            "verse 79:41": "tendrá el Jardín por morada.",
                            "verse 79:42": "Te preguntan por la Hora: «¿Cuándo sucederá?»",
                            "verse 79:43": "¡No te ocupes tú de eso!",
                            "verse 79:44": "A tu Señor Le toca fijarla.",
                            "verse 79:45": "¡Tú sólo tienes que advertir a quien tiene miedo de ella!",
                            "verse 79:46": "El día que la vivan, les parecerá no haber permanecido más de una tarde o de una mañana."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "(பாவிகளின் உயிர்களை) கடினமாகப் பறிப்பவர்(களான மலக்கு)கள் மீது சத்தியமாக-",
                            "verse 79:2": "(நல்லோர் உயிர்களை) இலோசாகக் கழற்றுபவர்(களான மலக்கு)கள் மீதும் சத்தியமாக-",
                            "verse 79:3": "வேகமாக நீந்திச் செல்பவர்(களான மலக்கு)கள் மீதும் சத்தியமாக-",
                            "verse 79:4": "முந்தி முந்திச் செல்பவர்(களான மலக்கு)கள் மீதும் சத்தியமாக-",
                            "verse 79:5": "ஒவ்வொரு காரியத்தையும் நிர்வகிப்பவர்(களான மலக்கு)கள் மீதும் சத்தியமாக-",
                            "verse 79:6": "பூமி நடுக்கமாக நடுங்கும் அந்நாளில்;",
                            "verse 79:7": "அதனைத் தொடரும் (நில நடுக்கம்) தொடர்ந்து வரும்.",
                            "verse 79:8": "அந்நாளில் நெஞ்சங்கள் திடுக்கிட்டவையாக இருக்கும்.",
                            "verse 79:9": "அவர்கள் பார்வைகள் (அச்சத்தால்) கீழ் நோக்கியிருக்கும்.",
                            "verse 79:10": "\"நாம் நிச்சயமாக கப்ருகளிலிருந்து திரும்ப (எழுப்ப)ப் படுவோமா?\" என்று கூறுகிறார்கள்.",
                            "verse 79:11": "\"மக்கிப் போன எலும்புகளாக நாம் ஆகிவிட்ட பொழுதிலுமா?\"",
                            "verse 79:12": "\"அப்படியானால் அது பெரும் நஷ்ட முண்டாக்கும் திரும்புதலே யாகும்\" என்றும் கூறுகின்றார்கள்.",
                            "verse 79:13": "ஆனால் (யுக முடிவுக்கு), அது நிச்சயமாக ஒரே ஒரு பயங்கர சப்தம் தான்-",
                            "verse 79:14": "அப்போது அவர்கள் (உயிர் பெற்றெழுந்து) ஒரு திடலில் சேகரமாய் விடுவார்கள்.",
                            "verse 79:15": "(நபியே!) மூஸாவின் செய்தி உங்களுக்கு வந்ததா?",
                            "verse 79:16": "'துவா' என்னும் புனித பள்ளத்தாக்கில் அவருடைய இறைவன் அவரை அழைத்து,",
                            "verse 79:17": "\"நீர் ஃபிர்அவ்னிடம் செல்லும், நிச்சயமாக அவன் வரம்பு மீறி விட்டான்.\"",
                            "verse 79:18": "இன்னும் (ஃபிர்அவ்னிடம்; \"பாவங்களை விட்டும்) பரிசத்தமாக வேண்டும் என்ற (விருப்பம்) உன்னிடம் இருக்கிறதா?\" என்று கேளும்.",
                            "verse 79:19": "\"அப்படியானால் இறைவனிடம் (செல்லும்) வழியை நான் உனக்குக் காண்பிக்கிறேன்; அப்போது நீ உள்ளச்சமுடையவன் ஆவாய்\" (எனக் கூறுமாறு இறைவன் பணித்தான்).",
                            "verse 79:20": "ஆகவே, மூஸா அவனுக்கு பெரும் அத்தாட்சியை காண்பித்தார்.",
                            "verse 79:21": "ஆனால், அவனோ அதைப் பொய்ப்பித்து, மாறு செய்தான்.",
                            "verse 79:22": "பிறகு அவன் (அவரை விட்டுத்) திரும்பி (அவருக்கெதிராய் சதி செய்ய) முயன்றான்.",
                            "verse 79:23": "அன்றியும் (அவன் தன் சமூகத்தாரை) ஒன்று திரட்டி அறிக்கை செய்தான்.",
                            "verse 79:24": "\"நான்தான் உங்களுடைய மாபெரும் இறைவன் - ரப்புக்குமுல் அஃலா\" என்று (அவர்களிடம்) கூறினான்.",
                            "verse 79:25": "இம்மைக்கும் மறுமைக்குமான தண்டனையாக அல்லாஹ் அவனை பிடித்துக் கொண்டான்.",
                            "verse 79:26": "நிச்சயமாக இதில் இறையச்சம் கொள்வோருக்கு படிப்பினை இருக்கிறது.",
                            "verse 79:27": "உங்களைப் படைத்தல் கடினமா? அல்லது வானத்தை (படைத்தல் கடினமா?) அதை அவனே படைத்தான்.",
                            "verse 79:28": "அதன் முகட்டை அவன் உயர்த்தி அதை ஒழுங்கு படுத்தினான்.",
                            "verse 79:29": "அவன்தான் இரவை இருளுடையதாக்கிப் பகலின் ஒளியையும் வெளியாக்கினான்.",
                            "verse 79:30": "இதன் பின்னர், அவனே பூமியை விரித்தான்.",
                            "verse 79:31": "அதிலிருந்து அதன் தண்ணீரையும், அதன் மீதுள்ள (பிராணிகளுக்கான) மேய்ச்சல் பொருள்களையும் அவனே வெளியாக்கினான்.",
                            "verse 79:32": "அதில், மலைகளையும் அவனே நிலை நாட்டினான்.",
                            "verse 79:33": "உங்களுக்கும், உங்கள் கால் நடைகளுக்கும் பலனளிப்பதற்காக (இவ்வாறு செய்துள்ளான்).",
                            "verse 79:34": "எனவே (தடுத்து நிறுத்த முடியாத மறுமைப்) பேரமளி வந்து விட்டால்,",
                            "verse 79:35": "அந்நாளில் மனிதன் தான் முயன்றவற்றையெல்லாம் நினைவுபடுத்திக் கொள்வான்.",
                            "verse 79:36": "அப்போது பார்ப்போருக்கு(க் காணும் வகையில்) நரகம் வெளிப்படுத்தப்படும்.",
                            "verse 79:37": "எனவே, எவன் வரம்பை மீறினானோ -",
                            "verse 79:38": "இந்த உலக வாழ்க்கையைத் தேர்ந்தெடுத்தானோ-",
                            "verse 79:39": "அவனுக்கு, நிச்சயமாக நரகந்தான் தங்குமிடமாகும்.",
                            "verse 79:40": "எவன் தன் இறைவன் முன் நிற்பதை அஞ்சி மனதையும் இச்சைகளை விட்டு விலக்கிக் கொண்டானோ,",
                            "verse 79:41": "நிச்சயமாக அவனுக்குச் சுவர்க்கம்தான் தங்குமிடமாகும்.",
                            "verse 79:42": "(நபியே! \"மறுமையின்) நேரத்தைப் பற்றி - அது எப்போது ஏற்படும்?\" என்று அவர்கள் உம்மைக் கேட்கிறார்கள்.",
                            "verse 79:43": "அ(ந்நேரத்)தைப் பற்றி நீர் குறிப்பிடுவதற்கு என்ன இருக்கிறது?",
                            "verse 79:44": "அதன் முடிவெல்லாம் உம்முடைய இறைவனிடம் (அல்லவா) இருக்கிறது.",
                            "verse 79:45": "அதை பயப்படுவோருக்கு, நிச்சயமாக நீர் எச்சரிக்கை செய்பவர் தாம்,",
                            "verse 79:46": "நிச்சயமாக அதை அவர்கள் காணும் நாளில், மாலையிலோ, அல்லது காலையிலோ ஒரு சொற்ப நேரமேயன்றி, அவர்கள் (இவ்வுலகில்) தங்கியிருக்கவில்லை என்று தோன்றும்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "ขอสาบานด้วย (มลาอิกะฮ์) ผู้ฉุดกระชาก (วิญญาณของผู้ปฏิเสธศรัทธา) อย่างแรง",
                            "verse 79:2": "ขอสาบานด้วย (มลาอิกะฮ์) ผู้ชัก (วิญญาณของผู้ศรัทธา) อย่างแผ่วเบา",
                            "verse 79:3": "ขอสาบานด้วย (มลาอิกะฮ์) ที่แหวกว่ายในท้องนภากาศ",
                            "verse 79:4": "แล้วพวกเขา (มลาอิกะฮ์) ผู้รีบรุดหน้าไปอย่างว่องไว",
                            "verse 79:5": "แล้วพวกเขา (มลาอิกะฮ์) ผู้บริหารกิจการ",
                            "verse 79:6": "วันซึ่งการเป่าสังข์ครั้งแรกทำให้สั่นสะเทือน",
                            "verse 79:7": "การเป่าสังข์ครั้งสองจะติดตามมา",
                            "verse 79:8": "ในวันนั้นดวงจิตทั้งหลายจะตระหนก",
                            "verse 79:9": "สายตาของพวกเขาจะละห้อย",
                            "verse 79:10": "พวกเขาจะกล่าวว่า พวกเราจะถูกให้กลับไปอยู่ในสภาพเดิมอีกกระนั้นหรือ ?",
                            "verse 79:11": "เมื่อเราได้กลายเป็นกระดูกที่ผุแล้วกระนั้นหรือ ?",
                            "verse 79:12": "พวกเขากล่าวว่า ถ้าเป็นเช่นนั้นก็เป็นการกลับไปที่ขาดทุน",
                            "verse 79:13": "ความจริงมันเป็นเพียงเสียงก้อนครั้งเดียวเท่านั้น",
                            "verse 79:14": "แล้วเมื่อนั้นพวกเขาก็จะออกมายังที่ราบโล่ง",
                            "verse 79:15": "เรื่องราวของมูซาได้มาถึงได้มาถึงเจ้าแล้วมิใช่หรือ ?",
                            "verse 79:16": "ขณะที่พระเจ้าของเขาทรงเรียกเขาที่หว่างหุบเขาฏวาอันบริสุทธิ์",
                            "verse 79:17": "เจ้าจงไปหาฟิรเอาน์เพราะเขาละเมิดฝ่าฝืน",
                            "verse 79:18": "แล้วจงกล่าวว่า ท่านประสงค์จะซักฟอกไหม ?",
                            "verse 79:19": "และจะให้ฉันนำท่านไปสู่พระเจ้าของท่านไหม ? เพื่อท่านจะได้ยำเกรง",
                            "verse 79:20": "แล้วมูซาก็แสดงให้เขาเห็นสัญญาณอันยิ่งใหญ่",
                            "verse 79:21": "แต่เขาได้ปฏิเสธและดื้นดัน",
                            "verse 79:22": "แล้วเขาก็ผินหลังกลับหนีออกไปอย่างเร็ว",
                            "verse 79:23": "แล้วเขาก็ได้เรียกชุมนุม แล้วประกาศออกไป",
                            "verse 79:24": "แล้วกล่าวว่า ฉันคือพระเจ้าสูงสุดของพวกท่าน",
                            "verse 79:25": "ดังนั้นอัลลอฮ์จึงคร่าเขาเป็นการลงโทษที่เป็นแบบอย่างทั้งในปรโลกและในโลกนี้",
                            "verse 79:26": "แท้จริงในการนี้ย่อมเป็นข้อเตือนใจสำหรับผู้ยำเกรงของอัลลอฮ์",
                            "verse 79:27": "พวกเจ้าลำบากยิ่งในการสร้างกระนั้นหรือ ? หรือว่าชั้นฟ้าที่พระองค์ทรงสร้างมัน !",
                            "verse 79:28": "พระองค์ทรงยกให้มันสูงขึ้นแล้วทรง ทำให้มันสมบูรณ์",
                            "verse 79:29": "และทรงทำให้กลางคืนของมันมืดทึบ และทรงทำให้ความสว่างของมันออกมา",
                            "verse 79:30": "และหลังจากนั้นทรงทำให้แผ่นดินเป็นพื้นราบเรียบ",
                            "verse 79:31": "ทรงให้ออกมาจากแผ่นดินเป็นน้ำของมัน และทุ่งหญ้าของมัน",
                            "verse 79:32": "ส่วนเทือกเขานั้นทรงทำให้มันมั่นคง",
                            "verse 79:33": "ทั้งหมดนี้เป็นปัจจัยยังชีพสำหรับพวกเจ้า และสำหรับปศุสัตว์ของพวกเจ้า",
                            "verse 79:34": "ดังนั้นเมื่อความหายนะอันใหญ่หลวงได้เกิดขึ้น",
                            "verse 79:35": "เป็นวันที่มนุษย์จะนึกถึงสิ่งที่เขาได้ขวนขวายไว้",
                            "verse 79:36": "และนรกหรือเปลวไฟจะถูกเผยให้แก่ผู้ที่มองมัน",
                            "verse 79:37": "ส่วนผู้ที่ละเมิดฝ่าฝืนนั้น",
                            "verse 79:38": "และเขาได้เลือกเอาการมีชีวิตอยู่ในโลกนี้",
                            "verse 79:39": "ดังนั้นนรกหรือเปลวไฟคือที่พำนักของเขา",
                            "verse 79:40": "และส่วนผู้ที่หวาดหวั่นต่อการยืนเบื้องหน้าพระเจ้าของเขา และได้หน่วงเหนี่ยวจิตใจจากกิเลสต่ำ",
                            "verse 79:41": "ดังนั้นสวนสวรรค์ก็จะเป็นที่พำนักของเขา",
                            "verse 79:42": "พวกเขาจะถามเจ้าถึงยามอวสาน (วันกิยามะฮ์) ว่า เมื่อใดเล่ามันจะเกิดขึ้น ?",
                            "verse 79:43": "ด้วยเหตุอันใดเจ้าจึงชอบกล่าวถึงมันนัก ?",
                            "verse 79:44": "ยังพระเจ้าของเจ้าเท่านั้นคือวาระ",
                            "verse 79:45": "ความจริงเจ้าเป็นแต่เพียงผู้ตักเตือนแก่คนที่หวาดหวั่นมัน (วันกิยามะฮ์) เท่านั้น",
                            "verse 79:46": "วันที่พวกเขาจะเห็นมัน (วันกิยามะฮ์) ประหนึ่งว่าพวกเขามิได้พำนักอยู่โลกนี้เว้นแต่เพียงชั่วครู่หนึ่งของยามเย็นและยามเช้าของมันเท่านั้น"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 79:1": "Шиддат билан (кофир) жонни суғуриб олувчи(фаришта)лар билан қасам.",
                            "verse 79:2": "Юмшоқлик билан (мўмин) жонни олувчи (фаришта)лар билан қасам.",
                            "verse 79:3": "Сузиб юрувчи (фаришта)лар билан қасам.",
                            "verse 79:4": "Ўзишда мусобақа қилувчи (фаришта)лар билан қасам.",
                            "verse 79:5": "Амрнинг тадбирини қилувчи (фаришта)лар билан қасам.",
                            "verse 79:6": "Изтиробга тушувчи изтиробга тушган кунда.",
                            "verse 79:7": "Унга эргашувчи эргашар.",
                            "verse 79:8": "Ўша кунда қалблар хавфга тўлар.",
                            "verse 79:9": "Уларнинг кўзлари қўрқинчга тўлар.",
                            "verse 79:10": "Улар:«Биз ортга қайтариламизми?",
                            "verse 79:11": "Чириган суяк бўлганимиздан кейин ҳам-а?",
                            "verse 79:12": "Агар шундоқ бўлса, бу ҳасратий қайтиш-ку?» дерлар.",
                            "verse 79:13": "Албатта, у(қиёмат) бир қичқириқдан бошқа нарса эмас.",
                            "verse 79:14": "Кўрибсизки, улар қиёмат майдонида турибди-да.",
                            "verse 79:15": "Сенга Мусонинг хабари келдими?",
                            "verse 79:16": "Қачонки Роббиси унга муқаддас Тува водийсида нидо қилди:",
                            "verse 79:17": "«Фиръавн ҳузурига бор, албатта у туғёнга кетди.",
                            "verse 79:18": "Бас унга айт: «Сенда покланишга (рағбат) борми?",
                            "verse 79:19": "Ва сени Роббингга ҳидоят қилсам, шоядки (Ундан) қўрқсанг», деб»",
                            "verse 79:20": "Ва унга улкан аломатни кўрсатди.",
                            "verse 79:21": "Ул уни ёлғонга чиқарди ва осий бўлди.",
                            "verse 79:22": "Сўнг ортига ўгирилиб тезлаб кетди­.",
                            "verse 79:23": "Кейин (одамларни) тўплаб нидо қилди.",
                            "verse 79:24": "Ва, мен сизларнинг энг олий Роббингизман, деди.",
                            "verse 79:25": "Бас Аллоҳ уни аввалги ва охирги гуноҳлари учун азобга олди.",
                            "verse 79:26": "Албатта, бунда қўрқадиганлар учун ибрат бордир.",
                            "verse 79:27": "Сизларни яратиш қийинми ёки У зот бино қилган осмонними?",
                            "verse 79:28": "Унинг шифтини юқори кўтарди ва бекаму кўст, мустаҳкам қилиб қўйди.",
                            "verse 79:29": "Кечасини қоронғу ва кундузини ёруғ қилди.",
                            "verse 79:30": "Ва ундан сўнг ерни тухум шаклида қилди.",
                            "verse 79:31": "Ундан сувни, ўт-ўланларни чиқарди.",
                            "verse 79:32": "Ва тоғларни собит қилди.",
                            "verse 79:33": "Сизларга ва чорваларингизга манфаат бўлсин учун.",
                            "verse 79:34": "Вақтики катта ғолиб (қиёмат) келса.",
                            "verse 79:35": "У куни инсон қилган ишларини эслайдир.",
                            "verse 79:36": "Ва жаҳаннам кўрадиганларга зоҳир қилинадир.",
                            "verse 79:37": "Аммо кимики туғёнга кетиб, ҳаддидан ошган бўлса",
                            "verse 79:38": "Ва бу дунё ҳаётини устун қўйган бўлса,",
                            "verse 79:39": "Бас, албатта, Жаҳийм ўрин бўладир.",
                            "verse 79:40": "Ва, аммо ким Роббисининг мақомидан қўрққан ва ўз нафсини ҳаволаниб кетишидан қайтарган бўлса.",
                            "verse 79:41": "Бас, албатта, жаннат ўрин бўладир.",
                            "verse 79:42": "Сендан, қиёмат қачон бўлур? деб сўрарлар.",
                            "verse 79:43": "Унинг зикрини сен қандоқ билардинг.",
                            "verse 79:44": "Унинг интиҳоси Роббингга хосдир.",
                            "verse 79:45": "Албатта сен ун(қиёмат)дан қўрққанларга огоҳлантирувчисан, холос.",
                            "verse 79:46": "Уни кўрган кунлари худди бу дунёда бир кеча ёки кундуздан бошқа турмаганга ўхшарлар."
                        }
                    }
                }
            }
        }
    }
}