{
    "id": 95,
    "name_simple": "At-Tin",
    "revelation_place": "makkah",
    "revelation_order": 28,
    "bismillah_pre": true,
    "verses_count": 8,
    "short_text": "The Surah has been so named after the very first word at-tin.",
    "text": [
        "\n",
        "The Surah has been so named after the very first word at-tin.",
        "\n",
        "Period of Revelation",
        "\n",
        "According to Qatadah, this Surah is Madani. Two different views have been reported from Ibn Abbas: first that it is a Makki Surah, and second that it is Madani. But the majority of scholars regard it as a Makki revelation, a manifest symbol of which is the use of the words hadh-al-balad-il-amin (this city of peace) for Makkah. Obviously, if it had been revealed at Madinah, it would not be correct to use the words \"this city\" for Makkah Besides, a study of the contents of the Surah shows that it belongs to the earliest period of Makkah, for in it there is no sign whatever to indicate that during the period of its revelation any conflict had started between Islam and unbelief. Moreover, it reflects the same style of the earliest revelations of Makkah period in which briefly and succinctly the people have been made to realize that the judgment of the Hereafter is necessary and absolutely rational.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme is the rewards and punishments of the Hereafter. For this purpose first swearing an oath by the habitats of some illustrious Prophets, it has been stated that Allah has created man in the most excellent of molds. Although at other places in the Quran, this truth has been expressed in different ways, for example, at some places it has been said: \"Allah appointed man His vicegerent on the earth and commanded the angels to bow down to him (Al-Baqarah: 30,34, Al-Anam: 165, Al-Araf: 11, Al-Hijr: 28-29, An-Naml: 62, Suad: 71-73);\" at others that: \"Man has become bearer of the Divine trust, which the earth and the heavens and the mountains did not have the power to bear (Al-Ahzab: 72);\" and at still others that: \"We honored the children of Adam and exalted them above many of Our other creatures (Bani Israil 70),\" yet here the statement made on oath in particular by the habitats of the Prophets that man has been created in the finest of molds, signifies that mankind has been\r\nblessed with such an excellent mold and nature that it gave birth to men capable of attaining to the highest position of Prophethood, a higher position than which has not been attained by any other creature of God.",
        "\n",
        "Then, it has been stated that there are two kinds of men. those who in spite of having been created in the finest of molds, become inclined to evil and their moral degeneration causes them to be reduced to the lowest of the low, and those who by adopting the way of faith and righteousness remain secure from the degeneration and consistent with the noble position, which is the necessary demand of their having been created in the best of molds. The existence among mankind of both these kinds of men is such a factual thing which no one can deny, for it is being observed and experienced in society everywhere at all times.",
        "\n",
        "In conclusion, this factual reality has been used as an argument to prove that when among the people there are these two separate and quite distinct kinds, how can one deny the judgment and retribution for deeds If the morally degraded are not punished and the morally pure and exalted are not rewarded and both end in the dust alike, it would mean that there is no justice in the Kingdom of God; whereas human nature and common sense demand that a judge should do justice. How then can one conceive that Allah, Who is the most just of all judges, would not do justice?",
        "\n"
    ],
    "quran-source": "`https://altafsir.com`",
    "description": "The surah that opens with the oath of the Divine One swearing by The Fig and the olive, and other signs, representing the Holy Land in which God revealed the Evangel, the Torah, and the Quran, and thereby guided all mankind. It is named after “the fig” (al-tīn) mentioned in verse 1. The surah questions how man can deny the Judgement, and emphasizing the importance of faith and good deeds.The surah is also known as: The Figtree.",
    "name_translation": "The Fig",
    "name_complex": "At-Tîn",
    "surah_name_ar": "التين",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 95:1": "Betohem në fiq dhe ullinj,",
                            "verse 95:2": "dhe malin e Sinajit,",
                            "verse 95:3": "dhe në këtë qytet të sigurt,",
                            "verse 95:4": "me të vërtetë, Na e kemi krijuar njeriun në formën (hrmoninë) më të bukur,",
                            "verse 95:5": "pastaj, e kemi kthyer atë në gjendjen më të ulët (në këtë jetë dhe tjetrën),",
                            "verse 95:6": "përveç atyre që besojnë dhe punojnë vepra të mira, për ta ka shpëblime të pandërprera.",
                            "verse 95:7": "E, çka atëherë të shtyni ty (o njeri), që ta mohosh besimin?",
                            "verse 95:8": "A nuk është Perëndia gjykatësi më i drejtë?!"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "And olsun əncirə və zeytuna;",
                            "verse 95:2": "And olsun (Allah-təalanın Musa ilə danışdığı) Tur dağına;",
                            "verse 95:3": "And olsun bu təhlükəsiz (qorxusuz-xətərsiz) şəhərə (Məkkəyə) ki,",
                            "verse 95:4": "Biz insanı ən gözəl biçimdə yaratdıq!",
                            "verse 95:5": "Sonra da onu qaytarıb rəzillərin rəzili edərik!",
                            "verse 95:6": "Yalnız iman gətirib yaxşı əməllər edənlərdən başqa! Onları münnətsiz (saysız-hesabsız) mükafat gözləyir.",
                            "verse 95:7": "(Ey kafir insan! Bu qədər öyüd-nəsihətdən) sonra səni dini (haqq-hesab gününü) yalan saymağa vadar edən nədir?!",
                            "verse 95:8": "Məgər Allah hakimlərin hakimi (ən ədalətli, ən üstün hakim) deyilmi?!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "Tako mi smokve i masline,",
                            "verse 95:2": "i Sinajske gore,",
                            "verse 95:3": "i grada ovog, bezbjednog -",
                            "verse 95:4": "Mi čovjeka stvaramo u skladu najljepšem,",
                            "verse 95:5": "zatim ćemo ga u najnakazniji lik vratiti,",
                            "verse 95:6": "samo ne one koji budu vjerovali i dobra djela činili, njih čeka nagrada neprekidna.",
                            "verse 95:7": "Pa šta te onda navodi da poričeš onaj svijet -",
                            "verse 95:8": "zar Allah nije sudija najpravedniji?!"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "শপথ আঞ্জীর (ডুমুর) ও যয়তুনের,",
                            "verse 95:2": "এবং সিনাই প্রান্তরস্থ তূর পর্বতের,",
                            "verse 95:3": "এবং এই নিরাপদ নগরীর।",
                            "verse 95:4": "আমি সৃষ্টি করেছি মানুষকে সুন্দরতর অবয়বে।",
                            "verse 95:5": "অতঃপর তাকে ফিরিয়ে দিয়েছি নীচ থেকে নীচে।",
                            "verse 95:6": "কিন্তু যারা বিশ্বাস স্থাপন করেছে ও সৎকর্ম করেছে, তাদের জন্যে রয়েছে অশেষ পুরস্কার।",
                            "verse 95:7": "অতঃপর কেন তুমি অবিশ্বাস করছ কেয়ামতকে?",
                            "verse 95:8": "আল্লাহ কি বিচারকদের মধ্যে শ্রেষ্টতম বিচারক নন?"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 95:1": "Кълна се в смоковницата и в маслината,",
                            "verse 95:2": "и в Синайската планина,",
                            "verse 95:3": "и в [Мека] този град на сигурност -",
                            "verse 95:4": "Ние сътворихме човека с превъзходен облик.",
                            "verse 95:5": "После го отхвърляме най-унизен от унизените,",
                            "verse 95:6": "освен онези, които вярват и вършат праведни дела. За тях има безспирна награда.",
                            "verse 95:7": "И какво тогава те кара [о, човече] да взимаш за лъжа Възмездието?",
                            "verse 95:8": "Не е ли Аллах Най-мъдрият съдник?"
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "以無花果和橄欖果盟誓 ,",
                            "verse 95:2": "以西奈山盟誓 ,",
                            "verse 95:3": "以這個安寧的城市盟誓 ,",
                            "verse 95:4": "我確已把人造成具有最美的形態 ,",
                            "verse 95:5": "然后我使他變成最卑劣的 ;",
                            "verse 95:6": "但信道而且行善者 ,將受不斷的報酬。",
                            "verse 95:7": "此后 ,你怎麼還否認報應呢？",
                            "verse 95:8": "難道真主不是最公正的判決者嗎？"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "Při hoře Fíkovníku a hoře Stromu olivového,",
                            "verse 95:2": "při hoře Sinaji,",
                            "verse 95:3": "při tomto bezpečném území!",
                            "verse 95:4": "Stvořili jsme věru člověka v postavě nejkrásnější",
                            "verse 95:5": "a pak jsme jej svrhli tam, kde z bídných jsou nejbídnější,",
                            "verse 95:6": "kromě těch, kdož uvěřili a zbožné skutky konali - a jim náleží odměna, jež se neupomíná.",
                            "verse 95:7": "Co potom dovoluje, aby tě prohlašovali za toho, kdo lže o soudu posledním?",
                            "verse 95:8": "Což Bůh není ze soudců všech nejmoudřejší?"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "Bij de vijg en de olijf,",
                            "verse 95:2": "Bij de berg Sinaï,",
                            "verse 95:3": "En bij deze stad van Vrede (Mekka),",
                            "verse 95:4": "Voorzeker, Wij hebben de mens in de beste vorm geschapen,",
                            "verse 95:5": "Daarna laten Wij hem vervallen tot het allerlaagste,",
                            "verse 95:6": "Behalve degenen die geloven en goede werken doen; hunner is een oneindige beloning.",
                            "verse 95:7": "Wat is de oorzaak die u het Gericht doet loochenen?",
                            "verse 95:8": "Is God niet de Rechter aller rechters ?"
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 95:1": "By the fig and the olive,",
                            "verse 95:2": "By Mount Sinai,",
                            "verse 95:3": "And by this land made safe;",
                            "verse 95:4": "Surely We created man of the best stature",
                            "verse 95:5": "Then we reduced him to the lowest of the low,",
                            "verse 95:6": "Save those who believe and do good works, and theirs is a reward unfailing.",
                            "verse 95:7": "So who henceforth will give the lie to thee about the judgment ?",
                            "verse 95:8": "Is not Allah the most conclusive of all judges ?"
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 95:1": "By the Fig and the Olive,",
                            "verse 95:2": "And the Mount of Sinai,",
                            "verse 95:3": "And this City of security,-",
                            "verse 95:4": "We have indeed created man in the best of moulds,",
                            "verse 95:5": "Then do We abase him (to be) the lowest of the low,-",
                            "verse 95:6": "Except such as believe and do righteous deeds: For they shall have a reward unfailing.",
                            "verse 95:7": "Then what can, after this, contradict thee, as to the judgment (to come)?",
                            "verse 95:8": "Is not God the wisest of judges?"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 95:1": "By the fig and the olive",
                            "verse 95:2": "and the Mount Sinai",
                            "verse 95:3": "and this land secure!",
                            "verse 95:4": "We indeed created Man in the fairest stature",
                            "verse 95:5": "then We restored him the lowest of the low --",
                            "verse 95:6": "save those who believe, and do righteous deeds; they shall have a wage unfailing.",
                            "verse 95:7": "What then shall cry thee lies as to the Doom?",
                            "verse 95:8": "Is not God the justest of judges?"
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 95:1": "CONSIDER the fig and the olive,",
                            "verse 95:2": "and Mount Sinai,",
                            "verse 95:3": "and this land secure!",
                            "verse 95:4": "Verily, We create man in the best conformation,",
                            "verse 95:5": "and thereafter We reduce him to the lowest of low ¬–",
                            "verse 95:6": "excepting only such as attain to faith and do good works: and theirs shall be a reward unending!",
                            "verse 95:7": "What, then, [O man,] could henceforth cause thee to give the lie to this moral law?",
                            "verse 95:8": "Is not God the most just of judges?"
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 95:1": "By the fig and the olive.",
                            "verse 95:2": "And Mount Sinai.",
                            "verse 95:3": "And this safe land.",
                            "verse 95:4": "Verily We created man in the fairest uprightness. [UM] [ICCT] [SA]Verily We created man in the fairest rectitude. [BC] [RS]…in the most perfect rectitude",
                            "verse 95:5": "Then cast We him down to be the lowest of the low. [UM] [BC] [RS] [L-II]Then We reduced him to be the lowest of the low",
                            "verse 95:6": "Yet not those that believe… theirs is a meed unfailing. [UM]Except for those who believe and who do the good deeds that piety demands....",
                            "verse 95:7": "When then shall make thee belie hereafter the reckoning?",
                            "verse 95:8": "Is not God the wisest of judges? [UM]Sources Used• Unpublished Material (1938-2005) [UM]BOOKS• The Book of Certainty (1952) [BC]• A Sufi Saint of the Twentieth Century (1961) [SS]• What is Sufism (1975) [WS]• The Quranic Art of Calligraphy and Illumination (1976) [QACI]• Muhammad (1983) [M]• Symbol and Archetype (1991) [SA]• Sufi Poems (2004) [SP]• Mecca (2004) [Mec.]• Return to the Spirit (2005) [RS]• Splendours of Qur’an Calligraphy and Illumination (2005) [SQCI]ARTICLES• “Proofs of Islam”(1954). Islamic Cultural Centre. [PI]• “The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.1 No.4. [ICCT]• “The Origins of Sufism (1956) The Islamic Quarterly, Vol.III No.1 [OS]• “Sufism”: Religion in the Middle East (1969); ed.A.J. Arberry [S]• “Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn [SCR-SA]• “The Nature and Origin of Sufism”: Islamic Spirituality (1985) [NOS]• “Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.2 (1990) [MP]LECTURES• “The Quranic Doctrine of the Afterlife” [L-QD]• “The Quranic Origins of Sufism” [L-QOS]• “Human Origins and Destinies According to the Great Religions of the World” [L-HOD]• “Metaphysics and the Perennial Philosophy” [L-MPP]• “An Introduction to Islam” [L-II]• “The Universality of the Quran” [L-UQ]• Private Talks [L-PT]Books without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 95:1": "I swear by the Fig and the Olive,",
                            "verse 95:2": "and by Tūr, the mount of Sinai,",
                            "verse 95:3": "and by this peaceful city,",
                            "verse 95:4": "We have created man in the best composition,",
                            "verse 95:5": "then We turned him into the lowest of the low,",
                            "verse 95:6": "except those who believed and did righteous deeds, because for them there is a reward never ending.",
                            "verse 95:7": "So, what can make you, after all this, to deny the Requital?",
                            "verse 95:8": "Is Allah not the Greatest Ruler of all the rulers?"
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 95:1": "By the fig and the olive,",
                            "verse 95:2": "and [by] the Mount Sinai,",
                            "verse 95:3": "and [by] this secure land,",
                            "verse 95:4": "Verily We created man in the best of forms.",
                            "verse 95:5": "Then, We reduced him to the lowest of the low,",
                            "verse 95:6": "except those who believe and perform righteous deeds, for they shall have an unfailing reward.",
                            "verse 95:7": "So what makes you deny thereafter the Judgement?",
                            "verse 95:8": "Is not God the fairest of all judges?"
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 95:1": "By the fig and by the olive!",
                            "verse 95:2": "And by (Mount) Tur of Sinai!",
                            "verse 95:3": "And by this city of peace (Mecca)!",
                            "verse 95:4": "Indeed, We have created man in the best constitution (equipoised in the finest proportion).",
                            "verse 95:5": "Then We returned him to the lowest state of the low,",
                            "verse 95:6": "Except for those who believe and do good works. For them is an unending (i.e., everlasting) reward.",
                            "verse 95:7": "Then who denies you after this regarding the Din (Religion or the Last Hour and reward and punishment)?",
                            "verse 95:8": "Is Allah not the Greatest of all the rulers?"
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "Kautta viikunapuun ja oliivin,",
                            "verse 95:2": "kautta Siinain vuoren",
                            "verse 95:3": "ja tämän pyhitetyn kaupungin.",
                            "verse 95:4": "Totisesti Me loimme ihmisen parhaaseen muotoonsa,",
                            "verse 95:5": "mutta Me kyllä alennammekin hänet alhaista alemmaksi,",
                            "verse 95:6": "lukuunottomatta niitä, jotka uskovat ja hyvää tekevät; niitä odottaa ehtymätön palkka.",
                            "verse 95:7": "Mikä siis saa sinut pitämään tulevaa tuomiota valheena?",
                            "verse 95:8": "Eikö Jumala ole tuomareista parhain?"
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 95:1": "Par le figuier et l'olivier !",
                            "verse 95:2": "Par le Mont Sinaï !",
                            "verse 95:3": "Par cette contrée où règne la sécurité !",
                            "verse 95:4": "Certes, Nous avons créé l'homme dans la plus belle stature",
                            "verse 95:5": "puis Nous l'avons relégué au niveau le plus vil,",
                            "verse 95:6": "à l'exception de ceux qui ont cru et accompli des œuvres pies ; à ceux-là est destinée une récompense sans fin.",
                            "verse 95:7": "Après cela, quoi donc pourrait t'inciter à traiter de mensonge le Jugement ?",
                            "verse 95:8": "Dieu n'est-il pas le plus sage des juges ?"
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 95:1": "Par le figuier et l’olivier !",
                            "verse 95:2": "Et par le Mont Sinin !",
                            "verse 95:3": "Et par cette Cité sûre !",
                            "verse 95:4": "Nous avons certes créé l’homme dans la forme la plus parfaite.",
                            "verse 95:5": "Ensuite, Nous l’avons ramené au niveau le plus bas,",
                            "verse 95:6": "sauf ceux qui croient et accomplissent les bonnes oeuvres : ceux-là auront une récompense jamais interrompue.",
                            "verse 95:7": "Après cela, qu’est-ce qui te fait traiter la rétribution de mensonge ?",
                            "verse 95:8": "Dieu n’est-Il pas le plus sage des Juges ?"
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "Bei der Feige und dem Ölbaum,",
                            "verse 95:2": "Und bei dem Berg Sinai,",
                            "verse 95:3": "Und bei dieser Stadt des Friedens,",
                            "verse 95:4": "Wahrlich, Wir haben den Menschen in schönstem Ebenmaß erschaffen.",
                            "verse 95:5": "(Wirkt er) dann aber (Böses), so verwerfen Wir ihn als den Niedrigsten der Niedrigen.",
                            "verse 95:6": "Doch so sind die nicht, die glauben und gute Werke üben; denn ihrer ist unendlicher Lohn.",
                            "verse 95:7": "Wer kann also dich leugnen nach (diesem Wort) über das Weltgericht?",
                            "verse 95:8": "Ist Allah nicht der Größte der Richter?"
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "bUthj vkSj t+Srwu dh d+le",
                            "verse 95:2": "vkSj rwj lhuhu dh",
                            "verse 95:3": "vkSj ml veu okys Ógj ¼eDdk½ dh",
                            "verse 95:4": "fd geus bUlku cgqr vPNs dSM+s dk iSnk fd;k",
                            "verse 95:5": "fQj geus mls ¼cw<+k djds j¶+rk j¶+rk½ iLr ls iLr gkyr dh rjQ Qsj fn;k",
                            "verse 95:6": "exj tks yksx bZeku yk, vkSj vPNs ¼vPNs½ dke djrs jgs muds fy, rks cs bUrsgk vtz o lokc gS",
                            "verse 95:7": "rks ¼,s jlwy½ bu nyhyksa ds ckn rqedks ¼jkst+s½ tt+k ds ckjs esa dkSu >qByk ldrk gS",
                            "verse 95:8": "D;k [+kqnk lcls cM+k gkfde ugha gS ¼gk¡ t+:j gS½"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "Demi (buah) Tin dan (buah) Zaitun,",
                            "verse 95:2": "dan demi bukit Sinai,",
                            "verse 95:3": "dan demi kota (Mekah) ini yang aman,",
                            "verse 95:4": "sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya.",
                            "verse 95:5": "Kemudian Kami kembalikan dia ke tempat yang serendah-rendahnya (neraka),",
                            "verse 95:6": "kecuali orang-orang yang beriman dan mengerjakan amal saleh; maka bagi mereka pahala yang tiada putus-putusnya.",
                            "verse 95:7": "Maka apakah yang menyebabkan kamu mendustakan (hari) pembalasan sesudah (adanya keterangan-keterangan) itu?",
                            "verse 95:8": "Bukankah Allah Hakim yang seadil-adilnya?"
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "Per il fico e per l'olivo,",
                            "verse 95:2": "per il Monte Sinai",
                            "verse 95:3": "e per questa contrada sicura!",
                            "verse 95:4": "Invero creammo l'uomo nella forma migliore,",
                            "verse 95:5": "quindi lo riducemmo all'infimo dell'abiezione ,",
                            "verse 95:6": "eccezion fatta per coloro che credono e fanno il bene: avranno ricompensa inesauribile.",
                            "verse 95:7": "Dopo di ciò cosa mai ti farà tacciare di menzogna il Giudizio?",
                            "verse 95:8": "Non è forse Allah il più saggio dei giudici?"
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "無花果とオリーブにおいて，",
                            "verse 95:2": "シナイ山において，",
                            "verse 95:3": "また平安なこの町において（誓う）。",
                            "verse 95:4": "本当にわれは，人間を最も美しい姿に創った。",
                            "verse 95:5": "それからわれは，かれを最も低く下げた。",
                            "verse 95:6": "信仰して善行に動しむ者は別である。かれらに対しては果てしない報奨があろう。",
                            "verse 95:7": "なぜそれでも，おまえは宗教（真実）を否定するのか。",
                            "verse 95:8": "アッラーは，最も優れた審判者ではないか。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "무화과와 올리브를 두고 맹세하사",
                            "verse 95:2": "시나이 산을 두고 맹세하며",
                            "verse 95:3": "안전한 이 도읍을 두고 맹세 하나니",
                            "verse 95:4": "하나님은 인간을 제일 아름다 운 형상으로 빛으신 후",
                            "verse 95:5": "그의 위치를 가장 낮게 하였 노라",
                            "verse 95:6": "그러나 믿음으로 선을 행하는 의로운 자들은 제외되어 그들에게 는 끊임없는 보상이 있노라",
                            "verse 95:7": "다가올 심판의 날에 관하여 그대를 부정하는 이유는 무엇이뇨",
                            "verse 95:8": "가장 훌륭한 심판자는 하나님 이 아니더뇨"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "سوێند به هه‌نجیرو زه‌یتوون (که دوو میوه‌ی به‌سوودو به‌که‌ڵکن، سوێند خواردنی خوا به دروستکراوانی بۆ سه‌رنج ڕاکێشانمانه‌، به‌ڵام سوێند خواردنی ئێمه گه‌وره‌یی و گرنگی سوێند پێ خۆراوه‌که ده‌گه‌یه‌نێت).",
                            "verse 95:2": "به‌کێوی طوری سینا (که خوا گفتوگۆی له‌گه‌ڵ حه‌زره‌تی موسا، له‌وێدا کرد).",
                            "verse 95:3": "سوێند به‌م شاره ئه‌مینه‌، که (مه‌ککه‌) یه‌.",
                            "verse 95:4": "به‌ڕاستی ئێمه ئینسانمان له جوانترین شێوه و ڕێکوپێکترین شێوازدا دروست کردووه له هه‌موو ڕوویه‌که‌وه‌.",
                            "verse 95:5": "(ئه‌گه‌ر ڕێبازی خواناسی نه‌گرێت) سه‌ره‌نجام ده‌یخه‌ینه نزمترینی شوێنه نزمه‌کانه‌وه (له دۆزه‌خدا).",
                            "verse 95:6": "جگه له‌وانه‌ی که باوه‌ڕیان هێناوه‌و کارو کرده‌وه چاکه‌کانیان ئه‌نجامداوه‌، پاداشتی هه‌میشه‌و نه‌بڕاوه بۆیان ئاماده‌یه‌.",
                            "verse 95:7": "جا ئیتر (ئه‌ی ئینسانی سه‌ر که‌ش) چی وای لێکردوویت باوه‌ڕت به‌ڕۆژی قیامه‌ت و لێپرسینه‌وه نه‌بێت دوای ئه‌و هه‌موو نازو نیعمه‌ته‌؟",
                            "verse 95:8": "ئایا خوا چاکترین فه‌رمانڕه‌وا نیه‌؟ دادپه‌روه‌رترین فه‌رمانڕه‌وا نیه‌؟ (که‌چی تۆی سه‌ر که‌ش پێی ڕازیی نیت!!)."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "Demi buah tiin dan zaitun,",
                            "verse 95:2": "Dan gunung Tursina,",
                            "verse 95:3": "Serta negeri (Mekah) yang aman ini;",
                            "verse 95:4": "Sesungguhnya Kami telah menciptakan manusia dalam bentuk yang sebaik-baiknya (dan berkelengkapan sesuai dengan keadaannya).",
                            "verse 95:5": "Kemudian (jika dia panjang umur sehingga tua atau menyalahgunakan kelengkapan itu), Kami kembalikan dia ke serendah-rendah peringkat orang-orang yang rendah,",
                            "verse 95:6": "Kecuali orang-orang yang beriman dan beramal soleh, maka mereka beroleh pahala yang tidak putus-putus.",
                            "verse 95:7": "(Jika demikian kekuasaanKu), maka apa pula yang menjadikan engkau seorang pendusta, (berkata tidak benar) mengenai hari pembalasan, sesudah (ternyata dalil-dalil yang membuktikan kekuasaanKu mengadakan hari pembalasan) itu?",
                            "verse 95:8": "Bukankah Allah (yang demikian kekuasaanNya) seadil-adil Hakim?"
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "قسم به انجير و زيتون (يا: قسم به سرزمين شام و بيت المقدس)،",
                            "verse 95:2": "و سوگند به «طور سينين‏»،",
                            "verse 95:3": "و قسم به اين شهر امن ( مكه)،",
                            "verse 95:4": "كه ما انسان را در بهترين صورت و نظام آفريديم،",
                            "verse 95:5": "سپس او را به پايين‏ترين مرحله بازگردانديم،",
                            "verse 95:6": "مگر كسانى كه ايمان آورده و اعمال صالح انجام داده‏اند كه براى آنها پاداشى تمام‏نشدنى است!",
                            "verse 95:7": "پس چه چيز سبب مى‏شود كه بعد از اين همه (دلايل روشن) روز جزا را انكار كنى؟!",
                            "verse 95:8": "آيا خداوند بهترين حكم‏كنندگان نيست؟!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "Pelo figo e pela oliva,",
                            "verse 95:2": "Pelo monte Sinai,",
                            "verse 95:3": "E por esta metrópole segura (Makka),",
                            "verse 95:4": "Que criamos o homem na mais perfeita proporção.",
                            "verse 95:5": "Então, o reduzimos à mais baixa das escalas,",
                            "verse 95:6": "Salvo os fiéis, que praticam o bem; estes terão uma recompensa infalível.",
                            "verse 95:7": "Quem, então, depois disso, te contradirá, quanto ao Dia do Juízo?",
                            "verse 95:8": "Acaso, não é Deus o mais prudente dos juízes?"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 95:1": "Pe smochini și pe mãslini",
                            "verse 95:2": "Și pe Muntele Sinin",
                            "verse 95:3": "Și pe aceastã cetate sigurã!",
                            "verse 95:4": "Noi l-am creat pe om cu cea mai frumoasã înfãțișare,",
                            "verse 95:5": "Apoi îl întoarcem pe el în locul cel mai de jos ,",
                            "verse 95:6": "Fãrã de aceia care cred și împlinesc fapte bune, cãci ei vor avea parte de rãsplatã neîntreruptã.",
                            "verse 95:7": "Dupã aceasta, ce te mai face sã tãgãduiești Judecata?",
                            "verse 95:8": "Oare nu este Allah Cel mai Înțelept dintre judecãtori?"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 95:1": "Pe smochin şi pe măslin!",
                            "verse 95:2": "Pe muntele Sinai!",
                            "verse 95:3": "Pe această cetate tihnită!",
                            "verse 95:4": "Noi am creat omul dându-i chip desăvârşit,",
                            "verse 95:5": "şi l-am trimis apoi în catul cel mai de jos,",
                            "verse 95:6": "afară de cei care au crezut şi au făcut fapte bune pe care o răsplată necurmată îi aşteaptă.",
                            "verse 95:7": "Ce te face să socoţi apoi Legea minciună?",
                            "verse 95:8": "Nu este oare Dumnezeu cel mai drept dintre judecători?"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "Клянусь смоковницей (горыИерусалимской),Маслинным деревом (Дамасскогохолма)2329,",
                            "verse 95:2": "Клянусь (святой) горой Синай2330",
                            "verse 95:3": "И этим городом,Что (так великолепно)безопасен2331, —",
                            "verse 95:4": "Мы сотворили человекав прекраснейшей из форм,",
                            "verse 95:5": "Затем повергли Мы егов ничтожнейшее состоянье, —",
                            "verse 95:6": "Помимо тех, которые уверовали(в Бога)И праведные действия вершат:Их ждет неисчислимая наградабез попрека.",
                            "verse 95:7": "Кто ж после этого способенвозразить тебеО неизбежности Последнего Суда?",
                            "verse 95:8": "Ужель Аллах — не лучший из судей?!"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "¡Por las higueras y los olivos!",
                            "verse 95:2": "¡Por el monte Sinaí!",
                            "verse 95:3": "¡Por esta ciudad segura!",
                            "verse 95:4": "Hemos creado al hombre dándole la mejor complexión.",
                            "verse 95:5": "Luego, hemos hecho de él el más abyecto,",
                            "verse 95:6": "Excepto quienes crean y obren bien, que recibirán una recompensa ininterrumpida.",
                            "verse 95:7": "Cómo puede aún desmentirse el Juicio?",
                            "verse 95:8": "¿No es Alá quien mejor decide?"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "அத்தியின் மீதும், ஒலிவத்தின் (ஜைத்தூன்) மீதும் சத்தியமாக-",
                            "verse 95:2": "'ஸினாய்' மலையின் மீதும் சத்தியமாக-",
                            "verse 95:3": "மேலும் அபயமளிக்கும் இந்த (மக்கமா) நகரத்தின் மீதும் சத்தியமாக-",
                            "verse 95:4": "திடமாக, நாம் மனிதனை மிகவும் அழகிய அமைப்பில் படைத்தோம்.",
                            "verse 95:5": "பின்னர் (அவன் செயல்களின் காரணமாக) அவனைத் தாழ்ந்தவர்களில், மிக்க தாழ்ந்தவனாக்கினோம்.",
                            "verse 95:6": "எவர்கள் ஈமான் கொண்டு ஸாலிஹான (நல்ல) அமல்கள் செய்கிறார்களோ அவர்களைத் தவிர - (நல்லவர்களான) அவர்களுக்கு என்றும் முடிவில்லாத நற்கூலியுண்டு.",
                            "verse 95:7": "எனவே (இதற்குப்) பின்னர், நியாயத் தீர்ப்பு நாளைப்பற்றி உம்மிடம் எது பொய்யாக்க முடியும்?",
                            "verse 95:8": "அல்லாஹ் தீர்ப்புச் செய்வோரில் எல்லாம் மிக மேலாகத் தீர்ப்புச் செய்பவனில்லையா?"
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "ขอสาบานด้วยต้นมะเดื่อ และต้นมะกอก",
                            "verse 95:2": "และด้วยภูเขาฎูรซีนาย",
                            "verse 95:3": "และด้วยเมืองนี้ที่ปลอดภัย",
                            "verse 95:4": "โดยแน่นอนเราได้บังเกิดมนุษย์มาในรูปแบบที่สวยงามยิ่ง",
                            "verse 95:5": "แล้วเราได้ให้เขากลับสู่สภาพที่ตกต่ำยิ่ง",
                            "verse 95:6": "นอกจากบรรดาผู้ศรัทธาและประกอบสิ่งดีงามทั้งหลาย โดยที่สำหรับพวกเขาจะได้รับรางวัลอย่างไม่มีที่สิ้นสุด",
                            "verse 95:7": "ดังนั้น อะไรเล่าเขาจึงปฏิเสธเจ้า หลังจากนี้เกี่ยวกับการตอบแทน",
                            "verse 95:8": "มิใช่อัลลอฮ์ดอกหรือ เป็นผู้ตัดสินที่ดีเยี่ยมในหมู่ผู้ตัดสินทั้งหลาย"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "İncire, zeytine,",
                            "verse 95:2": "Sina dağına ,",
                            "verse 95:3": "Ve şu emîn beldeye yemin ederim ki,",
                            "verse 95:4": "Biz insanı en güzel biçimde yarattık.",
                            "verse 95:5": "Sonra da çevirdik aşağıların aşağısına attık.",
                            "verse 95:6": "Fakat iman edip sâlih amel işleyenler için eksilmeyen devamlı bir ecir vardır.",
                            "verse 95:7": "Artık bundan sonra, ceza günü konusunda seni kim yalanlayabilir?",
                            "verse 95:8": "Allah, hüküm verenlerin en üstünü değil midir?"
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "Fix": ""
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 95:1": "Анжир билан қасам ва зайтун билан қасам.",
                            "verse 95:2": "Ва Тури Сийно билан қасам.",
                            "verse 95:3": "Ва мана бу, эминлик юрти (Макка) билан қасам.",
                            "verse 95:4": "Батаҳқиқ, Биз инсонни энг яхши суратда яратдик.",
                            "verse 95:5": "Сўнгра уни асфала сафилинга қайтардик. (Инсон Яратганига ибодатда бўлса, фариштадан ҳам афзалроқ мартабага эришди. Аммо ҳавои нафси, ҳайвоний хирслари ақлидан устун келиб нафснинг айтганидан юрадиган бўлса, ҳайвондан ҳам баттар ҳолатга тушади. Ана ўшанда асфала сафилинни кўраверади.)",
                            "verse 95:6": "Магар иймон келтирганлар ва яхши амаллар қилганларга миннатсиз ва узлуксиз ажрлар бордир.",
                            "verse 95:7": "Бас, сени нима охиратни ёлғонга чиқаришга олиб келади (эй кофир)?",
                            "verse 95:8": "Аллоҳ ҳукм қилгувчиларнинг энг ҳикматлиси эмасми?!"
                        }
                    }
                }
            }
        }
    }
}