{
    "Wudu-Guide": {
        "Introduction": {
            "Wudu’ Foundations": {
                "The Importance Of Wudu": [
                    "The Prophet Muhammad s said: “Salah (prayer) of ",
                    "anyone of you who has invalidated his/her purification ",
                    "is not accepted unless he/she makes wudu’’. (Bukhari)"
                ],
                "The Virtues Of Wudu’": [
                    "The Prophet Muhammad s said: “When the Muslim ",
                    "or believing servant performs ablution and washes ",
                    "his/her face, each sin he/she has committed by his/",
                    "her eyes washes away with the water. When he/she ",
                    "washes his/her hands, each sin his/her hands have ",
                    "committed washes away with the water – or with the ",
                    "last drop of water until he/she becomes free of sin.” ",
                    "(Malik and others)."
                ],
                "Before Doing Wudu’": [
                    "1.  Go to the toilet first (if required). You should use ",
                    "the toilet and then wash the private parts before ",
                    "performing wudu’.",
                    "2.  It is good practice to clean the teeth with siwak ",
                    "(toothstick) or a toothbrush before performing wudu’ ",
                    "as taught by the Prophet Muhammad s.",
                    "3.  Before starting the actions of wudu’, it is necessary to ",
                    "make your intention of washing to be for the purpose ",
                    "of wudu’ only."
                ]
            }
        },
        "Mandatory Rules": {
            "Actions which Nullify the Wudu": [
                "The following actions nullify the Wudu - i.e. it has ",
                "to be performed again in order to pray. These are in ",
                "regards to both men and women:",
                "1.  Passing wind.",
                "2.  Passing urine or faeces",
                "3.  Full mouth vomiting",
                "4.  Flowing of blood or pus from any part of the body.",
                "5.  Deep sleep, whereby one loses awareness.",
                "6.  Unconsciousness or intoxication",
                "7.  Touching the private parts with the hand and fingers ",
                "without a barrier.",
                "8.  Intimate relations*"
            ],
            "The Prophet Muhammad s said": [
                "“Whoever performs ",
                "Wudu’ well then ",
                "says, (the mentioned ",
                "supplication); the eight ",
                "gates of Paradise will ",
                "be opened for him to ",
                "enter through any one ",
                "he wills.”"
            ],
            "Notes": {
                "1": [
                    "*It is mandatory for a person to take a full bath/shower",
                    " after having intimate relations with their husband/wife in order to be",
                    " in a state of purity for prayer."
                ],
                "2": [
                    "If you put on your socks, shoes, or sandals (only those",
                    " that cover most of the foot) while you have a validWudu,",
                    " it is not necessary to take them off every time you",
                    " need to renew yourWudu. You can leave them on and wipe",
                    " the top of each covered foot once with wet hands in",
                    " place of washing the entire foot. You may do this up",
                    " to twenty-four hours, or for three days if you are on",
                    " travel."
                ]
            },
            "Tips": {
                "Wudu Tip - Forgetfullness": [
                    "If a person forgets whether they have nullified their ",
                    "wudu’ or not, then this does NOT nullify their ablution, ",
                    "regardless of whether the person is praying or not, until ",
                    "they are certain that they have nullified their ablution."
                ],
                "Wudu Tip - Menstruation": [
                    "A menstruating or post natal woman must not pray as ",
                    "long as blood is visible and her missed prayers do not ",
                    "have to be made up."
                ]
            }
        },
        "How to Perform Wudu’": {
            "THE FOLLOWING STEPS MUST BE OBSERVED IN ORDER (TARTEEB).": {
                "Step 1 - Bismillah": {
                    "Procedure": [
                        "First, make the Niyyah (intention) in your heart that this act",
                        " of Wudu is for the purpose of preparing for Salah, and",
                        " say: “Bismillah” (in the name of Allah)."
                    ],
                    "Upon looking at the water, it is recommended to say the following:": {
                        "verse-ar": [
                            "بِسْمِ اللّٰهِ وَبِاللّٰهِ اَلْحَمْدُ لِلّٰهِ الَّذِىْ جَعَلَ الْمَاۤءَ طَهُوْرًا وَلَمْ يَجْعَلْهُ",
                            " نَجِسًا۔ "
                        ],
                        "verse-la": [
                            "Bismillahi wa billahi wal hamdu lil lahil lazi ja'alal ma'a tahura",
                            " wa lam yaj alhu najisa."
                        ],
                        "verse-en": [
                            "I begin my ablution in the Name of Allah. All praise",
                            " is due to Allah, Who made water purifying, and not najis.",
                            ""
                        ]
                    }
                },
                "Step 2 - Hands": {
                    "Procedure": [
                        "Wash both hands up to the wrists (starting with the right",
                        " hand) three times, making sure that water has reached between the",
                        " fingers."
                    ],
                    "While washing the hands before performing Wudhu, one should say:": {
                        "verse-ar": [
                            "اَللّٰهُمَّ اجْعَلْنِىْ مِنَ التَّوَّابِيْنَ وَاجْعَلْنِىْ مِنَ الْمُتَطَهِّرِيْنَ۔"
                        ],
                        "verse-la": [
                            "Alla hummaj alni minat tawwabina waj alni minal mutatah hirin."
                        ],
                        "verse-en": [
                            "O Lord! Make me of those who repent and purify themselves.",
                            ""
                        ]
                    }
                },
                "Step 3 - Mouth": {
                    "Procedure": [
                        "Take water with your right hand, put it into your mouth",
                        " and rinse thoroughly three times."
                    ],
                    "While rinsing the mouth one should say:": {
                        "verse-ar": [
                            "اَللّٰهُمَّ لَقِّنِىْ حُجَّتِىْ يَوْمَ اَلْقَاكَ وَاَطْلِقْ لِسَانِىْ بِذِكْرَاكَ۔"
                        ],
                        "verse-la": [
                            "Alla Humma laq qini hujjati yawma alqaka wa atliq lisani bizikrika.",
                            ""
                        ],
                        "verse-en": [
                            "O Lord! Dictate to me the principles of faith on the",
                            " Day I meet You, and make my tongue fluent with Your",
                            " remembrance."
                        ]
                    }
                },
                "Step 4 - Nose": {
                    "Procedure": [
                        "Take water with your right hand, splash it into your nose",
                        " and blow it out three times. (Use the left hand if",
                        " necessary to help blow it out)."
                    ],
                    "While washing the nose one should say:": {
                        "verse-ar": [
                            "اَللّٰهُمَّ لَا تُحَرِّمْ عَلَىَّ رِيْحَ الْجَنَّةِ وَاجْعَلْنِىْ مِمَّنْ يَشَمُّ رِيْحَهَا وَرَوْحَهَا",
                            " وَطِيْبَهَا۔"
                        ],
                        "verse-la": [
                            "Alla humma la tuharrim 'alaya rihal jannati waj 'alni mim man",
                            " yashummu riha ha wa rawha ha wa tiba ha."
                        ],
                        "verse-en": [
                            "O Lord! Do not deprive me of the fragrance of Paradise,",
                            " and make me of those who smell its fragrance and per",
                            " fume."
                        ]
                    }
                },
                "Step 5 - Face": {
                    "Procedure": [
                        "Wash your whole face three times repeatedly. (The whole face includes:",
                        " the right ear to the left ear, and the forehead to",
                        " the bottom of the chin)."
                    ],
                    "While washing the face, one should say:": {
                        "verse-ar": [
                            "اَللّٰهُمَّ بَيِّضْ وَجْهِىْ يَوْمَ تَسْوَدُّ الْوُجُوْهُ وَلَا تُسَوِّدْ وَجْهِىْ يَوْمَ تَبْيَضُّ",
                            " الْوُجُوْهُ۔"
                        ],
                        "verse-la": [
                            "Alla humma bayyiz wajhi yawma taswaddufihil wujuh wala tusawwid waj hi",
                            " yawma tabyazzul wujuh."
                        ],
                        "verse-en": [
                            "O Lord! Make my face bright on the Day when the",
                            " faces will turn dark. Do not darken my face on the",
                            " Day when the face s are bright."
                        ]
                    }
                },
                "Step 6 - Arms": {
                    "Procedure": [
                        "Wash the right arm thoroughly from wrist to elbow three times,",
                        " and make sure that no part of the arm has been",
                        " left unwashed. Repeat with the left arm."
                    ],
                    "While pouring water over the right elbow, one should say:": {
                        "verse-ar": [
                            "اَللّٰهُمَّ اَعْطِنِىْ كِتَابِىْ بِيَمِيْنِىْ وَالْخُلْدَ فِى الْجِنَانِ بِيَسَارِىْ وَحَاسِبْنِىْ حِسَابًا يَسِيْرًا۔",
                            ""
                        ],
                        "verse-la": [
                            "Alla humma a'tini kitabi bi yamini wal khulda fil jinani bi",
                            " yasari wa hasibni hisaban yasira."
                        ],
                        "verse-en": [
                            "O Lord! Give my book of deeds in my right hand,",
                            " and a permanent stay in Paradise on my left, and make",
                            " my reckoning an easy one."
                        ]
                    }
                },
                "Step 7 - Head": {
                    "Procedure": [
                        "Move the palms of the wet hands lightly over the head,",
                        " starting from the top of the forehead to the back of",
                        " the head, and passing both hands over the back of the",
                        " head to the neck, and then bringing them back to the",
                        " forehead."
                    ],
                    "While pouring water over the left elbow, one should say:": {
                        "verse-ar": [
                            "اَللّٰهُمَّ لَا تُعْطِنِىْ كِتَابِىْ بِشِمَالِىْ وَلَا مِنْ وَرَاۤءِ ظَهْرِىْ وَلَا تَجْعَلْهَا",
                            " مَغْلُوْلَةً اِلٰى عُنُقِىْ وَاَعُوْذُ بِكَ مِنْ مُقَطَّعَاتِ النِّيْرَانِ۔"
                        ],
                        "verse-la": [
                            "Alla humma la tutini kitabi bishimali wala min wara'i zahri wala",
                            " taj alha maghlu latan ila unuqi wa a'uzu bika min muqat",
                            " ta'atin niran."
                        ],
                        "verse-en": [
                            "O Lord! Do not give my book of deeds in my",
                            " left hand, n or from behind my back, nor chain it",
                            " to my neck. I seek refuge in You from the Hell-fire.",
                            ""
                        ]
                    }
                },
                "Step 8 – Ears": {
                    "Procedure": [
                        "With the same water, rub the grooves and holes of both",
                        " ears with the wet index fingers, while also passing the wet",
                        " thumbs behind the ears from the bottom upward."
                    ],
                    "While performing the wiping of the head, one should say:": {
                        "verse-ar": [
                            "اَللّٰهُمَّ غَشِّنِىْ رَحْمَتَكَ وَبَرَكَاتِكَ۔"
                        ],
                        "verse-la": [
                            "Alla humma ghashshini bi rahmatika wa barakatika wa 'afwika."
                        ],
                        "verse-en": [
                            "O Lord! Cover me with Your Mercy, Blessings and Forgiveness."
                        ]
                    }
                },
                "Step 9 – Feet": {
                    "Procedure": [
                        "Finally, wash both feet to the ankles three times, starting with",
                        " the right foot. Make sure that water has reached between the",
                        " toes and covered the rest of the foot."
                    ],
                    "While performing the wiping of the feet, one should say:": {
                        "verse-ar": [
                            "اَللّٰهُمَّ ثَبِّتْنِىْ عَلَى الصِّرَاطِ يَوْمَ تَزِلُّ الْاَقْدَامُ وَاجْعَلْ سَعْيِىْ فِيْمَا يُرْضِيْكَ",
                            " عَنِّىْ يَا ذَاالْجَلَالِ وَالْاِكْرَامِ۔"
                        ],
                        "verse-la": [
                            "Alla humma thabbitni alas sirati yawma tazillu fihil aqdam. Waj'al sa'yi",
                            " fi ma yurzika 'anni ya zal jalali wal ikram."
                        ],
                        "verse-en": [
                            "O Lord! Keep me firm on the Bridge (to Paradise) on",
                            " the Day when the feet will slip, and help me in",
                            " my efforts to do things which will please You, O' Glorious",
                            " and Mighty!."
                        ]
                    }
                },
                "Step 10 - Closing Du’a/Invocation": {
                    "Procedure": [
                        "At the end of the above steps recite: “Ashhadu alla ilaha",
                        " illallahu, wa ash-hadu anna muhammadan abduhu wa rasuluhu.” “أشهد أن لا",
                        " إ له إلا الله وحده لا شريك له، و أشهد أن",
                        " محمدا عبده و رسوله” This means: “I bear witness that there",
                        " is no deity worthy of worship except Allah alone, and I",
                        " bear witness that Muhammad is His servant and His messenger.”"
                    ],
                    "Upon completion say the following:": {
                        "verse-ar": [
                            "اللّٰهُمَّ اِنّى اَسْئَلُكَ تَمَامَ الْوُضُوْءِ وَتَمَامَ الصَّلَاةِ وَتَمَامَ رِضْوَانِكَ وَالْجَنَّةَ۔ -وتمام",
                            " مغفرتك- اَلْحَمْدُ لِلّٰهِ رَبِّ الْعَالَمِيْنَ۔- سُبحانك اللهمَّ وبحمدك ، أشهدُ أنْ",
                            " لا إلهَ إلا أنت ، أستغفرُكَ وأتوبُ إليك ، وأشهدُ أنَّ",
                            " محمدًا عبدُكَ ورسولُك ، وأشهدُ أنَّ عليًّا وليُّك وخليفتُك بعد نبيِّك",
                            " على خلقك ، وأنَّ أولياءَهُ أولياؤك ، وخُلفاءَهُ خُلفاؤك ، وأوصياءَهُ",
                            " أوصياؤك"
                        ],
                        "info": [
                            "Recite Surah al-Qadr (No. 97) three times and apply fragrance to",
                            " your clothes and body."
                        ]
                    }
                }
            }
        }
    }
}