{
    "Wudu-Guide": {
        "Introduction": {
            "Wudu’ Foundations": {
                "The Importance Of Wudu": [
                    "The Prophet Muhammad s said: “Salah (prayer) of",
                    "anyone of you who has invalidated his/her purification",
                    "is not accepted unless he/she makes wudu’’. (Bukhari)"
                ],
                "The Virtues Of Wudu’": [
                    "The Prophet Muhammad s said: “When the Muslim",
                    "or believing servant performs ablution and washes",
                    "his/her face, each sin he/she has committed by his/ her eyes washes away with the water. When he/she",
                    "washes his/her hands, each sin his/her hands have",
                    "committed washes away with the water – or with the",
                    "last drop of water until he/she becomes free of sin.”",
                    "(Malik and others)."
                ],
                "Before Doing Wudu’": {
                    "1": "Go to the toilet first (if required). You should use the toilet and then wash the private parts before performing wudu’. ",
                    "2": "It is good practice to clean the teeth with siwak (toothstick) or a toothbrush before performing wudu’ as taught by the Prophet Muhammad s. ",
                    "3": "Before starting the actions of wudu’, it is necessary to make your intention of washing to be for the purpose of wudu’ only. "
                }
            }
        },
        "Mandatory-Rules": {
            "Actions which Nullify the Wudu": {
                "Rules": [
                    "The following actions nullify the Wudu - i.e. it has ",
                    "to be performed again in order to pray. These are in ",
                    "regards to both men and women:",
                    "1.  Passing wind.",
                    "2.  Passing urine or faeces",
                    "3.  Full mouth vomiting",
                    "4.  Flowing of blood or pus from any part of the body.",
                    "5.  Deep sleep, whereby one loses awareness.",
                    "6.  Unconsciousness or intoxication",
                    "7.  Touching the private parts with the hand and fingers ",
                    "without a barrier.",
                    "8.  Intimate relations*"
                ],
                "NOTES": [
                    "*It is mandatory ",
                    "for a person to ",
                    "take a full bath/",
                    "shower after ",
                    "having intimate ",
                    "relations with ",
                    "their husband/",
                    "wife in order to ",
                    "be in a state of ",
                    "purity for prayer.",
                    [
                        "*If you put on your socks, shoes, or sandals (only those",
                        " that cover most of the foot) while you have a valid",
                        " Wudu, it is not necessary to take them off every time",
                        " you need to renew your Wudu.  You can leave them on",
                        " and wipe the top of each covered foot once with wet",
                        " hands in place of washing the entire foot. You may do",
                        " this up to twenty-four hours, or for three days if you",
                        " are on travel."
                    ]
                ],
                "Tips": {
                    "Wudu Tip - Forgetfullness": [
                        "If a person forgets whether they have nullified their ",
                        "wudu’ or not, then this does NOT nullify their ablution, ",
                        "regardless of whether the person is praying or not, until ",
                        "they are certain that they have nullified their ablution."
                    ],
                    "Wudu Tip - Menstruation": [
                        "A menstruating or post natal woman must not pray as ",
                        "long as blood is visible and her missed prayers do not ",
                        "have to be made up."
                    ],
                    "The Prophet Muhammad s said:": "“Whoever performs Wudu’ well then says, (the mentioned supplication); the eight gates of Paradise will be opened for him to enter through any one he wills.”"
                }
            }
        },
        "How to Perform Wudu’": {
            "THE FOLLOWING STEPS MUST BE OBSERVED IN ORDER (TARTEEB).": {
                "Step 1 - Bismillah": "First, make the Niyyah (intention) in your heart that this act of Wudu is for the purpose of preparing for Salah, and say: “Bismillah” (in the name of Allah).",
                "Step 2 - Hands": "Wash both hands up to the wrists (starting with the right hand) three times, making sure that water has reached between the fingers.",
                "Step 3 - Mouth": "Take water with your right hand, put it into your mouth and rinse thoroughly three times.",
                "Step 4 - Nose": "Take water with your right hand, splash it into your nose and blow it out three times. (Use the left hand if necessary to help blow it out).",
                "Step 5 - Face": "Wash your whole face three times repeatedly. (The whole face includes: the right ear to the left ear, and the forehead to the bottom of the chin).",
                "Step 6 - Arms": "Wash the right arm thoroughly from wrist to elbow three times, and make sure that no part of the arm has been left unwashed.  Repeat with the left arm.",
                "Step 7 - Head": "Move the palms of the wet hands lightly over the head, starting from the top of the forehead to the back of the head, and passing both hands over the back of the head to the neck, and then bringing them back to the forehead.",
                "Step 8 – Ears": "With the same water, rub the grooves and holes of both ears with the wet index fingers, while also passing the wet thumbs behind the ears from the bottom upward.",
                "Step 9 – Feet": "Finally, wash both feet to the ankles three times, starting with the right foot.  Make sure that water has reached between the toes and covered the rest of the foot.",
                "Step 10 - Closing Du’a/Invocation": [
                    "Recite: Ash-hadu anllaa ilaaha illallaah wa ash-hadu  anna Muhammadan ‘abduhu wa",
                    " rasooluh (I bear witness that there is no God worthy of",
                    " worship  except Allah. And I bear witness that Muhammad is His",
                    "  slave and Messenger.) ُلو س ر و هُدْب عا  ًد ّ",
                    " م ح م  ّ نَا ُد َهــ شَا  و  ّللها  َلِا",
                    "  لِا  ّل  نا ُد َه شا and: Allahuma ij-’alnee minat-tawabeen waj-’alnee",
                    "  minalmutatahireen Oh Allah, make me among those who turn in repentance",
                    " to  you and make me among those who purify themselves ني",
                    " ِر ِ ّهَط تُم لا  نِم يــِن ع ل جا و",
                    " َينِبا َ ّوَ ّتلا  نِم يِن ع ل جا َ ُمــَ",
                    " ّللا"
                ]
            }
        }
    }
}