{
    "id": 105,
    "name_simple": "Al-Fil",
    "revelation_place": "makkah",
    "revelation_order": 19,
    "bismillah_pre": true,
    "verses_count": 5,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah derives its name from the word ashab al fil in the very first verse.",
    "text": [
        "The Surah derives its name from the word ashab al fil in the very first verse.",
        "Period of Revelation",
        "This is unanimously a Makki Surah; and if it is studied against its historical background it appears that it must have been sent down in the very earliest stage in Makkah.",
        "Historical Background",
        "As we have explained in footnote 4 of Surah Al-Buruj, in retaliation for the persecution of the followers of the Prophet Jesus Christ (peace be on him) in Najran by the Jewish ruler Dhu-Nuwas of Yemen, the Christian kingdom of Abyssinia invaded Yemen and put an end to the Himyarite rule there, and in 525 A.D. this whole land passed under Abyssinian control. This happened, in fact, through collaboration between the Byzantine empire of Constantinople and the Abyssinian kingdom, for the Abyssinians at that time had no naval fleet. The fleet was provided by the Byzantines and Abyssinia sent 70,000 of its troops by it across the Red Sea to Yemen. From the outset one should understand that all this did not happen due to religious zeal but there were economic and political factors also working behind it, and these were probably the real motive, with retaliation for the Christian blood being an excuse. Since the time the Byzantine empire had occupied Egypt and Syria, it had been trying to gain control over the trade going on between East Africa, India, Indonesia, etc., and the Byzantine dominions from the Arabs, who had been controlling it for centuries, so as to earn maximum profits by eliminating the intermediary Arab merchants. For this purpose, in 24 or 25 B.C., Caesar Augustus sent a large army under the Roman general, Aelius Gallus, which landed on the western coast of Arabia, in order to intercept and occupy the sea route between southern Arabia and Syria (See map of this trade route on p. 111 of The Meaning of the Qur'an, vol. iv). However the campaign failed to achieve its objective on account of the extreme geographical conditions of Arabia. After this, the Byzantines brought their fleet into the Red Sea and put an end to the Arab trade which they carried out by sea, with the result that they were left only with the land route. To capture this land route they conspired with the Abyssinian Christians and aiding them with their fleet, helped them to occupy Yemen.",
        "The Arab historians' statements about the Abyssinian army that invaded Yemen are different. Hafiz Ibn Kathir says that it was led by two commanders, Aryat and Abrahah, and according to Muhammad bin Ishaq, its commander was Aryat, and Abrahah was included in it. Both agreed that Aryat and Abrahah fell out, Aryat was killed in the encounter, and Abrahah took possession of the country; then somehow he persuaded the Abyssinian king to appoint him as his viceroy over Yemen.",
        "On the contrary, the Greek and Syrian historians state that after the conquest of Yemen, the Abyssinians started putting the Yamanite chiefs, who had put up resistance to death, when one of the chiefs, named As-Sumayfi Ashwa (whom the Greek historians call Esymphaeus) yielded to the Abyssinians and promising to pay tribute, obtained the Abyssinian king's warrant to be governor over Yemen. But the Abyssinian army revolted against him and made Abrahah governor in his place. This man was the slave of a Greek merchant of the Abyssinian seaport of Adolis, who by clever diplomacy had come to wield great influence in the Abyssinian army occupying Yemen. The troops sent by the Negus to punish him either warned him or were defeated by him. Subsequently, after the death of the king, his successor was reconciled to accept him as his vice regent of Yemen. (The Greek historians refer to him as Abrames and the Syrian historians as Abraham. Abrahah perhaps is an Abyssinian variant of Abraham, for its Arabic version is Ibrahim).",
        "This man through passage of time became an independent ruler of Yemen. He acknowledged the sovereignty of the Negus only in name and described himself as his deputy. The influence he wielded can be judged from the fact that after the restoration of the dam of Marib in 543 A.D. he celebrated the event by holding a grand feast, which was attended by the ambassadors of the Byzantine emperor, king of Iran, king of Hirah, and king of Ghassan. Its full details are given in the inscription that Abrahah installed on the dam. This inscription is extant and Glaser has published it. (For further details, see footnote 37 of the commentary of Surah Saba).",
        "After stabilizing his rule in Yemen, Abrahah turned his attention to the objective which from the very beginning of this campaign before the Byzantine empire and its allies, had been the Abyssinian Christians, i.e. to spread Christianity in Arabia on the one hand, and to capture the trade that was carried out through the Arabs between the eastern lands and the Byzantine dominions, on the other. The need for this increased because the Byzantine struggle for power against the Sasanian empire of Iran had blocked all the routes of the Byzantine trade with the East.",
        "To achieve this objective, Abrahah built in Sana, the capital of Yemen, a magnificent cathedral, called by the Arabian historians al-Qalis, al-Qullais, or al-Qulais, this word being an Arabic version of the Greek word Ekklesia, church. According, to Muhammad bin Ishaq, after having completed the building, he wrote to the Negus, saying: \"I shall not rest until I have diverted the Arabs pilgrimage to it.\" Ibn Kathir writes that he openly declared his intention in Yemen and got it publicly announced. He in fact, wanted to provoke the Arabs into doing something which should provide him with an excuse to attack Makkah and destroy the Ka'bah. Muhammad bin Ishaq says that an Arab, enraged at this public proclamation somehow went into the cathedral and defiled it. Ibn Kathir says this was done by a Quraishite and according to Muqatil bin Suleman, some young men of the Quraish had set fire to the cathedral. Either might have happened, for Abrahah's proclamation was certainly provocative and in the ancient pre-Islamic age it cannot be impossible that an Arab, or a Quraishite youth, might have been enraged and might have defiled the cathedral, or set fire to it. But it may well also be that Abrahah himself got this done secretly by his own agent so as to have an excuse for invading Makkah and thus achieving both his objectives by destroying the Quraish and intimidating the Arabs. In any case, whatever happened, when the report reached Abrahah that the devotees of the Ka'bah had thus defiled his cathedral, he swore that he would not rest until he had destroyed the Ka'bah.",
        "So, in 570 or 571 A. D., he took 60,000 troops and 13 elephants (according to another tradition, 9 elephants) and set off for Makkah. On the way, first a Yamanite chief, Dhu Nafr by name, mustering an army of the Arabs, resisted him but was defeated and taken prisoner. Then in the country of Khath'am he was opposed by Nufail bin Habib al-Khath'am, with his tribe, but he too was defeated and taken prisoner, and in order to save his life he accepted to serve him as a guide in the Arab country. When he reached near Ta'if, Bani Thaqif felt that they would not be able to resist such a big force and feeling the danger lest he should destroy the temple of their deity Lat, too; their chief, Mas'ud came out to Abrahah with his men, and told him that their temple was not the temple he had come to destroy. The temple he sought was in Makkah, and they would send with him a man to guide him there. Abrahah accepted the offer, and Bani Thaqif sent Abu Righal as a guide with him. When they reached al-Mughammas (or al- Mughammis), a place about 3 miles short of Makkah, Abu Righal died, and the Arabs stoned his grave and the practice survives to this day. They cursed the Bani Thaqif too, for in order to save the temple of Lat they had cooperated with the invaders of the House of Allah.",
        "According to Muhammad bin Ishaq, from al- Mughammas, Abrahah sent forward his vanguard and they brought him the plunder of the people of Tihamah and Quraish, which included two hundred camels of Abdul Muttalib, the grandfather of the Holy Messenger of Allah (upon whom be His peace). Then, he sent an envoy of his to Makkah with the message that he had not come to fight the people of Makkah but only to destroy the House (i. e. the Ka'bah). If they offered no resistance, there would be no cause for bloodshed. Abrahah also instructed his envoy that if the people of Makkah wanted to negotiate, he should return with their leading chief. The leading chief of Makkah at that time was Abdul Muttalib. The envoy went to him and delivered Abrahah's message. Abdul Muttalib replied: \"We have no power to fight Abrahah. This is Allah's House. If He wills, He will save His House.\" The envoy asked him to go with them to Abrahah. He agreed and accompanied him to the king. Now Abdul Muttalib was such a dignified and handsome man that when Abrahah saw him, he was very impressed; he got off his throne and sat beside him on the carpet. Then he asked him what he wanted. Abdul Muttalib replied that he wanted the king to return his camels which he had taken. Abrahah said: \"I was very impressed when I saw you but your reply has brought you down in my eyes: you only demand your camels but you say nothing about this House which is your sanctuary and the sanctuary of your forefathers.\" Abdul Muttalib replied: \"I am the owner of my camels and am requesting you to return them. As for the House, it has its own Owner: He will defend it.\" When Abrahah said that Abdul Muttalib would not be able to defend the Ka'bah against him, Abdul Muttalib said that that rested between Allah and Abrahah. With this, Abdul Muttalib left Abrahah and he restored to him his camels.",
        "Ibn Abbas' tradition is different. It does not mention the demand for the camels at all. According to the traditions related from him by Abd bin Humaid, Ibn al-Mundhir, lbn Marduyah, Hakim, Abu Nuaim and Baihaqi, he states that when Abrahah reached As-Sifah (a place situated between Arafat and Taif in the mountains near the sacred bounds of Makkah), Abdul Muttalib went to him and said: \"There was no need for you to come so far. You should have ordered us and we would have brought before you whatever you needed.\" He said: \"I hear that this House is the House of peace: I have come to destroy its peace.\" Thereupon, Abdul Muttalib said: \"This is Allah's House. He has not allowed anyone so far to dominate it.\" Abrahah replied: \"We will not return until we have destroyed it.\" Abdul Muttalib said:\"You may take whatever you like from us and return.\" Abrahah refused to budge and ordered his troops to advance, leaving Abdul Muttalib behind.",
        "Leaving the two traditions as they are, one thing which becomes evident is that the tribes living in and around Makkah did not have the power to fight such a big force and save the Ka'bah. Therefore, obviously the Quraish did not try to put up any resistance. The Quraish on the occasion of the Battle of the Trench (Ahzab) had hardly been able to muster strength numbering ten to twelve thousand men in spite of the alliance with the pagan and Jewish tribes; they could not have resisted an army 60,000 strong.",
        "Muhammad bin Ishaq says that after returning from the camp of Abrahah, Abdul Muttalib ordered the Quraish to withdraw from the city and go to the mountains along with their families for fear of a general massacre. Then he went to the Ka'bah along with some chiefs of the Quraish and taking hold of the iron ring of the door, prayed to Allah Almighty to protect His House and its keepers. There were at that time 360 idols in and around the Ka'bah, but at that critical moment they forgot them and implored only Allah for help. Their supplications which have been reported in the books of history do not contain any name but the name of Allah, the One. ",
        "Ibn Hisham in his Life of the Prophet has cited some verses of Abdul Muttalib, which are to the following effect: \"O God, a man protects his house, so protect Your House; Let not their cross and their craft tomorrow overcome Your craft. If You will to leave them and our qiblah to themselves, You may do as You please.\"",
        "Suhail in Raud al-Unuf has cited this verse also in connection: \"Help today Your devotees against the devotees of the cross and its worshipers.\"",
        "Ibn Jarir has cited this supplication of Abdul Muttalib also: \"O my Lord, I do not cherish any hope from anyone against them except You. O my Lord, protect Your House from them. The enemy of this House is Your enemy. Stop them from destroying Your settlement.\"",
        "After making these supplications, Abdul Muttalib and his companions also went off to the mountains. The next morning, Abrahah prepared to enter Makkah, but his special elephant, Mahmud, which was in the forefront, knelt down. It was beaten with iron bars, goaded, even threatened, but it would not get up. When they made it face south, north, or east, it would immediately start off, but as soon as they directed it towards Makkah, it knelt down. In the meantime swarms of birds appeared carrying stones in their beaks and claws and showered these on the troops. Whoever was hit would start disintegrating. According to Muhammad bin Ishaq and Ikrimah, this was smallpox, which was seen in Arabia for the first time in that year. Ibn Abbas says that whoever was struck by a pebble, would start scratching his body resulting in breaking of the skin and falling off of the flesh. In another tradition Ibn Abbas says that the flesh and blood flowed like water and bones in the body became visible. The same thing happened with Abrahah too. His flesh fell in pieces and there arose bores on his body emitting pus and blood. In confusion they withdrew and fled towards Yemen. Nufail bin Habib, whom they had brought as guide from the country of Khatham, was searched for and asked to guide them back to Yemen, but he refused and said: \"Now where can one flee when God pursues? The split nose (Abrahah) is the conquered; not the conqueror.\"",
        "As they withdrew they were continually falling by the bay and dying. Ata bin Yasar says that all the troops did not perish at the spot; some perished there and others perished by the wayside as they withdrew. Abrahah died in the country of Khath'am.",
        "This event took place at Muhassir by the Muhassab valley, between Muzdalifah and Mina. According to the Sahih of Muslim and Abu Da'ud, in the description of the Holy Prophet's farewell pilgrimage that Imam Jafar as-Sadiq has related from his father, Imam Muhammad Baqir, and he from Hadrat Jabir bin Abdullah, he says that when the Holy Prophet (upon whom be peace) proceeded from Muzdalifah to Mina, he increased his speed in the valley of Muhassir. Imam Nawawi has explained this saying that the incident of the people of the elephant had occurred there; therefore, the pilgrims have been enjoined to pass by quickly, for Muhassir is a tormented place. Imam Malik in Mu'atta has related that the Holy Prophet said that the whole of Muzdalifah is a fit place for staying but one should not stay in the valley of Muhassir.",
        "In the verses of Nufail bin Habib, which Ibn Ishaq has cited, he describes this event as an eyewitness: \"Would that you had seen, O Rudaina, but you would not see, What we saw by the valley of Muhassab. I praised God when I saw the birds, and I feared lest the stones should fall upon us. Everyone was asking for Nufail as though I owned the Abyssinians a debt.\"",
        "This was such a momentous event that it soon spread throughout Arabia and many poets made it the subject of their laudatory poems. In these poems one thing quite evident is that everyone regarded it as a manifestation of Allah Almighty's miraculous power, and no one, even by allusion, said that the idols which were worshiped in the Ka'bah had anything to do with it. For example, Abdullah ibn Az-Zibara says: \"The sixty thousand returned not home, nor did their sick man (Abrahah) survive on return. Ad and Jurham were there before them, And there is Allah, above the servants, Who sustains it.\"",
        "Abu Qais bin Aslat says: \"Rise and worship your Lord and anoint The Corners of the House of Allah between the Mountains of Makkah and Mina. When the help of the Owner of the Throne reached you, His armies repulsed them so that they were lying in dust, pelted with stones.\"",
        "Not only this, but according to Hadrat Umm Hani and Hadrat Zubair bin al-Awwam, the Holy Prophet (upon whom be peace) said:\"The Quraish did not worship anyone but Allah, the Only and One, for ten years\" (and according to others, for seven years. Umm Hani's tradition has been related by Imam Bukhari in his History and by Tabarani, Hakim, Ibn Marduyah and Baihaqi in their collections of Ahadith. Hadrat Zubair's statement has been related by Tabarani, Ibn Marduyah and Ibn Asakir, and this is further confirmed by the mursal tradition of Hadrat Sa'id bin al Musayyab, which Khatib Baghdadi has recorded in his History.",
        "The Arabs describe the year in which this event took place as Am al-Fil (the year of the elephants), and in the same year the Holy Messenger of Allah (upon whom be peace) was born. The traditionists and historians almost unanimously state that the event of the people of the elephant had occurred in Muharram and the Holy Prophet was born in Rabi al-Awwal. A majority of them states that he was born 50 days after the event of the elephant.",
        "Theme and Substance",
        "If Surah al-Fil is studied in the light of the historical details given above, one can fully understand well why in this Surah only Allah's inflicting His punishment on the people of the elephant has been referred to and described so briefly. It was an event of recent occurrence, and everyone in Makkah and Arabia was fully aware of it. The Arabs believed that the Ka'bah had been protected in this invasion not by any god or goddess but by Allah Almighty Himself. Then Allah alone had been invoked by the Quraish chiefs for help, and for quite a few years the people of Quraish having been impressed by this event, had worshiped none but Allah. Therefore, there was no need to mention the details in Surah al-Fil, but only a reference to it was enough so that the people of Quraish in particular, and the people of Arabia in general, should consider well in their hearts the message that the Holy Prophet Muhammad (upon whom be Allah's peace and blessings) was giving. For, the only message that he gave was that they should worship and serve none but Allah, the Only and One. Then, they should also consider that if they used force to suppress this invitation to the truth, they would only be inviting the wrath of God, Who had so completely defeated and destroyed the people of the elephants."
    ],
    "description": "The surah that tells of the destruction of the armed force that came to be known as the company of The Elephant, after the animal they intended to use to destroy the Kaʿbah, in the generation before the advent of Islam. This surah is a reference to events that happened in 570 CE, the year of the Prophet Muḥammads birth. It takes its name from “the elephant” (al-fīl) mentioned in verse 2, which refers to the force dispatched by Abrahah (a Christian ruler of Yemen) to Mecca, that is “the men of the elephant” (aṣḥāb al-fīl). The destruction of this army is cited here to encourage the believers and warn the disbelievers.",
    "name_translation": "THE ELEPHANT",
    "name_complex": "Al-Fîl",
    "surah_name_ar": "الفيل",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 105:1": "Vallë, a nuk ke dëgjuar ti se si ka vepruar Zoti yt me ushtrinë (pronarët) e elefantëve?!",
                            "verse 105:2": "A nuk ju shkuankot dinakëritë e tyre,",
                            "verse 105:3": "e dërgoi kundër tyre tufa zogjësh – (Ebabilash),",
                            "verse 105:4": "të cilët hedhnin mbi ta copa dheu (të forcuara si gurë),",
                            "verse 105:5": "e i bëri ata si ndonjë gjeth që është hëngër (prej krimit – tëjes)? gurë),"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "(Ya Peyğəmbər!) Məgər Rəbbinin fil sahiblərinə (Kə'bəni dağıtmaq üçün fillərlə Məkkənin üstünə gələn həbəş ordusuna) nələr etdiyini görmədinmi?!",
                            "verse 105:2": "Məgər (Rəbbin) onların hiyləsini boşa çıxartmadımı?!",
                            "verse 105:3": "Onların üstünə qatar-qatar quşlar (əbabil quşları) göndərdi.",
                            "verse 105:4": "(O quşlar) onlara bişmiş gildən düzəlmiş (möhkəm xırda) daşlar atırdı.",
                            "verse 105:5": "(Rəbbin) onları (həşərat tərəfindən) yeyilmiş əkin yarpağına (saman çöpünə) döndərdi!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Zar nisi čuo šta je sa vlasnicima slona Gospodar tvoj uradio!",
                            "verse 105:2": "Zar lukavstvo njihovo nije omeo",
                            "verse 105:3": "i protiv njih jata ptica poslao,",
                            "verse 105:4": "koje su na njih grumenje od gline pečene bacale,",
                            "verse 105:5": "pa ih On kao lišće koje su crvi istočili učinio? bacale,"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "আপনি কি দেখেননি আপনার পালনকর্তা হস্তীবাহিনীর সাথে কিরূপ ব্যবহার করেছেন?",
                            "verse 105:2": "তিনি কি তাদের চক্রান্ত নস্যাৎ করে দেননি?",
                            "verse 105:3": "তিনি তাদের উপর প্রেরণ করেছেন ঝাঁকে ঝাঁকে পাখী,",
                            "verse 105:4": "যারা তাদের উপর পাথরের কংকর নিক্ষেপ করছিল।",
                            "verse 105:5": "অতঃপর তিনি তাদেরকে ভক্ষিত তৃণসদৃশ করে দেন। করছিল।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 105:1": "Не видя ли [о, Мухаммад] как постъпи твоят Господ с владетелите на слона?",
                            "verse 105:2": "Не превърна ли Той коварството им в заблуда?",
                            "verse 105:3": "И изпрати срещу тях ята от птици,",
                            "verse 105:4": "които ги замеряха с камъни от печена глина.",
                            "verse 105:5": "И ги стори да приличат на проядени листа."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "難道你不知道你的主怎樣處治象的主人們嗎？",
                            "verse 105:2": "難道他沒有使他們的計謀 ,變成無益的嗎？",
                            "verse 105:3": "他曾派遣成群的鳥去傷他們 ,",
                            "verse 105:4": "以粘土石射擊他們 ,",
                            "verse 105:5": "使他們變成吃剩的乾草一樣。 ,"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Neviděls, jak naložil Pán tvůj s lidmi slona?",
                            "verse 105:2": "Což neobrátil úklad jejich ve zmatky",
                            "verse 105:3": "a neposlal na ně v hejnech ptáky,",
                            "verse 105:4": "kteří po nich vrhali oblázky z hlíny pálené,",
                            "verse 105:5": "a učinil, že podobnými byli slámě ohryzané? pálené,"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Hebt gij niet vernomen, hoe uw Heer de bezitters der olifanten behandelde?",
                            "verse 105:2": "Heeft Hij hun plannen niet teniet gedaan?",
                            "verse 105:3": "Zond Hij geen zwermen vogels op hen neer?",
                            "verse 105:4": "En wierpen deze geen klompen klei?",
                            "verse 105:5": "Dat hen maakte als fijn gekauwd (door het vee) stro? klei?"
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 105:1": "Hast thou not seen how thy Lord dealt with the owners of the Elephant ?",
                            "verse 105:2": "Did He not bring their stratagem to naught,",
                            "verse 105:3": "And send against them swarms of flying creatures,",
                            "verse 105:4": "Which pelted them with stones of baked clay,",
                            "verse 105:5": "And made them like green crops devoured (by cattle) ? clay,"
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 105:1": "Seest thou not how thy Lord dealt with the Companions of the Elephant?",
                            "verse 105:2": "Did He not make their treacherous plan go astray?",
                            "verse 105:3": "And He sent against them Flights of Birds,",
                            "verse 105:4": "Striking them with stones of baked clay.",
                            "verse 105:5": "Then did He make them like an empty field of stalks and straw, (of which the corn) has been eaten up."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 105:1": "Hast thou not seen how thy Lord did with the Men of the Elephant?",
                            "verse 105:2": "Did He not make their guile to go astray?",
                            "verse 105:3": "And He loosed upon them birds in flights,",
                            "verse 105:4": "hurling against them stones of baked clay",
                            "verse 105:5": "and He made them like green blades devoured."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 105:1": "ART THOU NOT aware of how thy Sustainer dealt with the Army of the Elephant?",
                            "verse 105:2": "Did He not utterly confound their artful planning?",
                            "verse 105:3": "Thus, He let loose upon them great swarms of flying creatures",
                            "verse 105:4": "which smote them with stone-hard blows of chastisement pre-ordained,",
                            "verse 105:5": "and caused them to become like a field of grain that has been eaten down to stubble"
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 105:1": "Hast thou not seen how they Lord dealt with the masters of the elephant?",
                            "verse 105:2": "",
                            "verse 105:3": "Did He not turn their plots awry?",
                            "verse 105:4": "",
                            "verse 105:5": "He sent upon them dense clouds of birds.",
                            "verse 105:6": "",
                            "verse 105:7": "That pelted them with inscribed stones.",
                            "verse 105:8": "",
                            "verse 105:9": "Thus made He them like greenery eaten down.",
                            "verse 105:10": "Sources",
                            "verse 105:11": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 105:12": "The Book of Certainty (1952) •",
                            "verse 105:13": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 105:14": "What is Sufism (1975) •",
                            "verse 105:15": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 105:16": "Muhammad (1983) •",
                            "verse 105:17": "Symbol and Archetype (1991) •",
                            "verse 105:18": "Sufi Poems (2004) •",
                            "verse 105:19": "Mecca (2004) •",
                            "verse 105:20": "Return to the Spirit (2005) •",
                            "verse 105:21": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 105:22": "“Proofs of Islam”(1954).",
                            "verse 105:23": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 105:24": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 105:25": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 105:26": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 105:27": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 105:28": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 105:29": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 105:30": "“The Quranic Origins of Sufism” •",
                            "verse 105:31": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 105:32": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 105:33": "“An Introduction to Islam” •",
                            "verse 105:34": "“The Universality of the Quran” •",
                            "verse 105:35": "Private Talks Books",
                            "verse 105:36": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 105:1": "Have you not seen how your Lord dealt with the People of the Elephant?",
                            "verse 105:2": "Has He not turned their plan into nullity?",
                            "verse 105:3": "And He sent upon them flying birds in flocks,",
                            "verse 105:4": "throwing upon them stones of baked clay,",
                            "verse 105:5": "and thus He turned them into an eaten-up chaff."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 105:1": "Have you not considered the way in which your Lord dealt with the Men of the Elephant?",
                            "verse 105:2": "Did He not make their stratagem go astray,",
                            "verse 105:3": "and unleashed upon them swarms of birds,",
                            "verse 105:4": "pelting them with stones of baked clay,",
                            "verse 105:5": "thus making them like devoured blades? clay,"
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 105:1": "Have you not seen how your Lord dealt with those who had elephants?",
                            "verse 105:2": "Did He not thwart their crafty designs?",
                            "verse 105:3": "And He sent on to them (ambient) swarms of birds,",
                            "verse 105:4": "Which pelted them with stone-hard slugs.",
                            "verse 105:5": "Then (Allah made them perish) like chewed-up chaff."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Etkö ole Miettinyt mitä Herrasi teki niille, jotka norsuilla hyökkäsivät?",
                            "verse 105:2": "Eikö Hän saattanut sekasortoon heidän sotaretkensä?",
                            "verse 105:3": "Ja lähettänyt heitä vastaan lintuparvia,",
                            "verse 105:4": "jotka sinkoutuivat heihin kovien kivien lailla.",
                            "verse 105:5": "Näin Hän teki heistä kuin madonsyömää pellonsänkeä."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 105:1": "N'as-tu pas vu comment ton Seigneur a agi envers les compagnons de l'éléphant ?",
                            "verse 105:2": "N'a-t-il pas déjoué leur stratagème,",
                            "verse 105:3": "et envoyé contre eux des nuées d'oiseaux",
                            "verse 105:4": "qui leur ont lancé des pierres marquées de sceaux.",
                            "verse 105:5": "Il les a alors rendus semblables à du chaume dévoré."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 105:1": "N’as-tu pas vu comment ton Seigneur a agi envers les gens de l’éléphant .",
                            "verse 105:2": "N’a-t-Il pas rendu leur ruse complètement vaine ?",
                            "verse 105:3": "et envoyé sur eux des oiseaux par volées",
                            "verse 105:4": "qui leur lançaient des pierres d’argile ?",
                            "verse 105:5": "Et Il les a rendus semblables à une paille mâchée."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Hast du nicht gesehen, wie dein Herr mit den Besitzern des Elefanten verfuhr?",
                            "verse 105:2": "Machte Er nicht ihren Anschlag zunichte?",
                            "verse 105:3": "Und Er sandte Schwärme von Vögeln wider sie,",
                            "verse 105:4": "Die die Ziegel aus Steine von Ton auf sie warfen;",
                            "verse 105:5": "Und Er machte sie gleich abgeweideten Halmen."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": ",s jlwy D;k rqeus ugha ns[kk fd rqEgkjs ijojfnxkj us gkFkh okyksa ds lkFk D;k fd;k",
                            "verse 105:2": "D;k mlus mudh reke rn~chjsa x+yr ugha dj nha ¼t+:j½",
                            "verse 105:3": "vkSj mu ij >qUM dh >qUM fpfM+;k¡ Hkst nha",
                            "verse 105:4": "tks mu ij [kjUtksa dh dadfj;k¡ Qsdrh Fkha",
                            "verse 105:5": "rks mUgsa pck, gq, Hkwl dh ¼rckg½ dj fn;k"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Apakah kamu tidak memperhatikan bagaimana Tuhanmu telah bertindak terhadap tentara bergajah?",
                            "verse 105:2": "Bukankah Dia telah menjadikan tipu daya mereka (untuk menghancurkan Ka’bah) itu sia-sia?,",
                            "verse 105:3": "Dan Dia mengirimkan kepada mereka burung yang berbondong-bondong,",
                            "verse 105:4": "yang melempari mereka dengan batu (berasal) dari tanah yang terbakar,",
                            "verse 105:5": "lalu Dia menjadikan mereka seperti daun-daun yang dimakan (ulat)."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Non hai visto come agì il tuo Signore con quelli dell'elefante?",
                            "verse 105:2": "Non fece fallire le loro astuzie?",
                            "verse 105:3": "Mandò contro di loro stormi di uccelli",
                            "verse 105:4": "lancianti su di loro pietre di argilla indurita.",
                            "verse 105:5": "Li ridusse come pula svuotata ."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "あなたの主が，象の仲間に，どう対処なされたか，知らなかったのか。",
                            "verse 105:2": "かれは，かれらの計略を壊滅させられたではないか。",
                            "verse 105:3": "かれらの上に群れなす数多の鳥を遣わされ，",
                            "verse 105:4": "焼き土の礫を投げ付けさせて，",
                            "verse 105:5": "食い荒らされた藁屑のようになされた。 焼き土の礫を投げ付けさせて，"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "주님께서 코끼리의 무리를 어떻게 하셨는지 그 소식이 이르지 아니 했느뇨",
                            "verse 105:2": "그들의 음모를 파멸시켜 버리 지 아니 했더뇨",
                            "verse 105:3": "하나님은 그들에게 새떼를 보 내어",
                            "verse 105:4": "모래와 흙으로 된 돌맹이들을 던지셨나니",
                            "verse 105:5": "그들은 다 갉아 먹어버린 마 른 잎과도 같았더라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "ئایا نه‌تزانیووه (ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم) په‌روه‌ردگارت چی کرد به‌خاوه‌ن فیله‌کان؟!",
                            "verse 105:2": "ئایا سه‌ری لێ نه‌شێواندن و پیلان و نه‌خشه‌کانیانی پووچ نه‌کرده‌وه‌؟!",
                            "verse 105:3": "پۆل پۆل باڵنده‌ی نه‌نارده سه‌ریان؟!",
                            "verse 105:4": "تا به‌به‌ردی سه‌نگگڵ (وه‌ك خشتی سووره‌وه کراو)، به‌رد بارانیان بکه‌ن.",
                            "verse 105:5": "سه‌ره‌نجام وه‌کو پووش و په‌ڵاش و کاری خوراوی لێکردن، (درێژه‌ی ئه‌م به‌سه‌رهاته له { ژیان نامه‌ی پێغه‌مبه‌ری مه‌زندا} له نووسینی مامۆستا عبدالعزیز پاڕه‌زانی دا ته‌ماشا بکه‌)."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Tidakkah engkau mengetahui bagaimana Tuhanmu telah melakukan kepada angkatan tentera (yang dipimpin oleh pembawa) Gajah, (yang hendak meruntuhkan Kaabah)?",
                            "verse 105:2": "Bukankah Tuhanmu telah menjadikan rancangan jahat mereka dalam keadaan yang rugi dan memusnahkan mereka?",
                            "verse 105:3": "Dan Dia telah menghantarkan kepada mereka (rombongan) burung berpasuk-pasukan;",
                            "verse 105:4": "Yang melontar mereka dengan batu-batu dari sejenis tanah yang dibakar keras;",
                            "verse 105:5": "Lalu Dia menjadikan mereka hancur berkecai seperti daun-daun kayu yang dimakan ulat."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "آيا نديدى پروردگارت با فيل سواران ( لشكر ابرهه كه براى نابودى كعبه آمده بودند) چه كرد؟!",
                            "verse 105:2": "آيا نقشه آنها را در ضلالت و تباهى قرار نداد؟!",
                            "verse 105:3": "و بر سر آنها پرندگانى را گروه گروه فرستاد،",
                            "verse 105:4": "كه با سنگهاى كوچكى آنان را هدف قرارمى‏دادند;",
                            "verse 105:5": "سرانجام آنها را همچون كاه خورده‏شده (و متلاشى) قرار داد!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Não reparaste no que o teu Senhor fez, com os possuidores dos elefantes?",
                            "verse 105:2": "Acaso, não desbaratou Ele as suas conspirações,",
                            "verse 105:3": "Enviando contra eles um bando de criaturas aladas,",
                            "verse 105:4": "Que lhes arrojaram pedras de argila endurecida",
                            "verse 105:5": "E os deixou como plantações devastadas (pelo gado)?"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 105:1": "Oare n-ai vãzut tu ce a fãcut Domnul tãu cu oamenii elefan- tului?!",
                            "verse 105:2": "Oare nu a fãcut El vicleșugul lor sã fie în deșert?!",
                            "verse 105:3": "Și a trimis peste ei pãsãri în stoluri,",
                            "verse 105:4": "Ca sã arunce asupra lor cu pietre din lut ars!",
                            "verse 105:5": "Și i-a fãcut pe ei ca un ogor mâncat."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 105:1": "Nu ai văzut ce a făcut Domnul tău cu oamenii elefantului?",
                            "verse 105:2": "Oare nu a făcut vicleşugul o rătăcire?",
                            "verse 105:3": "Oare nu a trimis asupra lor păsări în stoluri,",
                            "verse 105:4": "ce aruncau peste ei pietre din Iad?",
                            "verse 105:5": "Şi astfel i-a făcut aidoma unor paie mâncate."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Видал ли ты, как поступил Господьс людьми слона,",
                            "verse 105:2": "Разрушив их зловещий план?",
                            "verse 105:3": "Он против них аба’билей2335 послал,",
                            "verse 105:4": "Которые комками обожженной глинылюдей слона сразили.",
                            "verse 105:5": "Затем он превратил их в мертво полеСоломинок и стеблей с разъеденнымнутром."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "¿No has visto cómo obró tu Señor con los del elefante?",
                            "verse 105:2": "¿No desbarató su artimaña",
                            "verse 105:3": "y envió contra ellos bandadas de aves,",
                            "verse 105:4": "que descargaron sobre ellos piedras de arcilla,",
                            "verse 105:5": "dejándolos como espigas desgranadas?"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "(நபியே!) யானை(ப் படை)க் காரர்களை உம் இறைவன் என்ன செய்தான் என்பதை நீர் பார்க்கவில்லையா?",
                            "verse 105:2": "அவர்களுடைய சூழ்ச்சியை அவன் பாழாக்கி விடவில்லையா?",
                            "verse 105:3": "மேலும், அவர்கள் மீது பறவைகளைக் கூட்டங் கூட்டமாக அவன் அனுப்பினான்.",
                            "verse 105:4": "சுடப்பட்ட சிறு கற்களை அவர்கள் மீது அவை எறிந்தன.",
                            "verse 105:5": "அதனால், அவர்களை மென்று தின்னப்பட்ட வைக்கோலைப் போல் அவன் ஆக்கி விட்டான்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "เจ้าไม่เห็นดอกหรือว่า พระเจ้าของเจ้าได้กระทำกับพวก เจ้าของช้างอย่างไร?",
                            "verse 105:2": "พระองค์มิได้ทรงทำให้แผนการณ์ของพวกเขาสูญสิ้นดอก หรือ?",
                            "verse 105:3": "และได้ทรงส่งนกเป็นฝูงๆ ลงมาบนพวกเขา",
                            "verse 105:4": "มันได้ขว้างพวกเขาด้วยหินที่ทำด้วยดินแข็ง",
                            "verse 105:5": "แล้วพระองค์ทรงทำให้พวกเขาเป็นเช่นใบไม้ที่ถูก (สัตว์) กิน"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Onların kötü planlarını boşa çıkarmadı mı?",
                            "verse 105:2": "Onların üstüne ebâbil kuşlarını gönderdi.",
                            "verse 105:3": "O kuşlar, onların üzerlerine pişkin tuğladan yapılmış taşlar atıyordu.",
                            "verse 105:4": "Böylece Allah onları yenilip çiğnenmiş ekine çevirdi."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "کیا تم نے نہیں دیکھا کہ تمہارے پروردگار نے ہاتھی والوں کے ساتھ کیا کیا",
                            "verse 105:2": "کيا آپ نے نہيں ديکھا کہ آپ کے رب نے ہاتھي والوں کے ساتھ کيا سلوک کياo",
                            "verse 105:3": "کيا اس نے ان کے مکر و فريب کو باطل و ناکام نہيں کر دياo",
                            "verse 105:4": "کیا ان کا داؤں غلط نہیں کیا؟ (گیا)",
                            "verse 105:5": "اور ان پر جھلڑ کے جھلڑ جانور بھیجے",
                            "verse 105:6": "اور اس نے ان پر (ہر سمت سے) پرندوں کے جھنڈ کے جھنڈ بھيج ديئےo",
                            "verse 105:7": "جو ان پر کنکريلے پتھر مارتے تھےo",
                            "verse 105:8": "جو ان پر کھنگر کی پتھریاں پھینکتے تھے",
                            "verse 105:9": "تو ان کو ایسا کر دیا جیسے کھایا ہوا بھس",
                            "verse 105:10": "پھر (ا? نے) ان کو کھائے ہوئے بھوسے کي طرح (پامال) کر دياo بھس"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 105:1": "Роббинг фил соҳибларини қандоқ қилганини билмадингми?",
                            "verse 105:2": "Уларнинг макру ҳийласини зое кетказмадими?",
                            "verse 105:3": "Ва уларнинг устига тўп-тўп қушларни юбормадими?",
                            "verse 105:4": "Лойдан пиширилган тошларни отадиганларни?",
                            "verse 105:5": "Бас, уларни қурт еб ташлаган ўсимликка ўхшатиб юбормадими?."
                        }
                    }
                }
            }
        }
    }
}