{
    "id": 111,
    "name_simple": "Al-Masad",
    "revelation_place": "makkah",
    "revelation_order": 6,
    "bismillah_pre": true,
    "verses_count": 5,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah takes its name from the word Lahab in the first verse.",
    "text": [
        "\n",
        "The Surah takes its name from the word Lahab in the first verse.",
        "\n",
        "Period of Revelation",
        "\n",
        "Although the commentators have not disputed its being a Makki Surah, yet it is difficult to determine in which phase of the life at Makkah precisely it was revealed. However, in view of Abu Lahab's role and conduct against the Holy Prophet's message of Truth, it can be assumed that it must have been revealed in the period when he had transgressed all limits in his mad hostility to him, and his attitude was becoming a serious obstruction in the progress of Islam. It may well have been revealed in the period when the Quraish had boycotted the Holy Prophet (upon whom be peace) together with the people of his clan and besieged them in Shi'b Abi Talib, and Abu Lahab was the only person to join with the enemies against his own relatives. The basis of this assumption is that Abu Lahab was the Holy Prophet's uncle, and public condemnation of the uncle by the tongue of the nephew could not be proper until the extreme excesses committed by the uncle had become visible to everyone. If the\r\nSurah had been revealed before this, in the very beginning, the people would have regarded it as morally discourteous that the nephew should so condemn the uncle.",
        "\n",
        "Background",
        "\n",
        "This is the only place in the Quran where a person from among the enemies of Islam has been condemned by name, whereas in Makkah as well as in Madinah, after the migration, there were many people who were in no way less inimical to Islam and the Prophet Muhammad (upon whom be Allah's peace and blessings) than Abu Lahab. The question is, what was the special trait of the character of this person, which became the basis of this condemnation by name? To understand that it is necessary that one should understand the Arabian society of that time and the role that Abu Lahab played in it.",
        "\n",
        "In ancient days since there prevailed chaos and confusion, bloodshed and plunder throughout Arabia, and the condition for centuries was that a person could have no guarantee of the protection of life, honor and property except with the help and support of his clansmen and blood relations, therefore silah rehmi (good treatment of the kindred) was esteemed most highly among the moral values of the Arabian society and breaking off of connections with the kindred was regarded as a great sin. Under, the influence of the same Arabian tradition when the Holy Prophet (upon whom be peace) began to preach the message of Islam, the other clans of Quraish and their chiefs resisted and opposed him tooth and nail, but the Bani Hashim and the Bani al-Muttalib (children of al-Muttalib, brother of Hashim) not only did not oppose him but continued to support him openly, although most of them had not yet believed in his Prophethood. The other clans of Quraish themselves regarded this\r\nsupport by the blood relations of the Holy Prophet as perfectly in accordance with the moral traditions of Arabia. That is why they never taunted the Bani Hashim and the Bani al-Muttalib in that they had abandoned their ancestral faith by supporting a person who was preaching a new faith. They knew and believed that they could in no case hand over an individual of their clan to his enemies, and their support and aid of a clansman was perfectly natural in the sight of the Quraish and the people of Arabia.",
        "\n",
        "This moral principle, which the Arabs even in the pre-Islamic days of ignorance, regarded as worthy of respect and inviolable was broken only by one man in his enmity of Islam, and that was Abu Lahab, son of Abdul Muttalib. He was an uncle of the Holy Prophet, whose father and he were sons of the same father. In Arabia, an uncle represented the father especially when the nephew was fatherless. The uncle was expected to look after the nephew as one of his own children. But this man in his hostility to Islam and love of kufr trampled all the Arab traditions under foot.",
        "\n",
        "The traditionists have related from Ibn Abbas with several chains of transmitters the tradition that when the Holy Prophet was commanded to present the message of Islam openly, and he was instructed in the Quran to warn first of all his nearest kinsfolk of the punishment of God, he ascended the Mount, Safa one morning and called out aloud: Ya sabahah (O, the calamity of the morning!). This alarm in Arabia was raised by the person who noticed early at dawn an enemy tribe advancing against his tribe. When the Holy Messenger made this call, the people inquired as to who had made the call. They were told that it was Muhammad (upon whom be Allah's peace). There the people of all the clans of Quraish rushed out. Everyone who could, came. He who could not, sent another one for himself. When the People had assembled, the Holy Messenger calling out each clan by name, viz. O Bani Hashim, O Bani Abdul Muttalib, O Bani Fihr, O Bani so and so, said: \"If I were to tell you that behind\r\nthe hill there was an enemy host ready to fall upon you, would you believe me?\" The people responded with one voice, saying that they never had so far experienced a lie from him. The Holy Prophet said: \"Then I warn you that you are heading for a torment.\" Thereupon, before anyone else could speak, Abu Lahab, the Holy Prophet's uncle, said: \"May you perish! Did you summon us for this?\"Another tradition adds that he picked up a stone to throw at the Holy Prophet. (Musnad Ahmad, Bukhari, Muslim, Tirmidhi, Ibn Jarir, and others).",
        "\n",
        "According to Ibn Zaid, one day Abu Lahab asked the Holy Prophet: \"If I were to accept your religion, what would I get?\" The Holy Prophet replied: \"You would get what the other believers would get.\" He said: \"Is there no preference or distinction for me?\" The Holy Prophet replied: \"What else do you want?\" Thereupon he said: \"May this religion perish in which I and all other people should be equal and alike!\" (Ibn Jarir).",
        "\n",
        "In Makkah Abu Lahab was the next door neighbor of the Holy Prophet. Their houses were separated by a wall. Besides him, Hakam bin As (Father of Marwan), Uqbah bin Abi Muait, Adi bin Hamra and Ibn al-Asda il-Hudhali also were his neighbors. These people did not allow him to have peace even in his own house. Sometimes when he was performing the Prayer, they would place the goat's stomach on him; sometimes when food was being cooked in the courtyard, they would throw filth at the cooking pot. The Holy Prophet would come out and say: \"O Bani Abdi Manaf, what kind of neighborliness is it?\"Abu Lahab's wife, Umm Jamil (Abu Sufyan's sister), had made it a practice to cast thorns at his door in the night so that when he or his children came out of the house at dawn, they should run thorns in the foot. (Baihaqi, Ibn Abi Hatim, Ibn Jarir, Ibn Asakir, Ibn Hisham).",
        "\n",
        "Before the proclamation of Prophethood, two of the Holy Prophet's daughters were married to two of Abu Lahab's sons, Utbah and Utaibah. After his call when the Holy Prophet began to invite the people to Islam, Abu Lahab said to both his sons:\"I would forbid myself seeing and meeting you until you divorced the daughters of Muhammad (upon whom be Allah's peace and blessings).\"So, both of them divorced their, wives. Utaibah in particular became so nasty in his spitefulness that one day he came before the Holy Prophet and said: \"I repudiate An-najmi idha hawa and Alladhi dana fatadalla \" and then he spat at him, but his spital did not fall on him. The Holy Prophet prayed: \"O God, subject him to the power of a dog from among Your dogs.\"Afterwards, Utaibah accompanied his father in his journey to Syria. During the journey the caravan halted at a place which, according to local people, was visited by wild beasts at night. Abu Lahab told his companions, the Quraish: \"Make full\r\narrangements for the protection of my son, for I fear the curse invoked by Muhammad (upon whom be Allah's peace) on him.\" Accordingly, the people made their camels sit all around Utaibah and went to sleep. At night a tiger came which crossed the circle of the camels and devoured Utaibah tearing him to pieces. (Ibn Abdul Barr: Al-Istiab ; Ibn Hajar: Al- Isabah; Abu Nuaim al-Isfahani: Dalail an-Nubuwwat ; As-Suhaili: Raud al-Unuf. Here there is a difference of opinion. Some reporters say that the divorce took place after the Holy Prophet's proclamation of Prophethood and some say that it took place after the revelation of Tabbat yada Abi Lahab. There is also a difference of opinion about whether Abu Lahab's this son was Utbah or Utaibah. But this much is confirmed that after the conquest of Makkah, Utbah embraced Islam and took the oath of allegiance at the Holy Prophet's hand. Therefore, the correct view is that it was Utaibah).",
        "\n",
        "Abu Lahab's wickedness can be judged from the fact that when after the death of the Holy Prophet's son Hadrat Qasim, his second son, Hadrat Abdullah, also died, this man instead of joining with his nephew in his bereavement, hastened to the Quraish chiefs joyfully to give them the news that Muhammad (upon whom be Allah's peace and blessings) had become childless that night. This we have already related in the commentary of Surah Al-Kauthar.",
        "\n",
        "Wherever the Holy Prophet went to preach his message of Islam, this man followed him and forbade the people to listen to him. Rabiah bin Abbad ad- Dill has related: \"I was a young boy when I accompanied my father to the face of Dhul-Majaz. There I saw the Holy Messenger (may peace be upon him) who was exhorting the people, saying: 'O people, say: there is no deity but Allah, you will attain success.' Following behind him I saw a man, who was telling the people, \\`This fellow is a liar: he has gone astray from his ancestral faith.' I asked; who is he? The people replied: He is his uncle, Abu Lahab.\" (Musnad Ahmad, Baihaqi).",
        "\n",
        "Another tradition from Hadrat Rabiah is to the effect; \"I saw that the Holy Prophet went to the halting place of each tribe and said: \\`O children of so and so, I have been appointed Allah's Messenger to you. I exhort you to worship only Allah and to associate none with Him. So, affirm faith in me and join me so that I may fulfill the mission for which I have been sent.' Following close behind him there was a man who was saying: \\`O children of so and so, he is leading you astray from Lat and Uzza and inviting you to the religion of error and innovation which he has brought. Do not at all listen to what he says and do not follow him.' I asked my father: who is he? He replied: he is his uncle, Abu Lahab.\" (Musnad Ahmad, Tabarani).",
        "\n",
        "Tariq bin Abdullah al-Muharibi's tradition is similar. He says: \"I saw in the fare of Dhul-Majaz that the Holy Messenger (upon whom be peace) was exhorting the people, saying: \\`O people, say La ilaha ill-Allah, you will attain success', and behind him there was a man who was casting stones at him, until his heels bled, and he was telling the people: 'Do not listen to him, he is a liar.' I asked the people who he was. They said he was his uncle, Abu Lahab.\" (Tirmidhi).",
        "\n",
        "In the 7th year of Prophethood, when all the clans of Quraish boycotted the Bani Hashim and the Bani al-Muttalib socially and economically, and both these clans remaining steadfast to the Holy Prophet's support, were besieged in Shib Abi Talib, Abu Lahab was the only person, who sided with the disbelieving Quraish against his own clan. This boycott continued for three years, so much so that the Bani Hashim and the Bani al-Muttalib began to starve. This, however, did not move Abu Lahab. When a trade caravan came to Makkah and a besieged person from Shib Abi Talib approached it to buy some article of food, Abu Lahab would shout out to the merchants to demand a forbidding price, telling them that he would make up for any loss that they incurred. Thus, they would demand exorbitant rates and the poor customer had to return empty handed to his starving children. Then Abu Lahab would purchase the same articles from them at the market rates. (Ibn Sa'd, Ibn Hisham).",
        "\n",
        "On account of these very misdeeds this man was condemned in this Surah by name, and there was a special need for it. When the Holy Prophet's own uncle followed and opposed him before the Arabs who came for hajj from outside Makkah, or gathered together in the fares held at different places, they regarded it as against the established traditions of Arabia that an uncle should run down his nephew without a reason, should pelt stones at him and bring false accusations against him publicly. They were, therefore, influenced by what Abu Lahab said and were involved in doubt about the Holy Prophet (upon whom be peace). But when this, Surah was revealed, and Abu Lahab, filled with rage, started uttering nonsense, the people realized that what he said in opposition to the Holy Prophet was not at all reliable, for he said all that in his mad hostility to his nephew.",
        "\n",
        "Besides, when his uncle was condemned by name, the people's expectation that the Holy Messenger (upon whom be peace) could treat some relative leniently in the matter of religion was frustrated for ever. When the Holy Messenger's own uncle was taken to task publicly the people understood that there was no room for preference or partiality in their faith. A non-relative could become a near and dear one if he believed, and a near relation a non-relative if he disbelieved. Thus, there is no place for the ties of blood in religion.",
        "\n"
    ],
    "description": "The surah that mentions the Palm Fibre rope that in Hellfire shall be twisted around the neck of the wife of the Prophet’s uncle, who bitterly opposed Islam; for she took great pride in wearing an ostentatious necklace she became known for and would slip by night to strew thorns and prickly plants in the Prophet’s path to injure his feet. It takes its name from verse 5 in which the phrase “ḥablun min masad” (meaning “a rope of palm fibre”) occurs.The surah is also known as: Abu Lahab, Fibre, Perish, The Flame, The Palm-Fibre Rope.",
    "name_complex": "Al-Masad",
    "surah_name_ar": "المسد",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 111:1": "Ju thafshin duart Ebu Lehebit, dhe iu th?në!",
                            "verse 111:2": "Nuk i ka ndihmuar atij as pasuria, e as fitimet tjera.",
                            "verse 111:3": "Ai, me siguri, do të hudhet në zjarrin flakërues,",
                            "verse 111:4": "ashtu dhe gruaja e tij – dru-bartëse;",
                            "verse 111:5": "në qafën e saj ka një litar të bërë prej fijeve (të palmës)."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Əbu Ləhəbin əlləri qurusun, qurudu da! (Və ya: Əbu Ləhəbin əlləri qurusun, o ölsün!)",
                            "verse 111:2": "(Qiyamət günü) ona nə mal-dövləti fayda verəcək, nə də qazandığı (və ya: oğul-uşağı).",
                            "verse 111:3": "O, alovlu atəşə girəcəkdir.",
                            "verse 111:4": "Onun odun daşıyan (Peyğəmbərlə düşmənçilik edən, adamlar arasında söz gəzdirən) övrəti də həmçinin!",
                            "verse 111:5": "Onun (övrətinin) boğazında xurma lifindən hörülmüş ip (və ya: yetmiş arşın uzunluğunda zəncir) olacaqdır!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Neka propadne Ebu Leheb,",
                            "verse 111:2": "neće mu biti od koristi blago njegovo, a ni ono što je stekao,",
                            "verse 111:3": "ući će on, sigurno, u vatru rasplamsalu,",
                            "verse 111:4": "i žena njegova, koja spletkari;",
                            "verse 111:5": "o vratu njenu biće uže od ličine usukane! spletkari;"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "আবু লাহাবের হস্তদ্বয় ধ্বংস হোক এবং ধ্বংস হোক সে নিজে,",
                            "verse 111:2": "কোন কাজে আসেনি তার ধন-সম্পদ ও যা সে উপার্জন করেছে।",
                            "verse 111:3": "সত্বরই সে প্রবেশ করবে লেলিহান অগ্নিতে",
                            "verse 111:4": "এবং তার স্ত্রীও-যে ইন্ধন বহন করে,",
                            "verse 111:5": "তার গলদেশে খর্জুরের রশি নিয়ে। করে,"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 111:1": "Да се погубят двете ръце на Абу Лахаб! И той да се погуби!",
                            "verse 111:2": "Не го избави неговият имот и онова, което е придобил.",
                            "verse 111:3": "Ще гори в огън с пламъци той",
                            "verse 111:4": "и жена му, носещата дърва.",
                            "verse 111:5": "На шията й ще има въже от сплетени влакна."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "願焰父兩手受傷！他必定受傷 ,",
                            "verse 111:2": "他的財產 ,和他所獲得的 ,將無裨于他 ,",
                            "verse 111:3": "他將入有焰的烈火 ,",
                            "verse 111:4": "他的擔柴的妻子 ,也將入烈火 ,",
                            "verse 111:5": "她的頸上繫著一條堅實的繩子。 ,"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Zhyňte obě ruce Abú Lahaba, a zhynul již i on!",
                            "verse 111:2": "A nebylo mu k ničemu jmění jeho ani to, co si vysloužil,",
                            "verse 111:3": "však hořet bude v ohni plném plamenů on",
                            "verse 111:4": "i žena jeho, jež dříví palivové nosí",
                            "verse 111:5": "a jíž kol hrdla provaz z vláken palmových visí."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "De macht van Aboe Lahab en hijzelf zullen vergaan.",
                            "verse 111:2": "Zijn rijkdommen en daden zullen hem niet baten.",
                            "verse 111:3": "Weldra zal hij in een laaiend Vuur branden.",
                            "verse 111:4": "Ook zijn vrouw, de draagster van brandstof,",
                            "verse 111:5": "Om haar hals zal een koord van palmvezels hangen."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 111:1": "The power of Abu Lahab will perish, and he will perish.",
                            "verse 111:2": "His wealth and gains will not exempt him.",
                            "verse 111:3": "He will be plunged in flaming Fire,",
                            "verse 111:4": "And his wife, the wood-carrier,",
                            "verse 111:5": "Will have upon her neck a halter of palm-fibre."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 111:1": "Perish the hands of the Father of Flame! Perish he!",
                            "verse 111:2": "No profit to him from all his wealth, and all his gains!",
                            "verse 111:3": "Burnt soon will he be in a Fire of Blazing Flame!",
                            "verse 111:4": "His wife shall carry the (crackling) wood - As fuel!-",
                            "verse 111:5": "A twisted rope of palm-leaf fibre round her (own) neck!"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 111:1": "Perish the hands of Abu Lahab, and perish he!",
                            "verse 111:2": "His wealth avails him not, neither what he has earned;",
                            "verse 111:3": "he shall roast at a flaming fire",
                            "verse 111:4": "and his wife, the carrier of the firewood,",
                            "verse 111:5": "upon her neck a rope of palm-fibre."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 111:1": "DOOMED are the hands of him of the glowing countenance, and doomed is he!",
                            "verse 111:2": "What will his wealth avail him, and all that he has gained?",
                            "verse 111:3": "[In the life to come] he shall have to endure a fire fiercely glowing,",
                            "verse 111:4": "together with his wife, that carrier of evil tales,",
                            "verse 111:5": "[who bears] around her neck a rope of twisted strands!"
                        }
                    },
                    "5": {
                        "Martin Lings": {}
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 111:1": "Perish the two hands of Abū Lahab, and perish he!",
                            "verse 111:2": "Neither his wealth benefited him, nor what he earned.",
                            "verse 111:3": "He will soon enter a Fire, full of flames,",
                            "verse 111:4": "and his wife as well,-the wicked carrier of firewood.",
                            "verse 111:5": "Around her neck, there is (a collar of iron, like) a well-twisted rope."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 111:1": "Perish the hands of Abū Lahab and perish he!",
                            "verse 111:2": "His wealth will not avail him, nor what he has earned.",
                            "verse 111:3": "He will",
                            "verse 111:4": "enter a Fire of flames,",
                            "verse 111:5": "and his wife the carrier of firewood",
                            "verse 111:6": "with a rope of palm-fibre around her neck."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 111:1": "Perished be the two hands of Abu Lahab and be he perished himself (he has pointed his finger to Our Beloved)!",
                            "verse 111:2": "Neither His (inherited) wealth nor his earned riches have given him any benefit.",
                            "verse 111:3": "Soon he will tumble into the Flaming Fire,",
                            "verse 111:4": "And his (damned, wretched) wife (too) who carries (on her head) the burden of (thorny) twigs (and spreads them in the way of Our Beloved, to injure the holy soles of his feet).",
                            "verse 111:5": "Around her neck will be (the same) palm-fibre rope (she uses to bind the bunch of thorny twigs)."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Tuhon omat ovat Abu Lahabin molemmat kädet, ja tuho perii hänet itsensä.",
                            "verse 111:2": "Hänen rikkautensa ja ansionsa eivät häntä vähääkään hyödytä.",
                            "verse 111:3": "Pian hän kärventyy tulen liekeissä,",
                            "verse 111:4": "ja samoin hänen vaimonsa, parjaaja,",
                            "verse 111:5": "jonka kaulaan on heitetty tiukasti punottu köysi."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 111:1": "Que périssent les mains d'Abou Lahab et que lui-même périsse !",
                            "verse 111:2": "A rien ne lui serviront ses richesses et ce qu'il a acquis.",
                            "verse 111:3": "Il brûlera dans un feu ardent",
                            "verse 111:4": "ainsi que sa femme, porteuse de bois,",
                            "verse 111:5": "au cou de laquelle est attachée une corde de fibres."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 111:1": "Que périssent les deux mains d’Abu-Lahab et que lui-même périsse.",
                            "verse 111:2": "Sa fortune ne lui sert à rien, ni ce qu’il a acquis.",
                            "verse 111:3": "Il sera brûlé dans un Feu plein de flammes.",
                            "verse 111:4": "de même sa femme, la porteuse de bois ,",
                            "verse 111:5": "à son cou, une corde de fibres."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Die beiden Hände von Abu Lahab werden vergehen, und er wird vergehen.",
                            "verse 111:2": "Sein Reichtum und was er erworben hat, soll ihm nichts nützen.",
                            "verse 111:3": "Bald wird er in ein flammendes Feuer eingehen;",
                            "verse 111:4": "Und sein Weib (ebenfalls), die arge Verleumderin.",
                            "verse 111:5": "Um ihren Hals wird ein Strick von gewundenen Palmenfasern sein."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "vcq ygc ds gkFk VwV tk,¡ vkSj og [+kqn lR;kukl gks tk,",
                            "verse 111:2": "¼vkf[+kj½ u mldk eky gh mlds gkFk vk;k vkSj ¼u½ mlus dek;k",
                            "verse 111:3": "og cgqr HkM+drh gq;h vkx esa nkf[+ky gksxk",
                            "verse 111:4": "vkSj mldh tks: Hkh tks lj ij bZa/ku mBk, fQjrh gS",
                            "verse 111:5": "vkSj mlds xys esa cVh gq;h jLlh c¡/kh gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Binasalah kedua tangan Abu Lahab dan sesungguhnya dia akan binasa.",
                            "verse 111:2": "Tidaklah berfaedah kepadanya harta bendanya dan apa yang ia usahakan.",
                            "verse 111:3": "Kelak dia akan masuk ke dalam api yang bergejolak.",
                            "verse 111:4": "Dan (begitu pula) istrinya, pembawa kayu bakar.",
                            "verse 111:5": "Yang di lehernya ada tali dari sabut."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Periscano le mani di Abu Lahab , e perisca anche lui.",
                            "verse 111:2": "Le sue ricchezze e i suoi figli non gli gioveranno .",
                            "verse 111:3": "Sarà bruciato nel Fuoco ardente,",
                            "verse 111:4": "assieme a sua moglie , la portatrice di legna,",
                            "verse 111:5": "che avrà al collo una corda di fibre di palma ."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "アブー・ラハブの両手は滅び，かれも滅びてしまえ。",
                            "verse 111:2": "かれの富も儲けた金も，かれのために役立ちはしない。",
                            "verse 111:3": "やがてかれは，燃え盛る炎の業火の中で焼かれよう。",
                            "verse 111:4": "かれの妻はその薪を運ぶ，",
                            "verse 111:5": "首に棕櫚の荒縄かけて。 かれの妻はその薪を運ぶ，"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "아부라합의 손이 멸망하고 파멸 할 것이며",
                            "verse 111:2": "그의 재물과 그가 얻은 것이 그에게 유익하지 못하니",
                            "verse 111:3": "그는 곧 타오르는 볼지옥에 이르게 될 것이라",
                            "verse 111:4": "그의 아내는 연료를 운반할 것이요",
                            "verse 111:5": "그녀의 목에는 단단히 꼬인 동아줄이 감기리라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "ده‌سته‌کانی بشکێت ئه‌بو له‌هه‌بو ڕسوا بێت، ئاشکرایه که هه‌ر ڕاسوایش ده‌بێت و‎ (له‌ناو ده‌چێت).",
                            "verse 111:2": "ماڵ و دارای و ئه‌و شتانه‌ی که به ده‌ستی هێناوه‌، فریای نه‌که‌وت.",
                            "verse 111:3": "له ئاینده‌دا ده‌خرێته ناو ئاگرێکی بڵێسه‌داره‌وه‌.",
                            "verse 111:4": "هه‌روه‌ها ژنه‌که‌شی که هه‌میشه هه‌ڵگری کۆڵه داره و (ئازاری پێغه‌مبه‌ر ده‌دات).",
                            "verse 111:5": "هه‌میشه گوریسێکی چنراو له پوشی خورما له گه‌ردنیایه‌تی (له قیامه‌تیش دا زنجیری ئاسن ده‌کرێته گه‌ردنی)."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Binasalah kedua-dua tangan Abu Lahab dan binasalah dia bersama;",
                            "verse 111:2": "Hartanya dan segala yang diusahakannya, tidak dapat menolongnya.",
                            "verse 111:3": "Dia akan menderita bakaran api Neraka yang marak menjulang.",
                            "verse 111:4": "Dan juga isterinya, seorang perempuan pemunggah kayu api.",
                            "verse 111:5": "Di lehernya sejenis tali, dari tali-tali yang dipintal."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "بريده باد هر دو دست ابولهب (و مرگ بر او باد)!",
                            "verse 111:2": "هرگز مال و ثروتش و آنچه را به دست آورد به حالش سودى نبخشيد!",
                            "verse 111:3": "و بزودى وارد آتشى شعله‏ور و پرلهيب مى‏شود;",
                            "verse 111:4": "و (نيز) همسرش، در حالى كه هيزم‏كش (دوزخ) است،",
                            "verse 111:5": "و در گردنش طنابى است از ليف خرما!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Que pereça o poder de Abu Láhab e que ele pereça também!",
                            "verse 111:2": "De nada lhe valerão os seus bens, nem tudo quanto lucrou.",
                            "verse 111:3": "Entrará no fogo flamígero,",
                            "verse 111:4": "Bem como a sua mulher, a portadora de lenha,",
                            "verse 111:5": "Que levará ao pescoço uma corda de esparto."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 111:1": "Sã piarã mâinile lui Abu Lahab și sã piarã și el !",
                            "verse 111:2": "Averea lui sã nu-i fie de nici un folos și nici ce a agonisit!",
                            "verse 111:3": "Va arde în Focul cu flãcãri,",
                            "verse 111:4": "Împreunã cu muierea lui, aducãtoarea de vreascuri,",
                            "verse 111:5": "Care va avea la gâtul ei o funie de fire [de palmier]."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 111:1": "Să-i piară mâinile lui Abu-Lahab şi el însuşi să piară!",
                            "verse 111:2": "Să nu-i priască averea-i şi ceea ce a agonisit!",
                            "verse 111:3": "Într-un foc cu vâlvătaie fi-va aruncat",
                            "verse 111:4": "dimpreună cu femeia sa, cărătoarea de vreascuri,",
                            "verse 111:5": "cu o frânghie din sfoară de curmal legată de gât."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Проклятие рукам Абу Ляхаба!2337И сам он — будь он проклят!",
                            "verse 111:2": "Ему богатство не поможет,Добро накопленное не спасет!",
                            "verse 111:3": "Гореть ему во пламенном Огне!",
                            "verse 111:4": "И будет проклята его жена —Носительница дров,",
                            "verse 111:5": "Чью шею обовьет крученый жгутИз пальмовых волокон! дров,"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "¡Perezcan las manos de Abu Lahab! ¡Perezca él!",
                            "verse 111:2": "Ni su hacienda ni sus adquisiciones le servirán de nada.",
                            "verse 111:3": "Arderá en un fuego llameante,",
                            "verse 111:4": "así como su mujer, la acarreadora de leña,",
                            "verse 111:5": "a su cuello una cuerda de fibras."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "அபூலஹபின் இரண்டு கைகளும் நாசமடைக, அவனும் நாசமாகட்டும்.",
                            "verse 111:2": "அவனுடைய பொருளும், அவன் சம்பாதித்தவையும் அவனுக்குப் பயன்படவில்லை.",
                            "verse 111:3": "விரைவில் அவன் கொழுந்து விட்டெரியும் நெருப்பில் புகுவான்.",
                            "verse 111:4": "விறகு சுமப்பவளான அவனுடைய மனைவியோ,",
                            "verse 111:5": "அவளுடைய கழுத்தில் முறுக்கேறிய ஈச்சங் கயிறுதான் (அதனால் அவளும் அழிவாள்)."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "มือทั้งสองของอะบีละฮับจงพินาศ และเขาก็พินาศแล้ว",
                            "verse 111:2": "ทรัพย์สมบัติของเขา และสิ่งที่เขาได้ขวนขวายเอาไว้นั้นมิได้อำนวยประโยชน์แก่เขาเลย",
                            "verse 111:3": "เขาจะเข้าไปเผาไหม้ในนรกที่มีไฟลุกโชน",
                            "verse 111:4": "ทั้งภริยาของเขาด้วย นางเป็นผู้แบกฟืน",
                            "verse 111:5": "ที่คอของนางมีเชือกถักด้วยใยอินทผลัม"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Ebu Leheb'in iki eli kurusun! Kurudu da.",
                            "verse 111:2": "Malı ve kazandıkları ona fayda vermedi.",
                            "verse 111:3": "O, alevli bir ateşte yanacak.",
                            "verse 111:4": "Odun taşıyıcı olarak karısı da (ateşe girecek).",
                            "verse 111:5": "Ve boynunda hurma lifinden bükülmüş bir ip olduğu halde."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "ابولہب کے ہاتھ ٹوٹیں اور وہ ہلاک ہو",
                            "verse 111:2": "ابولہب کے دونوں ہاتھ ٹوٹ جائيں اور وہ تباہ ہو جائے (اس نے ہمارے حبيب پر ہاتھ اٹھانے کي کوشش کي ہے)o",
                            "verse 111:3": "اسے اس کے (موروثي) مال نے کچھ فائدہ نہ پہنچايا اور نہ ہي اس کي کمائي نےo",
                            "verse 111:4": "نہ تو اس کا مال ہی اس کے کچھ کام آیا اور نہ وہ جو اس نے کمایا",
                            "verse 111:5": "وہ جلد بھڑکتی ہوئی آگ میں داخل ہو گا",
                            "verse 111:6": "عنقريب وہ شعلوں والي آگ ميں جا پڑے گاo",
                            "verse 111:7": "اور اس کي (خبيث) عورت (بھي) جو (کانٹے دار) لکڑيوں کا بوجھ (سر پر) اٹھائے پھرتي ہے، (اور ہمارے حبيب کے تلووں کو زخمي کرنے کے لئے رات کو ان کي راہوں ميں بچھا ديتي ہے)o",
                            "verse 111:8": "اور اس کی جورو بھی جو ایندھن سر پر اٹھائے پھرتی ہے",
                            "verse 111:9": "اس کے گلے میں مونج کی رسّی ہو گی",
                            "verse 111:10": "اس کي گردن ميں کھجور کي چھال کا (وہي) رسّہ ہوگا (جس سے کانٹوں کا گٹھا باندھتي ہے)o گی"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 111:1": "Абу Лаҳабнинг икки қўли ҳалок бўлсин, ҳалок!",
                            "verse 111:2": "Унга моли ва касб қилган нарсалари фойда бермади.",
                            "verse 111:3": "У тезда чўғи қизиб турган ўтга киради.",
                            "verse 111:4": "Ва унинг хотини, ўтин кўтарган аёл ҳам.",
                            "verse 111:5": "У(аёл)нинг бўйнида эшилган арқон бор ҳолда."
                        }
                    }
                }
            }
        }
    }
}