{
    "surah_name": "As-Sajdah",
    "surah_name_ar": "السجدة",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 32:1": "Elif, L?m, Mîm.",
                            "verse 32:2": "Shpallja e këtij Libri, për të cilin s’ka dyshim – është nga Zoti i gjithësisë,",
                            "verse 32:3": "e ata thonë: “Ai (Muhammedi) e ka trilluar atë! Jo, ajo është e Vërteta nga Zoti yt – për ta paralajmëruar popullin, të cilit, para teje nuk i ka ardhur kurrfarë paralajmëruesi, që të shkojë në rrugë të drejtë.",
                            "verse 32:4": "Perëndia është Ai që ka krijuar qiejt dhe Tokën dhe çdo gjë që gjendet në mes tyre, për gjashtë ditë (periudha kohore), dhe e ka mbizotëruar Gjithësinë (Arshin).",
                            "verse 32:5": "Ai i udhëheq të gjitha gjërat, prej qiellit deri në Tokë, e atëherë kthehen tek Ai në ditën, gjatësia e së cilës është një mijë vjet sipas llogaritjes suaj (në këtë Botë).",
                            "verse 32:6": "Ai është dijtës i gjërave të padukshme dhe të dukshme, i Plotëfuqishëm dhe Mëshirues,",
                            "verse 32:7": "i cili e ka bërë të mirë çdo gjë që ka krijuar dhe ka filluar krijimin e njeriut prej balte,",
                            "verse 32:8": "(e) pastaj, ka bërë që pasardhësit e tij të krijohen prej një rrjedhje të dobët të ujit (spermës),",
                            "verse 32:9": "pastaj, e ka krijuar atë (njeriun) dhe i ka dhënë gjallëri, me frymëzimin e Tij.",
                            "verse 32:10": "Dhe ata thonë: “E, vallë, pasi të humbasim nën tokë, përsëri do të ngjallemi?” Dhe ata, nuk besojnë se do të takohen me Zotin e tyre.",
                            "verse 32:11": "Thuaju: “Do t’jua merr shpirtin engjëlli i vdekjes, i cili është caktuar për ju, e pastaj do të ktheheni te Zoti juaj”.",
                            "verse 32:12": "E, sikur t’i shohësh mëkatarët se si para Zotit të tyre kokëulur thonë: “O Zoti ynë, pamë dhe dëgjuam, andaj, kthena që të punojmë vepra të mira! Na, me të vërtetë, me ngulmëri besojmë!”",
                            "verse 32:13": "E, sikur Ne të donim, do t’ia jepnim çdo personi udhëzimin e tij, por kjo është fjala Ime e vërtetë: “Me të vërtetë, do ta mbush xhehennemin me xhindë dhe njerëz bashkërisht!”",
                            "verse 32:14": "E, shijoni (dënimin), ngase e keni harruar takimin e kësaj dite.",
                            "verse 32:15": "Ajetet Tona i besojnë vetëm ata të cilët kur të këshillohen me to, bijnë në sexhde, dhe të cilët, e madhërojnë Zotin e tyre duke iu falenderuar Atij, dhe të cilët, nuk bëhen mendjemëdhenj.",
                            "verse 32:16": "Pjesët e trupit të tyre ngriten nga shtrati (për t’u falur); i luten Zotit të tyre duke druajtur dhe shpresuar, dhe japin (lëmoshë) nga ajo që u kemi dhënë Ne.",
                            "verse 32:17": "Askush nuk di se çfarë gëzime të fshehta janë për ta – shpërblimi për atë që kanë punuar.",
                            "verse 32:18": "Vallë! A është njësoj si besimtari si mëkatari? Jo, ata nuk janë të barabartë:",
                            "verse 32:19": "ata që kanë besuar dhe punuar vepra të mira, për ta janë kopshtet e xhennetit Meëva – të përgatitur për atë që kanë punuar;",
                            "verse 32:20": "e ata që kanë bërë keq, vendbanim i tyre është zjarri; sa herë që duan të dalin nga ai (zjarri), do të kthehen në të dhe do t’u thuhet: “Shijoni dënimin e zjarrit, të cilin e keni përgënjeshtruar!”",
                            "verse 32:21": "Dhe Ne, do të bëjmë që të shijojnë dënimin e kësaj jete para (atij) dënimit të madh, për t’u penduar ata.",
                            "verse 32:22": "Kush është zullumqar më i madh se ai, që është këshilluar me argumentet e Zotit të tij, e shmanget prej tyre? Na, me të vërtetë, do t’i dënojmë mëkatarët!",
                            "verse 32:23": "Na, madje, ia kemi dhënë Librin Musait, dhe mos dysho në takimin me të, dhe e kemi bërë atë (Librin) udhërrëfyes për bijtë e Israelit.",
                            "verse 32:24": "Na, prej tyre – kemi bërë udhëheqës, të cilët udhëzonin me urdhërat Tona, meqë ishin të durueshëm dhe besonin bindshëm në argumentet Tona.",
                            "verse 32:25": "Me të vërtetë, Zoti yt, do t’i gjykojë në mes tyre Ditën e Kijametit, për atë që e kundërshtuan njëri-tjetrin.",
                            "verse 32:26": "(Vallë)! A nuk u është e qartë atyre se sa popuj i kemi shkatërruar Ne para tyre; nëpër shtëpiat e të cilëve ecin? Me të vërtetë, në këto ka argumente, e ata nuk po dëgjojnë (këshillat).",
                            "verse 32:27": "Vallë! A nuk shohin ata, që Ne, me të vërtetë e dërgojmë ujin në tokën e shkretëruar, e me të – nxjerrim të lashtat, me të cilat ushqehen shtazët e tyre dhe ata vetë, e ata madje nuk po shohin?!",
                            "verse 32:28": "Dhe, ata thonë: “E, kur më fitorja (Dita e Kijametit), nëse thoni të vërtetën?”",
                            "verse 32:29": "Thuaju (o Muhammed!): “Ditën e gjykimit, nuk do t’u bëjë dobi mohuesve besimi i tyre, e as që do t’u jepet afat”.",
                            "verse 32:30": "Andaj, ti shmangu nga ata dhe prit, edhe ata, me të vërtetë, po presin! afat”."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Əlif, Lam, Mim!",
                            "verse 32:2": "Kitabın (Qur'anın) aləmlərin Rəbbi tərəfindən nazil edilməsində heç bir şəkk-şübhə yoxdur!",
                            "verse 32:3": "Yoxsa (müşriklər): \"(Muhəmməd) onu özündən uydurmuşdur!\" - deyirlər.",
                            "verse 32:4": "Göyləri, yeri və onların arasındakıları altı gündə xəlq edən, sonra ərşi yaradıb hökmü altına alan (ərşdə bərqərar olan) Allahdır.",
                            "verse 32:5": "O, göydən yerə qədər olan bütün işləri idarə edir.",
                            "verse 32:6": "O, qeybi də, aşkarı da biləndir, yenilməz qüvvət sahibi, mərhəmət sahibidir!",
                            "verse 32:7": "O, yaratdığı hər şeyi gözəl yaratdı, insanı (Adəmi) yaratmağa palçıqdan başladı.",
                            "verse 32:8": "Sonra onun nəslini nütfədən - bir qətrə zəif (dəyərsiz) sudan əmələ gətirdi.",
                            "verse 32:9": "Sonra onu düzəldib insan şəklinə saldı və ona öz ruhundan (özünün yaratdığı ruhdan) üfürdü (həyat verdi).",
                            "verse 32:10": "(Axirətə inanmayanlar) dedilər: \"Məgər biz torpağa qarışıb yox olandan sonra yenidənmi yaradılacağıq?\" Bəli, onlar Rəbbi ilə qarşılaşacaqlarını (qiyamət günü dirilib haqq-hesab üçün Allahın hüzurunda duracaqlarını) inkar edən kəslərdir!",
                            "verse 32:11": "(Ya Rəsulum!) De: \"Sizə müvəkkil olan ölüm mələyi (Əzrail) canınızı alacaqdır.",
                            "verse 32:12": "(Ya Rəsulum!) Kaş günahları öz Rəbbinin hüzurunda (günahlarından utanaraq) başlarını aşağı dikib: \"Ey Rəbbimiz! (Dünyada yalan hesab etdiyimiz qiyaməti və onun əzabını) gördük, (peyğəmbərlərin doğru dediklərini, haqq olduqlarını Səndən) eşitdik.",
                            "verse 32:13": "Əgər Biz istəsəydik, hər kəsi doğru yola salardıq (imana müvəffəq edərdik).",
                            "verse 32:14": "(Kafirlər Cəhənnəmə girdikdə Allah onlara belə buyurar: ) \"Bu günə yetişəcəyinizi unutduğunuza görə indi dadın (əzabı)! Biz də sizi unutduq.",
                            "verse 32:15": "Bizim ayələrimizə ancaq ayələrimizlə öyüd-nəsihət olunduqları zaman səcdəyə qapananlar və təkəbbür göstərməyərək Rəbbini həmd-səna ilə təqdis edənlər iman gətirərlər.",
                            "verse 32:16": "Onlar ibadət üçün yataqlarından qalxar (gecələr az yatar), qorxu və ümid içində (Allahın əzabından qorxaraq, mərhəmətinə ümid bəsləyərək) Rəbbinə dua edər və onlara verdiyimiz ruzilərdən (ehtiyacı olanlara) sərf edərlər.",
                            "verse 32:17": "Etdikləri əməllərin mükafatı olaraq (Allah dərgahında) onlar (mö'minlər) üçün göz oxşayan (onları sevindirəcək) nə cür ne'mətlər gizlənib saxlandığını heç kəs bilməz!",
                            "verse 32:18": "Məgər mö'min kimsə ilə (Allahın itaətindən çıxmış) fasiq eynidirmi?! Əlbəttə, onlar eyni ola bilməzlər!",
                            "verse 32:19": "İman gətirib yaxşı işlər görənləri etdikləri əməllər müqabilində qonaq qalacaqları (sakin olacaqları) Mə'va cənnətləri gözləyir.",
                            "verse 32:20": "Fasiqlərə gəldikdə isə, onların məskəni cəhənnəm odudur.",
                            "verse 32:21": "Biz ən böyük əzabdan (axirət əzabından) əvvəl onlara mütləq dünya əzabından daddıracağıq.",
                            "verse 32:22": "Rəbbinin ayələri ilə öyüd-nəsihət verildikdən sonra onlardan üz döndərən kəsdən daha zalım kim ola bilər?! Biz, şübhəsiz ki, onlardan intiqam alacağıq!",
                            "verse 32:23": "Biz Musaya kitab (Tövrat) vermişdik.",
                            "verse 32:24": "(Cətinliklərə) səbr etdikləri və ayələrimizə ürəkdən inandıqları üçün Biz onlardan (İsrail oğullarından) əmrimizlə (insanlara) haqq yolu göstərən rəhbərlər tə'yin etmişdik.",
                            "verse 32:25": "(Ya Rəsulum!) Həqiqətən, sənin Rəbbin onların (mö'minlərlə kafirlərin) arasında qiyamət günü ixtilafda olduqları (dini) məsələlər barədə hökm verəcəkdir!",
                            "verse 32:26": "Məgər onlar indi yurdlarında gəzib-dolaşdıqları özlərindən əvvəlki neçə-neçə nəsilləri (peyğəmbərlərini yalançı saydıqlarından ötrü) məhv etdiyimizi görmürlərmi? Həqiqətən, bunda (Məkkə müşrikləri üçün) ibrətlər vardır.",
                            "verse 32:27": "Məgər görmürlərmi ki, Biz quru yerə su göndərib onunla heyvanlarının və özlərinin yedikləri əkinlər (bitkilər, meyvələr) yetişdiririk? Məgər (bütün bunları öz gözləri ilə) görmürlər?",
                            "verse 32:28": "Onlar: \"Əgər doğru danışanlardansınızsa, (bir xəbər verin görək) bu fəth (Məkkənin fəthi, Bədr vuruşu, yaxud qiyamət günü) nə vaxt olacaqdır? - deyə soruşarlar.",
                            "verse 32:29": "(Ya Rəsulum!) De: \"Fəth günü kafirlərlə (sonrakı) imanı heç bir fayda verməz və onlara (tövbə etmək üçün) möhlət də verilməz!\"",
                            "verse 32:30": "(Ya Rəsulum!) Artıq onlardan üz çevir və (Allahın onlara əzab verəcəyi günü) gözlə."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Elif Lam Mim.",
                            "verse 32:2": "Knjigu objavljuje, u to nema sumnje, Gospodar svjetova,",
                            "verse 32:3": "a oni govore: \"On je izmišlja!\" Ne, ona je istina od Gospodara tvoga da opominješ narod kojemu prije tebe nije došao niko da ga opominje, da bi išao Pravim putem.",
                            "verse 32:4": "Allah je nebesa i Zemlju i ono što je između njih u šest vremenskih razdoblja stvorio, a onda svemirom zagospodario; vi, osim Njega, ni zaštitnika ni posrednika nemate, pa zašto se ne urazumite?",
                            "verse 32:5": "On upravlja svima, od neba do Zemlje, a onda se sve to Njemu vraća u danu koji, prema vašem računanju vremena, hiljadu godina traje.",
                            "verse 32:6": "To je onaj koji zna i nevidljivi i vidljivi svijet, Silni i Milostivi,",
                            "verse 32:7": "koji sve savršeno stvara, koji je prvog čovjeka stvorio od ilovače -",
                            "verse 32:8": "a potomstvo njegovo stvara od kapi hude tekućine,",
                            "verse 32:9": "zatim mu savršeno udove uobliči i život mu udahne - i On vam i sluh i vid i pameti daje - a kako vi malo zahvaljujete!",
                            "verse 32:10": "Oni govore: \"Zar ćemo, kad nestanemo pod zemljom, ponovo stvoreni biti?\" Oni ne vjeruju da će pred Gospodara svoga izići.",
                            "verse 32:11": "Reci: \"Melek smrti, koji vam je za to određen, duše će vam uzeti, a poslije ćete se Gospodaru svome vratiti.",
                            "verse 32:12": "A da ti je vidjeti grješnike kako će, oborenih glava pred Gospodarom svojim, reći: \"Gospodaru naš, vidjeli smo i čuli smo, pa nas povrati da dobra djela činimo, mi, doista, čvrsto vjerujemo!\"",
                            "verse 32:13": "A kad bismo htjeli, svakog čovjeka bismo na Pravi put uputili, ali Ja sam već istinu rekao: \"Napuniću, zaista, Džehennem džinima i ljudima zajedno!\"",
                            "verse 32:14": "Pa trpite zato što ste zaboravljali da ćete ovaj dan doživjeti - i Mi ćemo vas zaboraviti - i vječnu patnju trpite zbog onoga što ste radili.",
                            "verse 32:15": "U Naše riječi vjeruju samo oni koji, kad se njima opomenu, licem na tle padaju, i koji Gospodara svoga veličaju i hvale i koji se ne ohole.",
                            "verse 32:16": "Bokovi njihovi se postelja lišavaju i oni se Gospodaru svome iz straha i želje klanjaju, a dio onog što im Mi dajemo udjeljuju.",
                            "verse 32:17": "I niko ne zna kakve ih, kao nagrada za ono što su činili, skrivene radosti čekaju.",
                            "verse 32:18": "Zar da vjerniku bude isto kao grješniku? Ne, njima neće biti isto:",
                            "verse 32:19": "one koji su vjerovali i dobra djela činili čekaju džennetske bašče u kojima će boraviti, kao nagrada za ono što su radili;",
                            "verse 32:20": "a one koji nisu vjerovali čeka vatra u kojoj će prebivati; kad god pokušaju iz nje izići, biće u nju vraćeni i biće im rečeno: \"Trpite kaznu u vatri koju ste poricali.",
                            "verse 32:21": "I Mi ćemo učiniti da blažu kaznu iskuse, prije one najveće, ne bi li se pokajali.",
                            "verse 32:22": "A ima li nepravednijeg od onoga koji, opomenut riječima Gospodara svoga, njima leđa okrene? Mi ćemo, zaista, kazniti zlikovce!",
                            "verse 32:23": "Musau smo Mi Knjigu dali - ne sumnjaj nimalo u to da je on nije primio - i putokazom je sinovima Israilovim učinili.",
                            "verse 32:24": "Između njih smo Mi vođe određivali i oni su, odazivajući se zapovijedi Našoj, na Pravi put upućivali, jer su strpljivi bili i u dokaze Naše čvrsto vjerovali.",
                            "verse 32:25": "Gospodar tvoj će među njima na Sudnjem danu presuditi u onome oko čega su se razilazili.",
                            "verse 32:26": "Zar ovima nije jasno koliko smo Mi prije njih naroda uništili, po čijim oni nastambama hodaju? To su, zaista, dokazi, pa zašto neće da čuju?",
                            "verse 32:27": "Kako oni ne vide da Mi gonimo kišu u ogoljelu zemlju, i činimo da, uz pomoć njenu, niče rastinje kojim se hrani stoka njihova, a i oni sami - pa zašto neće da vide?!",
                            "verse 32:28": "I oni govore: \"Kad će već jednom ta pobjeda, ako istinu govorite?\"",
                            "verse 32:29": "Reci: \"Na Sudnjem danu, kada nevjernicima neće nikako koristiti to što će tada vjerovati i kad im se nimalo vremena neće dati.",
                            "verse 32:30": "Zato se ti okreni od njih i čekaj, i oni doista čekaju! dati."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "আলিফ-লাম-মীম।",
                            "verse 32:2": "এ কিতাবের অবতরণ বিশ্বপালনকর্তার নিকট থেকে এতে কোন সন্দেহ নেই।",
                            "verse 32:3": "তারা কি বলে, এটা সে মিথ্যা রচনা করেছে? বরং এটা আপনার পালনকর্তার তরফ থেকে সত্য, যাতে আপনি এমন এক সম্প্রদায়কে সতর্ক করেন, যাদের কাছে আপনার পূর্বে কোন সতর্ককারী আসেনি। সম্ভবতঃ এরা সুপথ প্রাপ্ত হবে।",
                            "verse 32:4": "আল্লাহ যিনি নভোমন্ডল, ভুমন্ডল ও এতদুভয়ের মধ্যবর্তী সবকিছু ছয় দিনে সৃষ্টি করেছেন, অতঃপর তিনি আরশে বিরাজমান হয়েছেন। তিনি ব্যতীত তোমাদের কোন অভিভাবক ও সুপারিশকারী নেই। এরপরও কি তোমরা বুঝবে না?",
                            "verse 32:5": "তিনি আকাশ থেকে পৃথিবী পর্যন্ত সমস্ত কর্ম পরিচালনা করেন, অতঃপর তা তাঁর কাছে পৌছবে এমন এক দিনে, যার পরিমাণ তোমাদের গণনায় হাজার বছরের সমান।",
                            "verse 32:6": "তিনিই দৃশ্য ও অদৃশ্যের জ্ঞানী, পরাক্রমশালী, পরম দয়ালু,",
                            "verse 32:7": "যিনি তাঁর প্রত্যেকটি সৃষ্টিকে সুন্দর করেছেন এবং কাদামাটি থেকে মানব সৃষ্টির সূচনা করেছেন।",
                            "verse 32:8": "অতঃপর তিনি তার বংশধর সৃষ্টি করেন তুচ্ছ পানির নির্যাস থেকে।",
                            "verse 32:9": "অতঃপর তিনি তাকে সুষম করেন, তাতে রূহ সঞ্চার করেন এবং তোমাদেরকে দেন কর্ণ, চক্ষু ও অন্তঃকরণ। তোমরা সামান্যই কৃতজ্ঞতা প্রকাশ কর।",
                            "verse 32:10": "তারা বলে, আমরা মৃত্তিকায় মিশ্রিত হয়ে গেলেও পুনরায় নতুন করে সৃজিত হব কি? বরং তারা তাদের পালনকর্তার সাক্ষাতকে অস্বীকার করে।",
                            "verse 32:11": "বলুন, তোমাদের প্রাণ হরণের দায়িত্বে নিয়োজিত ফেরেশতা তোমাদের প্রাণ হরণ করবে। অতঃপর তোমরা তোমাদের পালনকর্তার কাছে প্রত্যাবর্তিত হবে।",
                            "verse 32:12": "যদি আপনি দেখতেন যখন অপরাধীরা তাদের পালনকর্তার সামনে নতশির হয়ে বলবে, হে আমাদের পালনকর্তা, আমরা দেখলাম ও শ্রবণ করলাম। এখন আমাদেরকে পাঠিয়ে দিন, আমরা সৎকর্ম করব। আমরা দৃঢ়বিশ্বাসী হয়ে গেছি।",
                            "verse 32:13": "আমি ইচ্ছা করলে প্রত্যেককে সঠিক দিক নির্দেশ দিতাম; কিন্তু আমার এ উক্তি অবধারিত সত্য যে, আমি জিন ও মানব সকলকে দিয়ে অবশ্যই জাহান্নাম পূর্ণ করব।",
                            "verse 32:14": "অতএব এ দিবসকে ভূলে যাওয়ার কারণে তোমরা মজা আস্বাদন কর। আমিও তোমাদেরকে ভুলে গেলাম। তোমরা তোমাদের কৃতকর্মের কারণে স্থায়ী আযাব ভোগ কর।",
                            "verse 32:15": "কেবল তারাই আমার আয়াতসমূহের প্রতি ঈমান আনে, যারা আয়াতসমূহ দ্বারা উপদেশপ্রাপ্ত হয়ে সেজদায় লুটিয়ে পড়ে এবং অহংকারমুক্ত হয়ে তাদের পালনকর্তার সপ্রশংস পবিত্রতা বর্ণনা করে। [ Sajdah ]",
                            "verse 32:16": "তাদের পার্শ্ব শয্যা থেকে আলাদা থাকে। তারা তাদের পালনকর্তাকে ডাকে ভয়ে ও আশায় এবং আমি তাদেরকে যে রিযিক দিয়েছি, তা থেকে ব্যয় করে।",
                            "verse 32:17": "কেউ জানে না তার জন্যে কৃতকর্মের কি কি নয়ন-প্রীতিকর প্রতিদান লুক্কায়িত আছে।",
                            "verse 32:18": "ঈমানদার ব্যক্তি কি অবাধ্যের অনুরূপ? তারা সমান নয়।",
                            "verse 32:19": "যারা ঈমান আনে ও সৎকর্ম করে, তাদের জন্যে রয়েছে তাদের কৃতকর্মের আপ্যায়নস্বরূপ বসবাসের জান্নাত।",
                            "verse 32:20": "পক্ষান্তরে যারা অবাধ্য হয়, তাদের ঠিকানা জাহান্নাম। যখনই তারা জাহান্নাম থেকে বের হতে চাইবে, তখনই তাদেরকে তথায় ফিরিয়ে দেয়া হবে এবং তাদেরকে বলা হবে, তোমরা জাহান্নামের যে আযাবকে মিথ্যা বলতে, তার স্বাদ আস্বাদন কর।",
                            "verse 32:21": "গুরু শাস্তির পূর্বে আমি অবশ্যই তাদেরকে লঘু শাস্তি আস্বাদন করাব, যাতে তারা প্রত্যাবর্তন করে।",
                            "verse 32:22": "যে ব্যক্তিকে তার পালনকর্তার আয়াতসমূহ দ্বারা উপদেশ দান করা হয়, অতঃপর সে তা থেকে মুখ ফিরিয়ে নেয়, তার চেয়ে যালেম আর কে? আমি অপরাধীদেরকে শাস্তি দেব।",
                            "verse 32:23": "আমি মূসাকে কিতাব দিয়েছি, অতএব আপনি কোরআন প্রাপ্তির বিষয়ে কোন সন্দেহ করবেন না। আমি একে বনী ইসরাঈলের জন্যে পথ প্রদর্শক করেছিলাম।",
                            "verse 32:24": "তারা সবর করত বিধায় আমি তাদের মধ্য থেকে নেতা মনোনীত করেছিলাম, যারা আমার আদেশে পথ প্রদর্শন করত। তারা আমার আয়াতসমূহে দৃঢ় বিশ্বাসী ছিল।",
                            "verse 32:25": "তারা যে বিষয়ে মত বিরোধ করছে, আপনার পালনকর্তাই কেয়ামতের দিন সে বিষয়ে তাদের মধ্যে ফয়সালা দেবেন।",
                            "verse 32:26": "এতে কি তাদের চোখ খোলেনি যে, আমি তাদের পূর্বে অনেক সম্প্রদায়কে ধ্বংস করেছি, যাদের বাড়ী-ঘরে এরা বিচরণ করে। অবশ্যই এতে নিদর্শনাবলী রয়েছে। তারা কি শোনে না?",
                            "verse 32:27": "তারা কি লক্ষ্য করে না যে, আমি উষর ভূমিতে পানি প্রবাহিত করে শস্য উদগত করি, যা থেকে ভক্ষণ করে তাদের জন্তুরা এবং তারা কি দেখে না?",
                            "verse 32:28": "তারা বলে তোমরা সত্যবাদী হলে বল; কবে হবে এই ফয়সালা?",
                            "verse 32:29": "বলুন, ফয়সালার দিনে কাফেরদের ঈমান তাদের কোন কাজে আসবে না এবং তাদেরকে অবকাশ ও দেয়া হবে না।",
                            "verse 32:30": "অতএব আপনি তাদের থেকে মুখ ফিরিয়ে নিন এবং অপেক্ষা করুন, তারাও অপেক্ষা করছে। না।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 32:1": "Алиф.",
                            "verse 32:2": "Низпославането на Книгата - без съмнение в нея - е от Господа на световете.",
                            "verse 32:3": "А",
                            "verse 32:4": "казват: Той я е измислил! Не, тя е истината от твоя Господ, за да предупредиш народ, при който дотогава не е идвал друг предупредител, та да бъдат напътени.",
                            "verse 32:5": "Аллах е, Който сътвори небесата и земята, и всичко между тях в шест дни.",
                            "verse 32:6": "Той на Трона.",
                            "verse 32:7": "Той управлява делата от небето до земята, после те се въздигат към Него в един Ден, колкото хиляда години, според вашето броене.",
                            "verse 32:8": "Той е Знаещия и скритото, и явното, Всемогъщия, Милосърдния,",
                            "verse 32:9": "Който сътвори със съвършенство всяко нещо и начена сътворяването на човека от глина.",
                            "verse 32:10": "После Той сътвори потомството му от капка нищожна вода.",
                            "verse 32:11": "После го осъразмери и му вдъхна от Своя дух.",
                            "verse 32:12": "И рекоха: Нима след като изчезнем в земята, наистина ще бъдем сътворени отново? Да, в срещата със своя Господ те не вярват.",
                            "verse 32:13": "Кажи: Ще ви прибере душите Ангелът на смъртта, комуто сте възложени.",
                            "verse 32:14": "Ако видиш как престъпниците свеждат глави пред своя Господ: Господи наш, видяхме и чухме! Върни ни, за да сторим праведни дела! Ние вече сме убедени.",
                            "verse 32:15": "Ако пожелаехме, щяхме да дадем на всекиго неговото напътствие.",
                            "verse 32:16": "Вкусете, защото забравихте срещата в този ваш Ден! Забравяме ви и Ние.",
                            "verse 32:17": "Вярват в Нашите знамения само онези, които щом им се спомене за тях, падат, свеждайки чела до земята в суджуд и прославят с възхвала своя Господ, и не се възгордяват.",
                            "verse 32:18": "И напускат постелите си, и със страх и копнеж зоват своя Господ, и от онова, което сме им дали, раздават.",
                            "verse 32:19": "Никой не знае каква радост за окото е скрита за тях - въздаяние за онова, което са вършили.",
                            "verse 32:20": "Нима онзи, който вярва, е като онзи, който е нечестивец? Не са равни те.",
                            "verse 32:21": "Които вярват и вършат праведни дела, техни са Градините на обителта - гостоприемство за онова, което са вършили.",
                            "verse 32:22": "А които са нечестивци, мястото им е Огънят.",
                            "verse 32:23": "И им даваме да вкусят от най-близкото мъчение преди най-голямото мъчение, за да се покаят.",
                            "verse 32:24": "И кой е по-голям угнетител от онзи, комуто се напомнят знаменията на неговия Господ, а после той се отвръща от тях? Отмъщаваме Ние на престъпниците.",
                            "verse 32:25": "И дадохме на Муса Писанието: Не се съмнявай в срещата с Него! И го сторихме напътствие за синовете на Исраил.",
                            "verse 32:26": "И когато бяха търпеливи, и в Нашите знамения се бяха убедили, сторихме от тях водители, напътващи според Нашата повеля.",
                            "verse 32:27": "В Деня на възкресението твоят Господ ще отсъди между тях за онова, по което бяха в разногласие.",
                            "verse 32:28": "И нима на неверниците не им бе посочено колко поколения преди тях погубихме?",
                            "verse 32:29": "тези се движат в техните жилища.",
                            "verse 32:30": "И нима не виждат, че Ние насочваме водата към сухата земя, и сторваме с нея да поникнат насаждения, от които ядат те и техният добитък.",
                            "verse 32:31": "И казват: Кога ще бъде това отсъждане, ако говорите истината?",
                            "verse 32:32": "Кажи: За неверниците в Деня на отсъждането не ще е от полза, ако тогава повярват.",
                            "verse 32:33": "Отдръпни се от тях и чакай! И те ще чакат."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "艾列弗，倆目，米目。",
                            "verse 32:2": "（這）是從全世界的主降示的經典，其中毫無疑義。",
                            "verse 32:3": "他們說：「他捏造它嗎？」不然！它是從你的主降示的真理，以便你警告在你之前沒有任何警告者來臨過的一群民眾，以便他們遵循正道。",
                            "verse 32:4": "真主曾在六日內創造天地萬物，然後，升上寶座，除他外，你們沒有任何監護者和說情者。你們怎麼不記念呢？",
                            "verse 32:5": "他治理自天至地的事物，然後那事物在一日之內上升到他那裡，那一日的長度，是你們所計算的一千年。",
                            "verse 32:6": "那是全知幽明的、萬能的、至慈的主。",
                            "verse 32:7": "他精制他所創造的萬物，他最初用泥土創造人。",
                            "verse 32:8": "然後用賤水的精華創造他的子孫。",
                            "verse 32:9": "然後使他健全，並將他的精神吹在他的身體中，又為你們創造耳目心靈。你們很少感謝。",
                            "verse 32:10": "他們說：「我們消失在地下之後，難道我們必定重新受造嗎？」不然！他們不信將與他們的主相會。",
                            "verse 32:11": "你說：「奉命主管你們的生命的死神，將使你們死亡，然後你們將被召歸於你們的主。」",
                            "verse 32:12": "假若你得見犯罪者在他們的主那裡垂頭喪氣地說：「我們的主啊！我們已經看見了，聽見了，求你讓我們轉回去，我們將做善事，我們確是確信者。」假若你看見這種情狀……。",
                            "verse 32:13": "假若我意欲，必以向導賦予每個人，但從我發出的判詞已確定了，我必以精靈和人類一起填滿火獄。",
                            "verse 32:14": "你們嘗試吧！因為你們忘記今日的相會，我確已忘記你們了。你們因為自己的行為而嘗試永久的刑罰吧。",
                            "verse 32:15": "信仰我的蹟象的，只有那等人：別人以我的蹟象勸戒他們的時候，他們便俯伏叩頭並讚頌他們的那超絕萬物的主，他們不敢妄自尊大，※",
                            "verse 32:16": "他們肋不落床，他們以恐懼和希望的心情祈禱他們的主；他們分捨我所賜予他們的。",
                            "verse 32:17": "任何人都不知道已為他們貯藏了甚麼慰藉，以報酬他們的行為。",
                            "verse 32:18": "信道者與悖逆者一樣嗎？他們是不相等的。",
                            "verse 32:19": "至於信道而且行善者，將來得以樂園為歸宿，那是為了報酬他們的行為的。",
                            "verse 32:20": "至於悖逆者，他們的歸宿，只是火獄，每當他們要想逃出，都被攔回去。有聲音對他們說：「你們嘗試以前你們所否認的火刑吧！」",
                            "verse 32:21": "在最大的刑罰之前，我必使他們嘗試最近的刑罰，以便他們悔悟。",
                            "verse 32:22": "有人以主的蹟象勸戒他，而他不肯聽從，這樣的人，誰比他還不義呢？我必然要懲浩犯罪的人。",
                            "verse 32:23": "我確已把經典賞賜穆薩，所以你們對於接受經典，不要陷於猶豫中，我曾以那部經典為以色列後裔的向導。",
                            "verse 32:24": "我曾以他們中的一部分人為表率，當他們忍受艱難，確信我的蹟象的時候，奉我的命令去引導眾人。",
                            "verse 32:25": "復活日，你的主必定判決他們所爭論的是非。",
                            "verse 32:26": "道他們還不曉得嗎？在他們之前，我曾毀滅了許多世代，他們常常經過那些人的故鄉，在那裡確有許多蹟象。他們怎麼不聽從呢？",
                            "verse 32:27": "他們還不知道嗎？我把雨水趕到無草的地方，而借它生出他們的牲畜和他們自己所食的莊稼。難道他們看不見嗎？",
                            "verse 32:28": "他們說：「這種判決甚麼時候實現呢？如果你們是說實話的。」",
                            "verse 32:29": "你說：「不信道者，在判決日，雖信無益，並且不獲得寬待。」",
                            "verse 32:30": "你應當避開他們，你應當等待，他們必定是等待的。 你說：「不信道者，在判決日，雖信無益，並且不獲得寬待。」"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Alif lám mím!",
                            "verse 32:2": "Seslání Písma tohoto - o němž pochyby není - od Pána lidstva veškerého pochází;",
                            "verse 32:3": "oni však říkají: \"Sám si to vymyslil!\" Ó nikoliv, to pravda je od Pána tvého pocházející, abys varoval lid, k němuž nepřišel před tebou varovatel žádný - snad půjdou po správné cestě.",
                            "verse 32:4": "Bůh je ten, jenž nebesa a zemi i vše, co je mezi nimi, v šesti dnech stvořil a pak na trůnu Svém se usadil.",
                            "verse 32:5": "On rozkaz z nebe na zem usměrňuje a ten pak k Němu vystoupí v den, jehož délka - podle počítání vašeho - tisíc let činí.",
                            "verse 32:6": "A tak tomu je - On zná nepoznatelné i všeobecně známé a On mocný je i slitovný;",
                            "verse 32:7": "ten, jenž udělal překrásně každou věc jím stvořenou a člověka nejdříve z hlíny stvořil,",
                            "verse 32:8": "pak potomstvo jeho z kapky vody nicotné učinil",
                            "verse 32:9": "a potom jej vyrovnal a část ducha Svého v něj vdechl; a sluch, zrak i srdce všem vám dal - a přece jak málo jste vděční!",
                            "verse 32:10": "A říkají: \"A až zabloudíme kdesi v zemi, což vskutku budeme novým stvořením vzkříšeni?\" A přece jen v setkání s Pánem svým nevěří!",
                            "verse 32:11": "Rci: \"Anděl smrti, jenž vás na starosti má, vás povolá a potom budete k Pánu svému navráceni!\"",
                            "verse 32:12": "Kdybys viděl, jak provinilci klopíce hlavy před Pánem svým volat budou: \"Pane náš, viděli jsme a slyšeli jsme; vrať nás na zem a my zbožné skutky konat budeme, neboť nyní jsme o pravdě přesvědčeni.",
                            "verse 32:13": "Kdybychom chtěli, dali bychom duši každé vedení správné, leč nechť uskuteční se slovo Mé: \"Věru naplním peklo lidmi spolu s džiny!\"",
                            "verse 32:14": "Ochutnejte trestu za to, že jste zapomněli na setkání s tímto svým dnem; My také jsme na vás zapomněli, okuste tedy za skutky své trest nesmrtelný!",
                            "verse 32:15": "Ve znamení Naše pak věří jedině ti, kdož při zmínce o nich na zem padají klaníce se a chválu Pána svého slaví, aniž jsou domýšliví.",
                            "verse 32:16": "Boky jejich se lůžkům vyhýbají, neboť oni Pána svého z bázně i z touhy vzývají, a z toho, co jsme jim uštědřili, rozdávají.",
                            "verse 32:17": "Žádná duše neví, co z radostí skryto je pro ně odměnou za skutky jejich.",
                            "verse 32:18": "Cožpak je věřící roven tomu, kdo je hanebník? Ne, ti rovni si nebudou.",
                            "verse 32:19": "Pro ty, kdož uvěřili a zbožné skutky konali, pro ty jsou určeny zahrady útulku jako příbytek za to, co činili,",
                            "verse 32:20": "však těm, kdož nepravosti páchali, těm oheň bude útočištěm.",
                            "verse 32:21": "A dáme jim okusit trestu bližšího kromě trestu většího - snad se z bludu svého navrátí.",
                            "verse 32:22": "Kdo je nespravedlivější než ten, jenž - když připomínána jsou mu znamení Pána jeho - od nich se odvrátí? My věru se provinilým pomstíme.",
                            "verse 32:23": "Věru jsme již dali Mojžíšovi Písmo - a nebuď na pochybách, že se s Nim setkáš - a stanovili jsme je pro dítka Izraele jako vedení",
                            "verse 32:24": "a z nich pak učinili jsme vedoucí, aby podle rozkazu Našeho vedli za to, že byli neochvějní a o znameních Našich přesvědčeni.",
                            "verse 32:25": "Pán tvůj vskutku pak rozsoudí mezi nimi v den zmrtvýchvstání to, o čem se v mínění rozcházejí.",
                            "verse 32:26": "Což nebylo jim ukázáno, kolik před nimi jsme již zahubili pokolení, okolo jichž příbytků tak často procházejí? A věru jsou v tom znamení - což sluchu tomu nepopřejí?",
                            "verse 32:27": "Což nepozorují, jak ženeme vodu na zem vyprahlou, takže z ní obilí vzrůstá, jímž živí se jak oni, tak i jejich stáda? Což jasně to nezří?",
                            "verse 32:28": "A vyptávají se: \"Kdy tedy přijde ono rozhodnutí, jste-li pravdomluvní?\"",
                            "verse 32:29": "Odpověz: \"V den rozhodnutí nebude nic platna víra těm, kdož nevěřící byli, a nebude jim dán odklad žádný!\"",
                            "verse 32:30": "Odvrať se tedy od nich a vyčkávej! Však také oni čekají."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Alif Laam Miem.",
                            "verse 32:2": "De openbaring van het Boek is zonder twijfel van de Heer der Werelden.",
                            "verse 32:3": "Zeggen zij: \"Hij heeft het verzonnen?\" Neen, het is de Waarheid van uw Heer, opdat gij een volk moogt waarschuwen onder hetwelk vóór u geen waarschuwer is geweest, opdat zij geleid mogen worden.",
                            "verse 32:4": "God is het, Die de hemelen en de aarde en hetgeen er tussen is in zes dagen schiep; daarna zette Hij Zich op de Troon.",
                            "verse 32:5": "Hij ordent het bestel van de hemel tot de aarde, daarna zal deze tot Hem opstijgen in een dag, waarvan de duur naar uw berekening duizend jaar is.",
                            "verse 32:6": "Alzo is de Kenner van het onzichtbare en het zichtbare, de Almachtige, de Genadevolle,",
                            "verse 32:7": "Die de schepping van alles voltooide.",
                            "verse 32:8": "Daarna maakte Hij zijn nageslacht uit een uittreksel van een nietige vloeistof.",
                            "verse 32:9": "Dan vormde Hij hem en ademde hem van Zijn geest in.",
                            "verse 32:10": "En zij zeggen: \"Zullen wij, wanneer wij in de aarde verloren zijn, opnieuw worden geschapen?\" Neen, zij geloven niet in de ontmoeting met hun Heer.",
                            "verse 32:11": "Zeg: \"De doodsengel, aan wie gij toevertrouwd zijt, zal uw ziel nemen; dan zult gij tot uw Heer worden teruggebracht.",
                            "verse 32:12": "O, kon gij het slechts zien wanneer de schuldigen hun hoofd zullen buigen voor hun Heer, zeggende: \"Onze Heer, wij hebben gezien en wij hebben gehoord, zend ons nu terug opdat wij goede werken mogen verrichten; voorzeker wij zijn thans overtuigd.",
                            "verse 32:13": "Indien Wij het wilden, zouden Wij aan elke ziel haar leiding kunnen geven, maar Mijn woord werd bewaarheid: \"Ik zal de hel met djinn en mensen allen tezamen vullen.",
                            "verse 32:14": "Ondergaat daarom (de straf) omdat gij de ontmoeting van deze Dag vergat.",
                            "verse 32:15": "Slechts zij geloven in Onze tekenen, die, wanneer zij er aan herinnerd worden, zich met het gelaat ter aarde werpen en hun Heer verheerlijken met de lof die Hem toekomt, en die niet hoogmoedig zijn.",
                            "verse 32:16": "Zij verwijderen zich van hun bed, hun Heer in vrees en hoop aanroepende en zij doen wel met hetgeen Wij hun hebben geschonken.",
                            "verse 32:17": "Maar niemand weet welke verkwikking der ogen voor hen verborgen is gehouden als beloning voor wat zij hebben gedaan.",
                            "verse 32:18": "Zou dan de gelovige gelijk zijn aan hem die ongehoorzaam is? Zij zijn (stellig) niet gelijk.",
                            "verse 32:19": "Zij, dje geloven en goede werken doen, zullen Tuinen hebben tot verblijf, als onthaal voor hetgeen zij deden.",
                            "verse 32:20": "Maar het tehuis v an de ongehoorzamen zal het Vuur zijn.",
                            "verse 32:21": "Wij zullen hen inderdaad de lichtere straf doen ondergaan vóór de grotere straf opdat zij zich mogen bekeren.",
                            "verse 32:22": "En wie is onrechtvaardiger dan hij die door het teken van zijn Heer wordt vermaand en zich er toch van afwendt? Wij zullen de schuldigen beslist straffen.",
                            "verse 32:23": "Voorzeker, Wij gaven Mozes het Boek - twijfel dus niet aan de ontmoeting met Hem - en Wij maakten dit tot een richtsnoer voor de kinderen van Israël.",
                            "verse 32:24": "En Wij stelden leiders uit hun midden aan, die het volk door Ons gebod leidden, zolang zij standvastig waren en in Onze woorden een hecht geloof hadden.",
                            "verse 32:25": "Voorwaar, uw Heer zal op de Dag der Opstanding onder hen richten over hetgeen waaromtrent zij onderling verschillen.",
                            "verse 32:26": "Komen zij niet tot inzicht (door het feit) dat Wij zovele geslachten vóór hen hebben vernietigd in wier woonplaatsen zij nu rondlopen? Daarin zijn zeker tekenen.",
                            "verse 32:27": "Hebben zij niet gezien dat Wij het water naar het droge land voeren en daardoor oogsten voortbrengen waarvan zij en hun vee eten? Willen zij dan niet inzien?",
                            "verse 32:28": "En zij (de ongelovigen) zeggen: \"Wanneer zal deze beslissing plaats vinden als gij de waarheid spreekt?\"",
                            "verse 32:29": "Zeg: \"Op de Dag der Beslissing zal het geloof der ongelovigen hen niet baten, noch zal hun uitstel worden verleend.",
                            "verse 32:30": "Wend u daarom van hen af, en wacht; voorzeker zij wachten ook."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 32:1": "Alif.",
                            "verse 32:2": "The revelation of the Scripture whereof there is no doubt is from the Lord of the Worlds.",
                            "verse 32:3": "Or say they: He hath invented it ? Nay, but it is the Truth from thy Lord, that thou mayst warn a folk to whom no warner came before thee, that haply they may walk aright.",
                            "verse 32:4": "Allah it is Who created the heavens and the earth, and that which is between them, in six Days.",
                            "verse 32:5": "He directeth the ordinance from the heaven unto the earth; then it ascendeth unto Him in a Day, whereof the measure is a thousand years of that ye reckon.",
                            "verse 32:6": "Such is the Knower of the Invisible and the Visible, the Mighty, the Merciful,",
                            "verse 32:7": "Who made all things good which He created, and He began the creation of man from clay;",
                            "verse 32:8": "Then He made his seed from a draught of despised fluid;",
                            "verse 32:9": "Then He fashioned him and breathed into him of His Spirit; and appointed for you hearing and sight and hearts.",
                            "verse 32:10": "And they say: When we are lost in the earth, how can we then be re-created ? Nay but they are disbelievers in the meeting with their Lord.",
                            "verse 32:11": "Say: The angel of death, who hath charge concerning you, will gather you, and afterward unto your Lord ye will be returned.",
                            "verse 32:12": "Couldst thou but see when the guilty hang their heads before their Lord, (and say): Our Lord! We have now seen and heard, so send us back; we will do right, now we are sure.",
                            "verse 32:13": "And if We had so willed, We could have given every soul its guidance, but the word from Me concerning evildoers took effect: that I will fill hell with the jinn and mankind together.",
                            "verse 32:14": "So taste (the evil of your deeds).",
                            "verse 32:15": "Only those believe in Our revelations who, when they are reminded of them, fall down prostrate and hymn the praise of their Lord, and they are not scornful,",
                            "verse 32:16": "Who forsake their beds to cry unto their Lord in fear and hope, and spend of that We have bestowed on them.",
                            "verse 32:17": "No soul knoweth what is kept hid for them of joy, as a reward for what they used to do.",
                            "verse 32:18": "Is he who is a believer like unto him who is an evil-liver ? They are not alike.",
                            "verse 32:19": "But as for those who believe and do good works, for them are the Gardens of Retreat - a welcome (in reward) for what they used to do.",
                            "verse 32:20": "And as for those who do evil, their retreat is the Fire.",
                            "verse 32:21": "And verily We make them taste the lower punishment before the greater, that haply they may return.",
                            "verse 32:22": "And who doth greater wrong than he who is reminded of the revelations of his Lord, then turneth from them.",
                            "verse 32:23": "We verily gave Moses the Scripture; so be not ye in doubt of his receiving it; and We appointed it a guidance for the Children of Israel.",
                            "verse 32:24": "And when they became steadfast and believed firmly in Our revelations, We appointed from among them leaders who guided by Our command.",
                            "verse 32:25": "Lo! thy Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.",
                            "verse 32:26": "Is it not a guidance for them (to observe) how many generations We destroyed before them, amid whose dwelling places they do walk ? Lo! therein verily are portents! Will they not then heed ?",
                            "verse 32:27": "Have they not seen how We lead the water to the barren land and therewith bring forth crops whereof their cattle eat, and they themselves ? Will they not then see ?",
                            "verse 32:28": "And they say: When cometh this victory (of yours) if ye are truthful ?",
                            "verse 32:29": "Say (unto them): On the day of the victory the faith of those who disbelieve (and who then will believe) will not avail them, neither will they be reprieved.",
                            "verse 32:30": "So withdraw from them (O Muhammad), and await (the event)."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 32:1": "A.",
                            "verse 32:2": "(This is) the Revelation of the Book in which there is no doubt,- from the Lord of the Worlds.",
                            "verse 32:3": "Or do they say, \"He has forged it\"? Nay, it is the Truth from thy Lord, that thou mayest admonish a people to whom no warner has come before thee: in order that they may receive guidance.",
                            "verse 32:4": "It is God Who has created the heavens and the earth, and all between them, in six Days, and is firmly established on the Throne (of Authority): ye have none, besides Him, to protect or intercede (for you): will ye not then receive admonition?",
                            "verse 32:5": "He rules (all) affairs from the heavens to the earth: in the end will (all affairs) go up to Him, on a Day, the space whereof will be (as) a thousand years of your reckoning.",
                            "verse 32:6": "Such is He, the Knower of all things, hidden and open, the Exalted (in power), the Merciful;-",
                            "verse 32:7": "He Who has made everything which He has created most good: He began the creation of man with (nothing more than) clay,",
                            "verse 32:8": "And made his progeny from a quintessence of the nature of a fluid despised:",
                            "verse 32:9": "But He fashioned him in due proportion, and breathed into him something of His spirit.",
                            "verse 32:10": "And they say: \"What! when we lie, hidden and lost, in the earth, shall we indeed be in a Creation renewed? Nay, they deny the Meeting with their Lord.",
                            "verse 32:11": "Say: \"The Angel of Death, put in charge of you, will (duly) take your souls: then shall ye be brought back to your Lord.",
                            "verse 32:12": "If only thou couldst see when the guilty ones will bend low their heads before their Lord, (saying:) \"Our Lord! We have seen and we have heard: Now then send us back (to the world): we will work righteousness: for we do indeed (now) believe.",
                            "verse 32:13": "If We had so willed, We could certainly have brought every soul its true guidance: but the Word from Me will come true, \"I will fill Hell with Jinns and men all together.",
                            "verse 32:14": "\"Taste ye then - for ye forgot the Meeting of this Day of yours, and We too will forget you - taste ye the Penalty of Eternity for your (evil) deeds!\"",
                            "verse 32:15": "Only those believe in Our Signs, who, when they are recited to them, fall down in adoration, and celebrate the praises of their Lord, nor are they (ever) puffed up with pride.",
                            "verse 32:16": "Their limbs do forsake their beds of sleep, the while they call on their Lord, in Fear and Hope: and they spend (in charity) out of the sustenance which We have bestowed on them.",
                            "verse 32:17": "Now no person knows what delights of the eye are kept hidden (in reserve) for them - as a reward for their (good) deeds.",
                            "verse 32:18": "Is then the man who believes no better than the man who is rebellious and wicked? Not equal are they.",
                            "verse 32:19": "For those who believe and do righteous deeds are Gardens as hospitable homes, for their (good) deeds.",
                            "verse 32:20": "As to those who are rebellious and wicked, their abode will be the Fire: every time they wish to get away therefrom, they will be forced thereinto, and it will be said to them: \"Taste ye the Penalty of the Fire, the which ye were wont to reject as false.",
                            "verse 32:21": "And indeed We will make them taste of the Penalty of this (life) prior to the supreme Penalty, in order that they may (repent and) return.",
                            "verse 32:22": "And who does more wrong than one to whom are recited the Signs of his Lord, and who then turns away therefrom? Verily from those who transgress We shall exact (due) Retribution.",
                            "verse 32:23": "We did indeed aforetime give the Book to Moses: be not then in doubt of its reaching (thee): and We made it a guide to the Children of Israel.",
                            "verse 32:24": "And We appointed, from among them, leaders, giving guidance under Our command, so long as they persevered with patience and continued to have faith in Our Signs.",
                            "verse 32:25": "Verily thy Lord will judge between them on the Day of Judgment, in the matters wherein they differ (among themselves)",
                            "verse 32:26": "Does it not teach them a lesson, how many generations We destroyed before them, in whose dwellings they (now) go to and fro? Verily in that are Signs: Do they not then listen?",
                            "verse 32:27": "And do they not see that We do drive rain to parched soil (bare of herbage), and produce therewith crops, providing food for their cattle and themselves? Have they not the vision?",
                            "verse 32:28": "They say: \"When will this decision be, if ye are telling the truth?\"",
                            "verse 32:29": "Say: \"On the Day of Decision, no profit will it be to Unbelievers if they (then) believe! nor will they be granted a respite.",
                            "verse 32:30": "So turn away from them, and wait: they too are waiting."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 32:1": "Alif Lam Mim",
                            "verse 32:2": "The sending down of the Book, wherein no doubt is, from the Lord of all Being.",
                            "verse 32:3": "Or do they say, ’He has forged it’? Say: ’Not so; it is the truth from thy Lord that thou mayest warn a people to whom no warner came before thee, that haply so they may be guided.",
                            "verse 32:4": "God is He that created the heavens and the earth, and what between them is, in six days, then seated Himself upon the Throne.",
                            "verse 32:5": "He directs the affair from heaven to earth, then it goes up to Him in one day, whose measure is a thousand years of your counting.",
                            "verse 32:6": "He is the knower of the Unseen and the Visible, the All-mighty, the All-compassionate,",
                            "verse 32:7": "who has created all things well.",
                            "verse 32:8": "then He fashioned his progeny of an extraction of mean water,",
                            "verse 32:9": "then He shaped him, and breathed His spirit in him.",
                            "verse 32:10": "They say, ’What, when we have gone astray in the earth, shall we indeed be in a new creation?’ Nay, but they disbelieve in the encounter with their Lord.",
                            "verse 32:11": "Say: ’Death’s angel, who has been charged with you, shall gather you, then to your Lord you shall be returned.",
                            "verse 32:12": "Ah, if thou couldst see the guilty hanging their heads before their Lord! ’Our Lord, we have seen and heard; now return us, that we may do righteousness, for we have sure faith.",
                            "verse 32:13": "’If We had so willed, We could have given every soul its guidance; but now My Word is realized -- \" Assuredly I shall fill Gehenna with jinn and men all together.",
                            "verse 32:14": "So now taste, for that you forgot the encounter of this your day! We indeed have forgotten you.",
                            "verse 32:15": "Only those believe in Our signs who, when they are reminded of them, fall down prostrate and proclaim the praise of their Lord, not waxing proud.",
                            "verse 32:16": "Their sides shun their couches as they call on their Lord in fear and hope; and they expend of that We have provided them.",
                            "verse 32:17": "No soul knows what comfort is laid up for them secretly, as a recompense for that they were doing.",
                            "verse 32:18": "What? Is he who has been a believer like unto him who has been ungodly? They are not equal.",
                            "verse 32:19": "As for those who believe, and do deeds of righteousness, there await them the Gardens of the Refuge, in hospitality for that they were doing.",
                            "verse 32:20": "But as for the ungodly, their refuge shall be the Fire; as often as they desire to come forth from it, they shall be restored into it, and it shall be said to them, ’Taste the chastisement of the Fire, which you cried lies to.",
                            "verse 32:21": "And We shall surely let them taste the nearer chastisement, before the greater; haply so they will return.",
                            "verse 32:22": "And who does greater evil than he who is reminded of the signs of his Lord, then turns away from them? We shall take vengeance upon the sinners.",
                            "verse 32:23": "Indeed, We gave Moses the Book; so he not in doubt concerning the encounter with him; and We appointed it for a guidance to the Children of Israel.",
                            "verse 32:24": "And We appointed from among them leaders guiding by Our command, when they endured patiently, and had sure faith in Our signs.",
                            "verse 32:25": "Surely thy Lord will distinguish between them on the Resurrection Day, touching that whereon they were at variance.",
                            "verse 32:26": "Is it not a guidance to them, how many generations We destroyed before them in whose dwelling-places they walk? Surely in that are signs; what, will they not hear?",
                            "verse 32:27": "Have they not seen how We drive the water to the dry land and bring forth crops therewith whereof their cattle and themselves eat? What, will they not see?",
                            "verse 32:28": "They also say, ’When shall be this Victory, if you speak truly?’",
                            "verse 32:29": "Say: ’On the Day of Victory their faith shall not profit the unbelievers, nor shall they be respited.",
                            "verse 32:30": "So turn thou away from them, and wait; they too are waiting."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 32:1": "Alif.",
                            "verse 32:2": "THE BESTOWAL from on high of this divine writ issues, beyond any doubt, from the Sustainer of all the worlds:",
                            "verse 32:3": "and yet, they [who are bent on denying the truth] assert, \"",
                            "verse 32:4": "has invented it!\" Nay, but it is the truth from thy Sustainer, enabling thee to warn",
                            "verse 32:5": "people to whom no warner has come before thee, so that they might follow the right path.",
                            "verse 32:6": "IT IS GOD who has created the heavens and the earth and all that is between them in six aeons, and is established on the throne of His almightiness.",
                            "verse 32:7": "He governs all that exists, from the celestial space to the earth; and in the end all shall ascend unto Him [for judgment] on a Day the length whereof will be",
                            "verse 32:8": "a thousand years of your reckoning.",
                            "verse 32:9": "Such is He who knows all that is beyond the reach of a created being’s perception, as well as all that can be witnessed by a creature’s senses or mind: the Almighty, the Dispenser of Grace,",
                            "verse 32:10": "who makes most excellent everything that He creates.",
                            "verse 32:11": "then He causes him to be begotten out of the essence of a humble fluid;",
                            "verse 32:12": "and then He forms him in accordance with what he is meant to be, and breathes into him of His spirit: and [thus, O men,] He endows you with hearing, and sight, and feelings as well as minds:",
                            "verse 32:13": "how seldom are you grateful!",
                            "verse 32:14": "For [many are] they",
                            "verse 32:15": "say, \"What! After we have been [dead and] lost in the earth, shall we indeed be [restored to life] in a new act of creation?\" Nay, but [by saying this] they deny the truth that they are destined to meet their Sustainer!",
                            "verse 32:16": "Say: \"[One day,] the angel of death who has been given charge of you will gather you, and then unto your Sustainer you will be brought back.",
                            "verse 32:17": "If thou couldst but see [how it will be on Judgment Day,] when those who are lost in sin will hang their heads before their Sustainer,",
                            "verse 32:18": "\"O our Sustainer!",
                            "verse 32:19": "we have seen, and we have heard! Return us, then, [to our earthly life] that we may do good deeds: for ,",
                            "verse 32:20": "behold, we are certain [of the truth]!\"",
                            "verse 32:21": "Yet had We so willed, We could indeed have imposed Our guidance upon every human being: but [We have not willed it thus – and so] that word of Mine has come true: \"Most certainly will I fill hell with invisible beings as well as with humans, all together!\"",
                            "verse 32:22": "[And He will say unto the sinners:] \"Taste, then, [the recompense] for your having been oblivious of the coming of this your Day [of Judgment] – for, verily, We are",
                            "verse 32:23": "oblivious of you: taste, then,",
                            "verse 32:24": "abiding suffering for all [the evil] that you were wont to do!\"",
                            "verse 32:25": "ONLY THEY",
                            "verse 32:26": "believe in Our messages who, whenever they are conveyed to them, fall down, prostrating themselves in adoration, and extol their Sustainer’s limitless glory and praise; and who are never filled with false pride;",
                            "verse 32:27": "",
                            "verse 32:28": "who are impelled to rise from their beds [at night] to call out to their Sustainer in fear and hope; and who spend on others out of what We provide for them as sustenance.",
                            "verse 32:29": "And [as for all such believers,] no human being can imagine what blissful delights, as yet hidden, await them [in the life to come] as a reward for all that they did.",
                            "verse 32:30": "Is, then, he who [in his earthly life] was a believer to be compared with one who was iniquitous?",
                            "verse 32:31": "these two are not equal!",
                            "verse 32:32": "As for those who attain to faith and do righteous deeds – gardens of rest await them, as a welcome [from God], in result of what they did;",
                            "verse 32:33": "but as for those who are lost in iniquity – their goal is the fire: as oft as they will try to come out of it, they will be thrown back into it; and they will be told, \"Taste",
                            "verse 32:34": "this suffering through fire which you were wont to call a lie!\"",
                            "verse 32:35": "However, ere [We condemn them to] that supreme suffering, We shall most certainly let them taste of a suffering closer at hand, so that they might [repent and] mend their ways.",
                            "verse 32:36": "And who could be more wicked than he to whom his Sustainer’s messages are conveyed and who thereupon turns away from them? Verily, We shall inflict Our retribution on those who are",
                            "verse 32:37": "lost in sin!",
                            "verse 32:38": "AND, INDEED, [O Muhammad,] We did vouchsafe revelation unto Moses [as well]: so be not in doubt of",
                            "verse 32:39": "having met with the same [truth in the revelation vouchsafed to thee].",
                            "verse 32:40": "and",
                            "verse 32:41": "We raised among them leaders who, so long as they bore themselves with patience and had sure faith in Our messages, guided [their people] in accordance with Our behest – [so, too, shall it be with the divine writ revealed unto thee, O Muhammad.",
                            "verse 32:42": "VERILY, it is your Sustainer alone who will decide between men on Resurrection Day with regard to all on which they were wont to differ.",
                            "verse 32:43": "",
                            "verse 32:44": "can, then, they [who deny the truth] learn no lesson by recalling how many a generation We have destroyed before their time, –",
                            "verse 32:45": "in whose dwelling-places they [themselves now] walk about? In this, behold, there are messages indeed: will they not, then, listen?",
                            "verse 32:46": "Are they not aware that it is We who drive the rain onto dry land devoid of herbage, and thereby bring forth herbage of which their cattle and they themselves do eat? Can they not, then, see [the truth of resurrection]?",
                            "verse 32:47": "But they answer: \"When will that final decision take place, if what you",
                            "verse 32:48": "say is true?\"",
                            "verse 32:49": "Say: \"On the Day of the Final Decision, their",
                            "verse 32:50": "faith will be of no use to those who [in their lifetime] were bent on denying the truth, nor will they be granted respite!\" –",
                            "verse 32:51": "and then leave them alone, and wait [for the truth to unfold as] they, behold, are waiting."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 32:1": "Their sides shrink away form their beds, and they call upon their Lord in fear and in longing.",
                            "verse 32:2": "sides shrink away from beds.",
                            "verse 32:3": "turn aside from their beds to invoke their Lord in fear and longing, and of what We have given them they give.",
                            "verse 32:4": "And no soul knoweth the hidden bliss that lieth in store for them as meed for that which they were wont to do.",
                            "verse 32:5": "soul knoweth what is secretly stored up for them of coolness of the eyes in reward for what they were wont to do.",
                            "verse 32:6": "Sources",
                            "verse 32:7": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 32:8": "The Book of Certainty (1952) •",
                            "verse 32:9": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 32:10": "What is Sufism (1975) •",
                            "verse 32:11": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 32:12": "Muhammad (1983) •",
                            "verse 32:13": "Symbol and Archetype (1991) •",
                            "verse 32:14": "Sufi Poems (2004) •",
                            "verse 32:15": "Mecca (2004) •",
                            "verse 32:16": "Return to the Spirit (2005) •",
                            "verse 32:17": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 32:18": "“Proofs of Islam”(1954).",
                            "verse 32:19": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 32:20": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 32:21": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 32:22": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 32:23": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 32:24": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 32:25": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 32:26": "“The Quranic Origins of Sufism” •",
                            "verse 32:27": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 32:28": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 32:29": "“An Introduction to Islam” •",
                            "verse 32:30": "“The Universality of the Quran” •",
                            "verse 32:31": "Private Talks Books",
                            "verse 32:32": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 32:1": "Alif Lām Mīm.",
                            "verse 32:2": "(This) revelation of the Book - in which there is no doubt - is from the Lord of the worlds.",
                            "verse 32:3": "Is it that they say, “He has fabricated it.",
                            "verse 32:4": "Allah is the One who created the heavens and the earth and all that is between them in six days, then He positioned Himself on the Throne.",
                            "verse 32:5": "He manages (every) matter from the sky to the earth, then it (every matter) will ascend to Him in a day the measure of which is one thousand years according to the way you count.",
                            "verse 32:6": "That One is the All-knower of the Unseen and the seen, the All-Mighty, the Very-Merciful,",
                            "verse 32:7": "who made well whatever He created, and started the creation of man from clay.",
                            "verse 32:8": "Then He made his progeny from a drop of semen, from despised water.",
                            "verse 32:9": "Then He gave him a proportioned shape, and breathed into him of His spirit.",
                            "verse 32:10": "And they said, “Is it that when we disappear in the earth-is it that we really come into a new creation?” Rather they are ones who deny the meeting with their Lord.",
                            "verse 32:11": "Say, “The angel of death who has been assigned for you will take your soul in full, then you will be brought back to your Lord.",
                            "verse 32:12": "And (you will wonder) if you see the sinners hanging their heads before their Lord (and saying,) “Our Lord, we have now seen and heard, so send us back, and we will do righteous deeds.",
                            "verse 32:13": "And if We had so willed, We would have led everybody to his right path (by force), but the word from Me had come to pass: “I will certainly fill the Jahannam with jinn and human beings together.",
                            "verse 32:14": "So, have a taste, because you had forgotten the meeting of this day of yours.",
                            "verse 32:15": "Only those people believe in Our verses who, when they are reminded of them, fall in prostration and pronounce the purity and praise of their Lord, and who do not wax proud.",
                            "verse 32:16": "Their sides remain apart from their beds.",
                            "verse 32:17": "So, no one knows the delight of eyes that has been reserved for them in secret, as a reward of what they used to do.",
                            "verse 32:18": "So, can one who is a believer become like one who is a sinner? They cannot become equal.",
                            "verse 32:19": "As for those who believe and do righteous deeds, for them there are gardens to dwell, as an honorable hospitality for what they used to do.",
                            "verse 32:20": "And the ones who disobeyed, their abode is the Fire.",
                            "verse 32:21": "And We will certainly make them taste the nearer punishment before the greater punishment, so that they may return.",
                            "verse 32:22": "And who is more unjust than the one who was reminded of the verses of his Lord, then he turned away from them.",
                            "verse 32:23": "It is a fact that We gave the Book to Mūsā.",
                            "verse 32:24": "And We appointed leaders from among them who guided (people) under Our command, when they observed patience, and kept firm belief in Our verses.",
                            "verse 32:25": "Surely, your Lord will judge between them on the Day of Judgment in what they used to differ.",
                            "verse 32:26": "Has it not been a source of guidance for them as to how many generations We have destroyed before them who used to walk in their dwellings? Surely in this there are signs.",
                            "verse 32:27": "Have they not seen that We drive water to the dry land, then We bring forth crops thereby from which their cattle and they themselves have food? So, do they not perceive?",
                            "verse 32:28": "And they say, “When will this decision take place if you are truthful (in your claim)?”",
                            "verse 32:29": "Say, “On the day of decision their belief will not be of any use to disbelievers, nor shall they be given any respite.",
                            "verse 32:30": "So, just ignore them (O prophet,) and wait."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 32:1": "Alif lām mīm.",
                            "verse 32:2": "The revelation of the Book, whereof there is no doubt from the Lord of the Worlds.",
                            "verse 32:3": "Or do they say: ‘He has invented it’? Nay, but it is the truth from your Lord, that you may warn a people to whom no warner came before you that perhaps they may find",
                            "verse 32:4": "guidance.",
                            "verse 32:5": "God is He Who created the heavens and the earth and whatever is between them in six days, then He presided upon the Throne.",
                            "verse 32:6": "He directs the command from the heaven to the earth, then it ascends to Him in a day whose measure is a thousand years by your reckoning.",
                            "verse 32:7": "That is the Knower of the Unseen and the visible, the Mighty, the Merciful,",
                            "verse 32:8": "Who perfected everything that He created.",
                            "verse 32:9": "then He made his progeny from an extract of a base fluid,",
                            "verse 32:10": "then He proportioned him, and breathed into him of His spirit.",
                            "verse 32:11": "And they say: ‘When we are lost beneath the earth, shall we be indeed created anew?’ Nay, but they disbelieve in the encounter with their Lord.",
                            "verse 32:12": "Say: ‘The Angel of death, who has been charged with you, shall receive you [in death], then to your Lord you shall be returned’.",
                            "verse 32:13": "And if could you but see the guilty hanging their heads",
                            "verse 32:14": "before their Lord: ‘Our Lord! We have seen and heard.",
                            "verse 32:15": "‘And had We",
                            "verse 32:16": "willed, We could have given every soul its [means to] guidance, but My Word became due: “Verily I shall fill Hell with jinn and mankind together”.",
                            "verse 32:17": "So taste ,",
                            "verse 32:18": "for your having forgotten the encounter of this day of yours.",
                            "verse 32:19": "shall forget you.",
                            "verse 32:20": "the everlasting chastisement for what you used to practise’.",
                            "verse 32:21": "Only those believe in Our signs, who, when they are reminded of them, fall down in prostration and make glorifications in praise of their Lord, and they do not disdain.",
                            "verse 32:22": "Their sides withdraw from their lying places to supplicate to their Lord in fear and in hope, and they expend of what We have provided them.",
                            "verse 32:23": "For no soul knows what has been kept hidden for them in the way of joyous sights as a reward for what they used to do.",
                            "verse 32:24": "Is he who is a believer like him who is a transgressor? They are not equal.",
                            "verse 32:25": "As for those who believe and perform righteous deeds, for them shall be the Gardens of the Abode — a hospitality for what they used to do.",
                            "verse 32:26": "But as for those who transgressed, their abode shall be the Fire.",
                            "verse 32:27": "And We shall surely make them taste the nearer chastisement before the greater chastisement that perhaps they may return.",
                            "verse 32:28": "And who does greater wrong than he who is reminded of the signs of his Lord, but then turns away from them? Assuredly We shall take vengeance upon the criminals.",
                            "verse 32:29": "And verily We gave Moses the Scripture; so do not be in doubt concerning the encounter with Him; and We appointed him a guidance for the Children of Israel.",
                            "verse 32:30": "And We appointed among them leaders who guided by Our command, when they had endured",
                            "verse 32:31": "and had conviction in Our signs.",
                            "verse 32:32": "Surely your Lord will judge between them on the Day of Resurrection concerning that wherein they used to differ.",
                            "verse 32:33": "Or is it not an indication for them how many generations We destroyed before them amid whose dwellings they walk? Surely in that there are signs.",
                            "verse 32:34": "Or have they not seen how We drive the water to barren land and therewith bring forth crops whereof their cattle and",
                            "verse 32:35": "themselves eat? Can they not see?",
                            "verse 32:36": "And they say: ‘When will this",
                            "verse 32:37": "Judgement be, if you are truthful?’",
                            "verse 32:38": "Say: ‘On the day of",
                            "verse 32:39": "Judgement, their [newly found] faith",
                            "verse 32:40": "shall not benefit those who had been disbelievers, nor shall they be given respite.",
                            "verse 32:41": "So turn away from them and wait."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 32:1": "Alif, Lam, Mim.",
                            "verse 32:2": "There is not even an iota of doubt in it that sending down of this Book is from the Lord of all the worlds.",
                            "verse 32:3": "Do the disbelievers and the polytheists say: ‘He (the Holy Prophet) has fabricated it’? Nay, it is the truth from your Lord so that you may warn those to whom no Warner has come before you that they may receive guidance.",
                            "verse 32:4": "Allah is He Who created the heavens and the earth and whatever is between them in six days (i.",
                            "verse 32:5": "He plans and executes the command and control system from the heavens to the earth.",
                            "verse 32:6": "He is the One Who knows the invisible and the visible, Almighty and Ever-Merciful.",
                            "verse 32:7": "He is the One Who endowed everything He created with perfection and virtue.",
                            "verse 32:8": "Then He reared his lineage from the extract of a worthless fluid (a sperm drop);",
                            "verse 32:9": "Then He perfected (organs and limbs in) him and breathed into him of His spirit (i.",
                            "verse 32:10": "And the disbelievers say: ‘When we are lost in the earth, shall we then be created anew?’ In fact, they deny the meeting with their Lord.",
                            "verse 32:11": "Say: ‘The angel of death, that is appointed over you, will terminate your life.",
                            "verse 32:12": "And (you will wonder at them) if you see the sinners hanging down their heads before the presence of their Lord (and saying:) ‘O our Lord, we have seen and heard, so send us back (to the world now) so that we do pious deeds.",
                            "verse 32:13": "And had We intended, We would have given guidance to every soul (Ourselves), but this command from Me has been confirmed: I will certainly fill Hell with all the (disbelieving) jinn and mankind.",
                            "verse 32:14": "So (now) savour the taste that you had forgotten your meeting of this Day.",
                            "verse 32:15": "So only those who believe in Our Revelations, when directed and guided by means of these (Verses), fall down prostrating themselves and glorify their Lord with praise.",
                            "verse 32:16": "Their sides stay away from their beds and they call out to their Lord in a (mingled state) of fear and hope and spend (in Our way) out of the sustenance We have provided them.",
                            "verse 32:17": "So no one knows what coolness of eyes is kept hidden for them.",
                            "verse 32:18": "How can a person who is a believer be like him who is disobedient? (Nay,) they (both) cannot be equal.",
                            "verse 32:19": "So those who believe and keep doing good deeds, for them are Gardens of eternal repose as an entertainment and honour (from their Lord) in reward for those (works) which they used to do.",
                            "verse 32:20": "But as for those who disobeyed, their abode is Hell.",
                            "verse 32:21": "And surely, before the major torment (of the Hereafter), We shall make them savour the (taste of) nearby torment (in this world) so that they abstain (from disbelief).",
                            "verse 32:22": "And who is a greater wrongdoer than someone who is admonished by means of Revelations of His Lord, and then he turns away from them? Surely, We take revenge on the evildoers.",
                            "verse 32:23": "And verily, We gave Musa (Moses) the Book (Torah).",
                            "verse 32:24": "And We made from amongst them authorities and leaders who kept disseminating guidance by Our command when they persevered with patience and believed in Our Revelations with certitude.",
                            "verse 32:25": "Surely, your Lord alone will judge between them on the Day of Resurrection concerning matters in which they used to disagree.",
                            "verse 32:26": "And have they not taken any guidance (from this proclamation) that how many generations We have destroyed before them in whose dwellings these people (now) move about? Surely, there are signs in it.",
                            "verse 32:27": "And have they not seen that We stream water towards the dry land, then with that We produce crops of which their cattle as well as they themselves eat? Do they not observe?",
                            "verse 32:28": "And they say: ‘When will this (Day of) Judgment take place if you are truthful?’",
                            "verse 32:29": "Say: ‘On the Day of Judgment, the belief of disbelievers will bring them no benefit, nor will they be given any respite.",
                            "verse 32:30": "So turn your face away from them and wait and they (too) are waiting."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Aliif, Laam, Miim.",
                            "verse 32:2": "Tämän Kirjan on ylhäältä lähettänyt maailmojen Herra, siitä ei ole epäilystä.",
                            "verse 32:3": "Sanovatko he, että olet sen keksinyt? Ei, se on Herraltasi tullut totuus, jotta voisit varoittaa ihmisiä, joiden luokse ennen sinua ei ole saapunut varoittajaa, ja jotta he saisivat johdatuksen.",
                            "verse 32:4": "Juuri Jumala on luonut taivaat ja maan ja kaiken niiden välillä olevan kuudessa päivässä ja on yhä säilyttänyt lujan mahtinsa.",
                            "verse 32:5": "Hän lähettää käskynsä ylhäältä avaruudesta maan päälle; sitten se kohoaa Hänen luokseen yhdessä päivässä, joka teidän laskujenne mukaan on tuhannen vuoden pituinen.",
                            "verse 32:6": "Sellainen on Hän, joka tuntee sekä salatut että ilmeiset asiat, Hän on kaikkivaltias, kaikkein armollisin.",
                            "verse 32:7": "Kaiken Hän on tehnyt parhaimmalla tavalla ja aloittanut luomalla ihmisen kosteasta savesta.",
                            "verse 32:8": "Sitten Hän loi hänen siemenensä mitättömän näköisestä nesteestä.",
                            "verse 32:9": "Senjälkeen Hän täydensi hänet ja puhalsi häneen henkensä, ja Hän on antanut teille kuulon ja näön sekä sielun.",
                            "verse 32:10": "He kyselevät: »Kuinka, senkö jälkeen kuin me maadumme tomuksi, meidät herätetään taas uuteen eloon?» Niin, he kieltävät Herransa tulemisen.",
                            "verse 32:11": "Sano: »Kuoleman enkeli, joka teitä kaitsee, on maksava teille täyden palkkanne; sitten teidän on palattava Jumalan luokse.",
                            "verse 32:12": "Jospa voisit nähdä, miten syntiset seisovat Herransa edessä päät vaipuneina ja sanovat: »Oi Herra, me olemme nähneet sekä kuulleet, lähetä meidät siis takaisin, jotta voisimme tehdä hyvää, sillä totisesti, olemme päässeet varmuuteen.",
                            "verse 32:13": "Jos Me olisimme tahtonut, olisimme totisesti voinut antaa jokaiselle sielulle johdatuksensa, mutta sanani on käyvä toteen: »Totisesti, olen täyttävä helvetin dzinneillä ja ihmisillä sekaisin.",
                            "verse 32:14": "»Maistakaa siis seurauksia, koska unohdatte tämän päivän saapumisen.",
                            "verse 32:15": "Vain ne uskovat merkkeihimme, jotka lankeavat maahan kunnioittaen, kun heitä niistä muistutetaan, ja julistavat Herransa kunniaa Häntä ylistäen, sekä ne, jotka eivät paisu ylpeydestä.",
                            "verse 32:16": "He nousevat vuoteistaan rukoillen Herraansa peläten ja toivoen, ja he antavat almuja siitä, mitä Me olemme heille suonut.",
                            "verse 32:17": "Mutta yksikään sielu ei tiedä, mitä heille on tallessa sellaista, mikä on kirkastava heidän silmänsä, palkkana siitä, mitä ovat tehneet.",
                            "verse 32:18": "Onko uskovainen sellaisen kaltainen, joka on tottelematon? He eivät voi olla samanvertaisia.",
                            "verse 32:19": "Niitä varten, jotka uskovat ja suorittavat hyviä tekoja, on ikuiset puutarhat palkkana siitä, mitä ovat tehneet.",
                            "verse 32:20": "Mutta jotka ovat olleet tottelemattomia, niiden asuinsijana on oleva tuli.",
                            "verse 32:21": "Totisesti, Me annamme heidän ennen tulevaa, ankaraa tuomiota maistaa lievempää rangaistusta, jotta he kääntyisivät hyvään.",
                            "verse 32:22": "Kuka onkaan väärämielisempi kuin se, joka saadessaan muistutuksen Herransa merkeistä kääntää niille selkänsä? Totisesti, kirouksemme kohtaa syntisiä.",
                            "verse 32:23": "Totisesti, Me annoimme Kirjan Moosekselle - älä epäile sitä! - ja annoimme sen johdatukseksi Israelin lapsille.",
                            "verse 32:24": "Me määräsimme heidän joukostaan myös johtajia, jotka johdattivat kansaa Meidän käskymme mukaan niin kauan kuin he siitä kiinni pitivät ja olivat varmoja merkeistämme.",
                            "verse 32:25": "Totisesti, Hän, sinun Herrasi, on ylösnousemuksen päivänä tuomiollaan ratkaiseva heidän välillään olleet kiistat.",
                            "verse 32:26": "Eivätkö he näe johdatusta siinä, että ennen heitä olemme tuhonnut monia sukupolvia, joiden asuinsijoilla he nyt kuljeskelevat? Totisesti, tässä on merkkejä.",
                            "verse 32:27": "Eivätkö he havaitse, miten Me langetamme sateen kuivuneeseen maahan ja sen avulla kasvatamme viljaa, jota he itse sekä heidän karjansa syövät? Eivätkö he mitään näe?",
                            "verse 32:28": "Ja he sanovat: »Milloin tämä ratkaisu tapahtuu, jos kerran puhutte totta?»",
                            "verse 32:29": "Vastaa: »Tuomion päivänä, jolloin usko ei vähääkään hyödytä niitä, jotka nyt ovat uskottomia, eikä heille anneta armon aikaa.",
                            "verse 32:30": "Käänny siis pois heistä ja odota! Totisesti, he saavat odottaa sinun lainasi."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 32:1": "Alif.",
                            "verse 32:2": "La Révélation du Livre, sans le moindre doute, émane du Seigneur des mondes.",
                            "verse 32:3": "Diront-ils : \" Il l'a forgé \" ? Que non ! Il est la Vérité venue de ton Seigneur pour que tu avertisses un peuple auquel nul avertisseur n'est venu avant toi.",
                            "verse 32:4": "Dieu est Celui qui a créé en six jours les cieux, la terre et ce qui se trouve entre les deux ; puis Il s'est assis en majesté sur le Trône.",
                            "verse 32:5": "Du ciel, Il ordonnance les choses de la terre, puis Il fait tout remonter vers Lui en un Jour dont la durée est de mille ans selon votre comput.",
                            "verse 32:6": "Tel est Celui qui connaît le caché et l'apparent, l'Omnipotent, le Clément,",
                            "verse 32:7": "Celui qui a rendu belle toute chose qu'Il a créée et qui a commencé la création de l'homme à partir de l'argile ;",
                            "verse 32:8": "Il a ensuite produit sa descendance à partir de la quintessence d'un vil liquide ;",
                            "verse 32:9": "puis Il l'a formé harmonieusement et Il a insufflé en lui de Son Esprit.",
                            "verse 32:10": "Ils disent : \" Lorsque nous aurons été dissous dans la terre, connaîtrons-nous une nouvelle création ? \" De fait, ils ne croient pas à la rencontre de leur Seigneur.",
                            "verse 32:11": "Dis : \" L'Ange de la mort à qui votre garde a été confiée vous recueillera ; puis vous serez ramenés vers votre Seigneur \".",
                            "verse 32:12": "Si tu pouvais alors voir les coupables courber la tête devant leur Seigneur [et s'écrier] : \" Notre Seigneur ! Nous avons vu et nous avons entendu.",
                            "verse 32:13": "Si Nous l'avions voulu, Nous aurions donné à chaque être humain sa direction.",
                            "verse 32:14": "Goûtez donc, pour l'avoir oubliée, la rencontre de votre jour que voici.",
                            "verse 32:15": "Seuls croient en Nos signes ceux qui, lorsqu'on les leur rappelle, tombent prosternés et exaltent les louanges de leur Seigneur ; ils ne sont pas orgueilleux.",
                            "verse 32:16": "Ils abandonnent leurs couches pour aller implorer leur Seigneur avec crainte et ardente nostalgie, et ils dépensent en aumônes une partie de ce que Nous leur avons dispensé.",
                            "verse 32:17": "Nul ne sait quelle joie leur est réservée pour prix de leurs œuvres.",
                            "verse 32:18": "Le croyant serait-il semblable au pervers ? Non, ils ne s'équivalent pas !",
                            "verse 32:19": "Ceux qui croient et qui accomplissent des œuvres pies auront les Jardins du refuge comme lieu de séjour pour prix de leurs œuvres.",
                            "verse 32:20": "Quant aux pervers, leur refuge sera le Feu.",
                            "verse 32:21": "Certes, Nous leur ferons",
                            "verse 32:22": "goûter le châtiment d'ici-bas, et non pas le grand châtiment, afin que peut-être ils s'amendent.",
                            "verse 32:23": "Qui donc est plus inique que celui qui se détourne des signes de son Seigneur après qu'ils lui ont été rappelés ? Certes, Nous Nous vengerons des coupables.",
                            "verse 32:24": "Nous avons donné le Livre à Moïse - ne doute pas de sa rencontre ! -, et Nous en avons fait une guidance pour les fils d'Israël.",
                            "verse 32:25": "Nous avons suscité parmi eux des chefs qui les ont dirigés sur Notre ordre quand ils étaient patients et croyaient fermement à Nos signes.",
                            "verse 32:26": "Certes, Ton Seigneur jugera entre eux au Jour de la Résurrection et tranchera leurs différends.",
                            "verse 32:27": "Ne trouvent-ils pas une indication en voyant combien, avant eux, Nous avons anéanti de générations dans les demeures desquelles ils se promènent aujourd'hui ? Il y a vraiment là des signes.",
                            "verse 32:28": "N'ont-ils pas vu que Nous conduisons l'eau vers un sol aride et que, par elle, Nous faisons sortir des bonnes plantes dont leurs troupeaux et eux-mêmes se nourrissent ? Ne voient-ils pas clair ?",
                            "verse 32:29": "Ils disent : \" Quand donc viendra cette victoire, si vous êtes véridiques ? \"",
                            "verse 32:30": "Dis : \" Le jour de la victoire, la foi de ceux qui auront mécru leur sera inutile et ils n'auront rien à attendre \".",
                            "verse 32:31": "Alors, écarte-toi d'eux et attends ! Eux aussi sont en attente."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 32:1": "Alif, Lam, Mim .",
                            "verse 32:2": "La Révélation du Livres, nul doute là-dessus, émane du Seigneur de l’univers.",
                            "verse 32:3": "Diront-ils qu’il (Muhammad) l’a inventé ? Ceci est, au contraire, la vérité venant de ton Seigneur pour que tu avertisses un peuple à qui nul avertisseur avant toi n’est venu, afin qu’ils se guident.",
                            "verse 32:4": "Dieu qui a créé en six jours les cieux et la terre, et ce qui est entre eux.",
                            "verse 32:5": "Du ciel à la terre, Il administre l’affaire, laquelle ensuite monte vers Lui en un jour équivalant à mille ans de votre calcul.",
                            "verse 32:6": "C’est Lui le Connaisseur [des mondes] inconnus et visibles, le Puissant, le Miséricordieux,",
                            "verse 32:7": "qui a bien fait tout ce qu’Il a créé.",
                            "verse 32:8": "puis Il tira sa descendance d’une goutte d’eau vile [le sperme];",
                            "verse 32:9": "puis Il lui donna sa forme parfaite et lui insuffla de Son Esprit .",
                            "verse 32:10": "Et ils disent : «Quand nous serons perdus dans la terre [sous forme de poussière], redeviendrons-nous une création nouvelle ? » En outre, ils ne croient pas en la rencontre avec leur Seigneur.",
                            "verse 32:11": "Dis : «L’Ange de la mort qui est chargé de vous, vous fera mourir.",
                            "verse 32:12": "Si tu voyais alors les criminels ,",
                            "verse 32:13": "têtes basses devant leur Seigneur ! «Notre Seigneur, Nous avons vu et entendu, renvoie-nous donc afin que nous puissions faire du bien; nous croyons (maintenant) avec certitude».",
                            "verse 32:14": "«Si Nous voulions, Nous apporterions à chaque âme sa guidée.",
                            "verse 32:15": "«Goûtez donc ! Pour avoir oublié la rencontre de votre jour que voici.",
                            "verse 32:16": "Seuls croient en Nos versets ceux qui, lorsqu’on les leur rappelle, tombent prosternés et, par des louanges à leur Seigneur, célèbrent Sa gloire et ne s’enflent pas d’orgueil .",
                            "verse 32:17": "Ils s’arrachent de leurs lits pour invoquer leur Seigneur, par crainte et espoir; et ils font largesse de ce que Nous Leur attribuons.",
                            "verse 32:18": "Aucun être ne sait ce qu’on a réservé pour eux comme réjouissance pour les yeux, en récompense de ce qu’ils oeuvraient !",
                            "verse 32:19": "Celui qui est croyant est-il comparable au pervers ? (Non), ils ne sont point égaux.",
                            "verse 32:20": "Ceux qui croient et accomplissent les bonnes oeuvres, auront leur résidence dans les Jardins du Refuge, en récompense de ce qu’ils oeuvraient .",
                            "verse 32:21": "Et quant à ceux qui auront été pervers, leur refuge sera le Feu : toutes les fois qu’ils voudront en sortir, ils y seront ramenés, et on leur dira : «Goûtez au châtiment du Feu auquel vous refusiez de croire».",
                            "verse 32:22": "Nous leur ferons certainement goûter au châtiment ici-bas, avant le grand châtiment afin qu’ils retournent (vers le chemin droit) !",
                            "verse 32:23": "Qui est plus injuste que celui à qui les versets de Dieu sont rappelés et qui ensuite s’en détourne ? Nous nous vengerons certes des criminels.",
                            "verse 32:24": "Nous avons effectivement donné à Moïse le Livre - ne sois donc pas en doute sur ta rencontre avec lui -, et l’avons assigné comme guide aux Enfants d’Israël.",
                            "verse 32:25": "Et Nous avons désigné parmi eux des dirigeants qui guidaient (les gens) par Notre ordre aussi longtemps qu’ils enduraient et croyaient fermement en Nos versets.",
                            "verse 32:26": "Ton Seigneur, c’est Lui qui décidera entre eux, au Jour de la Résurrection, de ce sur quoi ils divergeaient.",
                            "verse 32:27": "N’est-ce pas pour eux une indication le fait qu’avant eux, Nous ayons fait périr tant de générations dans les maisons desquelles ils marchent ? Il y a en cela des preuves ! N’écouteront-ils donc pas ?",
                            "verse 32:28": "N’ont-ils pas vu que Nous poussons l’eau vers un sol aride, qu’ensuite Nous en faisons sortir une culture que consomment leurs bestiaux et eux-mêmes ? Ne voient-ils donc pas ?",
                            "verse 32:29": "Et ils disent : «A quand cette victoire, si vous êtes véridiques» ?",
                            "verse 32:30": "Dis : «Le jour de la Victoire, , il sera inutile aux infidèles de croire ! Et aucun délai ne leur sera donné».",
                            "verse 32:31": "éloigne-toi d’eux et attends."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Alif Lám Mím.",
                            "verse 32:2": "Die Offenbarung des Buches ist vom Herrn der Welten, daran ist kein Zweifel.",
                            "verse 32:3": "Sagen sie: «Er hat es erdichtet»? Nein, es ist die Wahrheit von deinem Herrn, auf daß du ein Volk warnen mögest, zu dem vor dir kein Warner gekommen ist, damit sie dem rechten Weg folgen mögen.",
                            "verse 32:4": "Allah ist es, Der die Himmel und die Erde und alles, was zwischen den beiden ist, in sechs Zeiten schuf; dann setzte Er Sich auf den Thron.",
                            "verse 32:5": "Er wird den Ratschluß vom Himmel zur Erde lenken, dann wird er wieder zu Ihm emporsteigen in einem Tage, dessen Länge tausend Jahre ist nach eurer Zeitrechnung.",
                            "verse 32:6": "Das ist der Kenner des Verborgenen und des Sichtbaren, der Allmächtige, der Barmherzige,",
                            "verse 32:7": "Der alles vollkommen gemacht hat, was Er schuf.",
                            "verse 32:8": "Dann bildete Er seine Nachkommenschaft aus dem Auszug einer verächtlichen Flüssigkeit.",
                            "verse 32:9": "Dann formte Er ihn und hauchte ihm von Seinem Geiste ein.",
                            "verse 32:10": "Und sie sprechen: «Wie! wenn wir in der Erde verloren sind, sollen wir dann in neuer Schöpfung sein?» Nein, vielmehr glauben sie an die Begegnung mit ihrem Herrn nicht.",
                            "verse 32:11": "Sprich: «Der Engel des Todes, der über euch eingesetzt ward, wird eure Seelen hinnehmen; zu eurem Herrn dann werdet ihr zurückgebracht.",
                            "verse 32:12": "Könntest du nur sehen, wie die Schuldigen ihre Köpfe hängen lassen werden vor ihrem Herrn: «Unser Herr, nun haben wir gesehen und gehört, so sende uns zurück, daß wir Gutes tun; denn nun sind wir gewiß.",
                            "verse 32:13": "Und hätten Wir gewollt, Wir hätten jedem seinen Weg zeigen können; jedoch Mein Wort ist wahr geworden: «Füllen will Ich die Hölle mit Dschinn und Menschen allzumal.",
                            "verse 32:14": "So kostet (die Strafe), denn ihr vergaßt das Eintreffen dieses eures Tages.",
                            "verse 32:15": "Nur jene glauben an Unsere Zeichen, die, wenn sie an sie gemahnt werden, anbetend niederfallen und das Lob ihres Herrn verkünden; und sie sind nicht hochmütig.",
                            "verse 32:16": "Ihre Seiten halten sich fern von (ihren) Betten; sie rufen ihren Herrn an in Furcht und Hoffnung und spenden von dem, was Wir ihnen gegeben haben.",
                            "verse 32:17": "Doch niemand weiß, was für Augenweide für sie verborgen ist als Lohn für ihre Taten.",
                            "verse 32:18": "Ist wohl jener, der gläubig ist, dem gleich, der ungehorsam ist? Sie sind nicht gleichen Rangs.",
                            "verse 32:19": "Jene, die glauben und gute Werke tun, sie werden Gärten der Heimstatt haben als eine Ergötzung für das, was sie getan.",
                            "verse 32:20": "Jene aber, die ungehorsam sind - ihre Wohnstatt wird das Feuer sein.",
                            "verse 32:21": "Wahrlich, Wir werden sie von der näheren Strafe (hienieden) kosten lassen vor der größeren Strafe, ob sie sich vielleicht doch noch bekehren.",
                            "verse 32:22": "Und wer verübt ärgeren Frevel als jener, der an die Zeichen seines Herrn gemahnt wird und sich dann doch davon abwendet? Wahrlich, Wir werden die Sünder stren bestrafen.",
                            "verse 32:23": "Ganz gewiß gaben Wir Moses das Buch - sei darum nicht im Zweifel darüber, daß auch du es bekommst -, und Wir machten es Zu einer Führung für die Kinder Israels.",
                            "verse 32:24": "Und Wir erweckten Führer aus ihrer Mitte, die (das Volk) leiteten nach Unserem Gebot, weil sie standhaft waren und fest an Unsere Zeichen glaubten.",
                            "verse 32:25": "Wahrlich, dein Herr wird richten zwischen ihnen am Tage der Auferstehung über das, worin sie uneinig sind.",
                            "verse 32:26": "Ist ihnen nicht klar, wie so manches Geschlecht Wir schon vor ihnen vernichtet haben, in deren Wohnstätten sie nun wandeln? Hierin sind wahrlich Zeichen.",
                            "verse 32:27": "Haben sie nicht gesehen, daß Wir das Wasser treiben auf das dürre Land und dadurch Gewächs hervorbringen, an dem ihr Vieh sich labt und sie selber auch? Wollen sie also nicht sehen?",
                            "verse 32:28": "Und sie sprechen: «Wann wird diese Entscheidung (stattfinden), wenn ihr die Wahrheit redet?»",
                            "verse 32:29": "Sprich: «Am Tage der Entscheidung soll den Ungläubigen ihr Glaube nichts nützen, noch sollen sie Aufschub erlangen.",
                            "verse 32:30": "So wende dich denn ab von ihnen und warte; auch sie warten."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "vfyQ+ yke ehe",
                            "verse 32:2": "bles dqN ’kd ugha fd fdrkc d+qjku dk ukft+y djuk lkjs tgk¡ ds ijojfnxkj dh rjQ ls gS",
                            "verse 32:3": "D;k ;s yksx ¼;s dgrs gSa fd bldks bl ’k[+l ¼jlwy½ us viuh th ls x<+ fy;k gS ugha ;s fcYdqy rqEgkjs ijojfnxkj dh rjQ ls cjgd+ gS rkfd rqe mu yksxksa dks ¼[k+qnk ds vt+kc ls½ Mjkvks ftuds ikl rqels igys dksbZ Mjkus okyk vk;k gh ugha rkfd ;s yksx jkg ij vk,¡",
                            "verse 32:4": "[+k+qnk gh rks gS ftlus lkjs vkleku vkSj t+ehu vkSj ftruh pht+s bu nksuks ds njfE;ku gSa Ng% fnu esa iSnk dh fQj v’kZ ¼ds cukus½ ij vkeknk gqvk mlds flok u dksbZ rqEgkjk ljijLr gS u dksbZ flQkfj’kh rks D;k rqe ¼blls Hkh½ ulhgr o bcjr gkfly ugha djrs",
                            "verse 32:5": "vkleku ls t+ehu rd ds gj vez dk ogh eqn~Cfcj ¼o eqUrft+e½ gS fQj ;s cUnkscLr ml fnu ftl dh fed+nkj rqEgkjs ’kqekj ls gt+kj cjl ls gksxh mlh dh ckjxkg esa is’k gksxk",
                            "verse 32:6": "ogh ¼eqnfCcj½ iks’khnk vkSj t+kfgj dk tkuus okyk ¼lc ij½ x+kfyc esgjcku gS",
                            "verse 32:7": "og ¼d+kfnj½ ftlus tks pht+ cukbZ ¼fu[k lq[k ls½ [+kwc ¼nq#Lr½ cukbZ vkSj bUlku dh bcrsnkbZ f[k+yd+r feêh ls dh",
                            "verse 32:8": "mldh uLy ¼bUlkuh ftLe ds½ [kqyklk ;kuh ¼uqRQs ds ls½ t+yhy ikuh ls cukbZ",
                            "verse 32:9": "fQj ml ¼ds iqrys½ dks nq#Lr fd;k vkSj mlesa viuh rjQ ls #g Qw¡dh vkSj rqe yksxksa ds ¼lquus ds½ fy, dku vkSj ¼ns[kus ds fy,½ vk¡[ksa vkSj ¼le>us ds fy,½ fny cuk,¡ ¼bl ij Hkh½ rqe yksx cgqr de ÓqØ djrs gks",
                            "verse 32:10": "vkSj ;s yksx dgrs gSa fd tc ge t+ehu esa ukiSn gks tk,¡xs rks D;k ge fQj u;k tUe ysxs ¼d+;ker ls ugh½ cfYd ;s yksx vius ijojfnxkj ds ¼lkeus gqt+wjh gh½ ls bUdkj j[krs gSa",
                            "verse 32:11": "¼,s jlwy½ rqe dg nks fd eYdqyekSr tks rqEgkjs Åij rSukr gS ogh rqEgkjh #gas d+Ct+ djsxk mlds ckn rqe lcds lc vius ijojfnxkj dh rjQ ykSVk, tkvksxs",
                            "verse 32:12": "vkSj ¼,s jlwy½ rqe dks cgqr vQlksl gksxk vxj rqe eqtfjeksa dks ns[kksxs fd og ¼fglkc ds oD+r½ vius ijojfnxkj dh ckjxkg esa vius lj >qdk, [kM+s gSa vkSj¼vt+Z dj jgs gSa½ ijojfnxkj geus ¼vPNh rjg ns[kk vkSj lqu fy;k rw gesa nqfu;k esa ,d nQk fQj ykSVk ns fd ge usd dke djsa",
                            "verse 32:13": "vkSj vc rks gedks ¼d+;ker dk½s iwjk iwjk ;d+hu gS vkSj ¼[k+qnk Qjek,xk fd½ vxj ge pkgrs rks nqfu;k gh esa gj Ó[+l dks ¼etcwj djds½ jkgs jkLr ij ys vkrs exj esjh rjQ ls ¼jksts+ vt+k½ ;s ckr d+jkj ik pqdh gS fd eS tgUuqe dks ftUukr vkSj vknfe;ksa ls Hkj nw¡xk",
                            "verse 32:14": "rks pw¡fd rqe vkt ds fnu gqt+wjh dks Hkwys cSBs Fks rks vc mldk et+k p[kks geus rqedks d+lnu Hkqyk fn;k vkSj tSlh tSlh rqEgkjh djrwrsa Fkha ¼muds cnys½ vc ges’kk ds vt+kc ds et+s p[kks",
                            "verse 32:15": "gekjh vk;rksa ij beku cl ogh yksx ykrs gSa fd ftl oD+r mUgsa og ¼vk;rs½ ;kn fnyk;h x;ha rks QkSju ltns esa fxj iM+us vkSj vius ijojfnxkj dh gEnks luk dh rLchg i<+us yxs vkSj ;s yksx rdCcqj ugh djrs ¼ltnk½",
                            "verse 32:16": "¼jkr½ ds oD+r muds igyw fcLrjksa ls vk’kuk ugha gksrs vkSj ¼vt+kc ds½ [k+kSQ vkSj ¼jger dh½ mEehn ij vius ijojfnxkj dh bcknr djrs gSa vkSj geus tks dqN mUgsa vrk fd;k gS mlesa ls ¼[+kq+nk dh½ jkg esa [k+pZ djrs gSa",
                            "verse 32:17": "mu yksxksa dh dkjxqt+kfj;ksa ds cnys esa dSlh dSlh vk¡[kksa dh BUMd muds fy, <dh fNih j[kh gS mldks dksbZ Ó[+l tkurk gh ugha",
                            "verse 32:18": "rks D;k tks Ó[+l bZekunkj gS ml Ó[+l ds cjkcj gks tk,xk tks cndkj gS ¼gjfxt+ ugha½ ;s nksuksa cjkcj ugh gks ldrs",
                            "verse 32:19": "ysfdu tks yksx bZeku yk, vkSj mUgksaus vPNs vPNs dke fd, muds fy, rks jgus lgus ds fy, ¼csg’r ds½ ckx+kr gSa ;s lkekus ft+;kQ+r mu dkjxqt+kfj;ksa dk cnyk gS tks og ¼nqfu;k esa½ dj pqds Fks",
                            "verse 32:20": "vkSj ftu yksxksa us cndkjh dh mudk fBdkuk rks ¼cl½ tgUuqe gS og tc mlesa ls fudy tkus dk bjknk djsaxs rks mlh esa fQj <dsy fn, tk,¡xs vkSj mu ls dgk tk,xk fd nkst+[k+ ds ftl vt+kc dks rqe >qBykrs Fks vc mlds et+s p[kks",
                            "verse 32:21": "vkSj ge ;d+huh ¼d+;ker ds½ cM+s vt+kc ls igys nqfu;k ds ¼ekewyh½ vt+kc dk et+k p[kk,¡xsa tks vud+jhc gksxk rkfd ;s yksx vc Hkh ¼esjh rjQ½ #t+w djsa",
                            "verse 32:22": "vkSj ftl Ó[+l dks mlds ijojfnxkj dh vk;rsa ;kn fnyk;h tk,¡ vkSj og muls eq¡g Qsj mlls c<+dj vkSj t+kfye dkSu gksxk ge xqukgxkjksa ls bUrd+ke ysxsa vkSj t+#j ysaxs",
                            "verse 32:23": "vkSj ¼,s jlwy½ geus rks ewlk dks Hkh ¼vklekuh fdrkc½ rkSjsr vrk dh Fkh rqe Hkh bl fdrkc ¼dqjku½ ds ¼vYykg dh rjQ ls½ feyus esa 'kd esa u iM+s jgks vkSj geus bl ¼rkSjsr½ rks rqe dks Hkh cuh bljkbZy ds fy, jguqek d+jkj fn;k Fkk",
                            "verse 32:24": "vkSj mUgh ¼cuh bljkbZy½ esa ls geus dqN yksxksa dks pwWfd mUgksaus ¼eqlhcrksa ij½ lcz fd;k Fkk is’kok cuk;k tks gekjs gqD+e ls ¼yksxks dh½ fgnk;r djrs Fks vkSj ¼blds vykok½ gekjh vk;rks dk fny ls ;d+hu j[krs Fks",
                            "verse 32:25": "¼,s jlwy½ glesa Ód ugha fd ftu ckrksa esa yksx ¼nqfu;k esa½ ckge >xM+rs jgrs gSa d+;ker ds fnu rqEgkjk ijojfnxkj d+rbZ QSlyk dj nsxk",
                            "verse 32:26": "D;k mu yksxksa dks ;s ekywe ugha fd geus muls igys fdruh mEerksa dks gykd dj Mkyk ftu ds ?kjksa esa ;s yksx py fQj jgsa gSa cs’kd mles ¼dqnjrs [+k+qnk dh½ cgqr lh fu’kkfu;k¡ gSa rks D;k ;s yksx lqurs ugha gSa",
                            "verse 32:27": "D;k bu yksxksa us bl ij Hkh x+kSj ugha fd;k fd ge pfV;y eSnku ¼bQ+rknk½ t+ehu dh rjQ ikuh dks tkjh djrs gSa fQj mlds t+fj, ls ge ?kkl ikr yxkrs gSa ftls muds tkuoj vkSj ;s [k+qn Hkh [kkrs gSa rks D;k ;s yksx bruk Hkh ugha ns[krs",
                            "verse 32:28": "vkSj ;s yksx dgrs gS fd vxj rqe yksx lPps gks ¼fd d+;ker vk,xh½ rks ¼vkf[k+j½ ;s QSlyk dc gksxk",
                            "verse 32:29": "¼,s jlwy½ rqe dg nks fd QSlys ds fnu dq¶+Q+kj dks mudk bZeku ykuk dqN dke u vk,xk vkSj u mudks ¼bldh½ eksgyr nh tk,xh",
                            "verse 32:30": "x+jt+ rqe mudh ckrksa dk [+;ky NksM+ nks vkSj rqe eqUrft+j jgks ¼vkf[k+j½ og yksx Hkh rks bUrt+kj dj jgs gSa"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Alif Laam Miim.",
                            "verse 32:2": "Turunnya Al Qur’an yang tidak ada keraguan padanya, (adalah) dari Tuhan semesta alam.",
                            "verse 32:3": "Tetapi mengapa mereka (orang kafir) mengatakan: \"Dia Muhammad mengada-adakannya\".",
                            "verse 32:4": "Allah-lah yang menciptakan langit dan bumi dan apa yang ada di antara keduanya dalam enam hari, kemudian Dia bersemayam di atas ’Arsy.",
                            "verse 32:5": "Dia mengatur urusan dari langit ke bumi, kemudian (urusan) itu naik kepada-Nya dalam satu hari yang kadarnya (lamanya) adalah seribu tahun menurut perhitunganmu.",
                            "verse 32:6": "Yang demikian itu ialah Tuhan Yang mengetahui yang gaib dan yang nyata, Yang Maha Perkasa lagi Maha Penyayang,",
                            "verse 32:7": "Yang membuat segala sesuatu yang Dia ciptakan sebaik-baiknya dan Yang memulai penciptaan manusia dari tanah.",
                            "verse 32:8": "Kemudian Dia menjadikan keturunannya dari saripati air yang hina (air mani).",
                            "verse 32:9": "Kemudian Dia menyempurnakan dan meniupkan ke dalam (tubuh)nya roh (ciptaan) -Nya dan Dia menjadikan bagi kamu pendengaran, penglihatan dan hati; (tetapi) kamu sedikit sekali bersyukur.",
                            "verse 32:10": "Dan mereka berkata: \"Apakah bila kami telah lenyap (hancur) di dalam tanah, kami benar-benar akan berada dalam ciptaan yang baru.",
                            "verse 32:11": "Katakanlah: \"Malaikat maut yang diserahi untuk (mencabut nyawa) mu akan mematikan kamu; kemudian hanya kepada Tuhanmulah kamu akan dikembalikan.",
                            "verse 32:12": "Dan (alangkah ngerinya), jika sekiranya kamu melihat ketika orang-orang yang berdosa itu menundukkan kepalanya di hadapan Tuhannya, (mereka berkata): \"Ya Tuhan kami, kami telah melihat dan mendengar, maka kembalikanlah kami (ke dunia), kami akan mengerjakan amal saleh, sesungguhnya kami adalah orang-orang yang yakin\".",
                            "verse 32:13": "Dan kalau Kami menghendaki niscaya Kami akan berikan kepada tiap-tiap jiwa petunjuk (bagi) nya, akan tetapi telah tetaplah perkataan (ketetapan) daripadaku; \"Sesungguhnya akan aku penuhi neraka jahannam itu dengan jin dan manusia bersama-sama.",
                            "verse 32:14": "Maka rasailah olehmu (siksa ini) disebabkan kamu melupakan akan pertemuan dengan harimu ini (Hari Kiamat); sesungguhnya Kami telah melupakan kamu (pula) dan rasakanlah siksa yang kekal, disebabkan apa yang selalu kamu kerjakan\".",
                            "verse 32:15": "Sesungguhnya orang-orang yang beriman dengan ayat-ayat Kami, adalah orang-orang yang apabila diperingatkan dengan ayat-ayat (Kami), mereka menyungkur sujud dan bertasbih serta memuji Tuhannya, sedang mereka tidak menyombongkan diri.",
                            "verse 32:16": "Lambung mereka jauh dari tempat tidurnya, sedang mereka berdo’a kepada Tuhannya dengan rasa takut dan harap, dan mereka menafkahkan sebahagian dari rezki yang Kami berikan kepada mereka.",
                            "verse 32:17": "Seorangpun tidak mengetahui apa yang disembunyikan untuk mereka yaitu (bermacam-macam ni’mat) yang menyedapkan pandangan mata sebagai balasan terhadap apa yang telah mereka kerjakan.",
                            "verse 32:18": "Maka apakah orang yang beriman seperti orang yang fasik (kafir)? Mereka tidak sama.",
                            "verse 32:19": "Adapun orang-orang yang beriman dan mengerjakan amal-amal saleh, maka bagi mereka surga-surga tempat kediaman, sebagai pahala terhadap apa yang telah mereka kerjakan.",
                            "verse 32:20": "Dan adapun orang-orang yang fasik (kafir), maka tempat mereka adalah neraka.",
                            "verse 32:21": "Dan sesungguhnya Kami merasakan kepada mereka sebahagian azab yang dekat (di dunia) sebelum azab yang lebih besar (di akhirat); mudah-mudahan mereka kembali (ke jalan yang benar).",
                            "verse 32:22": "Dan siapakah yang lebih lalim daripada orang yang telah diperingatkan dengan ayat-ayat Tuhannya, kemudian ia berpaling daripadanya? Sesungguhnya Kami akan memberikan pembalasan kepada orang-orang yang berdosa.",
                            "verse 32:23": "Dan sesungguhnya telah Kami berikan kepada Musa Al Kitab (Taurat), maka janganlah kamu (Muhammad) ragu-ragu menerima (Al Qur'an itu) dan Kami jadikan Al Kitab (Taurat) itu petunjuk bagi Bani Israel.",
                            "verse 32:24": "Dan Kami jadikan di antara mereka itu pemimpin-pemimpin yang memberi petunjuk dengan perintah Kami ketika mereka sabar.",
                            "verse 32:25": "Sesungguhnya Tuhanmu Dialah yang memberikan keputusan di antara mereka pada Hari Kiamat tentang apa yang selalu mereka perselisihkan padanya.",
                            "verse 32:26": "Dan apakah tidak menjadi petunjuk bagi mereka, berapa banyak umat-umat sebelum mereka yang telah Kami binasakan sedangkan mereka sendiri berjalan di tempat-tempat kediaman mereka itu.",
                            "verse 32:27": "Dan apakah mereka tidak memperhatikan, bahwasanya Kami menghalau (awan yang mengandung) air ke bumi yang tandus, lalu Kami tumbuhkan dengan air hujan itu tanam-tanaman yang daripadanya (dapat) makan binatang-binatang ternak mereka dan mereka sendiri.",
                            "verse 32:28": "Dan mereka bertanya: \"Bilakah kemenangan itu (datang) jika kamu memang orang-orang yang benar?\"",
                            "verse 32:29": "Katakanlah: \"Pada hari kemenangan itu tidak berguna bagi orang-orang kafir iman mereka dan tidak (pula) mereka diberi tangguh.",
                            "verse 32:30": "Maka berpalinglah kamu dari mereka dan tunggulah, sesungguhnya mereka (juga) menunggu."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Alif, Lâm, Mîm .",
                            "verse 32:2": "La rivelazione del Libro",
                            "verse 32:3": "senza alcun dubbio dal Signore dei mondi .",
                            "verse 32:4": "Diranno: \"L'ha inventato\"? E' invece una verità che",
                            "verse 32:5": "dal tuo Signore, affinché tu ammonisca un popolo a cui non giunse, prima di te, alcun ammonitore, affinché si lascino guidare.",
                            "verse 32:6": "Allah è Colui che ha creato in sei giorni i cieli e la terra e tutto ciò che vi è frammezzo, quindi Si è innalzato sul Trono.",
                            "verse 32:7": "Dal cielo dirige le cose della terra e poi tutto risalirà a Lui, in un Giorno che sarà come mille anni del vostro contare.",
                            "verse 32:8": "Egli è Colui che conosce il palese e l'invisibile; è l'Eccelso, il Misericordioso;",
                            "verse 32:9": "è Colui che ha perfezionato ogni cosa creata e dall'argilla ha dato inizio alla creazione dell'uomo, XXXII Sura \"As-Sajda\"",
                            "verse 32:10": "quindi ha tratto la sua discendenza da una goccia d'acqua insignificante ;",
                            "verse 32:11": "quindi gli ha dato forma e ha insufflato in lui del Suo Spirito.",
                            "verse 32:12": "E dicono: « Quando saremo dispersi nella terra godremo di una nuova creazione?».",
                            "verse 32:13": "Di': « L'angelo della morte che si occuperà di voi, vi farà morire e poi sarete ricondotti al vostro Signore».",
                            "verse 32:14": "Se allora potessi vedere i malvagi, [dire col] capo chino davanti al loro Signore: « Nostro Signore, abbiamo visto e sentito, lasciaci tornare , sì che possiamo fare il bene;",
                            "verse 32:15": "crediamo con certezza».",
                            "verse 32:16": "«Se avessimo voluto, avremmo dato ad ogni anima la sua direzione; si è invece compiuta la mia sentenza: \"riempirò l'Inferno di uomini e di dèmoni insieme\" .",
                            "verse 32:17": "Gustate allora [il castigo] per aver dimenticato l'incontro di questo Giorno.",
                            "verse 32:18": "Noi vi dimentichiamo.",
                            "verse 32:19": "In verità credono nei Nostri segni solo coloro che, quando vengono loro rammentati, si gettano in prosternazione, lodano il loro Signore rendendoGli gloria e non son tronfi di orgoglio.",
                            "verse 32:20": "Strappano i loro corpi dai letti per invocare il loro Signore, per timore e speranza , e sono generosi di quello che abbiamo loro concesso.",
                            "verse 32:21": "Nessuno conosce la gioia immensa che li attende, ricompensa per quello che avranno fatto.",
                            "verse 32:22": "Forse il credente è come l'empio? Non sono affatto uguali.",
                            "verse 32:23": "Coloro che credono e compiono il bene saranno ospitati nei giardini del Rifugio , premio per quello che avranno fatto,",
                            "verse 32:24": "mentre coloro che saranno stati empi avranno per rifugio il fuoco.",
                            "verse 32:25": "Daremo loro un castigo immediato prima del castigo più grande, affinché ritornino [sulla retta via] .",
                            "verse 32:26": "Chi è peggior ingiusto di colui che si distoglie dai segni di Allah dopo che gli sono stati ricordati? In verità ci vendicheremo dei trasgressori.",
                            "verse 32:27": "Già demmo il Libro a Mosè :",
                            "verse 32:28": "«Non dubitare circa il Suo incontro ».",
                            "verse 32:29": "E",
                            "verse 32:30": "furono perseveranti e credettero con fermezza nei Nostri segni, scegliemmo tra loro dei capi che li dirigessero secondo il Nostro comando.",
                            "verse 32:31": "In verità il tuo Signore nel Giorno della Resurrezione giudicherà tra loro, a proposito delle loro divergenze.",
                            "verse 32:32": "Non è servito loro da lezione che prima di loro abbiamo fatto perire tante generazioni, nelle cui case [in rovina] si aggirano? In verità in ciò vi sono segni.",
                            "verse 32:33": "Non hanno visto come spingiamo l'acqua verso una terra arida, suscitando poi una vegetazione che nutre il loro bestiame e loro stessi? Non vedranno dunque?",
                            "verse 32:34": "E dicono: « Quando verrà questa vittoria , se siete veridici?»",
                            "verse 32:35": "Di': « Nel Giorno della Vittoria sarà vano il credere dei miscredenti! Non avranno alcun rinvio».",
                            "verse 32:36": "Allontanati dunque da loro, e aspetta."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "アリフ・ラーム・ミーム。",
                            "verse 32:2": "この啓典の啓示は，万有の主から（下ったもの）で，疑いの余地はない。",
                            "verse 32:3": "けれどもかれらは，「かれ（ムハンマド）がこれを捏造した。」と言うのか。いや，これはあなたの主からの真理で，あなた以前に，一人の警告者も来なかった民に，警告するためのものである。必ずかれらは導かれるであろう。",
                            "verse 32:4": "アッラーこそは，6日の間に天と地，そしてその間の凡てのものを創造して，御自らその玉座に鎮座なされる方である。あなたがたはかれの外に守護者はなく，執り成す者もないのである。あなたがたはそれでも気が付かないのか。",
                            "verse 32:5": "かれは，天から地までの（凡ての）事物を統御なされる。それからそれ（万有）は一日にして，かれの許に登って行く。その（一日の）長さは，あなたがたの計算する千年である。",
                            "verse 32:6": "この方こそは，幽玄界と現象界を（凡て）知っておられる方，偉力ならびなく慈悲深い御方であり，",
                            "verse 32:7": "創造された一切を，最も善美なものになされ，泥から人間の創造を始められる。",
                            "verse 32:8": "かれは，いやしい水（精液）の精からその後継者を創られ，",
                            "verse 32:9": "それからかれ（人間）を均整にし，かれの聖霊を吹き込まれ，またあなたがたのために聴覚と視覚と心を授けられた御方。あなたがたはほとんど感謝もしない。",
                            "verse 32:10": "かれらは，「地中に消えてから，わたしたちはまた新しく創造されるであろうか。」と言う。いや，かれらは主との会見を信じない。",
                            "verse 32:11": "言ってやるがいい。「あなたがたを受け持つ死の天使があなたがたを死なせ，それから主に帰らせる。」",
                            "verse 32:12": "罪を犯した者たちが主の御前に項垂れて，「主よ，わたしたちは見ました。聞きました。わたしたちを御返し下さい。わたしたちは善い行いをいたします。わたしたちは本当に悟りました。」（と言う姿を）あなたに見せてやりたいものである。",
                            "verse 32:13": "もしわれが欲するならば，それぞれの魂に導きを与えることも出来た。だが「ジン（幽精）と人間たちで，必ず地獄を満たすであろう。」とのわれの言葉は，真実となろう。",
                            "verse 32:14": "それであなたがたは味わうがよい。この日の会見を忘れていたことを。本当にわれもあなたがたを忘れよう。あなたがたは自分たちが行ったことに対する永遠の懲罰を味わえ。",
                            "verse 32:15": "われの印を信じる者とは，それが述べられた時に敬慕し身を投げだしてサジダし，主の栄光を讃えて唱念する，高慢ではない者たちである。〔サジダ〕",
                            "verse 32:16": "かれらの体が臥床を離れると，畏れと希望とを抱いて主に祈り，われが授けたものを施しにさし出す。",
                            "verse 32:17": "かれらはその行ったことの報奨として，喜ばしいものが自分のためにひそかに（用意）されているのを知らない。",
                            "verse 32:18": "信仰している者が，主の� に背く者と同じであろうか。かれらは決して同じではない。",
                            "verse 32:19": "信仰して善行に勤しむ者は，楽園が住まいで，それは善行をしたことへの報奨である。",
                            "verse 32:20": "だが� に背く者の住まいは地獄の業火である。そこから出ようとする度にかれらはその中に引き戻され，「あなたがたが虚偽であるとしていた業火の懲罰を味わえ。」と言われよう。",
                            "verse 32:21": "われは大きい懲罰の前に，必ず手近な懲罰をかれらに味わせる。そうすればかれらも（悔悟してわれに）帰るであろう。",
                            "verse 32:22": "主の印に気付いていながらその後背き去る者より酷い罪作りがあろうか。われは必ず罪深い者に報復するであろう。",
                            "verse 32:23": "われは，ムーサーにしかと啓典を授けた。だからあなた（ムハンマド）がこれを授かることを疑ってはならない。われはそれを，イスラエルの子孫たちの導きとした。",
                            "verse 32:24": "われは，かれらの間から，わが命令を下して（人びとを）導く導師をあげた。かれらはよく耐え忍びまたわれの印を堅く信じていた。",
                            "verse 32:25": "本当にあなたの主は，かれらが意見を異にしていたことに関して，審判の日にかれらの間を裁決なされる。",
                            "verse 32:26": "かれらに教えなかったか。それ以前にわれが幾世代を滅ぼしたかを。その住まいの中を，（今）かれらは往来している。本当にその中には，種々の印がある。それでもかれらは聞く耳を持たないのか。",
                            "verse 32:27": "またわれが水を不毛の地に送り，それで作物を育成させ，かれら自身や家畜に食べさせるのを見ないのか。かれらは見る目を持たないのか。",
                            "verse 32:28": "かれらは，「もしあなたがたが言うことが真実ならば勝利はいつ来るのですか。」と言う。",
                            "verse 32:29": "言ってやるがいい。「勝利の日には，不信心であった者の信仰はかれらに役立たず，かれらは猶予もされないであろう。」",
                            "verse 32:30": "だからあなたは，かれらを避けて待て。かれらも待っているのである。 言ってやるがいい。「勝利の日には，不信心であった者の信仰はかれらに役立たず，かれらは猶予もされないであろう。」"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "알리프 람 밈",
                            "verse 32:2": "이것은 의심할 바 없는 만유 의 주님으로부터 계시된 성서의 말씀이라",
                            "verse 32:3": "흑은 그가 그것을 날조하였 다 라고 그들이 말할지 모르나 그러나 그것은 그대 주님으로부터의 계시된 진리이며 이는 그대 이전에 어떠한 경고자도 오지 아니 한 백성에게 그대로 하여금 경고 하여 그들이 인도 받도록 함이라",
                            "verse 32:4": "하나님께서는 하늘과 땅 그리고 그 사이에 있는 모든 것을 엿 새 동안에 창조하신 후 권자에 오르셨으니 그분이 아니면 너희에겐 어떤 보호자도 중재과도 없노 라 너희는 이를 교훈으로 받아들 이려 하지 않느뇨",
                            "verse 32:5": "그분은 하늘에서부터 땅에 이르기 까지 만사를 주관하시며 심 판의 날에 모든 것이 그분에게 귀의하니 그 기간은 너희가 헤아리 는 천년과 같으리라",
                            "verse 32:6": "이분은 보이는 것과 보이지 않는 것도 아시는 분이시며 권능 과 자비로 충만하신 분이시라",
                            "verse 32:7": "하나님은 그분이 창조하신 모든 것을 가장 조화있게 두셨으며 인간을 흙에서 창조하기 시작하 셨노라",
                            "verse 32:8": "이리하여 한방울의 정액으로 부터 인간의 자손을 지으셨노라",
                            "verse 32:9": "그런 후 그것을 형상으로 만 드사 그 안에 그분의 영혼을 불어넣고 청각과 시각과 심장을 주겼 노라 그러나 너희는 감사하는 마 음이 크지 못하더라",
                            "verse 32:10": "땅속에 묻혀 흙이 된 후 다시 창조된다는 말이뇨 라고 그들 은 말하도다 그들은 주님과의 만 남을 불신하고 있더라",
                            "verse 32:11": "일러가로되 너희를 맡고 있는 죽음의 천사가 너희를 임종케 하리니 너희는 너희 주님께로 귀 의하노라",
                            "verse 32:12": "죄인들이 그들의 주님께 그들의 고개를 숙이며 주여 저희들 은 지켜 보았으며 들어 보았습니 다 저희가 다시 현세로 돌아가도 록 하여주소서 그리하면 저희가 선을 행하여 믿는 자들이 되리라 하더라",
                            "verse 32:13": "만일 하나님의 뜻이 있었다면 하나님은 누구에게나 복음을 주었으리라 그러나 하나님으로부 터 말씀이 실현되리니 하나님께서영마와 사람들 모두로 지옥을 채 우리라",
                            "verse 32:14": "너희가 오늘의 만남을 망각하였으매 맛을 보라 또한 하나님 은 너희를 생각치 않으리니 너희 가 저질러온 것에 대해 영원한 벌을 맛보게 하리라",
                            "verse 32:15": "말씀이 낭송될 때 하나님의말씀을 믿는 자들은 부복하고 주 님의 영광을 찬미하며 거만하지 아니하노라",
                            "verse 32:16": "그들의 손발은 그들의 침상을 멀리하고 두려움과 희망으로 그들의 주님을 부르며 우리가 그 들에게 베푼 양식으로 자선을 베 푸노라",
                            "verse 32:17": "아무도 모를 것은 그들이 행한 것에 대한 보상이니 그들을 기 쁘게 할 숨겨진 것이라",
                            "verse 32:18": "믿음을 가진자가 사악한 자 와 같을 수 있느뇨 그 둘은 결코 같을 수 없나니",
                            "verse 32:19": "믿음을 갖고 선을 행하는 자들은 천국이 그들의 안식처가 되 매 이는 그들이 행한 것에 대한 환대라",
                            "verse 32:20": "그러나 사악한 자들은 불지 옥이 그들의 거주지거늘 그들이 그곳으로부터 도주하려 할 때마다 그들은 그곳으로 다시 들어가게 되어 불지윽의 벌을 맛보라 이는 너 희가 불신한 것에 대한 죄값이라는말을 그들은 듣게 되리라",
                            "verse 32:21": "하나님은 가장 큰 벌에 앞서 가까운 현세의 벌을 그들로 하여 금 맛보게 하리니 이는 그들이 속 죄하기 위함이라",
                            "verse 32:22": "주님의 말씀을 기억한 후 그 말씀을 배반한 자보다 더 사악함 이 어디에 있느뇨 실로 하나님은 죄인들에게 벌을 내릴 것이라",
                            "verse 32:23": "하나님은 모세에게 성서를 주었나니 그가 성서를 받았음에 의심하지 말라 하나님은 그것으로이라엘 자손의 복음이 되도록 하 였노라",
                            "verse 32:24": "하나님은 그들 가운데 지도 자들을 두어 그분의 명령으로 그 들을 인도하도록 하였으니 그들이인내할 때라 그들이 또한 그분의 말씀을 믿을 때라",
                            "verse 32:25": "실로 그대의 주님은 심판의 날 그들이 서로 달리\\xC2g던 것들을 심판하시니라",
                            "verse 32:26": "하나님이 이전에 많은 세대 를 멸망시킨 것이 그들에게 교훈 이 되지 아니 했느뇨 그들의 거주지에서 그들은 지금도 방황하고 있느뇨 실로 그 안에는 말씀이 있건만 그들은 듣지 아니 함이라",
                            "verse 32:27": "메마른 황무지에 물을 대어 그것으로 농작물을 재배케하여 그들의 가축들과 그들 자신들이 그 로부터 섭취하도록 했음을 그들은알지 못하고 보지도 못하느뇨",
                            "verse 32:28": "만일 그대가 진실이라면 언 제 심판이 오느뇨 라고 그들이 물으매",
                            "verse 32:29": "일러가로되 심판의 날 불신 한 자들의 믿음은 유용함이 없으 며 그들에게는 믿음을 가질 기회 도 기다리지 아니 함이라",
                            "verse 32:30": "그러하매 그들로부터 멀리하고 기다리라 그들은 실로 그날을 기다리고 있을 뿐이라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "سه‌رنجی سه‌ره‌تای سووره‌تی (البقرة) بده‌.",
                            "verse 32:2": "دابه‌زاندنی ئه‌م قورئانه له‌لایه‌ن په‌روه‌ردگاری جیهانیانه‌وه هیچ گومانی تێدانیه‌.",
                            "verse 32:3": "ئایا خوانه‌ناسان ده‌ڵێن: (محمد صلی الله علیه وسلم) ئه‌م قورئانه‌ی هه‌ڵبه‌ستووه‌؟ نه‌خێر وانی یه‌، به‌ڵکو قورئان حه‌ق و ڕاسته و له‌لایه‌ن پروه‌ردگارته‌وه نێردراوه‌، بۆ ئه‌وه‌ی قه‌وم و هۆزێک بێدار بکه‌یته‌وه که پێش تۆ بێدارخه‌ره‌وه‌یه‌کیان بۆ نه‌هاتووه‌، تاڕێگه‌ی هیدایه‌ت و ئیمان بگرنه‌به‌ر.",
                            "verse 32:4": "خوا ئه‌و زاته‌یه که ئاسمانه‌کان و زه‌وی و هه‌رچی له نێوانیاندا هه‌یه له شه‌ش ڕۆژدا دروستی کردووه (مه‌رج نیه دڕێژی ئه‌و ڕۆژانه به‌قه‌ده‌ر دڕێژی شه‌و و ڕۆژی زه‌وی بێت که به بیست و چوار سه‌عات جارێک به‌ده‌وری خۆیدا ده‌سوڕێته‌وه‌، چونکه هه‌ندێک ڕۆژ هه‌روه‌ک قورئان خۆی ئاماژه‌ی بۆ ده‌کات هه‌زار ساڵه‌، هه‌ندێکی تری په‌نجا هه‌زار ساڵه‌)، پاشان خوا له‌سه‌ر ته‌ختی فه‌رمانڕه‌واییه‌وه سه‌رپه‌رشتی کارو فرمانی دروستکراوانی ده‌کات و ئه‌وه‌ی ئه‌و عیلمی پێی هه‌یه و ده‌یزانێت و ده‌یه‌وێت، هه‌ر ئه‌وه پێش دێت، (سه‌رنجی ئایه‌تی _2_الرعد بده‌)، خه‌ڵکینه جگه له‌و خوایه‌که‌س نیه پشتیوانیتان لێ بکات یان تکا کارتان بێت، ئایه یاداوه‌ری وه‌رده‌گرن و تێده‌گه‌ن.",
                            "verse 32:5": "ئه‌و خوایه له ژوور ئاسمانه‌وه کاروباری زه‌وی ڕێک ده‌خات و سه‌رپه‌رشتی ده‌کات، له‌وه‌ودوا ڕووداوه‌کان و به‌سه‌رهاته‌کان و کارو کرده‌وه‌ی به‌نده‌کان ده‌گه‌رێته‌وه بۆ لای، له ڕۆژێکدا که به‌رامبه‌ر هه‌زار ساڵه به‌و حسابه‌ی ئێوه که ده‌یکه‌ن.",
                            "verse 32:6": "ئا ئه‌و خوایه زانایه به نهێنی و ئاشکراکان، له هه‌مان کاتدا خاوه‌ن ده‌سه‌ڵات و میهره‌بانیشه‌.",
                            "verse 32:7": "ئه‌و خوایه زاتێکه هه‌موو شتێکی به‌چاکی و ڕێکوپێکی به‌دیهێناوه‌، له‌سه‌ره‌تاوه ئاده‌میزادی له قوڕ دروست کردووه‌.",
                            "verse 32:8": "پاشان زنجیره‌ی نه‌وه‌کانی له ئاوێکی ساده و بێنرخ به‌دیهێناوه‌.",
                            "verse 32:9": "پاشان ئاده‌میزاده به‌ڕێک و پێکی ڕێکخست، له ڕوح و گیانێک که خۆی خاوه‌نیه‌تی فووی پێداکرد، ئینجا ده‌زگای بیستن و بینین و لێکدانه‌وه‌ی پێبه‌خشیون، که‌متان سوپاسگوزارن.",
                            "verse 32:10": "(له‌گه‌ڵ ئه‌و هه‌موو به‌ڵگه به‌هێزانه‌دا) خوانه‌ناسان ده‌یانوت: ئایه ئه‌گه‌ر مردین و بزر بووین له توێی خاکی زه‌ویدا، ئایا جارێکی تر سه‌رله‌نوێ دروست ده‌کرێینه‌وه‌؟! نه‌خێر ون نابن! به‌ڵکو ئه‌وانه (هه‌ر قسه‌ی به‌تاڵ و پڕوپوچ ده‌که‌ن ئه‌گینا له بنه‌ڕه‌تدا به ئاماده بوونی به‌رده‌م باره‌گای په‌روه‌ردگاریان) بێ باوه‌ڕن.",
                            "verse 32:11": "جا پێیان بڵێ: فریشته‌ی گیان کێشان که کاری گیان کێشانتانی پێ سپێردراوه ده‌تانمرێنێت، له‌وه‌ودوا بۆلای په‌روه‌ردگارتان ده‌برێنه‌وه‌.",
                            "verse 32:12": "ئه‌گه‌ر ده‌تبینی کاتێك ئه‌و تاوانبارانه (که باوه‌ڕیان به‌زیندوو بوونه‌وه نه‌بوو) خه‌جاڵه‌ت و سه‌رشۆڕن له‌به‌رده‌م دادگای خواییدا، ده‌ڵێن: په‌روه‌ردگارا ئه‌وه ئیتر به‌چاوی خۆمان بینیمان، به گوێی خۆمان بیستمان ئه‌وه‌ی بڕوامان پێی نه‌بوو، ئێسته‌ش ئێمه بگێڕه‌وه بۆ دنیا مه‌رج بێت هه‌ر کارو کرده‌وه‌ی چاکه ئه‌نجام بده‌ین، ئێمه ئێسته ته‌واو دڵنیاین.",
                            "verse 32:13": "بێگومان ئه‌گه‌ر بمانوویستایه هه‌موو که‌سێکمان هیدایه‌ت و ڕێنموویی ده‌کرد (به‌ناچاری و به‌بێ ویستی خۆیان)، به‌ڵام بڕیاری من ئه‌وه‌یه (که ئاده‌میزاد و په‌ریه‌کان سه‌ربه‌ست و سه‌رپشك و ئازاد بکه‌م، سه‌رئه‌نجامیش) هه‌ر دۆزه‌خ پڕ ده‌که‌م له په‌ریه‌کان و له خه‌ڵکی تێکرا، (له‌وانه‌ی بڕوایان به خواو پێغه‌مبه‌ره‌کانی نه‌بوو).",
                            "verse 32:14": "ده‌ی که‌واته بچێژن ماده‌م ئێوه ئه‌م ڕۆژه‌تان فه‌رامۆش کرد، ئێمه‌ش به‌ڕاستی ئێوه پشتگوێ ده‌خه‌ین، بچێژن ئێش و سزای نه‌بڕاوه‌، له سه‌رئه‌نجامی کارو کرده‌وه‌یه‌ك که ده‌تانکرد.",
                            "verse 32:15": "به‌ڕاستی ته‌نها ئه‌وانه بڕوا به ئایه‌ته‌کانی ئێمه ده‌هێنن، کاتێك یاداوه‌ری ده‌کرێن پێی، خێرا سوژده ده‌به‌ن ته‌سبیحات و سوپاسگوزاری په‌روه‌ردگاریان ده‌که‌ن، له کاتێکدا ئه‌وانه به هیچ شێوه‌یه‌ك فیزیان نیه و خۆیان به‌گه‌وره نازانن.",
                            "verse 32:16": "(ئه‌و ئیمانداره به‌خته‌وه‌رانه‌) نێوانیان خۆش نیه له‌گه‌ڵ ڕاکشان له جێگه‌و ڕێگه‌و ڕێگه‌ی گه‌رم و نه‌رما (واته به‌نوێژو خواپه‌رستی به‌شێکی شه‌و ده‌به‌نه سه‌ر)، هه‌میشه نزاو پاڕانه‌وه‌یان ڕوو به په‌روه‌ردگاریانه له خه‌شم و قین و دۆزه‌خی ده‌ترسن، ئاواتی ڕه‌زامه‌ندی و به‌هه‌شتیان هه‌یه و له‌و ڕزق و ڕۆزی و توانایی و زانیاریه‌ی پێمه‌ن به‌خشیوون ده‌به‌خشن.",
                            "verse 32:17": "جا هیچ که‌س له‌و به‌خته‌وه‌رانه نازانێت چی بۆهه‌ڵگیراوه وشاراوه‌ته‌وه له نازو نیعمه‌تی جۆراوجۆر لای په‌روه‌ردگاری، که چاوان پێی گه‌ش ده‌بنه‌وه و به‌دیتنی شاد ده‌بن، له پاداشتی کارو کرده‌وه‌ی چاك و پاکیاندا که ئه‌نجامیان ده‌دا.",
                            "verse 32:18": "ئایا ئه‌و که‌سه‌ی ئیماندار بوو بێت وه‌ك ئه‌و که‌سه‌یه که تاوانبار بوو بێت؟ وه‌ك یه‌ك نین.",
                            "verse 32:19": "به‌ڵکو ئه‌وانه‌ی که باوه‌ڕیان هێناوه و کرده‌وه چاکه‌کانیان ئه‌نجامداوه‌، شوێنیان باخچه‌کانی به‌هه‌شته (که بۆ هه‌میشه جێگه‌ی حه‌وانه‌وه و حه‌سانه‌وه‌یانه‌)، هه‌ر له‌وێ داده‌به‌زن، له پاداشتی کارو کرده‌وه‌یه‌ك که ده‌یانکرد.",
                            "verse 32:20": "ئه‌وانه‌ش تاوانبار یاخی بوون، شوێنیان ناو ئاگری دۆزه‌خه‌، هه‌ر کاتێك ویستیان لێی ده‌رچن، ده‌گێڕدرێنه‌وه بۆ ناوی، پێیان ده‌وترێت: بچێژن سزای ئه‌و ئاگره‌ی که بڕواتان پێی نه‌بوو.",
                            "verse 32:21": "سوێند به‌خوا ئێمه تاڵاو له دنیادا ده‌که‌ین به‌گه‌رویاندا، بێجگه له سزای ڕیشه‌که‌نکردنیان، بۆئه‌وه‌ی هۆش و بیربکه‌نه‌وه‌و بیرێك بکه‌نه‌وه و بگه‌ڕێنه‌وه بۆ لای ئیمان.",
                            "verse 32:22": "جا کێ له‌و که‌سه سته‌مکارتره که به فه‌رمووده‌کانی خوا یاداوه‌ری و ئامۆژگاری کرابێت، پاشان پشتی لێ هه‌ڵکربێت و گوێی پێنه‌دات، به‌ڕاستی ئێمه تۆڵه له تاوانبارو تاوانکاران ده‌ستێنین.",
                            "verse 32:23": "سوێند به خوا به‌ڕاستی ئێمه ته‌وراتمان به‌خشی به موسا، تۆ (ئه‌ی محمد صلی الله علیه وسلم) هیچ گومانت نه‌بێت له دیداری موساو له‌وه‌ش که ته‌ورات له‌لایه‌ن ئێمه‌وه به‌خشراوه به‌و، ئه‌و کاته ئێمه ته‌وراتمان کرد به ڕێنموویی بۆ نه‌وه‌ی ئیسرائیل.",
                            "verse 32:24": "پاشان که نه‌وه‌ی ئیسرائیل خۆگری و ئارامیان کرده پیشه‌یان کردمانن به پێشه‌واو ده‌سه‌ڵاتمان پێبه‌خشین، ئه‌و کاته دڵنیایی و بڕوایه‌کی ته‌واویان هه‌بوو به ئایه‌ته‌کانی ئێمه (شایسته‌ی ئه‌و ڕێزه بوون).",
                            "verse 32:25": "به‌ڕاستی په‌روه‌ردگارت خۆی (دوای ئه‌وه‌ی که بوونه چه‌نده‌ها ده‌سته و گرۆ) له ڕۆژی قیامه‌تدا له‌یه‌ك جیایان ده‌کاته‌وه‌، چاك و خراپیان دیاری ده‌کات له‌و شتانه‌دا که‌وا ئه‌وان کێشه‌یان تێدا ده‌کرد و ڕووبه‌ڕوی یه‌ك ده‌بوونه‌وه و به‌رامبه‌ر یه‌ك ده‌وه‌ستانه‌وه‌.",
                            "verse 32:26": "ئایا ئه‌وه په‌ندو ئامۆژگاری وه‌رناگرن له‌وه‌ی: ئێمه پێش ئه‌مان چه‌نده‌ها جیل و نه‌وه‌مان له‌ناوبردوه‌، به‌ناو ماڵه‌کانیاندا دێن و ده‌چن، به‌ڕاستی ئا له‌و دیمه‌نانه‌دا به‌ڵگه‌ی زۆر به‌هێز هه‌یه له‌سه‌ر ده‌سه‌ڵاتی ئێمه‌، ئایا ئه‌وه نابیستن؟!",
                            "verse 32:27": "ئایا سه‌رنجیان نه‌داوه که به‌ڕاستی چۆن ئێمه ئاوکێش ده‌که‌ین و ده‌یبه‌ین بۆ زه‌وی وزاری وشك و بێ ڕوه‌ك جا به‌و ئاوه ڕوه‌ك و گژوگیا ده‌رده‌هێنین که ماڵاتیان و خۆیشیان لێی ده‌خۆن، ئایا ئه‌وه نابینن و سه‌رنج ناده‌ن؟!",
                            "verse 32:28": "بێ باوه‌ڕان ده‌ڵێن: باشه‌، ئه‌وه که‌ی ئه‌م جیاکردنه‌وه و سه‌رکه‌وتنی ئیمانداره پێش دێت، ئه‌گه‌ر ڕاست ده‌که‌ن؟!",
                            "verse 32:29": "ئه‌ی محمد صلی الله علیه وسلم پێیان بڵێ: ڕۆژی جیاکردنه‌وه و سه‌رکه‌وتنی ئیمان، باوه‌ڕهێنانی کافران هیچ سوودی نابێت بۆیان، هیچ مۆڵه‌تیشیان نادرێت (په‌شیمانییش سوودی نابێت).",
                            "verse 32:30": "جا تۆ ڕوویان لێ وه‌رگێڕه و گوێیان مه‌ده‌رێ، به‌ڵکو چاوه‌ڕوان به‌، به‌ڕاستی ئه‌وانه چاوه‌ڕوانن!! نابێت)."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Alif, Laam, Miim.",
                            "verse 32:2": "Diturunkan Al-Quran ini, dengan tidak ada sebarang syak padanya, dari Tuhan yang memelihara dan mentadbirkan sekalian alam.",
                            "verse 32:3": "(Orang-orang kafir tidak mengakui hakikat yang demikian) bahkan mereka mengatakan: Dialah (Muhammad) yang mengada-adakan Al-Quran menurut rekaannya.",
                            "verse 32:4": "Allah Tuhan yang menciptakan langit dan bumi serta segala yang ada di antara keduanya dalam enam masa, kemudian Dia bersemayam di atas Arasy; kamu tidak akan beroleh sebarang penolong dan pemberi syafaat selain dari Allah; oleh itu tidakkah kamu mahu insaf dan mengambil iktibar (untuk mencapai keredaanNya)?",
                            "verse 32:5": "Allah mentadbirkan makhluk-makhlukNya; (bagi melaksanakan tadbirNya itu Ia menurunkan segala sebab dan peraturan) dari langit ke bumi; kemudian diangkat naik kepada pengetahuanNya (segala yang berlaku dari perlaksanaan tadbirNya itu untuk dihakimiNya) pada suatu masa yang (dirasai oleh orang-orang yang bersalah) banyak bilangan tahunnya menurut hitungan masa kamu yang biasa.",
                            "verse 32:6": "Yang demikian sifatnya ialah Tuhan yang mengetahui perkara-perkara yang ghaib dan yang nyata; Yang Maha Kuasa, lagi Maha Mengasihani;",
                            "verse 32:7": "Yang menciptakan tiap-tiap sesuatu dengan sebaik-baiknya dan dimulakanNya kejadian manusia berasal dari tanah;",
                            "verse 32:8": "Kemudian Dia menjadikan keturunan manusia itu dari sejenis pati, iaitu dari air (benih) yang sedikit dipandang orang;",
                            "verse 32:9": "Kemudian Dia menyempurnakan kejadiannya, serta meniupkan padanya: Roh ciptaanNya.",
                            "verse 32:10": "Dan mereka (yang kafir) itu berkata: Adakah apabila kami telah hilang lenyap dalam tanah, kami pula akan hidup semula dalam bentuk kejadian yang baru? Betulkah demikian? (Mereka bukan sahaja tidak percaya tentang hidup semula) bahkan mereka tidak percaya tentang pertemuan dengan Tuhannya.",
                            "verse 32:11": "Katakanlah (wahai Muhammad); Nyawa kamu akan diambil oleh Malikil Maut yang ditugaskan berbuat demikian ketika habis ajal kamu, kemudian kamu akan dikembalikan kepada Tuhan kamu (untuk menerima balasan).",
                            "verse 32:12": "Dan (sungguh ngeri) sekiranya engkau melihat ketika orang-orang yang berdosa itu menundukkan kepalanya di hadapan Tuhan mereka (dalam keadaan malu dan hina, sambil merayu): Wahai Tuhan kami, kami telah melihat dan mendengar dengan sejelas-jelasnya (akan segala yang kami ingkari dahulu); maka kembalikanlah kami ke dunia supaya kami mengerjakan amal-amal yang baik; sesungguhnya kami sekarang telah yakin.",
                            "verse 32:13": "Dan (bagi menolak rayuan itu Allah Taala berfirman): Kalaulah Kami telah tetapkan persediaan (memberikan hidayat petunjuk untuk beriman dan beramal soleh kepada tiap-tiap seorang dengan ketiadaan usaha dari masing-masing), nescaya Kami berikan kepada tiap-tiap seorang akan hidayat petunjuknya (sebelum masing-masing meninggal dunia, supaya tidak terkena azab di akhirat); tetapi telah tetap hukuman seksa dariKu: Demi sesungguhnya! Aku akan memenuhi Neraka Jahannam dengan semua jin dan manusia (yang pada masa hidupnya tidak berusaha untuk beriman dan beramal soleh).",
                            "verse 32:14": "(Lalu dikatakan kepada mereka: Oleh sebab kelalaian kamu) maka rasalah azab seksa kerana kamu melupai pertemuan hari kamu ini.",
                            "verse 32:15": "Sesungguhnya yang sebenar-benar beriman kepada ayat-ayat keterangan Kami hanyalah orang-orang yang apabila diberi peringatan dan pengajaran dengan ayat-ayat itu, mereka segera merebahkan diri sambil sujud (menandakan taat patuh) dan menggerakkan lidah dengan bertasbih serta memuji Tuhan mereka dan mereka pula tidak bersikap sombong takbur.",
                            "verse 32:16": "Mereka merenggangkan diri dari tempat tidur, (sedikit sangat tidur, kerana mengerjakan sembahyang tahajjud dan amal-amal soleh); mereka sentiasa berdoa kepada Tuhan mereka dengan perasaan takut (akan kemurkaanNya) serta dengan perasaan ingin memperolehi lagi (keredaanNya) dan mereka selalu pula mendermakan sebahagian dari apa yang Kami beri kepada mereka.",
                            "verse 32:17": "Maka tidak ada seseorang pun yang mengetahui satu persatu persediaan yang telah dirahsiakan untuk mereka (dari segala jenis nikmat) yang amat indah dipandang dan menggembirakan, sebagai balasan bagi amal-amal soleh yang mereka telah kerjakan.",
                            "verse 32:18": "(Jika demikian halnya) maka adakah orang yang beriman sama seperti orang yang fasik? Mereka tidaklah sama (dalam menerima balasan).",
                            "verse 32:19": "Adapun orang-orang yang beriman dan beramal soleh, maka mereka akan beroleh Syurga tempat tinggal yang tetap sebagai balasan bagi apa yang mereka telah kerjakan.",
                            "verse 32:20": "Dan sebaliknya orang-orang yang fasik, maka tempat kediaman mereka ialah Neraka; tiap-tiap kali mereka hendak keluar dari Neraka itu, mereka dikembalikan kepadanya, serta dikatakan kepada mereka: Rasalah azab Neraka yang kamu sentiasa mendustakannya di dunia dahulu.",
                            "verse 32:21": "Dan demi sesungguhnya, Kami akan merasakan mereka sedikit dari azab dunia sebelum azab yang besar (di akhirat kelak), supaya mereka rujuk kembali bertaubat.",
                            "verse 32:22": "Dan tidaklah ada yang lebih zalim daripada orang yang diberi ingat dengan ayat-ayat Tuhannya, kemudian dia berpaling daripadanya (dan tetap mengingkarinya).",
                            "verse 32:23": "Dan demi sesungguhnya! Kami telah memberi kepada Nabi Musa Kitab Taurat (sebagaimana Kami berikan Al-Quran kepadamu wahai Muhammad), maka janganlah engkau ragu-ragu menyambut dan menerimanya dan Kami jadikan Kitab Taurat itu hidayat penunjuk bagi kaum Bani Israil.",
                            "verse 32:24": "Dan Kami jadikan dari kalangan mereka beberapa pemimpin, yang membimbing kaum masing-masing kepada hukum agama Kami, selama mereka bersikap sabar (dalam menjalankan tugas itu) serta mereka tetap yakin akan ayat-ayat keterangan Kami.",
                            "verse 32:25": "(Pertentangan di antara satu golongan dengan yang lain itu) sesungguhnya Tuhanmu sahajalah yang akan memutuskan hukumNya di antara mereka pada hari kiamat, mengenai apa yang mereka berselisihan padanya.",
                            "verse 32:26": "Dan belumkah lagi ternyata kepada mereka (yang kafir itu): Bahawa Kami telah binasakan berapa banyak dari kaum-kaum yang kufur ingkar dahulu daripada mereka, padahal mereka sekarang berulang-alik melalui tempat-tempat tinggal kaum-kaum itu? Sesungguhnya kebinasaan kaum-kaum itu mengandungi keterangan-keterangan (untuk mengambil iktibar); oleh itu tidakkah mereka mahu mendengar (dan insaf)?",
                            "verse 32:27": "Dan tidakkah mereka (yang tidak mahu taat dan bersyukur) itu melihat bahawasanya Kami mengarahkan turunnya hujan ke bumi yang kering kontang, lalu Kami tumbuhkan dengan air hujan itu tanaman-tanaman, yang daripadanya dimakan oleh binatang-binatang ternak mereka dan mereka sendiri? Maka mengapa mereka tidak mahu memerhati (semuanya itu supaya taat dan bersyukur)?",
                            "verse 32:28": "Dan mereka bertanya: Bilakah datangnya hari pembukaan bicara yang dikatakan itu jika betul kamu orang-orang yang benar?",
                            "verse 32:29": "Katakanlah (wahai Muhammad): (Tidak perlu diketahui masa datangnya tetapi mesti dipercayai bahawa) pada hari pembukaan bicara itu, tidak ada gunanya lagi kepada orang-orang kafir kiranya mereka hendak beriman dan mereka pula tidak akan diberi tempoh (berbuat demikian).",
                            "verse 32:30": "Oleh itu, janganlah engkau hiraukan mereka dan tunggulah (kesudahan mereka), sesungguhnya mereka pun menunggu (kesudahanmu)."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "الم",
                            "verse 32:2": "اين كتابى است كه از سوى پروردگار جهانيان نازل شده، و شك و ترديدى در آن نيست!",
                            "verse 32:3": "ولى آنان مى‏گويند: «(محمد) آن را بدروغ به خدا بسته است‏»، اما اين سخن حقى است از سوى پروردگارت تا گروهى را انذار كنى كه پيش از تو هيچ انذاركننده‏اى براى آنان نيامده است، شايد (پند گيرند و) هدايت شوند!",
                            "verse 32:4": "خداوند كسى است كه آسمانها و زمين و آنچه را ميان اين دو است در شش روز ( شش دوران) آفريد، سپس بر عرش (قدرت) قرار گرفت; هيچ سرپرست و شفاعت كننده‏اى براى شما جز او نيست; آيا متذكر نمى‏شويد؟!",
                            "verse 32:5": "امور اين جهان را از آسمان به سوى زمين تدبير مى‏كند; سپس در روزى كه مقدار آن هزار سال از سالهايى است كه شما مى‏شمريد بسوى او بالا مى‏رود (و دنيا پايان مى‏يابد)",
                            "verse 32:6": "او خداوندى است كه از پنهان و آشكار با خبر است، و شكست‏ناپذير و مهربان است!",
                            "verse 32:7": "او همان كسى است كه هر چه را آفريد نيكو آفريد; و آفرينش انسان را از گل آغاز كرد;",
                            "verse 32:8": "سپس نسل او را از عصاره‏اى از آب ناچيز و بى‏قدر آفريد",
                            "verse 32:9": "سپس (اندام) او را موزون ساخت و از روح خويش در وى دميد; و براى شما گوش و چشمها و دلها قرار داد; اما كمتر شكر نعمتهاى او را بجا مى‏آوريد!",
                            "verse 32:10": "آنها گفتند: «آيا هنگامى كه ما (مرديم و) در زمين گم شديم، آفرينش تازه‏اى خواهيم يافت؟! س‏ذللّه ولى آنان لقاى پروردگارشان را انكار مى‏كنند (و مى‏خواهند با انكار معاد، آزادانه به هوسرانى خويش ادامه دهند)",
                            "verse 32:11": "بگو: «فرشته مرگ كه بر شما مامور شده، (روح) شما را مى‏گيرد; سپس شما را بسوى پروردگارتان بازمى‏گردانند»",
                            "verse 32:12": "و اگر ببينى مجرمان را هنگامى كه در پيشگاه پروردگارشان سر به زير افكنده، مى‏گويند: س‏خ‏للّهپروردگارا! آنچه وعده كرده بودى ديديم و شنيديم; ما را بازگردان تا كار شايسته‏اى انجام دهيم; ما (به قيامت) يقين داريم!»",
                            "verse 32:13": "و اگر مى‏خواستيم به هر انسانى هدايت لازمش را (از روى اجبار بدهيم) مى‏داديم; ولى (من آنها را آزاد گذارده‏ام و) سخن و وعده‏ام حق است كه دوزخ را (از افراد بى‏ايمان و گنهكار) از جن و انس همگى پر كنم!",
                            "verse 32:14": "(و به آنها مى‏گويم:) بچشيد (عذاب جهنم را)! بخاطر اينكه ديدار امروزتان را فراموش كرديد، ما نيز شما را فراموش كرديم; و بچشيد عذاب جاودان را به خاطر اعمالى كه انجام مى‏داديد!",
                            "verse 32:15": "تنها كسانى كه به آيات ما ايمان مى‏آورند كه هر وقت اين آيات به آنان يادآورى شود به سجده مى‏افتند و تسبيح و حمد پروردگارشان را بجا مى‏آورند، و تكبر نمى‏كنند",
                            "verse 32:16": "پهلوهايشان از بسترها در دل شب دور مى‏شود (و بپا مى‏خيزند و رو به درگاه خدا مى آورند) و پروردگار خود را با بيم و اميد مى‏خوانند، و از آنچه به آنان روزى داده‏ايم انفاق مى‏كنند!",
                            "verse 32:17": "هيچ كس نمى‏داند چه پاداشهاى مهمى كه مايه روشنى چشمهاست براى آنها نهفته شده، اين پاداش كارهائى است كه انجام مى‏دادند!",
                            "verse 32:18": "آيا كسى كه باايمان باشد همچون كسى است كه فاسق است؟! نه، هرگز اين دو برابر نيستند",
                            "verse 32:19": "اما كسانى كه ايمان آوردند و كارهاى شايسته انجام دادند، باغهاى بهشت جاويدان از آن آنها خواهد بود، اين وسيله پذيرايى (خداوند) از آنهاست به پاداش آنچه انجام مى‏دادند",
                            "verse 32:20": "و اما كسانى كه فاسق شدند (و از اطاعت خدا سرباز زدند)، جايگاه هميشگى آنها آتش است; هر زمان بخواهند از آن خارج شوند، آنها را به آن بازمى‏گردانند و به آنان گفته د: «بچشيد عذاب آتشى را كه انكار مى‏كرديد!»",
                            "verse 32:21": "به آنان از عذاب نزديك (عذاب اين دنيا) پيش از عذاب بزرگ (آخرت) مى‏چشانيم، شايد بازگردند!",
                            "verse 32:22": "چه كسى ستمكارتر است از آن كس كه آيات پروردگارش به او يادآورى شده و او از آن اعراض كرده است؟! مسلما ما از مجرمان انتقام خواهيم گرفت!",
                            "verse 32:23": "ما به موسى كتاب آسمانى داديم; و شك نداشته باش كه او آيات الهى را دريافت داشت; و ما آن را وسيله هدايت بنى اسرائيل قرار داديم!",
                            "verse 32:24": "و از آنان امامان (و پيشوايانى) قرار داديم كه به فرمان ما (مردم را) هدايت مى‏كردند; چون شكيبايى نمودند، و به آيات ما يقين داشتند",
                            "verse 32:25": "البته پروردگار تو ميان آنان روز قيامت در آنچه اختلاف داشتند داورى مى‏كند (و هر كس را به سزاى اعمالش مى‏رساند)!",
                            "verse 32:26": "آيا براى هدايت آنها همين كافى نيست كه افراد زيادى را كه در قرن پيش از آنان زندگى داشتند هلاك كرديم؟! اينها در مساكن (ويران شده) آنان راه مى‏روند; در اين آياتى است (از قدرت خداوند و مجازات دردناك مجرمان); آيا نمى‏شنوند؟!",
                            "verse 32:27": "آيا نديدند كه ما آب را بسوى زمينهاى خشك مى‏رانيم و بوسيله آن زراعتهايى مى‏رويانيم كه هم چهارپايانشان از آن مى‏خورند و هم خودشان تغذيه مى‏كنند; آيا نمى بينند؟!",
                            "verse 32:28": "آنان مى‏گويند: «اگر راست‏مى‏گوييد، اين پيروزى شما كى خواهد بود؟!»",
                            "verse 32:29": "بگو: «روز پيروزى، ايمان آوردن، سودى به حال كافران نخواهد داشت; و به آنها هيچ مهلت داده نمى‏شود!»",
                            "verse 32:30": "حال كه چنين است، از آنها روى بگردان و منتظر باش; آنها نيز منتظرند! (تو منتظر رحمت خدا و آنها هم منتظر عذاب او!)"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Alef, Lam, Mim.",
                            "verse 32:2": "Esta é a revelação do Livro indubitável, que emana do Senhor do Universo.",
                            "verse 32:3": "Ou dizem: ele o (Alcorão) tem forjado! Qual! É a verdade do teu Senhor, para que admoestes (com ele) um povo, ao qual antes de ti não chegou admoestador algum, para que se encaminhe.",
                            "verse 32:4": "Foi Deus Quem criou, em seis dias, os céus e a terra, e tudo quanto há entre ambos; logo assumiu o Trono.",
                            "verse 32:5": "Ele rege todos os assuntos, desde o céu até à terra; logo (tudo) ascenderá a Ele, em um dia cuja duração será de mil anos, de vosso cômputo.",
                            "verse 32:6": "Tal é (Deus), Conhecer do cognoscível e do incognoscível, o Poderoso, o Misericordiosíssimo,",
                            "verse 32:7": "Que aperfeiçoou tudo o que criou e iniciou a criação do primeiro homem, de barro.",
                            "verse 32:8": "Então, formou-lhe uma prole da essência de sêmen sutil.",
                            "verse 32:9": "Depois o modelou; então, alentou-o com Seu Espírito.",
                            "verse 32:10": "Dizem (os incrédulos): Quando formos consumidos pela terra, seremos, acaso, renovados em uma nova criatura? Qual? Eles negam o comparecimento ante o seu Senhor!",
                            "verse 32:11": "Dize-lhes: O anjo da morte, que foi designado para vos guardar, recolher-vos-á, e logo retornareis ao vosso Senhor.",
                            "verse 32:12": "Ah, se pudesses ver os pecadores, cabisbaixos, ante o seu Senhor! (Exclamarão): Ó Senhor nosso, agora temos olhos para ver e ouvidos para ouvir! Faze-nos retornar ao mundo, que praticaremos o bem, porque agora estamos persuadidos!",
                            "verse 32:13": "E se quiséssemos, teríamos iluminado todo o ser, porém, a Minha sentença foi pronunciada; sabei que encherei o inferno com gênios e humanos, todos juntos.",
                            "verse 32:14": "(Ser-lhes-á dito): Sofrei, pois, por terdes esquecido o comparecimento neste vosso dia! Em verdade, vos esqueceremos.",
                            "verse 32:15": "Somente crêem nos Nossos versículos aqueles que, quando eles lhos são recitados, se prostram em adoração e celebram os louvores de seu Senhor, sem, contudo, se ensoberbecerem.",
                            "verse 32:16": "São aqueles, cujo corpos não relutam em se afastar dos leitos para invocarem seu Senhor com temor e esperança, e que fazem caridade daquilo com que os agraciamos.",
                            "verse 32:17": "Nenhuma alma caridosa sabe que deleite para os olhos lhe está reservado, em recompensa pelo que fez.",
                            "verse 32:18": "Poderá, acaso, aquiparar-se ao fiel o ímpio? Jamais se equipararão!",
                            "verse 32:19": "Quanto aos fiéis, que tiverem praticado o bem, terão por abrigo jardins de aconchego, por tudo quanto fizeram.",
                            "verse 32:20": "Por outra, os depravados terão por morada o fogo infernal.",
                            "verse 32:21": "Em verdade, infligir-lhes-emos o castigo terreno, antes do castigo supremo, para que se arrependam.",
                            "verse 32:22": "E haverá alguém mais iníquo do que quem, ao ser exortado com os versículos do seu Senhor, logo os desdenha? Sabei que Nós puniremos os pecadores.",
                            "verse 32:23": "Já havíamos concedido o Livro a Moisés.",
                            "verse 32:24": "E designamos líderes dentre eles, os quais encaminham os demais segundo a Nossa ordem, porque perseveraram e se persuadiram dos Nossos versículos.",
                            "verse 32:25": "Certamente teu Senhor julgará entre eles, no Dia da Ressurreição, quanto àquilo a respeito do quê divergiam",
                            "verse 32:26": "Acaso, Ele não lhes evidenciou quantas gerações anteriores à deles temos exterminado, apesar de caminharem sobre as suas (antigas) moradas? Certamente, nisto há sinais.",
                            "verse 32:27": "Não reparam em que conduzimos a água à terra erma, fazendo com isso, brotar as semeaduras de que se nutrem eles e o seu gado? Não vêem, acaso?",
                            "verse 32:28": "E perguntam: Quando chegará essa vitória, se estiverdes certos?",
                            "verse 32:29": "Responde-lhes: No dia da vitória de nada valerá a fé tardia dos incrédulos, nem serão tolerados.",
                            "verse 32:30": "Afasta-te, pois deles, e espera, porque eles também não perdem por esperar."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 32:1": "Alif, Lam, Mim .",
                            "verse 32:2": "Revelarea acestei Cãrți este, fãrã îndoialã, de la Stãpânul lumilor.",
                            "verse 32:3": "Zic ei: “El a plãsmuit-o!” Dimpotrivã, ea este Adevãrul de la Domnul tãu, pentru ca tu sã previi un neam, cãruia nu i-a venit nici un prevenitor mai înainte de tine .",
                            "verse 32:4": "Allah este Cel care a creat cerurile și pãmântul, precum și ceea ce se aflã între ele, în șase zile, și apoi S-a așezat pe Tron .",
                            "verse 32:5": "El cârmuiește toate lucrurile din cer și de pre pãmânt.",
                            "verse 32:6": "Acesta este Știutorul lumii celor nevãzute și a celor vãzute, Atotputernic",
                            "verse 32:7": "Îndurãtor [Al-'Aziz, Ar-Rahim],",
                            "verse 32:8": "Care a fãcut desãvârșit tot ceea ce a creat.",
                            "verse 32:9": "a creat omul din lut , la început,",
                            "verse 32:10": "Apoi i-a fãcut pe urmașii lui dintr-o apã anume disprețuițã .",
                            "verse 32:11": "Apoi l-a plãsmuit pe el și a suflat în el duhul Sãu .",
                            "verse 32:12": "Și zic ei : “Oare când noi ne vom pierde în pãmânt, vom mai fi noi fãcuți din nou?” ,",
                            "verse 32:13": "dar ei nu cred în întâlnirea cu Domnul lor .",
                            "verse 32:14": "Spune: “Vã va lua îngerul morții cãruia i-au fost încredințate sufletele voastre, dar apoi veți fi aduși înapoi la Domnul vostru”.",
                            "verse 32:15": "Și de i-ai vedea tu pe nelegiuiți atunci cu capetele plecateînaintea Domnului lor, zicând: “Doamne, noi am vãzut și am auzit.",
                            "verse 32:16": "Dacã Noi am voi, i-am da fiecãrui suflet cãlãuzire, dar cuvântul Meu este adevãrat: “Voi umple Gheena cu djinni și oameni, adunați într-aolaltã!”",
                            "verse 32:17": "“Gustați, așadar, pentru cã voi ați uitat întâlnirea cu aceastã zi a voastrã! Și Noi v-am uitat pe voi! Gustați chinul cel veșnic pentru ceea ce ați fãcut!”",
                            "verse 32:18": "Ci numai aceia cred în versetele Noastre, care, atunci când ele lesunt pomenite, cad, prosternându-se , și aduc laudã și slavãDomnului lor, fãrã ca ei sã fie semeți ,",
                            "verse 32:19": "Când coastele lor pãrãsesc culcușurile, pentru a-L chema pe Domnul lor cu fricã și cu nãdejde și ei fac milostenie din cele cu care i-am înzestrat.",
                            "verse 32:20": "Dar nici un suflet nu știe ce-i este ascuns ca bucurie , drept rãsplatã pentru ceea ce au sãvârșit .",
                            "verse 32:21": "Dar oare cel care crede este asemenea cu cel nelegiuit? Nu, ei nu sunt deopotrivã!",
                            "verse 32:22": "În ce-i privește pe aceia care cred și sãvârșesc fapte bune, ei voravea parte de grãdinile Sãlașului ca rãsplatã pentru ceea ce ausãvârșit.",
                            "verse 32:23": "În ce-i privește pe aceia care sunt nelegiuiți, sãlașul lor va fi Foculși ori de câte ori vor încerca sã iasã din el , vor fi împinși înapoi în elși li se va zice lor: “Gustați chinul Foculu",
                            "verse 32:24": "Însã Noi le vom da lor sã guste din chinul cel mai apropiat , înainte de chinul cel mare , pentru ca ei sã se întoarcã .",
                            "verse 32:25": "Și cine este mai nelegiuit decât acela cãruia i se pomenescversetele Domnului sãu, iar el se întoarce apoi de la ele? Noi suntem pedepsitori fațã de cei nelegiuiți!",
                            "verse 32:26": "Noi i-am dat lui Moise Cartea - deci nu te îndoi de primirea ei! - și Noi am fãcut-o îndreptare pentru fiii lui Israel.",
                            "verse 32:27": "Și Noi am fãcut dintre ei ocârmuitori care sã cãlãuzeascã dupã porunca Noastrã, câtã vreme ei s-au arãtat statornici și au crezut cu tãrie în versetele Noastre.",
                            "verse 32:28": "Domnul tãu este Cel care va hotãrî între ei și în Ziua Învierii cu privire la cele asupra cãrora au pãreri deosebite.",
                            "verse 32:29": "Oare nu au luat ei pildã de la neamurile pe care Noi le-amfãcut sã piarã mai înainte de ei și prin ale cãror locuințe umblã? Întru aceasta sunt semne! Oare ei nu aud?",
                            "verse 32:30": "Oare ei nu vãd cã Noi mânãm apa în pãmântul cel uscat și din eafacem sã se iveascã semãnãturi , din care mãnâncã vitele lor și ei înșiși? Oare ei nu vãd?",
                            "verse 32:31": "Și ei zic : “Și când va fi aceastã victorie , dacã voi spunețiadevãrul?”",
                            "verse 32:32": "Spune: “În ziua victoriei nu le va fi de nici un folos credința ace- lora care nu cred și nu li se va da lor nici un rãgaz!”",
                            "verse 32:33": "Deci, întoarce-te de la ei și așteaptã , cãci ei sunt în aștep- tare! rãgaz!”"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 32:1": "Alif.",
                            "verse 32:2": "Pogorârea Cărţii, fără nici o îndoială, este de la Domnul lumilor.",
                            "verse 32:3": "Vor spune, oare: “El a născocit-o!” Ba nu! Această Carte este Adevărul de la Domnul tău ca tu să previi un popor la care nici un prevenitor nu a mai venit înaintea ta.",
                            "verse 32:4": "Dumnezeu este Cel ce a creat în şase zile cerurile, pământul şi ceea ce se află între ele, apoi s-a aşezat pe Tron.",
                            "verse 32:5": "El cârmuieşte totul de la cer la pământ, şi apoi totul se va ridica la El într-o Zi mare cât o mie de ani, după cum număraţi voi.",
                            "verse 32:6": "El cunoaşte tăinuitul şi mărturisitul.",
                            "verse 32:7": "care a făcut frumos ceea ce a creat şi care a început crearea omului din lut,",
                            "verse 32:8": "apoi i-a făcut pe urmaşii lui să iasă dintr-o apă lepădată.",
                            "verse 32:9": "El l-a desăvârşit şi a suflat în el din duhul Său.",
                            "verse 32:10": "Ei spun: “După ce ne vom fărâmiţa în ţărână, vom avea iarăşi o nouă făptură?”, căci ei nu cred în Întâlnirea cu Domnul lor.",
                            "verse 32:11": "Spune: “Îngerul morţii căruia i-aţi fost încredinţaţi vă va culege, apoi la Domnul vostru veţi fi întorşi.",
                            "verse 32:12": "O, dacă i-ai vedea atunci pe cei nelegiuiţi cu capetele plecate înaintea Domnului lor! “Domnul nostru! Am văzut şi am auzit.",
                            "verse 32:13": "Dacă am fi vrut, am fi dăruit fiecărui suflet călăuzirea.",
                            "verse 32:14": "Gustaţi că aţi uitat întâlnirea cu această zi a voastră.",
                            "verse 32:15": "Numai aceia cred în semnele Noastre, care se prosternează când le sunt amintite şi care-L preamăresc în laude pe Domnul lor şi nu se arată îngâmfaţi.",
                            "verse 32:16": "Ei se smulg din aşternuturile lor ca să-L cheme pe Domnul lor cu teamă şi râvnă şi dau milostenie din ceea ce i-am înzestrat.",
                            "verse 32:17": "Nici un suflet nu ştie ce bucurii îi sunt sortite ca răsplată a faptelor sale!",
                            "verse 32:18": "Credinciosul este deopotrivă cu cel stricat?! Nu, ei nu sunt deopotrivă!",
                            "verse 32:19": "Cei care cred şi săvârşesc fapte bune vor avea Grădinile Limanului ca loc de şedere pentru faptele lor,",
                            "verse 32:20": "iar cei stricaţi vor avea Focul ca liman.",
                            "verse 32:21": "Noi îi vom face să guste osânda cea blândă înainte de osânda cea mare.",
                            "verse 32:22": "Cine este mai nedrept decât cel care se întoarce de la semnele Domnului său după ce i-au fost amintite? Noi ne răzbunăm pe nelegiuiţi.",
                            "verse 32:23": "Noi am dăruit Cartea lui Moise — nu te îndoi că n-a primit-o — şi am rânduit-o călăuzire fiilor lui Israel.",
                            "verse 32:24": "Noi am făcut căpetenii dintre ei care să-i călăuzească din porunca Noastră, când erau răbdători şi credeau cu tărie în semnele Noastre.",
                            "verse 32:25": "Domnul tău va judeca între ei în Ziua Învierii şi le va desluşi de ce se învrăjbeau.",
                            "verse 32:26": "Oare nu le este învăţătură văzând câte leaturi am nimicit înaintea lor şi prin ale căror aşezăminte ei merg acum? Întru aceasta sunt semne! Ei nu aud, oare?!",
                            "verse 32:27": "Ei nu au văzut cum mânăm apa către ţinutul sterp şi facem să crească din el grâne din care mănâncă ei şi dobitoacele lor? Ei văd, oare?",
                            "verse 32:28": "Ei spun: “Când va veni biruinţa aceasta, dacă spuneţi adevărul?”",
                            "verse 32:29": "Spune: :”Ziua cuceririi nu slujeşte la nimic celor care nu au crezut, căci ei nu au nimic de aşteptat!”",
                            "verse 32:30": "Îndepărtează-te de ei şi aşteaptă! Căci şi ei aşteaptă."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Алеф — Ля –м — Ми –м.",
                            "verse 32:2": "Поистине, сомненья нет1770,Что Откровение сей Книги(Пришло) от Господа миров1771.",
                            "verse 32:3": "Иль они скажут:«Он1772 его измыслил!»О нет! Сие есть Истина,Пришедшая от Бога твоего,Чтоб ею ты увещевал людей,К которым до тебя не приходилнаставник1773,Чтобы могли они идти прямой стезею.",
                            "verse 32:4": "Аллах есть Тот, Кто небеса и землюсотворилИ все, что между ними,за шесть (небесных) дней1774И после утвердился на Престоле.",
                            "verse 32:5": "Он сводит Повеление Свое с небесна землю,И, (воплотившись на земле),Оно потом к Нему восходитВ какой-то День,Что мерится одною тысячью годовПо вашему (земному) счету.",
                            "verse 32:6": "Таков Он — Ведающий (все):Сокрытое (от вас)или (представленное) явно, —Могущ и милосерден Он,",
                            "verse 32:7": "Кто совершенный вид1775 придалвсему, что создал,Из глины начал сотвореньечеловека1776,",
                            "verse 32:8": "Потом продлил его потомствоИз капли жидкости презренной,",
                            "verse 32:9": "Потом Он выровнял его и соразмерил,От Духа Своего вдохнул,Дал зрение, и слух, и сердце1777, —И все ж как мало благодарны вы!",
                            "verse 32:10": "И говорят они:«Ужель когда мы затеряемсяв земле,Неужто в обновленном видеМы будем вновь воссозданы?»1778Увы! Они во встречу с Господомсвоим не верят.",
                            "verse 32:11": "Скажи (им): «Ангел смерти1779,Кому даны на попеченье вы,Приемлет душу вашу по кончине;Потом к Владыке своему вывозвратитесь».",
                            "verse 32:12": "И если б мог ты только видеть,Как головы (в бесчестье) склонятПреступные пред Господом своим:«Господь наш! Видели и слышалимы то,(О чем нас на земле предупреждали).",
                            "verse 32:13": "И если б Мы того желали,Мы б душу всякую вели прямым путем,Но Мое Слово было неизменно1780:«Я Ад людьми и джиннаминаполню — всеми вместе;",
                            "verse 32:14": "Вкусите же (плоды того),Что вы о встрече с этим Днем забыли!Теперь же Мы забудем вас, —Вкусите кару Вечности за все своидела!»",
                            "verse 32:15": "Ведь только те в знаменья Нашиверят,Кто при помине их ниц падаетИ воздает свои хвалы Аллаху —Не величаясь, не гордясь.",
                            "verse 32:16": "Они свои постели оставляют1781,И призывают Бога своегоИз страха (гнев Его навлечь),С надеждой (на Его благоволенье),И (щедро) раздают (на подать)(Из благ), что низвели Мы им.",
                            "verse 32:17": "И ни одна душа из них не знает,(Как много Божьей) благодатиЕще сокрыто взорам их1782В награду за их добрые деянья.",
                            "verse 32:18": "Так неужели тот, кто (всей душой)уверовал (в Аллаха),Сравни тому, кто предался’ греху?Нет, не равны они нисколько!",
                            "verse 32:19": "Тем, кто уверовал и доброе творил,Станут обителью сады Эдема —Как вечное пристанищеза праведность их дел.",
                            "verse 32:20": "Пристанищем же тем, кто былраспутен,Станет огонь (пылающего Ада),И всякий раз, как захотят они егопокинуть,Туда их возвратят опять и скажут:«Вкусите наказание Огнем,Который вы считали ложью!»",
                            "verse 32:21": "(Но прежде)1783Мы дадим вкусить им кару ближней(жизни),Прежде чем их подвергнутьвеличайшей (каре во второй),Чтобы могли покаяться они и (к Нам)вернуться.",
                            "verse 32:22": "И есть ли нечестивее того,Кому знаменья Господа егонапоминают,А он все ж отвращается от них?Поистине, Мы взыщем с грешниковсполна!",
                            "verse 32:23": "Мы прежде Мусе дали Книгу —Не будь в сомнении о встречес Ним —И сыновьям Исраиля назначили ееПутеводителем (по жизни)",
                            "verse 32:24": "И сделали из их числа имамов1784,Которые указывают путь по Нашимповеленьям,Пока живет в них стойкое терпенье,Пока в них убежденность естьВ Господнем (естестве) знамений.",
                            "verse 32:25": "В День Воскресения (на Суд)Господь твой, истинно, рассудитмежду нимиВсе то, в чем разошлись они1785.",
                            "verse 32:26": "Разве для них не стало поучительным(уроком),Сколько до них Мы погубилипоколений,По обиталищам которых они ходяти поныне?В этом, поистине, знамения для них, —Неужто им они не внемлют?",
                            "verse 32:27": "Разве не видно им,Как Мы на выжженную землю льемдождиИ ими взращиваем (хлебные) поляи нивы (травяные)И с них едят они и кормитсяих скот, —Неужто этого они не видят?",
                            "verse 32:28": "И говорят они:«Когда же будет этому развязка1786,Если вы правду говорите?»",
                            "verse 32:29": "Скажи (им): «В День РазвязкиНеверным не поможет вера их1787,Не будет им дано отсрочки».",
                            "verse 32:30": "Так отвернись от них и жди, —Ведь они тоже ждут!1788 отсрочки»."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "'lm.",
                            "verse 32:2": "La revelación de la Escritura, exenta de dudas, procede del Señor del universo.",
                            "verse 32:3": "O dicen: «Él la ha inventado».",
                            "verse 32:4": "Alá es Quien ha creado los cielos, la tierra y lo que entre ellos está en seis días.",
                            "verse 32:5": "Él dispone en el cielo todo lo de la tierra.",
                            "verse 32:6": "Tal es el Conocedor de lo oculto y de lo patente, el Poderoso, el Misericordioso,",
                            "verse 32:7": "Que ha hecho bien todo cuanto ha creado y ha comenzado la creación del hombre de arcilla",
                            "verse 32:8": "-luego, ha establecido su descendencia de una gota de líquido vil-;",
                            "verse 32:9": "luego, le ha dado forma armoniosa e infundido en él de Su Espíritu.",
                            "verse 32:10": "Dicen: «Cuando nos hayamos perdido en la tierra, ¿es verdad que se nos creará de nuevo?» No, no creen en el encuentro de su Señor.",
                            "verse 32:11": "Di: «El ángel de la muerte, encargado de vosotros, os llamara y, luego, seréis devueltos a vuestro Señor».",
                            "verse 32:12": "Si pudieras ver a los pecadores, cabizbajos ante su Señor: «¡Señor! ¡Hemos visto y oído! ¡Haznos volver para que hagamos obras buenas! ¡Estamos convencidos!»",
                            "verse 32:13": "Si hubiéramos querido, habríamos dirigido a cada uno.",
                            "verse 32:14": "¡Gustad, pues, por haber olvidado que os llegaría este día! Nosotros también os hemos olvidado.",
                            "verse 32:15": "Sólo creen en Nuestras aleyas quienes, al ser amonestados con ellas, caen al suelo en adoración y glorifican a su Señor, sin mostrarse altivos.",
                            "verse 32:16": "Se alzan del lecho para invocar a su Señor con temor y anhelo y dan limosna de lo que les hemos proveído.",
                            "verse 32:17": "Nadie sabe la alegría reservada a ellos en retribución a sus obras.",
                            "verse 32:18": "¿Es que el creyente es como el perverso? No son iguales.",
                            "verse 32:19": "Quienes crean y obren bien tendrán los jardines de la Morada como alojamiento en premio a sus obras.",
                            "verse 32:20": "Pero los que obren con perversidad tendrán el Fuego como morada.",
                            "verse 32:21": "Hemos de darles a gustar del castigo de aquí abajo antes del castigo mayor.",
                            "verse 32:22": "¿Hay alguien que sea más impío que quien, habiéndosele recordado los signos de su Señor, se desvía luego de ellos? Nos vengaremos de los pecadores.",
                            "verse 32:23": "Hemos dado a Moisés la Escritura -no dudes, pues, en encontrarle- e hicimos de ella dirección para los Hijos de Israel.",
                            "verse 32:24": "Elegimos de entre ellos a jefes que les dirigieran siguiendo Nuestra orden como premio por haber perseverado y por haber estado convencidos de Nuestros signos.",
                            "verse 32:25": "Tu Señor fallará entre ellos el día de la Resurrección sobre aquello en que discrepaban.",
                            "verse 32:26": "¿Es que no les dice nada que hayamos hecho perecer a tantas generaciones precedentes, cuyas viviendas huellan ellos ahora? Ciertamente, hay en ello signos.",
                            "verse 32:27": "¿Es que no ven cómo conducimos el agua a la tierra pelada y, gracias a ella, sacamos los cereales de que se alimentan sus rebaños y ellos mismos? ¿No verán, pues?",
                            "verse 32:28": "Y dicen: «¿Para cuándo ese fallo, si es verdad lo que decís?»",
                            "verse 32:29": "Di: «El día del fallo, la fe ya no aprovechará a los infieles y no les será dado esperar».",
                            "verse 32:30": "¡Apártate, pues, de ellos y espera! ¡Ellos esperan!"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "அலிஃப், லாம், மீம்.",
                            "verse 32:2": "அகிலங்களின் இறைவனிடம் இருந்து அருளப்பட்டுள்ளது - இவ்வேதம் என்பதில் சந்தேகமே இல்லை.",
                            "verse 32:3": "ஆயினும் அவர்கள் \"இவர் இதை இட்டுக்கட்டிக் (கற்பனை செய்து) கொண்டார்\" என்று (உம்மைப் பற்றிக்) கூறுகிறார்களா? அவ்வாறல்ல, எவர்களுக்கு உமக்கு முன் அச்சமூட்டி எச்சரிப்பவர் வந்ததில்லையோ, அந்த சமூகத்தாருக்கு, அவர்கள் நேர்வழியில் செல்லும் பொருட்டு நீர் அச்சமூட்டி எச்சரிக்கை செய்வதற்காக உம்முடைய இறைவனிடமிருந்து வந்துள்ள உண்மை(வேதமாகும்).",
                            "verse 32:4": "அல்லாஹ் தான் வானங்களையும், பூமியையும், இவ்விரண்டிற்கும் இடையிலிருப்பவற்றையும் ஆறு நாட்களில் படைத்துப்பின் அர்ஷின் மீது அமைந்தான்; அவனையன்றி உங்களுக்கு உதவியாளரோ, பரிந்து பேசுபவரோ இல்லை.",
                            "verse 32:5": "வானத்திலிருந்து பூமி வரையிலுமுள்ள காரியத்தை அவனே ஒழுங்குபடுத்துகிறான்; ஒரு நாள் (ஒவ்வொரு காரியமும்) அவனிடமே மேலேறிச் செல்லும், அந்த (நாளின்) அளவு நீங்கள் கணக்கிடக்கூடிய ஆயிரம் ஆண்டுகளாகும்.",
                            "verse 32:6": "அவனே மறைவானதையும், வெளிப்படையானதையும் நன்கு அறிந்தவன்; (அன்றியும் அவனே யாவற்றையும்) மிகைத்தவன்; அன்புடையோன்.",
                            "verse 32:7": "அவனே தான் படைத்துள்ள ஒவ்வொரு பொருளையும் அழகாக்கினான்; இன்னும், அவன் மனிதனின் படைப்பைக் களி மண்ணிலிருந்து ஆரம்பித்தான்.",
                            "verse 32:8": "பிறகு (நழுவும்) அற்பத் துளியாகிய (இந்திரிய) சத்திலிருந்து, அவனுடைய சந்ததியை உண்டாக்கினான்.",
                            "verse 32:9": "பிறகு அவன் அதைச் சரி செய்து, அதனுள்ளே தன் ரூஹிலிருந்தும் ஊதினான் - இன்னும் உங்களுக்கு அவன் செவிப்புலனையும், பார்வைப் புலன்களையும், இருதயங்களையும் அமைத்தான்; (இருப்பினும்) நீங்கள் நன்றி செலுத்துவது மிகச் சொற்பமேயாகும்.",
                            "verse 32:10": "\"நாம் பூமியில் அழிந்து போய் விடுவோமாயின் மெய்யாகவே நாங்கள் புதிய படைப்பாவோமா?\" எனவும் அவர்கள் கூறுகின்றனர்; ஏனெனில் அவர்கள் தங்கள் இறைவனைச் சந்திப்பதையே நிராகரிப்போராய் இருக்கிறார்கள்.",
                            "verse 32:11": "\"உங்கள் மீது நியமிக்கப்பட்டிருக்கும், \"மலக்குல் மவ்து\" தாம் உங்கள் உயிரைக் கைப்பற்றுவார் - பின்னர் நீங்கள் உங்கள் இறைவனிடம் மீள்விக்கப்படுவீர்கள்\" என்று (நபியே!) நீர் கூறும்.",
                            "verse 32:12": "மேலும், இக்குற்றவாளிகள் தம் இறைவன் முன் தலைகுனிந்தவர்களாய், \"எங்கள் இறைவா! நாங்கள் (இப்பொழுது) பார்த்துக் கொண்டோம், கேட்டும் கொண்டோம் - ஆகவே, நீ (உலகுக்கு) எங்களைத் திருப்பி அனுப்பிவை நாங்கள் நற்கருமங்களையே செய்வோம்.",
                            "verse 32:13": "மேலும் நாம் நாடியிருந்தால், ஒவ்வோர் ஆத்மாவுக்கும் அதற்குரிய நேர்வழியை நாம் கொடுத்திருப்போம்; ஆனால் \"நான் நிச்சயமாக நரகத்தை - ஜின்களையும், (தீய) மனிதர்களையும் - ஆகிய யாவரையும் கொண்டு நிரப்புவேன்\" என்று என்னிடமிருந்து (முன்னரே) வாக்கு வந்துள்ளது.",
                            "verse 32:14": "ஆகவே, உங்களுடைய இந்த நாளின் சந்திப்பை நீங்கள் மறந்திருந்ததின் (பலனை) அனுபவியுங்கள், நிச்சயமாக நாமும் உங்களை மறந்து விட்டோம்; மேலும் நீங்கள் செய்த (தீ) வினையின் பயனாக என்றென்றும் நிலையான வேதனையை அனுபவியுங்கள்\" (என்று அவர்களுக்குச் சொல்லப்படும்).",
                            "verse 32:15": "நம் வசனங்களின் மேல் நம்பிக்கை கொண்டோர் யாரென்றால் அவர்கள், அவற்றின் மூலம் நினைவூட்டப்பட்டால், அவர்கள் விழுந்து ஸுஜூது செய்தவர்களாய்த் தம் இறைவனைப் புகழ்ந்து, துதிப்பார்கள்; அவர்கள் பெருமை அடிக்கவும் மாட்டார்கள்.",
                            "verse 32:16": "அவர்களுடைய விலாக்களைப் படுக்கைகளிலிருந்து (தூக்கத்தைத் துறந்து) உயர்த்தி அவர்கள் தங்களுடைய இறைவனை அச்சத்தோடும் நம்பிக்கை ஆர்வத்தோடும் பிரார்த்தனை செய்வார்கள்; மேலும் நாம் அவர்களுக்கு அளித்ததிலிருந்து (தானதர்மங்களில்) செலவும் செய்வார்கள்.",
                            "verse 32:17": "அவர்கள் செய்த (நற்) கருமங்களுக்குக் கூலியாக மறைத்து வைக்கப்பட்டுள்ள கண் குளிர்ச்சியை (மறுமையின் பேரின்பத்தை) எந்த ஓர் ஆன்மாவும் அறிந்து கொள்ள முடியாது.",
                            "verse 32:18": "எனவே, (அத்தகைய) முஃமினானவர் (வரம்பு மீறிய) பாவியைப் போல் ஆவாரா? (இருவரும்) சமமாக மாட்டார்கள்.",
                            "verse 32:19": "எவர்கள் ஈமான் கொண்டு ஸாலிஹான (நல்ல) அமல்களைச் செய்கிறார்களோ அவர்களுக்கு அவர்கள் செய்யும் (நற்)கருமங்களின் காரணமாக சுவனபதிகள் தங்குமிடங்களாகி (அங்கு அவர்கள்) விருந்தினராய் (உப சரிக்கப்படுவார்கள்).",
                            "verse 32:20": "ஆனால் எவர்கள் (வரம்பு மீறிப்) பாவம் செய்தார்களோ, அவர்கள் தங்குமிடம் (நரக) நெருப்புத்தான் - அவர்கள் அதை விட்டு வெளியேற நாடும் போதெல்லாம், அதிலேயே மீண்டும் தள்ளப்பட்டு \"எதனை நீங்கள் பொய்ப்பித்துக் கொண்டிருந்தீர்களோ அந்த (நரக) நெருப்பின் வேதனையை அனுபவியுங்கள்\" என்று அவர்களுக்குச் சொல்லப்படும்.",
                            "verse 32:21": "மேலும், அவர்கள் (பாவங்களிலிருந்து) திரும்பி விடும் பொருட்டுப் பெரிய வேதனையை (மறுமையில் அவர்கள்) அடைவதற்கு முன்னதாகவே (இம்மையில்) சமீபமான ஒரு வேதனையை அவர்கள் அனுபவிக்கும்படிச் செய்வோம்.",
                            "verse 32:22": "எவன் தன்னுடைய இறைவனின் வசனங்களைக் கொண்டு நினைவு படுத்தப்பட்ட பின்னரும் அவற்றைப் புறக்கணித்து விடுகிறானோ, அவனைவிட அநியாயக்காரன் எவன் (இருக்கிறான்)? நிச்சயமாக நாம் (இத்தகைய) குற்றவாளிகளை தண்டிப்போம்.",
                            "verse 32:23": "நிச்சயமாக நாம் மூஸாவுக்கு (அவ்) வேதத்தைக் கொடுத்தோம்.",
                            "verse 32:24": "இன்னும் அவர்கள் பொறுமையுடனிருந்து, நம் வசனங்களை உறுதியாக நம்பி ஏற்றுக் கொண்ட போது, நம்முடைய கட்டளைப்படி நேர்வழி காட்டும் தலைவர்களை - இமாம்களை - அவர்களில் நின்றும் உண்டாக்கினோம்.",
                            "verse 32:25": "அவர்கள் எ(வ்விஷயத்)தில் அபிப்பிராய பேதம் கொண்டார்களோ, (அதுபற்றி) கியாம நாளில் உம்முடைய இறைவன் நிச்சயமாக அவர்களுக்கிடையில் தீர்ப்புச் செய்வான்.",
                            "verse 32:26": "இவர்களுக்கு முன்னர் நாம் எத்தனையோ தலைமுறையினரை அழித்திருப்பதும், அவர்கள் வசித்திருந்த இடங்களில் இவர்கள் நடந்து திரிவதும், இவர்களுக்கு நேர்வழியைக் காட்ட வில்லையா? நிச்சயமாக இதில் (தக்க) அத்தாட்சிகள் இருக்கின்றன.",
                            "verse 32:27": "அவர்கள் (இதையும்) கவனிக்கவில்லையா - நிச்சயமாக நாமே வரண்ட பூமியின் பக்கம் மேகங்கள் மூலமாக தண்ணீரை ஓட்டிச் சென்று அதன் மூலம் இவர்களும் இவர்களுடைய கால் நடைகளும் உண்ணக்கூடிய பயிர்களை வெளிப்படுத்துகிறோம்; அவர்கள் (இதை ஆய்ந்து) நோட்டமிட வேண்டாமா?",
                            "verse 32:28": "\"நீங்கள் உண்மையாளர்களாக இருந்தால் (வாக்களிக்கப்பட்ட) அந்த வெற்றித் (தீர்ப்பு நாள்) எப்பொழுது (வரும்)?\" என்று அவர்கள் கூறுகிறார்கள்.",
                            "verse 32:29": "\"அந்த வெற்றி(த் தீர்ப்பு) நாளின் போது நிராகரிப்போர், நம்பிக்கை கொள்வது அவர்களுக்கு பயன் அளிக்காது - அவர்களுகு;குத்தவணையும் கொடுக்கப்பட மாட்டாது.",
                            "verse 32:30": "ஆகவே, நீர் அவர்களைப் புறக்கணித்து (அந்நாளை) எதிர்பார்ப்பீராக! நிச்சயமாக அவர்களும் அதை எதிர்பார்ப்பவர்கள் தாம்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "อะลิฟ ลาม มีม",
                            "verse 32:2": "การประทานลงมาของคัมภีร์นี้ไม่มีข้อสงสัยใด ๆ ในนั้น จากพระเจ้าแห่งสากลโลก",
                            "verse 32:3": "หรือพวกเขากล่าวว่า เขา (มุฮัมมัด) ได้ปั้นแต่งคัมภีร์นี้ขึ้นมา แต่ว่าคัมภีร์นี้ คือ สัจธรรมจากพระเจ้าของเจ้า เพื่อเจ้าจักได้ตักเตือนกลุ่มชนหนึ่งที่มิได้มีผู้ตักเตือนคนใดมายังพวกเขาก่อนหน้าเจ้า หวังว่าพวกเขาจะได้อยู่ในแนวทางที่ถูกต้อง",
                            "verse 32:4": "อัลลอฮ์คือผู้ทรงสร้างชั้นฟ้าทั้งหลาย และแผ่นดิน และสิ่งที่อยู่ในระหว่างทั้งสองในเวลา 6 วัน แล้วพระองค์ทรงสถิตอยู่บนบัลลังก์ สำหรับพวกเจ้านั้นไม่มีผู้คุ้มครองและผู้ช่วยเหลืออื่นจากพระองค์ แล้วพวกเจ้ามิได้ใคร่ครวญบ้างดอกหรือ ?",
                            "verse 32:5": "พระองค์ทรงบริหารกิจการจากชั้นฟ้าสู่แผ่นดิน แล้วมันจะขึ้นไปสู่พระองค์ในวันหนึ่งซึ่งกำหนดของมันเท่ากับหนึ่งพันปีตามที่พวกเจ้านับ",
                            "verse 32:6": "นั่นคือพระผู้ทรงรอบรู้สิ่งเร้นลับ และเปิดเผย เป็นผู้ทรงอำนาจ ผู้ทรงเมตตาเสมอ",
                            "verse 32:7": "ผู้ทรงทำให้ทุกสิ่งที่พระองค์ทรงสร้างมันให้ดีงาม และพระองค์ทรงเริ่มการสร้างมนุษย์จากดิน",
                            "verse 32:8": "แล้วทรงให้การสืบตระกูล ของมนุษย์มาจากน้ำ (อสุจิ) อันไร้ค่า",
                            "verse 32:9": "แล้วทรงทำให้เขามีสัดส่วนที่สมบูรณ์ และทรงเป่ารูหฺ (วิญญาณ) ของพระองค์เข้าไปในเขาและทรงให้พวกเจ้าได้ยินและได้เห็นและให้มีจิตใจ (สติปัญญา) ส่วนน้อยเท่านั้นที่พวกเจ้าขอบคุณ",
                            "verse 32:10": "และพวกเขากล่าวกันว่า เมื่อเราได้สลายตัวลงสู่ใต้ผืนแผ่นดินไปแล้ว เราจะเกิดขึ้นมาใหม่กระนั้นหรือ แต่พวกเขาปฏิเสธต่อการพบพระเจ้าของพวกเขา",
                            "verse 32:11": "จงกล่าวเถิดมุฮัมมัด มะลักผู้ปลิดชีวิต ผู้ได้รับมอบหมายเกี่ยวกับพวกท่าน จะปลิดชีวิตของพวกท่าน แล้วพวกท่านจะถูกนำกลับไปยังพระเจ้าของพวกท่าน",
                            "verse 32:12": "และถ้าเจ้าได้เห็น เมื่อผู้กระทำผิดทั้งหลายก้มศีรษะของพวกเขาลง ณ ที่พระเจ้าของพวกเขา (พลางกล่าวว่า) ข้าแต่พระเจ้าของเรา เราได้เห็นแล้ว เราได้ยินแล้ว ขอได้ทรงโปรดส่งเรากลับไป (ยังโลกดุนยา) เพื่อเราจะได้กระทำความดี แท้จริงเราเป็นผู้มีความเชื่อมั่นแล้ว (ณบัดนี้)",
                            "verse 32:13": "และถ้าเราประสงค์ แน่นอนเราจะทำให้ทุกชีวิตสู่แนวทางที่ถูกต้องของมัน แต่ว่าคำสัญญาของข้าจะต้องสมจริง แน่นอนข้าจะให้นรกเต็มไปด้วยญินและมนุษย์รวมทั้งหมด",
                            "verse 32:14": "ดังนั้น พวกเจ้า (ชาวนรก) จงลิ้มรสเถิด เนื่องด้วยพวกเจ้าได้ลืมการชุมนุมกันในวันนี้ของพวกเจ้า แท้จริงเราก็ลืมพวกเจ้าด้วย และพวกเจ้าจงลิ้มรสการลงโทษอย่างตลอดกาลตามที่พวกเจ้าได้กระทำไว้เถิด",
                            "verse 32:15": "แท้จริงบรรดาผู้ศรัทธาต่ออายาตทั้งหลายของเราเท่านั้น ที่เมื่อพวกเขาถูกเตือนให้รำลึกถึงอายาต พวกเขา (ก็จะ) ก้มลงสุญูด และสดุดีสรรเสริญแด่พระจ้าของพวกเขา โดยที่พวกเขาไม่หยิ่งผยอง",
                            "verse 32:16": "สีข้างของพวกเขาเคลื่อนห่างจากที่นอน พลางวิงวอนต่อพระเจ้าของพวกเขาด้วยความกลัวและความหวัง และพวกเขาบริจาค สิ่งที่เราได้ให้เป็นเครื่องยังชีพแก่พวกเขา",
                            "verse 32:17": "ดังนั้น จึงไม่มีชีวิตใดรู้สิ่งที่ถูกซ่อนไว้สำหรับพวกเขา ให้เป็นที่รื่นรมย์แก่สายตา เป็นการตอบแทนในสิ่งที่พวกเขาได้กระทำไว้",
                            "verse 32:18": "ดังนั้น ผู้ศรัทธาจะเหมือนกับคนชั่วช้ากระนั้นหรือ? พวกเขาย่อมไม่เท่าเทียมกันแน่ ๆ",
                            "verse 32:19": "ส่วนบรรดาผู้ศรัทธาและกระทำความดีทั้งหลายนั้น สำหรับพวกเขาคือสวนสวรรค์หลากหลาย เป็นที่พำนักเตรียมไว้ตามที่พวกเขาได้กระทำไว้",
                            "verse 32:20": "และส่วนบรรดาผู้ชั่วช้านั้น ที่พำนักของพวกเขาคือไฟนรก คราใดที่พวกเขาต้องการจะออกไปจากมัน พวกเขาจะถูกบังคับให้เข้าไปในนั้นอีก และจะมีเสียงกล่าวแก่พวกเขาว่า จงลิ้มรสการลงโทษของไฟนรกซึ่งพวกท่านเคยปฏิเสธ ไม่เชื่อมัน",
                            "verse 32:21": "และแน่นอน เราจะให้พวกเขาได้ลิ้มรสการลงโทษอันใกล้ (ในโลกนี้) ก่อนการลงโทษอันยิ่งใหญ่ (ในปรโลก) เพื่อว่าพวกเขาจะกลับมาสำนึกผิด",
                            "verse 32:22": "และผู้ใดเล่าจะอธรรมยิ่งไปกว่าผู้ถูกเตือนให้รำลึกถึงอายาตทั้งหลายของพระเจ้าของเขา แล้วเขาก็ผินหลังให้กับอายาตเหล่านั้น แท้จริงเราเป็นผู้จองเวรบรรดาผู้กระทำผิด",
                            "verse 32:23": "และโดยแน่นอน เราได้ให้คัมภีร์แก่มูซา ดังนั้น เจ้า (มุฮัมมัด) อย่าอยู่ในการสงสัยต่อการพบมัน และเราได้ทำให้มัน (คัมภีร์อัตเรารอฮ์) เป็นแนวทางที่ถูกต้องแก่วงศ์วานของอิสรออีล",
                            "verse 32:24": "และเราได้จัดให้มีหัวหน้าจากพวกเขา เพื่อจะได้ชี้แนะแนวทางที่ถูกต้องตามคำบัญชาของเรา ในเมื่อพวกเขามีความอดทนและพวกเขาเชื่อมั่นต่ออายาตทั้งหลายของเรา",
                            "verse 32:25": "แท้จริงพระเจ้าของเจ้า พระองค์จะทรงตัดสินระหว่างพวกเขาในวันกิยามะฮ์ ในสิ่งที่พวกเขาขัดแย้งกันในเรื่องนั้น",
                            "verse 32:26": "ยังมิเป็นที่ประจักษ์ชัดแก่พวกเขาดอกหรือว่า กี่มากน้อยแล้วที่เราได้ทำลายประชาชาติก่อนหน้าของเขาไปหลายชั่วศตวรรษ โดยที่พวกเขา (กุฟฟารมักกะฮ์) ได้ไปพบเห็นมาในที่พำนักอาศัยของพวกเขา แท้จริง ในการนี้ย่อมเป็นสัญญาณอย่างมากหลาย แล้วพวกเขายังไม่เชื่อฟัง (ใคร่ครวญ) อีกหรือ",
                            "verse 32:27": "พวกเขาไม่เห็นดอกหรือว่า เราได้ให้น้ำไหลลงสู่แผ่นดินที่แห้งแล้ง แล้วด้วยมัน (น้ำ) เราได้ให้พืชผลงอกเงยออกมา เพื่อปศุสัตว์ของพวกเขาและตัวของพวกเขาเองได้กินจากมัน",
                            "verse 32:28": "และพวกเขากล่าวว่า เมื่อใดเล่าชัยชนะนี้ (จะเกิดขึ้นแก่พวกท่าน) หากพวกท่านเป็นผู้สัตย์จริง",
                            "verse 32:29": "จงกล่าวเถิดมุฮัมมัด วันแห่งชัยชนะนั้น การศรัทธาของบรรดาผู้ปฏิเสธศรัทธาจะไม่อำนวยประโยชน์แก่พวกเขาเลย และพวกเขาก็จะไม่ถูกให้ยืดเวลาออกไป",
                            "verse 32:30": "ดังนั้น จงผินหลังห่างออกจากพวกเขาเสียเถิด และจงคอยดู แท้จริงพวกเขาก็จะเป็นผู้คอยดู"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Elif.",
                            "verse 32:2": "Bu Kitab'ın, âlemlerin Rabbi tarafından indirilmiş olduğunda asla şüphe yoktur.",
                            "verse 32:3": "\"Onu Peygamber kendisi uydurdu\" diyorlar öyle mi? Hayır! O, senden önce kendilerine hiçbir uyarıcı (peygamber) gelmemiş bir kavmi uyarman için -doğru yolu bulalar diye- Rabbinden gönderilen hak (Kitap) tır.",
                            "verse 32:4": "Gökleri, yeri ve bunların arasındakileri altı günde (devirde) yaratan, sonra arşa istivâ eden Allah'tır.",
                            "verse 32:5": "Allah, gökten yere kadar her işi düzenleyip yönetir.",
                            "verse 32:6": "İşte, görülmeyeni de görüleni de bilen, mutlak galip ve merhamet sahibi O'dur.",
                            "verse 32:7": "O (Allah) ki, yarattığı her şeyi güzel yapmış ve ilk başta insanı çamurdan yaratmıştır.",
                            "verse 32:8": "Sonra onun zürryetini, dayanıksız bir suyun özünden üretmiştir.",
                            "verse 32:9": "Sonra onu tamamlayıp şekillendirmiş, ona kendi ruhundan üflemiştir.",
                            "verse 32:10": "\"Toprağın içinde kaybolduğumuz zaman, gerçekten (o vakit) biz mi yeniden yaratılacağız?\" derler.",
                            "verse 32:11": "De ki: Size vekil kılınan (bu konuda görevlendirilen) ölüm meleği canınızı alacak, sonra Rabbinize döndürüleceksiniz.",
                            "verse 32:12": "O günahkârların, Rableri huzurunda başlarını öne eğecekleri, \"Rabbimiz! Gördük duyduk, şimdi bizi (dünyaya) geri gönder de, iyi işler yapalım, artık kesin olarak inandık\" diyecekleri zamanı bir görsen!",
                            "verse 32:13": "Biz dilesek, elbette herkese hidayetini verirdik.",
                            "verse 32:14": "(O gün onlara şöyle diyeceğiz:) Bu güne kavuşmayı unutmanızın cezasını şimdi tadın bakalım! Doğrusu biz de sizi unuttuk; yaptıklarınızdan ötürü ebedî azabı tadın!",
                            "verse 32:15": "Bizim âyetlerimize ancak o kimseler inanırlar ki, bunlarla kendilerine öğüt verildiğinde, büyüklük taslamadan secdeye kapanırlar ve Rablerini hamd ile tesbih ederler.",
                            "verse 32:16": "Korkuyla ve umutla Rablerine yalvarmak üzere (ibadet ettikleri için), vücutları yataklardan uzak kalır ve kendilerine verdiğimiz rızıktan Allah yolunda harcarlar.",
                            "verse 32:17": "Yaptıklarına karşılık olarak, onlar için ne mutluluklar saklandığını hiç kimse bilemez.",
                            "verse 32:18": "Öyle ya, mümin olan, yoldan çıkmış kimse gibi midir? Bunlar elbette bir olamazlar.",
                            "verse 32:19": "İman edip de, iyi işler yapanlara gelince, onlar için yaptıklarına karşılık olarak varıp kalacakları cennet konakları vardır.",
                            "verse 32:20": "Yoldan çıkanlar ise, onların varacakları yer ateştir.",
                            "verse 32:21": "En büyük azaptan önce, onlara mutlaka en yakın azaptan tattıracağız; olur ki (imana) dönerler.",
                            "verse 32:22": "Kendisine Rabbinin âyetleri hatırlatıldıktan sonra onlardan yüz çevirenden daha zalim kim olabilir! Muhakkak ki biz, günahkârlara, lâyık oldukları cezayı veririz.",
                            "verse 32:23": "Andolsun biz Musa'ya Kitap verdik, -(Resûlüm!) sen ona kavuşacağından şüphe etme- ve onu İsrailoğullarına hidayet rehberi kıldık.",
                            "verse 32:24": "Sabrettikleri ve âyetlerimize kesinlikle inandıkları zaman, onların içinden, buyruğumuzla doğru yola ileten rehberler tayin etmiştik.",
                            "verse 32:25": "Muhakkak ki Rabbin, ihtilâf etmekte oldukları şeyler hakkında kıyamet günü onların aralarında hükmedecektir.",
                            "verse 32:26": "Halen yurtlarında gezip dolaştıkları kendilerinden önceki nice nesilleri helâk edişimiz onları doğru yola sevketmedi mi? Bunlarda elbette ibretler vardır.",
                            "verse 32:27": "Kupkuru yerlere suyu ulaştırdığımızı, onunla gerek hayvanlarının gerekse kendilerinin yiyegeldikleri ekini çıkarmakta olduğumuzu da görmediler mi? Hâla da göremeyecekler mi?",
                            "verse 32:28": "Eğer doğru söylüyorsanız, bu fetih (ve hüküm) günü hani ne zaman? derler.",
                            "verse 32:29": "De ki: Fetih (ve hüküm) gününde inkârcılara (o gün ettikleri) imanları fayda vermeyecek ve kendilerine mühlet de tanınmayacaktır!",
                            "verse 32:30": "Artık sen onları bırak ve bekle."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "الم",
                            "verse 32:2": "الف، لام، ميم (حقيقي معني ا? اور رسول صلي اللہ عليہ وآلہ وسلم ہي بہتر جانتے ہيں)o",
                            "verse 32:3": "اس کتاب کا اتارا جانا، اس ميں کچھ شک نہيں کہ تمام جہانوں کے پروردگار کي طرف سے ہےo",
                            "verse 32:4": "اس میں کچھ شک نہیں کہ اس کتاب کا نازل کیا جانا تمام جہان کے پروردگار کی طرف سے ہے",
                            "verse 32:5": "کیا یہ لوگ یہ کہتے ہیں کہ پیغمبر نے اس کو از خود بنا لیا ہے (نہیں) بلکہ وہ تمہارے پروردگار کی طرف سے برحق ہے تاکہ تم ان لوگوں کو ہدایت کرو جن کے پاس تم سے پہلے کوئی ہدایت کرنے والا نہیں آیا تاکہ یہ رستے پر چلیں",
                            "verse 32:6": "کيا کفار و مشرکين يہ کہتے ہيں کہ اسے اس (رسول) نے گھڑ ليا ہے? بلکہ وہ آپ کے رب کي طرف سے حق ہے تاکہ آپ اس قوم کو ڈر سنائيں جن کے پاس آپ سے پہلے کوئي ڈر سنانے والا نہيں آيا تاکہ وہ ہدايت پائيںo",
                            "verse 32:7": "اللہ ہي ہے جس نے آسمانوں اور زمين کو اور جو کچھ ان کے درميان ہے (اسے) چھ دنوں (يعني چھ مدتوں) ميں پيدا فرمايا پھر (نظام کائنات کے) عرش (اقتدار) پر (اپني شان کے مطابق) جلوہ افروز ہوا، تمہارے لئے اسے چھوڑ کر نہ کوئي کارساز ہے اور نہ کوئي سفارشي، سو کيا تم نصيحت قبول نہيں کرتےo",
                            "verse 32:8": "خدا ہی تو ہے جس نے آسمانوں اور زمین کو اور جو چیزیں ان دونوں میں ہیں سب کو چھ دن میں پیدا کیا پھر عرش پر جا ٹھہرا۔ اس کے سوا نہ تمہارا کوئی دوست ہے اور نہ سفارش کرنے والا۔ کیا تم نصیحت نہیں پکڑتے؟",
                            "verse 32:9": "وہی آسمان سے زمین تک (کے) ہر کام کا انتظام کرتا ہے۔ پھر وہ ایک روز جس کی مقدار تمہارے شمار کے مطابق ہزار برس ہوگی۔ اس کی طرف صعود (اور رجوع) کرے گا",
                            "verse 32:10": "وہ آسمان سے زمين تک نظام اقتدار کي تدبير فرماتا ہے پھر وہ امر اس کي طرف ايک دن ميں چڑھتا ہے (اور چڑھے گا) جس کي مقدار ايک ہزار سال ہے اس (حساب) سے جو تم شمار کرتے ہوo",
                            "verse 32:11": "وہي غيب اور ظاہر کا جاننے والا ہے، غالب و مہربان ہےo",
                            "verse 32:12": "یہی تو پوشیدہ اور ظاہر کا جاننے والا (اور) غالب اور رحم والا (خدا) ہے",
                            "verse 32:13": "جس نے ہر چیز کو بہت اچھی طرح بنایا (یعنی) اس کو پیدا کیا۔ اور انسان کی پیدائش کو مٹی سے شروع کیا",
                            "verse 32:14": "وہي ہے جس نے خوبي و حسن بخشا ہر اس چيز کو جسے اس نے پيدا فرمايا اور اس نے انساني تخليق کي ابتداء مٹي (يعني غير نامي مادّہ) سے کيo",
                            "verse 32:15": "پھر اس کي نسل کو حقير پاني کے نچوڑ (يعني نطفہ) سے چلاياo",
                            "verse 32:16": "پھر اس کی نسل خلاصے سے (یعنی) حقیر پانی سے پیدا کی",
                            "verse 32:17": "پھر اُس کو درست کیا پھر اس میں اپنی( طرف سے) روح پھونکی اور تمہارے کان اور آنکھیں اور دل بنائے مگر تم بہت کم شکر کرتے ہو",
                            "verse 32:18": "پھر اس (ميں اعضاء) کو درست کيا اور اس ميں اپني روحِ (حيات) پھونکي اور تمہارے لئے (رحمِ مادر ہي ميں پہلے) کان اور (پھر) آنکھيں اور (پھر) دل و دماغ بنائے، تم بہت ہي کم شکر ادا کرتے ہوo",
                            "verse 32:19": "اور کفار کہتے ہيں کہ جب ہم مٹي ميں مِل کر گم ہوجائيں گے تو (کيا) ہم اَز سرِ نَو پيدائش ميں آئيں گے، بلکہ وہ اپنے رب سے ملاقات ہي کے مُنکِر ہيںo",
                            "verse 32:20": "اور کہنے لگے کہ جب ہم زمین میں ملیامیٹ ہوجائیں گے تو کیا ازسرنو پیدا ہوں گے۔ حقیقت یہ ہے کہ یہ لوگ اپنے پروردگار کے سامنے جانے ہی کے قائل نہیں",
                            "verse 32:21": "کہہ دو کہ موت کا فرشتہ جو تم پر مقرر کیا گیا ہے تمہاری روحیں قبض کر لیتا ہے پھر تم اپنے پروردگار کی طرف لوٹائے جاؤ گے",
                            "verse 32:22": "آپ فرما ديں کہ موت کا فرشتہ جو تم پر مقرر کيا گيا ہے تمہاري روح قبض کرتا ہے پھر تم اپنے رب کي طرف لوٹائے جاؤ گےo",
                            "verse 32:23": "اور اگر آپ ديکھيں (تو ان پر تعجب کريں) کہ جب مُجرِم لوگ اپنے رب کے حضور سر جھکائے ہوں گے اور (کہيں گے:) اے ہمارے رب! ہم نے ديکھ ليا اور ہم نے سُن ليا، پس (اب) ہميں (دنيا ميں) واپس لوٹا دے کہ ہم نيک عمل کر ليں بيشک ہم يقين کرنے والے ہيںo",
                            "verse 32:24": "اور تم (تعجب کرو) جب دیکھو کہ گنہگار اپنے پروردگار کے سامنے سرجھکائے ہوں گے (اور کہیں گے کہ) اے ہمارے پروردگار ہم نے دیکھ لیا اور سن لیا تو ہم کو (دنیا میں) واپس بھیج دے کہ نیک عمل کریں بیشک ہم یقین کرنے والے ہیں",
                            "verse 32:25": "اور اگر ہم چاہتے تو ہر شخص کو ہدایت دے دیتے۔ لیکن میری طرف سے یہ بات قرار پاچکی ہے کہ میں دوزخ کو جنوں اور انسانوں سب سے بھردوں گا",
                            "verse 32:26": "اور اگر ہم چاہتے تو ہم ہر نفس کو اس کي ہدايت (اَز خود ہي) عطا کر ديتے ليکن ميري طرف سے (يہ) فرمان ثابت ہو چکا ہے کہ ميں ضرور سب (مُنکر) جنّات اور انسانوں سے دوزخ کو بھر دوں گاo",
                            "verse 32:27": "پس (اب) تم مزہ چکھو کہ تم نے اپنے اس دن کي پيشي کو بھلا رکھا تھا، بيشک ہم نے تم کو بھلا ديا ہے اور اپنے ان اعمال کے بدلے جو تم کرتے رہے تھے دائمي عذاب چکھتے رہوo",
                            "verse 32:28": "سو (اب آگ کے) مزے چکھو اس لئے کہ تم نے اُس دن کے آنے کو بھلا رکھا تھا (آج) ہم بھی تمہیں بھلا دیں گے اور جو کام تم کرتے تھے اُن کی سزا میں ہمیشہ کے عذاب کے مزے چکھتے رہو",
                            "verse 32:29": "ہماری آیتوں پر تو وہی لوگ ایمان لاتے ہیں کہ جب اُن کو اُن سے نصیحت کی جاتی ہے تو سجدے میں گرپڑتے اور اپنے پروردگار کی تعریف کے ساتھ تسبیح کرتے ہیں اور غرور نہیں کرتے",
                            "verse 32:30": "پس ہماري آيتوں پر وہي لوگ ايمان لاتے ہيں جنہيں اُن (آيتوں) کے ذريعے نصيحت کي جاتي ہے تو وہ سجدہ کرتے ہوئے گر جاتے ہيں اور اپنے رب کي حمد کے ساتھ تسبيح کرتے ہيں اور وہ تکبّر نہيں کرتےo",
                            "verse 32:31": "ان کے پہلو اُن کي خواب گاہوں سے جدا رہتے ہيں اور اپنے رب کو خوف اور اميد (کي مِلي جُلي کيفيت) سے پکارتے ہيں اور ہمارے عطا کردہ رزق ميں سے (ہماري راہ ميں) خرچ کرتے ہيںo",
                            "verse 32:32": "اُن کے پہلو بچھونوں سے الگ رہتے ہیں (اور) وہ اپنے پروردگار کو خوف اور اُمید سے پکارتے اور جو (مال) ہم نے اُن کو دیا ہے اس میں سے خرچ کرتے ہیں",
                            "verse 32:33": "کوئی متنفس نہیں جانتا کہ اُن کے لئے کیسی آنکھوں کی ٹھنڈک چھپا کر رکھی گئی ہے۔ یہ ان اعمال کا صلہ ہے جو وہ کرتے تھے",
                            "verse 32:34": "سو کسي کو معلوم نہيں جو آنکھوں کي ٹھنڈک ان کے لئے پوشيدہ رکھي گئي ہے، يہ ان (اَعمالِ صالحہ) کا بدلہ ہوگا جو وہ کرتے رہے تھےo",
                            "verse 32:35": "بھلا وہ شخص جو صاحبِ ايمان ہو اس کي مثل ہو سکتا ہے جو نافرمان ہو، (نہيں) يہ (دونوں) برابر نہيں ہو سکتےo",
                            "verse 32:36": "بھلا جو مومن ہو وہ اس شخص کی طرح ہوسکتا ہے جو نافرمان ہو؟ دونوں برابر نہیں ہو سکتے",
                            "verse 32:37": "جو لوگ ایمان لائے اور نیک عمل کرتے رہے اُن کے (رہنے کے) لئے باغ ہیں یہ مہمانی اُن کاموں کی جزا ہے جو وہ کرتے تھے",
                            "verse 32:38": "چنانچہ جو لوگ ايمان لائے اور نيک اعمال کرتے رہے تو ان کے لئے دائمي سکونت کے باغات ہيں، (اللہ کي طرف سے ان کي) ضيافت و اِکرام ميں اُن (اَعمال) کے بدلے جو وہ کرتے رہے تھےo",
                            "verse 32:39": "اور جو لوگ نافرمان ہوئے سو ان کا ٹھکانا دوزخ ہے? وہ جب بھي اس سے نکل بھاگنے کا ارادہ کريں گے تو اسي ميں لوٹا ديئے جائيں گے اور ان سے کہا جائے گا کہ اِس آتشِ دوزخ کا عذاب چکھتے رہو جِسے تم جھٹلايا کرتے تھےo",
                            "verse 32:40": "اور جنہوں نے نافرمانی کی اُن کے رہنے کے لئے دوزخ ہے جب چاہیں گے کہ اس میں سے نکل جائیں تو اس میں لوٹا دیئے جائیں گے۔ اور اُن سے کہا جائے گا کہ جس دوزخ کے عذاب کو تم جھوٹ سمجھتے تھے اس کے مزے چکھو",
                            "verse 32:41": "اور ہم اُن کو (قیامت کے) بڑے عذاب کے سوا عذاب دنیا کا بھی مزہ چکھائیں گے۔ شاید (ہماری طرف) لوٹ آئیں",
                            "verse 32:42": "اور ہم ان کو يقيناً (آخرت کے) بڑے عذاب سے پہلے قريب تر (دنيوي) عذاب (کا مزہ) چکھائيں گے تاکہ وہ (کفر سے) باز آجائيںo",
                            "verse 32:43": "اور اس شخص سے بڑھ کر ظالم کون ہو سکتا ہے جسے اس کے رب کي آيتوں کے ذريعے نصيحت کي جائے پھر وہ اُن سے منہ پھير لے، بيشک ہم مُجرموں سے بدلہ لينے والے ہيںo",
                            "verse 32:44": "اور اس شخص سے بڑھ کر ظالم کون جس کو اس کے پروردگار کی آیتوں سے نصیحت کی جائے تو وہ اُن سے منہ پھیر لے۔ ہم گنہگاروں سے ضرور بدلہ لینے والے ہیں",
                            "verse 32:45": "اور ہم نے موسٰی کو کتاب دی تو تم اُن کے ملنے سے شک میں نہ ہونا اور ہم نے اس (کتاب) کو (یا موسٰی کو) بنی اسرائیل کے لئے( ذریعہ) ہدایت بنایا",
                            "verse 32:46": "اور بيشک ہم نے موس?ي (عليہ السلام) کو کتاب (تورات) عطا فرمائي تو آپ ان کي ملاقات کي نسبت شک ميں نہ رہيں (وہ ملاقات آپ سے عنقريب شبِ معراج ہونے والي ہے) اور ہم نے اسے بني اسرائيل کے لئے ہدايت بناياo",
                            "verse 32:47": "اور ہم نے ان ميں سے جب وہ صبر کرتے رہے کچھ امام و پيشوا بنا ديئے جو ہمارے حکم سے ہدايت کرتے رہے اور وہ ہماري آيتوں پر يقين رکھتے تھےo",
                            "verse 32:48": "اور ان میں سے ہم نے پیشوا بنائے تھے جو ہمارے حکم سے ہدایت کیا کرتے تھے۔ جب وہ صبر کرتے تھے اور وہ ہماری آیتوں پر یقین رکھتے تھے",
                            "verse 32:49": "بلاشبہ تمہارا پروردگار ان میں جن باتوں میں وہ اختلاف کرتے تھے۔ قیامت کے روز فیصلہ کر دے گا",
                            "verse 32:50": "بيشک آپ کا رب ہي ان لوگوں کے درميان قيامت کے دن ان (باتوں) کا فيصلہ فرما دے گا جن ميں وہ اختلاف کيا کرتے تھےo",
                            "verse 32:51": "اور کيا انہيں (اس امر سے) ہدايت نہيں ہوئي کہ ہم نے اِن سے پہلے کتني ہي امّتوں کو ہلاک کر ڈالا تھا جن کي رہائش گاہوں ميں (اب) يہ لوگ چَلتے پِھرتے ہيں? بيشک اس ميں نشانياں ہيں، تو کيا وہ سنتے نہيں ہيںo",
                            "verse 32:52": "کیا اُن کو اس (امر )سے ہدایت نہ ہوئی کہ ہم نے اُن سے پہلے بہت سی اُمتوں کو جن کے مقامات سکونت میں یہ چلتے پھرتے ہیں ہلاک کر دیا۔ بیشک اس میں نشانیاں ہیں۔ تو یہ سنتے کیوں نہیں",
                            "verse 32:53": "کیا اُنہوں نے نہیں دیکھا کہ ہم بنجر زمین کی طرف پانی رواں کرتے ہیں پھر اس سے کھیتی پیدا کرتے ہیں جس میں سے ان کے چوپائے بھی کھاتے ہیں اور وہ خود بھی (کھاتے ہیں) تو یہ دیکھتے کیوں نہیں۔",
                            "verse 32:54": "اور کيا انہوں نے نہيں ديکھا کہ ہم پاني کو بنجَر زمين کي طرف بہا لے جاتے ہيں، پھر ہم اس سے کھيت نکالتے ہيں جس سے ان کے چوپائے (بھي) کھاتے ہيں اور وہ خود بھي کھاتے ہيں، تو کيا وہ ديکھتے نہيں ہيںo",
                            "verse 32:55": "اور کہتے ہيں: يہ فيصلہ (کا دن) کب ہوگا اگر تم سچے ہوo",
                            "verse 32:56": "اور کہتے ہیں اگر تم سچے ہو تو یہ فیصلہ کب ہوگا؟",
                            "verse 32:57": "کہہ دو کہ فیصلے کے دن کافروں کو ان کا ایمان لانا کچھ بھی فائدہ نہ دے گا اور نہ اُن کو مہلت دی جائے گی",
                            "verse 32:58": "آپ فرما ديں: فيصلہ کے دن نہ کافروں کو ان کا ايمان فائدہ دے گا اور نہ ہي انہيں مہلت دي جائے گيo",
                            "verse 32:59": "پس آپ اُن سے منہ پھير ليجئے اور انتظار کيجئے اور وہ لوگ (بھي) انتظار کر رہے ہيںo",
                            "verse 32:60": "تو اُن سے منہ پھیر لو اور انتظار کرو یہ بھی انتظار کر رہے ہیں ہيںo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 32:1": "Алиф.",
                            "verse 32:2": "Бу китобнинг нозил қилиниши, ҳеч шак-шубҳасиз, оламларнинг Робби томонидандир.",
                            "verse 32:3": "Ёки, унинг ўзи тўқиб олган, дейдиларми?! Йўқ! У сендан олдин ўзларига ҳеч огоҳлантиргувчи келмаган қавмни огоҳлантиришинг учун Роббингдан (келган) ҳақдир.",
                            "verse 32:4": "Аллоҳ осмонлару ерни ва улар орасидаги нарсаларни олти кунда яратиб, сўнгра аршни эгаллган зотдир.",
                            "verse 32:5": "У зот осмондан ергача барча ишнинг тадбирини қилур.",
                            "verse 32:6": "Ана шу Зот ғойибнию ҳозирни билгувчи, азизу раҳиймдир.",
                            "verse 32:7": "У Ўзи яратган ҳар бир нарсани гўзал этган ва инсонни яратишни лойдан бошлаган зотдир.",
                            "verse 32:8": "Сўнгра унинг наслини ҳақир бир сувдан ажраб чиқадиган қилди.",
                            "verse 32:9": "Сўнгра уни ростлади ва унинг ичига Ўз руҳидан пуфлади.",
                            "verse 32:10": "Улар: «Биз ер остида йўқ бўлиб кетгач ҳам, яна янгитдан яратиламизми?!» дерлар.",
                            "verse 32:11": "Сен: «Сизларга вакил қилинган ўлим фариштаси жонингизни оладир.",
                            "verse 32:12": "Гуноҳкорларнинг Роббилари ҳузурида бошларини эгиб туриб: »Эй Роббимиз, кўрдик, эшитдик.",
                            "verse 32:13": "Агар хоҳлаганимизда, ҳар бир жонга ўз ҳидоятини берар эдик.",
                            "verse 32:14": "«Бас, тотиб кўринглар, ушбу кунингизда учрашувни унутганингиз туфайли Биз ҳам сизни унутдик.",
                            "verse 32:15": "Албатта, Бизнинг оятларимизга уларла эслатма берилганда саждага йиқиладиган, Роббиларига ҳамд ила тасбиҳ айтадиган ва мутакаббирлик қилмайдиганларгина иймон келтирарлар.",
                            "verse 32:16": "Уларнинг ёнбошлари ётар жойдан йироқ бўлур.",
                            "verse 32:17": "Бас, ҳеч бир жон ўзлари учун қилиб ўтган амаллари мукофотига беркитиб қўйилган кўз қувончларини билмас.",
                            "verse 32:18": "Ахир, мўмин бўлган одам фосиқ бўлган одамдек бўладими?! Тенг бўлмаслар.",
                            "verse 32:19": "Ҳа, иймон келтириб, яхши амалларни қилганларга, бас, уларга қилиб ўтган амаллари учун жаннатул маъво манзилдир.",
                            "verse 32:20": "Аммо фосиқлик қилганлар эса, бас, уларнинг жойлари дўзахдир.",
                            "verse 32:21": "Албатта, Биз уларга буюк азобдан олдин яқин азобни тоттирамиз.",
                            "verse 32:22": "Роббининг оятлари ила эслатилган, сўнгра улардан юз ўгирган одамдан ҳам золимроқ одам борми?! Албатта, Биз жиноятчилардан интиқом олгувчилармиз.",
                            "verse 32:23": "Батаҳқиқ, Биз Мусога китобни бердик.",
                            "verse 32:24": "Ва сабр қилган пайтларида улардан Бизнинг амримиз ила ҳидоятга бошлайдиган пешволар чиқардик.",
                            "verse 32:25": "Албатта, Роббинг Ўзи қиёмат куни улар орасида ихтилоф қилган нарсалари тўғрисида ажрим қилур.",
                            "verse 32:26": "Ўзларидан олдин ўтган, масканларида юриб турганлари қанчадан-қанча аср(одам)ларини ҳалок қилганимиз уларни ҳидоятга бошламадими?! Албатта, бунда оят-белгилар бордир.",
                            "verse 32:27": "Бизнинг сувни қуруқ ерга ҳайдаб у билан чорвалари ва ўзлари ейдиган зироатни чиқаришимизни билмайдиларми?! Ахир, кўрмайдиларми?!",
                            "verse 32:28": "Улар: «Агар ростгўй бўлсаларингиз, бу фатҳ қачон бўлур?!» дерлар.",
                            "verse 32:29": "Сен: «Фатҳ куни куфр келтирганларга иймонлари манфаат бермас ва уларга муҳлат ҳам берилмас», деб айт.",
                            "verse 32:30": "Бас, улардан юз ўгир ва мунтазир бўл."
                        }
                    }
                }
            }
        }
    }
}