{
    "id": 45,
    "name_simple": "Al-Jathiyah",
    "revelation_place": "makkah",
    "revelation_order": 65,
    "bismillah_pre": true,
    "verses_count": 37,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "It is derived from the sentence wa tartt kullu ummat- in jathiyat-un of verse 28, implying thereby that it is the Surah in which the word jathiyah has occurred.",
    "text": [
        "\n",
        "It is derived from the sentence wa tartt kullu ummat- in jathiyat-un of verse 28, implying thereby that it is the Surah in which the word jathiyah has occurred.",
        "\n",
        "Period of Revelation",
        "\n",
        "The period of the revelation of this Surah also has not been mentioned in any authentic tradition, but its subject matter clearly shows that it was revealed consecutively after Surah Ad Dukhan. The close resemblance between the contents of the two Surahs makes them look like the twin Surahs.",
        "\n",
        "Subject Matter and Topics",
        "\n",
        "It answers the doubts and objections of the disbelievers of Makkah about Tauhid and the Hereafter and warns them for their attitude that they had adopted against the message of the Qur'an.",
        "\n",
        "The discourse begins with the arguments for Tauhid. In this connection, reference has been made to the count- less Signs that are found in the world, from man's own body to the earth and heavens, and it is pointed out that everywhere around him man finds things which testify to Tauhid which he refuses to acknowledge. If man sees carefully the variety of animals, the day and night, the rainfall and the vegetation thereby, the winds and his own creation, and ponders over them intelligently, without prejudice, he will find these Signs sufficiently convincing of the truth that this universe is not Godless, nor under the control of many gods, but it has been created by One God, and He alone is its Controller and Ruler. However, the case of the person who is determined not to acknowledge and wants to remain involved in doubts and suspicions is different. He cannot be blessed with the faith and conviction from anywhere in the world.",
        "\n",
        "A little below, in the beginning of the second section, it has been reiterated that the things man is exploiting in the world, and the countless forces and agencies that are serving his interests in the universe, did not come into being just accidentally, nor have they been provided by the gods and goddesses, but it is One God alone, Who has supplied and subjected these to him from Himself. If only a person uses his mind properly and rightly, his own intellect will proclaim that God alone is man's real Benefactor and He alone deserves that man should pay obeisance to Him.",
        "\n",
        "After this, the disbelievers of Makkah have been taken to task and reproved for their stubbornness, arrogance, mockery and insistence on disbelief with which they were resisting the invitation of the Qur'an they have been warned that this Qur'an has brought the same blessing which had been granted to the children of Israel before, by virtue of which they became distinguished above all the people of the world. Then, when they failed to recognize the true worth of this blessing and disputed their religion and lost it, this blessing now has been sent to them. This is such a code of guidance which shows the clear highway of Religion to man. The people who would turn it down by their own folly, would only prepare for their own doom, and only such people would become worthy of God's succour and mercy who would adopt obedience to it and lead a life of piety and righteousness.",
        "\n",
        "In this connection, the followers of the Holy Prophet have been instructed that they should forbear and pardon the absurd and foolish behavior towards them of the people fearless of God, for if they showed patience God Himself would deal with their opponents and would reward them for their fortitude.",
        "\n",
        "Then, there is a criticism of the erroneous ideas that the disbelievers hold about the Hereafter. They said that life was only this worldly life there was no life hereafter. Man dies in the course of time just as a watch stops functioning suddenly. The body is not survived by any soul, which might be seized and then breathed again into the human body some time in the future. In this regard, they challenged the Holy Prophet, saying: \"If you lay a claim to this, then raise our dead forefathers back to life.\" In answer to this, Allah has given the following arguments:",
        "\n",
        "\n\n\"You do not say this on the basis of any knowledge but are uttering this grave thing on the basis of conjecture. Do you really have the knowledge that there is no other life after death, and the souls are not seized but are annihilated?\"\n\n\n\"Your this claim rests mainly on this that you have not seen any dead person rising back to life and returning to the world. Is this basis strong enough for a person to make a claim that the dead people will never rise to life?When you do not experience and observe a thing, does it mean that you have the knowledge that it does not exist at all?\n\n\nIt is utterly against reason and justice that the good and the bad, the obedient and the disobedient, the oppressor and the oppressed, should be made equal ultimately. Neither a good act should bear a good result nor an evil act an evil result; neither the grievances of the oppressed be redressed nor the oppressor be punished, but everyone should meet with the same fate ultimately. Whoever has formed this view about the universe of God, has formed a patently wrong view. The unjust and wicked people adopt this view because they do not want to face the evil results of their deeds, but this world of God is not a lawless kingdom; it is rather a system based on the Truth, in which there can be no question of the injustice of regarding the good and the bad as equal.\n\n\nThat the creed of the denial of the Hereafter is highly destructive of morals. This is adopted only by such people as are the slaves of their lusts, and for the reason that they should have full freedom to serve their lusts. Then, when they have adopted this creed, it goes on making them more and more perverse till at last their moral sense becomes dead and all avenues of guidance are closed against them.\n\n",
        "\n",
        "After giving these arguments Allah says most emphatically: \"Just as you did not become living of your own accord, but became living by Our power, so you do not die of your own accord, but die when We send death on you. And a time is certainly coming when you will all be gathered together. If you do not believe in this because of your ignorance and folly today, you may not; when the time arrives, you will see for yourself that you are present before your God and your whole book of conduct is ready accurately, which bears evidence against each of your misdeeds. Then you will come to know how dearly has your denial of the Hereafter and your mockery of it cost you.\"",
        "\n"
    ],
    "description": "The surah that mentions The Kneeling of every community around the brink of Hellfire on the Day of Doom in wait of its divine judgment. It takes its name from the word “kneeling” (jāthiyah) in verse 28. The surah addresses some of the arguments put forward by those sceptical of the truthfulness of the Quran. Emphasis is placed on the signs of God’s existence discernible in nature, and on the painful punishment that awaits the doubters on the Day of Judgement. The misguided arrogance of the disbelievers (verse 8 and verse 31) is contrasted with God’s true greatness (verse 37); references to God’s wisdom and majesty open and close the surah.The surah is also known as: Bowing the Knee, Crouching, Hobbling, The Kneeling, The Kneeling Down.",
    "name_complex": "Al-Jâthiyah",
    "surah_name_ar": "الجاثية",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 45:1": "Hâ, Mîm.",
                            "verse 45:2": "(Kjo është) Shpallja e Librit të Perëndisë, të Plotëfuqishëm dhe të Gjithëdijshëm!",
                            "verse 45:3": "Me të vërtetë, në qiej dhe në Tokë ekzistojnë dokumente për ata që besojnë,",
                            "verse 45:4": "edhe në krijimin tuaj dhe të shtazëve, të shpërndara (nëpër Tokë), ka argument për popullin që beson me këmbëngulje;",
                            "verse 45:5": "edhe në ndërrimin e natës dhe të ditës, dhe në shiun që e lëshon Perëndia prej qielli e që me të e gjallëron tokën, pas thatësisë së saj, edhe ndërrimit të erërave, ka argumente për njerëzit që mendojnë.",
                            "verse 45:6": "Këto janë argumentet e Perëndisë, të cilat Ne ty t’i tregojmë me tërë të vërtetën, e në çfarë fjale, pos Allahut (Kur’anit) dhe argumenteve të Tij, do të besojnë ata?!",
                            "verse 45:7": "Mjerë për çdo gënjeshtar, mëkatar (të madh)!",
                            "verse 45:8": "(i cili) dëgjon argumentet e Perëndisë që i lexohen, e përsëri është mendjemadh (e duke mos pranuar), thuajse nuk i ka dëgjuar ato, sihariqoje atë me dënim të dhembshëm!",
                            "verse 45:9": "E, kur të njohtohet me diçka nga ajetet Tona, ai ato – i përqeshë.",
                            "verse 45:10": "Para tyre është xhehennemi, dhe nuk do t’ju ndihmojë asgjë ng ato që kanë fituar, as ata (idhujtë) që i kanë marrë, pos Perëndisë, për mbrojtës! Ata i pret mundim i madh.",
                            "verse 45:11": "Ky është (Kur’ani) udhërrëfyes në rrugën e drejtë, e ata që nuk besojnë argumentet e Zotit të tyre, për ta ka mundim të madh, të dhembshëm.",
                            "verse 45:12": "Perëndia është Ai që ju ka nënshtruar juve detin, që, nëpë të me urdhërin e Tij, të lundrojnë anijet, për t’i kërkur dhuntitë e Tij dhe për të qenë ju mirënjohës.",
                            "verse 45:13": "Dhe ju ka nënshtruar juve çka gjendet në qiej dhe në Tokë, të gjitha janë prej Tij.",
                            "verse 45:14": "Thuaju (o Muhammed!) besimtarëve që t’i falin ata që nuk shpresojnë në ditët e Perëndisë, në të cilën njerëzit do të shpërblehen sipas veprave të tyre.",
                            "verse 45:15": "Kush bën mirë, e ka për vete (dobi), e kush bën keq – bënë kundër vetes, e në fund do të ktheheni (të gjithë) te Zoti juaj.",
                            "verse 45:16": "Ne, me të vërtetë, u kemi dhënë bijve të Israelit Librin, pushtetin dhe profetninë dhe i kemi furnizuar me gjëra të bukura, dhe i kemi ngritur at ambi të gjithë popujt tjerë (të asaj kohe),",
                            "verse 45:17": "dhe, u kemi dhënë argumente të qarta mbi besimin, e ata u përçanë, mu atëherë, kur u erdhi dijenia, pasiqë patën armiqësi në mes tyre.",
                            "verse 45:18": "E, pastaj, Ne ty ta kemi bërë një rrugë të drejtë (të mrekullueshme) të fesë, andaj ndiqe atë dhe mos shko pas kënaqësive të atyre që nuk dinë!",
                            "verse 45:19": "Me të vërtetë, ata nuk do të mund të ndihmojnë (ty) asgjë te Perëndia.",
                            "verse 45:20": "Ky Kur’an është argument i qartë (dritë e shpëtimit) udhërrëfyes dhe mëshirë për njerëzit që besojnë paluhatshëm.",
                            "verse 45:21": "A mendojnë ata që bëjnë vepra të këqia se, Ne, do t’i bëjmë të njëjtë me ata që kanë besuar dhe që kanë bërë vepra të mira, se jeta dhe vdekja e tyre do të jetë e njëjtë? Sa gjykim i keq që është ky!",
                            "verse 45:22": "E, Perëndia, krijoi qiej dhe Tokë me qëllim të plotë, në mënyrë që çdo njeri të jetë i shpërblyer (apo i dënuar) për atë që ka punuar.",
                            "verse 45:23": "A e ke parë atë, që kënaqësinë e vet e ka marrë për zot, dhe Perëndia, e ka lënë në humbje duke e ditur (të keqen e tij) dhe ia ka vulosur të dëgjuarit e tij dhe zemrën e tij, e para syve të tij ka vënë perde? Kush do ta udhëzojë atë, pos Perëndisë? A nuk po kuptoni?",
                            "verse 45:24": "E, ata thonë: “Ekziston vetëm jeta e kësaj bote, vdesim (shumë si fëmijë) dhe jetojmë (një kohë), e vetëm koha na shkatërron”.",
                            "verse 45:25": "E, kur t’ju tregohen atyre ajetet Tona të qarta, ata nuk kanë tjetër shprehje, pos fjalës së tyre: “Ringjallni të parët tanë, nëse e thoni të vërtetën!”",
                            "verse 45:26": "Thuaju (atyre): “Perëndia ju ngjallë (u jep jetën), pastaj ju vdes, e mandej do t’ju tubojë në Ditën e Kijametit, në këtë nuk ka kurrfarë dyshimi, por (këtë) shumica e njerëzve nuk e dinë”.",
                            "verse 45:27": "Të Perëndisë janë pushteti i qiejve dhe i Tokës! E, kur të arrijë Dita e Kijametit, atë ditë të këqinjtë do të humbin.",
                            "verse 45:28": "Dhe, të gjithë popujt do t’i shohësh të gjunjëzuar; çdo popull do të thirret në Librin e vet: “Sot do të shpërbleheni për atë që keni bërë.",
                            "verse 45:29": "Ky është Libri Ynë që do t’ju tregojë të vërtetën.",
                            "verse 45:30": "E, sa i përket atyre që kanë besuar dhe kanë bërë vepra të mira, ata, do t’i shpie Zoti i tyre në mëshirën e Vet (xhennet).",
                            "verse 45:31": "E, sa i përket mohuesve, (atyre do t’ju thuhet): “Vallë, a nuk u janë lexuar ajetet e Mia, por ju u mendjemadhëruat dhe u bëtë popull mëkatarë”.",
                            "verse 45:32": "Kur të thuhet: “Me të vërtetë, premtimi i Perëndisë është i sigurt, dhe se për Ditën e Kijametit s’ka kurrfarë dyshimi! – ju thatë: “Na nuk dimë çka është Dita e Kijametit, na për këtë kemi vetëm një parafytyrim, na nuk jemi të bindur (për këtë).",
                            "verse 45:33": "Dhe, atyre do t’u dalin në shesh të këqit që i kanë bërë, e do t’i kaplojë dënimi për atë që talleshin,",
                            "verse 45:34": "dhe, (atyre) u thuhet: “Ne sot po ju qesim në harresë, ashtu siç e keni lënë ju në harresë takimin e kësaj dite.",
                            "verse 45:35": "Ky dënim është ngase i keni përqeshur argumentet e Perëndisë, e jeta e kësaj bote ju ka mashtruar.",
                            "verse 45:36": "Falenderimi i përket vetëm Perëndisë.",
                            "verse 45:37": "Atij i përket tërë madhështia në qiej dhe në Tokë."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Ha, Mim!",
                            "verse 45:2": "Kitabın (Qur'anın) nazil edilməsi yenilməz qüvvət, hikmət sahibi (olan Allah) tərəfindəndir.",
                            "verse 45:3": "Həqiqətən, göylərdə və yerdə mö'minlər üçün ibrətlər vardır!",
                            "verse 45:4": "Sizin yaradılışınızda və (Allahın yer üzünə) yayıb səpələdiyi canlılarda tam yəqinliklə inanlar üçün (Allahın birliyinə, qüdrət və əzəmətinə, qiyamət gününün haqq olmasına dəlalət edən) əlamətlər vardır.",
                            "verse 45:5": "Gecə və gündüzün bir-birinin ardınca gəlib-getməsində, Allahın ruzi vermək üçün göydən yağış yağdırmasında, onun vasitəsilə yeri ölümündən (quruduqdan) sonra diriltməsində və küləkləri (müxtəlif tərəflərə) yönəltməsində ağılla düşünənlər üçün (Allahın hər şeyə qadir olmasını sübut edən) dəlillər vardır.",
                            "verse 45:6": "(Ya Peyğəmbər!) Bunlar Allahın ayələridir (qüdrət nişanələridir).",
                            "verse 45:7": "Yalana dadanmış, günaha düşkün hər kəsin vay halına!",
                            "verse 45:8": "O, Allahın ayələrini özünə oxunduğunu eşidir, sonra guya onları eşitmirmiş kimi (Allahın əmrinə qarşı) təkəbbür göstərərək (küfründə) israr edib durur.",
                            "verse 45:9": "O, ayələrimizdən bir şey öyrənib bildiyi zaman onu lağa qoyur.",
                            "verse 45:10": "Qarşıda (öləndən sonra) onları Cəhənnəm gözləyir.",
                            "verse 45:11": "Bu (Qur'an) bir hidayətdir.",
                            "verse 45:12": "Gəmilərin Onun əmri ilə dənizdə üzməsi və sizin də Onun lütfündən (orada) ruzi axtarmanız üçün dənizi sizə ram edən Allahdır! Bəlkə, şükür edəsiniz!",
                            "verse 45:13": "Göylərdə və yerdə nə varsa, hamısını öz tərəfindən sizin ixtiyarınıza qoyan da Odur.",
                            "verse 45:14": "(Ya Peyğəmbər!) İman gətirənlərə de ki, Allah etdiyi əməllərə görə hər hansı bir qövmün cəzasını (özü) versin deyə, Allahın (əzab) günlərindən qorxmayanları (əzab günlərinə, qiyamətə inanmadıqları üçün gözləməyənləri) bağışlasınlar! (Bu ayənin hökmü sonralar cihad haqqındakı ayə ilə ləğv edilmişdir).",
                            "verse 45:15": "Kim yaxşı bir iş görsə, xeyiri özünə, kim də bir pislik etsə, zərəri özünə olar! Sonra siz öz Rəbbinizə doğru qaytarılacaqsınız.",
                            "verse 45:16": "And olsun ki, Biz İsrail oğullarına Kitab, hikmət (Tövratda olmayan hökmlər, yaxud mübahisəli məsələləri ədalətlə həll etmək bacarığı) və peyğəmbərlik əta etmiş, onlara pak ne'mətlərdən ruzi vermiş və onları aləmlərə (zəmanələrindəki bəşər övladına) üstün etmişdik.",
                            "verse 45:17": "Onlara din işində (dini məsələlərdə və ya Muhəmməd əleyhissəlamın peyğəmbər göndəriləcəyi barədə) açıq-aşkar dəlillər vermişdik.",
                            "verse 45:18": "Sonra (ya Rəsulum!) səni də dində şəriət sahibi (bir şəriət üzrə qaim) etdik.",
                            "verse 45:19": "Şübhəsiz ki, onlar Allahdan gələcək bir şeyi (bəlanı, əzabı) səndən dəf edə bilməzlər.",
                            "verse 45:20": "Bu (Qur'an) insanlar üçün bəsirət gözü, (axirətə) tam yəqinliklə inanan bir qövm üçün də hidayət (doğru yolu göstərən rəhbər) və mərhəmətdir!",
                            "verse 45:21": "Yoxsa dünyada pis əməllər edənlər (axirətdə) onları iman gətirib yaxşı işlər görənlərlə bir tutacağımızı, onların həyatlarının və ölümlərinin eyni olacağını güman edirlər?! Onlar nə pis mühakimə yürüdürlər! (Dünyada naz-ne'mət içində yaşayan kafirlər: \"Əgər qiyamət günü, axirət doğrudursa, Allah bizə orada da firavan həyat bəxş edəcəkdir!\" - deyirlər.",
                            "verse 45:22": "Allah göyləri və yeri haqq-ədalətlə və hər kəsin qazandığı nə isə onun müqabilində əvəz (qarşılıq) görməsi üçün yaratmışdır.",
                            "verse 45:23": "(Ya Peyğəmbər!) Nəfsini özünə tanrı edən və Allahın bilərəkdən (onu hələ yaratmamışdan gələcəkdə kafir olacağını bildiyi üçün) yoldan çıxartdığı, qulağını və qəlbini möhürlədiyi, gözünə də pərdə çəkdiyi kimsəni gördünmü? Allahdan başqa kim onu doğru yola sala bilər?! Məgər düşünüb ibrət almırsınız? (Haqqı bildiyi halda küfr edənin cəzası, haqqı bilmədən, cahilliyi üzündən küfr edənin cəzasından daha ağırdır.",
                            "verse 45:24": "(Qiyaməti inkar edənlər) belə deyirlər: \"Dünya həyatımızdan başqa heç bir həyat yoxdur; ölürük və dirilirik (biri ölür, digəri anadan olur; biz ölürük, övladlarımız, nəslimiz isə yaşayır); bizi öldürən ancaq dəhrdir (zamanın gərdişi, ömür müddətidir; yaşa dolub qocalmağımızdır).",
                            "verse 45:25": "(Qiyamətə dair) ayələrimiz onlara açıq-aşkar oxunduğu (söyləndiyi) zaman onların dəlili: \"Əgər doğru deyirsinizsə, (vəfat etmiş) atalarımızı (dirildib) gətirin görək!\" - deməkdən başqa bir şey deyildir.",
                            "verse 45:26": "(Ya Peğəmbər!) De: \"Allah sizi dirildir, sonra öldürür.",
                            "verse 45:27": "Göylərin və yerin hökmü ancaq Allahın əlindədir.",
                            "verse 45:28": "(Ya Peyğəmbər! O gün) hər ümməti diz çökmüş (yaxud bir yerə yığılmış) görəcəksən.",
                            "verse 45:29": "Bu Bizim kitabımızdır (sizin əməl dəftərinizdir).",
                            "verse 45:30": "İman gətirib yaxşı əməl edənlərə gəldikdə, Rəbbi onları ?z mərhəmətinə (Cənnətə) qovuşduracaqdır.",
                            "verse 45:31": "Kafir olanlara isə (belə deyiləcəkdir): \"Məgər ayələrim (dünyada) sizə oxunmurdumu?! Amma siz (onlara qulaq asmağa, iman gətirməyə) təkəbbür göstərdiniz və günahkar bir tayfa oldunuz!",
                            "verse 45:32": "(Sizə: ) \"Allahın (ölüləri dirildəcəyi barədəki) və'di haqdır və o saata (qiyamətin qopacağına) heç bir şəkk-şübhə yoxdur!\" - deyildiyi zaman: \"O saat nədir, bilmirik! Onun ancaq bir zənn (güman) olduğu qənaətindəyik.",
                            "verse 45:33": "(O gün dünyada etdikləri) pis əməllərinin cəzası onların gözünə görünəcək və istehza etdikləri (əzab) onları saracaqdır!",
                            "verse 45:34": "(Onlara belə) deyiləcəkdir: \"Siz bu gününüzə qovuşacağınızı (dünyada) unutduğunuz kimi, Biz də bu gün sizi unudacağıq (əbədi əzab içində buraxacağıq).",
                            "verse 45:35": "Bu (əzab) ona görədir ki, siz Allahın ayələrini lağa qoyurdunuz; dünya həyatı sizi aldatmışdı!\" Bu gün onlar (Cəhənnəmdən) çıxarılmayacaq və onlardan (Allahı razı salan) heç bir üzrxahlıq (tövbə də) qəbul olunmaycaqdır!",
                            "verse 45:36": "(Və'dinə sadiq qalaraq mö'min bəndələrinə verdiyi ne'mətlərə və kafirləri, azğınları düçar etdiyi əzaba görə) göylərin Rəbbi, yerin Rəbbi və aləmlərin Rəbbi olan Allaha həmd olsun!",
                            "verse 45:37": "Göylərdə və yerdə böyüklük (ululuq yalnız) Ona məxsusdur."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Ha Mim.",
                            "verse 45:2": "Knjigu objavljuje Allah, Silni i Mudri!",
                            "verse 45:3": "Na nebesima i na Zemlji, zaista, postoje dokazi za one koji vjeruju;",
                            "verse 45:4": "i stvaranje vas i životinja koje je razasuo dokazi su za ljude koji su čvrsto ubijeđeni;",
                            "verse 45:5": "i smjena noći i dana i kiša, koju Allah s neba spušta da pomoću nje zemlju, nakon mrtvila njezina, oživi i promjena vjetrova - dokazi su za ljude koji imaju pameti.",
                            "verse 45:6": "To su Allahovi dokazi koje ti kao istinu navodimo pa u koje će - ako ne u Allahove riječi i dokaze Njegove oni vjerovati?",
                            "verse 45:7": "Teško svakom lašcu, velikom grješniku!",
                            "verse 45:8": "On čuje Allahove riječi kada mu se kazuju, pa opet ostaje ohol kao da ih čuo nije - njemu patnju neizdrživu navijesti!",
                            "verse 45:9": "A kad sazna za neke Naše ajete, on im se ruga.",
                            "verse 45:10": "Pred njima je Džehennem, i ni od kakve koristi im neće biti ono što su stekli, ni kumiri koje su, pored Allaha, prihvatili; njih čeka muka golema.",
                            "verse 45:11": "Ovaj Kur’an je prava uputa, a one koji ne vjeruju u dokaze Gospodara svoga čeka patnja nesnosna.",
                            "verse 45:12": "Allah vam daje da se morem koristite da bi lađe, voljom Njegovom, po njemu plovile, da biste mogli tražiti blagodati Njegove i da biste bili zahvalni.",
                            "verse 45:13": "I daje vam da se koristite onim što je na nebesima i onim što je na Zemlji, sve je od Njega.",
                            "verse 45:14": "Reci vjernicima da oproste onima koji ne očekuju Allahove dane u kojima će On nagraditi ljude za ono što su radili.",
                            "verse 45:15": "Onaj koji čini dobro - sebi ga čini, a onaj ko radi zlo - radi protiv sebe, a na kraju ćete se Gospodaru svome vratiti.",
                            "verse 45:16": "Sinovima Israilovim smo Knjigu i vlast i vjerovjesništvo dali i lijepim jelima smo ih bili opskrbili, i iznad svih naroda ih uzdigli,",
                            "verse 45:17": "i jasne dokaze o vjeri smo im dali, a oni su se podvojili baš onda kad su do saznanja došli, i to zbog neprijateljstva i međusobne zavisti.",
                            "verse 45:18": "A tebi smo poslije odredili da u vjeri ideš pravcem određenim, zato ga slijedi i ne povodi se za strastima onih koji ne znaju,",
                            "verse 45:19": "jer te oni nikako ne mogu od Allahove kazne odbraniti; nevjernici jedni druge štite, a Allah štiti one koji Ga se boje i grijeha klone.",
                            "verse 45:20": "Ovaj Kur’an je putokaz ljudima i uputstvo i milost onima koji čvrsto vjeruju.",
                            "verse 45:21": "Misle li oni koji čine zla djela, da ćemo s njima postupiti jednako kao sa onima koji vjeruju i dobra djela čine, da će im život i smrt biti isti? Kako loše rasuđuju!",
                            "verse 45:22": "A Allah je nebesa i Zemlju mudro stvorio i zato da bi svaki čovjek bio nagrađen ili kažnjen prema onome što je zaslužio, nikome neće biti učinjeno nažao.",
                            "verse 45:23": "Reci ti Meni ko će uputiti onoga koji je strast svoju za boga svoga uzeo, onoga koga je Allah, znajući ga, u zabudi ostavio i sluh njegov i srce njegovo zapečatio, a pred oči njegove koprenu stavio? Ko će mu, ako neće Allah,",
                            "verse 45:24": "Postoji samo naš život zemaljski, živimo i umiremo, jedino nas vrijeme uništi - govore oni.",
                            "verse 45:25": "A kad im se ajeti Naši jasni kazuju, samo se ovim riječima izgovaraju: \"Pretke naše u život povratite, ako je istina to što govorite.",
                            "verse 45:26": "Reci: \"Allah vam daje život, zatim će učiniti da poumirete, a poslije će vas na Sudnjem danu sabrati, u to nema nikakve sumnje, ali većina ljudi ne zna.",
                            "verse 45:27": "Allahova je vlast na nebesima i na Zemlji! A na dan kada nastupi Čas oživljenja, oni koji su laži slijedili biće izgubljeni.",
                            "verse 45:28": "I vidjećeš sve narode kako na koljenima kleče; svaki narod biće prozvan prema svojoj Knjizi: \"Danas ćete biti nagrađeni ili kažnjeni prema tome kako ste postupali!",
                            "verse 45:29": "Ova Knjiga Naša o vama će samo istinu reći, jer smo naredili da se zapiše sve što ste radili.",
                            "verse 45:30": "One koji su vjerovali i dobra djela činili, Gospodar njihov će u Džennet Svoj uvesti.",
                            "verse 45:31": "A onima koji nisu vjerovali: \"Zar vam ajeti Moji nisu kazivani, ali vi ste se oholili i narod nevjernički postali.",
                            "verse 45:32": "Kad se govorilo: ’Allahovo obećanje je, zaista, istina i u Čas oživljenja nema nimalo sumnje!’ - vi ste govorili: ’Mi ne znamo šta je Čas oživljenja, mi samo zamišljamo, mi nismo ubijeđeni’\";",
                            "verse 45:33": "i ukazaće im se gnusna djela njihova i sa svih strana će ih okružiti ono čemu su se rugali,",
                            "verse 45:34": "i reći će se: \"Danas ćemo mi vas zaboraviti kao što ste vi zaboravili da ćete ovaj vaš Dan doživjeti, vatra će vam prebivalište biti i niko vam neće moći pomoći",
                            "verse 45:35": "zato što ste se Allahovim riječima rugali i što vas je život na Zemlji bio obmanuo.",
                            "verse 45:36": "Pa, neka je hvaljen Allah, Gospodar nebesa i Gospodar Zemlje, Gospodar svih svjetova!",
                            "verse 45:37": "Njemu ponos i dika na nebesima i na Zemlji, On je Silni i Mudri! svjetova!"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "হা-মীম।",
                            "verse 45:2": "পরাক্রান্ত, প্রজ্ঞাময় আল্লাহর পক্ষ থেকে অবতীর্ণ এ কিতাব।",
                            "verse 45:3": "নিশ্চয় নভোমন্ডল ও ভূ-মন্ডলে মুমিনদের জন্যে নিদর্শনাবলী রয়েছে।",
                            "verse 45:4": "আর তোমাদের সৃষ্টিতে এবং চারদিকে ছড়িয়ে রাখা জীব জন্তুর সৃজনের মধ্যেও নিদর্শনাবলী রয়েছে বিশ্বাসীদের জন্য।",
                            "verse 45:5": "দিবারাত্রির পরিবর্তনে, আল্লাহ আকাশ থেকে যে রিযিক (বৃষ্টি) বর্ষণ করেন অতঃপর পৃথিবীকে তার মৃত্যুর পর পুনরুজ্জীবিত করেন, তাতে এবং বায়ুর পরিবর্তনে বুদ্ধিমানদের জন্যে নিদর্শনাবলী রয়েছে।",
                            "verse 45:6": "এগুলো আল্লাহর আয়াত, যা আমি আপনার কাছে আবৃত্তি করি যথাযথরূপে। অতএব, আল্লাহ ও তাঁর আয়াতের পর তারা কোন কথায় বিশ্বাস স্থাপন করবে।",
                            "verse 45:7": "প্রত্যেক মিথ্যাবাদী পাপাচারীর দুর্ভোগ।",
                            "verse 45:8": "সে আল্লাহর আয়াতসমূহ শুনে, অতঃপর অহংকারী হয়ে জেদ ধরে, যেন সে আয়াত শুনেনি। অতএব, তাকে যন্ত্রণাদায়ক শাস্তির সুসংবাদ দিন।",
                            "verse 45:9": "যখন সে আমার কোন আয়াত অবগত হয়, তখন তাকে ঠাট্টারূপে গ্রহণ করে। এদের জন্যই রয়েছে লাঞ্ছনাদায়ক শাস্তি।",
                            "verse 45:10": "তাদের সামনে রয়েছে জাহান্নাম। তারা যা উপার্জন করেছে, তা তাদের কোন কাজে আসবে না, তারা আল্লাহর পরিবর্তে যাদেরকে বন্ধুরূপে গ্রহণ করেছে তারাও নয়। তাদের জন্যে রয়েছে মহাশাস্তি।",
                            "verse 45:11": "এটা সৎপথ প্রদর্শন, আর যারা তাদের পালনকর্তার আয়াতসমূহ অস্বীকার করে, তাদের জন্যে রয়েছে কঠোর যন্ত্রণাদায়ক শাস্তি।",
                            "verse 45:12": "তিনি আল্লাহ যিনি সমুদ্রকে তোমাদের উপকারার্থে আয়ত্বাধীন করে দিয়েছেন, যাতে তাঁর আদেশক্রমে তাতে জাহাজ চলাচল করে এবং যাতে তোমরা তাঁর অনুগ্রহ তালাশ কর ও তাঁর প্রতি কৃতজ্ঞ হও।",
                            "verse 45:13": "এবং আয়ত্ত্বাধীন করে দিয়েছেন তোমাদের, যা আছে নভোমন্ডলে ও যা আছে ভূমন্ডলে; তাঁর পক্ষ থেকে। নিশ্চয় এতে চিন্তাশীল সম্প্রদায়ের জন্যে নিদর্শনাবলী রয়েছে।",
                            "verse 45:14": "মুমিনদেরকে বলুন, তারা যেন তাদেরকে ক্ষমা করে, যারা আল্লাহর সে দিনগুলো সম্পর্কে বিশ্বাস রাখে না যাতে তিনি কোন সম্প্রদায়কে কৃতকর্মের প্রতিফল দেন।",
                            "verse 45:15": "যে সৎকাজ করছে, সে নিজের কল্যাণার্থেই তা করছে, আর যে অসৎকাজ করছে, তা তার উপরই বর্তাবে। অতঃপর তোমরা তোমাদের পালনকর্তার দিকে প্রত্যাবর্তিত হবে।",
                            "verse 45:16": "আমি বনী ইসরাঈলকে কিতাব, রাজত্ব ও নবুওয়ত দান করেছিলাম এবং তাদেরকে পরিচ্ছন্ন রিযিক দিয়েছিলাম এবং বিশ্ববাসীর উপর শ্রেষ্ঠত্ব দিয়েছিলাম।",
                            "verse 45:17": "আরও দিয়েছিলাম তাদেরকে ধর্মের সুস্পষ্ট প্রমাণাদি। অতঃপর তারা জ্ঞান লাভ করার পর শুধু পারস্পরিক জেদের বশবর্তী হয়ে মতভেদ সৃষ্টি করেছে। তারা যে বিষয়ে মতভেদ করত, আপনার পালনকর্তা কেয়ামতের দিন তার ফয়সালা করে দেবেন।",
                            "verse 45:18": "এরপর আমি আপনাকে রেখেছি ধর্মের এক বিশেষ শরীয়তের উপর। অতএব, আপনি এর অনুসরণ করুন এবং অজ্ঞানদের খেয়াল-খুশীর অনুসরণ করবেন না।",
                            "verse 45:19": "আল্লাহর সামনে তারা আপনার কোন উপকারে আসবে না। যালেমরা একে অপরের বন্ধু। আর আল্লাহ পরহেযগারদের বন্ধু।",
                            "verse 45:20": "এটা মানুষের জন্যে জ্ঞানের কথা এবং বিশ্বাসী সম্প্রদায়ের জন্য হেদায়েত ও রহমত।",
                            "verse 45:21": "যারা দুস্কর্ম উপার্জন করেছে তারা কি মনে করে যে, আমি তাদেরকে সে লোকদের মত করে দেব, যারা ঈমান আনে ও সৎকর্ম করে এবং তাদের জীবন ও মুত্যু কি সমান হবে? তাদের দাবী কত মন্দ।",
                            "verse 45:22": "আল্লাহ নভোমন্ডল ও ভূ-মন্ডল যথাযথভাবে সৃষ্টি করেছেন, যাতে প্রত্যেক ব্যক্তি তার উপার্জনের ফল পায়। তাদের প্রতি যুলুম করা হবে না।",
                            "verse 45:23": "আপনি কি তার প্রতি লক্ষ্য করেছেন, যে তার খেয়াল-খুশীকে স্বীয় উপাস্য স্থির করেছে? আল্লাহ জেনে শুনে তাকে পথভ্রষ্ট করেছেন, তার কান ও অন্তরে মহর এঁটে দিয়েছেন এবং তার চোখের উপর রেখেছেন পর্দা। অতএব, আল্লাহর পর কে তাকে পথ প্রদর্শন করবে? তোমরা কি চিন্তাভাবনা কর না?",
                            "verse 45:24": "তারা বলে, আমাদের পার্থিব জীবনই তো শেষ; আমরা মরি ও বাঁচি মহাকালই আমাদেরকে ধ্বংস করে। তাদের কাছে এ ব্যাপারে কোন জ্ঞান নেই। তারা কেবল অনুমান করে কথা বলে।",
                            "verse 45:25": "তাদের কাছে যখন আমার সুস্পষ্ট আয়াতসমূহ পাঠ করা হয়, তখন একথা বলা ছাড়া তাদের কোন মুক্তিই থাকে না যে, তোমরা সত্যবাদী হলে আমাদের পূর্বপুরুষদেরকে নিয়ে আস।",
                            "verse 45:26": "আপনি বলুন, আল্লাহই তোমাদেরকে জীবন দান করেন, অতঃপর মৃত্যু দেন, অতঃপর তোমাদেরকে কেয়ামতের দিন একত্রিত করবেন, যাতে কোন সন্দেহ নেই। কিন্তু অধিকাংশ মানুষ বোঝে না।",
                            "verse 45:27": "নভোমন্ডল ও ভূ-মন্ডলের রাজত্ব আল্লাহরই। যেদিন কেয়ামত সংঘটিত হবে, সেদিন মিথ্যাপন্থীরা ক্ষতিগ্রস্ত হবে।",
                            "verse 45:28": "আপনি প্রত্যেক উম্মতকে দেখবেন নতজানু অবস্থায়। প্রত্যেক উম্মতকে তাদের আমলনামা দেখতে বলা হবে। তোমরা যা করতে, অদ্য তোমারদেরকে তার প্রতিফল দেয়া হবে।",
                            "verse 45:29": "আমার কাছে রক্ষিত এই আমলনামা তোমাদের সম্পর্কে সত্য কথা বলবে। তোমরা যা করতে আমি তা লিপিবদ্ধ করতাম।",
                            "verse 45:30": "যারা বিশ্বাস স্থাপন করেছে ও সৎকর্ম করেছে, তাদেরকে তাদের পালনকর্তা স্বীয় রহমতে দাখিল করবেন। এটাই প্রকাশ্য সাফল্য।",
                            "verse 45:31": "আর যারা কুফর করেছে, তাদেরকে জিজ্ঞাসা করা হবে, তোমাদের কাছে কি আয়াতসমূহ পঠিত হত না? কিন্তু তোমরা অহংকার করছিলে এবং তোমরা ছিলে এক অপরাধী সম্প্রদায়।",
                            "verse 45:32": "যখন বলা হত, আল্লাহর ওয়াদা সত্য এবং কেয়ামতে কোন সন্দেহ নেই, তখন তোমরা বলতে আমরা জানি না কেয়ামত কি ? আমরা কেবল ধারণাই করি এবং এ বিষয়ে আমরা নিশ্চিত নই।",
                            "verse 45:33": "তাদের মন্দ কর্ম গুলো তাদের সামনে প্রকাশ হয়ে পড়বে এবং যে আযাব নিয়ে তারা ঠাট্টা-বিদ্রুপ করত, তা তাদেরকে গ্রাস করবে।",
                            "verse 45:34": "বলা হবে, আজ আমি তোমাদেরকে ভুলে যাব, যেমন তোমরা এ দিনের সাক্ষাৎকে ভুলে গিয়েছিলে। তোমাদের আবাসস্থল জাহান্নাম এবং তোমাদের সাহায্যকারী নেই।",
                            "verse 45:35": "এটা এজন্যে যে, তোমরা আল্লাহর আয়াতসমূহকে ঠাট্টারূপে গ্রহণ করেছিলে এবং পার্থিব জীবন তোমাদেরকে প্রতারিত করেছিল। সুতরাং আজ তাদেরকে জাহান্নাম থেকে বের করা হবে না এবং তাদের কাছে তওবা চাওয়া হবে না।",
                            "verse 45:36": "অতএব, বিশ্বজগতের পালনকর্তা, ভূ-মন্ডলের পালনকর্তা ও নভোমন্ডলের পালনকর্তা আল্লাহর-ই প্রশংসা।",
                            "verse 45:37": "নভোমন্ডলে ও ভূ-মন্ডলে তাঁরই গৌরব। তিনি পরাক্রমশালী, প্রজ্ঞাময়। প্রশংসা।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 45:1": "Ха.",
                            "verse 45:2": "Низпославането на Книгата е от Аллах, Всемогъщия, Премъдрия.",
                            "verse 45:3": "На небесата и на земята има знамения за вярващите.",
                            "verse 45:4": "И във вашето сътворяване, и в това на тварите, пръснати [по земята], има знамения за хора убедени.",
                            "verse 45:5": "И промяната на нощта и деня, и онова, което Аллах изсипва от небето за препитание, и съживява с него земята след нейната смърт, и смяната на ветровете, са знамения за хора проумяващи.",
                            "verse 45:6": "Това са знаменията на Аллах.",
                            "verse 45:7": "Горко на всеки лъжец, грешник!",
                            "verse 45:8": "Чува той знаменията на Аллах да му се четат, после надменно упорства, сякаш че не ги е чул.",
                            "verse 45:9": "И щом узнае нещо от Нашите знамения, той им се подиграва.",
                            "verse 45:10": "Пред тях е Адът.",
                            "verse 45:11": "Този",
                            "verse 45:12": "е напътствие.",
                            "verse 45:13": "Аллах е, Който подчини за вас морето, за да плават там корабите според Неговата повеля и за да търсите от Неговото обилие.",
                            "verse 45:14": "И подчини Той за вас всичко на небесата и всичко на земята - всичко е от Него.",
                            "verse 45:15": "Кажи на вярващите да прощават на онези, които не очакват дните на Аллах, но Той ще въздаде на всички хора, каквото са придобили!",
                            "verse 45:16": "Който върши праведни дела, то е за самия него, а който върши злини, то е в негов ущърб.",
                            "verse 45:17": "И дадохме на синовете на Исраил Писанието и отсъждането, и пророчеството, и им дарихме от благата, и ги предпочетохме над народите .",
                            "verse 45:18": "И им дадохме ясни знаци за",
                            "verse 45:19": "повеля.",
                            "verse 45:20": "После ти отредихме [о, Мухаммад] да си на правия път в повелята.",
                            "verse 45:21": "Те не могат да те избавят от Аллах с нищо.",
                            "verse 45:22": "Този",
                            "verse 45:23": "е прозрение за хората и напътствие, и милост за убедените.",
                            "verse 45:24": "Нима онези, които вършат злини, смятат, че в живота им и в смъртта им ще ги сторим равни с онези, които вярват и вършат праведни дела? Колко лошо отсъждат!",
                            "verse 45:25": "И сътвори Аллах небесата и земята с мъдрост, и за да се въздаде на всяка душа, каквото е придобила, и не ще бъдат угнетени.",
                            "verse 45:26": "Не виждаш ли онзи, който взима за божество своите страсти? И го остави Аллах в заблуда, знаейки, и запечата слуха и сърцето му, и сложи преграда пред погледа му.",
                            "verse 45:27": "И казват: Съществува само земният ни живот.",
                            "verse 45:28": "И когато им бъдат четени ясните Ни знамения, техният довод е само да рекат: Елате с предците ни, ако говорите истината!",
                            "verse 45:29": "Кажи: Аллах ви съживява, после ви умъртвява, после ще ви събере в Деня на възкресението, за който няма съмнение.",
                            "verse 45:30": "На Аллах принадлежи владението на небесата и на земята.",
                            "verse 45:31": "И ще видиш всяка общност на колене.",
                            "verse 45:32": "Това е Нашата Книга.",
                            "verse 45:33": "Онези, които вярват и вършат праведни дела, техният Господ ще ги въведе в Своята милост.",
                            "verse 45:34": "А на онези, които не вярват [ще се каже]: Не ви ли бяха четени Моите знамения? Но се възгордяхте и бяхте хора-престъпници.",
                            "verse 45:35": "И когато се каза, че обещанието на Аллах е истинно, и че няма съмнение за Часа, рекохте: Не знаем какво е Часът - само предполагаме, но не сме убедени.",
                            "verse 45:36": "И ще се появят пред тях злините, които те извършиха, и ще ги обгради онова, на което се подиграваха.",
                            "verse 45:37": "И ще се рече: Днес ще ви забравим, както и вие забравихте срещата в този свой Ден.",
                            "verse 45:38": "Това е, защото се подигравахте със знаменията на Аллах и ви изкуси земният живот.",
                            "verse 45:39": "Прославата е за Аллах - Господа на небесата и Господа на земята, Господа на световете.",
                            "verse 45:40": "Негово е величието на небесата и на земята."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "哈一，米目。",
                            "verse 45:2": "這本經是從至仁至睿的真主降示的。",
                            "verse 45:3": "天上地上，在信道者看來確有許多蹟象。",
                            "verse 45:4": "真主創造你們，並散布各種動物，在堅信者看來，其中有許多蹟象。",
                            "verse 45:5": "晝夜的輪流，真主從雲中降下給養，就借它而使已死的大地復活，以及改變風向；在能了解的人看來，其中有許多蹟象。",
                            "verse 45:6": "這些是真主的蹟象，我本真理而對你敘述它。在真主的訓辭和蹟象之後，你們還要信甚麼訓辭呢？",
                            "verse 45:7": "哀哉每個妄言的多罪者！",
                            "verse 45:8": "他聽見別人對他宣讀真主的蹟象時，便自大而固執，好像沒有聽見似的，所以你應當以痛苦的刑罰向他報喜。",
                            "verse 45:9": "當他知道我的一點蹟象的時候，就把它當作笑柄。這等人將受凌辱的刑罰。",
                            "verse 45:10": "他們的身後有火獄，他們所獲得的，對於他們，毫無裨益；他們捨真主而認為保護神的，對於他們，也毫無裨益，他們將受痛苦的刑罰�",
                            "verse 45:11": "這是正道，不信其主的蹟象者將受痛苦的極刑。",
                            "verse 45:12": "真主為你們而制服海洋，以便船舶奉他的命令而航行，以便你們尋求他的恩惠，以便你們感謝。",
                            "verse 45:13": "他為你們而制服天地萬物，對於能思維的民眾，此中確有許多蹟象。",
                            "verse 45:14": "你對信道者說，要赦宥不怕真主的氣運的人們，以便真主因民眾的善行而賜以報酬。",
                            "verse 45:15": "行善者自受其益，作惡者自受其害。然後，你們要被召歸於你們的主。",
                            "verse 45:16": "我確已把天經、智慧、預言，賞賜以色列的後裔，並以佳美的食品供給他們，且使他們超軼各民族。",
                            "verse 45:17": "我曾昭示他們關於此事的許多明証，他們在知識降臨他們之後，才因互相嫉妒而爭論。復活日，你的主必定判決他們所爭論的是非。",
                            "verse 45:18": "然後，我使你遵循關於此事的常道。你應當遵守那常道，不要順從無知者的私欲。",
                            "verse 45:19": "他們必定不能為你抵御真主的刑罰一絲毫。不義者必定互相監護；真主是監護敬畏者的。",
                            "verse 45:20": "這是世人的明証，也是對堅信的民眾的引導和恩惠。",
                            "verse 45:21": "難道作惡者以為我會使他們和信道而且行善者一樣，而使他們的生死相等嗎？他們的判斷真惡劣！",
                            "verse 45:22": "真主本真理而創造天地，以便每個人都因其行為而受報酬，他們將來不受虧枉。",
                            "verse 45:23": "你告訴我吧！以私欲為主宰的人，真主使他明知故違地迷誤，並封閉他的耳和心，在他的眼上加翳膜；真主使他迷誤之後，誰還能引導他呢？難道你們不覺悟嗎？",
                            "verse 45:24": "他們說：「只有我們的今世生活，我們死的死，生的生，只有光陰能使我們消滅。」他們對於那裡，一無所知，他們專事猜測。",
                            "verse 45:25": "有人對他們宣讀我的明顯的蹟象的時候，他們只是借口說：「你們把我們的祖先召喚回來吧，如果你們是說實話的。」",
                            "verse 45:26": "你說：「真主使你們生，然後使你們死，然後在毫無疑義的復活日集合你們；但世人大半不知道。」",
                            "verse 45:27": "天地的國權，歸真主所有。復活時來臨之日，反對真理者將受虧折。",
                            "verse 45:28": "你將來會看見，每一民族都是屈膝的，每一民族都要被召去看自己的功過簿。「今日，你們將受自己行為的報酬。」",
                            "verse 45:29": "這是我立的功過簿，它對你們秉公作証。我確已下令記錄你們的行為。",
                            "verse 45:30": "至於信道而且行善者，他們的主要使他們入於他的恩惠中，那確是明顯的成功。",
                            "verse 45:31": "至於不信道者，（我說）：「難道沒有人對你們宣讀過我的蹟象嗎？但你們自大，你們原是犯罪的民眾。」",
                            "verse 45:32": "有人說：「真主的應許，確是真實的；復活時是毫無疑義的。」你們就說：「我們不知道復活時是甚麼，我們只猜想那或許是要發生的，但我們並不確信。」",
                            "verse 45:33": "他們所作的罪惡，將來要對他們顯現；他們所嘲笑的刑罰，將來要來臨他們。",
                            "verse 45:34": "或者將對他們說：「今日，我忽視你們，如你們以前忽視今日的相會一樣。你們的歸宿是火獄，你們絕沒有援助者。",
                            "verse 45:35": "那是由於你們把真主的蹟象當作笑柄，塵世的生活欺騙了你們的緣故。」今日，他們不被放出火獄，也不得邀恩。",
                            "verse 45:36": "一切讚頌，只歸真主——諸天的主，大地的主，全世界的主！",
                            "verse 45:37": "天地間的偉大，只屬於他；他是萬能的，是至睿的。 一切讚頌，只歸真主——諸天的主，大地的主，全世界的主！"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Há mím!",
                            "verse 45:2": "Seslání Písma od Boha mocného, moudrého pochází.",
                            "verse 45:3": "Na nebesích i na zemi jsou věru pro věřící znamení,",
                            "verse 45:4": "a také ve stvoření vašem i ve zvířatech, jež po zemi rozmnožil, jsou znamení pro lid pevně přesvědčený,",
                            "verse 45:5": "i ve střídání noci a dne, i v tom, co Bůh z nebes sesílá jako obživu a oživuje tím zemi poté, co mrtvá byla, a rovněž ve větrů vysílání jsou znamení pro lid rozumný.",
                            "verse 45:6": "Toto jsou znamení Boží, jež podle pravdy ti sdělujeme.",
                            "verse 45:7": "Běda každému pomluvači hříšnému,",
                            "verse 45:8": "jenž naslouchá znamením Božím, když jsou mu sdělována, však potom v pýše své setrvává, jako by je ani neslyšel! O trestu bolestném zvěst oznam jemu!",
                            "verse 45:9": "A když naučí se něčemu ze znamení Naších, tropí si z toho jen posměšky.",
                            "verse 45:10": "Za nimi peklo číhá a nebude jim platné nic z toho, co si vysloužili, ani to, co místo Boha jako ochránce si vzali a pro ně určen je trest nesmírný.",
                            "verse 45:11": "Toto je správné vedení a ti, kdož neuvěřili v Pána svého znamení, trestem muk bolestných budou potrestáni.",
                            "verse 45:12": "Bůh je ten, jenž podrobil vám moře, aby po něm lodi podle rozkazu Jeho pluly a abyste na něm o část přízně Jeho usilovali - snad za to budete vděčni!",
                            "verse 45:13": "On podmanil vám vše, co na nebesích je i na zemi, a všechno od Něho pochází.",
                            "verse 45:14": "Rci těm, kdož uvěřili, ať promíjejí těm, kdož nedoufají ve dny Boží, jež dostaví se, aby byli lidé za to, co si vysloužili, odměněni.",
                            "verse 45:15": "Kdo zbožné skutky koná, sám pro sebe tak činí, však kdo zlé koná, sám proti sobě samému tak činí; a posléze budete k Pánu svému navráceni.",
                            "verse 45:16": "A dali jsme kdysi již dítkám Izraele Písmo, moudrost i proroctví a uštědřili jsme jim jídel výtečných hojnost a nad lidstvem veškerým jsme je vyznamenali.",
                            "verse 45:17": "A dali jsme jim jasné důkazy z rozkazu našeho pocházející.",
                            "verse 45:18": "A potom jsme tě umístili na cestě zákona z rozkazu Našeho vycházející.",
                            "verse 45:19": "Vždyť tihle nikterak ti proti Bohu neprospějí; nespravedliví jsou si navzájem přáteli, však Bůh bohabojných je přítelem.",
                            "verse 45:20": "Toto Písmo lidem viditelné důkazy dává a je vedením i milosrdenstvím pro lid, jenž pevně je přesvědčen.",
                            "verse 45:21": "Což domnívají se ti, kdož zlého se dopouštějí, že učiníme je rovnými s těmi, kdož věří a zbožné skutky konají, v životě i ve smrti? Jak špatný je to úsudek!",
                            "verse 45:22": "Bůh stvořil nebesa i zemi jako skutečnost, aby mohl odměnit duši každou za to, co si vysloužila; a nebude jim ukřivděno.",
                            "verse 45:23": "Co soudíš o tom, jenž učinil si božstvem svým svou vášeň a jemuž Bůh dal vědomě zbloudit a zapečetil sluch i srdce jeho a zastřel zrak jeho rouškou? Kdo povede jej kromě Boha správnou cestou? Což se nevzpamatují?",
                            "verse 45:24": "Říkají: \"Neexistuje leč tento náš život pozemský, zemřeme a žijeme a pouze čas nás zahubí!\" Však o tom, co říkají, žádných vědomostí nemají a jenom se tak dohadují.",
                            "verse 45:25": "A když jsou jim sdělována Naše znamení jasná, nemají jiného důkazu, než že říkají: \"Přiveďte tedy předky naše, jste-li pravdomluvní!\"",
                            "verse 45:26": "Odpověz: \"Bůh život vám dává a pak i smrt; a posléze vás shromáždí pro den zmrtvýchvstání, o němž pochybnosti není, však většina z lidí to neví.",
                            "verse 45:27": "Bohu náleží království nebes a země; a v den, kdy Hodina udeří, v ten den ztrátu utrpí ti, kdož pravdu popírali.",
                            "verse 45:28": "A uvidíš národy všechny klečet a každý národ ke své knize bude povolán se slovy: \"Dnes dostanete odměnu svou za to, co jste konali.",
                            "verse 45:29": "Tato Naše kniha hovoří proti vám pravdivě a zaznamenávali jsme do ní vše, co jste dělali.",
                            "verse 45:30": "Pokud se týká těch, kdož uvěřili a zbožné skutky konali, ty uvede Pán jejich do milosrdenství Svého - a to úspěch je zřetelný.",
                            "verse 45:31": "A pokud se týká těch, kdož nevěřili, těm bude řečeno: \"Což nebyla vám znamení Naše sdělena? Však byli jste pyšní a byli jste lid hříšný!",
                            "verse 45:32": "A když bylo vám řečeno: \"Slib Boží je skutečností a věru o Hodině pochyby není!\" pak jste odpovídali: \"Nevíme, co je to Hodina, máme jen domněnky své a nejsme o ní nikterak přesvědčeni.",
                            "verse 45:33": "A objeví se špatnost jejich počínání a obklíčí je to, čemu se posmívali.",
                            "verse 45:34": "A bude jim řečeno: \"Dnes my na vás zapomeneme tak, jako jste vy zapomněli na setkání s tímto svým dnem; a útočištěm vaším bude oheň a nebudete mít pomocníka žádného.",
                            "verse 45:35": "A to je odměna za to, že znamení Boží jste pro smích měli a že vás život pozemský svedl!\" A v ten den nebudou odtud vyvedeni a nebudou ani k pokání vyzváni.",
                            "verse 45:36": "A budiž chvála Bohu, Pánu nebes i Pánu země, Pánu lidstva veškerého!",
                            "verse 45:37": "Jemu náleží velkolepost na nebesích i na zemi a On mocný je i moudrý! veškerého!"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Haa Miem.",
                            "verse 45:2": "De openbaring van dit Boek is van God, de Almachtige, de Alwijze.",
                            "verse 45:3": "Voorwaar, in de hemelen en op aarde zijn tekenen voor de gelovigen.",
                            "verse 45:4": "En in de schepping van uzelf en alle medeschepselen, die Hij verspreidt (over de aarde), zijn tekenen voor een volk dat zekerheid van geloof wil hebben.",
                            "verse 45:5": "En in de wisseling van nacht en dag en de voorziening die God uit de hemel nederzendt waardoor Hij de aarde doet herleven na haar dood en in de verandering van de winden, zijn eveneens tekenen voor een volk, dat zijn verstand gebruikt.",
                            "verse 45:6": "Dit zijn de tekenen van God, die wij naar waarheid aan u voordragen.",
                            "verse 45:7": "Wee elke zondige leugenaar,",
                            "verse 45:8": "Die de woorden van God, die hem worden voorgedragen, hoort en niettemin minachtend ze trotseert alsof hij ze niet hoorde.",
                            "verse 45:9": "En die, wanneer hij van Onze tekenen kennis krijgt er mee spot.",
                            "verse 45:10": "Zij hebben de hel in het vooruitzicht; hetgeen zij verwierven zal hen niet baten noch de afgoden die zij buiten God tot beschermers namen, terwijl zij een grote straf zullen ontvangen.",
                            "verse 45:11": "Dit is de leiding.",
                            "verse 45:12": "God is Hij, Die de zee in uw dienst heeft gesteld, zodat schepen er op varen door Zijn gebod opdat gij naar Zijn overvloed zult zoeken en dat gij dankbaar moogt zjin.",
                            "verse 45:13": "En Hij heeft alles van Hem afkomstig in de hemelen en op aarde aan u onderworpen.",
                            "verse 45:14": "Zeg tegen de gelovigen, dat zij diegenen, die de dagen van God niet vrezen, moeten vergeven, zodat Hij Zelf het volk moge vergelden voor hetgeen zij verrichten.",
                            "verse 45:15": "Wie goed doet, doet dat ten voordele van zijn eigen ziel: en wie kwaad doet, doet dat tegen zijn eigen ziel.",
                            "verse 45:16": "Wij gaven het Boek en de heerschappij en het profetenambt aan de kinderen van Israël en Wij hadden hen van goede dingen voorzien: Wij begunstigden hen boven de andere volkeren.",
                            "verse 45:17": "En Wij gaven hun duidelijke uitleg over de godsdienst.",
                            "verse 45:18": "Dan hebben Wij u (o Mohammed) een duidelijke weg gewezen; volg die daarom, maar volg de begeerten der onwetenden niet.",
                            "verse 45:19": "Voorwaar, zij zullen u niets tegen God baten.",
                            "verse 45:20": "Dit zijn de duidelijke bewijzen voor de mensen en een richtsnoer en barmhartigheid aan een volk dat zekerheid van geloof heeft.",
                            "verse 45:21": "Verbeelden diegenen die slechte daden doen, dat Wij hen zullen behandelen zoals hen, die geloven en goede werken verrichten, zodat hun leven en hun dood gelijk zullen zijn? Verkeerd is hun oordeel.",
                            "verse 45:22": "God heeft de hemelen en de aarde in waarheid geschapen, zo dat elke ziel voor hetgeen zij verdient vergolden moge worden en hun zal geen onrecht worden aangedaan.",
                            "verse 45:23": "Hebt gij hem gezien, die zijn eigen begeerte tot zijn God maakt, en die God liet dwalen, ondanks zijn kennis, en wiens oren en wiens hart Hij heeft verzegeld en op wiens ogen Hij een sluier heeft gelegd? Wie zal hem buiten God kunnen leiden? Wilt gij dan geen lering hieruit trekken?",
                            "verse 45:24": "24.",
                            "verse 45:25": "En wanneer Onze duidelijke woorden aan hen worden voorgedragen, is hun enige tegenwerping: \"Brengt onze vaderen terug, als gij de waarheid spreekt.",
                            "verse 45:26": "Zeg: \"Het is God, Die u leven geeft en u daarna doet sterven, daarna zal Hij u tezamen verzamelen op de Dag der Opstanding waarover geen twijfel is.",
                            "verse 45:27": "Aan God behoort de heerschappij der hemelen en der aarde; de Dag waarop het Uur aanbreekt, zullen zij die leugens volgen, vergaan.",
                            "verse 45:28": "En gij zult ieder volk zien knielen.",
                            "verse 45:29": "\"Dit is Ons Boek: het spreekt tot u; met waarheid.",
                            "verse 45:30": "Maar wat hen betreft, die geloofden en goede daden verrichtten, hun Heer zal hen in Zijn barmhartigheid toelaten.",
                            "verse 45:31": "Maar tot de ongelovigen (zal gezegd worden): \"Werden Mijn woorden niet aan u voorgedragen? Doch gij waart hoogmoedig en werdt een schuldig volk.",
                            "verse 45:32": "En toen er werd gezegd: \"De belofte van God is zeker waar en aan het Uur is geen twijfel,\" zeidet gij: \"Wij weten niet wat het Uur is: wij vermoeden het slechts en zijn er niet zeker van.",
                            "verse 45:33": "En het boze hunner daden zal hun duidelijk worden en hetgeen zij plachten te bespotten zal hen omringen.",
                            "verse 45:34": "En er zal worden gezegd: \"Deze Dag zullen Wij u vergeten zoals gij de ontmoeting met deze Dag vergeten hebt.",
                            "verse 45:35": "\"Dit is omdat gij de tekenen van God bespottet, daardoor heeft het leven der wereld u misleid.",
                            "verse 45:36": "Alle lof komt God toe, de Heer der hemelen en der aarde; de Heer der Werelden.",
                            "verse 45:37": "Hem behoort de Grootheid in de hemelen en op aarde: en Hij is de Machtige, de Alwijze."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 45:1": "Ha.",
                            "verse 45:2": "The revelation of the Scripture is from Allah, the Mighty, the Wise.",
                            "verse 45:3": "Lo! in the heavens and the earth are portents for believers.",
                            "verse 45:4": "And in your creation, and all the beasts that He scattereth in the earth, are portents for a folk whose faith is sure.",
                            "verse 45:5": "And the difference of night and day and the provision that Allah sendeth down from the sky and thereby quickeneth the earth after her death, and the ordering of the winds, are portents for a people who have sense.",
                            "verse 45:6": "These are the portents of Allah which We recite unto thee (Muhammad) with truth.",
                            "verse 45:7": "Woe unto each sinful liar,",
                            "verse 45:8": "Who heareth the revelations of Allah recited unto him, and then continueth in pride as though he heard them not.",
                            "verse 45:9": "And when he knoweth aught of Our revelations he maketh it a jest.",
                            "verse 45:10": "Beyond them there is hell, and that which they have earned will naught avail them, nor those whom they have chosen for protecting friends beside Allah.",
                            "verse 45:11": "This is guidance.",
                            "verse 45:12": "Allah it is Who hath made the sea of service unto you that the ships may run thereon by His command, and that ye may seek of His bounty, and that haply ye may be thankful;",
                            "verse 45:13": "And hath made of service unto you whatsoever is in the heavens and whatsoever is in the earth; it is all from Him.",
                            "verse 45:14": "Tell those who believe to forgive those who hope not for the days of Allah; in order that He may requite folk what they used to earn.",
                            "verse 45:15": "Whoso doeth right, it is for his soul, and whoso doeth wrong, it is against it.",
                            "verse 45:16": "And verily we gave the Children of Israel the Scripture and the Command and the Prophethood, and provided them with good things and favoured them above (all) peoples;",
                            "verse 45:17": "And gave them plain commandments.",
                            "verse 45:18": "And now have We set thee (O Muhammad) on a clear road of (Our) commandment; so follow it, and follow not the whims of those who know not.",
                            "verse 45:19": "Lo! they can avail thee naught against Allah.",
                            "verse 45:20": "This is clear indication for mankind, and a guidance and a mercy for a folk whose faith is sure.",
                            "verse 45:21": "Or do those who commit ill-deeds suppose that We shall make them as those who believe and do good works, the same in life and death ? Bad is their judgment!",
                            "verse 45:22": "And Allah hath created the heavens and the earth with truth, and that every soul may be repaid what it hath earned.",
                            "verse 45:23": "Hast thou seen him who maketh his desire his god, and Allah sendeth him astray purposely, and sealeth up his hearing and his heart, and setteth on his sight a covering ? Then who will lead him after Allah (hath condemned him) ? Will ye not then heed ?",
                            "verse 45:24": "And they say: There is naught but our life of the world; we die and we live, and naught destroyeth us save time; when they have no knowledge whatsoever of (all) that; they do but guess.",
                            "verse 45:25": "And when Our clear revelations are recited unto them their only argument is that they say: Bring (back) our fathers.",
                            "verse 45:26": "Say (unto them, O Muhammad): Allah giveth life to you, then causeth you to die, then gathereth you unto the Day of Resurrection whereof there is no doubt.",
                            "verse 45:27": "And unto Allah belongeth the Sovereignty of the heavens and the earth; and on the day when the Hour riseth, on that day those who follow falsehood will be lost.",
                            "verse 45:28": "And thou wilt see each nation crouching, each nation summoned to its record.",
                            "verse 45:29": "This Our Book pronounceth against you with truth.",
                            "verse 45:30": "Then, as for those who believed and did good works, their Lord will bring them in unto His mercy.",
                            "verse 45:31": "And as for those who disbelieved (it will be said unto them): Were not Our revelations recited unto you ? But ye were scornful and became a guilty folk.",
                            "verse 45:32": "And when it was said: Lo! Allah’s promise is the truth, and there is no doubt of the Hour’s coming, ye said: We know not what the Hour is.",
                            "verse 45:33": "And the evils of what they did will appear unto them, and that which they used to deride will befall them.",
                            "verse 45:34": "And it will be said: This day We forget you, even as ye forgot the meeting of this your day; and your habitation is the Fire, and there is none to help you.",
                            "verse 45:35": "This, forasmuch as ye made the revelations of Allah a jest, and the life of the world beguiled you.",
                            "verse 45:36": "Then praise be to Allah, Lord of the heavens and Lord of the earth, the Lord of the Worlds.",
                            "verse 45:37": "And unto Him (alone) belongeth Majesty in the heavens and the earth, and He is the Mighty, the Wise."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 45:1": "Ha-Mim.",
                            "verse 45:2": "The revelation of the Book is from God the Exalted in Power, Full of Wisdom.",
                            "verse 45:3": "Verily in the heavens and the earth, are Signs for those who believe.",
                            "verse 45:4": "And in the creation of yourselves and the fact that animals are scattered (through the earth), are Signs for those of assured Faith.",
                            "verse 45:5": "And in the alternation of Night and Day, and the fact that God sends down Sustenance from the sky, and revives therewith the earth after its death, and in the change of the winds,- are Signs for those that are wise.",
                            "verse 45:6": "Such are the Signs of God, which We rehearse to thee in Truth; then in what exposition will they believe after (rejecting) God and His Signs?",
                            "verse 45:7": "Woe to each sinful dealer in Falsehoods:",
                            "verse 45:8": "He hears the Signs of God rehearsed to him, yet is obstinate and lofty, as if he had not heard them: then announce to him a Penalty Grievous!",
                            "verse 45:9": "And when he learns something of Our Signs, he takes them in jest: for such there will be a humiliating Penalty.",
                            "verse 45:10": "In front of them is Hell: and of no profit to them is anything they may have earned, nor any protectors they may have taken to themselves besides God: for them is a tremendous Penalty.",
                            "verse 45:11": "This is (true) Guidance and for those who reject the Signs of their Lord, is a grievous Penalty of abomination.",
                            "verse 45:12": "It is God Who has subjected the sea to you, that ships may sail through it by His command, that ye may seek of his Bounty, and that ye may be grateful.",
                            "verse 45:13": "And He has subjected to you, as from Him, all that is in the heavens and on earth: Behold, in that are Signs indeed for those who reflect.",
                            "verse 45:14": "Tell those who believe, to forgive those who do not look forward to the Days of God: It is for Him to recompense (for good or ill) each People according to what they have earned.",
                            "verse 45:15": "If any one does a righteous deed, it ensures to the benefit of his own soul; if he does evil, it works against (his own soul).",
                            "verse 45:16": "We did aforetime grant to the Children of Israel the Book the Power of Command, and Prophethood; We gave them, for Sustenance, things good and pure; and We favoured them above the nations.",
                            "verse 45:17": "And We granted them Clear Signs in affairs (of Religion): it was only after knowledge had been granted to them that they fell into schisms, through insolent envy among themselves.",
                            "verse 45:18": "Then We put thee on the (right) Way of Religion: so follow thou that (Way), and follow not the desires of those who know not.",
                            "verse 45:19": "They will be of no use to thee in the sight of God: it is only Wrong-doers (that stand as) protectors, one to another: but God is the Protector of the Righteous.",
                            "verse 45:20": "These are clear evidences to men and a Guidance and Mercy to those of assured Faith.",
                            "verse 45:21": "What! Do those who seek after evil ways think that We shall hold them equal with those who believe and do righteous deeds,- that equal will be their life and their death? Ill is the judgment that they make.",
                            "verse 45:22": "God created the heavens and the earth for just ends, and in order that each soul may find the recompense of what it has earned, and none of them be wronged.",
                            "verse 45:23": "Then seest thou such a one as takes as his god his own vain desire? God has, knowing (him as such), left him astray, and sealed his hearing and his heart (and understanding), and put a cover on his sight.",
                            "verse 45:24": "And they say: \"What is there but our life in this world? We shall die and we live, and nothing but time can destroy us.",
                            "verse 45:25": "And when Our Clear Signs are rehearsed to them their argument is nothing but this: They say, \"Bring (back) our forefathers, if what ye say is true!\"",
                            "verse 45:26": "Say: \"It is God Who gives you life, then gives you death; then He will gather you together for the Day of Judgment about which there is no doubt\": But most men do not understand.",
                            "verse 45:27": "To God belongs the dominion of the heavens and the earth, and the Day that the Hour of Judgment is established,- that Day will the dealers in Falsehood perish!",
                            "verse 45:28": "And thou wilt see every sect bowing the knee: Every sect will be called to its Record: \"This Day shall ye be recompensed for all that ye did!",
                            "verse 45:29": "\"This Our Record speaks about you with truth: For We were wont to put on Record all that ye did.",
                            "verse 45:30": "Then, as to those who believed and did righteous deeds, their Lord will admit them to His Mercy that will be the achievement for all to see.",
                            "verse 45:31": "But as to those who rejected God, (to them will be said): \"Were not Our Signs rehearsed to you? But ye were arrogant, and were a people given to sin!",
                            "verse 45:32": "\"And when it was said that the promise of God was true, and that the Hour- there was no doubt about its (coming), ye used to say, ’We know not what is the hour: we only think it is an idea, and we have no firm assurance.",
                            "verse 45:33": "Then will appear to them the evil (fruits) of what they did, and they will be completely encircled by that which they used to mock at!",
                            "verse 45:34": "It will also be said: \"This Day We will forget you as ye forgot the meeting of this Day of yours! and your abode is the Fire, and no helpers have ye!",
                            "verse 45:35": "\"This, because ye used to take the Signs of God in jest, and the life of the world deceived you:\" (From) that Day, therefore, they shall not be taken out thence, nor shall they be received into Grace.",
                            "verse 45:36": "Then Praise be to God, Lord of the heavens and Lord of the earth,- Lord and Cherisher of all the Worlds!",
                            "verse 45:37": "To Him be glory throughout the heavens and the earth: and He is Exalted in Power, Full of Wisdom!"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 45:1": "Ha Mim",
                            "verse 45:2": "The sending down of the Book is from God, the All-mighty, the All-wise.",
                            "verse 45:3": "Surely in the heavens and earth there are signs for the believers;",
                            "verse 45:4": "and in your creation, and the crawling things He scatters abroad, there are signs for a people having sure faith,",
                            "verse 45:5": "and in the alternation of night and day, and the provision God sends down from heaven, and therewith revives the earth after it is dead, and the turning about of the winds, there are signs for a people who understand.",
                            "verse 45:6": "Those are the signs of God that We recite to thee in truth; in what manner of discourse then, after God and His signs, will they believe?",
                            "verse 45:7": "Woe to every guilty impostor",
                            "verse 45:8": "who hears the signs of God being recited to him, then perseveres in waxing proud, as if he has not heard them; so give him the good tidings of a painful chastisement.",
                            "verse 45:9": "And when he knows anything of Our signs, he takes them in mockery; those for them awaits a humbling chastisement.",
                            "verse 45:10": "Behind them Gehenna; and that they have earned shall not avail them aught, nor those they took as protectors, apart from God; for them awaits a mighty chastisement.",
                            "verse 45:11": "This is guidance; and those who disbelieve in the signs of their Lord, there awaits them a painful chastisement of wrath.",
                            "verse 45:12": "God is He who has subjected to you the sea, that the ships may run on it at His commandment, and that you may seek His bounty; haply so you will be thankful.",
                            "verse 45:13": "And He has subjected to you what is in the heavens and what is in the earth, all together, from Him.",
                            "verse 45:14": "Say unto those who believe, that they forgive those who do not look for the days of God, that He may recompense a people for that they have been earning.",
                            "verse 45:15": "Whoso does righteousness, it is to his own gain, and whoso does evil, it is to his own loss; then to your Lord you shall be returned.",
                            "verse 45:16": "Indeed, We gave the Children of Israel the Book, the Judgment, and the Prophethood, and We provided them with good things, and We preferred them above all beings.",
                            "verse 45:17": "We gave them clear signs of the Command; so they differed not, except after the knowledge had come to them, being insolent one to another.",
                            "verse 45:18": "Then We set thee upon an open way of the Command; therefore follow it, and follow not the caprices of those who do not know.",
                            "verse 45:19": "Surely they will not avail thee aught against God.",
                            "verse 45:20": "This is clear proofs for men, and a guidance, and a mercy to a people having sure faith.",
                            "verse 45:21": "Or do those who commit evil deeds think that We shall make them as those who believe and do righteous deeds, equal their living and their dying? How ill they judge!",
                            "verse 45:22": "God created the heavens and the earth in truth, and that every soul may be recompensed for what it has earned; they shall not be wronged.",
                            "verse 45:23": "Hast thou seen him who has taken his caprice to be his god, and God has led him astray out of a knowledge, and set a seal upon his hearing and his heart, and laid a covering on his eyes? Who shall guide him after God? What, will you not remember?",
                            "verse 45:24": "They say, ’There is nothing but our present life; we die, and we live, and nothing but Time destroys us.",
                            "verse 45:25": "And when Our signs are recited to them, clear signs, their only argument is that they say, ’Bring us our fathers, if you speak truly.",
                            "verse 45:26": "Say: ’God gives you life, then makes you die, then He shall gather you to the Day of Resurrection, wherein is no doubt, but most men do not know.",
                            "verse 45:27": "And unto Allah belongeth the Sovereignty of the heavens and the earth; and on the day when the Hour riseth, on that day those who follow falsehood will be lost.",
                            "verse 45:28": "And thou shalt see every nation hobbling on their knees, every nation being summoned unto its Book: ’Today you shall be recompensed for that you were doing.",
                            "verse 45:29": "This is Our Book, that speaks against you the truth; We have been registering all that you were doing.",
                            "verse 45:30": "And as for those who have believed and done deeds of righteousness, their Lord shall admit them into His mercy; that is the manifest triumph.",
                            "verse 45:31": "But as for those who have disbelieved: ’Were not My signs recited to you, and you waxed proud, and were a sinful people?",
                            "verse 45:32": "And when it was said, \"God’s promise is true, and the Hour, there is no doubt of it,\" you said; \"We know not what the Hour may be; we have only a surmise, and are by no means certain.",
                            "verse 45:33": "And the evil deeds that they have done shall appear to them, and they shall be encompassed by that they mocked at.",
                            "verse 45:34": "And it shall be said, ’Today We do forget you, even as you forgot the encounter of this your day; and your refuge is the Fire, and you shall have no helpers.",
                            "verse 45:35": "That is for that you took God’s signs in mockery, and the present life deluded you.",
                            "verse 45:36": "So to God belongs praise, the Lord of the heavens and the Lord of the earth, Lord of all Being.",
                            "verse 45:37": "His is the Domination an the heavens and the earth; He is the All-mighty, the All-wise."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 45:1": "Hā.",
                            "verse 45:2": "THE BESTOWAL from on high of this divine writ issues from God, the Almighty, the Wise.",
                            "verse 45:3": "Behold, in the heavens as well as on earth there are indeed messages for all who [are willing to] believe.",
                            "verse 45:4": "And in your own nature, and in [that of] all the animals which He scatters [over the earth] there are messages for people who are endowed with inner certainty.",
                            "verse 45:5": "And in the succession of night and day, and in the means of subsistence which God sends down from the skies, giving life thereby to the earth after it had been lifeless, and in the change of the winds: [in all this] there are messages for people who use their reason.",
                            "verse 45:6": "These messages of God do We convey unto thee, setting forth the truth.",
                            "verse 45:7": "Woe unto every sinful self-deceiver",
                            "verse 45:8": "who hears God’s messages when they are conveyed to him, and yet, as though he had not heard them, persists in his haughty disdain! Hence, announce unto him grievous suffering –",
                            "verse 45:9": "for when he does become aware of any of Our messages, he makes them a target of his mockery! For all such there is shameful suffering in store.",
                            "verse 45:10": "Hell is ahead of them; and all that they may have gained [in this world] shall be of no avail whatever to them, and neither shall any of those things which, instead of God, they have come to regard as their protectors: for awesome suffering awaits them.",
                            "verse 45:11": "[To pay heed to God’s signs and messages:] this is [the meaning of] guidance; on the other hand, for those who are bent on denying the truth of their Sustainer’s messages there is grievous suffering in store as an outcome of",
                            "verse 45:12": "vileness.",
                            "verse 45:13": "IT IS GOD who has made the sea subservient [to His laws, so that it be of use] to you – so that ships might sail through it at His behest, and that you might seek to obtain [what you need] of His bounty, and that you might have cause to be grateful.",
                            "verse 45:14": "And He has made subservient to you, [as a gift] from Himself, all that is in the heavens and on earth: in this, behold, there are messages indeed for people who think!",
                            "verse 45:15": "Tell all who have attained to faith that they should forgive those who do not believe in the coming of the Days of God, [since it is] for Him",
                            "verse 45:16": "to requite people for whatever they may have earned.",
                            "verse 45:17": "Whoever does what is just and right, does so for his own good; and whoever does evil, does so to his own hurt; and in the end unto your Sustainer you all will be brought back.",
                            "verse 45:18": "AND, INDEED,",
                            "verse 45:19": "unto the children of Israel did We vouchsafe revelation, and wisdom, and prophethood; and We provided for them sustenance out of the good things of life, and favoured them above all other people [of their time].",
                            "verse 45:20": "And We gave them clear indications of the purpose [of faith]; and it was only after all this knowledge had been vouchsafed to them that they began, out of mutual jealousy, to hold divergent views:",
                            "verse 45:21": "verily, thy Sustainer will judge between them on Resurrection Day regarding all whereon they were wont to differ.",
                            "verse 45:22": "And, finally, [O Muhammad,] We have set thee on a way by which the purpose [of faith] may be fulfilled: so follow thou this ,",
                            "verse 45:23": "and follow not the likes and dislikes of those who do not know [the truth].",
                            "verse 45:24": "Behold, they could never be of any avail to thee if thou wert to defy the will of God – for, verily, such evildoers are but friends and protectors of one another, whereas God is the Protector of all who are conscious of Him.",
                            "verse 45:25": "This [revelation, then,] is a means of insight for mankind, and a guidance and grace unto people who are endowed with inner certainty.",
                            "verse 45:26": "Now as for those who indulge in sinful doings – do they think that We place them, both in their life and their death, on an equal footing with those who have attained to faith and do righteous deeds? Bad, indeed, is their judgment:",
                            "verse 45:27": "for God has created the heavens and the earth in accordance with [an inner] truth, and [has therefore willed] that every human being shall be recompensed for what he has earned and none shall be wronged.",
                            "verse 45:28": "HAST THOU ever considered [the kind of man] who makes his own desires his deity, and whom God has",
                            "verse 45:29": "let go astray, knowing [that his mind is closed to all guidance], and whose hearing and heart He has sealed, and upon whose sight He has placed a veil? Who, then, could guide him after God [has abandoned him]? Will you not, then, bethink yourselves?",
                            "verse 45:30": "And yet they say: \"There is nothing beyond our life in this world.",
                            "verse 45:31": "And",
                            "verse 45:32": "whenever Our messages are conveyed to them in all their clarity, their only argument is this: \"Bring forth our forefathers [as witnesses], if what you claim is true!\"",
                            "verse 45:33": "Say: \"It is God who gives you life, and then causes you to die; and in the end He will gather you together on Resurrection Day, [the coming of] which is beyond all doubt – but most human beings understand it not.",
                            "verse 45:34": "For God’s is the dominion over the heavens and the earth; and on the Day when the Last Hour dawns – on that Day will be lost all who [in their lifetime] tried to reduce to nothing [whatever they could not understand].",
                            "verse 45:35": "And [on that Day] thou wilt see all people kneeling down [in humility]: all people will be called upon to",
                            "verse 45:36": "their record: \"Today you shall be requited for all that you ever did!",
                            "verse 45:37": "This Our record speaks of you in all truth: for, verily, We have caused to be recorded all that you ever did!\"",
                            "verse 45:38": "Now as for those who have attained to faith and done righteous deeds, their Sustainer will admit them to His grace: that, that will be",
                            "verse 45:39": "manifest triumph!",
                            "verse 45:40": "But as for those who were bent on denying the truth, [they will be told:] \"Were not My messages conveyed to you? And withal, you gloried in your arrogance, and so you became people lost in sin:",
                            "verse 45:41": "for when it was said, ‘Behold, God’s promise always comes true, and there can be no doubt about [the coming of] the Last Hour’ – you would answer, ‘We do not know what that Last Hour may be: we think it is no more than an empty guess, and",
                            "verse 45:42": "we are by no means convinced!’\"",
                            "verse 45:43": "And [on that Day,] the evil of their doings will become obvious to them, and they will be overwhelmed by the very thing which they were wont to deride.",
                            "verse 45:44": "And [the word] will be spoken: \"Today We shall be oblivious of you as you were oblivious of the coming of this your Day [of Judgment]; and so your goal is the fire, and you shall have none to succour you:",
                            "verse 45:45": "this, because you made God’s messages the target of your mockery, having allowed the life of this world to beguile you!\" On that Day, therefore, they will not be brought out of the fire, nor will they be allowed to make amends.",
                            "verse 45:46": "AND THUS, all praise is due to God, Sustainer of the heavens and Sustainer of the earth: the Sustainer of all the worlds!",
                            "verse 45:47": "And His alone is all majesty in the heavens and on earth; and He alone is almighty, truly wise!"
                        }
                    },
                    "5": {
                        "Martin Lings": {}
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 45:1": "Hā Mīm .",
                            "verse 45:2": "This is revelation of the Book from Allah, the All-Mighty, the All-Wise.",
                            "verse 45:3": "Surely in the heavens and the earth, there are signs for those who have faith.",
                            "verse 45:4": "And in your creation and in the living beings that He scatters on the earth, there are signs for a people who believe.",
                            "verse 45:5": "And in the alternation of the day and the night, and in the provision He has sent down from the sky, then has revived the earth after its death, and in changing of the winds, there are signs for a people who understand.",
                            "verse 45:6": "These are Allah’s verses that We recite to you rightly.",
                            "verse 45:7": "Woe to every sinful liar,",
                            "verse 45:8": "who hears Allah’s verses being recited to him, then he remains adamant out of arrogance, as if he never heard them.",
                            "verse 45:9": "When he learns about something of Our verses, he takes it as a laughing stock.",
                            "verse 45:10": "In front of them, there is Jahannam (Hell).",
                            "verse 45:11": "This is guidance, and those who reject the verses of their Lord, for them there is a painful punishment of the divine scourge.",
                            "verse 45:12": "Allah is the One who has subjugated for you the sea, so that the ships may sail in it with His command, and so that you may seek His grace, and so that you offer gratitude.",
                            "verse 45:13": "He has subjugated for you whatever there is in the heavens and whatever there is in the earth, all on His own.",
                            "verse 45:14": "Tell those who believe that they should forgive those who do not believe in Allah’s days, so that He may recompense a people for what they used to earn.",
                            "verse 45:15": "Whoever acts righteously, it is for his own benefit, and who does evil, it is against his own soul.",
                            "verse 45:16": "We gave the children of Isrā’īl the book and the wisdom and the prophet-hood, and provided them with good things, and preferred them above all (people of) the world,",
                            "verse 45:17": "and We gave them clear proofs of the Matter (i.",
                            "verse 45:18": "Then We have put you on a certain way of the Matter (i.",
                            "verse 45:19": "They will never help you against Allah in the least.",
                            "verse 45:20": "These are insights for the people, and guidance and mercy for a people who believe.",
                            "verse 45:21": "Do those who have committed evils assume that We will make them like those who believe and do righteous deeds, so as their life and death becomes equal? Evil is what they judge.",
                            "verse 45:22": "Allah has created the heavens and the earth with just purpose, and so that everybody is recompensed for what he (or she) earned, and they will not be wronged.",
                            "verse 45:23": "So, have you seen him who has taken his desires as his god, and Allah has let him go astray, despite having knowledge, and has sealed his ear and his heart, and put a cover on his eye? Now who will guide him after Allah? Still, do you not take lesson?",
                            "verse 45:24": "And they say, “There is no life but our worldly life.",
                            "verse 45:25": "When Our verses are recited to them in all their clarity, their argument is none but that they say, “Bring our fathers, if you are truthful.",
                            "verse 45:26": "Say, “Allah gives you life, then makes you die, then He will assemble you on the Day of Judgement in which there is no doubt, but most of the people do not know.",
                            "verse 45:27": "To Allah belongs the kingdom of the heavens and the earth.",
                            "verse 45:28": "and you will see every community kneeling down.",
                            "verse 45:29": "This is Our book that speaks against you with truth.",
                            "verse 45:30": "Then, as for those who believed and did righteous deeds, their Lord will admit them to His mercy.",
                            "verse 45:31": "And as to those who disbelieved, (it will be said to them,) “Had My verses not been recited to you? But you showed arrogance, and you were a guilty people;",
                            "verse 45:32": "and when it was said to you that Allah’s promise is true and there is no doubt in the (arrival of the) Hour, you used to say, ‘We do not know what the Hour is.",
                            "verse 45:33": "And revealed to them will be the evils of what they did, and encircled they will be by what they used to ridicule.",
                            "verse 45:34": "It will be said, “Today We will forget you, as you forgot facing this your day, and your abode is the Fire, and for you there are no helpers at all.",
                            "verse 45:35": "That is because you took Allah’s verses as a laughing stock, and the worldly life deceived you.",
                            "verse 45:36": "So, to Allah belongs all praise, who is the Lord of the heavens and the earth, the Lord of the worlds.",
                            "verse 45:37": "And to Him belongs majesty in the heavens and the earth."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 45:1": "Hā mīm.",
                            "verse 45:2": "The revelation of the Book is from God, the Mighty, the Wise.",
                            "verse 45:3": "Truly in the heavens and the earth there are signs for believers.",
                            "verse 45:4": "And in your creation, and what He has scattered of animals, there are signs for a people who are certain;",
                            "verse 45:5": "and the alternation of night and day, and what God sends down from the heaven [in the way] of provision with which He revives the earth after it is dead, and the circulation of the winds, there are signs for a people who understand.",
                            "verse 45:6": "These are the signs of God which We recite to you with truth.",
                            "verse 45:7": "Woe to every sinful liar,",
                            "verse 45:8": "who hears the signs of God being recited to him, then persists arrogantly, as if he had not heard them.",
                            "verse 45:9": "And should he come to know anything of Our signs, he takes them in mockery.",
                            "verse 45:10": "Beyond them is Hell, and that which they have earned will not avail them in any way, nor those whom they took besides God as patrons.",
                            "verse 45:11": "This is a guidance, and those who disbelieve in the signs of their Lord, for them there will be a torture of a painful chastisement.",
                            "verse 45:12": "God it is Who disposed for you the sea so that the ships may sail upon it by His command, and that you may seek of His bounty, and that perhaps you may give thanks.",
                            "verse 45:13": "And He has disposed for you whatever is in the heavens, and whatever is in the earth, all being from Him.",
                            "verse 45:14": "Tell those who believe to forgive those who do not anticipate the days of God that He may requite a people for what they used to earn.",
                            "verse 45:15": "Whoever acts righteously, it is for [the benefit of] his own soul, and whoever does evil, it is to the detriment thereof; then to your Lord you will be returned.",
                            "verse 45:16": "And verily We gave the Children of Israel the Scripture, and [the means of] judgement, and prophethood, and We provided them with the good things, and We favoured them above",
                            "verse 45:17": "worlds.",
                            "verse 45:18": "And We gave them clear illustrations of the commandment.",
                            "verse 45:19": "Then We set you upon a",
                            "verse 45:20": "course of the commandment; so follow it, and do not follow the desires of those who do not know.",
                            "verse 45:21": "Assuredly they will not avail you in any way against God.",
                            "verse 45:22": "of the God-fearing.",
                            "verse 45:23": "This is [a set of] insights for mankind, and guidance and mercy for a people who have certainty.",
                            "verse 45:24": "Or do those who have perpetrated evil acts suppose that We shall treat them as those who believe and perform righteous deeds, equally in their life and in their death? How evil is that judgement which they make!",
                            "verse 45:25": "And God created the heavens and the earth with the truth and so that every soul may be requited for what it has earned, and they will not be wronged.",
                            "verse 45:26": "Have you then seen him who has taken as his god his",
                            "verse 45:27": "desire, and whom God has led astray knowingly, and set a seal upon his hearing and his heart, and laid a covering over his sight? So who will guide him after God? Will you not then remember?",
                            "verse 45:28": "And they say, ‘There is only our life in this world.",
                            "verse 45:29": "And when Our signs, are recited to them, being clear signs, their only argument is to say, ‘Bring us our fathers, if you are being truthful’.",
                            "verse 45:30": "Say: ‘God [is the One Who] gives you life, then makes you die, then gathers you to the Day of Resurrection, in which there is no doubt; but most people do not know’.",
                            "verse 45:31": "And to God belongs the kingdom of the heavens and the earth.",
                            "verse 45:32": "And you will see every community.",
                            "verse 45:33": "This is Our book, which pronounces against you with truth.",
                            "verse 45:34": "So as for those who believed and performed righteous deeds, their Lord will admit them into His mercy.",
                            "verse 45:35": "But as for those who disbelieved: ‘Were not My signs recited to you, but you were disdainful and were a guilty lot?",
                            "verse 45:36": "And when it was said: “God’s promise is indeed true, and there is no doubt about the Hour”, you said, “We do not know what the Hour is.",
                            "verse 45:37": "And there will appear before them the evils of what they did, and they will be besieged by what they used to deride.",
                            "verse 45:38": "And it will be said: ‘Today We will forget you, just as you forgot the encounter of this day of yours, and your abode will be the Fire, and you will not have any helpers.",
                            "verse 45:39": "That is because you took God’s signs in mockery, and the life of this world deceived you’.",
                            "verse 45:40": "So to God belongs",
                            "verse 45:41": "praise; Lord of the heavens and Lord of the earth, the Lord of the Worlds.",
                            "verse 45:42": "And to Him belongs",
                            "verse 45:43": "grandeur in the heavens and the earth, and He is the Mighty, the Wise."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 45:1": "Ha-Mim.",
                            "verse 45:2": "The revelation of (this) Book is from Allah, Almighty, Most Wise.",
                            "verse 45:3": "Indeed, there are signs for the believers in the heavens and the earth.",
                            "verse 45:4": "And in your (own) creation, and in the animals which He scatters, there are signs for those who believe with certitude.",
                            "verse 45:5": "And in the alternation of night and day, and in that provision (of rain) which Allah sends down from the sky, and by that gives life to the earth after its death, and (in the same way) in the changing of the wind direction, there are signs for those who apply reason.",
                            "verse 45:6": "These are the Revelations of Allah which We recite to you with absolute truth.",
                            "verse 45:7": "Woe to every liar given to fabricating false allegations (and) every dreadful evildoer,",
                            "verse 45:8": "The one who listens to the Revelations of Allah that are recited to him, then insists (on his disbelief) arrogantly as if he did not hear them, give him the news of a grievous torment!",
                            "verse 45:9": "And when he learns about any thing of Our Verses (of the Qur’an), he makes it a joke.",
                            "verse 45:10": "Beyond (their current term of life), there is Hell.",
                            "verse 45:11": "This (Qur’an) is guidance.",
                            "verse 45:12": "Allah is the One Who has placed the sea under your control so that ships and vessels may sail in it by His command, so that you may look for His bounty (i.",
                            "verse 45:13": "And He has made subservient to you, out of His will, whatever is in the heavens and whatever is in the earth, all of it (under a system).",
                            "verse 45:14": "Say to the believers to disregard those who neither hope for nor fear (the coming of) the Days of Allah, so that He may give them full reward of those (deeds) which they used to earn.",
                            "verse 45:15": "Whoever does a righteous work does it for (the benefit of) his own soul, and whoever commits some evil act, then he alone is to face (suffering caused by it).",
                            "verse 45:16": "And surely, We gave to the Children of Israel the Book, the reign and Prophethood, and provided them with sustenance of pure things.",
                            "verse 45:17": "And We gave them clear proofs of religion (and Prophethood).",
                            "verse 45:18": "Then We set you on the open path of Shariah (Islamic law).",
                            "verse 45:19": "Surely, these people will not be of any help to you at all (despite promises) from Allah (for crucial time of hardships coming in the way of Islam).",
                            "verse 45:20": "This (Qur’an) contains proofs, which provide vision and lessons of warning to the people, and is guidance and mercy for those who believe with certitude.",
                            "verse 45:21": "Do those who have earned evil deeds think that We shall make them resemble those who believe and do good deeds (so as) to make their life and death alike? The claim, which they (the disbelievers) make, is the worst evil.",
                            "verse 45:22": "And Allah created the heavens and the earth with (a strategy based on) truth, in order that every soul is rewarded for the deeds that it earns and they will not be wronged.",
                            "verse 45:23": "Have you seen him who has made his desire his god and Allah has held him astray despite his knowledge and has sealed his ears and his heart and has blindfolded his eyes? Then who can guide him after Allah? So do you not accept advice?",
                            "verse 45:24": "And they say: ‘There is nothing (else) except our worldly life.",
                            "verse 45:25": "And when Our clear Verses are recited to them, they do not have any plea except to say: ‘Bring back our fathers (raised alive) if you are truthful.",
                            "verse 45:26": "Say: ‘Allah is the One Who gives you life, and He is the One Who causes you to die.",
                            "verse 45:27": "And the Kingdom of the heavens and the earth belongs to Allah alone.",
                            "verse 45:28": "And you will see every party (of the disbelievers and beliers) sitting, fallen on their knees.",
                            "verse 45:29": "This is Our record that will speak about you with absolute truth.",
                            "verse 45:30": "So those who believe and do good deeds, their Lord will admit them to His mercy.",
                            "verse 45:31": "And those who disbelieved (it will be said to them:) ‘Were My Verses not recited to you? But you showed arrogance and you were the evildoers.",
                            "verse 45:32": "And when it was said: ‘The promise of Allah is true, and there is no doubt about (the coming of) the Last Hour,’ you used to say: ‘We do not know what the Last Hour is; we regard it nothing but a conjecture; nor do we have any faith in it.",
                            "verse 45:33": "And all their evil works which they used to do will be exposed, and that (torment) which they used to make fun of will beset them.",
                            "verse 45:34": "And it will be said (to them): ‘Today We forget you as you forgot your Meeting on this Day.",
                            "verse 45:35": "That (is) so because you made fun of Allah’s Revelations, and the worldly life deceived you.",
                            "verse 45:36": "So all praise belongs to Allah alone, Who is the Lord of the heavens and the Master of the earth (and also) the Sustainer of all the worlds.",
                            "verse 45:37": "And all Greatness (i."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Ylistetty, kunnian Jumala!",
                            "verse 45:2": "Kirjoituksen on ilmoittanut Jumala, mahtava, viisas.",
                            "verse 45:3": "Totisesti on taivaassa ja maan päällä merkkejä uskoville.",
                            "verse 45:4": "Teidän oma luomisenne ja eläimet, joita Hän levittää ympäri maata, ovat tunnusmerkkejä ihmisille, joilla on varmuus.",
                            "verse 45:5": "Yön ja päivän vaihtelu, sade, jonka Jumala lähettää pilvistä ja jolla Hän virvoittaa kuihtuneen maan, sekä tuulten vaihtelut ovat tunnusmerkkejä ihmisille, joilla on ymmärrystä.",
                            "verse 45:6": "Nämä ovat Jumalan tunnusmerkkejä, jotka Me ilmoitamme sinulle totuudessa, mutta mihin sanomaan uskoisivat he Jumalan ja Hänen ilmoitustensa jälkeen?",
                            "verse 45:7": "Voi kaikkia syntisiä valehtelijoita,",
                            "verse 45:8": "jotka kuulevat Jumalan ilmoitukset lausuttavan itselleen, mutta sitten ylpeydessään paatuvat eivätkä ole niitä kuulevinaan! Julista siis heille sanoma tuskallisesta rangaistuksesta!",
                            "verse 45:9": "Ja kun he saavat kuulla jonkin ilmoituksistamme, tekevät he siitä pilkkaa; nämä tulevat saamaan häpeällisen rangaistuksen.",
                            "verse 45:10": "Heidän edessään on helvetti, ja siellä heitä ei lainkaan hyödytä se, mitä he ovat itselleen hankkineet, eivätkä ne, joita he Jumalan sijaan ottivat suojelijoikseen.",
                            "verse 45:11": "Tämä on oikea johdatus, ja niillä, jotka kieltävät Herransa ilmoitukset, on oleva tuskallinen rangaistus.",
                            "verse 45:12": "Jumala saattoi meren palvelemaan teitä, niin että alukset purjehtivat sitä myöten Hänen käskynsä mukaan, jotta te etsisitte Hänen armoaan ja antaisitte Hänelle kiitoksen.",
                            "verse 45:13": "Hän on myös tehnyt alamaiseksenne kaiken, mitä on taivaissa ja maan päällä: totisesti on tässä tunnusmerkkejä ihmisille jotka ajattelevat.",
                            "verse 45:14": "Sano uskoville, että he antaisivat anteeksi niille, jotka eivät pelkää Jumalan päivää, jolloin Hän palkitsee ihmiset heidän ansioittensa mukaan.",
                            "verse 45:15": "Jos joku tekee hyvää, koituu se hänen oman sielunsa parhaaksi, ja jos joku tekee pahaa, tulee siitä hänelle itselleen vahinkoa; sitten saatetaan teidät takaisin Herranne tykö.",
                            "verse 45:16": "Totisesti annoimme Israelin lapsille Pyhän Kirjan, viisauden ja profeetankutsumuksen, jakelimme heille hyvyyttä ja asetimme heidät muiden kansojen edelle.",
                            "verse 45:17": "Me annoimme heille myös selvät todistukset, ja he olivat erimielisiä ja toisille kateellisia vasta päästyään osallisiksi tiedosta; totisesti Herrasi on tuomitseva heidät ylösnousemuksen päivänä siitä, mistä he kiistelivät.",
                            "verse 45:18": "Sitten annoimme sinun seurata määrättyä suuntaa; noudata siis sitä äläkä niiden alhaisia toiveita, jotka ovat tietoa vailla!",
                            "verse 45:19": "Totisesti he eivät hyödytä sinua vähintäkään Jumalan edessä; jumalattomat ovat toistensa ystäviä, mutta Jumala on niiden ystävä, jotka karttavat pahaa.",
                            "verse 45:20": "Nämä ovat selviä todisteita ihmisille, opastus ja armo niille, joilla on varmuus.",
                            "verse 45:21": "Luulevatko ne, jotka ovat tehneet pahoja töitä, että kohtelen heitä samoin kuin niitä, jotka uskovat ja tekevät hyviä töitä, ja että elämä ja kuolema heille tulee olemaan samanlainen? Kehno on heidän arvostelunsa.",
                            "verse 45:22": "Jumala loi taivaat ja maan totuutta noudattaen, niin että jokainen sielu palkittaisiin ansionsa mukaan ja ettei kenellekään tehtäisi vääryyttä.",
                            "verse 45:23": "Mitä ajattelet ihmisestä, joka pitää alhaista haluaan jumalanaan ja jonka Jumala tietäen antaa harhautua, jonka korvat ja sydämen Hän sinetöi ja jonka silmät Hän peittää verholla? Kuka voi ohjata häntä paitsi Jumala? Ettekö siis tahdo noudattaa kehoitusta?",
                            "verse 45:24": "He sanovat myös: »Ei ole olemassa muuta kuin tämä maallinen elämämme; me elämme ja kuolemme, ja mikään muu kuin aika ei hävitä meitä.",
                            "verse 45:25": "Ja kun selvät ilmoituksemme sanellaan heille, on heidän vastaväitteinänsä vain tämä: »Herättäkää meille isämme takaisin, jos puhutte totta!»",
                            "verse 45:26": "Sano: »Jumala antaa teille elämän, sitten lähettää Hän teille kuoleman ja sitten kokoaa Hän teidät ylösnousemuksen päivänä.",
                            "verse 45:27": "Jumalan on valta taivaassa ja maan päällä, ja sinä päivänä, jolloin hetki tulee, sinä päivänä hukkuvat ne, jotka harjoittavat vääryyttä.",
                            "verse 45:28": "Sinä saat nähdä kaikkien kansojen notkistavan polvensa; jokainen kansa kutsutaan pyhän kirjansa ääreen.",
                            "verse 45:29": "Tämä Meidän Kirjamme sanoo teistä totuuden; totisesti, Me kirjoitimme tekonne muistiin.",
                            "verse 45:30": "Mitä tulee niihin, jotka uskoivat ja tekivät hyviä töitä, ne heidän Herransa sulkee armoonsa; tämä on ylin autuus.",
                            "verse 45:31": "Mitä taas tulee niihin, jotka eivät uskoneet, niin »eikö Minun ilmoituksiani ole luettu teille? Mutta te olitte ylpeitä, niin, te olitte syntisiä ihmisiä.",
                            "verse 45:32": "Ja kun sanottiin: »Jumalan lupaus on totisesti vanhurskas eikä tuomionhetkestä ole epäilystä», sanoitte te: »Me emme tiedä, millainen hetki se on; me emme luule sen koittavan, sillä se on vain ennakkoluuloa, eikä meillä ole siitä lainkaan varmuutta.",
                            "verse 45:33": "Mutta paha, mitä he ovat tehneet, tulee heille selväksi, ja se, mitä he pilkkasivat, on kohdistuva heihin itseensä.",
                            "verse 45:34": "Ja heille sanotaan: »Tänään Me hylkäämme teidät, niinkuin te olitte välinpitämättömiä tämän päivän tulemisesta.",
                            "verse 45:35": "Näin käy sentähden, että te piditte Jumalan ilmoituksia pilkkana ja että maallinen elämä on houkutellut teidät harhaan.",
                            "verse 45:36": "Jumalalle kuuluu kaikki kiitos, taivaitten Herralle, maan Herralle, maailmojen Herralle!",
                            "verse 45:37": "Hänen on kunnia taivaassa ja maan päällä: Hän on mahtava, viisas."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 45:1": "Hâ.",
                            "verse 45:2": "La Révélation du Livre vient de Dieu, le Puissant, le Sage.",
                            "verse 45:3": "Certes, il y a dans les cieux et sur la terre des signes pour les croyants.",
                            "verse 45:4": "Dans votre propre création et dans la multitude des animaux qu'Il répand, il y a des signes pour ceux qui croient avec certitude.",
                            "verse 45:5": "Et dans la succession de la nuit et du jour, dans l'eau nourricière que Dieu fait tomber du ciel et par laquelle Il fait revivre la terre après sa mort, dans l'impulsion donnée aux vents, il y a des signes pour ceux qui raisonnent.",
                            "verse 45:6": "Ce sont des versets de Dieu que Nous te récitons en toute Vérité.",
                            "verse 45:7": "Malheur à tout pécheur retors ! :",
                            "verse 45:8": "il écoute les versets de Dieu qui lui sont récités, puis il s'obstine dans son orgueil comme s'il ne les avait pas entendus.",
                            "verse 45:9": "Quand il retient quelque chose de Nos versets, c'est pour s'en moquer.",
                            "verse 45:10": "Derrière eux il y aura la Géhenne.",
                            "verse 45:11": "Ceci est un rappel de la bonne direction.",
                            "verse 45:12": "Dieu est Celui qui a mis la mer à votre service pour que le navire y vogue sur Son ordre, afin que vous vous mettiez en quête de Ses bienfaits et que vous soyez reconnaissants.",
                            "verse 45:13": "Il a aussi mis à votre service ce qui se trouve dans les cieux et sur la terre, le tout venant de Lui.",
                            "verse 45:14": "Dis à ceux qui ont la foi de pardonner à ceux qui n'attendent pas la Faveur de Dieu, car c'est à Dieu de rétribuer chacun selon ce qu'il aura accompli.",
                            "verse 45:15": "Quiconque fait le bien le fait à son profit, et quiconque fait le mal le fait à son détriment.",
                            "verse 45:16": "Nous avons donné aux fils d'Israël le Livre, la Sagesse et la Prophétie.",
                            "verse 45:17": "Nous leur avons donné des preuves évidentes concernant Notre commandement.",
                            "verse 45:18": "Nous t'avons ensuite placé sur une voie légale (sharî'ah) procédant du Commandement.",
                            "verse 45:19": "Ces gens ne pourront t'être d'aucune utilité contre Dieu.",
                            "verse 45:20": "Ce sont là des appels à la clairvoyance pour les hommes, une guidance et une miséricorde pour ceux qui croient avec certitude.",
                            "verse 45:21": "Ceux qui cherchent à faire le mal pensent-ils que Nous les traiterons comme ceux qui croient et qui accomplissent des œuvres pies, et qu'il n'y aura nulle différence entre eux, dans la vie comme dans la mort ? Comme leur jugement est faux !",
                            "verse 45:22": "Dieu a créé les cieux et la terre par la Vérité afin que chaque âme soit rétribuée selon ce qu'elle se sera acquis et sans que nul soit lésé.",
                            "verse 45:23": "Ne vois-tu pas que si quelqu'un prend pour divinité sa propre passion, et que si Dieu l'égare sciemment, met un sceau sur son ouïe et sur son cœur, et place un bandeau sur ses yeux, il n'y aura personne, après Dieu, qui puisse le guider ? Les gens ne réfléchissent-ils pas ?",
                            "verse 45:24": "Ils disent : \" Seule existe notre vie en ce monde : nous mourons et nous vivons, mais seul le temps qui passe nous fait périr.",
                            "verse 45:25": "Lorsque Nos versets leur sont récités avec leur évidence, leur seul argument consiste à dire : \" Faites venir nos pères, si vous êtes véridiques ! \"",
                            "verse 45:26": "Dis : \" Dieu vous fait vivre, puis Il vous fait mourir, puis Il vous réunira le Jour de la Résurrection au sujet duquel aucun doute n'est possible ; mais la plupart des hommes ne savent pas ! \"",
                            "verse 45:27": "A Dieu appartient le Royaume des cieux et de la terre.",
                            "verse 45:28": "Tu verras chaque communauté agenouillée.",
                            "verse 45:29": "Voici Notre livre : il parle contre vous en toute vérité.",
                            "verse 45:30": "Mais ceux qui ont cru et ont accompli des œuvres pies, leur Seigneur les fera entrer dans Sa miséricorde : c'est là le bonheur insigne !",
                            "verse 45:31": "A ceux qui auront mécru [on dira] : \" Mes versets ne vous ont-ils pas été lus ? Mais vous avez été orgueilleux et vous vous êtes rendus coupables.",
                            "verse 45:32": "Lorsqu'on disait : \" Certes, la promesse de Dieu est Vérité, et l'Heure, il n'y a aucun doute à son sujet, \" vous avez dit : \" Nous ne savons pas ce qu'est l'Heure ; nous pensons qu'il ne s'agit que d'une conjecture, et nous ne sommes nullement convaincus \".",
                            "verse 45:33": "Les mauvaises actions qu'ils ont commises leur apparaîtront, et ce dont ils se moquaient les enveloppera de toutes parts.",
                            "verse 45:34": "On leur dira : \" Aujourd'hui Nous vous oublions comme vous avez oublié la rencontre de votre Jour que voici.",
                            "verse 45:35": "Il en est ainsi, parce que vous avez pris les signes de Dieu comme objet de raillerie et parce que la vie de ce monde vous a séduits \".",
                            "verse 45:36": "Louange à Dieu, Seigneur des cieux et Seigneur de la terre, Seigneur de l'univers !",
                            "verse 45:37": "A Lui la Grandeur dans les cieux et sur la terre ; Il est le Puissant, le Sage !"
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 45:1": "Ha, Mim.",
                            "verse 45:2": "La révélation du Livre émane de Dieu, le Puissant, le Sage.",
                            "verse 45:3": "Il y a certes dans les cieux et la terre des preuves pour les croyants.",
                            "verse 45:4": "Et dans votre propre création, et dans ce qu’Il dissémine comme animaux, il y a des signes pour des gens qui croient avec certitude.",
                            "verse 45:5": "De même dans l’alternance de la nuit et du jour, et dans ce que Dieu fait descendre du ciel, comme subsistance",
                            "verse 45:6": "par laquelle Il redonne la vie à la terre une fois morte, et dans la distribution des vents, il y a des signes pour des gens qui raisonnent.",
                            "verse 45:7": "Voilà les versets de Dieu que Nous te récitons en toute vérité.",
                            "verse 45:8": "Malheur à tout grand imposteur pécheur !",
                            "verse 45:9": "Il entend les versets de Dieu qu’on lui récite puis persiste dans son orgueil, comme s’il ne les avait jamais entendus.",
                            "verse 45:10": "S’il a connaissance de quelques-uns de Nos versets, il les tourne en dérision.",
                            "verse 45:11": "L’Enfer est à leur trousses.",
                            "verse 45:12": "Ceci [le Coran] est un guide.",
                            "verse 45:13": "Dieu, c’est Lui qui vous a assujetti la mer, afin que les vaisseaux y voguent, par Son ordre, et que vous alliez en quête de Sa grâce afin que vous soyez reconnaissants.",
                            "verse 45:14": "Et Il vous a assujetti tout ce qui est dans les cieux et sur la terre, le tout venant de Lui.",
                            "verse 45:15": "Dis à ceux qui ont cru de pardonner à ceux qui n’espèrent pas les jours de Dieu afin qu’Il rétribue",
                            "verse 45:16": "peuple pour les acquis qu’ils faisaient.",
                            "verse 45:17": "Quiconque fait le bien, le fait pour lui-même; et quiconque agit mal, agit contre lui-même.",
                            "verse 45:18": "Nous avons effectivement apporté aux Enfants d’Israël le Livre, la sagesse, la prophétie, et leur avons attribué de bonnes choses, et les préférâmes aux autres humains [leurs contemporains];",
                            "verse 45:19": "Et Nous leur avons apporté des preuves évidentes de l’Ordre .",
                            "verse 45:20": "Puis Nous t’avons mis sur la voie de l’Ordre [une religion claire et parfaite].",
                            "verse 45:21": "Il ne te seront d’aucune utilité vis-à-vis de Dieu.",
                            "verse 45:22": "Ceci [le Coran] constitue pour les hommes une source de clarté, un guide et une miséricorde pour les gens qui croient avec certitude.",
                            "verse 45:23": "Ceux qui commettent des mauvaises actions comptent-ils que Nous allons les traiter comme ceux qui croient et accomplissent les bonnes oeuvres, dans leur vie et dans leur mort ? Comme ils jugent mal !",
                            "verse 45:24": "Et Dieu a créé les cieux et la terre en toute vérité et afin que chaque âme soit rétribuée selon ce qu’elle a acquis.",
                            "verse 45:25": "Vois-tu celui qui prend sa passion pour sa propre divinité ? Et Dieu l’égare sciemment et scelle son ouïe et son coeur et étend un voile sur sa vue.",
                            "verse 45:26": "Et ils dirent : «Il n’y a pour nous que la vie d’ici-bas : nous mourons et nous vivons et seul le temps nous fait périr».",
                            "verse 45:27": "Et quand on leur récite Nos versets bien clairs, leur seul argument est de dire : «Faites revenir nos ancêtres si vous êtes véridiques».",
                            "verse 45:28": "Dis : «Dieu vous donne la vie puis Il vous donne la mort.",
                            "verse 45:29": "A Dieu appartient le royaume des cieux et de la terre.",
                            "verse 45:30": "Et tu verras chaque communauté agenouillée.",
                            "verse 45:31": "Voilà Notre Livre.",
                            "verse 45:32": "ce que vous faisiez».",
                            "verse 45:33": "Ceux qui ont cru et fait de bonnes oeuvres, leur Seigneur les fera entrer dans sa miséricorde.",
                            "verse 45:34": "Et quant à ceux qui ont mécru [il sera dit]: «Mes versets ne vous étaient-ils pas récités ? Mais vous vous enfliez d’orgueil et vous étiez des gens criminels».",
                            "verse 45:35": "Et quand on disait : «la promesse de Dieu est vérité; et l’Heure n’est pas l’objet d’un doute», vous disiez : «Nous ne savons pas ce que c’est que l’Heure; et nous ne faisions à son sujet que de simples conjectures et nous ne sommes pas convaincus [qu’elle arrivera].",
                            "verse 45:36": "Et leur apparaîtra [la laideur] de leurs mauvaises actions.",
                            "verse 45:37": "Et on leur dira : «Aujourd’hui Nous vous oublions comme vous avez oublié la rencontre de votre jour que voici.",
                            "verse 45:38": "Cela parce que vous preniez en raillerie les versets de Dieu et que la vie d’ici-bas vous trompait».",
                            "verse 45:39": "Louange à Dieu, Seigneur des cieux et Seigneur de la terre : Seigneur de l’univers.",
                            "verse 45:40": "Et à Lui la grandeur dans les cieux et la terre."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Há Mím.",
                            "verse 45:2": "Die Offenbarung des Buches ist von Allah, dem Allmächtigen, dem Allweisen.",
                            "verse 45:3": "Wahrlich, in den Himmeln und auf der Erde sind Zeichen für jene, die glauben.",
                            "verse 45:4": "Und in eurer Erschaffung und all der Geschöpfe, die Er (über die Erde) ausstreut, sind Zeichen für Leute, die festen Glauben haben.",
                            "verse 45:5": "Und in dem Wechsel von Nacht und Tag und in der Versorgung, die Allah vom Himmel niedersendet, wodurch Er die Erde neubelebt nach ihrem Tod, und in dem Wandel der Winde sind Zeichen für Leute, die Verstand besitzen.",
                            "verse 45:6": "Dies sind die Zeichen Allahs, die Wir dir mit der Wahrheit vortragen.",
                            "verse 45:7": "Wehe jedem sündigen Lügner,",
                            "verse 45:8": "Der Allahs Zeichen hört, wie sie ihm vorgetragen werden, und dann im Hochmut verharrt, als hätte er sie nicht gehört - darum verkünde ihm qualvolle Strafe! -,",
                            "verse 45:9": "Und der, wenn er etwas von Unseren Zeichen kennen lernt, Spott damit treibt.",
                            "verse 45:10": "Vor ihnen ist die Hölle; und das, was sie erworben haben, soll ihnen nichts nützen noch die Beschützer, die sie sich statt Allah angenommen haben.",
                            "verse 45:11": "Das ist Führung.",
                            "verse 45:12": "Allah ist es, Der euch das Meer dienstbar gemacht hat, daß die Schiffe darauf hinsegeln nach Seinem Geheiß und daß ihr nach Seiner Gnadenfülle trachtet und daß ihr dankbar seiet.",
                            "verse 45:13": "Und Er hat euch dienstbar gemacht, was in den Himmeln und was auf Erden ist; alles ist von Ihm.",
                            "verse 45:14": "Sprich zu denen, die glauben sie möchten denen vergeben, die nicht die Strafe Allahs fürchten, auf daß Er die Leute belohne für das, was sie verdienen.",
                            "verse 45:15": "Wer das Rechte tut, der tut es für seine eigene Seele, und wer Unrecht tut, der tut es wider sie.",
                            "verse 45:16": "Wir gaben den Kindern Israels die Schrift und Herrschaft und Prophetentum, und Wir versorgten sie mit guten Dingen und bevorzugten sie vor den Völkern.",
                            "verse 45:17": "Und Wir gaben ihnen deutliche Weisungen in der Sache.",
                            "verse 45:18": "Dann brachten Wir dich auf einen klaren Pfad in der Sache des Glaubens: so befolge ihn, und folge nicht den Launen derer, die nichts wissen.",
                            "verse 45:19": "Sie werden dir nichts nützen wider Allah.",
                            "verse 45:20": "Diese (Lehren) sind die Mittel zur Erleuchtung für die Menschheit und eine Führung und Barmherzigkeit für Leute, die festen Glauben haben.",
                            "verse 45:21": "Wähnen die, die Böses verüben, etwa, daß Wir sie denen gleich behandeln werden, die glauben und gute Werke tun, so daß ihr Leben und ihr Tod gleich sein wird? Schlimm ist, wie sie urteilen!",
                            "verse 45:22": "Allah hat die Himmel und die Erde in Weisheit geschaffen und daher wird jeder belohnt werden für das, was er verdient; und kein Unrecht sollen sie leiden.",
                            "verse 45:23": "Hast du den gesehen, der sich sein eigen Gelüst zum Gott nimmt und den Allah zum Irrenden erklärt auf Grund (Seines) Wissens und dem Er Ohren und Herz versiegelt und auf dessen Augen Er eine Decke gelegt hat? Wer sollte ihn wohl richtig führen außer Allah? Wollt ihr euch da nicht ermahnen lassen?",
                            "verse 45:24": "Und sie sprechen: «Es gibt nichts als dies unser Leben hienieden; wir sterben und wir leben, und nichts als die Zeit vernichtet uns.",
                            "verse 45:25": "Und wenn ihnen Unsere deutlichen Zeichen vorgetragen werden, so ist ihr Einwand nur der, daß sie sagen: «Bringt unser Väter (zurück), wenn ihr wahrhaftig seid.",
                            "verse 45:26": "Sprich: «Allah gibt euch Leben und läßt euch drauf sterben; dann wird Er euch versammeln zum Tage der Auferstehung; daran ist kein Zweifel.",
                            "verse 45:27": "Allahs ist die Herrschaft über die Himmel und die Erde; und an dem Tage, wenn die «Stunde» kommen soll, an jenem Tage werden die Lügner zugrunde gehn.",
                            "verse 45:28": "Und du wirst jedes Volk knien sehn.",
                            "verse 45:29": "Das ist Unser Buch; es redet zu euch in Wahrheit.",
                            "verse 45:30": "Was nun die betrifft, die glaubten und gute Werke vollbrachten, so wird ihr Herr sie führen in Seine Barmherzigkeit.",
                            "verse 45:31": "Doch zu jenen, die ungläubig waren: «Sind euch Meine Zeichen nicht vorgetragen worden? Ihr aber wart hoffärtig, und ihr wurdet ein sündiges Volk.",
                            "verse 45:32": "Und als gesprochen wurde: \"Die Verheißung Allahs ist wahr, und über die «Stunde» ist kein Zweifel\", da spracht ihr: \"Wir wissen nicht, was die «Stunde» ist; wir halten (sie) für einen Wahn, und wir sind nicht überzeugt.",
                            "verse 45:33": "Und die bösen Folgen ihres Tuns werden ihnen offenbar werden, und das, worüber sie zu spotten pflegten, soll sie umfangen.",
                            "verse 45:34": "Und es wird gesprochen werden: «Heute haben Wir euch vergessen, wie ihr das Eintreffen dieses eures Tags vergaßet.",
                            "verse 45:35": "Dies, weil ihr Allahs Zeichen zum Gespött machtet und das Leben in dieser Welt euch betrog.",
                            "verse 45:36": "Aller Preis denn sei Allah, dem Herrn der Himmel und dem Herrn der Erde, dem Herrn der Welten!",
                            "verse 45:37": "Sein ist die Herrlichkeit in den Himmeln und auf Erden; und Er ist der Allmächtige, der Allweise."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "gk ehe",
                            "verse 45:2": ";s fdrkc ¼d+qjku½ [+kqnk dh rjQ ls ukft+y gqbZ gS tks x+kfyc vkSj nkuk gS",
                            "verse 45:3": "cs’kd vkleku vkSj t+ehu esa bZeku okyksa ds fy, ¼d+qnjrs [++kqnk dh½ cgqr lh fu’kkfu;k¡ gSa",
                            "verse 45:4": "vkSj rqEgkjh iSnkb’k esa ¼Hkh½ vkSj ftu tkuojksa dks og ¼t+ehu ij½ QSykrk jgrk gS ¼muesa Hkh½ ;d+hu djus okyksa ds okLrs cgqr lh fu’kkfu;k¡ gSa",
                            "verse 45:5": "vkSj jkr fnu ds vkus tkus esa vkSj [+kqnk us vkleku ls tks ¼t+fj;k½ fjt+d ¼ikuh½ ukft+y Qjek;k fQj mlls t+ehu dks mlds ej tkus ds ckn ft+Unk fd;k ¼mlesa½ vkSj gokvksa Qsj cny esa vD+yeUn yksxksa ds fy, cgqr lh fu’kkfu;k¡ gSa",
                            "verse 45:6": ";s [+kqnk dh vk;rsa gSa ftudks ge Bhd ¼Bhd½ rqEgkjs lkeus i<+rs gSa rks [+kqnk vkSj mldh vk;rksa ds ckn dkSu lh ckr gksxh",
                            "verse 45:7": "ftl ij ;s yksx bZeku yk,axs gj >wBs xqukgxkj ij vQlksl gS",
                            "verse 45:8": "fd [+kqnk dh vk;rsa mlds lkeus i<+h tkrh gSa vkSj og lqurk Hkh gS fQj x++q:j ls ¼dqÝ+ ij½ vM+k jgrk gS xks;k mlus mu vk;rksa dks lquk gh ugha rks ¼,s jlwy½ rqe mls nnZukd vt+kc dh [+kq’k[+kcjh ns nks",
                            "verse 45:9": "vkSj tc gekjh vk;rksa esa ls fdlh vk;r ij okfd+Q+ gks tkrk gS rks mldh g¡lh mM+krk gS ,sls gh yksxksa ds okLrs t+yhy djus okyk vt+kc gS",
                            "verse 45:10": "tgUuqe rks muds ihNs gh ¼ihNs½ gS vkSj tks dqN og vkeky djrs jgs u rks ogh muds dqN dke vk,¡xs vkSj u ftudks mUgksaus [+kqnk dks NksM+dj ¼vius½ ljijLr cuk, Fks vkSj muds fy, cM+k ¼l[+r½ vt+kc gS",
                            "verse 45:11": ";s ¼d++qjku½ gS vkSj ftu yksxksa us vius ijojfnxkj dh vk;rksa ls bUdkj fd;k muds fy, l[+r fdLe dk nnZukd vt+kc gksxk",
                            "verse 45:12": "[+kqnk gh rks gS ftlus nfj;k dks rqEgkjs d+kcw esa dj fn;k rkfd mlds gqDe ls mlesa df’r;k¡ pysa vkSj rkfd mlds Qt+y ¼o dje½ ls ¼evk’k dh½ ryk’k djks vkSj rkfd rqe ÓqØ djks",
                            "verse 45:13": "vkSj tks dqN vklekuksa esa gS vkSj tks dqN t+ehu esa gS lcdks vius ¼gqDe½ ls rqEgkjs dke esa yxk fn;k gS tks yksx x+kSj djrs gSa muds fy, blesa ¼d++qnjrs [+kqnk dh½ cgqr lh fu’kkfu;k¡ gSa",
                            "verse 45:14": "¼,s jlwy½ eksfeuksa ls dg nks fd tks yksx [+kqnk ds fnuksa dh ¼tks tt+k ds fy, eqd+jZj gSa½ roD+d+ks ugha j[krs muls njxqt+j djsa rkfd og yksxksa ds vkeky dk cnyk ns",
                            "verse 45:15": "tks Ó[+l usd dke djrk gS rks [k+kl vius fy, vkSj cqjk dke djsxk rks ml dk ocky mlh ij gksxk fQj ¼vkf[+kj½ rqe vius ijojfnxkj dh rjQ ykSVk, tkvksxs",
                            "verse 45:16": "vkSj geus cuh bljkbZy dks fdrkc ¼rkSjsr½ vkSj gqdwer vkSj ucwor vrk dh vkSj mUgsa mEnk mEnk pht+sa [kkus dks nha vkSj mudks lkjs tgkWu ij Q+t+hyr nh",
                            "verse 45:17": "vkSj mudks nhu dh [kqyh gqbZ nyhysa buk;r dh rks mu yksxksa us bYe vk pqdus ds ckn cl vkil dh ft+n esa ,d nwljs ls ,[+rsykQ+ fd;k fd ;s yksx ftu ckrksa ls ,[+rsykQ+ dj jgsa gSa d+;ker ds fnu rqEgkjk ijojfnxkj muesa QSlyk dj nsxk",
                            "verse 45:18": "fQj ¼,s jlwy½ geus rqedks nhu ds [kqys jkLrs ij d+k;e fd;k gS rks blh ¼jkLrs½ ij pys tkvks vkSj uknkuksa dh [+okfg’kks dh iSjoh u djks",
                            "verse 45:19": ";s yksx [+kqnk ds lkeus rqEgkjs dqN Hkh dke u vk,¡xs vkSj t+kfye yksx ,d nwljs ds ennxkj gSa vkSj [+kqnk rks ijgst+xkjksa dk ennxkj gS",
                            "verse 45:20": ";s ¼d++qjku½ yksxksa ¼dh½ fgnk;r ds fy, nyhyks dk etewvk gS vkSj ckrsa djus okys yksxksa ds fy, ¼vt+ljrkik½ fgnk;r o jger gS",
                            "verse 45:21": "tks yksx cqjk dke fd;k djrs gSa D;k og ;s le>rs gSa fd ge mudks mu yksxksa ds cjkcj dj nsaxs tks bZeku yk, vkSj vPNs vPNs dke Hkh djrs jgs vkSj mu lc dk thuk ejuk ,d lk gksxk ;s yksx ¼D;k½ cqjs gqDe yxkrs gSa",
                            "verse 45:22": "vkSj [+kqnk us lkjs vkleku o t+ehu dks fgder o elysgr ls iSnk fd;k vkSj rkfd gj Ó[+l dks mlds fd;s dk cnyk fn;k tk, vkSj mu ij ¼fdlh rjg dk½ t++qYe ugha fd;k tk,xk",
                            "verse 45:23": "Hkyk rqeus ml Ó[+l dks Hkh ns[kk gS ftlus viuh uQfl;kuh [+kokfg’kksa dks ekcwn cuk j[kk gS vkSj ¼mldh gkyr½ le> cw> dj [+kqnk us mls xqejkgh esa NksM+ fn;k gS vkSj mlds dku vkSj fny ij vyker eqd+jZj dj nh gS ¼fd ;s bZeku u yk,xk½ vkSj mldh vk¡[k ij inkZ Mky fn;k gS fQj [+kqnk ds ckn mldh fgnk;r dkSu dj ldrk gS rks D;k rqe yksx ¼bruk Hkh½ x+kSj ugha djrs",
                            "verse 45:24": "vkSj og yksx dgrs gSa fd gekjh ft+Unxh rks cl nqfu;k gh dh gS ¼;gha½ ejrs gSa vkSj ¼;gha½ thrs gSa vkSj gedks cl t+ekuk gh ¼ftykrk½ ekjrk gS vkSj mudks bldh dqN [+kcj rks gS ugha ;s yksx rks cl vVdy dh ckrsa djrs gSa",
                            "verse 45:25": "vkSj tc muds lkeus gekjh [kqyh [kqyh vk;rsa i<+h tkrh gSa rks mudh dV gqTtrh cl ;gh gksrh gS fd og dgrs gSa fd vxj rqe lPps gks rks gekjs cki nknkvksa dks ¼ftyk dj½ ys rks vkvks",
                            "verse 45:26": "¼,s jlwy½ rqe dg nks fd [+kqnk gh rqedks ft+Unk ¼iSnk½ djrk gS vkSj ogh rqedks ekjrk gS fQj ogh rqedks d+;ker ds fnu ftl ¼ds gksus½ esa fdlh rjg dk Ód ugha tek djsxk exj vDlj yksx ugha tkurs",
                            "verse 45:27": "vkSj lkjs vkleku o t+ehu dh ckn’kkgr [+kkl [+kqnk dh gS vkSj ftl jkst+ d+;ker cjik gksxh ml jkst+ ,gys ckfry cM+s ?kkVs esa jgsaxs",
                            "verse 45:28": "vkSj ¼,s jlwy½ rqe gj mEer dks ns[kksxs fd ¼QSlys dh eqUrft+j vnc ls½ ?kwVuksa ds cy cSBh gksxh vkSj gj mEer vius ukek, vkeky dh rjQ cqykb tk,xh tks dqN rqe yksx djrs Fks vkt rqedks mldk cnyk fn;k tk,xk",
                            "verse 45:29": ";s gekjh fdrkc ¼ftlesa vkeky fy[ks gSa½ rqEgkjs eqd+kcys esa Bhd Bhd cksy jgh gS tks dqN Hkh rqe djrs Fks ge fy[kokrs tkrs Fks",
                            "verse 45:30": "x+jt+ ftu yksxksa us bZeku d+qcwy fd;k vkSj vPNs ¼vPNs½ dke fd;s rks mudks mudk ijojfnxkj viuh jger ¼ls csfg’r½ esa nkf[+ky djsxk ;gh rks ljhgh dke;kch gS",
                            "verse 45:31": "vkSj ftUgksaus dqÝ ,[+rs;kj fd;k ¼muls dgk tk,xk½ rks D;k rqEgkjs lkeus gekjh vk;rsa ugha i<+h tkrh Fkha ¼t+:j½ rks rqeus rdCcqj fd;k vkSj rqe yksx rks xqusgxkj gks x,",
                            "verse 45:32": "vkSj tc ¼rqe ls½ dgk tkrk Fkk fd [+kqnk dk ok;nk lPpk gS vkSj d+;ker ¼ds vkus½ esa dqN Óqcgk ugha rks rqe dgrs Fks fd ge ugha tkurs fd d+;ker D;k pht+ gS ge rks cl ¼mls½ ,d [+;kyh ckr le>rs gSa vkSj ge rks ¼mldk½ ;d+hu ugha j[krs",
                            "verse 45:33": "vkSj muds djrwrksa dh cqjkbZ;k¡ ml ij t+kfgj gks tk,¡xh vkSj ftl ¼vt+kc½ dh ;s g¡lh mM+k;k djrs Fks mUgsa ¼gj rjQ ls½ ?ksj ysxk",
                            "verse 45:34": "vkSj ¼muls½ dgk tk,xk fd ftl rjg rqeus ml fnu ds vkus dks Hkqyk fn;k Fkk mlh rjg vkt ge rqedks viuh jger ls venu Hkqyk nsaxs vkSj rqEgkjk fBdkuk nkst+[k+ gS vkSj dksbZ rqEgkjk ennxkj ugha",
                            "verse 45:35": ";s bl lcc ls fd rqe yksxksa us [+kqnk dh vk;rksa dks g¡lh BV~Bk cuk j[kk Fkk vkSj nqu;koh ft+Unxh us rqedks /kks[ks esa Mky fn;k Fkk x+jt+ ;s yksx u rks vkt nqfu;k ls fudkys tk,¡xs vkSj u mudks bldk ekSdk fn;k tk,xk fd ¼rkSck djds [+kqnk dks½ jkt+h dj ys",
                            "verse 45:36": "il lc rkjhQ [+kqnk gh ds fy, lt+kokj gS tks lkjs vkleku dk ekfyd vkSj t+ehu dk ekfyd ¼x+jt+½ lkjs tgkWu dk ekfyd gS",
                            "verse 45:37": "vkSj lkjs vkleku o t+ehu esa mlds fy, cM+kbZ gS vkSj ogh ¼lc ij½ x+kfyc fgder okyk gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Haa Miim.",
                            "verse 45:2": "Kitab (ini) diturunkan dari Allah Yang Maha Perkasa lagi Maha Bijaksana.",
                            "verse 45:3": "Sesungguhnya pada langit dan bumi benar-benar terdapat tanda-tanda (kekuasaan Allah) untuk orang-orang yang beriman.",
                            "verse 45:4": "Dan pada penciptaan kamu dan pada binatang-binatang yang melata yang bertebaran (di muka bumi) terdapat tanda-tanda (kekuasaan Allah) untuk kaum yang meyakini,",
                            "verse 45:5": "dan pada pergantian malam dan siang dan hujan yang diturunkan Allah dari langit lalu dihidupkan-Nya dengan air hujan itu bumi sesudah matinya; dan pada perkisaran angin terdapat pula tanda-tanda (kekuasaan Allah) bagi kaum yang berakal.",
                            "verse 45:6": "Itulah ayat-ayat Allah yang Kami membacakannya kepadamu dengan sebenarnya; maka dengan perkataan manakah lagi mereka akan beriman sesudah (kalam) Allah dan keterangan-keterangan-Nya.",
                            "verse 45:7": "Kecelakaan yang besarlah bagi tiap-tiap orang yang banyak berdusta lagi banyak berdosa,",
                            "verse 45:8": "dia mendengar ayat-ayat Allah dibacakan kepadanya kemudian dia tetap menyombongkan diri seakan-akan dia tidak mendengarnya.",
                            "verse 45:9": "Dan apabila dia mengetahui barang sedikit tentang ayat-ayat Kami, maka ayat-ayat itu dijadikan olok-olok.",
                            "verse 45:10": "Di hadapan mereka neraka Jahannam dan tidak akan berguna bagi mereka sedikitpun apa yang telah mereka kerjakan, dan tidak pula berguna apa yang mereka jadikan sebagai sembahan-sembahan (mereka) dari selain Allah.",
                            "verse 45:11": "Ini (Al Qur’an) adalah petunjuk.",
                            "verse 45:12": "Allahlah yang menundukkan lautan untukmu supaya kapal-kapal dapat berlayar padanya dengan seizin-Nya, dan supaya kamu dapat mencari sebagian karunia-Nya dan mudah-mudahan kamu bersyukur.",
                            "verse 45:13": "Dan Dia menundukkan untukmu apa yang ada di langit dan apa yang ada di bumi semuanya, (sebagai rahmat) daripada-Nya.",
                            "verse 45:14": "Katakanlah kepada orang-orang yang beriman hendaklah mereka mema’afkan orang-orang yang tiada takut akan hari-hari Allah karena Dia akan membalas sesuatu kaum terhadap apa yang telah mereka kerjakan.",
                            "verse 45:15": "Barangsiapa yang mengerjakan amal yang saleh maka itu adalah untuk dirinya sendiri, dan barangsiapa mengerjakan kejahatan, maka itu akan menimpa dirinya sendiri, kemudian kepada Tuhanmulah kamu dikembalikan.",
                            "verse 45:16": "Dan sesungguhnya telah Kami berikan kepada Bani Israil Al Kitab (Taurat), kekuasaan dan kenabian dan Kami berikan kepada mereka rezki-rezki yang baik dan Kami lebihkan mereka atas bangsa-bangsa (pada masanya).",
                            "verse 45:17": "Dan Kami berikan kepada mereka keterangan-keterangan yang nyata tentang urusan (agama); maka mereka tidak berselisih melainkan sesudah datang kepada mereka pengetahuan karena kedengkian (yang ada) di antara mereka.",
                            "verse 45:18": "Kemudian Kami jadikan kamu berada di atas suatu syari’at (peraturan) dari urusan (agama) itu, maka ikutilah syari’at itu dan janganlah kamu ikuti hawa nafsu orang-orang yang tidak mengetahui.",
                            "verse 45:19": "Sesungguhnya mereka sekali-kali tidak akan dapat menolak dari kamu Sedikitpun dari (siksaan) Allah.",
                            "verse 45:20": "Al Qur'an ini adalah pedoman bagi manusia, petunjuk dan rahmat bagi kaum yang meyakini.",
                            "verse 45:21": "Apakah orang-orang yang membuat kejahatan itu menyangka bahwa Kami akan menjadikan mereka seperti orang-orang yang beriman dan mengerjakan amal yang saleh, yaitu sama antara kehidupan dan kematian mereka? Amat buruklah apa yang mereka sangka itu.",
                            "verse 45:22": "Dan Allah menciptakan langit dan bumi dengan tujuan yang benar dan agar dibalasi tiap-tiap diri terhadap apa yang dikerjakannya, dan mereka tidak akan dirugikan.",
                            "verse 45:23": "Maka pernahkah kamu melihat orang yang menjadikan hawa nafsunya sebagai tuhannya, dan Allah membiarkannya sesat berdasarkan ilmu-Nya dan Allah telah mengunci mati pendengaran dan hatinya dan meletakkan tutupan atas penglihatannya? Maka siapakah yang akan memberinya petunjuk sesudah Allah (membiarkannya sesat).",
                            "verse 45:24": "Dan mereka berkata: \"Kehidupan ini tidak lain hanyalah kehidupan di dunia saja, kita mati dan kita hidup dan tidak ada yang membinasakan kita selain masa\", dan mereka sekali-kali tidak mempunyai pengetahuan tentang itu, mereka tidak lain hanyalah menduga-duga saja.",
                            "verse 45:25": "Dan apabila dibacakan kepada mereka ayat-ayat Kami yang jelas, tidak ada bantahan mereka selain dari mengatakan: \"Datangkanlah nenek moyang kami jika kamu adalah orang-orang yang benar\".",
                            "verse 45:26": "Katakanlah: \"Allah-lah yang menghidupkan kamu kemudian mematikan kamu, setelah itu mengumpulkan kamu pada hari kiamat yang tidak ada keraguan padanya; akan tetapi kebanyakan manusia tidak mengetahui.",
                            "verse 45:27": "Dan hanya kepunyaan Allah kerajaan langit dan bumi.",
                            "verse 45:28": "Dan (pada hari itu) kamu lihat tiap-tiap umat berlutut.",
                            "verse 45:29": "(Allah berfirman): \"Inilah kitab (catatan) Kami yang menuturkan terhadapmu dengan benar.",
                            "verse 45:30": "Adapun orang-orang yang beriman dan mengerjakan amal yang saleh maka Tuhan mereka memasukkan mereka ke dalam rahmat-Nya (surga).",
                            "verse 45:31": "Dan adapun orang-orang yang kafir (kepada mereka dikatakan): \"Maka apakah belum ada ayat-ayat-Ku yang dibacakan kepadamu lalu kamu menyombongkan diri dan kamu jadi kaum yang berbuat dosa?\"",
                            "verse 45:32": "Dan apabila dikatakan (kepadamu): \"Sesungguhnya janji Allah itu adalah benar dan hari berbangkit itu tidak ada keraguan padanya\", niscaya kamu menjawab: \"Kami tidak tahu apakah hari kiamat itu, kami sekali-kali tidak lain hanyalah menduga-duga saja dan kami sekali-kali tidak meyakini (nya)\".",
                            "verse 45:33": "Dan nyatalah bagi mereka keburukan-keburukan dari apa yang mereka kerjakan dan mereka diliputi oleh (azab) yang mereka selalu memperolok-olokkannya.",
                            "verse 45:34": "Dan dikatakan (kepada mereka): \"Pada hari ini Kami melupakan kamu sebagaimana kamu telah melupakan pertemuan (dengan) harimu ini dan tempat kembalimu ialah neraka dan kamu sekali-kali tidak memperoleh penolong.",
                            "verse 45:35": "Yang demikian itu, karena sesungguhnya kamu menjadikan ayat-ayat Allah sebagai olok-olokan dan kamu telah ditipu oleh kehidupan dunia, maka pada hari ini mereka tidak dikeluarkan dari neraka dan tidak pula mereka diberi kesempatan untuk bertaubat.",
                            "verse 45:36": "Maka bagi Allah-lah segala puji, Tuhan langit dan Tuhan bumi, Tuhan semesta alam.",
                            "verse 45:37": "Dan bagi-Nyalah keagungan di langit dan di bumi, Dialah Yang Maha Perkasa lagi Maha Bijaksana."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Hâ', Mîm .",
                            "verse 45:2": "La rivelazione del Libro proviene da Allah, l'Eccelso, il Saggio.",
                            "verse 45:3": "In verità nei cieli e sulla terra ci sono segni per coloro che credono,",
                            "verse 45:4": "nella vostra creazione e negli animali che dissemina [sulla terra], ci sono segni per coloro che credono con fermezza.",
                            "verse 45:5": "Nell'alternarsi della notte e del giorno, nell'acqua che Allah fa scendere dal cielo e per mezzo della quale vivifica la terra dopo che era morta, nel dispiegarsi dei venti, ci sono segni per coloro che ragionano.",
                            "verse 45:6": "Ecco i versetti di Allah, che noi ti recitiamo in tutta verità.",
                            "verse 45:7": "di Allah ?",
                            "verse 45:8": "Guai ad ogni bugiardo peccatore,",
                            "verse 45:9": "che ode recitare davanti a sé i versetti di Allah, ma insiste nella sua superbia, come se non li avesse affatto uditi! Annunciagli dunque un doloroso castigo.",
                            "verse 45:10": "Se impara qualcuno dei Nostri versetti, li volge in scherno.",
                            "verse 45:11": "li attende l'Inferno.",
                            "verse 45:12": "Questa è la guida .",
                            "verse 45:13": "Allah è Colui che ha messo il mare al vostro servizio, affinché vi scivoli la nave per ordine Suo e voi vi procuriate la Sua grazia, affinché siate riconoscenti.",
                            "verse 45:14": "E vi ha sottomesso tutto quello che è nei cieli e sulla terra: tutto",
                            "verse 45:15": "da Lui.",
                            "verse 45:16": "Di' ai credenti di perdonare coloro che non sperano nei Giorni di Allah:",
                            "verse 45:17": "compenserà ogni popolo per quello che si è meritato.",
                            "verse 45:18": "Chi fa il bene, lo fa per se stesso, e chi fa il male lo fa contro di sé.",
                            "verse 45:19": "Già abbiamo dato ai Figli di Israele la Scrittura, la saggezza e la profezia.",
                            "verse 45:20": "Demmo loro prove evidenti del",
                            "verse 45:21": "Ordine ; non si divisero, astiosi gli uni con gli altri se non dopo che giunse loro la scienza.",
                            "verse 45:22": "In seguito ti abbiamo posto sulla via dell'Ordine .",
                            "verse 45:23": "Non potranno giovarti in nulla contro Allah.",
                            "verse 45:24": "Questo",
                            "verse 45:25": "per gli uomini, è un appello al veder chiaro, una guida e una misericordia per coloro che credono fermamente.",
                            "verse 45:26": "Coloro che commettono il male credono che Noi li tratteremo alla stessa stregua di coloro che credono e compiono il bene, come se fossero uguali nella loro vita e nella loro morte ? Come giudicano male!",
                            "verse 45:27": "Allah creò in tutta verità i cieli e la terra, affinché ogni uomo sia compensato per quel che avrà fatto.",
                            "verse 45:28": "Non ha visto quello che assume a divinità le sue passioni ? Allah scientemente lo allontana, suggella il suo udito e il suo cuore e stende un velo sui suoi occhi.",
                            "verse 45:29": "Dicono: « Non c'è che questa vita terrena: viviamo e moriamo; quello che ci uccide è il tempo che passa».",
                            "verse 45:30": "Quando vengono recitati a loro i Nostri versetti espliciti, non hanno altro argomento eccetto: « Fate risorgere i nostri avi, se siete sinceri».",
                            "verse 45:31": "Di': « Allah vi dà la vita e poi vi dà la morte, quindi vi riunirà nel Giorno della Resurrezione.",
                            "verse 45:32": "",
                            "verse 45:33": "ad Allah la sovranità dei cieli e della terra; e nel Giorno in cui scoccherà l'Ora, saranno perduti i seguaci della falsità.",
                            "verse 45:34": "E vedrai ogni comunità genuflessa.",
                            "verse 45:35": "Ecco il Nostro Libro che rivela la verità su di voi: sì, abbiamo tenuto nota di",
                            "verse 45:36": "ciò che facevate.",
                            "verse 45:37": "Quanto a coloro che avranno creduto e compiuto il bene, il Signore li accoglierà nella Sua misericordia.",
                            "verse 45:38": "A coloro che invece non avranno creduto [sarà detto]: « Non vi sono stati recitati i Miei versetti? Ma eravate superbi ed eravate un popolo di malvagi.",
                            "verse 45:39": "Quando si diceva: «In verità la promessa di Allah è veritiera e non c'è dubbio alcuno sull'Ora», voi rispondevate: « Non sappiamo cos'è l'Ora, facciamo solo supposizioni, senza peraltro esserne convinti».",
                            "verse 45:40": "Appariranno loro [le conseguenze] di quel che avranno fatto e ciò di cui si burlavano li avvolgerà .",
                            "verse 45:41": "E sarà detto loro: «Oggi Noi vi dimentichiamo, come voi dimenticavate l'incontro di questo vostro Giorno.",
                            "verse 45:42": "Ciò perché schernivate i segni di Allah e vi seduceva la vita terrena».",
                            "verse 45:43": "La lode appartiene ad Allah, Signore dei cieli e della terra, Signore dei mondi.",
                            "verse 45:44": "",
                            "verse 45:45": "a Lui la magnificenza dei cieli e della terra."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "ハー・ミーム。",
                            "verse 45:2": "この啓典の啓示は，偉力ならびなく英明な，アッラーから（下されたもの）である。",
                            "verse 45:3": "本当に天と地には，信者たちにとり種々の印がある。",
                            "verse 45:4": "またあなたがた自身の創造，そしてかれが（地上に）撤き散らされた生きとし生けるものには，信心堅固な者に対し，種々の印がある。",
                            "verse 45:5": "昼と夜との交替，またアッラーが天から下された糧，それによって死んでいる大地が甦ること，また風向きの変化にも，知性ある者への種々の印がある。",
                            "verse 45:6": "これらは，真理によってわれがあなたに読誦するアッラーの印である。アッラーとその啓示以外に，どんな説諭を（かれらは）信じようとするのか。",
                            "verse 45:7": "災いなるかな，凡ての罪深い嘘付き者たちよ。",
                            "verse 45:8": "アッラーの啓示がかれに読誦されるのを聞いても，なお強情，高慢で，それが聞こえないかのようである。それなら痛ましい懲罰をかれらに告げ知らせよ。",
                            "verse 45:9": "かれらは，わが啓示の一端を理解すると，それを嘲笑的にとる，これらの者には，恥ずべき懲罰がある。",
                            "verse 45:10": "かれらの行く先は地獄で，その行ったことは，かれらに役立つことは何もなく，また守護者として，アッラー以外に祈ったものも，役立たない。かれらには手痛い懲罰がある。",
                            "verse 45:11": "これが（真の）導きである。主の印を信じない者たちには，忌しく苦しい懲罰がある。",
                            "verse 45:12": "アッラーこそは海をあなたがたに従わせられた方で，かれの御命令によって，船はそこを航行し，あなたがたはかれの恩恵（の通商往来）を追求する。それであなたがたは，感謝するであろう。",
                            "verse 45:13": "またかれは，天にあり地にある凡のものを，（賜物として）あなたがたの用に服させられる。本当にこの中には，反省する者への印がある。",
                            "verse 45:14": "信仰する者たちに言え。アッラーの日を望まない者でもゆるしてやれ。なぜなら，現世でのかれらの所業に応じて，アッラーはかれら一団に来世で報いられるのだから。",
                            "verse 45:15": "誰でも善行をする者は自らを益し，悪行をする者は自らを損なう。それからあなたがたの主の御許に帰されるのである。",
                            "verse 45:16": "本当にわれは，イスラエルの子孫に啓典と英知と預言の天分を授け，様々の善い給養を与え，また諸民族よりも卓越させた。",
                            "verse 45:17": "またわれは（宗教の）事に就いて，かれらに明証を授けた。それで知識がかれらの許に来た後において，自分たちの間の族妬により，異論を唱えるようになった。本当にあなたの主は，異論を唱えたことに就いて，復活の日に御裁きになられる。",
                            "verse 45:18": "その後われは，あなたに命じ（正しい）道の上に置いた。それであなたはその（道）に従い，知識のない者の虚しい願望に従ってはならない。",
                            "verse 45:19": "本当にかれらは，あなたにとってアッラー（からの懲罰）に対し全く無力である。悪を行う者は，お互い同士友である。だがアッラーは，主を畏れる者の友である。",
                            "verse 45:20": "この（クルアーン）は，人びとに対する明証であり，導きであり，また信心の堅固な者への慈悲である。",
                            "verse 45:21": "あなたがたは，われが悪行を追求する者を，信仰して善行に動しむ者と同じに扱うとでも思うのか。（不信心者たちの）生（現世）と死（来世）が同じであるとでも思うのか。かれら（不信者）の判断こそ誤算である。",
                            "verse 45:22": "アッラーは，天と地を真理によって創造なされた。そして各人は，その行ったことに対して報いられ，不当に扱かわれることはないのである。",
                            "verse 45:23": "あなたがたは自分の虚しい願望を，神様として崇めている者を見ないか。アッラーは御承知のうえでかれを迷うに任せ，耳や心を封じ，目を覆われた。アッラーに（見放された）後，誰がかれを導けよう。あなたがたは，これでも訓戒を受け入れないのか。",
                            "verse 45:24": "かれらは言う。「有るものは，わたしたちには現世の生活だけです。わたしたちは生まれたり死んだりしますが，わたしたちを滅ほすのは，時の流れだけです」しかしかれらは，これに就いて何の知識もなく，只臆測するだけである。",
                            "verse 45:25": "われの明白な印がかれらに読誦されると，かれらの論法は只，「あなたの言葉が真実ならば，わたしたちの祖先を連れ戻しなさい」と言うだけである。",
                            "verse 45:26": "言ってやるがいい。「アッラーが，あなたがたに生を授け，それから死なせ，それから復活の日に，あなたがたを召集なされる。それに就いて疑いはない。だが，人びとの多くは，これを理解しない。」",
                            "verse 45:27": "天と地の大権は，アッラーの有である。時が，到来する日，虚偽に従う者は失敗者となる。",
                            "verse 45:28": "あなたは，各集団が跪きながら，夫々の集団で自分の記録の所に呼ばれるのを見よう。この日，あなたがたが行ったことに対して報いられるのである。",
                            "verse 45:29": "このわれの記録こそはあなたがたについて真実を語る。本当にわれは，あなたがたの行ったことを書き留めさせて置いた。",
                            "verse 45:30": "それで信仰し，善行に勤しんだ者，主はかれらを，慈悲の中に入らせられる。これは明らかに至福の成就である。",
                            "verse 45:31": "それから不信者に対しては，「われの啓示が，あなたがたに読誦されなかったのか。あなたがたは高慢で，犯罪者である。」（と言われよう）。",
                            "verse 45:32": "そして（かれらに向かって，）「アッラーの御約束は，本当に真実である。（審判の）時は，疑いの余地はないのである。」と告げられると，あなたがたは，「時が何であるのか，わたしたちには分りません。それは全く臆測に過ぎないと思います。だからわたしたちは，しっかりした確信など持てません。」と言った。",
                            "verse 45:33": "こうして，かれらの行った様々な悪がかれらに現われ，かれらの嘲笑していたことが，かれらをとり囲む。",
                            "verse 45:34": "仰せられよう。「今日われは，あなたがたを忘れるであろう。あなたがたが，この日の対面を忘れたように。あなたがたの住まいは業火である。あなたがたには，（もはや）助ける者はないのである。",
                            "verse 45:35": "それはあなたがたが，アッラーの印を嘲笑し，現世の生活があなたがたを欺いていたためである。それで今日は，そこから出して貰えず，また，（アッラーの）御恵みにもあずかれない。」",
                            "verse 45:36": "諸天の主，大地の主。万有の主，アッラーにこそ凡ての称讃あれ。",
                            "verse 45:37": "天と地における，尊厳は，かれ（だけ）のものである。かれは偉力ならびなく英明であられる。 諸天の主，大地の主。万有の主，アッラーにこそ凡ての称讃あれ。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "하 밈",
                            "verse 45:2": "이것은 권능과 지혜로 충만하신 하나님으로부터 계시된 성서 라",
                            "verse 45:3": "실로 하늘과 대지에 믿는 사 람들을 위한 예증이 있으며",
                            "verse 45:4": "너희를 창조한 것과 대지위에 산재하여 있는 것도 믿는 자들을 위한 예증이라",
                            "verse 45:5": "낮과 밤이 교차되는 것도 하 나님께서 하늘로부터 일용할 양식 을 주시는 것도 그리고 죽은 대지를 소생케하며 바람의 방향을변화시키는 것도 이해하는 백성 들을 위한 예증이라",
                            "verse 45:6": "그것들이 하나님께서 진리로 써 그대에게 낭송한 그분의 예증 들이라 그래도 하나님과 그분의 예증을 거역한다면 그들은 어떤 말을 믿는단 말이뇨",
                            "verse 45:7": "거짓하는 모든 죄인들에게 재앙이 있으리라",
                            "verse 45:8": "암송된 하나님의 말씀을 들은그가 그 말씀을 듣지 아니했던 것처럼 거만하고 오만해 하니 그에 게 고통스러운 응벌이 있을 것이 라고 전할",
                            "verse 45:9": "하나님의 예증을 들었을 때 그것들을 조롱한 그에게도 고통스러운 벌이 있으리라",
                            "verse 45:10": "그들 앞에는 지옥뿐이며 그들이 얻었던 어떤 것도 유용하지 아니하며 하나님 외에는 그들을 위해 어떤 보호자도 없나니 그들 에게는 무서운 응벌 밖엔 없노라",
                            "verse 45:11": "이것이 바로 길이라 그럼으로 주님의 예증을 거역하는 자 그들에게는 고통스러운 벌이 있을 뿐이라",
                            "verse 45:12": "바다로 하여금 너희에게 순 종케 하여 그분의 명령으로 배가 항해하게 하고 그것으로 인하여 그분의 은혜를 구하게 하신 분이 하나님이시라 그러므로 너희는 감 사하라",
                            "verse 45:13": "그분은 하늘과 대지위에 있 는 모든 것이 너희에게 순종토록 하였나니 실로 그 안에는 생각하 는 사람들을 위한 예증들이 있노 라",
                            "verse 45:14": "하나님의 날들을 두려워 하지 아니한 그들을 용서한 믿는 그들에게 일러 가로되 하나님은 그 들이 얻은 것에 따라 백성들에게 보상하시니라",
                            "verse 45:15": "의로움을 실천한 자 그것은자기의 영혼을 위해서요 악을 퍼 뜨린 자 그것은 스스로 역행되는 것으로 너희 모두가 너희 주님께 귀의하노라",
                            "verse 45:16": "실로 하나님은 이스라엘 자손들에게 성서와 주권과 예언 자들을 주었으며 또한 다른 백성 에 우선하여 좋은 일용할 양식을 주었노라",
                            "verse 45:17": "그리고 하나님은 그들의 종교에 분명한 예증을 주었으되 그 들 가운데 시기와 질투로 인하여 그들에게 지식이 이를때 까지는 의견을 달리하지 아니했노라 실로주님께서 부활의 날 그들이 의견 을 달리했던 것에 관하여 심판을 하시리라",
                            "verse 45:18": "그후 하나님은 그대를 바른 길 위에 두었으니 그대는 그 길 을 따르되 알지 못하는 자들의 유 혹을 따르지 말라",
                            "verse 45:19": "그들은 하나님 앞에서 그대 에게 유용치 못하니라 죄인들은 서로가 서로에게 친구가 되어 주 나 하나님은 의로운 자들만의 보 호자가 되어 주시노라",
                            "verse 45:20": "이것이 인간을 위한 빛이요 길이며 의로운 백성을 위한 은혜라",
                            "verse 45:21": "하나님께서는 사악한 행위를 한 자들의 생명과 죽음을 믿음으 로 선을 행하는 자들과 같게 할 것이라 생각하느뇨 그렇게 판단 하는 것은 크게 잘못된 것이라",
                            "verse 45:22": "하나님께서 진리로 천지를 창조하사 모든 인간이 얻고자 하 는 것을 얻게 하시니 어느 누구도 부정하게 다루어지지 않노라",
                            "verse 45:23": "멋대로 신을 만들어 내는 자 를 그대가 보리니 하나님은 그를 방황케 하셨으매 그의 귀와 마음 을 봉하여 버리고 그의 시각도 봉 하여 버렸으니 하나님 외에 누가 그를 인도하리요 그럼에도 너희 는 숙고하지 않느뇨",
                            "verse 45:24": "현세에서는 사는 것 외에 무엇이 있느뇨 우리가 죽으면 다른 세대가 살게 되리니 이것은 세월 이 그렇게 할 뿐이라고 말하니 실로 그들은 알지 못하고 단지 추측할 뿐이라",
                            "verse 45:25": "하나님의 말씀이 그들에게 낭송될 때 너희가 진실이라면 우 리의 선조들을 다시 이르게 하여 보라는 논쟁 밖엔 하지 못하더라",
                            "verse 45:26": "일러가로되 너희에게 생명을주사 생명을 앗아 가시며 의심할 수 없는 심판의 날 너희를 다시 모이도록 하시는 분은 하나님이시라 그러나 대다수의 사람들이 이 해하지 못하더라",
                            "verse 45:27": "하늘과 대지의 왕국이 하나 님의 것이며 심판의 시각이 확립 되어 있노라 그날이 되면 거짓했 던 그들은 멸망하게 되니라",
                            "verse 45:28": "그날 무릎을 꿇은 무리가 그들의 기록에 의해 불리워 가는 무리를 그대가 보리니 오늘은 너희 가 행한 것으로 보상을 받게 되리라는 소리가 들려 오더라",
                            "verse 45:29": "이것은 진리로써 너희에 대 하여 이야기 하여 줄 하나님의 기록으로 그분은 너희가 행한 것을 기록하시노라",
                            "verse 45:30": "믿음으로 의로움을 실천한 그들을 주님께서는 그분의 은혜 가운데 들게 하시니 그것이 최고 의 승리라",
                            "verse 45:31": "그러나 불신자들에게는 하나 님의 말씀이 너희에게 있지 아니 했느뇨 너희는 오만한 죄인들이었노라",
                            "verse 45:32": "하나님의 약속은 진리이며 의심할 바 없는 내세가 진리라는 말씀이 있었을 때 내세가 무엇이 뇨 그것은 하나의 생각에 불과한 것으로 생각하며 믿지 않는다고 너희는 말하곤 했노라",
                            "verse 45:33": "그때 그들이 행한 모든 악의결과가 나타나니 그들은 자신들이 조롱했던 것들에 의해 완전히 포 위 되더라",
                            "verse 45:34": "이날은 너희가 하나님과의 만남을 망각했던 것처럼 그분은 너희를 기억하지 아너 하리라 그러므로 너희의 거주지는 불지옥이며 너희는 구원자도 갖지 못하노라",
                            "verse 45:35": "이것은 너희가 하나님의 예 중들을 조롱했고 너희가 현세생활 에 유혹되었기 때문이라 그리하여 너희는 그날로부터 그곳에서 헤어 날 수도 없으며 은혜를 받을 수도 없노라",
                            "verse 45:36": "그러므로 하늘의 주님이요 대지의 주님이시며 만유의 주님이 신 하나님을 찬미하라",
                            "verse 45:37": "하늘과 대지를 통하여 영광 을 받으소서 하나님은 권능과 지 혜로 충만하신 분이시라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "سه‌رنجی ئایه‌تی1 (الشوری) لاپه‌ڕه‌483بده‌.",
                            "verse 45:2": "ئه‌م قورئانه له‌لایه‌ن خوای باڵاده‌ست و داناوه‌، هاتووه‌ته خواره‌وه‌.",
                            "verse 45:3": "به‌ڕاستی له ئاسمانه‌کان و زه‌ویدا به‌ڵگه‌و نیشانه‌ی زۆر هه‌ن ده‌رباره‌ی گه‌وره‌یی و ده‌سه‌ڵاتی په‌روه‌ردگار بۆ که‌سانێك که بڕوادارن.",
                            "verse 45:4": "هه‌روه‌ها له دروستکردنی ئێوه‌دا (له ئه‌ندامه‌کانی له‌شتاندا، له قوناغه‌کانی گه‌وره بوونتاندا، له جیاوازی نێرو مێتاندا.",
                            "verse 45:5": "هه‌روه‌ها له جیاوازی شه‌وو ڕۆژدا، له‌و ڕزق و ڕۆزیه‌ی که‌له ئاسمانه‌وه خوا باراندوویه‌تی (وه‌ك باران و تیشکی خۆرو گازه‌کان و.",
                            "verse 45:6": "ئه‌ی محمد صلی الله علیه وسلم ئا ئه‌وانه به‌ڵگه و نیشانه‌ی ده‌سه‌ڵاته‌کانی خوان، ده‌یخوێنینه‌وه به‌سه‌ر تۆدا سه‌رتاپای حه‌ق و ڕاسته‌قینه‌یه‌، جا دوای خواو فه‌رمانه‌کانی به چ گوتار و باسێکی تر باوه‌ڕ ده‌که‌ن و ئیمان ده‌هێنن.",
                            "verse 45:7": "هاوار و قوربه‌سه‌ری و ڕه‌نجه‌ڕۆیی ته‌نها بۆ هه‌موو ئه‌و که‌سانه‌ی که زۆر درۆزن و بوختانچی و تاوانبارن.",
                            "verse 45:8": "هه‌یانه گوێ ده‌گرێت بۆ ئایه‌ته‌کانی خوا کاتێك به‌سه‌ریدا ده‌خوێنرێته‌وه‌، له‌وه‌ودوا سوور ده‌بێت له‌سه‌ر بێ باوه‌ڕی و خۆی به‌زل ده‌زانێت، هه‌روه‌ك نه‌یبیستبێت، جا مژده‌ی سزاو ئازارێکی به‌ئێش بده به‌و جۆره که‌سانه‌!!",
                            "verse 45:9": "کاتێك شتێك له ئایه‌ت و فه‌رمانه‌کانی ئێمه‌ی پێ بگات و بیزانێت، ئه‌وه ده‌یکاته هۆی گاڵته‌و گه‌مه‌جاڕ، ئا ئه‌وانه سزای خه‌جاڵه‌ت ئاوه‌رو شه‌رمه‌زاری چاوه‌ڕێیانه هه‌ر له‌م دنیادا.",
                            "verse 45:10": "له قیامه‌تیشدا، دۆزه‌خ به‌دوایانه‌وه‌یه و لێی قوتارنابن، هه‌رچیه‌کیان کردبوو فریایان ناکه‌وێت (له ماڵ و هێزو ده‌سه‌ڵات)، هه‌موو ئه‌وانه‌ش که‌له جیاتی خوا کردبوویان به‌پاڵپشتی خۆیان، جا سزایه‌کی زۆر گه‌وره و سامناك بۆیان ئاماده‌یه‌.",
                            "verse 45:11": "ئه‌م قورئانه ڕێنموویی به‌خشه‌، به‌رچاو ڕوونکه‌ره‌وه‌یه‌، ڕێ نیشانده‌ره، ئه‌وانه‌ش که باوه‌ڕیان نه‌بوو به ئایه‌ت و فه‌رمووده‌کانی په‌روه‌ردگاریان سزایه‌کی زۆر سه‌خت و به ئێش چاوه‌ڕێیانه‌.",
                            "verse 45:12": "خوا ئه‌و زاته‌یه که ده‌ریای بۆ ڕام کردوون تا که‌شتی به فه‌رمانی ئه‌و هاتووچۆی پیادا بکات، تا بچن به‌ده‌م به‌خشش و به‌هره‌کانیه‌وه و ده‌ستان که‌وێت (له بازرگانی و ڕاوه ماسی و ده‌رهێنانی گه‌وهه‌ر و مرواری و.",
                            "verse 45:13": "هه‌رچی له ئاسمانه‌کان و زه‌ویدا هه‌یه بۆ ئێوه‌ی ڕام هێناوه‌، بۆ خزمه‌تگوزاری ئێوه فه‌راهه‌می هێناوه‌، هه‌موویشی تێکڕا به‌خششن له‌لایه‌ن ئه‌و زاته‌وه‌، به‌ڕاستی ئا له‌و به‌خشش و دیاردانه‌دا به‌ڵگه و نیشانه‌ی زۆرهه‌ن بۆ که‌سانێك که بیربکه‌نه‌وه و تێفکرن.",
                            "verse 45:14": "ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم بڵێ به‌وانه‌ی که ئیمانیان هێناوه‌: چاوپۆشی بکه‌ن له‌وانه‌ی به‌ته‌مای ڕۆژه سه‌خته‌کان نین که خوا پێشی ده‌هێنێت بۆ لێپرسینه‌وه‌یان، تا پاداشتی قه‌ومی نا‌له‌بار بداته‌وه به‌گوێره‌ی ئه‌و کاروکرده‌وه‌یه‌ی که ئه‌نجامی ده‌ده‌ن.",
                            "verse 45:15": "هه‌ر که‌سێك کاروکرده‌وه‌ی چاکی ئه‌نجام دابێت ئه‌وه سوود و قازانجه‌که‌ی بۆ خۆیه‌تی، هه‌روه‌ها ئه‌وه‌ش کاروکرده‌وه‌ی خراپی کردبێت ئه‌ویش له‌سه‌ر خۆی ده‌که‌وێت، له‌وه‌ودواش بۆ لای په‌روه‌ردگارتان ده‌گه‌ڕێنه‌وه‌.",
                            "verse 45:16": "سوێند به خوا بێگومان ئێمه ته‌وراتمان به‌خشی به نه‌وه‌ی ئیسرائیل هاوڕێ له‌گه‌ڵ ده‌سه‌ڵاتداری بۆ چاره‌سه‌رکردنی کێشه‌ی خه‌ڵکی، له‌گه‌ڵ پێغه‌مبه‌رایه‌تیشدا له چه‌نده‌ها ڕزق و ڕۆزی چاك و پاکیش به‌هه‌روه‌رمان کردن، زیاده ڕێزیشمان دان به‌سه‌ر هه‌موو خه‌ڵکی سه‌رده‌می خۆیاندا.",
                            "verse 45:17": "هه‌روه‌ها ئێمه چاره‌سه‌ری هه‌موو کارێکی گرنگمان بۆ ڕوونکردنه‌وه و پێمان به‌خشین (ده‌رباره‌ی عه‌قیده‌و شه‌ریعه‌ت و حه‌ڵاڵ و حه‌رام)، جا ناکۆکی و دووبه‌ره‌کیان له نێواندا به‌رپا نه‌بوو مه‌گه‌ر دوای ئه‌وه‌ی که هه‌موو شت ڕوون بۆوه و زانستیان بۆ هات، ئه‌وه‌ش به‌هۆی سته‌م و ناکۆکی و حه‌سوودی نێوان خۆیانه‌وه‌، به‌ڕاستی په‌روه‌ردگاری تۆ ئه‌ی محمد صلی الله علیه وسلم له ڕۆژی قیامه‌تدا داوه‌ری ده‌کات له نێوانیاندا ده‌رباره‌ی ئه‌و شتانه‌ی که ناکۆکیان له‌سه‌ری هه‌یه و ڕای جیاوازیان هه‌یه ده‌رباره‌ی.",
                            "verse 45:18": "له‌وه‌ودوا ئێمه تۆمان ئه‌ی محمد صلی الله علیه وسلم خستۆته سه‌ر به‌رنامه‌یه‌کی ڕاست و ڕه‌وان له هه‌موو کارو بارێکی ئه‌م ئاینه‌دا، که‌واته شوێنی بکه‌وه و لێی لامه‌ده‌، نه‌که‌ی شوێنی هه‌واو ئاره‌زووی ئه‌وان بکه‌ویت که نازانن و نافامن.",
                            "verse 45:19": "بێگومان ئه‌وانه هیچ کات فریات ناکه‌ون و له‌ده‌ستی خوا ڕزگارت ناکه‌ن (ئه‌گه‌ر خوا له‌خۆت بڕه‌نجێنیت و نافه‌رمانی بکه‌یت)، به‌ڕاستی سته‌م کاران یار و یاوه‌ری هه‌ندێکیانن، خوایش پشت و په‌نای خۆشه‌ویستی دیندارو چاکانه‌.",
                            "verse 45:20": "ئه‌م قورئان و به‌رنامه‌یه چه‌نده‌ها چاو ڕۆشنیه بۆ خه‌ڵکی و هیدایه‌ت و ڕێنمونی و ڕه‌حمه‌ته بۆ قه‌وم و که‌سانێك که باوه‌ڕ بهێنن و پێی دڵنیاو دڵئارام ببن.",
                            "verse 45:21": "ئایا ئه‌وانه‌ی که گوناهو تاوانه‌کانیان ئه‌نجام داوه‌، وایان زانیووه هه‌ر وه‌ك ئه‌وانه حسابیان بۆ ده‌که‌ین که ئیمانیان هێناوه و کاروکرده‌وه‌و چاکه‌کانیان ئه‌نجام داوه‌؟! ژیانی دنیاو مردن و دوای مردنیان وه‌ك یه‌ك ده‌بێت؟! ئای که بڕیاری خراپ بڕیار ده‌ده‌ن.",
                            "verse 45:22": "خوا ئاسمانه‌کان و زه‌وی له‌سه‌ر بنه‌مای حه‌ق و ڕاستی داناوه‌، بۆ ئه‌وه‌ی سه‌رئه‌نجام پاداشتی هه‌موو که‌سێك به‌گوێره‌ی کاروکرده‌وه‌کانی بداته‌وه و هیچ جۆره سته‌مێکیشیان لێ ناکرێت.",
                            "verse 45:23": "هه‌واڵم بده‌رێ ئایا ئه‌وکه‌سه‌ی که ویست و ئاره‌زووی خۆی کردۆته خوای خۆی؟! به‌هۆی ئه‌وه‌وه خوایش گومڕای کردووه که زانیوێتی شایه‌نی ئه‌وه‌یه‌، له ئه‌نجامی به‌د هه‌ڵوێستی خۆیدا و مۆری ناوه به ده‌زگای بیستن و دڵ و ده‌روونیدا و په‌رده‌شی هێناوه به‌سه‌ر چاوو ده‌زگای بینینیدا، جا ئیتر کێ هه‌یه جگه له خوا هیدایه‌ت و ڕێنمووی بکات، ئایا بیر ناکانه‌وه و ئامۆژگاری وه‌رناگرن.",
                            "verse 45:24": "خوانه‌ناسان ده‌یانوت: ژیان ته‌نها ئه‌م ژیانی دنیایه‌یه‌، ده‌مرین و ده‌ژین به نۆره‌، هه‌ر ڕۆژگارو زه‌مانه کایگه‌رن تیاماندا و ده‌مان مرێنن و هیچی تر! جا ئه‌وانه وه‌نه‌بێت له‌سه‌ر بنچینه‌ی هیچ جۆره زانستی و زانیاریه‌ك ئه‌وه بڵێن به‌ڵکو ته‌نها پشت به‌گومان و دوودڵی ده‌به‌ستن.",
                            "verse 45:25": "کاتێکیش ئایه‌ته‌کانی قورئانی ئێمه‌یان به‌سه‌ردا ده‌خوێنرێته‌وه (که به‌ڵگه‌ی زۆر به‌هێز و ڕوونی تێدایه له‌سه‌ر زیندووبوونه‌وه‌، هه‌موو به‌ڵگه‌یه‌کیان هاتۆته سه‌ر ئه‌وه‌ی) که ده‌ڵێن: ده‌باشه باوو باپیرانی مردوومان بۆ زیندوو بکه‌نه‌وه ئه‌گه‌ر ڕاست ده‌که‌ن؟! (شایه‌نی باسه که حه‌زره‌تی عیسا ئه‌و کاره‌ی بۆ خه‌ڵکی ئه‌نجام دا به ویستی خوا، که‌چی وتراوه‌: ئه‌مه سحروو جادووه‌)؟!",
                            "verse 45:26": "ئه‌ی پێغه‌مبه‌ر صلی الله علیه وسلم پێیان بڵێ: (ئه‌و شتانه به‌ده‌ست ئێمه نیه‌) ئه‌وه هه‌ر خوایه ژیانتان پێ ده‌به‌خشێت و پاشان ده‌تان مرێنێت و دوای ئه‌وه کۆتان ده‌کاته‌وه له ڕۆژی قیامه‌تدا که هیچ گومانی تیادانیه‌، به‌ڵام زۆربه‌ی خه‌ڵکی ئه‌مه نازانن.",
                            "verse 45:27": "هه‌ر خوا خاوه‌نی ئاسمانه‌کان و زه‌ویه‌، ئه‌و ڕۆژه‌ی که قیامه‌ت پێش دێت، هه‌ر ئه‌و ڕۆژه هه‌رچی به‌تاڵپه‌رست و ناحه‌ق په‌رستانه له زه‌ره‌رمه‌ندیه‌کی زۆر گه‌وره‌دا ده‌بن.",
                            "verse 45:28": "ئه‌و ڕۆژه ده‌بینیت هه‌موو خه‌ڵکی به چۆكدا هاتوون و له‌سه‌ر ئه‌ژنۆو په‌نجه‌کانیان ئاماده‌ن (هه‌ر که‌س چاوه‌ڕێ بانگ کردنه بۆ لێپرسینه‌وه‌، ئاماده‌یه ده‌ست به‌جێ ڕاپه‌ڕێت و ڕا بکات بۆ به‌رده‌م دادگای پڕ له دادی په‌روه‌ردگار) هه‌ر قه‌وم و هۆزێك بانگ ده‌کرێت بۆ لای ئه‌و کتێبه‌ی که بۆی ڕه‌وانه کراوه‌، یاخود بانگ ده‌کرێت بۆ لای نامه‌ی کرده‌وه‌کانی، ئه‌وسا پێیان ده‌وترێت: ئه‌مڕۆ ئیتر پاداشتی ئه‌و کاروکرده‌وانه‌ی که ده‌تان کرد ده‌درێته‌وه‌.",
                            "verse 45:29": "ئه‌مه ئێتر نامه‌ی کرده‌وه‌کانتانه که تۆمارمان کردووه له‌سه‌رتان، خۆی گوایه قسه ده‌کات و حه‌ق وێژه (دیاره کرده‌وه‌کانمان تۆمار کراوه له‌سه‌ر ده‌زگای زۆر پێشکه‌وتوو) چونکه به‌ڕاستی ئێمه کاتی خۆی ئه‌وه‌ی ئێوه ده‌تان کرد له‌به‌رمان ده‌گرته‌وه‌.",
                            "verse 45:30": "جا ئه‌و کاته ئه‌وانه‌ی باوه‌ڕیان هێناوه وه کاروکرده‌وه چاکه‌کانیان ئه‌نجام داوه‌، ئه‌وه په‌روه‌ردگاریان ده‌یانخاته ژێر سایه‌ی ڕه‌حمه‌ت و میهره‌بانی خۆیه‌وه‌، ته‌نها ئه‌وه سه‌رکه‌وتن و سه‌رفرازیه‌کی ئاشکرایه‌.",
                            "verse 45:31": "به‌ڵام ئه‌وانه‌ی که بێ بڕواو کافر بوون پێیان ده‌وترێت: باشه‌، ئێوه ئایه‌ته‌کانی منتان به‌سه‌ردا ده‌خوێنرایه‌وه‌؟! که‌چی خۆتان به‌گه‌وره‌و زل ده‌زانی، به‌ڕاستی ئێوه هۆزێکی تاوانبارو تاوانکار بوون.",
                            "verse 45:32": "کاتیکیش بوترایه‌: بێگومان به‌ڵێنی خوا ڕاسته و ڕۆژی قیامه‌ت هه‌ر دێت و گومانی تیادا نیه‌، ئێوه له وه‌ڵامدا ده‌تانوت: ئێمه هه‌ر نازانین ڕۆژی قیامه‌ت چیه‌؟! ئێمه هه‌ر گومان ده‌به‌ین و دڵنیا نین!!",
                            "verse 45:33": "ئه‌و کاته له قیامه‌تدا ئه‌و کاروکرده‌وه ناشرینیانه‌ی که کردوویانه بۆیان ده‌رده‌که‌وێت و ئاشکرا ده‌بێت، ئه‌وه‌ش که گاڵته‌یان پێده‌کرد و بڕوایان پێی نه‌بوو (که سزاو ئازاری دۆزه‌خه‌) له هه‌موو لایه‌که‌وه ده‌وریان ده‌دات و ڕێگه‌ی ڕزگارییان لێ ده‌بڕێت.",
                            "verse 45:34": "پێیان ده‌وترێت: له‌مڕۆ به‌دواوه ئیتر ئێوه فه‌رامۆش ده‌که‌ین و پشت گوێتان ده‌خه‌ین، هه‌روه‌ك چۆن ئێوه بڕوا بوونتان به‌م ڕۆژه فه‌رامۆش کرد، شوێنی نیشته‌جێ و حه‌وانه‌وه‌شتان ناو ئاگری دۆزه‌خه‌، که‌سیشتان ده‌ست ناکه‌وێت پشتیوانی و پشتگیریتان لێ بکات.",
                            "verse 45:35": "ئه‌م سه‌رئه‌نجامه‌ش بۆیه یه‌خه‌ی پێگرتن چونکه به‌ڕاستی کاتی خۆی گاڵته‌تان به ئایه‌ت و فه‌رمانه‌کانی خوا ده‌هات، ژیانی دنیاش غه‌ڕاو گومڕای کردبوون، ئه‌مڕۆ ئیتر ڕزگاربوونیان ئه‌سته‌مه له‌و ئاگری دۆزه‌خه لێی ده‌رناهێنرێن، داوای ئه‌وه‌شیان لێناکرێت خوا له‌خۆیان ڕازی بکه‌ن.",
                            "verse 45:36": "جا هه‌ر له بۆ خوایه سوپاس و ستایش، که په‌روه‌ردگاری ئاسمانه‌کانه‌، په‌روه‌ردگاری زه‌ویشه‌، په‌روه‌ردگاری هه‌موو جیهانیان.",
                            "verse 45:37": "هه‌رچی گه‌وره‌یی و شکۆمه‌ندی هه‌یه له ئاسمانه‌کان و زه‌ویدا هه‌ر شایسته‌ی ئه‌وه‌، به‌ڕاستی ئه‌و زاته باڵا ده‌ست و دانایه‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Haa, Miim.",
                            "verse 45:2": "Turunnya Al-Quran ini, dari Allah Yang Maha Kuasa, lagi Maha Bijaksana.",
                            "verse 45:3": "Sesungguhnya pada langit dan bumi terdapat tanda-tanda (yang membuktikan kekuasaan Allah) bagi orang-orang yang beriman.",
                            "verse 45:4": "Dan pada kejadian diri kamu sendiri, serta (pada kejadian) segala binatang yang dibiakkanNya, terdapat juga tanda-tanda (yang membuktikan kekuasaan Allah) bagi orang-orang yang meyakininya.",
                            "verse 45:5": "Dan (pada) pertukaran malam dan siang silih berganti dan juga (pada) rezeki yang diturunkan oleh Allah dari langit, lalu Dia hidupkan dengannya tumbuh-tumbuhan di bumi sesudah matinya, serta (pada) peredaran angin, (semuanya itu mengandungi) tanda-tanda (yang membuktikan keesaan Allah, kekuasaanNya, kebijaksanaanNya, serta keluasan rahmatNya) bagi kaum yang mahu menggunakan akal fikiran.",
                            "verse 45:6": "Itulah ayat-ayat penerangan Allah yang kami bacakan kepadamu (wahai Muhammad) kerana menegakkan kebenaran; maka dengan perkataan yang manakah lagi mereka hendak beriman, sesudah penerangan Allah dan tanda-tanda kekuasaanNya (mereka tidak mahu memahami dan menelitinya)?",
                            "verse 45:7": "Kecelakaanlah bagi tiap-tiap pendusta yang berdosa;",
                            "verse 45:8": "Yang mendengar ayat-ayat penerangan Allah sentiasa dibacakan kepadanya, kemudian dia terus berlagak sombong (enggan menerimanya), seolah-olah dia tidak mendengarnya; oleh itu gembirakanlah dia dengan azab seksa yang tidak terperi sakitnya.",
                            "verse 45:9": "Dan apabila sampai ke pengetahuannya sesuatu dari ayat-ayat penerangan Kami, dia menjadikannya ejek-ejekan; mereka yang demikian keadaannya, akan beroleh azab yang menghina.",
                            "verse 45:10": "Di hadapan mereka (di akhirat kelak) ada Neraka Jahannam (yang disediakan untuk mereka) dan apa jua yang mereka usahakan, tidak dapat menyelamatkan mereka sedikit pun; demikian juga yang mereka sembah atau puja selain Allah, tidak dapat memberikan sebarang perlindungan dan (kesudahannya) mereka akan beroleh azab seksa yang besar.",
                            "verse 45:11": "Al-Quran ini ialah hidayat petunjuk yang cukup lengkap dan orang-orang yang kufur ingkar akan ayat-ayat penerangan Tuhannya, mereka akan beroleh azab dari jenis azab seksa yang tidak terperi sakitnya.",
                            "verse 45:12": "Allah yang memudahkan laut bagi kegunaan kamu, supaya kapal-kapal belayar padanya dengan perintahNya dan supaya kamu mencari rezeki dari limpah kurniaNya dan juga supaya kamu bersyukur.",
                            "verse 45:13": "Dan Dia memudahkan untuk (faedah dan kegunaan) kamu, segala yang ada di langit dan yang ada di bumi, (sebagai rahmat pemberian) daripadaNya; sesungguhnya semuanya itu mengandungi tanda-tanda (yang membuktikan kemurahan dan kekuasaanNya) bagi kaum yang memikirkannya dengan teliti.",
                            "verse 45:14": "Katakanlah (wahai Muhammad) kepada orang-orang yang beriman: Hendaklah mereka memaafkan (kejahatan dan gangguan) orang-orang yang tidak menaruh ingatan kepada hari-hari (pembalasan yang telah ditentukan) Allah; (disuruh berbuat demikian), kerana Allah akan memberi kepada satu-satu puak: Balasan yang patut dengan apa yang mereka telah usahakan.",
                            "verse 45:15": "(Tiap-tiap balasan berdasarkan kaedah): Sesiapa yang mengerjakan amal soleh, maka faedahnya akan terpulang kepada dirinya sendiri dan sesiapa yang berbuat kejahatan, maka bahayanya akan menimpa dirinya sendiri; kemudian kamu akan dikembalikan kepada Tuhan kamu.",
                            "verse 45:16": "Dan demi sesungguhnya, Kami telah memberi kepada Bani Israil Kitab Taurat dan pangkat kehakiman serta pangkat kenabian dan Kami telah kurniakan mereka benda-benda yang baik-baik, serta Kami lebihkan (nenek moyang) mereka di atas orang-orang yang ada pada zamannya.",
                            "verse 45:17": "Dan lagi Kami telah berikan mereka keterangan-keterangan yang jelas nyata mengenai perkara agama; maka mereka tidak berselisihan (dalam perkara agama itu) melainkan setelah sampai kepada mereka ajaran-ajaran yang memberi mereka mengetahui (apa yang baik dan yang sebaliknya; berlakunya yang demikian) kerana hasad dengki yang ada dalam kalangan mereka.",
                            "verse 45:18": "Kesudahannya Kami jadikan engkau (wahai Muhammad dan utuskan engkau) menjalankan satu Syariat (yang cukup lengkap) dari hukum-hukum agama; maka turutlah Syariat itu dan janganlah engkau menurut hawa nafsu orang-orang yang tidak mengetahui (perkara yang benar).",
                            "verse 45:19": "Sesungguhnya mereka tidak sekali-kali akan dapat menyelamatkanmu sedikitpun dari (azab) Allah (kalau engkau menurut mereka) dan sesungguhnya orang-orang yang zalim itu setengahnya menjadi penolong dan penyokong bagi setengahnya yang lain (dalam perkara yang salah) dan (sebaliknya) Allah menjadi penolong dan pelindung bagi orang-orang yang bertakwa (yang engkaulah pemimpinnya).",
                            "verse 45:20": "Al-Quran ini menjadi panduan-panduan yang membuka mata hati manusia dan menjadi hidayat petunjuk serta membawa rahmat bagi kaum yang meyakini (kebenarannya).",
                            "verse 45:21": "Patutkah orang-orang yang melakukan kejahatan menyangka bahawa Kami akan menjadikan mereka seperti orang-orang yang beriman dan beramal soleh, dengan menyamakan keadaan (mereka semua) semasa mereka hidup dan semasa mereka mati? Buruk sungguh apa yang mereka hukumkan itu.",
                            "verse 45:22": "Dan (ingatlah), Allah menciptakan langit dan bumi dengan cara yang sungguh layak dan berhikmat (untuk membuktikan keesaanNya dan keadilanNya) dan supaya tiap-tiap diri diberi balasan dengan apa yang mereka telah kerjakan (baik atau jahat), sedang mereka tidak dikurangkan balasannya sedikitpun.",
                            "verse 45:23": "Dengan yang demikian, bagaimana fikiranmu (wahai Muhammad) terhadap orang yang menjadikan hawa nafsunya: Tuhan yang dipatuhinya dan dia pula disesatkan oleh Allah kerana diketahuiNya (bahawa dia tetap kufur ingkar) dan dimeteraikan pula atas pendengarannya dan hatinya serta diadakan lapisan penutup atas penglihatannya? Maka siapakah lagi yang dapat memberi hidayat petunjuk kepadanya sesudah Allah (menjadikan dia berkeadaan demikian)? Oleh itu, mengapa kamu (wahai orang-orang yang ingkar) tidak ingat dan insaf?",
                            "verse 45:24": "Dan mereka berkata: Tiadalah hidup yang lain selain daripada hidup kita di dunia ini.",
                            "verse 45:25": "Dan apabila dibacakan kepada mereka ayat-ayat keterangan Kami yang jelas nyata (mengenai soal hidup semula sesudah mati), tidaklah ada hujah mereka (untuk menolak kebenarannya) selain daripada berkata: Bawakanlah datuk nenek kami (hidup semula) kalau betul kami orang-orang yang benar!",
                            "verse 45:26": "Katakanlah (wahai Muhammad): Allah yang menghidupkan kamu, kemudian Dia akan mematikan kamu, setelah itu Dia akan menghimpunkan kamu (dalam keadaan hidup semula) pada hari kiamat (hari) yang tidak ada sebarang syak tentang kedatangannya; akan tetapi kebanyakan manusia tidak mengetahui (ketetapan itu).",
                            "verse 45:27": "Dan bagi Allah jualah kuasa pemerintahan langit dan bumi dan ketika berlakunya hari kiamat, pada saat itulah ruginya orang-orang yang berpegang kepada perkara yang salah.",
                            "verse 45:28": "Dan (pada hari kiamat) engkau akan melihat tiap-tiap umat berlutut (dalam keadaan cemas dan menunggu panggilan); tiap-tiap umat diseru untuk menerima kitab suratan amalnya (serta dikatakan kepada mereka): Pada hari ini kamu akan dibalas menurut apa yang kamu telah kerjakan!",
                            "verse 45:29": "Inilah surat (tulisan malaikat) Kami, ia memberi keterangan terhadap kamu dengan yang benar, kerana sesungguhnya Kami telah (perintahkan malaikat) menulis segala yang kamu telah lakukan (di dunia dahulu)!",
                            "verse 45:30": "Adapun orang-orang yang beriman dan beramal soleh, maka mereka akan dimasukkan oleh Tuhan mereka ke dalam rahmatNya; yang demikian itu ialah kemenangan yang besar.",
                            "verse 45:31": "Adapun orang-orang yang kafir, (maka mereka akan ditempelak dengan dikatakan kepada mereka): Bukankah ayat-ayatku telah disampaikan dan dibacakan kepada kamu, lalu kamu berlaku sombong takbur (mengingkarinya), serta menjadi kaum yang sentiasa melakukan kesalahan?",
                            "verse 45:32": "Dan apabila dikatakan (kepada kamu): Sesungguhnya janji Allah (membalas amal kamu) adalah benar dan hari kiamat tidak ada sebarang syak tentang kedatangannya, kamu berkata: Kami tidak mengetahui apa dia hari kiamat itu; kami hanya mengira (kemungkinannya) sebagai sangkaan jua dan kami tidak sekali-kali meyakininya.",
                            "verse 45:33": "Dan (pada ketika itu) ternyatalah kepada mereka balasan kejahatan-kejahatan yang mereka telah lakukan, serta mereka diliputi oleh azab yang mereka ejek-ejek itu!",
                            "verse 45:34": "Dan dikatakan (kepada mereka): Pada hari ini Kami tidak hiraukan kamu (menderita di dalam azab seksa) sebagaimana kamu tidak hiraukan persediaan untuk menemui hari kamu ini dan tempat kamu ialah Neraka dan kamu tidak akan beroleh sesiapapun yang dapat memberikan pertolongan.",
                            "verse 45:35": "(Balasan buruk) yang demikian ini ialah kerana kamu telah menjadikan ayat-ayat keterangan Allah sebagai ejek-ejekan dan kerana kamu telah membiarkan diri kamu diperdayakan oleh kehidupan dunia.",
                            "verse 45:36": "(Demikianlah ajaran dan peringatan Allah Yang Maha Adil) maka bagi Allah jualah tertentu segala pujian, Tuhan Yang Mentadbirkan langit dan Tuhan Yang Mentadbirkan bumi, Tuhan sekalian alam.",
                            "verse 45:37": "Dan bagiNyalah keagungan dan kekuasaan di langit dan di bumi serta Dialah Yang Maha Kuasa, lagi Maha Bijaksana"
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "حم",
                            "verse 45:2": "اين كتاب از سوى خداوند عزيز و حكيم نازل شده است!",
                            "verse 45:3": "بى‏شك در آسمانها و زمين نشانه‏هاى (فراوانى) براى مؤمنان وجود دارد;",
                            "verse 45:4": "و نيز در آفرينش شما و جنبندگانى كه (در سراسر زمين) پراكنده ساخته، نشانه‏هايى است براى جمعيتى كه اهل يقينند",
                            "verse 45:5": "و نيز در آمد و شد شب و روز، و رزق (و بارانى) كه خداوند از آسمان نازل كرده و بوسيله آن زمين را بعد از مردنش حيات بخشيده و همچنين در وزش بادها، نشانه‏هاى روشنى است براى گروهى كه اهل تفكرند!",
                            "verse 45:6": "اينها آيات خداوند است كه ما آن را بحق بر تو تلاوت مى‏كنيم; اگر آنها به اين آيات ايمان نياورند، به كدام سخن بعد از سخن خدا و آياتش ايمان مى‏آورند؟!",
                            "verse 45:7": "واى بر هر دروغگوى گنهكار",
                            "verse 45:8": "كه پيوسته آيات خدا را مى‏شنود كه بر او تلاوت مى‏شود، اما از روى تكبر اصرار بر مخالفت دارد; گويى اصلا آن را هيچ نشنيده است; چنين كسى را به عذابى دردناك بشارت ده!",
                            "verse 45:9": "و هرگاه از بعضى آيات ما آگاه شود، آن را به باد استهزا مى‏گيرد; براى آنان عذاب خواركننده‏اى است!",
                            "verse 45:10": "و پشت سرشان دوزخ است; و هرگز آنچه رابه دست آورده‏اند آنها را (از عذاب الهى) رهايى نمى‏بخشد، و نه اوليايى كه غير از خدا براى خود برگزيدند (مايه نجاتشان خواهند بود); و عذاب بزرگى براى آنهاست!",
                            "verse 45:11": "اين () مايه هدايت است، و كسانى كه به آيات پروردگارشان كافر شدند، عذابى سخت و دردناك دارند!",
                            "verse 45:12": "خداوند همان كسى است كه دريا را مسخر شما كرد تا كشتيها بفرمانش در آن حركت كنند و بتوانند از فضل او بهره گيريد، و شايد شكر نعمتهايش را بجا آوريد!",
                            "verse 45:13": "او آنچه در آسمانها و آنچه در زمين است همه را از سوى خودش مسخر شما ساخته; در اين نشانه‏هاى (مهمى) است براى كسانى كه انديشه مى‏كنند!",
                            "verse 45:14": "به مؤمنان بگو: «كسانى را كه اميد به ايام الله ( روز رستاخيز) ندارند مورد عفو قرار دهند تا خداوند هر قومى را به اعمالى كه انجام مى‏دادند جزا دهد»!",
                            "verse 45:15": "هر كس كار شايسته‏اى بجا آورد، براى خود بجا آورده است; و كسى كه كار بد مى‏كند، به زيان خود اوست; سپس همه شما به سوى پروردگارتان بازگردانده مى‏شويد!",
                            "verse 45:16": "ما بنى اسرائيل را كتاب (آسمانى) و حكومت و نبوت بخشيديم و از روزيهاى پاكيزه به آنها عطا كرديم و آنان را بر جهانيان (و مردم عصر خويش) برترى بخشيديم;",
                            "verse 45:17": "و دلايل روشنى از امر نبوت و شريعت در اختيارشان قرار داديم; آنها اختلاف نكردند مگر بعد از علم و آگاهى; و اين اختلاف بخاطر ستم و برترى‏جويى آنان بود; اما پروردگارت روز قيامت در ميان آنها در آنچه اختلاف داشتند داورى مى‏كند",
                            "verse 45:18": "سپس تو را بر شريعت و آيين حقى قرار داديم; از آن پيروى كن و از هوسهاى كسانى كه آگاهى ندارند پيروى مكن!",
                            "verse 45:19": "آنها هرگز نمى‏توانند تو را در برابر خداوند بى‏نياز كنند (و از عذابش برهانند); و ظالمان يار و ياور يكديگرند، اما خداوند يار و ياور پرهيزگاران است!",
                            "verse 45:20": "اين ( و شريعت آسمانى) وسايل بينايى و مايه هدايت و رحمت است براى مردمى كه (به آن) يقين دارند!",
                            "verse 45:21": "آيا كسانى كه مرتكب بديها و گناهان شدند گمان كردند كه ما آنها را همچون كسانى قرارمى‏دهيم كه ايمان آورده و اعمال صالح انجام داده‏اند كه حيات و مرگشان يكسان باشد؟! چه بد داورى مى‏كنند!",
                            "verse 45:22": "و خداوند آسمانها و زمين را بحق آفريده است تا هر كس در برابر اعمالى كه انجام داده است جزا داده شود; و به آنها ستمى نخواهد شد!",
                            "verse 45:23": "آيا ديدى كسى را كه معبود خود را هواى نفس خويش قرار داده و خداوند او را با آگاهى (بر اينكه شايسته هدايت نيست) گمراه ساخته و بر گوش و قلبش مهر زده و بر چشمش پرده‏اى افكنده است؟! با اين حال چه كسى مى‏تواند غير از خدا او را هدايت كند؟! آيا متذكر نمى‏شويد؟!",
                            "verse 45:24": "آنها گفتند: «چيزى جز همين زندگى دنياى ما در كار نيست; گروهى از ما مى‏ميرند و گروهى جاى آنها را مى‏گيرند; و جز طبيعت و روزگار ما را هلاك نمى‏كند!» آنان به اين سخن كه مى‏گويند علمى ندارند، بلكه تنها حدس مى‏زنند (و گمانى بى‏پايه دارند)!",
                            "verse 45:25": "و هنگامى كه آيات روشن ما بر آنها خوانده مى‏شود، دليلى در برابر آن ندارند جز اينكه مى‏گويند: «اگر راست مى‏گوييد پدران ما را (زنده كنيد) و بياوريد (تا گواهى دهند)!»",
                            "verse 45:26": "بگو: «خداوند شما را زنده مى‏كند، سپس مى‏ميراند، بار ديگر در روز قيامت كه در آن ترديدى نيست گردآورى مى‏كند; ولى بيشتر مردم نمى‏دانند»",
                            "verse 45:27": "مالكيت و حاكميت آسمانها و زمين براى خداست; و آن روز كه قيامت برپا شود اهل باطل زيان مى‏بينند!",
                            "verse 45:28": "در آن روز هر امتى را مى‏بينى (كه از شدت ترس و وحشت) بر زانو نشسته; هر امتى بسوى كتابش خوانده مى‏شود، و (به آنها مى‏گويند:) امروز جزاى آنچه را انجام مى‏داديد به شما مى‏دهند!",
                            "verse 45:29": "اين كتاب ما است كه بحق با شما سخن مى‏گويد (و اعمال شما را بازگو مى‏كند); ما آنچه را انجام مى‏داديد مى‏نوشتيم!",
                            "verse 45:30": "اما كسانى كه ايمان آوردند و اعمال صالح انجام دادند، پروردگارشان آنها را در رحمت خود وارد مى‏كند; اين همان پيروزى بزرگ است!",
                            "verse 45:31": "اما كسانى كه كافر شدند (به آنها گفته مى‏شود:) مگر آيات من بر شما خوانده نمى‏شد و شما استكبار كرديد و قوم مجرمى بوديد؟!",
                            "verse 45:32": "و هنگامى كه گفته مى‏شد: «وعده خداوند حق است، و در قيامت هيچ شكى نيست‏» ، شما مى‏گفتيد: «ما نمى‏دانيم قيامت چيست؟ ما تنها گمانى در اين باره داريم، و به هيچ‏وجه يقين نداريم!»",
                            "verse 45:33": "و بديهاى اعمالشان براى آنان آشكار مى‏شود، و سرانجام آنچه را استهزا مى‏كردند آنها را فرامى‏گيرد!",
                            "verse 45:34": "و به آنها گفته مى‏شود: «امروز شما را فراموش مى‏كنيم همان‏گونه كه شما ديدار امروزتان را فراموش كرديد; و جايگاه شما دوزخ است و هيچ ياورى نداريد!",
                            "verse 45:35": "اين بخاطر آن است كه شما آيات خدا را به مسخره گرفتيد و زندگى دنيا شما را فريب داد! س‏خ‏للّهامروز نه آنان را از دوزخ بيرون مى‏آورند، و نه هيچ‏گونه عذرى از آنها پذيرفته مى‏شود!",
                            "verse 45:36": "پس حمد و ستايش مخصوص خداست، پروردگار آسمانها و پروردگار زمين و پروردگار همه جهانيان!",
                            "verse 45:37": "و براى اوست كبريا و عظمت در آسمانها و زمين، و اوست عزيز و حكيم!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Ha, Mim.",
                            "verse 45:2": "A revelação do Livro é de Deus, o Poderoso, o Prudentíssimo.",
                            "verse 45:3": "Sabei que nos céus e na terra há sinais para os fiéis.",
                            "verse 45:4": "E em vossa criação e de tudo quanto disseminou, de animais, há sinais para os persuadidos.",
                            "verse 45:5": "E na alternação do dia e da noite, no sustento que Deus envia do céu, mediante o que vivifica a terra depois de haver sido árida, é na variação dos ventos, há sinais para os que raciocinam.",
                            "verse 45:6": "Tais são os versículos de Deus que, em verdade, te revelamos.",
                            "verse 45:7": "Ai de todo mendaz, pecador.",
                            "verse 45:8": "Que escuta os versículos de Deus, quando lhe são recitados, e se obstina, ensoberbecido, como se não os tivesse ouvido! Anuncia-lhe um doloroso castigo.",
                            "verse 45:9": "E quando chega a conhecer algo dos Nossos versículos, escarnece-o.",
                            "verse 45:10": "Frente a eles estará o inferno, e de nada lhes valerá tudo quanto tiverem acumulado, nem tampouco os que adotarem por protetores, em vez de Deus.",
                            "verse 45:11": "Este (Alcorão) é uma orientação.",
                            "verse 45:12": "Deus foi Quem vos submeteu o mar para que, com o Seu beneplácito, o singrassem os navios e para que procurásseis algo de Sua bondade, a fim de que Lhe agradecêsseis.",
                            "verse 45:13": "E vos submeteu tudo quanto existe nos céus e na terra, pois tudo d’Ele emana.",
                            "verse 45:14": "Dize aos fiéis que perdoam aqueles que não esperam o dia de Deus, quando Ele retribuirá a cada povo segundo o seu merecimento.",
                            "verse 45:15": "Quem praticar o bem, será em benefício próprio; por outra, quem praticar o mal, o fará em seu detrimento.",
                            "verse 45:16": "Havíamos concedido aos israelitas o Livro, o comando, a profecia e o agraciamos com todo o bem, e os preferimos aos seus contemporâneos.",
                            "verse 45:17": "E lhes prescrevemos as evidências (com respeito aos dogmas); porém, não discreparam, senão por inveja recíproca, após lhes ter chegado o conhecimento.",
                            "verse 45:18": "Então, te ensejamos (ó Mensageiro) o caminho reto da religião.",
                            "verse 45:19": "Porque em nada poderão defender-te do castigo de Deus, por os iníquos são protetores uns dos outros.",
                            "verse 45:20": "Este (Alcorão) encerra evidências para o homem, e é orientação e misericórdia para os persuadidos.",
                            "verse 45:21": "Pretendem, porventura, os delinqüentes, que os equiparemos aos fiéis, que praticam o bem? Pensam, acaso, que suas vidas e suas mortes serão iguais? Que péssimo é o que julgam!",
                            "verse 45:22": "Deus criou os céus e a terra com prudência, para que toda a alma seja compensada segundo o que tiver feito, e ninguém será defraudado.",
                            "verse 45:23": "Não tens reparado, naquele que idolatrou a sua concupiscência! Deus extraviou-o com conhecimento, sigilando os seus ouvidos e o seu coração, e cobriu a sua visão.",
                            "verse 45:24": "E dizem: Não há vida, além da terrena.",
                            "verse 45:25": "E quando lhes são recitados os Nossos lúcidos versículos, seu único argumento é dizer: Trazei nosso pais, e estais certos!",
                            "verse 45:26": "Dize-lhes: Deus vos dá a vida, então vos fará morrer, depois vos congregará para o Dia indubitável da Ressurreição.",
                            "verse 45:27": "A Deus pertence o reino dos céus e da terra, e no dia em que chegar a Hora, perecerão os difamadores!",
                            "verse 45:28": "E verás cada nação genuflexa; cada uma será convocada ante o seu registro.",
                            "verse 45:29": "Este é o Nosso registro, o qual depõe contra vós, porque anotávamos tudo quanto fazíeis.",
                            "verse 45:30": "Quanto aos fiéis que praticam o bem, seu Senhor os acolherá em sua misericórdia.",
                            "verse 45:31": "Não obstante, aos incrédulos (será dito): Porventura, não vos foram recitados os Meus versículos? Porém, ensoberbeceste-vos e vos tornastes pecadores.",
                            "verse 45:32": "E quando vos foi dito que a promessa de Deus é verdadeira e a Hora é indubitável, dissestes: Não sabemos o que é a Hora e pensamos não passar de uma opinião quimérica, e não estamos convencidos!",
                            "verse 45:33": "Então, aparecer-lhe-ão as maldades que tiverem cometido, e os envolverá aquilo de que escarneciam!",
                            "verse 45:34": "E ser-lhes-á dito: Hoje vos esquecemos tal como vos esquecestes do comparecimento a este vosso dia! E a vossa morada será o fogo infernal, e jamais tereis socorredores.",
                            "verse 45:35": "Isso, porque escarnecestes dos versículos de Deus e vos iludiu a vida terrena! Assim, nesse dia não lhes será permitido sair dele (o fogo), nem lhes será permitida apelação.",
                            "verse 45:36": "Louvado seja Deus, Senhor dos céus e da terra, Senhor do Universo!",
                            "verse 45:37": "De cuja glória, nos céus e na terra, é possuidor, porque é o Poderoso, o Prudentíssimo."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 45:1": "Ha', Mim.",
                            "verse 45:2": "Revelarea Cãrții este de la Allah Cel Puternic",
                            "verse 45:3": "Înțelept [Al-'Aziz, Al-Hakim].",
                            "verse 45:4": "În ceruri și pe pãmânt sunt semne pentru cei care cred.",
                            "verse 45:5": "Și în propria voastrã fãpturã și în vietãțile pe care El le-a risipit se aflã semne pentru un neam de oameni care cred cu tãrie.",
                            "verse 45:6": "Și în schimbarea nopții și zilei și în hrana pe care Allah a pogorât-odin cer și a înviat pãmântul cu ea, dupã ce el a fost mort, și în schimbarea vânturilor se aflã semne pentru un neam d",
                            "verse 45:7": "Acestea sunt versetele lui Allah pe care Noi ți le recitãm în tot adevãrul.",
                            "verse 45:8": "Vai pentru tot mincinosul pãcãtos!",
                            "verse 45:9": "Cine aude versetele lui Allah care i se recitã, apoi stãruie cuîngâmfare , de parcã nu le-ar fi auzit.",
                            "verse 45:10": "Iar dacã știe ceva din versetele Noastre, el le ia în râs.",
                            "verse 45:11": "În urma lor se aflã Gheena și nu le vor fi lor de folos nimic dincele pe care le-au agonisit și nici ceea ce și-au luat ei ca aliați în locul lui Allah .",
                            "verse 45:12": "Aceasta este o cãlãuzã, iar aceia, care tãgãduiesc verseteleDomnului lor, vor avea parte de chinurile unei osânde dureroase.",
                            "verse 45:13": "Allah este Acela care v-a supus vouã marea, ca sã pluteascãvasele pe ea, la porunca Sa, și pentru ca voi sã umblați în cãutarea harului Sãu .",
                            "verse 45:14": "Și El v-a supus vouã toate cele care se aflã în ceruri și care seaflã pre pãmânt; toate sunt de la El.",
                            "verse 45:15": "Spune acelora care cred sã-i ierte pe aceia care nu nãdãjduiesc înzilele lui Allah , în care El va rãsplãti",
                            "verse 45:16": "neam [de oameni]dupã cele pe care le-au agonisit!",
                            "verse 45:17": "Acela care împlinește binele o face pentru sufletul sãu, iar acela care sãvârșește rãul [o face] împotriva lui.",
                            "verse 45:18": "Noi le-am dat fiilor lui Israel Cartea , înțelepciunea, profeția șii-am înzestrat pe ei cu bunuri și i-am ales înaintea celorlalte lumi .",
                            "verse 45:19": "Noi le-am dat semne limpezi asupra Poruncii , însã ei nu au fostîn neînțelegere decât dupã ce le-a venit știința, din pricina nelegiuiriilor.",
                            "verse 45:20": "Apoi te-am așezat Noi pe calea cea adevãratã a religiei .",
                            "verse 45:21": "Ei nu-ți vor fi de nici un folos, în fața lui Allah .",
                            "verse 45:22": "Acesta conține dovezi limpezi pentru oameni, ocârmuire și îndurare pentru un neam de oameni care cred cu tãrie.",
                            "verse 45:23": "Ori socotesc aceia care au sãvârșit fapte rele cã îi vom ține peei deopotrivã cu aceia care au fost cu credințã și au împlinit fapte bune, atât în viața lor cât și dupã moart",
                            "verse 45:24": "Allah a creat cerurile și pãmântul în adevãr și pentru ca fiecaresuflet sã fie rãsplãtit dupã ceea ce a agonisit.",
                            "verse 45:25": "Îl vezi tu pe acela care și-a luat pofta sa drept Dumnezeu al lui cu bunã științã și pe care Allah îl duce în rãtãcire și-i pecetluieșteauzul sãu și inima sa și întin",
                            "verse 45:26": "Ei zic: \"Nu este decât viața noastrã pãmânteascã! Noi murim și trãim și nu ne face pe noi sã pierim decât numai timpul!\" Însã ei nu auștiințã despre aceasta, ci ei doar î&",
                            "verse 45:27": "Iar când li se recitã lor versetele Noastre cele limpezi, atunci nu au ei alt temei decât sã spunã: \"Faceți-i sã revinã pe pãrinții noștri, de grãiți voi adevãr!\"",
                            "verse 45:28": "Spune: \"Allah vã dã viațã, apoi vã dã moarte, apoi vã va adunape voi în Ziua Învierii! Nu este îndoialã întru aceasta, însã cei mai mulți oameni nu știu.",
                            "verse 45:29": "A lui Allah este împãrãția cerurilor și a pãmântului , iar în Ziuacând va sosi Ceasul, în Ziua aceea vor pierde cei care o iau în deșert .",
                            "verse 45:30": "Și vei vedea fiecare comunitate cãzutã în genunchi .",
                            "verse 45:31": "Aceasta este cartea Noastrã , care vã grãiește vouã adevãrul.",
                            "verse 45:32": "În ce-i privește pe aceia care au fost cu credințã și au împlinit fapte bune, pe ei Domnul lor îi va lãsa sã intre sub îndurarea Sa .",
                            "verse 45:33": "În ce-i privește pe aceia care nu au fost cu credințã, [li se va zice lor]: \"Oare nu vi s-au recitat vouã versetele Mele? Însã voi v-ați ținut semeți și ați fost un neam de nelegiui",
                            "verse 45:34": "Și ori de câte ori s-a spus: \"Fãgãduința lui Allah este adevãr și nu este îndoialã asupra Ceasului\", atunci ați zis voi: \"Noi nu știm ce esteCeasul .",
                            "verse 45:35": "Și li se vor arãta lor relele ce le-au sãvârșit și îi vor împresura peei cele pe care le-au luat în batjocurã .",
                            "verse 45:36": "Și li se va zice lor: \"Astãzi vã uitãm Noi , întocmai așa cum ați uitat voi întâlnirea cu aceastã Zi a voastrã.",
                            "verse 45:37": "Aceasta este pentru cã voi ați luat versetele lui Allah în derâdereși v-a înșelat pe voi viața lumeascã!\" În Ziua aceea, ei nu vor fi scoși din el și nici nu vor fi ei primiți cu îndurare.",
                            "verse 45:38": "Slavã lui Allah, Stãpânul cerurilor și Stãpânul pãmântului, Stãpânul",
                            "verse 45:39": "lumilor!",
                            "verse 45:40": "A Lui este mãrirea în ceruri și pre pãmânt și El este CelPuternic",
                            "verse 45:41": "Înțelept [Al-'Aziz, Al-Hakim]."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 45:1": "Ha.",
                            "verse 45:2": "Pogorârea Cărţii este de la Dumnezeu, Puternicul, Înţeleptul.",
                            "verse 45:3": "În ceruri, precum şi pe pământ, sunt semne pentru credincioşi.",
                            "verse 45:4": "În făptura voastră şi a dobitoacelor pe care le-a răspândit sunt semne pentru un popor care crede cu tărie.",
                            "verse 45:5": "În deosebirea nopţii de zi, în apa dătătoare de hrană pe care Dumnezeu o trimite din cer dând prin ea viaţă pământului după moarte, în dezlănţuirea vânturilor, sunt semne pentru un popor ce are minte.",
                            "verse 45:6": "Acestea sunt versetele lui Dumnezeu pe care ţi le recităm întru Adevăr.",
                            "verse 45:7": "Vai clevetitorului păcătos!",
                            "verse 45:8": "El ascultă versetele lui Dumnezeu recitându-i-se, însă stă îngâmfat de parcă nici nu le-ar fi auzit.",
                            "verse 45:9": "Când cunoaşte din semnele Noastre, le ia în zeflemea.",
                            "verse 45:10": "Gheena va fi în spatele lor.",
                            "verse 45:11": "Aceasta este o călăuzire.",
                            "verse 45:12": "Dumnezeu este Cel ce v-a supus vouă marea ca pe ea să plutească corăbiile din porunca Sa şi pentru ca voi să căutaţi harul Său.",
                            "verse 45:13": "El v-a supus vouă cele din ceruri, precum şi de pe pământ.",
                            "verse 45:14": "Spune celor care cred să ierte celor care nu nădăjduiesc la zilele lui Dumnezeu, pentru că El va răsplăti fiece popor după ceea ce a agonisit.",
                            "verse 45:15": "Cine face un bine, sieşi şi-l face.",
                            "verse 45:16": "Noi le-am dăruit fiilor lui Israel Cartea, înţelepciunea şi proorocirea, i-am înzestrat cu bunuri şi i-am ales înaintea lumilor.",
                            "verse 45:17": "Le-am dat dovezi vădite ale Poruncii, iar ei nu s-au învrăjbit decât după ce le-a venit ştiinţa, urându-se unii pe alţii.",
                            "verse 45:18": "În ceea ce priveşte Porunca, Noi te-am pus pe un drum sigur.",
                            "verse 45:19": "Ei nu-ţi vor sluji la nimic înaintea lui Dumnezeu.",
                            "verse 45:20": "Aceasta este oamenilor un Îndemn desluşit, o călăuzire şi o milostivenie pentru un popor care crede cu tărie.",
                            "verse 45:21": "Oare cei care săvârşesc fapte rele socot că Noi o să-i aşezăm ca pe cei care săvârşesc fapte bune fiindcă toţi ar fi deopotrivă întru viaţă şi moarte? Rău mai judecă!",
                            "verse 45:22": "Dumnezeu a creat cerurile şi pământul întru Adevăr ca fiece suflet să fie răsplătit după ceea ce a agonisit.",
                            "verse 45:23": "L-ai văzut pe cel care îşi ia pofta drept dumnezeu al său? Dumnezeu cu ştiinţă l-a rătăcit.",
                            "verse 45:24": "Ei spun: “Nu avem decât Viaţa de Acum.",
                            "verse 45:25": "Când versetele Noastre le sunt recitate ca dovezi vădite, nu au alt răspuns decât în a spune: “Aduceţi-i pe taţii noştri, dacă spuneţi adevărul!”",
                            "verse 45:26": "Spune: “Dumnezeu vă dăruieşte viaţa, apoi vă dăruieşte moartea.",
                            "verse 45:27": "A lui Dumnezeu este împărăţia cerurilor şi a pământului.",
                            "verse 45:28": "Vei vedea fiece adunare îngenunchiată.",
                            "verse 45:29": "“Aceasta este Cartea Noastră! Ea rosteşte asupra voastră întru Adevăr.",
                            "verse 45:30": "Celor care cred şi săvârşesc fapte bune, Domnul lor va pogorî asupra lor milostivenia Sa.",
                            "verse 45:31": "Celor care au tăgăduit: “Nu v-au fost recitate versetele Mele? V-aţi îngâmfat, căci sunteţi un popor nelegiuit.",
                            "verse 45:32": "Când vi se spunea: “Făgăduiala lui Dumnezeu este Adevăr, nu este nici o îndoială asupra Ceasului”, voi spuneaţi: “Nu ştim ce va fi Ceasul acela, însă noi gândim că nu este decât o închipuire, aşa că nu suntem convinşi.",
                            "verse 45:33": "Faptele rele pe care le-au săvârşit le vor apare, iar cea de care îşi băteau joc îi va învălui.",
                            "verse 45:34": "Li se va spune: “Vă uităm astăzi, precum şi voi aţi uitat întâlnirea cu această zi a voastră.",
                            "verse 45:35": "Aceasta, căci aţi luat în zeflemea semnele lui Dumnezeu, iar Viaţa de Acum v-a amăgit.",
                            "verse 45:36": "Mărire lui Dumnezeu, Domnul cerurilor, Domnul pământului, Domnul tuturor lumilor!",
                            "verse 45:37": "A Lui este măreţia, atât în ceruri, precum şi pe pământ."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Ха– — Ми–м.",
                            "verse 45:2": "Исходит откровение сей КнигиОт Аллаха,Кто мудр и могуч!",
                            "verse 45:3": "На небесах и на земле, поистине,знамения для тех,Которые уверовали (в Бога).",
                            "verse 45:4": "В создании и вас, и всякого живья,Что Им рассеяны (по всей земле), —Знамения для убежденных (в вере).",
                            "verse 45:5": "И в смене ночи днем,И в той благословенной (влаге),Которую Аллах с небес низводит,Чтоб ею землю оживить,Когда она уж умерла,И в разном направлении ветров —Знамения для тех, кто обладаетразуменьем.",
                            "verse 45:6": "Вот таковы знамения Аллаха,И Мы их в Истине тебе читаем, —Тогда в какую речь уверуют ониПосле (того, как им представятИстину) Аллаха(И изъяснят) Его знаменья?",
                            "verse 45:7": "О, горе всякому неверному лжецу!",
                            "verse 45:8": "Он слушает знамения Господни,Которые читаются ему,И все ж упорствует в своей гордыне,Как бы не слыша вовсе их.",
                            "verse 45:9": "Когда он из знамений Нашихчто-нибудь узнает,Он обращает их в насмешку.",
                            "verse 45:10": "Ад — впереди у них,И им нисколько не поможетНи то добро, что накопили,Ни те, которых они взялиВ защитники себе, помимо Бога.",
                            "verse 45:11": "Сие есть правый путь.",
                            "verse 45:12": "Аллах есть Тот, Кто подчинил вамморе,Чтоб по Его велению там плыликорабли2114И вы могли искать щедрот ГосподнихИ быть признательны Ему.",
                            "verse 45:13": "И Он вам подчинил все то,Что суще в небесах и на земле, —Как все, что от Него исходит.",
                            "verse 45:14": "Скажи, (о Мухаммад!), уверовавшим(в Бога),Чтобы они прощали тем,Кто не надеется на Дни Аллаха2114а,В которые лишь2115 Он всем людямвоздает за то,Что (на земле) себе они стяжали.",
                            "verse 45:15": "Кто делает добро —Приобретает для души,Кто зло творит — против нее стяжает.",
                            "verse 45:16": "Сынам Исраиля Мы дали Книгу,Пророчество (средь них самих)и власть2116;Мы даровали им все благаДля проживания (в сем мире)И их возвысили над прочим людом.",
                            "verse 45:17": "И Мы им дали ясные знаменьяО (повелениях в Господнем) деле2117.",
                            "verse 45:18": "Потом Мы (повелением Своим)Тебя наставили на путь Закона —(шариата), —Так следуй же ему,А не страстям людей, которыене знают.",
                            "verse 45:19": "Они тебе пред Господом нискольконе помогут, —Ведь нечестивые — защитники другдругу.",
                            "verse 45:20": "Сие2119 есть просветление2120для (душ) людей,Стезя прямая и (Господня) милостьДля убежденных в своей вере.",
                            "verse 45:21": "Ужель считают те,Которые творят дурное,Что наравне Мы их поставим с теми,Кто верует и доброе творит?Ужель сравни их жизнь и смерть?Как же неверно они мыслят!",
                            "verse 45:22": "И лишь Аллах есть Тот,Кто небеса и землю сотворил,Чтобы (вам) Истину явить,Чтоб каждому воздать за то,Что уготовил он своим стяжаньем.",
                            "verse 45:23": "Видал ли ты того,Кто богом свои страсти сделал?Аллах же, ведая об этом,Блуждать (в грехах) его оставил,Печать на слух и сердце наложил,Закрыл завесою глаза.",
                            "verse 45:24": "И говорят они:«Нет ничего, помимо нашей жизнив этом мире.",
                            "verse 45:25": "Когда им Наши ясные знамениячитают,У них нет довода иного,Кроме того, что говорят они:«Верните нам наших отцов,Коль вы (в своих словах) правдивы».",
                            "verse 45:26": "Скажи: «Аллах дает вам жизньИ шлет вам смерть за этим.",
                            "verse 45:27": "И лишь Аллах владеет небесамии землей.",
                            "verse 45:28": "И ты увидишь (в этот День)Каждый народ2121коленопреклоненным,И каждый будет призван к своейкниге2122:Вам в этот День воздастся тем же,Что вы творили (на земле),",
                            "verse 45:29": "И скажет эта Наша книга истинупро вас, —Ведь Мы записываем все, что вытворите.",
                            "verse 45:30": "Тех, кто уверовал и доброе творил,Господь их в Свою милость примет,И будет явным этот дар2122а.",
                            "verse 45:31": "А тем, кто не уверовал, (Он) скажет:«Разве знамений Наших не читаливам?Но возгордились вы и стали грешнымлюдом».",
                            "verse 45:32": "Когда вам говорили:«Обетование Господне есть Истинасама,И Час — в нем нет сомненья»,Вы отвечали:«Не знаем мы, что есть сей Час,Мы думаем, что это — лишь одноиз мнений,И нет у нас уверенности в нем».",
                            "verse 45:33": "Потом предстанет им вся сквернаТого, что сделали они.",
                            "verse 45:34": "И скажут им:«Мы вас забудем в этот День,Как вы о встрече с этим Днем забыли;Огонь — вам вечная обитель,И нет помощников у вас.",
                            "verse 45:35": "И это вам за то,Что над знаменьями АллаханасмехалисьИ предались соблазнам ближнейжизни».",
                            "verse 45:36": "Воистину, Аллаху вся хвала —Владыке неба и земли,Владыке всех миров (Вселенной)!",
                            "verse 45:37": "И лишь Его державие на небесахи на земле!Могуч и мудр Он! (Вселенной)!"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "hm.",
                            "verse 45:2": "La revelación de la Escritura procede de Alá, el Poderoso, el Sabio.",
                            "verse 45:3": "Hay, en verdad, en los cielos y en la tierra signos para los creyentes.",
                            "verse 45:4": "En vuestra creación y en las bestias que Él esparce hay signos para gente que está convencida.",
                            "verse 45:5": "También en la sucesión de la noche y el día, en lo que como sustento Alá hace bajar del cielo, vivificando con ello la tierra después de muerta, y en la variación de los vientos hay signos para gente que comprende.",
                            "verse 45:6": "Estas son las aleyas de Alá, que te recitamos conforme a la verdad.",
                            "verse 45:7": "¡Ay de todo aquél que sea mentiroso, pecador,",
                            "verse 45:8": "que, a pesar de oír las aleyas de Alá que se le recitan, se obstina en su altivez como si no las hubiera oído! ¡Anúnciale un castigo doloroso!",
                            "verse 45:9": "Los que, habiendo conocido algo de Nuestros signos, los hayan tomado a burla, tendrán un castigo humillante.",
                            "verse 45:10": "Les espera la gehena y sus posesiones no les servirán de nada, como tampoco los que tomaron como amigos en lugar de tomar a Alá.",
                            "verse 45:11": "Esto es una dirección.",
                            "verse 45:12": "Alá es Quien ha sujetado el mar a vuestro servicio para que las naves lo surquen a una orden Suya para que busquéis Su favor.",
                            "verse 45:13": "Y ha sujetado a vuestro servicio lo que está en los cielos y en la tierra.",
                            "verse 45:14": "Di a los creyentes que perdonen a quienes no cuentan con los Días de Alá, instituidos para retribuir a la gente según sus méritos.",
                            "verse 45:15": "Quien obra bien, lo hace en su propio provecho.",
                            "verse 45:16": "Dimos a los Hijos de Israel la Escritura, el juicio y el profetismo.",
                            "verse 45:17": "Les dimos pruebas claras respecto a la Orden.",
                            "verse 45:18": "Luego, te pusimos en una vía respecto a la Orden.",
                            "verse 45:19": "No te servirán de nada frente a Alá.",
                            "verse 45:20": "Esto es un conjunto de pruebas visibles para los hombres, dirección y misericordia para gente que esta convencida.",
                            "verse 45:21": "Quienes obran mal ¿creen que les trataremos igual que a quienes creen y obran bien, como si fueran iguales en vida y luego de muertos? ¡Qué mal juzgan!",
                            "verse 45:22": "Alá ha creado con un fin los cielos y la tierra.",
                            "verse 45:23": "Y ¿qué te parece quien ha divinizado su pasión a quien Alá ha extraviado a sabiendas, sellando su oído y su corazón, vendando sus ojos? ¿Quién podrá dirigirle luego de Alá? ¿Es que no os dejaréis amonestar?",
                            "verse 45:24": "Y dicen: «No hay más vida que ésta nuestra de acá.",
                            "verse 45:25": "Y cuando se les recitan Nuestras aleyas como pruebas claras, lo único que arguyen es: «¡Haced volver a nuestros padres, si es verdad lo que decís!»",
                            "verse 45:26": "Di: «Alá os da la vida y, después, os hará morir.",
                            "verse 45:27": "El dominio de los cielos y de la tierra pertenece a Alá.",
                            "verse 45:28": "Verás a cada comunidad arrodillada.",
                            "verse 45:29": "He aquí Nuestra Escritura, que dice la verdad contra vosotros.",
                            "verse 45:30": "A quienes creyeron y obraron bien, su Señor les introducirá en Su misericordia.",
                            "verse 45:31": "En cuanto a quienes no creyeron: «¿Es que no se os recitaron Mis aleyas? Pero fuisteis altivos y gente pecadora».",
                            "verse 45:32": "Cuando se decía: «Lo que Alá promete es verdad y no hay duda respecto a la Hora», decíais: «No sabemos qué es eso de 'la Hora'.",
                            "verse 45:33": "Se les mostrará el mal que cometieron y les cercará aquello de que se burlaban.",
                            "verse 45:34": "Se dirá: «Hoy os olvidamos Nosotros, como vosotros olvidasteis que os llegaría este día.",
                            "verse 45:35": "Y esto es así porque tomasteis a burla los signos de Alá y la vida de acá os engaño».",
                            "verse 45:36": "¡Alabado sea Alá, Señor de los cielos, Señor de la tierra, Señor del universo!",
                            "verse 45:37": "¡Suya es la majestad en los cielos y en la tierra! Él es el Poderoso, el Sabio."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "ஹா, மீம்.",
                            "verse 45:2": "இவ்வேதம், யாவரையும் மிகைத்தோனும் ஞானம் மிக்கோனுமாகிய அல்லாஹ்விடமிருந்தே இறக்கியருளப்பட்டது.",
                            "verse 45:3": "முஃமின்களுக்கு நிச்சயமாக வானங்களிலும், பூமியிலும் அத்தாட்சிகள் இருக்கின்றன.",
                            "verse 45:4": "இன்னும் உங்களைப் படைத்திருப்பதிலும், அவன் உயிர்ப் பிராணிகளைப் பரப்பியிருப்பதிலும் (நம்பிக்கையில்) உறுதியுள்ள சமூகத்தாருக்கு அத்தாட்சிகள் இருக்கின்றன.",
                            "verse 45:5": "மேலும் இரவு பகல் மாறி மாறி வருவதிலும், வானத்திலிருந்து அருள் மாரியை அல்லாஹ் இறக்கி வைத்து, இறந்து போன பூமியை அதைக் கொண்டு உயிர்ப்பிப்பதிலும்; காற்றுகளை மாறி மாறி வீசச்செய்வதிலும் அறிவுடைய சமூகத்தாருக்கு அத்தாட்சிகள் இருக்கின்றன.",
                            "verse 45:6": "இவை அல்லாஹ்வுடைய வசனங்கள், இவற்றை (நபியே!) உம்மீது உண்மையுடன் ஓதிக் காண்பிக்கிறோம்; அல்லாஹ்வுக்கும் அவனுடைய வசனங்களுக்கும் பின்னர் இவர்கள் எதனைத் தான் நம்பப் போகிறார்கள்.",
                            "verse 45:7": "(சத்தியத்தை புறக்கணித்துப்) பொய்க் கற்பனை செய்யும் பாவிகள் யாவருக்கும் கேடுதான்.",
                            "verse 45:8": "தன் மீது ஓதிக்காட்டப்படும் அல்லாஹ்வுடைய வசனங்களைக் கேட்கிறான்; பின்பு பெருமையடித்துக் கொண்டு அவன் அதைக் கேளாதது போல் (தன் நிராகரிப்பில்) பிடிவாதம் செய்கிறான்; அ(த்தகைய)வனுக்கு நோவினை செய்யும் வேதனையைக் கொண்டு நன்மாராயம் கூறுவீராக.",
                            "verse 45:9": "நம் வசனங்களிலிருந்து ஏதாவது ஒன்றை அவன் அறிந்து கொண்டால், அதைப் பரிகாசமாக எடுத்துக் கொள்கிறான்; அ(த்தகைய)வர்களுக்கு இழிவு தரும் வேதனை உண்டு.",
                            "verse 45:10": "அவர்களுக்கு முன்னால் நரகம் இருக்கிறது அவர்கள் சம்பாதித்துக் கொண்டதில் எப்பொருளும் அவர்களுக்குப் பயன் தராது அல்லாஹ்வையன்றி, எவற்றை அவர்கள் பாதுகாவலர்களாக எடுத்துக் கொண்டார்களோ அவையும் (அவர்களுக்குப் பயன் தராது) மேலும், அவர்களுக்கு மாபெரும் வேதனையுமுண்டு.",
                            "verse 45:11": "இது (குர்ஆன்)தான் நேர்வழிகாட்யாகும், எவர்கள் தம்முடைய இறைவனின் வசனங்களை நிராகரித்து விட்டார்களோ, அவர்களுக்கு நோவினை மிகுந்த கடினமான வேதனையுண்டு.",
                            "verse 45:12": "கப்பல்கள் அவன் கட்டளையைக் கொண்டு (கடலில்) செல்லும் பொருட்டும், நீங்கள் அவனுடைய அருளைத் தேடிக்கொள்ளும் பொருட்டும்; மேலும் அவனுக்கு நன்றி செலுத்தும் பொருட்டும் உங்களுக்குக் கடலை வசப்படுத்திக் கொடுத்தவன் அல்லாஹ்வே ஆவான்.",
                            "verse 45:13": "அவனே வானங்களிலுள்ளவை, பூமியிலுள்ளவை அனைத்தையும் தன் அருளால் உங்களுக்கு வசப்படுத்திக் கொடுத்திருக்கிறான்; அதில் சிந்திக்கும் சமூகத்தாருக்கு நிச்சயமாகப் பல அத்தாட்சிகள் உள்ளன.",
                            "verse 45:14": "ஈமான் கொண்டவர்களுக்கு (நபியே!) நீர் கூறிவிடும்; அல்லாஹ்வுடைய (தண்டனைக்கான) நாட்களை நம்பாதவர்களை அவர்கள் மன்னித்து (அவர்களைப் பற்றி அல்லாஹ்விடம் பரஞ் சாட்டிவிடட்டும்); ஜனங்களுக்கு அவர்கள் தேடிக் கொண்ட வினைக்குத் தக்கபலனை அவன் கொடுப்பான்.",
                            "verse 45:15": "எவர் ஸாலிஹான (நல்ல) அமலை செய்கிறாரோ அது அவருக்Nகு நன்மையாகும்; அன்றியும், எவர் தீமையைச் செய்கிறாரோ, அது அவருக்கே தீமையாகும், பின்னர் உங்கள் இறைவனிடமே நீங்கள் மீட்டப்படுவீர்கள்.",
                            "verse 45:16": "நிச்சயமாக நாம், இஸ்ராயீலின் சந்ததியினருக்கு வேதத்தையும், அதிகாரத்தையும், நுபுவ்வத்தையும் கொடுத்தோம்; அவர்களுக்கு மணமான உணவு (வசதி)களையும் கொடுத்தோம் - அன்றியும் அகிலத்தாரில் அவர்களை மேன்மையாக்கினோம்.",
                            "verse 45:17": "அவர்களுக்கு (மார்க்க விஷயத்தில்) தெளிவான கடடளைகளையும் கொடுத்தோம்; எனினும் அவர்களுக்கிடையே உண்டான பொறாமையினால், அவர்களுக்கு (வேத) ஞானம் வந்தபின்னரும் அவர்கள் அபிப்பிராய பேதம் கொண்டார்கள்; நிச்சயமாக உம் இறைவன் அவர்கள் எதில் அபிப்பிராய பேதம் கொண்டிருந்தார்களோ அதில் கியாம நாளில் அவர்களிடையே தீர்ப்புச் செய்வான்.",
                            "verse 45:18": "இதன் பின்னர் ஷரீஅத்தில் (மார்க்கத்தில்) ஒரு நேரான வழியில் நாம் ஆக்கியுள்ளோம்.",
                            "verse 45:19": "நிச்சயமாக அவர்கள் அல்லாஹ்வுக்கு எதிராக உமக்கு யாதோர் உதவியும் செய்து விட முடியாது.",
                            "verse 45:20": "இது (குர்ஆன்) மனிதர்களுக்கு தெளிவான அத்தாட்சிகளைக் கொண்டதாகவும், உறுதியான நம்பிக்கையுடைய சமூகத்தாருக்கு நேர்வழியாகவும், ரஹ்மத்தாகவும் இருக்கிறது.",
                            "verse 45:21": "எவர்கள் தீமைகள் செய்கிறார்களோ அவர்களை, எவர்கள் ஈமான் கொண்டு நல்ல அமல்கள் செய்கிறார்களோ அவர்களுக்குச் சமமாக நாம் ஆக்கிவிடுவோம் என்று எண்ணுகின்றார்களா? அவர்கள் உயிருடனிருப்பதும், மரணமடைவதும் சமமாகுமா? அவர்கள் முடிவு செய்து கொண்டது மிகவும் கெட்டதாகும்.",
                            "verse 45:22": "வானங்களையும் பூமியையும் அல்லாஹ் உண்மையுடன் (தக்க காரணத்தைக் கொண்டே) படைத்துள்ளான்; ஒவ்வோர் ஆத்மாவும் அது தேடிக் கொண்டதற்குத் தக்க கூலி கொடுக்கப்படுவதறாகாக அவை அநியாயம் செய்யப்படமாட்டா.",
                            "verse 45:23": "(நபியே!) எவன் தன்னுடைய (சரீர, மனோ) இச்சையைத் தன்னுடைய தெய்வமாக ஆக்கிக் கொண்டானோ, அவனை நீர் பார்த்தீரா? மேலும், அறிந்தே அல்லாஹ் அவனை வழிகேட்டில் விட்டு அவனுடைய காதுகள் மீதும் இருதயத்தின் மீதும் முத்திரையிட்டு; இன்னும், அவனுடைய பார்வை மீதும் திரையை அமைத்துவிட்டான்.",
                            "verse 45:24": "மேலும் (மறுமையை நம்பாத) அவர்கள்; \"நமது இந்த உலக வாழ்க்கையைத் தவிர வேறு (வாழ்க்கை) கிடையாது நாம் இறக்கிறோம்; ஜீவிக்கிறோம்; \"காலம்\" தவிர வேறெதுவும் நம்மை அழிப்பதில்லை\" என்று கூறுகிறார்கள்; அவர்களுக்கு அது பற்றிய அறிவு கிடையாது - அவர்கள் (இது பற்றிக் கற்பனையாக) எண்ணுவதைத் தவிர வேறில்லை.",
                            "verse 45:25": "அவர்களிடம் தெளிவான நம் வசனங்கள் ஓதிக்காண்பிக்கப்பட்டால், அவர்களுடைய வாதமெல்லாம், \"நீங்கள் உண்மையாளர்களாக இருந்தால் எங்களுடைய மூதாதையரை (எழுப்பிக்) கொண்டு வாருங்கள்\" என்பது தவிர வேறில்லை.",
                            "verse 45:26": "\"அல்லாஹ் உங்களுக்கு உயிர் கொடுக்கிறான்; பின்னர் அவனே உங்களை மரணம் அடையச் செய்கிறான்; பின்னர் கியாம நாளன்று அவன் உங்களை ஒன்று சேர்ப்பான் - இதில் சந்தேகமேயில்லை\" எனினும் மனிதரில் பெரும்பாலோர் (இதை) அறியமாட்டார்கள் என்று (நபியே!) நீர் கூறும்.",
                            "verse 45:27": "அன்றியும், வானங்களுடையவும், பூமியுடையவும் ஆட்சி அல்லாஹ்வுக்கே உரியது மேலும், இறுதித் தீர்ப்புக்கான வேளைவந்து வாய்க்கும் நாளில், பொய்யர்கள் நஷ்டமடைவார்கள்.",
                            "verse 45:28": "(அன்று) ஒவ்வொரு சமுதாயத்தையும் முழந்தாளிட்டிருக்க (நபியே!) நீர் காண்பீர்; ஒவ்வொரு சமுதாயமும் அதனதன் (பதிவு) புத்தகத்தின் பக்கம் அழைக்கப்படும்; அன்று, நீங்கள் (உலகில்) செய்திருந்ததற்குரிய கூலி கொடுக்கப்படுவீர்கள்.",
                            "verse 45:29": "\"இது உங்களைப்பற்றிய உண்மையைக் கூறும் நம்முடைய புத்தகம்; நிச்சயமாக நாம் நீங்கள் செய்து வந்ததைப் பதிவு செய்து கொண்டிருந்தோம்\" (என்று கூறப்படும்).",
                            "verse 45:30": "ஆகவே, எவர்கள் ஈமான் கொண்டு நல்லமல்கள் செய்து வந்தார்களோ, அவர்களை அவர்களுடைய இறைவன் தன் ரஹமத்தில் பிரவேசிக்கச் செய்வான்; அதுவே தெளிவான வெற்றியாகும்.",
                            "verse 45:31": "ஆனால், நிராகரித்தவர்களிடம்; \"உங்களுக்கு என் வசனங்கள் ஓதிக்காண்பிக்கப்பட்டுக் கொண்டு இருக்கவில்லையா? அப்பொழுது நீங்கள் பெருமையடித்துக் கொண்டு குற்றவாளிகளாக இருந்தீர்கள்\" (என்று சொல்லப்படும்).",
                            "verse 45:32": "மேலும் \"நிச்சயமாக அல்லாஹ்வின் வாக்குறுதி உண்மையானது மறுமை நாள் அது பற்றியும் சந்தேகமில்லை\" என்று கூறப்பட்ட போது; \"(மறுமை) நாள் என்ன என்று நாங்கள் அறியோம்; அது ஒரு வெறும் கற்பனை என்றே நாங்கள் கருதுகிறோம்.",
                            "verse 45:33": "அவர்கள் செய்த தீமையெல்லாம் (அந்நாளில்) அவர்களுக்கு வெளியாகும்; எதை அவர்கள் பரிகாசம் செய்து கொண்டிருந்தார்களோ, அதுவே அவர்களைச் சூழ்ந்து கொள்ளும்.",
                            "verse 45:34": "இன்னும், \"நீங்கள் உங்களுடைய இந்நாளின் சந்திப்பை மறந்து விட்டது போன்றே, இன்றை தினம் நாம் உங்களை மறக்கிறோம்; அன்றியும் நீங்கள் தங்குமிடம் நரகம் தான்; மேலும், உங்களுக்கு உதவி செய்பவர் எவருமில்லை\" என்று (அவர்களுக்குக்) கூறப்படும்.",
                            "verse 45:35": "நீங்கள் அல்லஹ்வின் வசனங்களை ஏளனமாக எடுத்துக் கொண்டதனாலும் இவ்வுலக வாழ்க்கை உங்களை மயக்கி ஏமாற்றி விட்டதினாலுமே இந்த நிலை.",
                            "verse 45:36": "ஆகவே வானங்களுக்கும் இறைவனான - பூமிக்கும் இறைவனான - அகிலத்தாருக்கெல்லாம் இறைவனான அல்லாஹ்வுக்கே எல்லாப் புகழும்.",
                            "verse 45:37": "இன்னும், வானங்களிலும், பூமியிலுமுள்ள பெருமை அவனுக்கே உரியது மேலும், அவன் தான் (யாவரையும்) மிகைத்தவன், ஞானம் மிக்கோன்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "ฮา มีม",
                            "verse 45:2": "การประทานลงมาขอคัมภีร์นี้จากอัลลอฮ์ ผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ",
                            "verse 45:3": "แท้จริงในชั้นฟ้าทั้งหลาย และแผ่นดินนั้น แน่นอนย่อมมีสัญญาณหลากหลายสำหรับบรรดาผู้ศรัทธา",
                            "verse 45:4": "และในการบังเกิดพวกเจ้า และสิ่งที่พระองค์ทรงให้สัตว์แต่ละชนิดแพร่สะพัดออกไปนั้นย่อมเป็นสัญญาณหลากหลายสำหรับหมู่ชนผู้เชื่อมั่น",
                            "verse 45:5": "และการสับเปลี่ยนของกลางคืนและกลางวัน และสิ่งที่อัลลอฮ์ทรงหลั่งลงมาจากฟากฟ้า เพื่อเป็นปัจจัยยังชีพนั้น พระองค์ทรงให้แผ่นดินมีชีวิตชีวาโดยน้ำฝนหลังจากการแห้งแล้งของมัน และการเปลี่ยนทิศทางเดินของลมย่อมเป็นสัญญาณหลากหลายสำหรับหมู่ชนผู้ใช้สติปัญญา",
                            "verse 45:6": "นั่นคือสัญญาณต่าง ๆ ของอัลลอฮ์ ซึ่งเราได้สาธยายสัญญาณเหล่านั้นแก่เจ้าด้วยความจริง และสัญญาณต่าง ๆ ของพระองค์ที่พวกเขาจะศรัทธากัน",
                            "verse 45:7": "ความหายนะจงประสบแด่ทุกคนที่เป็นผู้โกหก ผู้ทำบาปมาก",
                            "verse 45:8": "เขาได้ฟังอายาต (อัลกุรอาน) ของอัลลอฮ์ถูกสาธยายแก่เขา แล้วเขาก็ดื้อรั้นอย่างยะโส ประหนึ่งว่าเขาไม่เคยฟังอายาตมาก่อนเลยดังนั้นจงแจ้งข่าวแก่เขาถึงการลงโทษอันเจ็บปวด",
                            "verse 45:9": "และเมื่อเขาได้ทราบสิ่งใดจากอายาตของเรา เขาก็ถือเอาอายาตนั้น ๆ เป็นการล้อเลียน ชนเหล่านี้สำหรับพวกเขาจะได้รับการลงโทษอันอัปยศ",
                            "verse 45:10": "เบื้องหน้าพวกเขาคือนรกญะฮันมัน และสิ่งที่พวกเขาขวนขวายไว้จะไม่อำนวยประโยชน์อันใดแก่พวกเขาได้ และสิ่งที่พวกเขายึดถือเอาเป็นผู้คุ้มครองอื่นจากอัลลอฮ์ ก็จะไม่อำนวยประโยชน์เช่นกัน และสำหรับพวกเขาจะได้รับการลงโทษอย่างใหญ่หลวง",
                            "verse 45:11": "นี่คือแนวทางที่ถูกต้อง ส่วนบรรดาผู้ปฏิเสธศรัทธาต่ออายาต (อัลกุรอาน) แห่งพระเจ้าของพวกเขา สำหรับพวกเขาจะได้รับการลงโทษอันมหันต์อย่างเจ็บปวด",
                            "verse 45:12": "อัลลอฮ์ คือผู้ทรงทำให้ทะเลเป็นประโยชน์สำหรับพวกเจ้า เพื่อให้เรือเดินสมุทรแล่นไปตามน่านน้ำโดยพระบัญชาของพระองค์ และเพื่อพวกเจ้าจะได้แสวงหาความโปรดปรานของพระองค์ และเพื่อพวกเจ้าจะได้ขอบคุณ",
                            "verse 45:13": "และพระองค์ทรงทำให้สิ่งที่อยู่ในชั้นฟ้าทั้งหลาย และสิ่งที่อยู่ในแผ่นดินเป็นประโยชน์แก่พวกเจ้า ทั้งหมดนี้มาจากพระองค์แท้จริงในการนั้น แน่นอนย่อมเป็นสัญญาณสำหรับหมู่ชนผู้ใคร่ครวญ",
                            "verse 45:14": "จงกล่าวเถิดมุฮัมมัดแก่บรรดาผู้ศรัทธาให้พวกเขาอภัยแก่บรรดาผู้ที่ไม่หวังในวันทั้งหลายของอัลลอฮ์ เพื่อพระองค์จะทรงตอบแทนแก่หมู่ชนตามที่พวกเขาได้ขวนขวายเอาไว้",
                            "verse 45:15": "ผู้ใดกระทำความดีก็จะได้แก่ตัวของเขาเอง และผู้ใดกระทำความชั่ว ก็จะตกหนักแก่ตัวของเขาเองแล้วพวกเจ้าย่อมจะกลับไปหาพระเจ้าของพวกเจ้า",
                            "verse 45:16": "และโดยแน่นอนเราได้ประทานคัมภีร์และข้อชี้ขาดตัดสินและการเป็นนบีแก่วงศ์วานของอิสรออีล และเราได้ให้ปัจจัยยังชีพจากสิ่งดีๆ แก่พวกเขา และเราได้ยกย่องพวกเขาให้เหนือประชาชาติทั้งหลายในยุคนั้น",
                            "verse 45:17": "และเราได้ประทานหลักฐานอันชัดแจ้งทั้งหลายแก่พวกเขาเกี่ยวกับเรื่องนี้ พวกเขามิได้ขัดแย้งกันเว้นแต่หลักการ ได้มีความรู้มายังพวกเขาแล้วแต่เนื่องจากความริษยาระหว่างพวกเขากันเอง แท้จริงพระเจ้าจะทรงตัดสินระหว่างพวกเขาในวันกิยามะฮ์ ในสิ่งที่พวกเขาได้ขัดแย้งกันในเรื่องนั้น",
                            "verse 45:18": "แล้วเราได้ตั้งเจ้าให้อยู่บนแนวทางหนึ่ง ในเรื่องของศาสนาที่แท้จริง ดังนั้นจงปฏิบัติตามแนวทางนั้น และอย่าได้ปฏิบัติตามอารมณ์ต่ำของบรรดาผู้ไม่รู้",
                            "verse 45:19": "แท้จริงพวกเขาไม่อาจจะช่วยเจ้าให้พ้นจากอัลลอฮ์แต่อย่างใด และแท้จริงพวกอธรรมนั้นต่างก็เป็นมิตรซึ่งกันและกัน แต่อัลลอฮ์นั้นทรงเป็นผู้คุ้มครองบรรดาผู้ยำเกรง",
                            "verse 45:20": "อัลกุรอานนี้เป็นแสงสว่างแก่มวลมนุษย์ และเป็นแนวทางที่ถูกต้องและความเมตตาแก่หมู่ชนที่มีความเชื่อมั่น",
                            "verse 45:21": "หรือบรรดาผู้ที่กระทำความชั่ว คิดหรือว่าเราจะทำให้พวกเขาเป็นเช่นกับบรรดาผู้ศรัทธาและกระทำความดีทั้งหลาย ให้เท่าเทียมกันทั้งในเวลามีชีวิตของพวกเขาและการตายของพวกเขา สิ่งที่พวกเขาตัดสินนั้นมันชั่วแท้ ๆ",
                            "verse 45:22": "และอัลลอฮ์ทรงสร้างชั้นฟ้าทั้งหลายและแผ่นดินด้วยความเที่ยงธรรม และเพื่อทุก ๆ ชีวิต (ทุกคน) จะได้รับการตอบแทนตามที่ได้ขวนขวยเอาไว้ และพวกเขาจะไม่ถูกอธรรมแต่อย่างใด",
                            "verse 45:23": "เจ้าเคยเห็นผู้ที่ยึดถือเอาอารมณ์ต่ำของเขาเป็นพระเจ้าของเขาบ้างไหม ? และอัลลอฮ์จะทรงให้เขาหลงทางด้วยการรอบรู้ (ของพระองค์) และทรงผนึกการการฟังของเขาและหัวใจของเขาและทรงทำให้มีสิ่งบดบังดวงตาของเขา ดังนั้นผู้ใดเล่าจะชี้แนะแก่เขาหลังจากอัลลอฮ์ พวกเจ้ามิได้ใคร่ครวญกันดอกหรือ ?",
                            "verse 45:24": "และพวกเขากล่าวว่า ไม่มีชีวิตอื่นใดดอกนอกจากการมีชีวิตของเราในโลกนี้ เราจะตายไปและเราจะมีชีวิตอยู่ และไม่มีสิ่งใดจะมาทำลายเราได้ (ให้เราตาย) นอกจากกาลเวลาเท่านั้น สำหรับพวกเขาไม่มีความรู้ในเรื่องนั้นดอก นอกจากพวกเขาเดาเองเท่านั้น",
                            "verse 45:25": "และเมื่ออายาตต่าง ๆ อันชัดแจ้งของเราถูกสาธยายแก่พวกเขา ข้อขัดแย้งของพวกเขาก็ไม่มีอะไร นอกจากพวกเขาจะกล่าวว่า จงนำบรรพบุรุษของเราให้คืนชีพกลับมา หากพวกท่านเป็นผู้สัตย์จริง",
                            "verse 45:26": "จงกล่าวเถิดมุฮัมมัด อัลลอฮ์ทรงให้พวกท่านมีชีวิตขึ้นมา และทรงให้พวกท่านตายไป แล้วพระองค์จะทรงรวบรวมพวกท่านในวันกิยามะฮ์ อย่างไม่มีข้อสงสัยใด ๆ ในเรื่องนั้น แต่ส่วนมากของมนุษย์ไม่รู้",
                            "verse 45:27": "และอำนาจเด็ดขาดแห่งชั้นฟ้าทั้งหลายและแผ่นดินนั้นเป็นของอัลลอฮ์ วันแห่งยามอวสานจะเกิดขึ้นในวันนั้น บรรดาผู้กล่าวเท็จจะขาดทุนอย่างย่อยยับ",
                            "verse 45:28": "และเจ้าจะเห็น (กลุ่มชน) ทุกชาติอยู่ในสภาพคุกเข่า ทุกชนชาติจะถูกเรียกมาตามบันทึกของตน วันนี้พวกเจ้าจะได้รับการตอบแทนตามที่พวกเจ้าได้กระทำไว้",
                            "verse 45:29": "นี้คือบันทึกของเราจะพูดถึงเรื่องของพวกเจ้าด้วยความจริง แท้จริงเราได้ให้บันทึกไว้ตามที่พวกเจ้าได้กระทำไว้",
                            "verse 45:30": "ดังนั้นส่วนบรรดาผู้ศรัทธา และกระทำความดีทั้งหลาย พระเจ้าของพวกเจ้าของพวกเขาก็จะทรงให้พวกเขาเข้าอยู่ในความเมตตาของพระองค์ นั่นคือความสำเร็จอันชัดแจ้ง",
                            "verse 45:31": "และส่วนบรรดาผู้ปฏิเสธผู้ศรัทธานั้นอายาตต่าง ๆ ของข้า มิได้ถูกสาธยายแก่พวกเจ้าดอกหรือ ? แต่พวกเจ้าอวดโอหังและพวกเจ้าเป็นหมู่ชนผู้กระทำผิด",
                            "verse 45:32": "และเมื่อได้มีการกล่าวว่า แท้จริงสัญญาของอัลลอฮ์นั้นเป็นความจริง และยามอวสานนั้นไม่มีข้อสงสัยใด ๆ ในเรื่องนั้น พวกเจ้าก็จะกล่าวว่า เราไม่รู้ว่ายามอวสานคืออะไร ? เราคิดว่ามันมิใช่อะไรเลย นอกจากเป็นการเดาเท่านั้น และเรามิได้เป็นผู้เชื่อมั่นในเรื่องนี้",
                            "verse 45:33": "และความชั่วที่พวกเขาได้กระทำเอาไว้จะเป็นที่ประจักษ์แก่พวกเขา และสิ่งที่พวกเขาเคยเยาะเย้ยไว้นั้นห้อมล้อมพวกเขา",
                            "verse 45:34": "และจะมีเสียงกล่าวขึ้นว่า วันนี้เราจะลืมพวกเจ้าเช่นที่พวกเจ้าได้ลืมการพบในวันนี้ของพวกเจ้า และนรกคือที่พำนักของพวกเจ้า และสำหรับพวกเจ้าจะไม่มีผู้ช่วยเหลือ",
                            "verse 45:35": "เช่นนั้นแหละ เพราะพวกเจ้าได้ยึดถือเอาอายาตต่าง ๆ ของอัลลอฮ์เป็นการล้อเลียนและชีวิตในโลกดุนยานี้ ได้ล่อลวงพวกเจ้า ดังนั้นวันนี้พวกเข้าจะไม่ถูกนำออกจากนรกนั้นและพวกเข้าจะไม่ถูกขอร้องให้กลับไปแก้ตัวเพื่อขอขมาโทษ",
                            "verse 45:36": "ฉะนั้นมวลการสรรเสริญเป็นของอัลลอฮ์ พระเจ้าแห่งชั้นฟ้าทั้งหลาย และพระเจ้าแห่งแผ่นดินนี้ พระเจ้าแห่งสากลโลก",
                            "verse 45:37": "ความยิ่งใหญ่ในชั้นฟ้าทั้งหลาย และในแผ่นดินนี้เป็นกรรมสิทธิของอัลลอฮ์เท่านั้น และพระองค์เป็นผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Kitap, azîz ve hakîm olan Allah tarafından indirilmiştir.",
                            "verse 45:2": "Şüphesiz göklerde ve yerde inananlar için birçok âyetler vardır.",
                            "verse 45:3": "Sizin yaratılışınızda ve (Allah'ın) yeryüzünde yaydığı canlılarda, kesin olarak inanan bir toplum için ibret verici işaretler vardır.",
                            "verse 45:4": "Gecenin ve gündüzün değişmesinde, Allah'ın gökten indirmiş olduğu rızıkta (yağmurda) ve ölümünden sonra yeri onunla diriltmesinde, rüzgârları değişik yönlerden estirmesinde, aklını kullanan toplum için dersler vardır.",
                            "verse 45:5": "İşte sana gerçek olarak okuduğumuz bunlar Allah'ın âyetleridir.",
                            "verse 45:6": "Vay haline, her yalancı ve günahkâr kişinin!",
                            "verse 45:7": "O, Allah'ın kendisine okunan âyetlerini işitir de sonra büyüklük taslayarak sanki hiç onları duymamış gibi (küfründe) direnir.",
                            "verse 45:8": "(O) âyetlerimizden bir şey öğrendiği zaman onlarla alay eder.",
                            "verse 45:9": "Ötelerinde de cehennem vardır.",
                            "verse 45:10": "İşte bu Kur'an bir hidayettir.",
                            "verse 45:11": "Allah o (yüce) varlıktır ki, emri gereğince içinde gemilerin yüzmesi ve lütfedip verdiği rızkı aramanız için ve de şükredesiniz diye denizi size hazır hale getirmiştir.",
                            "verse 45:12": "O, göklerde ve yerde ne varsa hepsini, kendi katından (bir lütfu olmak üzere) size boyun eğdirmiştir.",
                            "verse 45:13": "İman edenlere söyle: Allah'ın (ceza) günlerinin geleceğini ummayanları bağışlasınlar.",
                            "verse 45:14": "Kim iyi iş yaparsa faydası kendinedir, kim de kötülük yaparsa zararı yine kendinedir.",
                            "verse 45:15": "Andolsun ki biz, İsrailoğullarına Kitap, hüküm ve peygamberlik verdik.",
                            "verse 45:16": "Din konusunda onlara açık deliller verdik.",
                            "verse 45:17": "Sonra da seni din konusunda bir şeriat sahibi kıldık.",
                            "verse 45:18": "Çünkü onlar, Allah'a karşı sana hiçbir fayda vermezler.",
                            "verse 45:19": "Bu (Kur'an), insanlar için basiret nurları, kesin olarak inanan bir toplum için hidayet ve rahmettir.",
                            "verse 45:20": "Yoksa kötülük işleyenler ölümlerinde ve sağlıklarında kendilerini, inanıp iyi ameller işleyen kimseler ile bir mi tutacağımızı sandılar? Ne kötü hüküm veriyorlar!",
                            "verse 45:21": "Allah, gökleri ve yeri yerli yerince yaratmıştır.",
                            "verse 45:22": "Hevâ ve hevesini tanrı edinen ve Allah'ın (kendi katındaki) bir bilgiye göre saptırdığı, kulağını ve kalbini mühürlediği, gözünün üstüne de perde çektiği kimseyi gördün mü? Şimdi onu Allah'tan başka kim doğru yola eriştirebilir? Hâla ibret almayacak mısınız?",
                            "verse 45:23": "Dediler ki: Hayat ancak bu dünyada yaşadığımızdır.",
                            "verse 45:24": "Onlara açıkça âyetlerimiz okunduğu zaman: Doğru sözlü iseniz atalarımızı getirin, demelerinden başka delilleri yoktur.",
                            "verse 45:25": "De ki: Allah sizi diriltir, sonra öldürür.",
                            "verse 45:26": "Göklerin ve yerin mülkü Allah'ındır.",
                            "verse 45:27": "O gün her ümmeti, diz çökmüş görürsün.",
                            "verse 45:28": "\"Bu, yüzünüze karşı gerçeği söyleyen kitabımızdır.",
                            "verse 45:29": "İnanıp iyi işler yapanlara gelince, Rableri onları rahmetine kabul eder.",
                            "verse 45:30": "Ama inkâr edenlere gelince onlara: Âyetlerim size okunmuş, siz de büyüklenip suçlu bir toplum olmuştunuz, değil mi? denilir.",
                            "verse 45:31": "\"Allah'ın vâdi gerçektir, kıyamet gününde şüphe yoktur\" dendiği zaman: Kıyametin ne olduğunu bilmiyoruz onun bir tahminden ibaret olduğunu sanıyoruz, (onun hakkında) kesin bir bilgi elde etmiş değiliz, demiştiniz.",
                            "verse 45:32": "Yaptıklarının kötülükleri onlara görünmüş, alay edip durdukları şey onları kuşatmıştır.",
                            "verse 45:33": "Denilir ki: Bu güne kavuşacağınızı unuttuğunuz gibi biz de bugün sizi unuturuz.",
                            "verse 45:34": "Bunun böyle olmasının sebebi şudur: Siz Allah'ın âyetlerini alaya aldınız, dünya hayatı sizi aldattı.",
                            "verse 45:35": "Hamd, göklerin Rabbi, yerin Rabbi bütün âlemlerin Rabbi olan Allah'a mahsustur.",
                            "verse 45:36": "Göklerde ve yerde azamet yalnız O'nundur."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "حٰم",
                            "verse 45:2": "حا، ميم (حقيقي معني اللہ اور رسول صلي اللہ عليہ وآلہ وسلم ہي بہتر جانتے ہيں)o",
                            "verse 45:3": "(اِس) کتاب کا اتارا جانا اللہ کي جانب سے ہے جو بڑي عزّت والا بڑي حکمت والا ہےo",
                            "verse 45:4": "اس کتاب کا اُتارا جانا خدائے غالب (اور) دانا (کی طرف) سے ہے",
                            "verse 45:5": "بیشک آسمانوں اور زمین میں ایمان والوں کے لئے (خدا کی قدرت کی) نشانیاں ہیں",
                            "verse 45:6": "بيشک آسمانوں اور زمين ميں يقيناً مومنوں کے لئے نشانياں ہيںo",
                            "verse 45:7": "اور تمہاري (اپني) پيدائش ميں اور اُن جانوروں ميں جنہيں وہ پھيلاتا ہے، يقين رکھنے والے لوگوں کے لئے نشانياں ہيںo",
                            "verse 45:8": "اور تمہاری پیدائش میں بھی۔ اور جانوروں میں بھی جن کو وہ پھیلاتا ہے یقین کرنے والوں کے لئے نشانیاں ہیں",
                            "verse 45:9": "اور رات اور دن کے آگے پیچھے آنے جانے میں اور وہ جو خدا نے آسمان سے (ذریعہ) رزق نازل فرمایا پھر اس سے زمین کو اس کے مرجانے کے بعد زندہ کیا اس میں اور ہواؤں کے بدلنے میں عقل والوں کے لئے نشانیاں ہیں",
                            "verse 45:10": "اور رات دن کے آگے پيچھے آنے جانے ميں اور (بصورتِ بارش) اُس رِزق ميں جسے اللہ آسمان سے اتارتا ہے، پھر اس سے زمين کو اُس کي مُردني کے بعد زندہ کر ديتا ہے اور (اسي طرح) ہواؤں کے رُخ پھيرنے ميں، اُن لوگوں کے لئے نشانياں ہيں جو عقل و شعور رکھتے ہيںo",
                            "verse 45:11": "يہ اللہ کي آيتيں ہيں جنہيں ہم آپ پر پوري سچائي کے ساتھ تلاوت فرماتے ہيں، پھر اللہ اور اُس کي آيتوں کے بعد يہ لوگ کس بات پر ايمان لائيں گےo",
                            "verse 45:12": "یہ خدا کی آیتیں ہیں جو ہم تم کو سچائی کے ساتھ پڑھ کر سناتے ہیں۔ تو یہ خدا اور اس کی آیتوں کے بعد کس بات پر ایمان لائیں گے؟",
                            "verse 45:13": "ہر جھوٹے گنہگار پر افسوس ہے",
                            "verse 45:14": "ہر بہتان تراشنے والے کذّاب (اور) بڑے سياہ کار کے لئے ہلاکت ہےo",
                            "verse 45:15": "جو اللہ کي (اُن) آيتوں کو سنتا ہے جو اُس پر پڑھ پڑھ کر سنائي جاتي ہيں پھر (اپنے کفر پر) اصرار کرتا ہے تکبّر کرتے ہوئے، گويا اُس نے انہيں سنا ہي نہيں، تو آپ اسے دردناک عذاب کي بشارت دے ديںo",
                            "verse 45:16": "(کہ) خدا کی آیتیں اس کو پڑھ کر سنائی جاتی ہیں تو ان کو سن تو لیتا ہے (مگر) پھر غرور سے ضد کرتا ہے کہ گویا ان کو سنا ہی نہیں۔ سو ایسے شخص کو دکھ دینے والے عذاب کی خوشخبری سنا دو",
                            "verse 45:17": "اور جب ہماری کچھ آیتیں اسے معلوم ہوتی ہیں تو ان کی ہنسی اُڑاتا ہے۔ ایسے لوگوں کے لئے ذلیل کرنے والا عذاب ہے",
                            "verse 45:18": "اور جب اسے ہماري (قرآني) آيات ميں سے کسي چيز کا (بھي) علم ہو جاتا ہے تو اسے مذاق بنا ليتا ہے، ايسے ہي لوگوں کے لئے ذلّت انگيز عذاب ہےo",
                            "verse 45:19": "اُن کے (اس عرص? حيات کے) بعد دوزخ ہے اور جو (مالِ دنيا) انہوں نے کما رکھا ہے اُن کے کچھ کام نہيں آئے گا اور نہ وہ بت (ہي کام آئيں گے) جنہيں اللہ کے سوا انہوں نے کارساز بنا رکھا ہے، اور اُن کے لئے بہت سخت عذاب ہےo",
                            "verse 45:20": "ان کے سامنے دوزخ ہے۔ اور جو کام وہ کرتے رہے کچھ بھی ان کے کام نہ آئیں گے۔ اور نہ وہی (کام آئیں گے) جن کو انہوں نے خدا کے سوا معبود بنا رکھا تھا۔ اور ان کے لئے بڑا عذاب ہے",
                            "verse 45:21": "یہ ہدایت (کی کتاب) ہے۔ اور جو لوگ اپنے پروردگار کی آیتوں سے انکار کرتے ہیں ان کو سخت قسم کا درد دینے والا عذاب ہوگا",
                            "verse 45:22": "يہ (قرآن) ہدايت ہے، اور جن لوگوں نے اپنے رب کي آيات کے ساتھ کفر کيا اُن کے لئے سخت ترين دردناک عذاب ہےo",
                            "verse 45:23": "اللہ ہي ہے جس نے سمندر کو تمہارے قابو ميں کر ديا تاکہ اس کے حکم سے اُس ميں جہاز اور کشتياں چليں اور تاکہ تم (بحري راستوں سے بھي) اُس کا فضل (يعني رزق) تلاش کر سکو، اور اس لئے کہ تم شکر گزار ہو جاؤo",
                            "verse 45:24": "خدا ہی تو ہے جس نے دریا کو تمہارے قابو کردیا تاکہ اس کے حکم سے اس میں کشتیاں چلیں اور تاکہ تم اس کے فضل سے (معاش) تلاش کرو اور تاکہ شکر کرو",
                            "verse 45:25": "اور جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے سب کو اپنے (حکم) سے تمہارے کام میں لگا دیا۔ جو لوگ غور کرتے ہیں ان کے لئے اس میں (قدرت خدا کی) نشانیاں ہیں",
                            "verse 45:26": "اور اُس نے تمہارے لئے جو کچھ آسمانوں ميں ہے اور جو کچھ زمين ميں ہے، سب کو اپني طرف سے (نظام کے تحت) مسخر کر ديا ہے، بيشک اس ميں اُن لوگوں کے لئے نشانياں ہيں جو غور و فکر کرتے ہيںo",
                            "verse 45:27": "آپ ايمان والوں سے فرما ديجئے کہ وہ اُن لوگوں کو نظر انداز کر ديں جو اللہ کے دنوں کي (آمد کي) اميد اور خوف نہيں رکھتے تاکہ وہ اُن لوگوں کو اُن (کے اعمال) کا پورا بدلہ دے دے جو وہ کمايا کرتے تھےo",
                            "verse 45:28": "مومنوں سے کہہ دو کہ جو لوگ خدا کے دنوں کی (جو اعمال کے بدلے کے لئے مقرر ہیں) توقع نہیں رکھتے ان سے درگزر کریں۔ تاکہ وہ ان لوگوں کو ان کے اعمال کا بدلے دے",
                            "verse 45:29": "جو کوئی عمل نیک کرے گا تو اپنے لئے۔ اور جو برے کام کرے گا تو ان کا ضرر اسی کو ہوگا۔ پھر تم اپنے پروردگار کی طرف لوٹ کر جاؤ گے",
                            "verse 45:30": "جس نے کوئي نيک عمل کيا سو اپني ہي جان کے (نفع کے) لئے اور جِس نے برائي کي تو (اس کا وبال بھي) اسي پر ہے پھر تم سب اپنے رب کي طرف لوٹائے جاؤ گےo",
                            "verse 45:31": "اور بيشک ہم نے بني اسرائيل کو کتاب اور حکومت اور نبوت عطا فرمائي، اور انہيں پاکيزہ چيزوں سے رزق ديا اور ہم نے انہيں (ان کے ہم زمانہ) جہانوں پر (يعني اس دور کي قوموں اور تہذيبوں پر) فضيلت بخشيo",
                            "verse 45:32": "اور ہم نے بنی اسرائیل کو کتاب (ہدایت) اور حکومت اور نبوت بخشی اور پاکیزہ چیزیں عطا فرمائیں اور اہل عالم پر فضیلت دی",
                            "verse 45:33": "اور ان کو دین کے بارے میں دلیلیں عطا کیں۔ تو انہوں نے جو اختلاف کیا تو علم آچکنے کے بعد آپس کی ضد سے کیا۔ بیشک تمہارا پروردگار قیامت کے دن ان میں ان باتوں کا جن میں وہ اختلاف کرتے تھے فیصلہ کرے گا",
                            "verse 45:34": "اور ہم نے ان کو دين (اور نبوّت) کے واضح دلائل اور نشانياں دي ہيں مگر اس کے بعد کہ اُن کے پاس (بعثتِ محمدي صلي اللہ عليہ وآلہ وسلم کا) علم آچکا انہوں نے (اس سے) اختلاف کيا محض باہمي حسد و عداوت کے باعث، بيشک آپ کا رب اُن کے درميان قيامت کے دن اس امر کا فيصلہ فرما دے گا جس ميں وہ اختلاف کيا کرتے تھےo",
                            "verse 45:35": "پھر ہم نے آپ کو دين کے کھلے راستے (شريعت) پر مامور فرما ديا، سو آپ اسي راہ پر چلتے جائيے اور اُن لوگوں کي خواہشوں کو قبول نہ فرمائيے جنہيں (آپ کي اور آپ کے دين کي عظمت و حقّانيت کا) علم ہي نہيں ہےo",
                            "verse 45:36": "پھر ہم نے تم کو دین کے کھلے رستے پر (قائم) کر دیا تو اسی (رستے) پر چلے چلو اور نادانوں کی خواہشوں کے پیچھے نہ چلنا",
                            "verse 45:37": "یہ خدا کے سامنے تمہارے کسی کام نہیں آئیں گے۔ اور ظالم لوگ ایک دوسرے کے دوست ہوتے ہیں۔ اور خدا پرہیزگاروں کا دوست ہے",
                            "verse 45:38": "بيشک يہ لوگ اللہ کي جانب سے (اسلام کي راہ ميں پيش آمدہ مشکلات کے وقت ميں وعدوں کے باوجود) ہرگز آپ کے کام نہيں آئيں گے، اور بيشک ظالم لوگ (دنيا ميں) ايک دوسرے کے ہي دوست اور مددگار ہوا کرتے ہيں، اور اللہ پرہيزگاروں کا دوست اور مددگار ہےo",
                            "verse 45:39": "يہ (قرآن) لوگوں کے لئے بصيرت و عبرت کے دلائل ہيں اور يقين رکھنے والوں کے لئے ہدايت اور رحمت ہےo",
                            "verse 45:40": "یہ قرآن لوگوں کے لئے دانائی کی باتیں ہیں اور جو یقین رکھتے ہیں ان کے لئے ہدایت اور رحمت ہے",
                            "verse 45:41": "جو لوگ برے کام کرتے ہیں کیا وہ یہ خیال کرتے ہیں کہ ہم ان کو ان لوگوں جیسا کردیں گے جو ایمان لائے اور عمل نیک کرتے رہے اور ان کی زندگی اور موت یکساں ہوگی۔ یہ جو دعوے کرتے ہیں برے ہیں",
                            "verse 45:42": "کيا وہ لوگ جنہوں نے برائياں کما رکھي ہيں يہ گمان کرتے ہيں کہ ہم انہيں اُن لوگوں کي مانند کر ديں گے جو ايمان لائے اور نيک اعمال کرتے رہے (کہ) اُن کي زندگي اور ان کي موت برابر ہو جائے? جو دعو?ي (يہ کفّار) کر رہے ہيں نہايت برا ہےo",
                            "verse 45:43": "اور اللہ نے آسمانوں اور زمين کو حق (پر مبني حکمت) کے ساتھ پيدا فرمايا اور اس لئے کہ ہر جان کو اس کے اعمال کا بدلہ ديا جائے جو اس نے کمائے ہيں اور اُن پر ظلم نہيں کيا جائے گاo",
                            "verse 45:44": "اور خدا نے آسمانوں اور زمین کو حکمت سے پیدا کیا ہے اور تاکہ ہر شخص اپنے اعمال کا بدلہ پائے اور ان پر ظلم نہیں کیا جائے گا",
                            "verse 45:45": "بھلا تم نے اس شخص کو دیکھا جس نے اپنی خواہش کو معبود بنا رکھا ہے اور باوجود جاننے بوجھنے کے (گمراہ ہو رہا ہے تو) خدا نے (بھی) اس کو گمراہ کردیا اور اس کے کانوں اور دل پر مہر لگا دی اور اس کی آنکھوں پر پردہ ڈال دیا۔ اب خدا کے سوا اس کو کون راہ پر لاسکتا ہے۔ بھلا تم کیوں نصیحت نہیں پکڑتے؟",
                            "verse 45:46": "کيا آپ نے اس شخص کو ديکھا جس نے اپني نفساني خواہش کو معبود بنا رکھا ہے اور اللہ نے اسے علم کے باوجود گمراہ ٹھہرا ديا ہے اور اس کے کان اور اس کے دل پر مُہر لگا دي ہے اور اس کي آنکھ پر پردہ ڈال ديا ہے، پھر اُسے اللہ کے بعد کون ہدايت کر سکتا ہے، سو کيا تم نصيحت قبول نہيں کرتےo",
                            "verse 45:47": "اور وہ کہتے ہيں: ہماري دنيوي زندگي کے سوا (اور) کچھ نہيں ہے ہم (بس) يہيں مرتے اور جيتے ہيں اور ہميں زمانے کے (حالات و واقعات کے) سوا کوئي ہلاک نہيں کرتا (گويا خدا اور آخرت کا مکمل انکار کرتے ہيں)، اور انہيں اس (حقيقت) کا کچھ بھي علم نہيں ہے، وہ صرف خيال و گمان سے کام لے رہے ہيںo",
                            "verse 45:48": "اور کہتے ہیں کہ ہماری زندگی تو صرف دنیا ہی کی ہے کہ (یہیں) مرتے اور جیتے ہیں اور ہمیں تو زمانہ مار دیتا ہے۔ اور ان کو اس کا کچھ علم نہیں۔ صرف ظن سے کام لیتے ہیں",
                            "verse 45:49": "اور جب ان کے سامنے ہماری کھلی کھلی آیتیں پڑھی جاتی ہیں تو ان کی یہی حجت ہوتی ہے کہ اگر تم سچے ہو تو ہمارے باپ دادا کو (زندہ کر) لاؤ",
                            "verse 45:50": "اور جب اُن پر ہماري واضح آيتيں پڑھ کر سنائي جاتي ہيں تو اس کے سوا اُن کي کوئي دليل نہيں ہوتي کہ ہمارے باپ دادا کو (زندہ کر کے) لے آؤ، اگر تم سچے ہوo",
                            "verse 45:51": "فرما ديجئے: اللہ ہي تمہيں زندگي ديتا ہے اور پھر وہي تمہيں موت ديتا ہے پھر تم سب کو قيامت کے دن کي طرف جمع فرمائے گا جس ميں کوئي شک نہيں ہے، ليکن اکثر لوگ نہيں جانتےo",
                            "verse 45:52": "کہہ دو کہ خدا ہی تم کو جان بخشتا ہے پھر (وہی) تم کو موت دیتا ہے پھر تم کو قیامت کے روز جس (کے آنے) میں کچھ شک نہیں تم کو جمع کرے گا لیکن بہت سے لوگ نہیں جانتے",
                            "verse 45:53": "اور آسمانوں اور زمین کی بادشاہت خدا ہی کی ہے۔ اور جس روز قیامت برپا ہوگی اس روز اہل باطل خسارے میں پڑ جائیں گے",
                            "verse 45:54": "اور اللہ ہي کے لئے آسمانوں اور زمين کي بادشاہت ہے اور جِس دن قيامت برپا ہوگي تب (سب) اہلِ باطل سخت خسارے ميں پڑ جائيں گےo",
                            "verse 45:55": "اور آپ ديکھيں گے (کفّار و منکرين کا) ہر گروہ گھٹنوں کے بل گِرا ہوا بيٹھا ہو گا، ہر فرقے کو اس (کے اعمال) کي کتاب کي طرف بلايا جائے گا، آج تمہيں اُن اعمال کا بدلہ ديا جائے گا جو تم کيا کرتے تھےo",
                            "verse 45:56": "اور تم ہر ایک فرقے کو دیکھو گے کہ گھٹنوں کے بل بیٹھا ہوگا۔ اور ہر ایک جماعت اپنی کتاب (اعمال) کی طرف بلائی جائے گی۔ جو کچھ تم کرتے رہے ہو آج تم کو اس کا بدلہ دیا جائے گا",
                            "verse 45:57": "یہ ہماری کتاب تمہارے بارے میں سچ سچ بیان کردے گی۔ جو کچھ تم کیا کرتے تھے ہم لکھواتے جاتے ہیں",
                            "verse 45:58": "يہ ہمارا نوشتہ ہے جو تمہارے بارے ميں سچ سچ بيان کرے گا، بيشک ہم وہ سب کچھ لکھوا (کر محفوظ کر) ليا کرتے تھے جو تم کرتے تھےo",
                            "verse 45:59": "پس جو لوگ ايمان لائے اور نيک اعمال کرتے رہے تو اُن کا رب انہيں اپني رحمت ميں داخل فرما لے گا، يہي تو واضح کاميابي ہےo",
                            "verse 45:60": "تو جو لوگ ایمان لائے اور نیک کام کرتے رہے ان کا پروردگار انہیں رحمت (کے باغ) میں داخل کرے گا۔ یہی صریح کامیابی ہے",
                            "verse 45:61": "اور جنہوں نے کفر کیا۔ (ان سے کہا جائے گا کہ) بھلا ہماری آیتیں تم کو پڑھ کر سنائی نہیں جاتی تھیں؟ پھر تم نے تکبر کیا اور تم نافرمان لوگ تھے",
                            "verse 45:62": "اور جن لوگوں نے کُفر کيا (اُن سے کہا جائے گا:) کيا ميري آيتيں تم پر پڑھ پڑھ کر نہيں سنائي جاتي تھيں، پس تم نے تکبّر کيا اور تم مُجرم لوگ تھےo",
                            "verse 45:63": "اور جب کہا جاتا تھا کہ اللہ کا وعدہ سچا ہے اور قيامت (کے آنے) ميں کوئي شک نہيں ہے تو تم کہتے تھے کہ ہم نہيں جانتے قيامت کيا ہے، ہم اُسے وہم و گمان کے سوا کچھ نہيں سمجھتے اور ہم (اِس پر) يقين کرنے والے نہيں ہيںo",
                            "verse 45:64": "اور جب کہا جاتا تھا کہ خدا کا وعدہ سچا ہے اور قیامت میں کچھ شک نہیں تو تم کہتے تھے ہم نہیں جانتے کہ قیامت کیا ہے۔ ہم اس کو محض ظنی خیال کرتے ہیں اور ہمیں یقین نہیں آتا",
                            "verse 45:65": "اور ان کے اعمال کی برائیاں ان پر ظاہر ہوجائیں گی اور جس (عذاب) کی وہ ہنسی اُڑاتے تھے وہ ان کو آگھیرے گا",
                            "verse 45:66": "اور اُن کے لئے وہ سب برائياں ظاہر ہو جائيں گي جو وہ انجام ديتے تھے اور وہ (عذاب) انہيں گھير لے گا جِس کا وہ مذاق اڑايا کرتے تھےo",
                            "verse 45:67": "اور (اُن سے) کہا جائے گا: آج ہم تمہيں بھلائے ديتے ہيں جِس طرح تم نے اپنے اِس دن کي پيشي کو بھلا ديا تھا اور تمہارا ٹھکانا دوزخ ہے اور تمہارے لئے کوئي بھي مددگار نہ ہوگاo",
                            "verse 45:68": "اور کہا جائے گا کہ جس طرح تم نے اس دن کے آنے کو بھلا رکھا تھا۔ اسی طرح آج ہم تمہیں بھلا دیں گے اور تمہارا ٹھکانا دوزخ ہے اور کوئی تمہارا مددگار نہیں",
                            "verse 45:69": "یہ اس لئے کہ تم نے خدا کی آیتوں کو مخول بنا رکھا تھا اور دنیا کی زندگی نے تم کو دھوکے میں ڈال رکھا تھا۔ سو آج یہ لوگ نہ دوزخ سے نکالے جائیں گے اور نہ ان کی توبہ قبول کی جائے گی",
                            "verse 45:70": "يہ اس وجہ سے (ہے) کہ تم نے اللہ کي آيتوں کو مذاق بنا رکھا تھا اور دنيوي زندگي نے تمہيں دھوکہ ميں ڈال ديا تھا، سو آج نہ تو وہ اُس (دوزخ) سے نکالے جائيں گے اور نہ اُن سے توبہ کے ذريعے (اللہ کي) رضاجوئي قبول کي جائے گيo",
                            "verse 45:71": "پس اللہ ہي کے لئے ساري تعريفيں ہيں جو آسمانوں کا رب ہے اور زمين کا مالک ہے، سب جہانوں کا پروردگار (بھي) ہےo",
                            "verse 45:72": "پس خدا ہی کو ہر طرح کی تعریف (سزاوار) ہے جو آسمانوں کا مالک اور زمین کا مالک اور تمام جہان کا پروردگار ہے",
                            "verse 45:73": "اور آسمانوں اور زمین میں اُسی کے لئے بڑائی ہے۔ اور وہ غالب اور دانا ہے",
                            "verse 45:74": "اور آسمانوں اور زمين ميں ساري کبريائي (يعني بڑائي) اسي کے لئے ہے اور وہي بڑا غالب بڑي حکمت والا ہےo ہے"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 45:1": "Ҳа-а.",
                            "verse 45:2": "Бу китобнинг нозил қилиниши азиз ва ўта ҳикматли Аллоҳдандир.",
                            "verse 45:3": "Албатта, осмонлару ерда мўминлар учун оят-белгилар бордир.",
                            "verse 45:4": "Ва сизларнинг яратилишингизда ва таратиб қўйган жониворларда аниқ ишонадиган қавм учун оят-белгилар бор.",
                            "verse 45:5": "Кечаю кундузнинг алмашиб туришида, Аллоҳ осмондан ризқ нозил қилиб, унинг ила ерни ўлимидан кейин тирилтиришида ва шамолларни не йўналишида ақл юритадиган қавм учун оят-белгилар бор.",
                            "verse 45:6": "Булар Аллоҳнинг оятларидир.",
                            "verse 45:7": "Ҳар бир ёлғончи гуноҳкорга ҳалокат бўлсин!",
                            "verse 45:8": "У ўзига тиловат қилинган Аллоҳнинг оятларини эшитади-ю, сўнгра худди эшитмагандек мутакаббирлик қилиб туриб олади.",
                            "verse 45:9": "Қачонки Бизнинг оятларимиздан бирор нарса билса, уни истеҳзо қилади.",
                            "verse 45:10": "Ва ортларида жаҳаннам бор.",
                            "verse 45:11": "Бу (Қуръон) ҳидоятдир.",
                            "verse 45:12": "Аллоҳ сизга денгизни унда Ўз амри билан кемалар юриши учун ва сиз Унинг фазлидан исташингиз учун бўйсундириб қўйди.",
                            "verse 45:13": "Ва сизга осмонлардаги нарсаларни ва ердаги нарсаларни—ҳаммасини Ўз томонидан бўйсундириб қўйди.",
                            "verse 45:14": "Сен иймон келтирганларга айт.",
                            "verse 45:15": "Ким солиҳ амал қилса, ўзига фойда.",
                            "verse 45:16": "Батаҳқиқ, биз Бани Исроилга китобни, ҳукмни ва Пайғамбарликни бердик, уларга пок нарсаларни ризқ қилиб бердик ва уларни оламлар ичида афзал қилдик.",
                            "verse 45:17": "Ва Биз уларга (дин) иши ҳақида очиқ-ойдин баёнотлар бердик.",
                            "verse 45:18": "Сўнгра Биз сени (дин) ишида бир шариатга йўлладик.",
                            "verse 45:19": "Албатта, улар сендан Аллоҳ томонидан бўладиган ҳеч бир нарсани арита олмаслар.",
                            "verse 45:20": "Бу (Қуръон) одамлар учун қалб кўзлари, аниқ ишонадиган қавм учун ҳидоят ва раҳматдир.",
                            "verse 45:21": "Наҳотки ёмонликларни қилганлар уларни иймон келтириб, солиҳ амаллар қилганларга ўхшаш қилмоғимизни, ҳаётлари ҳам, мамотлари ҳам баробар бўлишини гумон қилсалар?! Уларнинг қилган ҳукми нақадар ҳам ёмон! (Ушбу оятда кофир ва осий кимсанинг хаёлидан ўтадиган гумон инкор қилинмоқда.",
                            "verse 45:22": "Аллоҳ осмонлару ерни ҳақ ила, ҳар бир жон қилган касбига яраша, зулм қилинмаган ҳолида жазосини (мукофотини) олиши учун яратган.",
                            "verse 45:23": "Айтинг-чи, ҳавои нафсини илоҳ қилиб олган, Аллоҳ уни билиб туриб залолатга солган ва қулоғига ҳамда қалбига муҳр босиб, кўзига парда тортиб қўйган кимсани Аллоҳдан бошқа ким ҳидоят қила олади?! Эсламайсизларми?!",
                            "verse 45:24": "Улар: «У(ҳаёт) фақат бу дунёдаги ҳаётимиздир.",
                            "verse 45:25": "Уларга очиқ-ойдин оятларимиз тиловат қилинган чоғда: «Агар ростгўй бўлсангиз, ота-боболаримизни келтиринг-чи?!» дейишдан бошқа ҳужжатлари бўлмас.",
                            "verse 45:26": "Сен: «Аллоҳ сизларни тирилтирур, сўнгра ўлдирур, сўнгра сизларни (бўлишида) шубҳа йўқ қиёмат кунида жамлар.",
                            "verse 45:27": "Ва осмонлару ернинг мулки Аллоҳникидир.",
                            "verse 45:28": "Ҳар бир умматни тиз чўккан ҳолида кўрурсан.",
                            "verse 45:29": "«Мана бу китобимиз сизга ҳақни нутқ қилур.",
                            "verse 45:30": "Бас, иймон келтириб солиҳ амалларни қилганларни Роббилари Ўз раҳматига киритур.",
                            "verse 45:31": "Аммо куфр келтирганларга эса: «Ахир сизга Менинг оятларим тиловат қилинмаганмиди?! Бас, сиз мутакаббирлик қилдингиз ва жиноятчи қавм бўлдингиз.",
                            "verse 45:32": "Вақтики: «Албатта, Аллоҳнинг ваъдаси ҳақдир ва (Қиёмат) соатида шубҳа йўқдир», дейилса, «Қиёмат соати нима эканини билмасмиз.",
                            "verse 45:33": "Ва уларга қилган амалларининг ёмонликлари ўзларига аён бўлди ва уларни ўзлари истеҳзо қилиб юрган нарса ўраб олди.",
                            "verse 45:34": "«Бугунги кунда худди сиз ушбу кунингизга рўбарў бўлишни унутганингиздек, Биз ҳам сизни унутурмиз.",
                            "verse 45:35": "Бундай бўлишингиз, албатта, сизнинг Аллоҳнинг оятларини масхара қилиб олганингиз ва сизни дунё ҳаёти ғурурга кетказгани учундир», дейилди.",
                            "verse 45:36": "Бас, барча ҳамд осмонларнинг Роббига, ернинг Роббига ва оламларнинг Роббигадир.",
                            "verse 45:37": "Осмонлару ердаги улуғлик Уникидир."
                        }
                    }
                }
            }
        }
    }
}