{
    "id": 46,
    "name_simple": "Al-Ahqaf",
    "revelation_place": "makkah",
    "revelation_order": 66,
    "bismillah_pre": true,
    "verses_count": 35,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "It is derived from the sentence idh andhara qauma-hu bil Ahqaf-i of verse 21.",
    "text": [
        "\n",
        "It is derived from the sentence idh andhara qauma-hu bil Ahqaf-i of verse 21.",
        "\n",
        "Period of Revelation",
        "\n",
        "It is determined by an historical event that has been mentioned in vv. 29-32. This incident of the visit of the jinn and their going back after listening to the Qur'an had occurred, according to agreed traditions of the Hadith and biographical literature, at the time when the Holy Prophet had halted at Makkah during his return journey from Ta'if to Makkah. And according to all authentic historical traditions he had gone to Ta'if three years before the Hijrah ; therefore it is determined that this Surah was sent down towards the end of the 10th year or in the early part of the 11th year of the Prophethood.",
        "\n",
        "Historical Background",
        "\n",
        "The 10th year of the Prophethood was a year of extreme persecution and distress in the Holy prophet's life. The Quraish and the other tribes had continued their boycott of the Bani Hashim and the Muslims for three years and the Holy Prophet and the people of his family and Companions lay besieged in Shi'b Abi Talib. The Quraish had blocked up this locality from every side so that no supplies of any kind could reach the besieged people. Only during the Hajj season they were allowed to come out and buy some articles of necessity. But even at that time whenever Abu Lahab noticed any of them approaching the market place or a trading caravan he would call out to the merchants exhorting them to announce forbidding rates of their articles for them, and would pledge that he himself would buy those articles so that they did not suffer any loss. This boycott which continued uninterrupted for three years had broken the back of the Muslims and the Bani Hashim; so much so that at times they\r\nwere even forced to eat grass and the leaves of trees.",
        "\n",
        "At last, when the siege was lifted this year, Abu Talib, the Holy Prophet's uncle, who had been shielding him for ten long years, died, and hardly a month later his wife, Hadrat Khadijah, who had been a source of peace and consolation for him ever since the beginning of the call, also passed away. Because of these tragic incidents, which closely followed each other, the Holy Prophet used to refer to this year as the year of sorrow and grief.",
        "\n",
        "After the death of Hadart Khadijah and Abu Talib the disbelievers of Makkah became even bolder against the Holy Prophet. They started treating him even more harshly. So much so that it became difficult for him to step out of his house. Of these days Ibn Hisham has related the incident that a Quraish scoundrel one day threw dust at him openly in the street.",
        "\n",
        "At last, the Holy Prophet left for Ta'if with the intention that he should invite the Bani Thaqif to Islam, for even if they did not accept Islam, they might at least be persuaded to allow him to work for his mission peacefully. He did not have the facility of any conveyance at that time, and traveled all the way to Ta'if on foot. According to some traditions, he had gone there alone, but according to others, he was accompanied by Zaid bin Harithah. He stayed at Ta'if for a few days, and approached each of the chiefs and nobles of the Bani Thaqif and talked to him about his mission. But not only they refused to listen to him, but plainly gave him the notice that he should leave their city, for they feared that his preaching might \"spoil\" their younger generation. Thus, he was compelled to leave Ta'if. When he was leaving the city, the chiefs of Thaqif set their slaves and scoundrels behind him, who went on crying at him, abusing him and petting him with stones for a long way\r\nfrom either side of the road till he became broken down with wounds and his shoes were filled with blood. Wearied and exhausted he took shelter in the shade of the wall of a garden outside Ta'if, and prayed:",
        "\n",
        "\"O God, to Thee I complain of my weakness, little resource, and lowliness before men. O Most Merciful, Thou art the Lord of the weak, and Thou art my Lord. To whom wilt Thou confide me? To one afar who will misuse me?Or to an enemy to whom Thou hast given power over me?If Thou art not angry with me I care not. Thy favor is more wide for me. I take refuge in the light of Thy countenance by which the darkness is illumined, and the things of this world and the next are rightly ordered, lest Thy anger descend upon me or Thy wrath light upon me. It is for Thee to be satisfied until Thou art well pleased. There is no power and no might save in Thee.\" (Ibn Hisham:A. Guillaume's Translation, p. 193).",
        "\n",
        "Grieved and heart broken when he returned and reached near Qarn al-Manazil, he felt as though the sky was overcast by clouds. He looked up and saw Gabriel in front of him, who called out:\"Allah has heard the way your people have responded. He has, therefore, sent this angel in charge of the mountains. You may command him as you please.\" Then the angel of the mountains greeted him and submitted :\"If you like I would overturn the mountains from either side upon these people.\" The Holy Prophet replied : \"No, but I expect that Allah will create from their seed those who will worship none but Allah, the One.\" (Bukhari, Dhikr al Mala'ikah ; Muslim: Kitab al-Maghazi ; Nasa'i :Al-Bauth).",
        "\n",
        "After this he went to stay for a few days at Makkah, perplexed as to how he would face the people of Makkah, who, he thought, would be still further emboldened against him after hearing what had happened at Ta'if. It was here that one night when he was reciting the Qur'an in the Prayer, a group of the jinn happened to pass by and listened to the Qur'an, believed in it, and returned to their people to preach Islam. Thus, Allah gave His Prophet the good news that if the men were running away from his invitation, there were many of the jinn, who had become its believers, and they were spreading his message among their own kind.",
        "\n",
        "Subject Matter and Topics",
        "\n",
        "Such were the conditions when this Surah was sent down. Anyone who keeps this background in view, on the one hand, and studies this Surah, on the other, will have no doubt left in his mind that this is not at all the composition of Muhammad (upon whom be Allah's peace), but \"a Revelation from the All Mighty, All Wise Allah.\" For nowhere in this Surah, from the beginning to the end, does one find even a tinge of the human feelings and reactions, which are naturally produced in a man who is passing through such hard conditions. Had it been the word of Muhammad (upon whom be Allah's peace) whom the occurrence of personal griefs one after the other and the countless and the recent bitter experience at Ta'if had caused extreme anguish and distress, it would have reflected in some degree the state of the mind of the man who was the subject of these afflictions and griefs. Consider the prayer that we have cited above: it contains his own language its every word is saturated with the\r\nfeelings that he had at the time. But this Surah which was sent down precisely in the same period and was recited even by him under the same conditions, is absolutely free from every sign or trace of the time.",
        "\n",
        "The subject matter of the Surah is to warn the disbelievers of the errors in which they were involved, and also resisted arrogantly, and were condemning the man who was trying to redeem them. They regarded the world as a useless and purposeless place where they were not answerable to anyone. They thought that invitation to Tauhid was false and stuck to the belief that their own deities were actually the associates of Allah. They were not inclined to believe that the Qur'an was the Word of the Lord of the worlds. They had a strange erroneous concept of apostleship on the basis of which they were proposing strange criteria of judging the Holy Prophet's claim to it. In their estimation one great proof of Islam's not being based on the truth was that their elders and important chiefs of the tribes and so called leaders of their nation were not accepting it and only a few young men, and some poor folks and some slaves had affirmed faith in it. They thought that Resurrection\r\nand life after death and the rewards and punishments of the Hereafter were fabrications whose occurrence was absolutely out of the question.",
        "\n",
        "In this Surah each of these misconceptions has been refuted in a brief but rational way, and the disbelievers have been warned that if they would reject the invitation of the Qur'an and the Prophethood of the Prophet Muhammad (upon whom be Allah's peace) by prejudice and stubbornness instead of trying to understand its truth rationally, they would only be preparing for their own doom.",
        "\n"
    ],
    "description": "The surah that mentions the fatal lesion of the ancient people of ʿĀd who dwelled in the dune valley of Aḥqāf, whose prophet warned them to give up idolatry and worship only God, but to no avail. It takes its name from verse 21, where Aḥqāf is mentioned. It reflects one of the major themes of this surah: the inescapable punishment that awaits those who deny the truth and the Resurrection. Emphasis is placed on the fact that communities more established than the Meccans” have been destroyed, and that even the jinn believe in the Quran before the disbelievers of Mecca do. Finally, the Prophet is encouraged to be steadfast and await God’s judgement on the disbelievers.The surah is also known as: The Dune Valleys of al-Ahqaf, The Dunes, The Sand Dunes, The Sandy Plains, Winding Sand-tracts.",
    "name_translation": "AḤQĀF",
    "name_complex": "Al-Ahqâf",
    "surah_name_ar": "الأحقاف",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 46:1": "Hâ, Mîm.",
                            "verse 46:2": "(Kjo është) Shpallja e Librit prej Perëndisë, të Plotëfuqishëm dhe të Gjithëdijshëm!",
                            "verse 46:3": "Ne, kemi krijuar qiejt dhe Tokën dhe çka gjendet në mes tyre – me qëllim të plotë dhe me afat të caktuar, por mohuesit shmagen nga ajo që u është paralajmëruar.",
                            "verse 46:4": "Thuaju (atyre): “Më tregoni ju për ata që i adhuroni, pos Perëndisë? Më dëftoni ju se çka kanë krijuar ata në Tokë, apo a kanë ndonjë pjesëmarrje ata në (krijimin) e qiejve? Ma sillni Librin e shpallur para këtij (Kur’anit) apo vetëm ndonjë gjurmë nga dijenia, nëse jeni të vërtetë”.",
                            "verse 46:5": "Kush është më i humbur se ata, të cilët, pos Perëndisë, u luten atyre të cilët nuk mund t’u përgjigjen deri në Ditën e Kijametit, e ata janë të pakujdesshëm ndaj lutjes së tyre.",
                            "verse 46:6": "E, kur të ringjallen njerëzit, ata (të adhuruarit, pos Perëndisë), do të jenë armiq të tyre (adhuruesve) dhe do ta mohojnë adhurimin e tyre.",
                            "verse 46:7": "E, kur t’u lexohen ajetet Tona të qarta, mohuesit thonë për të Vërtetën – posa të dëgjojnë: “Kjo është magji e qartë!”",
                            "verse 46:8": "Ose ata thonë: “Ai (Muhammedi) e trilloi atë (Kur’anin)”.",
                            "verse 46:9": "Thuaju (atyre): “Unë nuk jam i pari profet (i ardhur në këtë Botë) dhe unë nuk di çka do të ndodhë me mua ose me ju.",
                            "verse 46:10": "Thuaju (atyre): “Më thuani ju mua se çka do të bëhet me ju nëse Kur’ani është prej Perëndisë, e ju e mohoni, e ka dëshmuar (për të) dikush prej bijve të Israelit në shembullin e tij e besoi, kurse ju u bëtë mendjemëdhenj (nuk besuat)!” Me të vërtetë, Perëndia, nuk e udhëzon (në rrugë të drejtë) popullin zullumqarë.",
                            "verse 46:11": "Dhe, mohuesit thonë për besimtarët: “Sikur të ishte ndonjë e mirë (besimi në Kur’an), ata nuk do të na kishin tejkaluar në këtë”.",
                            "verse 46:12": "E, para Kur’anit ka ekzistuar Libri i Musait – udhërrëfyes dhe mëshirë.",
                            "verse 46:13": "Me siguri, ata që thonë: “Zoti ynë është Perëndia! – dhe pastaj qëndrojnë në rrugën e drejtë, për ta nuk ka kurrfarë droje dhe as që do të pikëllohen.",
                            "verse 46:14": "Ata janë banorë të xhennetit, në të do të qëndrojnë përherë, dhe ky do të t’u jetë shpërblim për atë që kanë punuar.",
                            "verse 46:15": "Njeriut i kemi rekomanduar mirësi (sjellje të mira) ndaj prindërve të vet.",
                            "verse 46:16": "Ata janë të atillë, prej të cilëve Ne i pranojmë veprat e mira të tyre, e i kapërcejmë veprat e tyre të këqia (nuk i dënojmë për to); ata do të jenë banorë të xhennetit; ky është premtimi i vërtetë, që u është premtuar.",
                            "verse 46:17": "E, ai që u ka thënë prindërve të vet: “Uf ju! A po më premtoni se do të ringjallem kur para meje kanë kaluar shumë gjenerata (e nuk janë ringjallë)!” – e ata (prindërit) i drejtohen Perëndisë, për ndihmë (duke i thënë pasardhësit): “Kuku për ty (nëse nuk pendohesh)! Beso, me të vërtetë, premtimi i Perëndisë është i sigurt! Ai (pasardhësi) përgjigjet: “Këto janë vetëm përralla të lashta!”",
                            "verse 46:18": "Ata janë prej atyre, ndaj të cilëve është plotësuar Fjala (e dënimit) mbi popujt: xhindët dhe njerëzit që kanë qenë para tyre, sepse ata, me të vërtetë, janë shkatërruar.",
                            "verse 46:19": "Për të gjithë do të ketë shkallë të caktuara, për atë që kanë punuar, për t’i shpërblyer (dhe dënuar) sipas veprave të tyre, - e nuk do t’ju bëhet atyre padrejtësi.",
                            "verse 46:20": "(Kujtoju) Ditën, kur ata që kanë mohuar i ekspozohen zjarrit (e u thuhet atyre): “Ju keni shfrytëzuar kënaqësitë tuaja në jetën tuaj në tokë dhe jeni kënaqur me to, e sot do të ndëshkoheni me dënim të poshtëruar, ngase jeni madhështuar në Tokë pa kurrfarë të drejte dhe ngase keni bërë ngatërresa”.",
                            "verse 46:21": "Kujtoje vëllain e Adit (Hudin), kur e paralajmëroi popullin e vet në Ahkaf, e ka pasur paralajmërues edhe para tij edhe pas tij (kur u tha atyre): “Adhuronie vetëm Perëndinë! Unë, me të vërtetë, druaj se do t’ju godet dënimi i Ditës së Madhe! –",
                            "verse 46:22": "ata u përgjegjën: “Vallë, a ke ardhur të na shmangësh neve prej hyjnive tona.",
                            "verse 46:23": "Ai u tha (atyre): “Vetëm te Perëndia është dijenia e (dënimit), e unë vetëm u lajmëroj juve me atë që jam dërguar, por unë po shoh se jeni popull i zhytur në injorancë”.",
                            "verse 46:24": "E, kur e panë atë (rénë – dënimin) që u duk dhe që vinte në drejtim të luginave të tyre, thanë: “Kjo ré na sjell shiun neve!” – (E, Hudi tha): “Jo, kjo është ajo që ju e keni shpejtuar: frymë në të cilën ka dënim të dhembshëm,",
                            "verse 46:25": "e cila, me urdhërin e Perëndisë, shkatërron çdo gjë”.",
                            "verse 46:26": "Ne, i kemi vendosur ata në aso gjendje (të volitshme), në çfarë nuk u kemi vendosur juve (o Mekkas) dhe u kemi dhënë atyre të dëgjuarit, të pamurit dhe zemrën (mendjen), por as të dëgjuarit e tyre, as të pamurit e tyre, as mendja e tyre, nuk u kanë sjellë kurrfarë dobie, ngase mohuan argumentet e Perëndisë, e ata i goditi ajo me të cilën talleshin.",
                            "verse 46:27": "Me të vërtetë, Ne i kemi shkatërruar vendbanimet për rreth jush, e madje edhe u kemi shpjeguar atyre, (në mënyra ta ndryshme) argumentet Tona, për t’u kthyer ata (prej mohimit).",
                            "verse 46:28": "E, përse ata (idhujt) nuk u ndihmuan atyre, të cilët i kanë marrë, pos Perëndisë, për afrues (ndërmjetësues) te Perëndia? Por, ata nuk ekzistuan.",
                            "verse 46:29": "Dhe, (kujtoju atyre kohën) kur t’i dërguam ty disa xhindë për të dëgjuar Kur’anin.",
                            "verse 46:30": "Ata thanë: “O populli ynë! Na dëgjuam Librin, të shpallur mas Musait, i cili vërteton se janë të vërteta edhe ato para tij, i cili udhëzon kah e vërteta dhe në rrugën e drejtë.",
                            "verse 46:31": "O populli ynë, përgjigjuni ju grishtarit të Perëndisë dhe besoni Atij! Ai do t’ua falë disa mëkate tuaja dhe do t’ju shpëtojë prej dënimit të dhembshëm.",
                            "verse 46:32": "E, ai që nuk i përgjigjet grishtarit të Perëndisë, të atillë nuk do të mund t’i ikin Atij në Tokë dhe për ta s’ka mbrojtës, pos Perëndisë.",
                            "verse 46:33": "A nuk shohin ata që Perëndia – i cili krijoi qiejt dhe Tokën, i cili nuk është lodhur në krijimin e tyre – është i pushtetshëm t’i ngjallë të vdekurit? Po, me të vërtetë, Ai është i pushtetshëm për çdo gjë.",
                            "verse 46:34": "(Kujtoju) Ditën kur ata që kanë mohuar do t’i ekspozohen zjarrit (e u thuhet atyre): “Vallë, a nuk është kjo e vërtetë?” Ata, thonë: “Po, pasha Zotin tonë!” Ai do t’ju thotë (atyre): “E, pra, shijoni dënimin për mohimin që keni bërë!”",
                            "verse 46:35": "E, ti bëhu i durueshëm (o Muhammed) ashtu siç kanë duruar me këmbëngulje pejgamberët e tjerë dhe mos kërko shpejtimin e dënimit për ta! E, atë Ditë kur të përjetojnë atë që u është premtuar atyre (dënimi), do t’u duket atyre, se (në këtë botë), kanë qëndruar vetëm një çast të ditës."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Ha, Mim!",
                            "verse 46:2": "Kitabın (Qur'anın) nazil edilməsi yenilməz qüvvət sahibi, hikmət sahibi Allah tərəfindəndir!",
                            "verse 46:3": "Biz göyləri, yeri və onların arasında olanları ancaq haqq olaraq və (qiyamət günü sona çatacaq) müəyyən bir müddət üçün yaratdıq.",
                            "verse 46:4": "(Ya Peyğəmbər! Bu müşriklərə) de: \"Mənə bir xəbər verin görüm, sizin Allahdan başqa ibadət etdikləriniz yer üzündə (yaxud yerdən və ona bənzər şeylərdən) nə yaratmışlar?! Yoxsa onların göylərdə (Allahla) bir şərikliyi var?! Əgər doğru deyirsinizsə, (dediyinizi sübut etmək üçün) mənə bundan (bu Qur'andan) əvvəl (Allahdan sizə nazil olmuş) bir kitab, yaxud (əvvəlki peyğəmbərlərdən, ümmətlərdən sizə gəlib çatmış) elmdən qalan bir şey (əsər) gətirin!",
                            "verse 46:5": "Allahı qoyub qiyamətədək özünə cavab verə bilməyən bütlərə ibadət edən kimsədən daha çox (haqq yoldan) azmış kim ola bilər?! Halbuki bunlar (bu bütlər) onların (bütpərəstlərin) ibadətindən xəbərsizdirlər!",
                            "verse 46:6": "İnsanlar məhşərə toplanacaqları zaman bunlar (bu bütlər) onlara (müşriklərə) düşmən olacaq və onların ibadətini inkar edəcəklər.",
                            "verse 46:7": "Ayələrimiz onlara açıq-aydın olaraq oxunduqda (və ya: açıq-aydın ayələrimiz onlara söylənildikdə) kafirlər özlərinə gələn (Qur'an) barəsində: \"Bu, aşkar bir sehrdir!\" - deyirlər.",
                            "verse 46:8": "Yoxsa onlar: \"(Muhəmməd) onu (özündən) uydurmuşdur!\" - deyirlər.",
                            "verse 46:9": "De: \"Mən peyğəmbərlərin birincisi deyiləm.",
                            "verse 46:10": "De: \"Bir deyin görək, əgər (bu Qur'an) Allah dərgahından olsa, siz onu inkar etsəniz, İsrail oğullarından da bir şahid (Qur'anın həqiqiliyinə) onun özü kimisi (Tövrat) ilə şəhadət verib iman gətirsə və siz (yenə ona qarşı) təkəbbür göstərsəniz (zalım olmazsınızmı)? Allah zalımları doğru yola müvəffəq etməz!\"",
                            "verse 46:11": "Kafir olanlar iman gətirənlər barəsində deyirlər: \"Əgər (Qur'an, islam dini) yaxşı bir şey olsaydı, (mö'minlər) bu işdə bizdən qabağa düşə bilməzdilər (biz onlardan daha əvvəl) iman gətirərdik.",
                            "verse 46:12": "Ondan (Qur'andan) əvvəl Musanın (İsrail oğullarına, mö'minlərə) rəhbər və mərhəmət olan kitabı (Tövrat) var idi.",
                            "verse 46:13": "Şübhəsiz: \"Rəbbimiz Allahdır!\" - deyənlərin, sonra da (sözünün üstündə) möhkəm duranların (qiyamət günü) heç bir qorxusu yoxdur və onlar qəm-qüssə də görməyəcəklər!",
                            "verse 46:14": "Belələri cənnətlikdirlər, onlar (dünyada) etdikləri (yaxşı) əməllərin əvəzi olaraq orada əbədi qalacaqlar!",
                            "verse 46:15": "Biz insana ata-anasına yaxşılıq etməyi (valideynlərilə gözəl davranmağı, onlara yaxşı baxmağı) tövsiyə etdik.",
                            "verse 46:16": "Belələri (dünyadakı) yaxşı əməllərini qəbul edəcəyimiz, günahlarından keçəcəyimiz və onlara verilmiş doğru və'də görə cənnət əhli içərisində olacaq kimsələrdir!",
                            "verse 46:17": "(?zünü Allaha, axirət gününə iman gətirməyə də'vət edən) ata-anasına: \"Tfu sizə! Məndən əvvəl neçə-neçə nəsillər gəlib-getdiyi (öləndən sonra dirilmədiyi) halda, siz mənə (qiyamət günü dirildilib qəbirdən) çıxarılacağımımı və'd edirsiniz?! - deyən kimsəyə, (valideynləri) Allahdan mədəd diləyərək: \"Vay halına! (Ay yazıq) inan, Allahın və'di haqdır!\" - deyərlər.",
                            "verse 46:18": "Belələri özlərindən əvvəl gəlib getmiş və insanlardan ibarət (kafir) ümmətlərlə birlikdə haqlarında əzab sözünün (hökmünün) gerçəkləşdiyi kimsələrdir.",
                            "verse 46:19": "Hamının (mö'minlərin və kafirlərin) etdiyi əməllərə görə (Cənnətdə və Cəhənnəmdə) dərəcələri vardır ki, (qiyamət günü) Allah onlara (dünyadakı) əməllərinin əvəzini (layiqincə) versin.",
                            "verse 46:20": "Kafir olanlar cəhənnəm oduna göstəriləcəkləri (cəhənnəm odunun üzündən pərdə götürülüb kafirlərin gözünə görünəcəyi, yaxud cəhənnəm əzabını dadacaqları) gün (onlara məzəmmətlə belə deyiləcəkdir): \"Siz dünyada həyatınızda (bütün ne'mətləri görüb daddınız və onlardan ləzzət aldınız (dünyada sizin üçün gözəl olan hər şeyi xərclədiniz, axirətə bir şey qalmadı).",
                            "verse 46:21": "(Ya Rəsulum!) Ad qövmünün qardaşını (Hudu) da xatırla! Bir zaman o özündən əvvəl də, sonra da peyğəmbərlər gəlib-getmiş Əhqafda (yüksək qumsal təpələrdə) olan qövmünə belə demişdi: \"Allahdan başqasına ibadət etməyin.",
                            "verse 46:22": "Onlar: \"Sən bizi tanrılarımızdan döndərməyəmi gəldin? Əgər doğru danışanlardansansa, bizə və'd etdiyini (əzabı) gətir görək!\" - deyə cavab vermişdilər.",
                            "verse 46:23": "(Hud) demişdi: \"(Əzabın nə vaxt gələcəyini) ancaq Allah bilir.",
                            "verse 46:24": "Onu (özlərinə və'd olunmuş əzabı) vadilərinə tərəf üz tutub gələn bir bulud (şəklində) gördükləri zaman: \"Bu bizə yağış yağdıracaq buluddur!\" - dedilər.",
                            "verse 46:25": "O öz Rəbbinin əmri ilə hər şeyi məhv edər!\" Onlar (ertəsi gün) səhər çağı elə bir vəziyyətə düşdülər ki, evlərindən başqa heç bir şey görünmədi (hamısı məhv oldu).",
                            "verse 46:26": "(Ey Məkkə əhli!) And olsun ki, Biz onlara verdiyimiz imkanı (var-dövləti, qüdrəti) sizə verməmişdik.",
                            "verse 46:27": "And olsun ki, Biz sizin ətrafınızda olan məmləkətləri (Səmud, Lut tayfalarının yurdlarını) məhv etdik.",
                            "verse 46:28": "Bəs nə üçün Allahı qoyub (Ona) yaxınlaşmaq məqsədilə tanrı qəbul etdikləri (bütlər) onlara kömək etmədi? Əksinə, (o tanrılar) onlardan uzaqlaşıb qeyb oldular.",
                            "verse 46:29": "(Ya Peyğəmbər!) Onu da xatırla ki, bir zaman bir dəstə (ona qədər) cini Qur'anı dinləmək üçün sənin yanına göndərmişdik.",
                            "verse 46:30": "Onlar dedilər: \"Ey qövmümüz! Biz Musadan sonra nazil edilmiş, özündən əvvəlkiləri (Tövratı, İncili, Zəburu və səhifələri) təsdiq edən, (Allahın bəndələrini) haqqa və düz yola (islam dininə) yönəldən bir Kitab dinlədik!",
                            "verse 46:31": "Ey qövmümüz! Allahın carçısını (Muhəmməd əleyhissəlamı) qəbul edin və ona iman gətirin.",
                            "verse 46:32": "Allahın carçısını qəbul etməyən (bilsin ki) yer üzündə qaçıb canını Ondan (Onun əzabından) qurtara bilməz və ona Allahdan başqa kömək edən dostlar da tapılmaz.",
                            "verse 46:33": "Məgər onlar göyləri və yeri yaratmış və onları yaratmaqdan yorulmamış Allahın ölüləri də diriltməyə qadir olduğunu görüb anlamırlarmı? Bəli, O, hər şeyə qadirdir!",
                            "verse 46:34": "Kafirlər cəhənnəm oduna göstəriləcəkləri (cəhənnəm əzabını dadacaqları) gün (onlardan soruşulacaqdır): \"Məgər bu (daddığınız əzab) doğru deyilmi?!\" Onlar: \"Bəli, Rəbbimizə and olsun (ki, doğrudur)!\" - deyə cavab verəcəklər.",
                            "verse 46:35": "(Ya Rəsulum!) Peyğəmbərlərdən əzm (və səbat, şəriət) sahibləri olanların səbr etdiyi kimi, sən də (Allah yolunda çətinliklərə, əziyyətlərə) səbr et."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Ha Mim.",
                            "verse 46:2": "Knjigu objavljuje Allah, Silni i Mudri!",
                            "verse 46:3": "Mi smo nebesa i Zemlju i ono što je između njih mudro stvorili i do roka određenog, ali nevjernici okreću glave od onoga čime im se prijeti.",
                            "verse 46:4": "Reci: \"Kažite vi meni ili pokažite mi šta su stvorili na Zemlji i da li imaju ikakva udjela u nebesima oni kojima se vi, pored Allaha, klanjate? Donesite mi Knjigu objavljenu prije ove ili samo kakav ostatak znanja, ako istinu govorite.",
                            "verse 46:5": "Ko je u većoj zabludi od onih koji se, umjesto Allahu, klanjaju onima koji im se do Sudnjeg dana neće odazvati i koji su prema njihovim molbama ravnodušni.",
                            "verse 46:6": "Kada ljudi budu sabrani, oni će im biti neprijatelji i poreći će da su im se klanjali.",
                            "verse 46:7": "A kad se ovima Naši jasni ajeti kazuju, onda oni koji ne vjeruju govore o Istini čim im dođe: \"Ovo je prava čarolija!\"",
                            "verse 46:8": "Zar oni da govore: \"On ga izmišlja!\" Reci: \"Pa, ako ga izmišljam, vi mene od kazne Allahove nećete moći odbraniti; On dobro zna što o Kur’anu govorite.",
                            "verse 46:9": "Reci: \"Ja nisam prvi poslanik i ne znam šta će biti sa mnom ili s vama; ja slijedim samo ono što mi se objavljuje i samo sam dužan da otvoreno opominjem.",
                            "verse 46:10": "Reci: \"Kažite vi meni šta će s vama biti ako je Kur’an od Allaha, a vi u nj nećete da vjerujete, i ako je jedan od sinova Israilovih posvjedočio da je i on od Allaha, pa on povjerovao, a vi se uzoholili.",
                            "verse 46:11": "I govore nevjernici o vjernicima: \"Da je kakvo dobro, nas oni u tome ne bi pretekli.",
                            "verse 46:12": "Knjiga Musaova je bila putovođa i milost prije njega.",
                            "verse 46:13": "Oni koji govore: \"Naš Gospodar je Allah!\" - i istraju na Pravome putu, neka se ničega ne boje i ni za čim neka ne tuguju!",
                            "verse 46:14": "Oni će stanovnici Dženneta biti, i u njemu će vječno boraviti, i to će im biti nagrada za ono što su radili.",
                            "verse 46:15": "Čovjeka smo zadužili da roditeljima svojim čini dobro; majka njegova s mukom ga nosi i u mukama ga rađa, nosi ga i doji trideset mjeseci.",
                            "verse 46:16": "Eto, od takvih ćemo Mi dobra djela koja su radili primiti, a preko ružnih postupaka njihovih preći; od stanovnika Dženneta će oni biti, istinito obećanje koje im je dano ćemo ispuniti.",
                            "verse 46:17": "A onaj koji roditeljima svojim kaže: \"Ih, što mi prijetite da ću biti oživljen kad su prije mene toliki narodi bili i nestali!\" - a oni, zazivajući Allaha u pomoć, govore: \"Teško tebi, vjeruj, Allahova prijetnja će",
                            "verse 46:18": "Na takvima se treba ispuniti Riječ rečena o narodima: džinima i ljudima koji su prije njih bili i nestali, jer - oni su, zaista, nastradali.",
                            "verse 46:19": "Za sve će biti posebni stepeni, prema tome kako su radili; da ih nagradi ili kazni za djela njihova - nepravda im se neće učiniti.",
                            "verse 46:20": "A na Dan kad oni koji nisu vjerovali pred vatrom budu zaustavljeni: \"Vi ste u svome životu na Zemlji sve svoje naslade iskoristili i u njima uživali, a danas sramnom patnjom bićete kažnjeni zato što ste se na Zemlji, bez ikakva os",
                            "verse 46:21": "I spomeni brata Adovog, kada je narod svoj u Ahkafu opominjao - a bilo je i prije njega i poslije njega poslanika: \"Klanjajte se samo Allahu, ja, zaista, strahujem da ćete biti u mukama na Velikome danu!\" -",
                            "verse 46:22": "oni su odgovarali: \"Zar si nama došao da nas od božanstava naših odvratiš.",
                            "verse 46:23": "Samo Allah zna kad će to biti! - on bi govorio - \"ja vam kazujem ono što mi se objavljuje, a vi ste, vidim, narod u neznanju ogrezao.",
                            "verse 46:24": "I kad ugledaše na obzorju oblak, koji se prema dolinama njihovim kretao, povikaše: \"Ovaj nam oblak kišu donosi!\" - \"Ne, to je ono što ste požurivali: vjetar koji vam bolnu patnju nosi,",
                            "verse 46:25": "koji, voljom Gospodara svoga, sve ruši.",
                            "verse 46:26": "Njima smo dali mogućnosti koje vama nismo dali; i sluh i vid i razum smo im dali, ali im ni sluh njihov ni vid njihov ni razum njihov nisu ni od kakve koristi bili, jer su Allahove dokaze poricali - i sa svih strana ih je okružilo ono čemu",
                            "verse 46:27": "Neke gradove oko vas još davno smo uništili, a objasnili smo im bili na razne načine dokaze, ne bi li se pokajali.",
                            "verse 46:28": "A zašto im nisu pomogli oni koje su, pored Allaha, prihvatili da im budu posrednici i bogovi? Ali, njih nije bilo.",
                            "verse 46:29": "Kada ti poslasmo nekoliko džina da Kur’an slušaju, kada dođoše da ga čuju, oni rekoše: \"Pst!\" A kad se završi, vratiše se narodu svome da opominju.",
                            "verse 46:30": "O narode naš, - govorili su - \"mi smo slušali Knjigu koja se poslije Musaa objavljuje, koja potvrđuje da su istinite i one prije nje, i koja ka istini i na Pravi put upućuje.",
                            "verse 46:31": "O narode naš, odazovite se Allahovu glasniku i vjerujte u Allaha, On će vam neke grijehe vaše oprostiti i vas od patnje neizdržljive zaštititi!\"",
                            "verse 46:32": "A oni koji se ne odazovu Allahovu glasniku, takvi Mu na Zemlji neće umaći i mimo Njega zaštitnika neće naći.",
                            "verse 46:33": "Zar ne znaju da je Allah - koji je nebesa i Zemlju stvorio i koji nije, stvarajući ih, iznemogao - kadar da oživi mrtve? Jeste, On sve može.",
                            "verse 46:34": "A na Dan kad oni koji nisu vjerovali pred vatrom budu zaustavljeni: \"Zar ovo nije istina?\" - odgovoriće: \"Jest, Gospodara nam našeg!\" \"E pa iskusite patnju\" - reći će On - \"jer ste stalno poricali.",
                            "verse 46:35": "Ti izdrži kao što su izdržali odlučni poslanici i ne traži da im kazna što prije dođe! A onoga Dana kada dožive ono čime im se prijeti, učiniće im se da su ostali samo jedan čas dana."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "হা-মীম।",
                            "verse 46:2": "এই কিতাব পরাক্রমশালী, প্রজ্ঞাময় আল্লাহর পক্ষ থেকে অবতীর্ণ।",
                            "verse 46:3": "নভোমন্ডল, ভূ-মন্ডল ও এতদুভয়ের মধ্যবর্তী সবকিছু আমি যথাযথভাবেই এবং নির্দিষ্ট সময়ের জন্যেই সৃষ্টি করেছি। আর কাফেররা যে বিষয়ে তাদেরকে সতর্ক করা হয়েছে, তা থেকে মুখ ফিরিয়ে নেয়।",
                            "verse 46:4": "বলুন, তোমরা আল্লাহ ব্যতীত যাদের পূজা কর, তাদের বিষয়ে ভেবে দেখেছ কি? দেখাও আমাকে তারা পৃথিবীতে কি সৃষ্টি করেছে? অথবা নভোমন্ডল সৃজনে তাদের কি কোন অংশ আছে? এর পূর্ববর্তী কোন কিতাব অথবা পরস্পরাগত কোন জ্ঞান আমার কাছে উপস্থিত কর, যদি তোমরা সত্যবাদী হও।",
                            "verse 46:5": "যে ব্যক্তি আল্লাহর পরিবর্তে এমন বস্তুর পূজা করে, যে কেয়ামত পর্যন্তও তার ডাকে সাড়া দেবে না, তার চেয়ে অধিক পথভ্রষ্ট আর কে? তারা তো তাদের পুজা সম্পর্কেও বেখবর।",
                            "verse 46:6": "যখন মানুষকে হাশরে একত্রিত করা হবে, তখন তারা তাদের শত্রু হবে এবং তাদের এবাদত অস্বীকার করবে।",
                            "verse 46:7": "যখন তাদেরকে আমার সুস্পষ্ট আয়াতসমূহ পাঠ করে শুনানো হয়, তখন সত্য আগমন করার পর কাফেররা বলে, এ তো প্রকাশ্য জাদু।",
                            "verse 46:8": "তারা কি বলে যে, রসূল একে রচনা করেছে? বলুন, যদি আমি রচনা করে থাকি, তবে তোমরা আল্লাহর শাস্তি থেকে আমাকে রক্ষা করার অধিকারী নও। তোমরা এ সম্পর্কে যা আলোচনা কর, সে বিষয়ে আল্লাহ সম্যক অবগত। আমার ও তোমাদের মধ্যে তিনি সাক্ষী হিসাবে যথেষ্ট। তিনি ক্ষমাশীল, দয়াময়।",
                            "verse 46:9": "বলুন, আমি তো কোন নতুন রসূল নই। আমি জানি না, আমার ও তোমাদের সাথে কি ব্যবহার করা হবে। আমি কেবল তারই অনুসরণ করি, যা আমার প্রতি ওহী করা হয়। আমি স্পষ্ট সতর্ক কারী বৈ নই।",
                            "verse 46:10": "বলুন, তোমরা ভেবে দেখেছ কি, যদি এটা আল্লাহর পক্ষ থেকে হয় এবং তোমরা একে অমান্য কর এবং বনী ইসরাঈলের একজন সাক্ষী এর পক্ষে সাক্ষ্য দিয়ে এতে বিশ্বাস স্থাপন করে; আর তোমরা অহংকার কর, তবে তোমাদের চেয়ে অবিবেচক আর কে হবে? নিশ্চয় আল্লাহ অবিবেচকদেরকে পথ দেখান না।",
                            "verse 46:11": "আর কাফেররা মুমিনদের বলতে লাগল যে, যদি এ দ্বীন ভাল হত তবে এরা আমাদেরকে পেছনে ফেলে এগিয়ে যেতে পারত না। তারা যখন এর মাধ্যমে সুপথ পায়নি, তখন শীঘ্রই বলবে, এ তো এক পুরাতন মিথ্যা।",
                            "verse 46:12": "এর আগে মূসার কিতাব ছিল পথপ্রদর্শক ও রহমতস্বরূপ। আর এই কিতাব তার সমর্থক আরবী ভাষায়, যাতে যালেমদেরকে সতর্ক করে এবং সৎকর্মপরায়ণদেরকে সুসংবাদ দেয়।",
                            "verse 46:13": "নিশ্চয় যারা বলে, আমাদের পালনকর্তা আল্লাহ অতঃপর অবিচল থাকে, তাদের কোন ভয় নেই এবং তারা চিন্তিত হবে না।",
                            "verse 46:14": "তারাই জান্নাতের অধিকারী! তারা তথায় চিরকাল থাকবে। তারা যে কর্ম করত, এটা তারই প্রতিফল।",
                            "verse 46:15": "আমি মানুষকে তার পিতা-মাতার সাথে সদ্ব্যবহারের আদেশ দিয়েছি। তার জননী তাকে কষ্টসহকারে গর্ভে ধারণ করেছে এবং কষ্টসহকারে প্রসব করেছে। তাকে গর্ভে ধারণ করতে ও তার স্তন্য ছাড়তে লেগেছে ত্রিশ মাস। অবশেষে সে যখন শক্তি-সামর্থে?র বয়সে ও চল্লিশ বছরে পৌছেছে, তখন বলতে লাগল, হে আমার পালনকর্তা, আমাকে এরূপ ভাগ্য দান কর, যাতে আমি তোমার নেয়ামতের শোকর করি, যা তুমি দান করেছ আমাকে ও আমার পিতা-মাতাকে এবং যাতে আমি তোমার পছন্দনীয় সৎকাজ করি। আমার সন্তানদেরকে সৎকর্মপরায়ণ কর, আমি তোমার প্রতি তওবা করলাম এবং আমি আজ্ঞাবহদের অন্যতম।",
                            "verse 46:16": "আমি এমন লোকদের সুকর্মগুলো কবুল করি এবং মন্দকর্মগুলো মার্জনা করি। তারা জান্নাতীদের তালিকাভুক্ত সেই সত্য ওয়াদার কারণে যা তাদেরকে দেওয়া হত।",
                            "verse 46:17": "আর যে ব্যক্তি তার পিতা-মাতাকে বলে, ধিক তোমাদেরকে, তোমরা কি আমাকে খবর দাও যে, আমি পুনরুত্থিত হব, অথচ আমার পূর্বে বহু লোক গত হয়ে গেছে? আর পিতা-মাতা আল্লাহর কাছে ফরিযাদ করে বলে, দুর্ভোগ তোমার তুমি বিশ্বাস স্থাপন কর। নিশ্চয় আল্লাহর ওয়াদা সত্য। তখন সে বলে, এটা তো পূর্ববর্তীদের উপকথা বৈ নয়।",
                            "verse 46:18": "তাদের পূর্বে যে সব জ্বিন ও মানুষ গত হয়েছে, তাদের মধ্যে এ ধরনের লোকদের প্রতিও শাস্তিবানী অবধারিত হয়ে গেছে। নিশ্চয় তারা ছিল ক্ষতিগ্রস্থ।",
                            "verse 46:19": "প্রত্যেকের জন্যে তাদের কৃতকর্ম অনুযায়ী বিভিন্ন স্তর রয়েছে, যাতে আল্লাহ তাদের কর্মের পূর্ণ প্রতিফল দেন। বস্তুতঃ তাদের প্রতি যুলুম করা হবে না।",
                            "verse 46:20": "যেদিন কাফেরদেরকে জাহান্নামের কাছে উপস্থিত করা হবে সেদিন বলা হবে, তোমরা তোমাদের সুখ পার্থিব জীবনেই নিঃশেষ করেছ এবং সেগুলো ভোগ করেছ সুতরাং আজ তোমাদেরকে অপমানকর আযাবের শাস্তি দেয়া হবে; কারণ, তোমরা পৃথিবীতে অন্যায় ভাবে অহংকার করতে এবং তোমরা পাপাচার করতে।",
                            "verse 46:21": "আ’দ সম্প্রদায়ের ভাইয়ের কথা স্মরণ করুন, তার পূর্বে ও পরে অনেক সতর্ককারী গত হয়েছিল সে তার সম্প্রদায়কে বালুকাময় উচ্চ উপত্যকায় এ মর্মে সতর্ক করেছিল যে, তোমরা আল্লাহ ব্যতীত কারও এবাদত করো না। আমি তোমাদের জন্যে এক মহাদিবসের শাস্তির আশংকা করি।",
                            "verse 46:22": "তারা বলল, তুমি কি আমাদেরকে আমাদের উপাস্য দেব-দেবী থেকে নিবৃত্ত করতে আগমন করেছ? তুমি সত্যবাদী হলে আমাদেরকে যে বিষয়ের ওয়াদা দাও, তা নিয়ে আস।",
                            "verse 46:23": "সে বলল, এ জ্ঞান তো আল্লাহর কাছেই রয়েছে। আমি যে বিষয়সহ প্রেরিত হয়েছি, তা তোমাদের কাছে পৌঁছাই। কিন্তু আমি দেখছি তোমরা এক মুর্খ সম্প্রদায়।",
                            "verse 46:24": "(অতঃপর) তারা যখন শাস্তিকে মেঘরূপে তাদের উপত্যকা অভিমুখী দেখল, তখন বলল, এ তো মেঘ, আমাদেরকে বৃষ্টি দেবে। বরং এটা সেই বস্তু, যা তোমরা তাড়াতাড়ি চেয়েছিলে। এটা বায়ু এতে রয়েছে মর্মন্তুদ শাস্তি।",
                            "verse 46:25": "তার পালনকর্তার আদেশে সে সব কিছুকে ধ্বংস করে দেবে। অতঃপর তারা ভোর বেলায় এমন হয়ে গেল যে, তাদের বসতিগুলো ছাড়া কিছুই দৃষ্টিগোচর হল না। আমি অপরাধী সম্প্রদায়কে এমনিভাবে শাস্তি দিয়ে থাকি।",
                            "verse 46:26": "আমি তাদেরকে এমন বিষয়ে ক্ষমতা দিয়েছিলাম, যে বিষয়ে তোমাদেরকে ক্ষমতা দেইনি। আমি তাদের দিয়েছিলাম, কর্ণ, চক্ষু ও হৃদয়, কিন্তু তাদের কর্ণ, চক্ষু ও হৃদয় তাদের কোন কাজে আসল না, যখন তারা আল্লাহর আয়াতসমূহকে অস্বীকার করল এবং তাদেরকে সেই শাস্তি গ্রাস করে নিল, যা নিয়ে তারা ঠাট্টা বিদ্রুপ করত।",
                            "verse 46:27": "আমি তোমাদের আশপাশের জনপদ সমূহ ধ্বংস করে দিয়েছি এবং বার বার আয়াতসমূহ শুনিয়েছি, যাতে তারা ফিরে আসে।",
                            "verse 46:28": "অতঃপর আল্লাহর পরিবর্তে তারা যাদেরকে সান্নিধ্য লাভের জন্যে উপাস্যরূপে গ্রহণ করেছিল, তারা তাদেরকে সাহায্য করল না কেন? বরং তারা তাদের কাছ থেকে উধাও হয়ে গেল। এটা ছিল তাদের মিথ্যা ও মনগড়া বিষয়।",
                            "verse 46:29": "যখন আমি একদল জিনকে আপনার প্রতি আকৃষ্ট করেছিলাম, তারা কোরআন পাঠ শুনছিল,। তারা যখন কোরআন পাঠের জায়গায় উপস্থিত হল, তখন পরস্পর বলল, চুপ থাক। অতঃপর যখন পাঠ সমাপ্ত হল, তখন তারা তাদের সম্প্রদায়ের কাছে সতর্ককারীরূপে ফিরে গেল।",
                            "verse 46:30": "তারা বলল, হে আমাদের সম্প্রদায়, আমরা এমন এক কিতাব শুনেছি, যা মূসার পর অবর্তীণ হয়েছে। এ কিতাব পূর্ববর্তী সব কিতাবের প্রত্যায়ন করে, সত্যধর্ম ও সরলপথের দিকে পরিচালিত করে।",
                            "verse 46:31": "হে আমাদের সম্প্রদায়, তোমরা আল্লাহর দিকে আহবানকারীর কথা মান্য কর এবং তাঁর প্রতি বিশ্বাস স্থাপন কর। তিনি তোমাদের গোনাহ মার্জনা করবেন।",
                            "verse 46:32": "আর যে ব্যক্তি আল্লাহর দিকে আহবানকারীর কথা মানবে না, সে পৃথিবীতে আল্লাহকে অপারক করতে পারবে না এবং আল্লাহ ব্যতীত তার কোন সাহায্যকারী থাকবে না। এ ধরনের লোকই প্রকাশ্য পথভ্রষ্টতায় লিপ্ত।",
                            "verse 46:33": "তারা কি জানে না যে, আল্লাহ যিনি নভোমন্ডল ও ভূমন্ডল সৃষ্টি করেছেন এবং এগুলোর সৃষ্টিতে কোন ক্লান্তিবোধ করেননি, তিনি মৃতকে জীবিত করতে সক্ষম? কেন নয়, নিশ্চয় তিনি সর্ব বিষয়ে সর্বশক্তিমান।",
                            "verse 46:34": "যেদিন কাফেরদেরকে জাহান্নামের সামনে পেশ করা হবে, সেদিন বলা হবে, এটা কি সত্য নয়? তারা বলবে, হঁ্যা আমাদের পালনকর্তার শপথ। আল্লাহ বলবেন, আযাব আস্বাদন কর। কারণ, তোমরা কুফরী করতে।",
                            "verse 46:35": "অতএব, আপনি সবর করুন, যেমন উচ্চ সাহসী পয়গম্বরগণ সবর করেছেন এবং ওদের বিষয়ে তড়িঘড়ি করবেন না। ওদেরকে যে বিষয়ে ওয়াদা দেয়া হত, তা যেদিন তারা প্রত্যক্ষ করবে, সেদিন তাদের মনে হবে যেন তারা দিনের এক মুহুর্তের বেশী পৃথিবীতে অবস্থান করেনি। এটা সুস্পষ্ট অবগতি। এখন তারাই ধ্বংসপ্রাপ্ত হবে, যারা পাপাচারী সম্প্রদায়। করতে।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 46:1": "Ха.",
                            "verse 46:2": "Низпославането на Книгата е от Аллах, Всемогъщия, Премъдрия.",
                            "verse 46:3": "Сътворихме Ние небесата и земята, и всичко между тях, единствено с мъдрост и за определен срок.",
                            "verse 46:4": "Кажи: Виждате ли онези, които зовете вместо Аллах? Покажете ми какво сътвориха те от земята, или имат съучастие на небесата? Донесете ми книга отпреди тази или остатък от знание, ако говорите истината!",
                            "verse 46:5": "И кой е по-заблуден от онзи, който зове не Аллах, а онези, които не ще му откликнат до Деня на възкресението и неговия зов не чуват?",
                            "verse 46:6": "И когато хората бъдат събрани, те ще се окажат техни врагове и ще отричат служенето им.",
                            "verse 46:7": "И когато им бяха четени ясните Ни знамения, неверниците казваха за истината, след като дойде при тях: Това е явна магия.",
                            "verse 46:8": "Или казваха: Той си го е измислил.",
                            "verse 46:9": "Кажи: Аз не съм първият пратеник и не знам нито с мен какво ще стане, нито с вас.",
                            "verse 46:10": "Кажи: Виждате ли какво ще стане, ако този",
                            "verse 46:11": "наистина е от Аллах, а вие го отричате! И въпреки че един от синовете на Исраил е засвидетелствал, че [Коранът и предишните писания] са сходни, и затова е повярвал, вие се възгордявате.",
                            "verse 46:12": "Неверниците рекоха за вярващите: Ако той беше добро нещо, нямаше да ни изпреварят към него.",
                            "verse 46:13": "А преди него бе Писанието на Муса - водител и милост.",
                            "verse 46:14": "е потвърждаваща Книга на арабски език, за да предупреди угнетителите и да е радостна вест за благодетелните.",
                            "verse 46:15": "За онези, които казват: Нашият Господ е Аллах!, после следват правия път - не ще има страх за тях и не ще скърбят.",
                            "verse 46:16": "Те са обитателите на Рая, там ще пребивават вечно - въздаяние за техните дела.",
                            "verse 46:17": "И повелихме на човека да се отнася добре с родителите си.",
                            "verse 46:18": "На такива ще приемем хубавите дела и ще им опростим лошите постъпки.",
                            "verse 46:19": "А който казва на родителите си: Уф, пък и вие! Нима ме плашите, че ще бъда възкресен - а предишните поколения си отидоха?.",
                            "verse 46:20": "спрямо такива се сбъдна словото сред отминали преди тях общности от джиновете и от хората.",
                            "verse 46:21": "За всички има степени от онова, което са извършили.",
                            "verse 46:22": "И в Деня, когато неверниците бъдат докарани пред Огъня, [ще им бъде казано:] Пропиляхте вашите блага в земния живот и им се насладихте, а Днес ще ви се въздаде с унизителното мъчение, защото на земята бяхте надменни без право и защото бяхте нечестивци.",
                            "verse 46:23": "И спомни си [Худ -] брата на адитите, който предупреждаваше своя народ при пясъчните хълмове, където бяха минали много предупредители и дотогава, и след това: Служете единствено на Аллах! Страхувам се за вас от мъчение във великия Ден.",
                            "verse 46:24": "Рекоха: Нима дойде при нас да ни отлъчиш от нашите богове? Донеси ни онова, което ни обещаваш, ако говориш истината!",
                            "verse 46:25": "Рече: Знанието е само при Аллах, а аз ви оповестявам само онова, с което съм изпратен.",
                            "verse 46:26": "И когато го видяха - широк облак, прииждащ към техните долини, - рекоха: Това е облак, който ще изсипе дъжд над нас.",
                            "verse 46:27": "Той опустошава всяко нещо по волята на своя Господ.",
                            "verse 46:28": "И ги бяхме утвърдили повече, отколкото вас утвърдихме [о, жители на Мека].",
                            "verse 46:29": "И погубихме селищата около вас, и разяснихме знаменията, за да се завърнат [към вярата]!",
                            "verse 46:30": "И защо не им помогнаха онези, които те приеха за богове и на които се отдадоха вместо на Аллах? Да, изоставиха ги.",
                            "verse 46:31": "[И спомни си о, Мухаммад] как насочихме към теб група джинове, за да слушат Корана.",
                            "verse 46:32": "Рекоха: О, народе наш, чухме Книга, низпослана подир Муса в потвърждение на онова, което е преди нея.",
                            "verse 46:33": "О, народе наш, откликнете на зовящия към Аллах и му вярвайте! Ще ви опрости Той греховете и ще ви предпази от болезнено мъчение.",
                            "verse 46:34": "А който не откликне на зовящия към Аллах - той е безсилен на земята и няма друг покровител освен Него.",
                            "verse 46:35": "Не виждат ли, че Аллах, Който сътвори небесата и земята, и не се умори от тяхното сътворяване, има сила да съживи мъртвите? Да, Той над всяко нещо има сила.",
                            "verse 46:36": "В Деня, когато неверниците бъдат докарани пред Огъня [ще им се каже:]: Не е ли това истината?, ще кажат: Да, кълнем се в нашия Господ! Ще каже :",
                            "verse 46:37": "Вкусете тогава мъчението, защото бяхте неверници!",
                            "verse 46:38": "Затова и ти бъди търпелив [о, Мухаммад], както търпяха пратениците, удостоени с твърдост, и не бързай за тези !",
                            "verse 46:39": "В Деня, когато видят онова, което им е обещано, ще им се стори, че са престояли само един час от деня.",
                            "verse 46:40": "е послание."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "哈一，米目。",
                            "verse 46:2": "這本經是從至能至睿的真主降示的。",
                            "verse 46:3": "我只本真理而創造天地萬物，我只使他們存在至一定期。不信道的人們不顧他們曾受警告的刑罰，",
                            "verse 46:4": "你說：「你們告訴我吧！你們捨真主而祈禱的那些偶像怎麼應受崇拜呢？你們告訴我吧！他們曾獨自創造了大地的哪一部份呢？還是他們曾與真主共同創造諸天呢？你們昭示我此經之前的一本天經，或殘存的古學吧，如果你們是說實話的。」",
                            "verse 46:5": "他們捨真主而祈禱那些到復活日也不會答應他們，而且忽視他們的祈禱的偶像，有誰比他們更迷誤呢？",
                            "verse 46:6": "當眾人被集合的時候，那些被崇拜的，要變成那些崇拜者的仇敵，並且否認自己曾受過他們的崇拜。",
                            "verse 46:7": "有人對他們誦讀我的明顯的蹟象的時候，不信道的人們評論剛降臨他們的真理說：「這是明顯的魔術。」",
                            "verse 46:8": "他們甚至說：「他偽造《古蘭經》。」你說：「如果我偽造《古蘭經》，那末，你們不能為我抵御真主的一點刑罰。他全知你們對於《古蘭經》的誹謗，他足為我和你們之間的見証。他確是至赦的，確是至慈的。」",
                            "verse 46:9": "你說：「我不是破天荒的天使；我不知道我要遭遇甚麼，也不知道你們要遭遇甚麼，我只遵從我所受的啟示，我只是一個坦率的警告者。」",
                            "verse 46:10": "你說：「你們告訴我吧！如果《古蘭經》是從真主那裡降示的，而你們不信它——以色列後裔中的一個見証者，已作証其相似而信奉之，你們卻不屑信奉——那末，誰比你們更迷誤呢？真主必定不引導不義的民眾。」",
                            "verse 46:11": "不信道的人們評論道的人們說：「假若那是一件善事，他們不得在我們前信奉它。」他們沒有因他而遵循正道，故他們的偏執已顯著了，他們要說：「這是陳腐的妄言。」",
                            "verse 46:12": "在它之前，有穆薩的經典，做世人的準繩和恩惠。這是一本阿拉伯文的經典，能証實以前的天經，以便它警告不義的人們，並做行善者的佳音。",
                            "verse 46:13": "說過「我們的主是真主」，然後遵守正道的人們，將來沒有恐懼，也不憂愁；",
                            "verse 46:14": "這等人，是樂園的居民，將永居其中；這是為了報酬他們的行為。",
                            "verse 46:15": "我曾命人孝敬父母；他的母親，辛苦地懷他，辛苦地生他，他受胎和斷乳的時期，共計三十個月。當他達到壯年，再達到四十歲的的候，他說：「我的主啊！求你啟示我，使我感謝你所施於我和我的父母的恩惠，並行你所喜悅的善事。求你為我改善我的後裔。我確已向你悔罪，我確是一個順服者。」",
                            "verse 46:16": "這等人，我接受他們的善功，我赦宥他們的罪惡，他們將成為樂園的居民。這是他們所受的真實的應許。",
                            "verse 46:17": "有人對他的父母說：「唉！你們倆恫嚇我說：我要復活嗎？在我之前，有許多世代，確已逝去了。」他們倆向真主求援，並且說：「傷哉你！你信道吧，真主的應許，確是真實的！」他說：「這只是古人的故事。」",
                            "verse 46:18": "這等人，應當受刑罰的判決，而入於以前逝去的精靈和人類的各民族之中，他們確是虧折的。",
                            "verse 46:19": "他們將因自己的行為而各有若干等級，以便真主對他們的行為給予完全的報酬，他們不受虧枉。",
                            "verse 46:20": "不信道的人們遭受火刑之日，或者將對他們說：「你們在塵世生活中，已將你們的福份消盡享完；今日你們應受凌辱的刑罰，因為你們曾在地方上妄自尊大，也因為你們曾經犯罪。」",
                            "verse 46:21": "你紀念阿德人的弟兄吧！當時，他在沙丘警告他的宗族——在他以前和以後，有釵h警告者，確已逝去了——他說：「你們應該只崇拜真主，我的確怕你們遭受重大日的刑罰。」",
                            "verse 46:22": "他們說：「你來阻止我們崇拜我們的眾神靈嗎？你昭示我們你所用以恫嚇我們的刑罰吧！如果你是說實話的！」",
                            "verse 46:23": "他說：「只有真主知道刑罰何時降臨你們，我只能把我的使命傳達給你們，但我以為你們是無知的民眾。」",
                            "verse 46:24": "他們看見天邊有一朵雲，向著他們的山谷移動，他們說：「這朵雲會降雨給我們。」不然，這是你們賈求早日實現的，這是狂風，其中有痛苦的刑罰。",
                            "verse 46:25": "它奉它的主的命令而毀滅一切。一旦之間，不見他們，只見他們的房屋。我要如此報酬犯罪的民眾。",
                            "verse 46:26": "我確已把沒有賞賜你們的地位賞賜了他們，我曾賦予他們聰明睿智；但他們的聰明睿智，對於他們毫無裨益，因為他們否認真主的蹟象，所以他們一向所嘲笑的刑罰降臨他們了。",
                            "verse 46:27": "我確已毀滅你們四鄰的城市。我反覆昭示各種蹟象，以便他們悔悟。",
                            "verse 46:28": "他們捨真主而奉為神靈，以求親近真主的偶像，怎麼不相助他們呢！不然，他們已迴避他們了。那是他們的妄言，也是他們所偽造的。",
                            "verse 46:29": "當時，我曾使一伙精靈，走到你面前，來靜聽《古蘭經》。當他們來到了他面前的時候，他們說：「大家靜聽吧！」誦讀既畢，他們就回去警告他們的宗族，",
                            "verse 46:30": "他們說：「我們的宗族啊！我們確已聽見一本在穆薩之後降示的經典，它能証實以前的天經，能指引真理和正路。",
                            "verse 46:31": "我們的家族啊！你們當應答真主的號召者，而歸信真主，真主將赦宥你們的一部份罪過，並使你們得免於痛苦的刑罰。",
                            "verse 46:32": "不應答真主號召者的人，在大地上絕不能逃避天譴，除真主外，他們絕無保護者，這等人是在明顯的迷誤中的。」",
                            "verse 46:33": "創造天地而不感覺疲乏的真主，是能使死者復活的。難道他們不知道嗎？是的，他對於萬事是全能的。",
                            "verse 46:34": "不信道的人們遭受火刑之日，或者將對他們說：「難道這刑罰不是真實的嗎？」他們將說：「是真實的，以我們的主盟誓！」他將說：「你們嘗試刑罰吧！因為你們沒有信道。」",
                            "verse 46:35": "你應當堅忍，如有決心的眾使者那樣堅忍，你不要要求他們所應得的刑罰早日實現。他們眼見自己所被恐嚇的刑罰之日，他們將覺得彷彿在塵世只在白晝逗留過片刻。這是一個通告。唯悖逆的民眾，才遭毀滅。 不信道的人們遭受火刑之日，或者將對他們說：「難道這刑罰不是真實的嗎？」他們將說：「是真實的，以我們的主盟誓！」他將說：「你們嘗試刑罰吧！因為你們沒有信道。」"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Há mím!",
                            "verse 46:2": "Seslání Písma pochází od Boha mocného, moudrého.",
                            "verse 46:3": "Stvořili jsme nebesa i zemi a vše, co je mezi nimi, jen jako skutečnost vážnou a na lhůtu stanovenou, avšak ti, kdož neuvěřili, se odvracejí od toho, před čím jsou varováni.",
                            "verse 46:4": "Rci: \"Viděli jste to, co vedle Boha vzýváte? Ukažte mi tedy to, co stvořili či zda mají podíl nějaký na nebesích! Přineste mi Písmo starší, než je toto, či stopu nějakou vědění, jste-li pravdomluvní!\"",
                            "verse 46:5": "Kdo je zbloudilejší než ten, jenž vedle Boha vzývá ty, kdož jej ani do dne zmrtvýchvstání nevyslyší a kteří jsou k vzývání jejich lhostejní",
                            "verse 46:6": "a kteří, až budou lidé shromážděni, budou jim nepřáteli a budou zapírat jejich uctívání.",
                            "verse 46:7": "Když jsou jim přednášena Naše znamení jako důkazy jasné, říkají ti, kdož v pravdu neuvěřili poté, co k nim přišla: \"Tohle je kouzelnictví zjevné!\"",
                            "verse 46:8": "Anebo hovoří: \"On si to vymyslil!\" Odpověz: \"I kdybych si to vymyslil, vy nevládnete od Boha ničím pro mne.",
                            "verse 46:9": "Rci: \"Já věru nejsem žádnou novotou mezi posly a nevím ani, co stane se mnou a s vámi.",
                            "verse 46:10": "Rci: \"Co si myslíte? Jestliže je toto od Boha a vy jste v to neuvěřili, a jestliže svědek z dítek Izraele dosvědčuje podobnost toho a věří v to, zatímco vy jste hrdopyšní.",
                            "verse 46:11": "A říkají nevěřící o těch, kdož uvěřili: \"Kdyby toto Písmo bylo vskutku dobré, nebyli by nás tihle v tom předešli!\" Protože však jím nejsou správně vedeni, hovoří: \"Tohle je stará lež!\"",
                            "verse 46:12": "A již před ním byla Kniha Mojžíšova vůdcem i milosrdenstvím a toto Písmo potvrzuje pravdivost její v jazyce arabském, aby byli varováni nespravedliví a aby bylo zvěstí radostnou pro ty, kdož dobro konají.",
                            "verse 46:13": "Ti, kdož hovoří: \"Pánem naším je Bůh,\" a potom se přímou cestou ubírají, ti bát se nemusí a nebudou zarmouceni.",
                            "verse 46:14": "Ti stanou se obyvateli zahrady rajské, v níž odměnou za skutky své budou nesmrtelní.",
                            "verse 46:15": "Uložili jsme člověku laskavost vůči rodičům jeho; matka jeho jej ve strastech nosila a ve strastech jej porodila a jeho nošení a kojení trvalo třicet městců.",
                            "verse 46:16": "Od takových přijmeme jejich nejlepší skutky, jež vykonali, a jejich špatné skutky opomineme; ti patří mezi ráje obyvatele, a toto je slib pravdivý, jenž byl jim přislíben.",
                            "verse 46:17": "Je však jiný, jenž říká rodičům svým: \"Hanba vám! Chcete mi slibovat, že budu vyveden z hrobu, když přede mnou už minula mnohá pokolení, aniž byla vzkříšena?\" Oba pak prosí Boha o pomoc řkouce: \"Běda ti, uvěř, vždyť slib Boží je pravdivý!\" Avšak on odpovídá: \"Tohle jsou jen povídačky starých!\"",
                            "verse 46:18": "Takoví jsou ti, proti nimž se uskuteční slovo Boží o národech džinů a lidí, které již zanikly před nimi - a ty ztrátu utrpěly!",
                            "verse 46:19": "A každému se dostane hodnosti podle toho, co vykonal, a Bůh je odmění za jejich činy a nebude jim ukřivděno.",
                            "verse 46:20": "A v den, kdy budou předvedeni ti, kdož nevěřili, k ohni, bude jim řečeno: \"Utráceli jste dary své výtečné v pozemském životě svém a užívali jste si z nich.",
                            "verse 46:21": "A zmiň se o bratru ´Ádovců, když varoval lid svůj v zemi přesypů a byli již varovatelé před ním i po něm.",
                            "verse 46:22": "Odpověděli: \"Přišels k nám kvůli tomu, abys nás lživě odvrátil od božstev našich? Přines nám tedy to, čím nám hrozíš, jsi-li pravdomluvný!\"",
                            "verse 46:23": "Řekl: \"Vědění je pouze u Boha a já předávám vám jedině to, s čím jsem byl poslán, však vidím, že jste lid pošetilý.",
                            "verse 46:24": "A když spatřili mračno blížící se k údolím jejich, zvolali: \"Toto mračno nám přinese déšť!\" \"Nikoliv, to je to, co přáli jste si uspíšit! To vichřice je, v níž trest je bolestný",
                            "verse 46:25": "a která zničí dle rozkazu Božího věci všechny!\" A zrána bylo vidět jen příbytky jejich opuštěné.",
                            "verse 46:26": "A dali jsme jim věru postavení, jaké jsme vám nedali.",
                            "verse 46:27": "A zahubili jsme okolo vás města mnohá a ukazovali jsme jim různá znamení Svá doufajíce, že snad se obrátí.",
                            "verse 46:28": "Proč jim nepomohli ti, které si vzali vedle Boha jako božstva, aby jim obětovali? Ba naopak, božstva ta je opustila a taková byla jejich lež i vše, co si vymyslili!",
                            "verse 46:29": "A hle, vypravili jsme k tobě houfec džinů, aby naslouchali Koránu.",
                            "verse 46:30": "a řkouce: \"Lide náš, slyšeli jsme věru Písmo, jež bylo sesláno po Mojžíšovi, a potvrzující pravdivost toho, co bylo před ním, a vedoucí k pravdě a ke stezce přímé.",
                            "verse 46:31": "Lide náš, odpovězte tomu, jenž zve vás k Bohu, a uvěřte v něj! Bůh vám pak odpustí viny vaše a uchrání vás od trestu bolestného.",
                            "verse 46:32": "A kdo neodpoví tomu, kdo zve k Bohu, není s to uniknout zásahu Božímu na zemi, a nebude mít kromě Něho ochránce žádného.",
                            "verse 46:33": "Což nevidí, že Bůh, jenž stvořil nebesa a zemi, aniž se unavil jejich stvořením, je též schopen mrtvé oživit? Ba ano, vždyť On všemocný je nad věcmi všemi.",
                            "verse 46:34": "V den, kdy budou předvedeni ti, kdož nevěřili, k ohni pekelnému, bude jim řečeno: \"Což není toto skutečnost?\" A odpoví: \"Zajisté, při Pánu našem!\" A řekne Bůh: \"Ochutnejte tedy trestu za to, že jste nevěřili!\"",
                            "verse 46:35": "Buď trpělivý, jako byli trpěliví ti z poslů, kteří byli nadáni rozhodností pevnou."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Haa Miem.",
                            "verse 46:2": "De openbaring van dit Boek is van God, de Machtige, de Alwijze.",
                            "verse 46:3": "Wij hebben de hemelen en de aarde en alles wat er tussen is niet anders dan in waarheid geschapen en voor een vastgestelde tijd; maar de ongelovigen wenden zich af van hetgeen, waardoor zij zijn gewaarschuwd.",
                            "verse 46:4": "Zeg: \"Weet gij wat gij naast God aanroept? Toont mij, welk deel zij van de aarde hebben geschapen.",
                            "verse 46:5": "Wie is verder afgedwaald dan hij die buiten God (afgoden) aanroept, die tot de Dag der Opstanding hem nooit zullen kunnen antwoorden en die niet wet,en dat men hen aanroept?",
                            "verse 46:6": "En wanneer de mensen worden verzameld zullen dezen (de afgoden) hun vijanden worden en hun aanbidding ontkennen.",
                            "verse 46:7": "En wanneer Onze duidelijke woorden aan hen worden medegedeeld, zeggen degenen, die de Waarheid, toen zij tot hen kwam, verwierpen: \"Dit is klaarblijkelijk tovenarij.",
                            "verse 46:8": "Zeggen zij: \"Hij heeft dit verzonnen,\" Zeg: \"Als ik het heb verzonnen, kunt gij mij tegen God niets baten.",
                            "verse 46:9": "Zeg: \"Ik ben geen nieuwe boodschapper, noch weet ik wat met u of mij zal geschieden.",
                            "verse 46:10": "\"Ziet, indien hij van God is en gij hem verwerpt, hoewel een getuige vanuit de kinderen Israëls (Mozes) heeft getuigd van een aan hem gelijke en hij geloofde (in hem) maar gij zijt hoovaardig? Voorwaar God leidt het onrechtvaardige volk niet.",
                            "verse 46:11": "En de ongelovigen zeggen over de gelovigen: \"Indien dit goed was, zouden zij ons daarin niet voorgegaan zijn.",
                            "verse 46:12": "En voordien was het Boek van Mozes een leiding en een barmhartigheid: en dit Boek (de Koran) is bevestigend in duidelijke taal, om de onrechtvaardigen te waarschuwen en als verblijdend nieuws voor de goeden.",
                            "verse 46:13": "Voorwaar, zij, die zeggen: \"Onze Heer is God\", en dan standvastig blijven - over hen zal geen vrees komen, noch zullen zij treuren.",
                            "verse 46:14": "Dezen zijn de bewoners van het paradijs: zij zullen daarin vertoeven als beloning voor hetgeen zij plachten te doen.",
                            "verse 46:15": "En Wij hebben de mens vriendelijkheid jegens zijn ouders geboden.",
                            "verse 46:16": "Van dezulken aanvaarden Wij de goede werken die zij verrichten en Wij zien hun slechte daden over het hoofd.",
                            "verse 46:17": "- Maar degene, die tot zijn ouders zegt: \"Foei gij beiden! Dreigt gij mij dat ik opgewekt zal worden, terwijl geslachten reeds vóór mij zijn vergaan\" En beiden roepen tot God om hulp: \"Wee u! Geloof: want de belofte van God is waar.",
                            "verse 46:18": "Dezulken zijn het tegen wie het woord van kracht is geworden, tezamen met de volkeren van de djinn en de mensen die vóór hen zijn heengegaan, dat zij zeker de verliezers zullen zijn.",
                            "verse 46:19": "En voor allen zijn er graden overeenkomstig hetgeen zij doen, opdat God hun daden volledig moge belonen en hun zal geen onrecht worden aangedaan.",
                            "verse 46:20": "De Dag, waarop de ongelovigen aan het Vuur zullen worden blootgesteld, zal er tot hen worden gezegd: \"Gij buittet uw goede dingen in het leven der wereld uit en gij hebt het genoten.",
                            "verse 46:21": "En gedenk de broeder van Aad, toen hij zijn volk in de zandheuvels waarschuwde - en er zijn waarschuwers vóór en na hem geweest - \"Dient God alleen, want ik vrees de straf van een grote Dag voor u.",
                            "verse 46:22": "Toen zeiden zij: \"Zijt gij tot ons gekomen om ons van onze goden afvallig te maken? Breng hetgeen waarmee gij ons bedreigt dan over ons, als gij waarachtig zijt.",
                            "verse 46:23": "Hij zeide: \"De kennis daarvan is slechts bij God, ik breng waarmede ik ben gezonden aan u over, maar ik zie dat gij een onwetend volk zijt.",
                            "verse 46:24": "Toen zij een wolk naar hun valleien zagen komen, zeiden zij: \"Dit is een wolk, die ons regen zal geven.",
                            "verse 46:25": "Deze zal alles door het gebod van zijn Heer vernietigen.",
                            "verse 46:26": "En Wij hadden hen stevig gevestigd in hetgeen waarin Wij u niet hebben gevestigd en Wij hadden hun oren, ogen en een hart gegeven.",
                            "verse 46:27": "En waarlijk, Wij hebben om hen heen de steden vernietigd, en Wij hebben de tekenen uitgelegd opdat zij zich mochten bekeren.",
                            "verse 46:28": "Waarom hielpen degenen, die zij buiten God tot goden hadden aaagenomen, om in Zijn nabijheid, te komen, hen dan niet? Neen, zij faalden hier geheel in.",
                            "verse 46:29": "En toen Wij een aantal van de djinn naar u deden komen, die de Koran wensten te horen en, toen zij bij u kwamen, zeiden zij: \"Weest stil\" en toen het (de prediking) beëindigd was, gingen zij naar hun volk terug en waarschuwden dit.",
                            "verse 46:30": "Zij zeiden: \"O, ons volk, wij hebben een Boek horen voorlezen, dat na Mozes nedergezonden is, en dat het voorafgaande vervult, het leidt tot de Waarheid en tot de rechte weg.",
                            "verse 46:31": "\"O, ons volk, geef gehoor aan God’s verkondiger en geloof in hem.",
                            "verse 46:32": "En wie aan God’s verkondiger geen gehoor geeft kan op aarde niet ontvluchten, noch kan hij een enkele beschermer naast Hem hebben.",
                            "verse 46:33": "Hebben zij niet ingezien dat God, Die de hemelen en de aarde schiep en niet moe werd door hen te scheppen, macht heeft de doden te doen herleven? Ja, inderdaad, Hij heeft macht over alle dingen.",
                            "verse 46:34": "En de Dag, waarop de ongelovigen aan het Vuur zullen worden blootgesteld zal er worden gezegd: \"Is dit niet de waarheid?\" Zij zullen antwoorden: \"Ja zeker, bij onze Heer.",
                            "verse 46:35": "Wees daarom geduldig (o profeet) zoals de boodschappers, die mannen van karaktervastheid waren, en wees omtrent hen niet haastig."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 46:1": "Ha.",
                            "verse 46:2": "The revelation of the Scripture is from Allah the Mighty, the Wise.",
                            "verse 46:3": "We created not the heavens and the earth and all that is between them save with truth, and for a term appointed.",
                            "verse 46:4": "Say (unto them, O Muhammad): Have ye thought on all that ye invoke beside Allah ? Show me what they have created of the earth.",
                            "verse 46:5": "And who is further astray than those who, instead of Allah, pray unto such as hear not their prayer until the Day of Resurrection, and are unconscious of their prayer,",
                            "verse 46:6": "And when mankind are gathered (to the Judgment) will become enemies for them, and will become deniers of having been worshipped.",
                            "verse 46:7": "And when Our clear revelations are recited unto them, those who disbelieve say of the Truth when it reacheth them: This is mere magic.",
                            "verse 46:8": "Or say they: He hath invented it ? Say (O Muhammad): If I have invented it, still ye have no power to support me against Allah.",
                            "verse 46:9": "Say: I am no new thing among the messengers (of Allah), nor know I what will be done with me or with you.",
                            "verse 46:10": "Bethink you: If it is from Allah and ye disbelieve therein, and a witness of the Children of Israel hath already testified to the like thereof and hath believed, and ye are too proud (what plight is yours) ? Lo! Allah guideth not wrong-doing folk.",
                            "verse 46:11": "And those who disbelieve say of those who believe: If it had been (any) good, they would not have been before us in attaining it.",
                            "verse 46:12": "When before it there was the Scripture of Moses, an example and a mercy; and this is a confirming Scripture in the Arabic language, that it may warn those who do wrong and bring good tidings for the righteous.",
                            "verse 46:13": "Lo! those who say: Our Lord is Allah, and thereafter walk aright, there shall no fear come upon them neither shall they grieve.",
                            "verse 46:14": "Such are rightful owners of the Garden, immortal therein, as a reward for what they used to do.",
                            "verse 46:15": "And We have commended unto man kindness toward parents.",
                            "verse 46:16": "Those are they from whom We accept the best of what they do, and overlook their evil deeds.",
                            "verse 46:17": "And whoso saith unto his parents: Fie upon you both! Do ye threaten me that I shall be brought forth (again) when generations before me have passed away ? And they twain cry unto Allah for help (and say): Woe unto thee! Believe! Lo! the promise of Allah is true.",
                            "verse 46:18": "Such are those on whom the Word concerning nations of the jinn and mankind which have passed away before them hath effect.",
                            "verse 46:19": "And for all there will be ranks from what they do, that He may pay them for their deeds; and they will not be wronged.",
                            "verse 46:20": "And on the day when those who disbelieve are exposed to the Fire (it will be said): Ye squandered your good things in the life of the world and sought comfort therein.",
                            "verse 46:21": "And make mention (O Muhammad) of the brother of A’ad when he warned his folk among the wind-curved sandhills - and verily warners came and went before and after him - saying: Serve none but Allah.",
                            "verse 46:22": "They said: Hast come to turn us away from our gods ? Then bring upon us that wherewith thou threatenest us, if thou art of the truthful.",
                            "verse 46:23": "He said: The knowledge is with Allah only.",
                            "verse 46:24": "Then, when they beheld it as a dense cloud coming toward their valleys, they said: Here is a cloud bringing us rain.",
                            "verse 46:25": "Destroying all things by commandment of its Lord.",
                            "verse 46:26": "And verily We had empowered them with that wherewith We have not empowered you, and had assigned them ears and eyes and hearts; but their ears and eyes and hearts availed them naught since they denied the revelations of Allah; and what they used to mock befell them.",
                            "verse 46:27": "And verily We have destroyed townships round about you, and displayed (for them) Our revelation, that haply they might return.",
                            "verse 46:28": "Then why did those whom they had chosen for gods as a way of approach (unto Allah) not help them ? Nay, but they did fail them utterly.",
                            "verse 46:29": "And when We inclined toward thee (Muhammad) certain of the jinn, who wished to hear the Qur’an and, when they were in its presence, said: Give ear! and, when it was finished, turned back to their people, warning.",
                            "verse 46:30": "They said: O our people! Lo! we have heard a scripture which hath been revealed after Moses, confirming that which was before it, guiding unto the truth and a right road.",
                            "verse 46:31": "O our people! respond to Allah’s summoner and believe in Him.",
                            "verse 46:32": "And whoso respondeth not to Allah’s summoner he can nowise escape in the earth, and he hath no protecting friends instead of Him.",
                            "verse 46:33": "Have they not seen that Allah, Who created the heavens and the earth and was not wearied by their creation, is Able to give life to the dead ? Aye, He verily is Able to do all things.",
                            "verse 46:34": "And on the day when those who disbelieve are exposed to the Fire (they will be asked): Is not this real ? They will say: Yea, by our Lord.",
                            "verse 46:35": "Then have patience (O Muhammad) even as the stout of heart among the messengers (of old) had patience, and seek not to hasten on (the doom) for them."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 46:1": "Ha-Mim.",
                            "verse 46:2": "The Revelation of the Book is from God the Exalted in Power, Full of Wisdom.",
                            "verse 46:3": "We created not the heavens and the earth and all between them but for just ends, and for a Term Appointed: But those who reject Faith turn away from that whereof they are warned.",
                            "verse 46:4": "Say: \"Do ye see what it is ye invoke besides God? Show me what it is they have created on earth, or have they a share in the heavens bring me a book (revealed) before this, or any remnant of knowledge (ye may have), if ye are telling the truth!",
                            "verse 46:5": "And who is more astray than one who invokes besides God, such as will not answer him to the Day of Judgment, and who (in fact) are unconscious of their call (to them)?",
                            "verse 46:6": "And when mankind are gathered together (at the Resurrection), they will be hostile to them and reject their worship (altogether)!",
                            "verse 46:7": "When Our Clear Signs are rehearsed to them, the Unbelievers say, of the Truth when it comes to them: \"This is evident sorcery!\"",
                            "verse 46:8": "Or do they say, \"He has forged it\"? Say: \"Had I forged it, then can ye obtain no single (blessing) for me from God.",
                            "verse 46:9": "Say: \"I am no bringer of new-fangled doctrine among the apostles, nor do I know what will be done with me or with you.",
                            "verse 46:10": "Say: \"See ye? If (this teaching) be from God, and ye reject it, and a witness from among the Children of Israel testifies to its similarity (with earlier scripture), and has believed while ye are arrogant, (how unjust ye are!) truly, God guides not a people unjust.",
                            "verse 46:11": "The Unbelievers say of those who believe: \"If (this Message) were a good thing, (such men) would not have gone to it first, before us!\" And seeing that they guide not themselves thereby, they will say, \"this is an (old,) falsehood!\"",
                            "verse 46:12": "And before this, was the Book of Moses as a guide and a mercy: And this Book confirms (it) in the Arabic tongue; to admonish the unjust, and as Glad Tidings to those who do right.",
                            "verse 46:13": "Verily those who say, \"Our Lord is God,\" and remain firm (on that Path),- on them shall be no fear, nor shall they grieve.",
                            "verse 46:14": "Such shall be Companions of the Gardens, dwelling therein (for aye): a recompense for their (good) deeds.",
                            "verse 46:15": "We have enjoined on man kindness to his parents: In pain did his mother bear him, and in pain did she give him birth.",
                            "verse 46:16": "Such are they from whom We shall accept the best of their deeds and pass by their ill deeds: (They shall be) among the Companions of the Garden: a promise! of truth, which was made to them (in this life).",
                            "verse 46:17": "But (there is one) who says to his parents, \"Fie on you! Do ye hold out the promise to me that I shall be raised up, even though generations have passed before me (without rising again)?\" And they two seek God’s aid, (and rebuke the son): \"Woe to thee! Have faith! for the promise of God is true.",
                            "verse 46:18": "Such are they against whom is proved the sentence among the previous generations of Jinns and men, that have passed away; for they will be (utterly) lost.",
                            "verse 46:19": "And to all are (assigned) degrees according to the deeds which they (have done), and in order that (God) may recompense their deeds, and no injustice be done to them.",
                            "verse 46:20": "And on the Day that the Unbelievers will be placed before the Fire, (It will be said to them): \"Ye received your good things in the life of the world, and ye took your pleasure out of them: but today shall ye be recompensed with a Penalty of humiliation: for that ye were arrogant on earth without just cause, and that ye (ever) transgressed.",
                            "verse 46:21": "Mention (Hud) one of ’Ad’s (own) brethren: Behold, he warned his people about the winding Sand-tracts: but there have been warners before him and after him: \"Worship ye none other than God: Truly I fear for you the Penalty of a Mighty Day.",
                            "verse 46:22": "They said: \"Hast thou come in order to turn us aside from our gods? Then bring upon us the (calamity) with which thou dost threaten us, if thou art telling the truth?\"",
                            "verse 46:23": "He said: \"The Knowledge (of when it will come) is only with God: I proclaim to you the mission on which I have been sent: But I see that ye are a people in ignorance!\".",
                            "verse 46:24": "Then, when they saw the (Penalty in the shape of) a cloud traversing the sky, coming to meet their valleys, they said, \"This cloud will give us rain!\" \"Nay, it is the (Calamity) ye were asking to be hastened!- A wind wherein is a Grievous Penalty!",
                            "verse 46:25": "\"Everything will it destroy by the command of its Lord!\" Then by the morning they - nothing was to be seen but (the ruins of) their houses! thus do We recompense those given to sin!",
                            "verse 46:26": "And We had firmly established them in a (prosperity and) power which We have not given to you (ye Quraish!) and We had endowed them with (faculties of) hearing, seeing, heart and intellect: but of no profit to them were their (faculties of) hearing, sight, and heart and intellect, when they went on rejecting the Signs of God; and they were (completely) encircled by that which they used to mock at!",
                            "verse 46:27": "We destroyed aforetime populations round about you; and We have shown the Signs in various ways, that they may turn (to Us).",
                            "verse 46:28": "Why then was no help forthcoming to them from those whom they worshipped as gods, besides God, as a means of access (to God)? Nay, they left them in the lurch: but that was their falsehood and their invention.",
                            "verse 46:29": "Behold, We turned towards thee a company of Jinns (quietly) listening to the Qur’an: when they stood in the presence thereof, they said, \"Listen in silence!\" When the (reading) was finished, they returned to their people, to warn (them of their sins).",
                            "verse 46:30": "They said, \"O our people! We have heard a Book revealed after Moses, confirming what came before it: it guides (men) to the Truth and to a Straight Path.",
                            "verse 46:31": "\"O our people, hearken to the one who invites (you) to God, and believe in him: He will forgive you your faults, and deliver you from a Penalty Grievous.",
                            "verse 46:32": "\"If any does not hearken to the one who invites (us) to God, he cannot frustrate (God’s Plan) on earth, and no protectors can he have besides God: such men (wander) in manifest error.",
                            "verse 46:33": "See they not that God, Who created the heavens and the earth, and never wearied with their creation, is able to give life to the dead? Yea, verily He has power over all things.",
                            "verse 46:34": "And on the Day that the Unbelievers will be placed before the Fire, (they will be asked,) \"Is this not the Truth?\" they will say, \"Yea, by our Lord!\" (One will say:) \"Then taste ye the Penalty, for that ye were wont to deny (Truth)!\"",
                            "verse 46:35": "Therefore patiently persevere, as did (all) apostles of inflexible purpose; and be in no haste about the (Unbelievers)."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 46:1": "Ha Mim",
                            "verse 46:2": "The sending down of the Book is from God, the All-mighty, the All-wise.",
                            "verse 46:3": "We have not created the heavens and the earth, and what between them is, save with the truth and a stated term; but the unbelievers are turning away from that they were warned of.",
                            "verse 46:4": "Say: ’Have you considered that you call upon apart from God? Show me what they have created of the earth; or have they a partnership in the heavens? Bring me a Book before this, or some remnant of a knowledge, if you speak truly.",
                            "verse 46:5": "And who is further astray than he who calls, apart from God, upon such a one as shall not answer him till the Day of Resurrection? Such as are heedless of their calling,",
                            "verse 46:6": "and when mankind are mustered, shall be enemies to them, and shall deny their service.",
                            "verse 46:7": "And when Our signs are recited to them, clear signs, the unbelievers say to the truth when it has come to them, ’This is manifest sorcery.",
                            "verse 46:8": "Or do they say, ’He has forged it’? Say: ’If I have forged it, you have no power to help me against God.",
                            "verse 46:9": "Say: ’I am not an innovation among the Messengers, and I know not what shall be done with me or with you.",
                            "verse 46:10": "Say: ’Have you considered? If it be from God, and you disbelieve in it, and a witness from among the Children of Israel hears witness to its like, and believes, and you wax proud, God guides not the people of the evildoers.",
                            "verse 46:11": "The unbelievers say, as regards the believers, ’If it had been aught good, they had not outstripped us to it.",
                            "verse 46:12": "Yet before it was the Book of Moses for a model and a mercy; and this is a Book confirming, in Arabic tongue, to warn the evildoers, and good tidings to the good-doers.",
                            "verse 46:13": "Surely those who say, ’Our Lord is God’ and then go straight, no fear shall be on them, neither shall they sorrow.",
                            "verse 46:14": "Those are the inhabitants of Paradise, therein dwelling forever, as a recompense for that they have been doing.",
                            "verse 46:15": "We have charged man, that he be kind to his parents; his mother bore him painfully, and painfully she gave birth to him; his bearing and his weaning are thirty months.",
                            "verse 46:16": "Those are they from whom We shall accept the best of what they have done, and We shall pass over their evil deeds.",
                            "verse 46:17": "But he who says to his father and his mother, ’Fie upon you! Do you promise me that I shall be brought forth, when already generations have passed away before me?’ while they call upon God for succour -- ’Woe upon thee! Believe; surely God’s promise is true’; then he says, ’This is naught but the fairy-tales of the ancients’ --",
                            "verse 46:18": "such men are they against whom has been realized the Word concerning nations that passed away before them, men and jinn alike; they were losers.",
                            "verse 46:19": "All shall have their degrees, according to what they have wrought, and that He may pay them in full for their works, and they not being wronged.",
                            "verse 46:20": "Upon the day when the unbelievers are exposed to the Fire: ’You dissipated your good things in your present life, and you took your enjoyment in them; therefore today you shall be recompensed with the chastisement of humiliation for that you waxed proud in the earth without right, and for your ungodliness.",
                            "verse 46:21": "And remember the brother of Ad, when he warned his people beside the sand-dunes -- and already warners had passed away alike before him and behind him -- saying, ’Serve none but God! Truly I fear for you the chastisement of a dreadful day.",
                            "verse 46:22": "They said, ’What, hast thou come to pervert us from our gods? Then bring us that thou promisest us, if indeed thou speakest truly.",
                            "verse 46:23": "He said, ’Knowledge is only with God, and I deliver to you the Message with which I was sent; but I see you are an ignorant people.",
                            "verse 46:24": "Then, when they saw it as a sudden cloud coming towards their valleys, they said, ’This is a cloud, that shall give us rain!’ ’Not so; rather it is that you sought to hasten -- a wind, wherein is a painful chastisement,",
                            "verse 46:25": "destroying everything by the commandment of its Lord.",
                            "verse 46:26": "And We had established them in that wherein We have not established you, and We appointed for them hearing, and sight, and hearts; and yet their hearing, their sight and their hearts availed them nothing, since they denied the signs of God, and they were encompassed by that they mocked at.",
                            "verse 46:27": "And We destroyed the cities about you, and We turned about the signs, that haply they would return.",
                            "verse 46:28": "Then why did those not help them that they had taken to themselves as mediators, gods apart from God? Not so; but they went astray from them, and that was their calumny, and what they had been forging.",
                            "verse 46:29": "And when We turned to thee a company of jinn giving ear to the Koran; and when they were in its presence they said, ’Be silent!’ Then, when it was finished, they turned back to their people, warning.",
                            "verse 46:30": "They said, ’Our people, we have heard a Book that was sent down after Moses, confirming what was before it, guiding to the truth and to a straight path.",
                            "verse 46:31": "O our people, answer God’s summoner, and believe in Him, and He will forgive you some of your sins, and protect you from a painful chastisement.",
                            "verse 46:32": "Whosoever answers not God’s summoner cannot frustrate God in the earth, and he has no protectors apart from Him; those are in manifest error.",
                            "verse 46:33": "What, have they not seen that God who created the heavens and earth, not being wearied by creating them, is able to give life to the dead? Yes indeed; He is powerful over everything.",
                            "verse 46:34": "Upon the day when the unbelievers are exposed to the Fire: ’Is not this the truth?’ They shall say, ’Yes, by our Lord!’ He shall say, ’Then taste the chastisement of your unbelief!’",
                            "verse 46:35": "So be thou patient, as the Messengers possessed of constancy were also patient."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 46:1": "Hā.",
                            "verse 46:2": "THE BESTOWAL from on high of this divine writ issues from God, the Almighty, the Wise.",
                            "verse 46:3": "We have not created the heavens and the earth and all that is between them otherwise than in accordance with [an inner] truth, and for a term set [by Us]: and yet, they who are bent on denying the truth turn aside from the warning which has been conveyed unto them.",
                            "verse 46:4": "Say: \"Have you",
                            "verse 46:5": "given thought to what it is that you invoke instead of God? Show me what these [beings or forces] have created anywhere on earth! Or had they, perchance, a share in",
                            "verse 46:6": "the heavens? [If so,] bring me any divine writ preceding this one, or any",
                            "verse 46:7": "vestige of knowledge – if what you claim is true!\"",
                            "verse 46:8": "And who could be more astray than one who invokes, instead of God, such as will not respond to him either now or on the Day of Resurrection, and are not even conscious of being invoked?",
                            "verse 46:9": "such as, when all mankind is gathered [for judgment], will be enemies unto those [who worshipped them], and will utterly reject their worship?",
                            "verse 46:10": "But whenever Our messages are conveyed to them in all their clarity, they who are bent on denying the truth speak thus of the truth as soon as it is brought to them: \"This is clearly nothing but spellbinding eloquence!\"",
                            "verse 46:11": "Or do they say, \"He has invented all this\"? Say [O Muhammad]: \"Had I invented it, you would not be of the least help to me against God.",
                            "verse 46:12": "into which you so recklessly plunge: enough is He as a witness between me and you! And",
                            "verse 46:13": "He alone is truly-forgiving, a true dispenser of grace.",
                            "verse 46:14": "Say: \"I am not the first of",
                            "verse 46:15": "apostles; and [like all of them,] I do not know what will be done with me or with you; I only follow what is revealed to me: for I am nothing but a plain warner.",
                            "verse 46:16": "Say: \"Have you given thought [to how you will fare] if this be truly [a revelation] from God and yet you deny its truth? – even though a witness from among the children of Israel has already borne witness to [the advent of] one like himself, and has believed [in him], the while you glory in your arrogance [and reject his message]? Verily, God does not grace",
                            "verse 46:17": "evildoing folk with His guidance!\"",
                            "verse 46:18": "But they who are bent on denying the truth speak thus of those who have attained to faith: \"If this",
                            "verse 46:19": "were any good, these",
                            "verse 46:20": "would not have preceded us in accepting it!\" And since they refuse to be guided by it, they will always say, \"This is",
                            "verse 46:21": "an ancient falsehood!\"",
                            "verse 46:22": "And yet, before this there was the revelation of Moses, a guide and a [sign of God’s] grace; and this",
                            "verse 46:23": "is a divine writ confirming the truth [of the Torah] in the Arabic tongue, to warn those who are bent on evildoing, and [to bring] a glad tiding to the doers of good:",
                            "verse 46:24": "for, behold, all who say, \"Our Sustainer is God,\" and thereafter stand firm [in their faith] – no fear need they have, and neither shall they grieve:",
                            "verse 46:25": "it is they who are destined for paradise, therein to abide as a reward for all that they have done.",
                            "verse 46:26": "NOW [among the best of the deeds which] We have enjoined upon man",
                            "verse 46:27": "goodness towards his parents.",
                            "verse 46:28": "It is [such as] these from whom We shall accept the best that they ever did, and bad deeds We shall overlook: [they will find themselves] among those who are destined for paradise, in fulfilment of the true promise which they were given [in this world].",
                            "verse 46:29": "But [there is many a one] who says to his parents [whenever they try to imbue him with faith in God]: \"Fie upon both of you! Do you promise me that I shall be brought forth [from the dead], although [so many] generations have passed away before me?\" And",
                            "verse 46:30": "they both pray for God’s help [and say], \"Alas for thee! Believe, for, behold, God’s promise always comes true!\" – he but answers, \"All this is nothing but fables of ancient times!\"",
                            "verse 46:31": "It is [such as] these upon whom the sentence [of doom] will fall due, together with the [other sinful] communities of invisible beings and humans that have passed away before their time.",
                            "verse 46:32": "for [in the life to come,] all shall have their degrees in accordance with whatever [good or evil] they did: and so, He will repay them in full for their doings, and none shall be wronged.",
                            "verse 46:33": "And on the Day when those who were bent on denying the truth will be brought within sight of the fire, [they will be told:] \"You have exhausted your [share of] good things in your worldly life, having enjoyed them [without any thought of the hereafter]: and so today you shall be requited with the suffering of humiliation for having gloried on earth in your arrogance, offending against all that is right, and for all your iniquitous doings!\"",
                            "verse 46:34": "AND REMEMBER that brother of [the tribe of] ’ād, how – seeing that",
                            "verse 46:35": "warnings had already come and gone within his own knowledge as well as in times beyond his ken – he warned his people [who lived] among those sand-dunes: \"Worship none but God! Verily, I fear lest suffering befall you on an awesome day!\"",
                            "verse 46:36": "They answered: \"Hast thou come to seduce us away from our gods? Bring, then, upon us that",
                            "verse 46:37": "with which thou threatenest us, if thou art a man of truth!\"",
                            "verse 46:38": "Said he: \"Knowledge [of when it is to befall you] rests with God alone: I but convey unto you the message with which I have been entrusted; but I see that you are people ignorant [of right and wrong]!\"",
                            "verse 46:39": "And so, when they beheld it in the shape of a dense cloud approaching their valleys, they exclaimed, \"This is but a heavy cloud which will bring us",
                            "verse 46:40": "rain!\" [But Hūd said:] \"Nay, but it is the very thing which you [so contemptuously] sought to hasten – a wind bearing grievous suffering,",
                            "verse 46:41": "bound to destroy everything at its Sustainer’s behest!\" And then they were so utterly wiped out that nothing could be seen save their",
                            "verse 46:42": "dwellings: thus do We requite people lost in sin.",
                            "verse 46:43": "And yet, We had established them securely in a manner in which We have never established you, [O people of later times;] and We had endowed them with hearing, and sight, and",
                            "verse 46:44": "hearts: but neither their hearing, nor their sight, nor their hearts were of the least avail to them, seeing that they went on rejecting God’s messages; and [in the end] they were overwhelmed by the very thing which they had been wont to deride.",
                            "verse 46:45": "Thus have We destroyed many a",
                            "verse 46:46": "community living round about you; and yet, [before destroying them,] We had given many facets to [Our warning] messages, so that they might turn back [from their evil ways].",
                            "verse 46:47": "But, then, did those",
                            "verse 46:48": "whom they had chosen to worship as deities beside God, hoping that they would bring them nearer [to Him], help them [in the end]? Nay, they forsook them: for that [alleged divinity] was but an outcome of their self-delusion and all their false imagery.",
                            "verse 46:49": "AND LO! We caused a group of unseen beings to incline towards thee, [O Muhammad,] so that they might give ear to the Qur’ān; and so, as soon as they became aware of it, they said [unto one another], \"Listen in silence!\" And when [the recitation] was ended, they returned to their people as warners.",
                            "verse 46:50": "They said: \"O our people! Behold, we have been listening to a revelation bestowed from on high after [that of] Moses, confirming the truth of whatever there still remains [of the Torah]: it guides towards the truth, and onto a straight way.",
                            "verse 46:51": "\"O our people! Respond to God’s call, and have faith in Him: He will forgive you [whatever is past] of your sins, and deliver you from grievous suffering [in the life to come].",
                            "verse 46:52": "But he who does not respond to God’s call can never elude",
                            "verse 46:53": "on earth, nor can he have any protector against Him [in the life to come]: all such are most obviously lost in error.",
                            "verse 46:54": "ARE, THEN, they [who deny the life to come] not aware that God, who has created the heavens and the earth and never been wearied by their creation, has",
                            "verse 46:55": "the power to bring the dead back to life? Yea, verily, He has the power to will anything!",
                            "verse 46:56": "And so, on the Day when those who were bent on denying the truth will be brought within sight of the fire [and will be asked], \"Is not this the truth?\" – they will answer, \"Yea, by Our Sustainer!\"",
                            "verse 46:57": "He will say: \"Taste, then, this suffering as an outcome of your denial of the truth!\"",
                            "verse 46:58": "REMAIN, then, [O believer,] patient in adversity, just as all of the apostles, endowed with firmness of heart, bore themselves with patience.",
                            "verse 46:59": "destroyed save iniquitous folk?"
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 46:1": "We created the heavens and the earth and all that is between them with naught but Truth.",
                            "verse 46:2": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 46:3": "The Book of Certainty (1952) •",
                            "verse 46:4": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 46:5": "What is Sufism (1975) •",
                            "verse 46:6": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 46:7": "Muhammad (1983) •",
                            "verse 46:8": "Symbol and Archetype (1991) •",
                            "verse 46:9": "Sufi Poems (2004) •",
                            "verse 46:10": "Mecca (2004) •",
                            "verse 46:11": "Return to the Spirit (2005) •",
                            "verse 46:12": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 46:13": "“Proofs of Islam”(1954).",
                            "verse 46:14": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 46:15": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 46:16": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 46:17": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 46:18": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 46:19": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 46:20": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 46:21": "“The Quranic Origins of Sufism” •",
                            "verse 46:22": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 46:23": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 46:24": "“An Introduction to Islam” •",
                            "verse 46:25": "“The Universality of the Quran” •",
                            "verse 46:26": "Private Talks Books",
                            "verse 46:27": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 46:1": "Hā Mīm .",
                            "verse 46:2": "This is revelation of the book from Allah, the All-Mighty, the All-Wise.",
                            "verse 46:3": "We did not create the heavens and the earth but with true purpose and for a specified term.",
                            "verse 46:4": "Say, “Tell me about those whom you invoke instead of Allah, (and) show me what they have created from the earth; Or have they a share in (the creation of) the heavens? Bring to me a book (revealed) before this one, or a trace of knowledge, if you are truthful.",
                            "verse 46:5": "Who is more astray than him who invokes, instead of Allah, those who will not respond to him up to the Day of Judgement; and they are totally unaware of their prayers,",
                            "verse 46:6": "and when people will be assembled (on the Day of Judgment), they will be enemies to them, and will refuse even their having worshipped them.",
                            "verse 46:7": "When Our verses are recited to them in all their clarity, the disbelievers say about the truth when it comes to them, “This is an open magic.",
                            "verse 46:8": "Is it that they say, “He has forged it (the Qur’ān)”? Say, “If I have forged it, then you do not have any power to help me against Allah.",
                            "verse 46:9": "Say, “I am not something unprecedented among the messengers, and I do not know what will be done to me or to you.",
                            "verse 46:10": "Say, “Tell me, If it (the Qur’ān) is from Allah and you reject it, and a witness from the children of Isrā’īl testifies about something similar to it and comes to believe (in it), while you persist in your arrogance, (then, how unjust you are!) Surely, Allah does not give guidance to the unjust people.",
                            "verse 46:11": "The disbelievers say about the believers, “Had it (Islamic faith) been a good thing, these (weak and poor) people would not have preceded us (in proceeding) towards it.",
                            "verse 46:12": "And before this there was the Book of Mūsā, a guide and a mercy.",
                            "verse 46:13": "Surely, those who say, “Our Lord is Allah” and then stay firm, they will have no fear, nor shall they grieve.",
                            "verse 46:14": "Those are the people of Paradise, who will live there for ever as a reward for what they used to do.",
                            "verse 46:15": "And We have enjoined upon man to do good to his parents.",
                            "verse 46:16": "Such are the people from whom We accept the best of what they did, and overlook their evil deeds, (so as they will be) among the people of Paradise according to the true promise that was made to them.",
                            "verse 46:17": "And (Contrary to this is the case of) the one who said to his parents, “Fie upon you both! Do you promise to me that I shall be brought out (from the grave), while generations have passed before me?” And they (the parents) were crying for Allah’s help, (and saying to their son,) “Woe to you.",
                            "verse 46:18": "Such are the people on whom the word (of punishment) has come true along with the communities of the Jinn and the humans that have passed before them.",
                            "verse 46:19": "For each (of these two groups) there are (different) ranks because of what they did, and so that He may repay them in full for their deeds; and they will not be wronged.",
                            "verse 46:20": "And the day the disbelievers will be presented before the Fire, (it will be said to them,) “You have consumed your good things in your worldly life, and have enjoyed them.",
                            "verse 46:21": "And recall the brother of (the nation of) ‘Ād, when he warned his people at the long, curved sand dunes- while many warners have passed before him and after him (with the same message)-saying, “Do not worship anyone except Allah.",
                            "verse 46:22": "They said, “Have you come to make us deviate from our gods? So bring us that with which you are threatening us, if you are truthful.",
                            "verse 46:23": "He said, “The knowledge is with Allah alone, and I am conveying to you what I am sent with, but I see you are a people who act ignorantly.",
                            "verse 46:24": "So, when they saw it as a cloud proceeding towards their valleys, they said, “This is a cloud that will bring us rain.",
                            "verse 46:25": "that will destroy every thing with the command of its Lord! So they became such that nothing remained to be seen except their dwelling places.",
                            "verse 46:26": "And indeed We had established them in a powerful position in which We did not establish you (O people of Makkah), and had given to them ears and eyes and hearts, but neither their ears benefited them in the least, nor their eyes, nor their hearts, as they used to reject Allah’s signs; and they were encircled by what they used to ridicule.",
                            "verse 46:27": "And We have (also) destroyed (other) towns around you, while We had given to them a variety of signs, so that they might return (from disbelief).",
                            "verse 46:28": "So, why is it that they were not helped by those whom they had taken as gods beside Allah in order to attain closeness (to Him)? Instead, they vanished from them.",
                            "verse 46:29": "And (recall) when We directed a group of Jinns towards you, listening to the Qur’ān.",
                            "verse 46:30": "They said, “O our people, we have heard a book sent down after Mūsā, 8 confirming what was before it, which guides to the truth and to a straight path.",
                            "verse 46:31": "O our people, respond to Allah’s herald, and believe in him, and (once you do that,) Allah will forgive your sins for you, and will save you from a painful punishment.",
                            "verse 46:32": "The one who does not respond to Allah’s herald is not (able) to frustrate (Allah by escaping) in the land, and for him there are no supporters besides Him.",
                            "verse 46:33": "Have they not seen that Allah who has created the heavens and the earth, and was not wearied by their creation, does have power to give life to the dead? Yes of course, He is powerful to do every thing.",
                            "verse 46:34": "The day the disbelievers will be presented to the Fire, (it will be said to them,) “Is this not true?” They will say, “Yes of course, Our Lord!” He will say, “Then taste the punishment, for you used to disbelieve.",
                            "verse 46:35": "So, (O prophet,) observe patience, as the resolute messengers observed patience, and be not in haste about them."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 46:1": "Hā mīm.",
                            "verse 46:2": "The revelation of the Book is from God, the Mighty, the Wise.",
                            "verse 46:3": "We have not created the heavens and the earth and all that is between them except in truth, and for an appointed term.",
                            "verse 46:4": "Say: ‘Have you considered what you invoke besides God? Show me what they have created of the earth.",
                            "verse 46:5": "And who is further astray than him who invokes such as would not respond to him",
                            "verse 46:6": "until the Day of Resurrection and who are heedless of their supplication?",
                            "verse 46:7": "And when mankind are gathered, they will be enemies to them and they will deny their worship.",
                            "verse 46:8": "And when Our signs are recited to them, being clear signs, those who disbelieve say of the truth when it comes to them, ‘This is plain sorcery!’",
                            "verse 46:9": "Or do they say, ‘He has invented it?’ Say: ‘If I have invented it, still you would have no power to avail me against God in any way.",
                            "verse 46:10": "Say: ‘I am not a novelty among the messengers.",
                            "verse 46:11": "Say: ‘Have you considered? if it is from God and you disbelieve in it, and a witness from the Children of Israel has",
                            "verse 46:12": "testified to the like of it, and he has believed [in it], while you act with arrogance …’.",
                            "verse 46:13": "And those who disbelieve say of those who believe: ‘Had it been",
                            "verse 46:14": "good, they would not have attained it before us’.",
                            "verse 46:15": "Yet before it, [there was] the Book of Moses, as a guidepost and a mercy, and this is a Book that confirms in the Arabic tongue to warn those who do wrong, and",
                            "verse 46:16": "good tidings for the virtuous.",
                            "verse 46:17": "Assuredly those who say, ‘Our Lord is God’ and then remain upright, no fear will befall them, nor will they grieve.",
                            "verse 46:18": "Those will be the inhabitants of Paradise, abiding therein as a reward for what they used to do.",
                            "verse 46:19": "And We have enjoined man to be kind to his parents.",
                            "verse 46:20": "Those are they from whom We accept the best of what they do, and overlook their misdeeds, [as they stand] among the inhabitants of Paradise — [this is] the true promise which they were promised.",
                            "verse 46:21": "As for him who says to his parents: ‘Fie on you both.",
                            "verse 46:22": "Such are the ones against whom the Word is due concerning communities of jinn and humans that have passed away before them.",
                            "verse 46:23": "And for each one there will be degrees [of status], according to what they have done, and that He may recompense them fully for their deeds, and they will not be wronged.",
                            "verse 46:24": "And on the day when those who disbelieve are exposed to the Fire: ‘You squandered your good things during your life of the world and enjoyed them.",
                            "verse 46:25": "And mention the brother of ‘ād when he warned his people at Ahqāf and already warners had passed away before him and after him, saying, ‘Do not worship anyone but God.",
                            "verse 46:26": "They said, ‘Have you come to divert us from our gods? Then bring us what you threaten us with, if you are of the truthful’.",
                            "verse 46:27": "He said, ‘The knowledge is with God only, and I am",
                            "verse 46:28": "conveying to you what I have been sent with.",
                            "verse 46:29": "Then, when they saw it as a sudden cloud heading towards their valleys, they said, ‘This is a cloud that will bring us rain!’ Nay, but it is what you sought to hasten a hurricane containing a painful chastisement,",
                            "verse 46:30": "destroying everything by the command of its Lord.",
                            "verse 46:31": "And verily We had empowered them in ways in which We have not empowered you, and We had vested them with ears and eyes and hearts.",
                            "verse 46:32": "And We certainly destroyed the towns [that were] around you, and We dispensed the signs so that perhaps they might return.",
                            "verse 46:33": "So why did they not help them, those whom they had chosen besides God, as [a means of] nearness, to be gods? Nay, but they forsook them and that was their lie and what they used to invent.",
                            "verse 46:34": "And when We sent a company of jinn your way to listen to the Qur’ān and, when they were in its presence, they said: ‘Listen carefully!’ Then, when it was finished, they went back to their people to warn .",
                            "verse 46:35": "They said, ‘O our people! Indeed we have heard a Book which has been revealed after Moses, confirming what was before it.",
                            "verse 46:36": "O our people! Respond to God’s summoner, and believe in him, and He will forgive you some of your sins and shelter you from a painful chastisement.",
                            "verse 46:37": "And whoever does not respond to God’s summoner cannot thwart God on earth, and he will not have, besides Him, any protectors — those are in manifest error’.",
                            "verse 46:38": "Have they not seen that God, Who created the heavens and the earth and",
                            "verse 46:39": "was not wearied by their creation, is able to give life to the dead? Yes, indeed.",
                            "verse 46:40": "And on the day when those who disbelieve are exposed to the Fire: ‘Is not this the truth?’ They will say, ‘Yes, by our Lord!’ He will say, ‘Then taste the chastisement for what you used to disbelieve ’.",
                            "verse 46:41": "So endure [with patience] just as the resolute from among the messengers endured [with patience].",
                            "verse 46:42": "for them."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 46:1": "Ha-Mim.",
                            "verse 46:2": "The revelation of this Book is from Allah, Almighty, Most Wise.",
                            "verse 46:3": "We have not created the heavens and the earth and (the creation) that is between them but with wisdom and (the fixing of) an appointed term.",
                            "verse 46:4": "Say: ‘Tell me of the (idols) you worship instead of Allah; show me what they have created in the earth, or (bring it forth if) they have a partnership in (the creation of) the heavens.",
                            "verse 46:5": "And who can be more in error than someone who worships such (idols) apart from Allah as cannot answer (his question) till the Day of Resurrection? And those (idols) have no consciousness of their prayer and worship.",
                            "verse 46:6": "And when mankind shall be gathered (on the Day of Resurrection), those (false gods) will be their enemies and will deny their worship (for their own absolution).",
                            "verse 46:7": "And when Our clear Verses are recited to them, (then) the disbelievers say about the truth (the Qur’an) whilst it has come to them: ‘This is obvious magic.",
                            "verse 46:8": "Do they say that (the Messenger) has fabricated it (the Qur’an)? Say: ‘If I have concocted it, then you have no authority to save me from (the torment of) Allah.",
                            "verse 46:9": "Say: ‘I am not the first Messenger (sent to mankind that no precedent of Messengership exists before me).",
                            "verse 46:10": "Say: ‘Tell me, if this (Qur’an) is from Allah and you deny it and a witness from the Children of Israel (also) bears testimony to the mention of (the revelation of) such a Book (in the Revealed Books revealed earlier), then he believes (in it as well), but (despite that) you show arrogance (then what will be your fate?) Surely, Allah does not guide the wrongdoing people.",
                            "verse 46:11": "And the disbelievers said to the believers: ‘Had it (the Din of Muhammad [blessings and peace be upon him]) been a better (religion), these people would not have advanced towards it taking the lead over us.",
                            "verse 46:12": "And before it was the Book of Musa (Moses [the Torah]), a guide and mercy.",
                            "verse 46:13": "Surely, those who say: ‘Allah is our Lord,’ then hold fast (to it) have nothing to fear, nor shall they grieve.",
                            "verse 46:14": "They it is, the people of Paradise, who will live in it forever.",
                            "verse 46:15": "And We have commanded man to be benevolent towards his parents.",
                            "verse 46:16": "It is they whose good works We accept and overlook their omissions.",
                            "verse 46:17": "And he who says to his parents: ‘Fie on you! Do you promise me that I shall be brought forth (from the grave and given life once more) when generations have passed away before me?’ Now both (the parents) pray to Allah for help (and say to the son:) ‘Woe to you, (O son!) Accept faith.",
                            "verse 46:18": "It is they against whom the command of Allah’s (torment) has proved true amongst generations that have passed of the jinn as well as mankind.",
                            "verse 46:19": "And the ranks (in Paradise and Hell) are allocated for all (separately) according to the (good and evil) deeds which they do, so that (Allah) pays them back in full for their actions and they will not be wronged at all.",
                            "verse 46:20": "And the Day when the disbelievers will be brought before the Fire of Hell (it will be said to them:) ‘You received your favourite and tasteful luxuries in the life of the world and exacted from them (maximum) benefit.",
                            "verse 46:21": "And, (O Beloved,) remember (Hud) the kinship brother of the people of ‘Ad, when he warned his people (of the dire consequences of their evil deeds) in al-Ahqaf, (the Sand-Dunes [a valley in Yemen, between Oman and Mahra]) although (a number of) Warners (i.",
                            "verse 46:22": "They said: ‘Have you come to us to turn us away from our gods? So bring us that (torment) you are threatening us with if you are of those who speak the truth.",
                            "verse 46:23": "He said: ‘The knowledge (of the Hour of the torment) is with Allah alone.",
                            "verse 46:24": "So when they saw that (torment) advancing on their valleys like a cloud, they said: ‘This is the cloud that is going to rain upon us.",
                            "verse 46:25": "(That) will destroy everything by the command of its Lord.",
                            "verse 46:26": "(O people of Mecca!) In fact, We had given them power and ability in those fields of activity in which We have not granted you potential.",
                            "verse 46:27": "And, (O people of Mecca,) indeed We destroyed many a town around you, and displayed Our signs time and again so that they might turn (back to them from disbelief).",
                            "verse 46:28": "Then why did those (idols) not come to their aid, which they had taken as gods besides Allah for attaining (His) nearness? But in fact, they (false gods) were lost from them.",
                            "verse 46:29": "And, when, (O Beloved,) We diverted a group of jinn to you, listening to the Qur’an with active attention, (and) when they came there (i.",
                            "verse 46:30": "They said: ‘O our people (O community of jinn), indeed we have heard such a Book that has been revealed after (the Torah of) Musa (Moses.",
                            "verse 46:31": "and the straight road.",
                            "verse 46:32": "O our people! Accept the call of the Caller (the Holy Prophet Muhammad [blessings and peace be upon him]) to Allah and believe in him.",
                            "verse 46:33": "And he who does not accept the call of the Caller (the Holy Prophet Muhammad [blessings and peace be upon him]) to Allah cannot thwart Allah (by running away) on earth.",
                            "verse 46:34": "Do they not know that Allah, Who created the heavens and the earth and was not tired by creating them, has (also) the power to bring the dead back to life (again)? Yes, of course, He has power over everything.",
                            "verse 46:35": "And the Day when the disbelievers will be brought to the Fire (it will be said to them:) ‘Is this (punishment) not based on the truth?’ They will say: ‘Yes, of course! By our Lord (it is true).",
                            "verse 46:36": "(O Beloved!) So be steadfast as (other) Messengers were with unwavering determination, and do not hasten (to seek the torment) for these (deniers)."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Ylistetty, kunnian Jumala.",
                            "verse 46:2": "Pyhän Kirjan ilmoitus on saatu Jumalalta, mahtavalta, viisaalta.",
                            "verse 46:3": "Me olemme luonut taivaat ja maan ja mitä niiden välillä on vain totuudessa ja määrätyksi ajaksi, mutta ne, jotka ovat epäuskoisia, kääntyvät pois saamistaan varoituksista.",
                            "verse 46:4": "Sano: »Oletteko ajatelleet niitä, joita avuksenne huudatte Jumalan sijasta? Osoittakaa minulle, kuinka suuren osan ne ovat luoneet maasta! Tai onko heillä osuutta taivaisiin? Tuokaa minulle kirja, joka on ilmoitettu ennen tätä, tai rippeitä tiedosta, jos rakastatte totuutta!»",
                            "verse 46:5": "Kuka erehtyy enemmän kuin se, joka Jumalan asemesta kutsuu niitä, jotka eivät ennen ylösnousemuksen päivää vastaa hänelle eivätkä huoli hänen kutsustaan?",
                            "verse 46:6": "Ja kun ihmiset kootaan yhteen, tulee heistä näiden vihamiehiä ja he kieltävät näiden palvoneen heitä.",
                            "verse 46:7": "Ja vaikka tunnusmerkkimme selvästi luetaan heille, väittävät epäuskoiset totuudesta, kun se tulee heidän osakseen: »Tämä on selvää noituutta.",
                            "verse 46:8": "Tai he sanovat: »Hän on keksinyt sen».",
                            "verse 46:9": "Sano: »Minä en ole sananjulistajista ensimmäinen enkä tiedä, mitä tulee tapahtumaan minulle tai teille; minä noudatan vain sitä, mikä on ilmoitettu minulle, ja olen vain julkinen varoittaja.",
                            "verse 46:10": "Sano: »Oletteko ajatelleet, että se tulee Jumalalta ja että te ette usko siihen, mutta eräs todistaja Israelin lasten joukosta on todistanut sen oikeaksi; hän uskoi, mutta te olette ylpeitä.",
                            "verse 46:11": "Epäuskoiset sanovat uskovaisista: »Jos koraanissa olisi ollut jotakin hyvää, eivät he sen omaksumisessa olisi päässeet meistä edelle», ja koska he eivät tahdo antaa sen ohjata itseään oikeaan, he sanovat: »Se sisältää vain vanhoja valhetaruja.",
                            "verse 46:12": "Ennen sitä oli jo Mooseksen kirja oppaana ja armonosoituksena, ja tämä kirja vahvistaa sen arabian kielellä, varoitukseksi niille, jotka tekevät vääryyttä, ja hyvänä sanomana niille, joiden teot ovat hyviä.",
                            "verse 46:13": "Totisesti niillä, jotka sanovat: »Jumala on Herramme» ja pysyvät oikealla tiellä, ei ole pelkoa eikä heidän tarvitse murehtia.",
                            "verse 46:14": "Heistä tulee paratiisin asukkaita ikuisiksi ajoiksi palkaksi siitä, mitä he tekivät.",
                            "verse 46:15": "Me olemme myös käskenyt ihmisen tehdä hyvää vanhemmilleen; hänen äitinsä on kantanut hänet tuskalla ja synnyttänyt hänet kivulla, ja kantaminen ja vieroittaminen kestää kolmekymmentä kuukautta; ja kun hän saavuttaa kypsyysiän ja täyttää neljäkymmentä vuotta, hän sanoo: »Herra, suo minun olla kiitollinen siitä armosta, jota olet osoittanut minulle ja vanhemmilleni, suo että pystyisin hyviin tekoihin, jotka miellyttävät Sinua, ja salli kaiken koitua jälkeläisteni parhaaksi; totisesti, minä turvaan Sinuun ja kuulun Sinun alamaisiisi.",
                            "verse 46:16": "Näiltä vastaanotamme parhaan, mitä he ovat tehneet, ja annamme anteeksi heidän pahat tekonsa, koska he kuuluvat paratiisin asukkaisiin sen vanhurskaan lupauksen mukaan, mikä heille on annettu.",
                            "verse 46:17": "Mutta jos joku sanoo vanhemmilleen: »Häpeä teille! Kuinka lupaatte minulle, että minut herätetään henkiin, kun jo muut sukupolvet ovat kuolleet ennen minua?» niin että he kumpikin huutavat Jumalalta apua: »Voi sinua! Usko, Jumalan lupaus on totisesti varma» ja hän vastaa: »Nämä ovat vain muinaistaruja»,",
                            "verse 46:18": "niin juuri tällaiset ovat niitä, joiden suhteen on käynyt toteen ennustus dzinneistä ja ihmispolvista, jotka ovat kuolleet jo ennen heitä; totisesti ovat he tuhon omat.",
                            "verse 46:19": "Jokaista varten on olemassa eri asteita, aina sen mukaan, mitä he ovat tehneet, jotta minä saattaisin maksaa heille täyden palkan teoistaan, ilman että kukaan kärsisi vääryyttä.",
                            "verse 46:20": "Sinä päivänä, jolloin epäuskoiset saatetaan tulen eteen, kuuluu sana: »Te tuhlasitte kaiken hyvän maallisessa elämässänne, nauttien siitä lyhyen ajan, mutta tänään palkitaan teidät masentavalla kurituksella, sentähden että olitte ilman syytä ylpeitä maan päällä ja teitte syntiä.",
                            "verse 46:21": "Muistakaa Aadin veljeä, kun hän varoitti kansaansa hiekkakunnailla - ja varoittajia on totisesti ollut sekä ennen häntä että hänen jälkeensä - sanoen: »Älkää palvelko ketään muuta kuin Jumalaa! Totisesti pelkään puolestanne kauhun päivän rangaistusta.",
                            "verse 46:22": "He vastasivat: »Oletko tullut luoksemme kääntääksesi meidät pois jumalistamme? Näytä sitten meille se, millä meitä peloittelet, jos olet niitä, jotka pysyvät totuudessa.",
                            "verse 46:23": "Silloin hän sanoi: »Vain Jumalalla on tieto, ja minä julistan teille sanomaa, mikä on lähetetty mukanani, mutta huomaan, että olette ymmärtämätöntä kansaa.",
                            "verse 46:24": "Ja kun he näkivät pilven ilmestyvän taivaalle ja lähestyvän heidän laaksojaan, he sanoivat: »Se on pilvi, joka antaa meille sadetta.",
                            "verse 46:25": "ja joka hävittää kaiken Herran käskystä.",
                            "verse 46:26": "Tosiaan Me annoimme heille vallan, jota emme ole antanut teille, ja Me annoimme heille kuulon, näön ja sydämen, mutta heidän korvansa, silmänsä ja sydämensä eivät hyödyttäneet heitä vähääkään, koska he kielsivät Jumalan ilmoitukset, ja se, mitä he pilkkasivat, kohtasi heidät.",
                            "verse 46:27": "Olemme todella hävittänyt ympärillänne olevat kaupungit, ja Me uudistamme ilmoituksemme, jotta he kääntyisivät.",
                            "verse 46:28": "Mutta miksi eivät heitä sitten auttaneet ne, joita he pitivät Jumalan ohella jumalina ja välimiehinä? Ei, he ovat pettäneet heidät; tämä oli heidän valheensa ja väärennyksensä.",
                            "verse 46:29": "Ja kun Me ohjasimme osan dzinneistä sinun luoksesi kuulemaan Koraania, sanoivat he tultuaan paikalle: »Kuunnelkaa tarkasti!» ja kun se oli lopussa, palasivat he kansansa luo varoittamaan sitä.",
                            "verse 46:30": "He sanoivat: »Kansalaisemme, me olemme kuulleet Kirjaa, joka on ilmoitettu Mooseksen jälkeen ja joka vahvistaa sen, mitä oli ennen, johtaen totuuteen ja oikealle tielle.",
                            "verse 46:31": "Kansalaisemme, ottakaa vastaan jumalallinen kutsuja ja uskokaa Häneen, niin Hän antaa teille syntinne anteeksi ja suojelee teidät tuskallisesta rangaistuksesta.",
                            "verse 46:32": "Sillä ne, jotka eivät ota vastaan Jumalan lähettilästä, eivät löydä maan päältä pakopaikkaa eikä heillä hänen sijastaan ole ketään suojelijaa.",
                            "verse 46:33": "Eivätkö he ole ottaneet huomioon sitä, että Jumala, joka loi taivaat ja maan eikä väsynyt niitä luodessaan, voi antaa kuolleille elämän? Niin, Hän on totisesti kaikkivoipa.",
                            "verse 46:34": "Sinä päivänä, jolloin epäuskoiset viedään tulen eteen, kysytään: »Eikö kaikki ollut totta?» He vastaavat: »Kyllä, Herramme nimeen.",
                            "verse 46:35": "Kestäkää siis kärsivällisinä, niinkuin sananjulistajat kestivät, älkääkä kiirehtikö heidän tuomiotaan! Sinä päivänä, jolloin he näkevät, mitä heille on luvattu, heistä tuntuu siltä, kuin he eivät olisi odottaneet kauemmin kuin yhden tunnin päivästä."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 46:1": "Hâ.",
                            "verse 46:2": "La Révélation du Livre vient de Dieu, le Puissant, le Sage.",
                            "verse 46:3": "Nous n'avons créé les cieux, la terre et ce qui se trouve entre les deux, que par la Vérité et pour un laps de temps déterminé.",
                            "verse 46:4": "Dis : \" Considérez ceux que vous implorez en dehors de Dieu ; montrez-moi ce qu'ils ont créé sur la terre, ou s'ils ont été associés à la création des cieux ! Apportez-moi un livre plus ancien que celui-ci, ou quelque trace de science, si vous êtes véridiques \".",
                            "verse 46:5": "Qui donc est plus égaré que celui qui, au lieu de Dieu, implore ceux qui ne leur répondront pas jusqu'au jour de la Résurrection et qui resteront insensibles à leur appel,",
                            "verse 46:6": "ceux qui, lorsque les hommes auront été rassemblés, seront leurs ennemis et méconnaîtront leur adoration ?",
                            "verse 46:7": "Lorsqu'on leur récite Nos versets comme autant de preuves évidentes, ceux qui mécroient disent de la Vérité, au moment où elle leur parvient : \" Il s'agit bien là de magie ! \"",
                            "verse 46:8": "Ou ils disent : \" Il l'a forgée ! \" Dis : \" Si je l'ai forgée, alors vous ne pouvez rien pour moi contre Dieu.",
                            "verse 46:9": "Dis : \" Je ne suis pas un innovateur parmi les envoyés, et j'ignore ce que l'on fera de moi et de vous.",
                            "verse 46:10": "Dis : \" Pensez-y :",
                            "verse 46:11": "si ceci vient de Dieu et que vous refusez d'y croire, alors qu'un témoin parmi les fils d'Israël atteste qu'il existe déjà des messages semblables, et que lui-même y ajoute foi tandis que vous vous enflez d'orgueil ? \" Certes, Dieu ne dirige pas les iniques.",
                            "verse 46:12": "Ceux qui mécroient disent à ceux qui croient [à propos du Coran] : \" S'il s'agissait d'un bien, nous aurions été les premiers à le reconnaître.",
                            "verse 46:13": "Avant lui [le Coran], le Livre de Moïse était un exemple et une miséricorde.",
                            "verse 46:14": "Certes, ceux qui disent : \" Notre Seigneur est Dieu ! \" et se maintiennent dans la droiture, ceux-là n'éprouveront ni peur, ni affliction.",
                            "verse 46:15": "Ils seront les hôtes du Paradis où ils demeureront à jamais en récompense de leurs actions passées.",
                            "verse 46:16": "Nous avons recommandé à l'homme la bonté envers ses père et mère.",
                            "verse 46:17": "Ceux-là sont ceux dont Nous acceptons le meilleur de ce qu'ils ont fait sans tenir compte de leurs méfaits [pour les admettre] parmi les hôtes du Paradis.",
                            "verse 46:18": "Mais il y a celui qui dit à ses père et mère : \" Fi de vous deux ! Prétendez-vous que l'on me fera sortir [du tombeau], alors que tant de générations ont passé avant moi ? \" Tous deux implorent alors le secours de Dieu : \" Malheur à toi ! Crois, car la promesse de Dieu est vraie ! \" Et lui de répliquer : \" Ce ne sont là que fables des Anciens ! \".",
                            "verse 46:19": "C'est contre lui et ses pareils que la Parole s'est réalisée comme elle s'était réalisée contre des communautés de djinns et d'hommes disparues depuis lors.",
                            "verse 46:20": "Pour tous les êtres il existe des degrés correspondant à ce qu'ils ont accompli.",
                            "verse 46:21": "Le Jour où ceux qui ont mécru seront exposés au Feu, on leur dira : \" Vous avez dissipé durant votre vie terrestre les bonnes choses qui vous étaient données, et vous en avez joui.",
                            "verse 46:22": "Souviens-toi du frère des 'Ad, quand il avertit son peuple dans le pays d'al-Ahqâf (\"Les Dunes\"), alors que des avertisseurs étaient déjà passés avant lui et après lui : \" N'adorez que Dieu seul ! Je redoute pour vous le châtiment d'un jour terrible \".",
                            "verse 46:23": "Ils dirent : \" Es-tu venu à nous pour nous détourner de nos divinités ? Apporte-nous donc ce dont tu nous menaces, si tu es véridique ! \"",
                            "verse 46:24": "Il dit : \" Dieu seul possède la connaissance.",
                            "verse 46:25": "Quand ils virent que c'était un nuage qui se dirigeait vers leurs vallées, ils dirent : \" Voici un nuage qui nous apporte la pluie ! \" Que non ! Ce qui arrive, c'est ce dont vous vouliez hâter la venue : un vent qui renferme un châtiment douloureux,",
                            "verse 46:26": "qui va tout détruire sur l'ordre de son Seigneur.",
                            "verse 46:27": "Nous les avions pourtant établis [sur terre] dans une position plus solide que la vôtre, leur donnant l'ouïe, la vue et un cœur.",
                            "verse 46:28": "Nous avons anéanti les cités situées autour de vous alors que Nous avions déployé Nos signes pour que leurs habitants s'amendent.",
                            "verse 46:29": "Pourquoi donc ceux qu'ils avaient choisis en dehors de Dieu comme divinités et intercesseurs ne les ont-ils pas secourus ? Bien au contraire, ils leur ont faussé compagnie, juste conséquence de leur imposture et de ce qu'ils avaient inventé !",
                            "verse 46:30": "Un jour, Nous t'avons amené une troupe de djinns pour qu'ils écoutent le Coran ; une fois présents, ils dirent : \" Ecoutez en silence ! \", et quand ce fut terminé, ils retournèrent auprès de leur peuple en avertisseurs.",
                            "verse 46:31": "Ils dirent : \" O notre peuple ! Nous avons entendu un Livre révélé après Moïse, qui confirme les révélations antérieures ; il guide vers la Vérité et vers une voie droite.",
                            "verse 46:32": "O notre peuple ! Répondez à l'apôtre de Dieu et croyez en lui ! Dieu vous pardonnera une partie de vos péchés et Il vous préservera d'un châtiment douloureux \".",
                            "verse 46:33": "Celui qui ne répond pas à l'apôtre de Dieu ne saurait affaiblir la puissance de Dieu sur la terre.",
                            "verse 46:34": "Ne voient-ils pas que Dieu, qui a créé les cieux et la terre sans avoir été fatigué par leur création, a le pouvoir de rendre la vie aux morts.",
                            "verse 46:35": "Le Jour où les mécréants seront exposés au Feu, on leur demandera : \" N'est-ce pas là la Vérité ? \" \" Si fait, par notre Seigneur ! \" s'écrieront-ils.",
                            "verse 46:36": "Et toi, sois patient, comme ont été patients les envoyés qui étaient doués d'une ferme résolution, et ne cherche pas à hâter le châtiment de ces gens-là."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 46:1": "Ha, Mim .",
                            "verse 46:2": "La révélation du Livre émane de Dieu, Le Puissant, Le Sage.",
                            "verse 46:3": "Nous n’avons créé les cieux et la terre et ce qui est entre eux qu’en toute vérité et",
                            "verse 46:4": "un terme fixé.",
                            "verse 46:5": "Dis : «Que pensez-vous de ceux que vous invoquez en dehors de Dieu ? Montrez-moi donc ce qu’ils ont créé de la terre ! Ou ont-ils dans les cieux une participation avec Dieu ? Apportez-moi un Livre antérieur à celui-ci (le Coran) ou même un vestige d’une science, si vous êtes véridiques».",
                            "verse 46:6": "Et qui est plus égaré que celui qui invoque en dehors de Dieu, celui qui ne saura lui répondre jusqu’au Jour de la Résurrection ? Et elles [leurs divinités] sont indifférentes à leur invocation.",
                            "verse 46:7": "Et quand les gens seront rassemblés [pour le Jugement] elles seront leurs ennemies et nieront leur adoration [pour elles].",
                            "verse 46:8": "Et quand on leur récite Nos versets bien clairs, ceux qui ont mécru disent à propos de la vérité, une fois venue à eux : «C’est de la magie manifeste».",
                            "verse 46:9": "Ou bien ils disent : «Il l’a inventé ! » Dis : «Si je l’ai inventé, alors vous ne pourrez rien pour moi contre [la punition] de Dieu.",
                            "verse 46:10": "Dis : «Je ne suis pas une innovation parmi les messagers; et je ne sais pas ce que l’on fera de moi, ni de vous.",
                            "verse 46:11": "Dis : «Que direz-vous si [cette révélation s’avère] venir de Dieu et vous n’y croyez pas, qu’un témoin parmi les fils d’Israël en atteste la conformité [au Pentateuque] et y croit pendant que vous, vous le repoussez avec orgueil.",
                            "verse 46:12": "Et ceux qui ont mécru dirent à ceux qui ont cru : «Si ceci était un bien, ils (les pauvres) ne nous y auraient pas devancés».",
                            "verse 46:13": "Et avant lui, il y avait le Livre de Moïse, comme guide et comme miséricorde.",
                            "verse 46:14": "Ceux qui disent : «Notre Seigneur est Dieu» et qui ensuite se tiennent sur le droit chemin.",
                            "verse 46:15": "Ceux-là sont les gens du Paradis où ils demeureront éternellement, en récompense de ce qu’ils faisaient.",
                            "verse 46:16": "Et Nous avons enjoint à l’homme de la bonté envers ses père et mère : sa mère l’a péniblement porté et en a péniblement accouché; et sa gestation et sevrage durant trente mois; puis quand il atteint ses pleines forces et atteint quarante ans, il dit : «ô Seigneur ! Inspire-moi pour que je rende grâce au bienfait dont Tu m’as comblé ainsi qu’à mes père et mère, et pour que je fasse une bonne oeuvre que Tu agrées.",
                            "verse 46:17": "Ce sont ceux-là dont Nous acceptons le meilleur de ce qu’ils oeuvrent et passons sur leurs méfaits, (ils seront) parmi les gens du Paradis, selon la promesse véridique qui leur était faite.",
                            "verse 46:18": "Quant à celui qui dit à ses père et mère : «Fi de vous deux ! Me promettez-vous qu’on me fera sortir de terre alors que des générations avant moi ont passé ? » Et les deux, implorant le secours de Dieu, [lui dirent]: «Malheur à toi ! Crois.",
                            "verse 46:19": "Ce sont ceux-là qui ont mérité la sentence",
                            "verse 46:20": "en même temps que des communautés déjà passées avant eux parmi les djinns et les hommes.",
                            "verse 46:21": "Et il y a des rangs [de mérite] pour chacun, selon ce qu’ils ont fait, afin que Dieu leur attribue la pleine récompense de leurs oeuvres; et ils ne seront point lésés.",
                            "verse 46:22": "Et le jour où ceux qui mécru seront présentés au Feu (il leur sera dit) : «vous avez dissipé vos",
                            "verse 46:23": "excellents et vous en avez joui pleinement durant votre vie sur terre : on vous rétribue donc aujourd’hui du châtiment avilissant, pour l’orgueil dont vous vous enfliez injustement sur terre, et pour votre perversité.",
                            "verse 46:24": "Et rappelle-toi le frère des Aad (Hud) quand il avertit son peuple à Al-Ahqaf - alors qu’avant et après lui, des avertisseurs sont passés - [en disant]: «N’adorez que Dieu.",
                            "verse 46:25": "Ils dirent : «Es-tu venu à nous détourner de nos divinités ? Eh bien, apporte-nous ce que tu nous promets si tu es du nombre des véridiques».",
                            "verse 46:26": "Il dit : « La science n’est qu’auprès de Dieu.",
                            "verse 46:27": "Puis, voyant un nuage se dirigeant vers leurs vallées, ils dirent; «Voici un nuage qui nous apporte de la pluie».",
                            "verse 46:28": "détruisant tout, par le commandement de son Seigneur».",
                            "verse 46:29": "En effet, Nous les avions consolidés dans des positions que Nous ne vous avons pas données.",
                            "verse 46:30": "Nous avons assurément fait périr les cités autour de vous; et Nous avons diversifié les signes afin qu’ils reviennent (de leur mécréance).",
                            "verse 46:31": "Pourquoi donc ne les secourent pas, ceux qu’ils avaient pris, en dehors de Dieu, comme divinités pour",
                            "verse 46:32": "les rapprocher de Lui ? Ceux-ci, au contraire, les abandonnèrent; telle est leur imposture et voilà ce qu’ils inventaient comme mensonges.",
                            "verse 46:33": "(Rappelle-toi) lorsque Nous dirigeâmes vers toi une troupe de djinns pour qu’ils écoutent le Coran.",
                            "verse 46:34": "Ils dirent : «ô notre peuple ! Nous venons d’entendre un Livre qui a été descendu après Moïse, confirmant ce qui l’a précédé.",
                            "verse 46:35": "ô notre peuple ! Répondez au prédicateur de Dieu et croyez en lui.",
                            "verse 46:36": "vous pardonnera une partie de vos péchés et vous protégera contre un châtiment douloureux.",
                            "verse 46:37": "Et quiconque ne répond pas au prédicateur de Dieu ne saura échapper au pouvoir [de Dieu] sur terre.",
                            "verse 46:38": "Ne voient-ils pas que Dieu qui a créé les cieux et la terre, et qui n’a pas été fatigué par leur création, est capable en vérité de redonner la vie aux morts ? Mais si.",
                            "verse 46:39": "Et le jour où seront présenté au Feu ceux qui ont mécru (on leur dira) : «Ceci n’est-il pas la vérité ? » Ils diront : «Mais si, par notre Seigneur».",
                            "verse 46:40": "Endure (Muhammad) donc, comme ont enduré les messager doués de fermeté; et ne te montre pas trop pressé de les voir subir [leur châtiment]."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Há Mím.",
                            "verse 46:2": "Die Offenbarung des Buches ist von Allah, dem Allmächtigen, dem Allweisen.",
                            "verse 46:3": "Wir haben die Himmel und die Erde und das, was zwischen beiden ist, nicht anders erschaffen als in Weisheit und auf eine bestimmte Zeit; die aber nicht daran glauben, wovor sie gewarnt wurden, sie wenden sich ab.",
                            "verse 46:4": "Sprich: «Wißt ihr, was das ist, was ihr anruft statt Allah? Zeigt mir, was sie von der Erde erschaffen haben.",
                            "verse 46:5": "Und wer ist irrender als jene, die statt zu Allah zu solchen beten, die sie nicht erhören werden bis zum Tage der Auferstehung und die ihres Gebets nicht achten?",
                            "verse 46:6": "Und wenn die Menschen versammelt werden, werden sie ihre Feinde sein und ihre Anbetung verleugnen.",
                            "verse 46:7": "Und wenn ihnen Unsere deutlichen Zeichen vorgetragen werden, sagen die Ungläubigen von der Wahrheit, wenn sie zu ihnen kommt: «Das ist offenkundige Zauberei.",
                            "verse 46:8": "Sagen sie: «Er hat es erdichtet»? Sprich: «Wenn ich es erdichtet habe, ihr könnt mir nichts nützen wider Allah.",
                            "verse 46:9": "Sprich: «Ich bin keine neue Erscheinung unter den Gesandten, und ich weiß nicht, was mit mir oder mit euch geschehen wird.",
                            "verse 46:10": "Sprich: «Saget mir, wenn dies von Allah ist, und ihr lehnt es ab, und ein Zeuge von den Kindern Israels hat Zeugnis abgelegt von jemandem wie er.",
                            "verse 46:11": "Und die Ungläubigen sagen von den Gläubigen: «Wäre er (der Koran) etwas Gutes, sie hätten ihn nicht vor uns erlangt.",
                            "verse 46:12": "Und vor ihm war schon das Buch Moses', Führung und Barmherzigkeit; und dies hier ist ein Buch der Bestätigung in arabischer Sprache, die zu warnen, die freveln, und eine frohe Botschaft denen, die Gutes tun -",
                            "verse 46:13": "Die da sprechen: «Unser Herr ist Allah», und danach fest bleiben - keine Furcht soll über sie kommen, noch sollen sie trauern.",
                            "verse 46:14": "Sie sind des Gartens Bewohner; darin sollen sie weilen auf immer: eine Belohnung für das, was sie zu tun pflegten.",
                            "verse 46:15": "Wir haben dem Menschen Güte gegen seine Eltern zur Pflicht gemacht.",
                            "verse 46:16": "Das sind die, von denen Wir die guten Werke annehmen, die sie getan, und deren üble Werke Wir übersehen - unter den Bewohnern des Gartens, in Erfüllung der wahrhaftigen Verheißung, die ihnen verheißen ward.",
                            "verse 46:17": "Der aber zu seinen Eltern spricht: «Pfui über euch! Verkündet ihr mir, daß ich auferstehen soll, obwohl Geschlechter schon vor mir dahingegangen sind?» Und sie rufen beide zu Allah um Hilfe (und sprechen): «Wehe dir, glaube! denn die Verheißung Allahs ist wahr.",
                            "verse 46:18": "So sind die, gegen welche der Spruch (der Strafe) fällig ward, zusammen mit den Scharen der Dschinn und der Menschen, die vor ihnen hingingen.",
                            "verse 46:19": "Und für alle sind Stufen gemäß dem, was sie tun, auf daß Er ihnen ihre Taten voll vergelte; und kein Unrecht soll ihnen widerfahren.",
                            "verse 46:20": "Und an dem Tage, wenn die Ungläubigen dem Feuer ausgesetzt werden: «Ihr habt eure guten Dinge im Leben hienieden aufgezehrt, und ihr hattet Genuß daran.",
                            "verse 46:21": "Und gedenke des Bruders der Àd, da er sein Volk warnte bei den windgewellten Sandhügeln - und Warner sind schon vor ihm gewesen und nach ihm - (und sprach): «Dienet Allah allein, denn ich fürchte für euch die Strafe am Großen Tag.",
                            "verse 46:22": "Sie sprachen: «Bist du zu uns gekommen, um uns von unseren Göttern abwendig zu machen? So bring über uns, was du uns androhst, wenn du der Wahrhaftigen einer bist.",
                            "verse 46:23": "Er sprach: «Das Wissen (darüber) ist einzig bei Allah.",
                            "verse 46:24": "Dann aber, als sie sahen, wie es sich ihren Tälern näherte gleich einer Wolke, sprachen sie: «Das ist eine Wolke, die uns Regen geben wird.",
                            "verse 46:25": "Er wird alles zerstören nach dem Befehl seines Herrn.",
                            "verse 46:26": "Wir hatten ihnen Gewalt gegeben über das, worüber Wir euch keine gegeben haben; und Wir hatten ihnen Ohren und Augen und Herzen gegeben.",
                            "verse 46:27": "Wir haben bereits Städte rings um euch zerstört; und Wir haben die Zeichen von allen Seiten gezeigt, damit sie sich bekehren.",
                            "verse 46:28": "Warum haben ihnen denn die nicht geholfen, die sie sich zu Göttern genommen hatten statt Allah (und die sie Ihm) nahe bringen sollten? Nein, sie entglitten ihnen.",
                            "verse 46:29": "Und (gedenke der Zeit) da Wir eine Schar Dschinn dir zuwandten, die den Koran zu vernehmen wünschten; und als sie in seiner Gegenwart waren, sprachen sie: «Schweiget (und höret zu)», und als er zu Ende war, kehrten sie warnend zurück zu ihrem Volk.",
                            "verse 46:30": "Sie sprachen: «O unser Volk, wir haben ein Buch gehört, das nach Moses herabgesandt ward, das bestätigend, was schon vor ihm da ist; es leitet zur Wahrheit und zu dem geraden Weg.",
                            "verse 46:31": "O unser Volk, höret auf Allahs Rufer und glaubet an Ihn.",
                            "verse 46:32": "Und wer nicht auf Allahs Rufer hört, der kann nicht auf Erden entrinnen, noch kann er Beschützer haben außer Ihm.",
                            "verse 46:33": "Haben sie nicht gesehen, daß Allah, Der die Himmel und die Erde erschuf und nicht müde ward durch ihre Erschaffung, auch vermag, die Toten lebendig zu machen? Ja, wahrlich, Er vermag alle Dinge zu tun.",
                            "verse 46:34": "Und an dem Tage, wenn die Ungläubigen dem Feuer ausgesetzt werden: «Ist dies nicht die Wahrheit?» Sie werden sprechen: «Ja, bei unserem Herrn.",
                            "verse 46:35": "Gedulde dich denn, wie es die Gesandten taten, die standhaft waren und hochgesinnt; und sei nicht in Hast ihretwegen."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "gk ehe",
                            "verse 46:2": ";s fdrkc x+kfyc ¼o½ gdhe [+kqnk dh rjQ ls ukft+y gq;h gS",
                            "verse 46:3": "geus rks lkjs vkleku o t+ehu vkSj tks dqN bu nksuksa ds njfe;ku gS fgder gh ls ,d [+kkl oD+r rd ds fy, gh iSnk fd;k gS vkSj dq¶+Q+kj ftu pht+ksa ls Mjk, tkrs gSa mu ls eq¡g Qsj ysrs gSa",
                            "verse 46:4": "¼,s jlwy½ rqe iwNks fd [+kqnk dks NksM+ dj ftudh rqe bcknr djrs gks D;k rqeus mudks ns[kk gS eq>s Hkh rks fn[kkvks fd mu yksxksa us t+ehu esa D;k pht+s iSnk dh gSa ;k vklekuksa ¼ds cukus½ esa mudh f’kjdr gS rks vxj rqe lPps gks rks mlls igys dh dksbZ fdrkc ¼;k vxyksa ds½ bYe dk cfd+;k gks rks esjs lkeus is’k djks",
                            "verse 46:5": "vkSj ml Ó[+l ls c<+ dj dkSu xqejkg gks ldrk gS tks [+kqnk ds flok ,sls Ó[+l dks iqdkjs tks mls d+;ker rd tokc gh u ns vkSj mudks muds iqdkjus dh [+kcjsa rd u gksa",
                            "verse 46:6": "vkSj tc yksx ¼d+;ker½ esa tek fd;s tk,xsa rks og ¼ekcwn½ muds nq’keu gks tk,axs vkSj mudh ijLkfr’k ls bUdkj djsaxs",
                            "verse 46:7": "vkSj tc gekjh [kqyh [kqyh vk;rsa muds lkeus i<+h tkrh gSa rks tks yksx dkfQj gSa gd+ ds ckjs esa tc muds ikl vk pqdk rks dgrs gSa ;s rks ljhgh tknw gS",
                            "verse 46:8": "D;k ;s dgrs gSa fd blus bldks [k+qn x<+ fy;k gS rks ¼,s jlwy½ rqe dg nks fd vxj eSa bldks ¼vius th ls½ x<+ ysrk rks rqe [+kqnk ds lkeus esjs dqqN Hkh dke u vkvksxs tks tks ckrsa rqe yksx mlds ckjs esa djrs jgrs gks og [+kwc tkurk gS esjs vkSj rqEgkjs njfe;ku ogh xokgh dks dkQ+h gS vkSj ogh cM+k c[+’kus okyk gS esgjcku gS",
                            "verse 46:9": "¼,s jlwy½ rqe dg nks fd eSa dksbZ u;k jlwy rks vk;k ugha gw¡ vkSj eSa dqN ugha tkurk fd vkbUnk esjs lkFk D;k fd;k tk,xk vkSj u ¼;s fd½ rqEgkjs lkFk D;k fd;k tk,xk eSa rks cl mlh dk ikcUn gw¡ tks esjs ikl ogh vk;h gS vkSj eSa rks cl ,ykfu;k Mjkus okyk gw¡",
                            "verse 46:10": "¼,s jlwy½ rqe dg nks fd Hkyk ns[kks rks fd vxj ;s ¼d++qjku½ [+kqnk dh rjQ ls gks vkSj rqe mlls bUdkj dj cSBs gkykWfd ¼cuh bljkbZy esa ls½ ,d xokg mlds fely dh xokgh Hkh ns pqdk vkSj bZeku Hkh ys vk;k vkSj rqeus ljd’kh dh ¼rks rqEgkjs t+kfye gksus esa D;k Ód gS½ cs’kd [+kqnk t+kfye yksxksa dks efUt+y ed+lwn rd ugha igq¡pkrk",
                            "verse 46:11": "vkSj dkfQj yksx eksfeuksa ds ckjs esa dgrs gSa fd vxj ;s ¼nhu½ csgrj gksrk rks ;s yksx mldh rjQ gels igys u nkSM+ iM+rs vkSj tc d+qjku ds t+fj, ls mudh fgnk;r u gq;h rks vc Hkh dgsaxs ;s rks ,d d+nheh >wB gS",
                            "verse 46:12": "vkSj blds d+Cy ewlk dh fdrkc is’kok vkSj ¼ljklj½ jger Fkh vkSj ;s ¼d+qjku½ og fdrkc gS tks vjch t+cku esa ¼mldh½ rlnhd+ djrh gS rkfd ¼blds t+fj, ls½ t+kfyeksa dks Mjk, vkSj usdh dkjksa ds fy, ¼vt+ljrkik½ [+kq’k[+kcjh gS",
                            "verse 46:13": "cs’kd ftu yksxksa us dgk fd gekjk ijojfnxkj [+kqnk gS fQj og bl ij d+k;e jgs rks ¼d+;ker esa½ mudks u dqN [+kkSQ+ gksxk vkSj u og x+ex+hu gksaxs",
                            "verse 46:14": ";gh rks vgys tUur gSa fd ges’kk mlesa jgsaxs ¼;s½ mldk flyk gS tks ;s yksx ¼nqfu;k esa½ fd;k djrs Fks",
                            "verse 46:15": "vkSj geus bUlku dks vius ek¡ cki ds lkFk HkykbZ djus dk gqDe fn;k ¼D;ksa fd½ mldh ek¡ us jat gh dh gkyr esa mldks isV esa j[kk vkSj jat gh ls mldks tuk vkSj mldk isV esa jguk vkSj mldks nw/k c<+kbZ ds rhl eghus gq, ;gk¡ rd fd tc viuh iwjh tokuh dks igq¡prk vkSj pkyhl cjl ¼ds flu½ dks igq¡prk gS rks ¼[+kqnk ls½ vt+Z djrk gS ijojfnxkj rks eq>s rkSQ+hd+ vrk Qjek fd rwus tks ,glkukr eq> ij vkSj esjs okynSu ij fd;s gSa eSa mu ,glkuksa dk ÓqfØ;k vnk d:¡ vkSj ;s ¼Hkh rkSQhd ns½ fd eSa ,slk usd dke d:¡ ftls rw ilUn djs vkSj esjs fy, esjh vkSykn esa lqykg o rd+ok iSnk djs rsjh rjQ :tw djrk gw¡ vkSj eSa ;d+huu Qjekcjnkjks esa gw¡",
                            "verse 46:16": ";gh og yksx gSa ftuds usd vey ge d+qcwy Qjek,¡xs vkSj csfg’r ¼ds tkus½ okyksa esa muds xqukgksa ls njx+qt+j djsaxs ¼;s og½ lPpk ok;nk gS tks mu ls fd;k tkrk Fkk",
                            "verse 46:17": "vkSj ftlus vius ek¡ cki ls dgk fd rqEgkjk cqjk gks] D;k rqe eq>s /kedh nsrs gks fd eSa nksckjk ¼dcz ls½ fudkyk tkÅ¡xk gkykWfd cgqr ls yksx eq>ls igys xqt+j pqds ¼vkSj dksbZ ft+Unk u gqvk½ vkSj nksuksa Q+fj;kn dj jgs Fks fd rq> ij ok, gks bZeku ys vk [+kqnk dk ok;nk t+:j lPpk gS rks og cksy mBk fd ;s rks cl vxys yksxksa ds vQ+lkus gSa",
                            "verse 46:18": ";s ogh yksx gSa fd ftUukr vkSj vknfe;ksa dh ¼nwljh½ mEersa tks muls igys xqt+j pqdh gSa mu gh ds Óqewy esa mu ij Hkh vt+kc dk ok;nk eqLrgd+ gks pqdk gS ;s yksx cs’kd ?kkVk mBkus okys Fks",
                            "verse 46:19": "vkSj yksxksa us tSls dke fd;s gksaxs mlh ds eqrkfcd lcds ntsZ gksaxs vkSj ;s blfy, fd [+kqnk muds vkeky dk mudks iwjk iwjk cnyk ns vkSj mu ij dqN Hkh t+qYe u fd;k tk,a",
                            "verse 46:20": "vkSj ftl fnu dq¶Qkj tgUuqe ds lkeus yk,¡ tk,¡xs ¼rks muls dgk tk,xk fd½ rqeus viuh nqfu;k dh ft+Unxh esa vius et+s mM+k pqds vkSj mlesa [+kwc pSu dj pqds rks vkt rqe ij ft+Yyr dk vt+kc fd;k tk,xk blfy, fd rqe viuh t+ehu esa vdM+k djrs Fks vkSj blfy, fd rqe cndkfj;ka djrs Fks",
                            "verse 46:21": "vkSj ¼,s jlwy½ rqe vkn dks HkkbZ ¼gwn½ dks ;kn djks tc mUgksaus viuh d+kSe dks ¼ljt+ehu½ vgd+kQ esa Mjk;k vkSj muds igys vkSj muds ckn Hkh cgqr ls Mjkus okys iSx+Ecj xqt+j pqds Fks ¼vkSj gwn us viuh d+kSe ls dgk½ fd [+kqnk ds flok fdlh dh bcknr u djks D;ksafd rqEgkjs ckjs esa ,d cM+s l[+r fnu ds vt+kc ls Mjrk gw¡",
                            "verse 46:22": "og cksys D;k rqe gekjs ikl blfy, vk, gks fd gedks gekjs ekcwnksa ls Qsj nks rks vxj rqe lPps gks rks ftl vt+kc dh rqe gesa /kedh nsrs gks ys vkvks",
                            "verse 46:23": "gwn us dgk ¼bldk½ bYe rks cl [+kqnk ds ikl gS vkSj ¼eSa tks ,gdke nsdj Hkstk x;k gw¡½ og rqEgsa igq¡pk, nsrk gw¡ exj eSa rqedks ns[krk gw¡ fd rqe tkfgy yksx gks",
                            "verse 46:24": "rks tc mu yksxksa us bl ¼vt+kc½ dks ns[kk fd ocky dh rjg muds eSnkuksa dh rjQ mEM+k vk jgk gS rks dgus yxs ;s rks ckny gS tks ge ij cjl dj jgsxk ¼ugha½ cfYd ;s og ¼vt+kc½ ftldh rqe tYnh epk jgs Fks ¼;s½ og vk¡/kh gS ftlesa nnZukd ¼vt+kc½ gS",
                            "verse 46:25": "tks vius ijojfnxkj ds gqDe ls gj pht+ dks rckg o cjckn dj nsxh rks og ,sls ¼rckg½ gq, fd muds ?kjksa ds flok dqN ut+j gh ugha vkrk Fkk ge xqukgxkjksa dh ;w¡ gh lt+k fd;k djrss gSa",
                            "verse 46:26": "vkSj geus mudks ,sls dkeksa esa ed+nwj fn;s Fks ftuesa rqEgsa ¼dqN Hkh½ ed+nwj ugha fn;k vkSj mUgsa dku vkSj vk¡[k vkSj fny ¼lc dqN fn, Fks½ rks pw¡fd og yksx [+kqnk dh vk;rksa ls bUdkj djus yxs rks u muds dku gh dqN dke vk, vkSj u mudh vk¡[ksa vkSj u muds fny vkSj ftl ¼vt+kc½ dh ;s yksx g¡lh mM+k;k djrs Fks mlus mudks gj rjQ ls ?ksj fy;k",
                            "verse 46:27": "vkSj ¼,s vgys eDdk½ geus rqEgkjs bnZ fxnZ dh cfLr;ksa dks gykd dj ekjk vkSj ¼viuh d+qnjr dh½ cgqr lh fu’kkfu;k¡ rjg rjg ls fn[kk nh rkfd ;s yksx ckt+ vk,¡ ¼exj dkSu lqurk gS½",
                            "verse 46:28": "rks [+kqnk ds flok ftu dks mu yksxksa us rd+jqZc ¼[+kqnk½ ds fy, ekcwn cuk j[kk Fkk mUgksaus ¼vt+kc ds oD+r½ mudh D;ksa u enn dh cfYd og rks muls x+k;c gks x;s vkSj muds >wB vkSj mudh ¼bQ+rsjk½ ijnkft+;ksa dh ;s gd+hd+r Fkh",
                            "verse 46:29": "vkSj tc geus ftuksa esa ls dbZ Ó[+lksa dks rqEgkjh rjQ eqrkoTts fd;k fd og fny yxkdj d++qjku lqusa rks tc muds ikl gkft+j gq, rks ,d nqljs ls dgus yxs [+kkeks’k cSBs ¼lqurs½ jgks fQj tc ¼i<+uk½ reke gqvk rks viuh d+kSe dh rjQ+ okil x,",
                            "verse 46:30": "fd ¼mudks vt+kc ls½ Mjk,a rks mu ls dguk Óq: fd;k fd ,s Hkkb;ksa ge ,d fdrkc lqu vk, gSa tks ewlk ds ckn ukft+y gq;h gS ¼vkSj½ tks fdrkcsa] igys ¼ukft+y gq;ha½ gSa mudh rlnhd+ djrh gSa lPps ¼nhu½ vkSj lh/kh jkg dh fgnk;r djrh gSa",
                            "verse 46:31": ",s gekjh d+kSe [+kqnk dh rjQ cqykus okys dh ckr ekuksa vkSj [+kqnk ij bZeku ykvks og rqEgkjs xqukg c[+’k nsxk vkSj ¼d+;ker½ esa rqEgsa nnZukd vt+kc ls iukg esa j[ksxk",
                            "verse 46:32": "vkSj ftlus [+kqnk dh rjQ cqykus okys dh ckr u ekuh rks ¼;kn jgs fd½ og ¼[+kqnk dks :,½ t+ehu esa vkftt+ ugha dj ldrk vkSj u ml ds flok dksbZ ljijLr gksxk ;gh yksx xqejkgh esa gSa",
                            "verse 46:33": "D;k bu yksxksa us ;s x+kSj ugha fd;k fd ftl [+kqnk us lkjs vkleku vkSj t+ehu dks iSnk fd;k vkSj muds iSnk djus ls t+jk Hkh Fkdk ugha og bl ckr ij d+kfnj gS fd eqnksZ dks ft+Unk djsxk gk¡ ¼t+:j½ og gj pht+ ij d+kfnj gS",
                            "verse 46:34": "ftl fnu dq¶+Q+kj ¼tgUuqe dh½ vkx ds lkeus is’k fd, tk,¡xs ¼rks mu ls iwNk tk,xk½ D;k vc Hkh ;s cjgd+ ugha gS og yksx dgsaxs vius ijojfnxkj dh d+le gk¡ ¼gd+ gS½ [+kqnk Q+jek,xk rks yks vc vius bUdkj o dqÝ ds cnys vt+kc ds et+s p[kks",
                            "verse 46:35": "rks ¼,s jlwy½ iSx+Ecjksa esa ls ftl rjg vOoyqy vT+e ¼vkyh fgEer½] lcz djrs jgs rqe Hkh lcz djks vkSj muds fy, ¼vt+kc½ dh rkt+hy dh [+okfg’k u djks ftl fnu ;g yksx ml d;ker dks ns[ksaxs ftldks muls ok;nk fd;k tkrk gS rks ¼mudks ekywe gksxk fd½ xks;k ;s yksx ¼nqfu;k esa½ cgqr jgs gksxsa rks lkjs fnu esa ls ,d ?kM+h Hkj rks cl ogh yksx gykd gksaxs tks cndkj Fks"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Haa Miim.",
                            "verse 46:2": "Diturunkan Kitab ini dari Allah Yang Maha Perkasa lagi Maha Bijaksana.",
                            "verse 46:3": "Kami tiada menciptakan langit dan bumi dan apa yang ada antara keduanya melainkan dengan (tujuan) yang benar dan dalam waktu yang ditentukan.",
                            "verse 46:4": "Katakanlah: \"Terangkanlah kepadaku tentang apa yang kamu sembah selain Allah; perlihatkan kepada-Ku apakah yang telah mereka ciptakan dari bumi ini atau adakah mereka berserikat (dengan Allah) dalam (penciptaan) langit? Bawalah kepada-Ku Kitab yang sebelum (Al Qur’an) ini atau peninggalan dari pengetahuan (orang-orang dahulu), jika kamu adalah orang-orang yang benar\".",
                            "verse 46:5": "Dan siapakah yang lebih sesat daripada orang yang menyembah sembahan-sembahan selain Allah yang tiada dapat memperkenankan (do’a)nya sampai hari kiamat dan mereka lalai dari (memperhatikan) do’a mereka?",
                            "verse 46:6": "Dan apabila manusia dikumpulkan (pada hari kiamat) niscaya sembahan-sembahan itu menjadi musuh mereka dan mengingkari pemujaan-pemujaan mereka.",
                            "verse 46:7": "Dan apabila dibacakan kepada mereka ayat-ayat Kami yang menjelaskan, berkatalah orang-orang yang mengingkari kebenaran ketika kebenaran itu datang kepada mereka: \"Ini adalah sihir yang nyata\".",
                            "verse 46:8": "Bahkan mereka mengatakan: \"Dia (Muhammad) telah mengada-adakannya (Al Qur’an)\", Katakanlah: \"Jika aku mengada-adakannya, maka kamu tiada mempunyai kuasa sedikitpun mempertahankan aku dari (azab) Allah itu.",
                            "verse 46:9": "Katakanlah: \"Aku bukanlah rasul yang pertama di antara rasul-rasul dan aku tidak mengetahui apa yang akan diperbuat terhadapku dan tidak (pula) terhadapmu.",
                            "verse 46:10": "Katakanlah: \"Terangkanlah kepadaku, bagaimanakah pendapatmu jika Al Qur’an itu datang dari sisi Allah, padahal kamu mengingkarinya dan seorang saksi dari Bani Israil mengakui (kebenaran) yang serupa dengan (yang disebut dalam) Al Qur’an lalu dia beriman (1), sedang kamu menyombongkan diri.",
                            "verse 46:11": "Dan orang-orang kafir berkata kepada orang-orang yang beriman: \"Kalau sekiranya dia (Al Qur’an) adalah suatu yang baik, tentulah mereka tiada mendahului kami (beriman) kepadanya.",
                            "verse 46:12": "Dan sebelum Al Qur’an itu telah ada kitab Musa sebagai petunjuk dan rahmat.",
                            "verse 46:13": "Sesungguhnya orang-orang yang mengatakan: \"Tuhan kami ialah Allah\", kemudian mereka tetap istiqamah maka tidak ada kekhawatiran terhadap mereka dan mereka tiada (pula) berduka cita.",
                            "verse 46:14": "Mereka itulah penghuni-penghuni surga, mereka kekal di dalamnya; sebagai balasan atas apa yang telah mereka kerjakan.",
                            "verse 46:15": "Kami perintahkan kepada manusia supaya berbuat baik kepada dua orang ibu bapaknya, ibunya mengandungnya dengan susah payah, dan melahirkannya dengan susah payah (pula).",
                            "verse 46:16": "Mereka itulah orang-orang yang Kami terima dari mereka amal yang baik yang telah mereka kerjakan dan Kami ampuni kesalahan-kesalahan mereka, bersama penghuni-penghuni surga, sebagai janji yang benar yang telah dijanjikan kepada mereka.",
                            "verse 46:17": "Dan orang yang berkata kepada dua orang ibu bapaknya: \"Cis bagi kamu keduanya, apakah kamu keduanya memperingatkan kepadaku bahwa aku akan dibangkitkan, padahal sungguh telah berlalu beberapa umat sebelumku?\" lalu kedua ibu bapaknya itu memohon pertolongan kepada Allah seraya mengatakan, \"Celaka kamu, berimanlah! Sesungguhnya janji Allah adalah benar\".",
                            "verse 46:18": "Mereka itulah orang-orang yang telah pasti ketetapan (azab) atas mereka bersama umat-umat yang telah berlalu sebelum mereka dari jin dan manusia.",
                            "verse 46:19": "Dan bagi masing-masing mereka derajat menurut apa yang telah mereka kerjakan dan agar Allah mencukupkan bagi mereka (balasan) pekerjaan-pekerjaan mereka sedang mereka tiada dirugikan.",
                            "verse 46:20": "Dan (ingatlah) hari (ketika) orang-orang kafir dihadapkan ke neraka (kepada mereka dikatakan): \"Kamu telah menghabiskan rezkimu yang baik dalam kehidupan duniawimu (saja) dan kamu telah bersenang-senang dengannya; maka pada hari ini kamu dibalasi dengan azab yang menghinakan karena kamu telah menyombongkan diri di muka bumi tanpa hak dan karena kamu telah fasik\".",
                            "verse 46:21": "Dan ingatlah (Hud) saudara kaum ’Aad yaitu ketika dia memberi peringatan kepada kaumnya di Al Ahqaaf dan sesungguhnya telah terdahulu beberapa orang pemberi peringatan sebelumnya dan sesudahnya (dengan mengatakan): \"Janganlah kamu menyembah selain Allah, sesungguhnya aku khawatir kamu akan ditimpa azab hari yang besar\".",
                            "verse 46:22": "Mereka menjawab: \"Apakah kamu datang kepada kami untuk memalingkan kami dari (menyembah) tuhan-tuhan kami? Maka datangkanlah kepada kami azab yang telah kamu ancamkan kepada kami jika kamu termasuk orang-orang yang benar\".",
                            "verse 46:23": "Ia berkata: \"Sesungguhnya pengetahuan (tentang itu) hanya pada sisi Allah dan aku (hanya) menyampaikan kepadamu apa yang aku diutus dengan membawanya tetapi aku lihat kamu adalah kaum yang bodoh\".",
                            "verse 46:24": "Maka tatkala mereka melihat azab itu berupa awan yang menuju ke lembah-lembah mereka, berkatalah mereka: \"Inilah awan yang akan menurunkan hujan kepada kami\".",
                            "verse 46:25": "yang menghancurkan segala sesuatu dengan perintah Tuhannya, maka jadilah mereka tidak ada yang kelihatan lagi kecuali (bekas-bekas) tempat tinggal mereka.",
                            "verse 46:26": "Dan sesungguhnya Kami telah meneguhkan kedudukan mereka dalam hal-hal yang Kami belum pernah meneguhkan kedudukanmu dalam hal itu dan Kami telah memberikan kepada mereka pendengaran, penglihatan dan hati; tetapi pendengaran, penglihatan dan hati mereka itu tidak berguna sedikit juapun bagi mereka, karena mereka selalu mengingkari ayat-ayat Allah dan mereka telah diliputi oleh siksa yang dahulu selalu mereka memperolok-olokkannya.",
                            "verse 46:27": "Dan sesungguhnya Kami telah membinasakan negeri-negeri di sekitarmu dan Kami telah mendatangkan tanda-tanda kebesaran Kami berulang-ulang supaya mereka kembali (bertaubat).",
                            "verse 46:28": "Maka mengapa yang mereka sembah selain Allah sebagai Tuhan untuk mendekatkan diri (kepada Allah) tidak dapat menolong mereka.",
                            "verse 46:29": "Dan (ingatlah) ketika Kami hadapkan serombongan jin kepadamu yang mendengarkan Al Qur’an, maka tatkala mereka menghadiri pembacaan (nya) lalu mereka berkata: \"Diamlah kamu (untuk mendengarkannya)\".",
                            "verse 46:30": "Mereka berkata: \"Hai kaum kami, sesungguhnya kami telah mendengarkan kitab (Al Qur’an) yang telah diturunkan sesudah Musa yang membenarkan kitab-kitab yang sebelumnya lagi memimpin kepada kebenaran dan kepada jalan yang lurus.",
                            "verse 46:31": "Hai kaum kami, terimalah (seruan) orang yang menyeru kepada Allah dan berimanlah kepada-Nya, niscaya Allah akan mengampuni dosa-dosa kamu dan melepaskan kamu dari azab yang pedih.",
                            "verse 46:32": "Dan orang yang tidak menerima (seruan) orang yang menyeru kepada Allah maka dia tidak akan melepaskan diri dari azab Allah di muka bumi dan tidak ada baginya pelindung selain Allah.",
                            "verse 46:33": "Dan apakah mereka tidak memperhatikan bahwa sesungguhnya Allah yang menciptakan langit dan bumi dan Dia tidak merasa payah karena menciptakannya, kuasa menghidupkan orang-orang mati? Ya (bahkan) sesungguhnya Dia Maha Kuasa atas segala sesuatu.",
                            "verse 46:34": "Dan (Ingatlah) hari (ketika) orang-orang kafir dihadapkan kepada neraka, (dikatakan kepada mereka): \"Bukankah (azab) ini benar?\" Mereka menjawab: \"Ya benar, demi Tuhan kami\".",
                            "verse 46:35": "Maka bersabarlah kamu seperti orang-orang yang mempunyai keteguhan hati dari rasul-rasul telah bersabar dan janganlah kamu meminta disegerakan (azab) bagi mereka."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Hâ', Mîm .",
                            "verse 46:2": "La rivelazione del Libro proviene da Allah, l'Eccelso, il Saggio.",
                            "verse 46:3": "Non creammo i cieli e la terra e quel che vi è frammezzo se non con verità e fino ad un termine stabilito, ma i miscredenti non badano a ciò di cui sono stati avvertiti.",
                            "verse 46:4": "Di': « Guardate coloro che invocate all'infuori di Allah? Mostratemi quel che hanno creato della terra.",
                            "verse 46:5": "E chi è più sviato di colui che invoca, all'infuori di Allah, chi non saprà rispondergli fino al Giorno della Resurrezione? Essi non hanno neppure coscienza dell'invocazione che viene loro rivolta,",
                            "verse 46:6": "e quando gli uomini saranno riuniti, saranno loro nemici e rinnegheranno la loro adorazione.",
                            "verse 46:7": "Quando vengono recitati loro i Nostri versetti espliciti, i miscredenti dicono della verità che viene ad essi: « E' magia evidente».",
                            "verse 46:8": "Oppure dicono: « L'ha inventato lui».",
                            "verse 46:9": "Di': « Non costituisco un'innovazione rispetto agli inviati né conosco quel che avverrà a me e a voi .",
                            "verse 46:10": "Di': « Ma non vedete? Se esso viene da Allah e voi non credete in esso, mentre un testimone dei Figli di Israele conferma la sua conformità e crede, mentre voi lo rifiutate per orgoglio.",
                            "verse 46:11": "I miscredenti dicono ai credenti: «Se esso fosse un bene, costoro non ci avrebbero preceduto» .",
                            "verse 46:12": "Prima di esso c'era la Scrittura di Mosè, guida e misericordia.",
                            "verse 46:13": "Sì, coloro che dicono: «Il nostro Signore è Allah!» e agiscono rettamente non avranno nulla da temere e non saranno afflitti.",
                            "verse 46:14": "Essi saranno i compagni del Giardino, in cui rimarranno in perpetuo, compenso per quel che avranno fatto.",
                            "verse 46:15": "Abbiamo ordinato all'uomo la bontà verso i genitori: sua madre lo ha portato con fatica e con fatica lo ha partorito.",
                            "verse 46:16": "Accetteremo le loro azioni più belle e sorvoleremo sui loro misfatti.",
                            "verse 46:17": "tra i compagni del Giardino.",
                            "verse 46:18": "Quanto invece a colui che dice ai sui genitori: «Uffa a voi; vorreste promettermi che sarò fatto risorgere, quando già passarono molte generazioni prima di me?»,essi invocheranno l'ausilio di Allah :",
                            "verse 46:19": "« Guai a te! Credi, ché la promessa di Allah è veritiera».",
                            "verse 46:20": "Essi sono coloro contro i quali si realizza la sentenza, [come si realizzò] fra le comunità di uomini e di démoni che li precedettero: in verità saranno i perdenti.",
                            "verse 46:21": "Ci saranno gradi [di merito] per ciascuno di loro in base a quello che avranno fatto.",
                            "verse 46:22": "li compenserà pienamente delle loro opere e non subiranno alcun torto.",
                            "verse 46:23": "Nel Giorno in cui i miscredenti saranno condotti al Fuoco, [sarà detto loro]: «Avete dissipato i vostri beni nella vita terrena e ne avete goduto.",
                            "verse 46:24": "E ricorda il fratello degli 'Âd , quando ammonì il suo popolo presso Al -'Ahqâf ; vennero prima di lui e dopo di lui gli ammonitori .",
                            "verse 46:25": "Dissero: « Sei venuto per allontanarci dai nostri dèi? Fa' venire ciò di cui ci minacci, se sei sincero».",
                            "verse 46:26": "Disse: « La Scienza è solo presso Allah.",
                            "verse 46:27": "Quando videro una densa nuvola dirigersi verso le loro valli, dissero: «Ecco una nuvola, sta per piovere».",
                            "verse 46:28": "che tutto distruggerà per ordine del suo Signore».",
                            "verse 46:29": "Avevamo dato loro mezzi che a voi non abbiamo dato.",
                            "verse 46:30": "Già annientammo le città attorno a voi, eppure avevamo mostrato loro i Nostri segni affinché ritornassero [a Noi pentiti].",
                            "verse 46:31": "Perché mai non li soccorsero coloro che si erano presi come intermediari e dèi, all'infuori di Allah? Anzi, li abbandonarono, non erano altro che calunnie e menzogne.",
                            "verse 46:32": "E",
                            "verse 46:33": "quando ti conducemmo una schiera di démoni affinché ascoltas- sero il Corano; si presentarono dicendosi: «[Ascoltate in] silenzio».",
                            "verse 46:34": "Dissero: «O popolo nostro, in verità abbiamo sentito [la recitazione] di un Libro rivelato dopo [quello di] Mosè, a conferma di quello che lo precede: guida alla verità e alla retta via.",
                            "verse 46:35": "O popolo nostro, rispondete all'Araldo di Allah e credete in Lui, affinché Egli vi perdoni una [parte dei] vostri peccati e vi preservi dal doloroso castigo.",
                            "verse 46:36": "Quanto a colui che non risponde all'Araldo di Allah, non potrà diminuire [la Sua potenza] sulla terra e non avrà patroni all'infuori di Lui.",
                            "verse 46:37": "Non vedono che Allah ha creato i cieli e la terra, che non Si è stancato della loro creazione ed è capace di ridare la vita ai morti? Si, in verità Egli è l'Onnipotente».",
                            "verse 46:38": "E il Giorno in cui i miscredenti saranno condotti al Fuoco [verrà chiesto loro]: « Non è questa la verità?».",
                            "verse 46:39": "« Gustate allora il castigo della vostra miscredenza».",
                            "verse 46:40": "Sopporta con pazienza, come sopportarono i messaggeri risoluti ."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "ハー・ミーム。",
                            "verse 46:2": "この啓典の啓示は，偉力ならびなく英明なアッラーから（下されたもの）である。",
                            "verse 46:3": "われは，真理と期限を定めずには，天と地，そしてその間の凡てのものを，創造しなかった。だが信仰しない者は，かれらに警告されたことから背き去る。",
                            "verse 46:4": "言ってやるがいい。「アッラーを差し置いてあなたがたが祈るものに就いて考えないのか。かれらが，大地で創ったものが何かあるのなら，わたしに見せるがいい。また天の創造においてかれら（偶像）の参与があるとでもいうのか。もしあなたがたの言葉が真実なら，これ（クルアーン）以前の啓典かまたは（古代入）の知識のかけらでもよいからわたしに(西?)せ。」",
                            "verse 46:5": "アッラー以外のものを，祈る者より迷っている者が外にあろうか。これらの者は，復活の日まで答えは得られない。またかれら（神々）は，その祈りに気付かない。",
                            "verse 46:6": "また人間が（審判に）集められた時，かれら（神々）は，かれらに対し敵となり，かれらへの崇拝など，認めることもない。",
                            "verse 46:7": "われの明白だ印が，かれらに読誦されると，信仰しない者はかれらの許に来た真理に就いて言う。「これは明らかに魔術です。」",
                            "verse 46:8": "またかれらは，「かれ（ムハマンド）が，それ（クルアーン）を捏造したのです。」と言う。言ってやるがいい。「もしわたしがそれを捏造したのなら，あなたがたはアッラーから（の恩恵を），何もわたしにあずからせないであろう。かれはあなたがたが，それ（クルアーン）に就いて語ることを最もよく知っておられる。かれは，わたしとあなたがたの，立証者として万全であり，かれは寛容にして慈愛ぶかき御方であられる。」",
                            "verse 46:9": "言ってやるがいい。「わたしは使徒たちの中の革新者ではない。（何故なら）わたしに，またあなたがたに何がなされるのかをわたしは知らない。只，わたしは啓示されたことに従うだけであり，わたしは，公明な一人の警告者に過ぎない。」",
                            "verse 46:10": "言ってやるがいい。「あなたがたは考えてみたのか，もし（クルアーンが）アッラーの御許からであり，それをあなたがたは拒否し，しかも，イスラエルの子孫の一人がそれ（ムーサーの律法）と，同じものであると立証し，それでかれ自身クルアーンを信じたのに，あなたがたは（なお）高慢にも信じなかったとすれば（あなたがたは不義の徒になるのではないのか）。本当にアッラーは，不義の民を御導きになられない。」",
                            "verse 46:11": "信じない者は信仰する者に言う。「もしこの（クルアーンを信じること）が良いのであれば，かれらがわたしたちに，先んじる筈はない。」またかれらはそれによって，導きなどを受けないのであるとして，「これは昔の作り話しです。」と言う。",
                            "verse 46:12": "しかしこの（クルアーン）以前にも導きがあり，慈悲であるムーサーの啓典（律法）があった。それにこれは，アラビア語でそれを確証する啓典で，悪業をなす者への警告であり，また善行に勤しむ者ヘの吉報である。",
                            "verse 46:13": "本当に「わたしたちの主は，アッラーです。」と言い，その後（その道において）堅固な者には恐れもなく，憂いもない。",
                            "verse 46:14": "これらは楽園の住人で，その中に永遠に住む。（それが）かれらの（善）行に対する報奨である。",
                            "verse 46:15": "われは，両親に対し優しくするよう人間に命じた。母は懐胎に苦しみ，その分娩に苦しむ。懐胎してから離乳させるまで30ヶ月かかる。それからかれが十分な力を備える年配に達し，それから40歳にもなると，「主よ，わたしと両親に対して，あなたが御恵み下された恩恵に感謝させて下さい。またあなたの御喜びにあずかるよう，わたしが，善行に勤しむようにして下さい。また子孫も，幸福にして下さい。わたしは悔悟してあなたの御許に帰ります。本当にわたしは，服従，帰依する者です。」と言うようになる。",
                            "verse 46:16": "これらの者は，われがその行いの中最善のものを受け入れる者たちで，様々な誤った行いは見逃し，楽園の住人の中（に入る者）であろう。これはかれらと結ばれた，真実の約束である。",
                            "verse 46:17": "だが自分の（信心深い）両親に向かって言う者がある。「ああ，いやだ2人とも，わたしが甦らされるのですか。わたし以前に幾世代も過ぎ去って（誰一人生きかえっていない）ではありませんか。」両親はアッラーの御助けを願って（言った）。「まあ，情けないこと。あなたは信仰しなさい。本当にアッラーの御約束は真実なのです。」それでもかれは，「これは昔の物語に過ぎない。」と言う。",
                            "verse 46:18": "これらの者は，以前に滅び去ったジンや人間の民族の中にいる者で，御言葉が，かれらに実証される者たちである。かれらは，本当に（完全な）失敗者である。",
                            "verse 46:19": "各人には，その行ったことに応じて種々の段階がある。これはかれが，行為に対して（完全に）報われるためで，決して不当に扱われることはない。",
                            "verse 46:20": "不信心者たちが，獄火の前に晒されるその日，「あなたがたは現世の生活において，様々な良いものを得ながら，それを自ら享楽した。それで今日は，恥ずべき懲罰で報いられよう。あなたがたは地上で真理を無視し，高慢であり，また（アッラーの）� に背いていたことに対して恥ずべき懲罰で報いられよう。」（と仰せられるであろう）。",
                            "verse 46:21": "アードの同胞〔フード〕を思い起こしなさい。われがかれの民を砂の丘で戒めた時，確かにかれ以前にもまた以後にも，警告者たちが来て，「アッラーのほか崇拝してはならない。本当にわたしは，偉大な日の懲罰を，あなたがたのために恐れる。」（と言った。）",
                            "verse 46:22": "かれらは言った。「あなたは，わたしたちを神々から背かせるために来たのですか。もしあなたの言葉が本当なら，わたしたちを威しているものを(湾?)しなさい。」",
                            "verse 46:23": "かれは（答えて）言った。「その知識はアッラーに（だけ）あり，わたしは下されたものをあなたがたに伝えるだけである。それにしても，あなたがたは，分ろうとしない愚か者である。」",
                            "verse 46:24": "その時，黒雲がそれぞれの谷に押し寄せて来るのを見て人々は言った。「この雲では，一雨来るぞ。」すると（声があった）。「いや，それはあなたがたが催促するもの。それに伴う風こそは痛ましい懲罰で，",
                            "verse 46:25": "それは主の御命令を奉じて，凡てのものを壊滅し去る。」それで朝になると，かれらの住みかの外，何ものも見られなかった。われはこのように，罪を犯した民に報いる。",
                            "verse 46:26": "われは，実にあなたがた（クライシュ族）にも与えなかった力を，聴覚と視覚と心をかれらに授けた。それでもかれらは，アッラーの印を認めなかったため，その聴覚と視覚と心は，全くかれらを益することなく，かれらは自分の嘲笑していたものに，取り囲まれてしまった。",
                            "verse 46:27": "本当にわれはあなたがたの周囲の数々の町村を滅ぼし，わが印を示した。（それで）かれらが（われに）帰る（ように）。",
                            "verse 46:28": "アッラーに近付こうと，かれらがかれを差し置いて神として拝したものたちは，何故かれらを助けなかったのか。いや（助けるどころか）偶像はかれらから姿を消してしまった。これは，（偶像を崇めるかれらの論理）かれらの偽作であり，また捏造したものであった。",
                            "verse 46:29": "われが，クルアーンを聞きたいというジンの仲間をあなたに差し向けた時のことを思い起しなさい。かれらがその場に臨むと互いに，「謹んで聴きなさい。」と言った。やがてそれが終ると，警告のためにその民の所に帰って行き警告した。",
                            "verse 46:30": "かれらは言った。「わたしの人々よ，わたしたちはムーサーの後に下された啓典を確かに聞きました。（それは）それ以前に下されたものを確証し，真理と正しい道に導くものです。",
                            "verse 46:31": "わたしたちの人々よ，アッラーに招く者に答えて，かれを信じなさい。かれは，あなたがたの様々な罪を赦し，痛ましい懲罰から御救いになられる。",
                            "verse 46:32": "アッラーの招きに答えない者は，地上においてかれ（の計画）を挫くことなど出来る筈はない。またかれらには，かれの外に保護者はない。これらの者は明らかに迷いに陥っている者である。」",
                            "verse 46:33": "かれら（マッカの多神教徒）は，天と地を創造なされ，その創造に疲れることもないアッラーが，死者を甦らせることくらい，できるとは思わないのか。いや，かれは凡てのことに全能であられる。",
                            "verse 46:34": "信仰しない者が，火獄の前に晒される日。（かれらは間われよう。）「これは真実ではないのか。」かれらは（答えて），「本当でした。わたしたちの主に誓けて。」と言う。かれは仰せられよう。「あなたがたは不信心であったことに対する懲罰を味わえ。」",
                            "verse 46:35": "あなたは耐え忍ベ。（且つて）使徒たちが，不屈の決意をしたように耐え忍べ。かれら（不信心の者）のために急いではならない。かれらに約束されたこと（懲罰）を見る日，まるで（死から復活までの期間を）一日の中のほんの一時しか過してはいなかったかのように（思うであろう）。（これはアッラーからの）御達しである。滅ぼされるのは，（アッラーの）� に背く者たちだけである（ということを）。 信仰しない者が，火獄の前に晒される日。（かれらは間われよう。）「これは真実ではないのか。」かれらは（答えて），「本当でした。わたしたちの主に誓けて。」と言う。かれは仰せられよう。「あなたがたは不信心であったことに対する懲罰を味わえ。」"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "하 밈",
                            "verse 46:2": "이것은 권능과 지혜로 충만하신 하나님으로부터 계시된 성서 라",
                            "verse 46:3": "하나님께서 천지와 그 사이에있는 만물을 창조함은 일정기간 동안 합당한 목적을 위해서라 그 러나 믿음을 거역한 자들은 그들 이 경고받은 것으로부터 등을 돌 리고 있나니",
                            "verse 46:4": "일러가로되 하나님 외에 너희가 숭배하는 것이 무엇인지 숙고 하여 보았느뇨 그것들이 대지에서창조한 것이 무엇인지 내게 보여 다오 아니면 그것들이 하늘을 창 조함에 동참하였단 말이뇨 이것 이전에 우상을 숭배하라 계시된 성서가 있다면 내게 이르게 하라 아니면 너희가 진실이라 한다면 지식의 흔적이라도 이르게 하라",
                            "verse 46:5": "심판의 날 응답도 못하며 그 들의 부름에 관심도 없는 하나님 아닌 다른 것을 숭배하는 자보다 크게 방황한 자 누구이뇨",
                            "verse 46:6": "사람들이 부활하여 모이는 날 그것들은 그들에게 적이 되어 숭 배했던 그들을 부인하니라",
                            "verse 46:7": "하나님의 말씀이 그들에게 낭송되어 이르니 불신자들은 이 진 리에 관하여 이것은 분명한 마술 이라 하더라",
                            "verse 46:8": "그들은 또 그가 그것을 위 조한 것이라 말하더라 일러가로되내가 그것을 위조했다면 어느 누 구도 나를 위해 하나님의 벌을 막지 못하리라 그분은 너희가 말하 는 모든 것을 알고 계시니 나와 너희 사이의 증인은 그분으로써 충분하니 그분은 관용과 자비로 충만하시니라",
                            "verse 46:9": "일러가로되 내가 새로운 교리를 전하는 자가 아니며 내게 그리고 너희에게 어떤 일이 있을런지 내가 모르도다 나는 다만 계시된 것을 따르는 자로 분명한 경고자 에 불과하니라",
                            "verse 46:10": "일러가로되 이것은 하나님 으로부터 계시된 것으로 너희가 그것을 거역했을 때를 너희는 숙 고해 보았느뇨 이스라엘 자손중 의 한 증인이 그것을 증언하고 믿음을 가졌으나 너희는 거만해 하였으니 실로 하나님은 죄인들을 인도하지 아니 하시니라",
                            "verse 46:11": "믿지 아니한 불신자들이 믿 는 자들에 대하여 말하길 이것이 복음이었다면 그러한 사람들이 없었으리라 그리고 그들이 그것 으로 인도되려 구하지 아니함으로 이것은 오래된 거짓이라 말하더라",
                            "verse 46:12": "이것 이전에 모세의 성서가 안내서로써 그리고 은혜로 있었으 며 아랍어로 된 이 성서가 그것을 확증하며 죄인들에게 경고하고 의로운 자들에게는 기쁨의 복음을 전하고 있노라",
                            "verse 46:13": "우리의 주님은 하나님이시라말하며 바른 길을 걷는 자들에게 는 두려움도 슬픔도 없노라",
                            "verse 46:14": "그들은 천국의 주인들로 그 곳에서 영생하리니 그것이 그들이 행한 것에 대한 보상이라",
                            "verse 46:15": "하나님은 부모에게 효도하라인간에게 말씀하셨노라 어머니는 고통으로 잉태하사 고통으로 출산 하며 임신한 기간과 양육하는 기 간이 삼십개월이라 그가 성년이 되고 나이 사십이 되면 주여 당신 께서 저와 그리고 저의 부모에게 베풀어 주신 당신의 은혜에 저로 하여금 감사하도록 하여 주소서 그리고 당신이 기뻐하실 의로운 일을 하고 저의 후손도 의로운 자 들이 되도록 하여 주소서 실로 저 는 당신께 회개하며 당신께 순종 하나이다",
                            "verse 46:16": "그것으로 하나님은 그들의 가장 훌륭한 행위를 받아주사 그 들의 과오를 용서하여 주니 그들 은 천국에 사는 주인들 가운데 있 게 되리라 그것이 현세에서 그들 에게 약속된 진리라",
                            "verse 46:17": "그러나 부모에게 거역하며 내 이전에 많은 백성들이 죽었어 도 부활하지 아니 하는데 제가 다 시 부활하리라 제게 약속을 강요 하나이까 라고 말하는 자 있도다 부모는 하나님께 구원을 청하며 슬픈일이라 믿음을 가져라 실로 하나님의 약속은 진리라 하니 이 것은 옛 선조의 이야기에 불과한 것입니다 라고 대답하더라",
                            "verse 46:18": "그들에게는 말씀이 있었으며그들 이전의 영마와 인간들도 그 들의 오만함으로 사라져 갔으니 실로 그들은 손실자들이라",
                            "verse 46:19": "모든 인간에게는 행위의 결과에 따라 등급이 있나니 하나님은 그들의 행위에 따라 그들에게 보상하시매 그들은 공평한 대우를받으리라",
                            "verse 46:20": "불신자들이 불지옥에 있게 되는 날 너희는 현세의 생활에서 좋은 것들을 부여 받고서 향락과 오락에 탐닉했으니 오늘 너희에게는 수치스러운 응벌의 보상만이 있을 뿐이라 이는 너희가 지상에 서 오만해 하고 방탕했기 때운이 라는 말이 그들에게 있으리라",
                            "verse 46:21": "아드의 한 형제 후드를 상기하라 그는 굴곡진 모래 언덕에 거주했던 백성에게 경고했노라 그의 이전에도 그리고 후에도 그곳 에 경고자는 있었노라 하나님 외 에 다른 것을 섬기지 말라 실로 나는 위대한 어느날 너희에게 있 는 응벌이 두려울 뿐이라",
                            "verse 46:22": "이때 그들이 대답하길 우리 를 우리의 신으로부터 멀리하게 하고자 당신이 왔느뇨 당신이 진 실이라면 우리에게 약속한 것을 보이라 하니",
                            "verse 46:23": "그가 말하였더라 하나님만이그것을 아시는 것으로 나는 내게 주어진 계시만을 너희에게 전할 뿐이라 그러나 너희는 오만한 백 성임을 내가 알고 있노라",
                            "verse 46:24": "하늘에 구름이 나타나 그들 의 계곡을 향해 다가오는 것을 그들이 보았을 때 이것은 우리에게 비를 내릴 구름이라고 말하매 그 렇지 아니함이라 그것은 너희가 서둘러 구한 재앙이요 고통스러운응벌의 바람이라",
                            "verse 46:25": "주님의 명령에 따라 모든 것을 멸망케 할 것이라 아침이 되니그들 집들의 황폐한 흔적 밖엔 보이는 것이 없었더라 그렇듯 하나 님은 죄지은 백성들에게 보상을 내리니라",
                            "verse 46:26": "하나님이 너희에게 부여하 지 아니했던 번영과 힘을 그들에 게 주었고 그리고 귀와 눈과 마 음을 주어 그 은혜를 인식하도록 하였으나 그들의 귀도 눈도 그리 고 마음도 그들에게 유용하지 못 하여 그들은 계속해 하나님의 말 씀을 거역하였으니 그들은 그들이조롱했던 것으로 완전히 포위되었노라",
                            "verse 46:27": "하나님께서 너희 주변의 고 을들을 멸망케 하고 여러가지로 예증을 보여 그들로 하여금 그분 에게 귀의토록 하였을 때",
                            "verse 46:28": "하나님 외에 그들이 가까이 했던 신들은 왜 그들을 돕지 못 하였느뇨 그렇게 할 수 없노라 그것들은 그들을 방황케 했을 뿐 으로 그것은 그것들의 거짓이었 고 그들이 위조한 것이었노라",
                            "verse 46:29": "하나님께서 영마의 무리로 하여 그대에게 보내어 꾸란을 듣 도록 하니 그들이 거기에 나타나 말하길 조용히 귀를 저울이라 말 하고 꾸란의 낭송이 끝났을 때 그들은 백성들에게로 돌아가 그들의죄악에 대하여 경고하더라",
                            "verse 46:30": "그리고 그들은 말하길 백성 들이여 우리는 모세 이후에 계시 되어 그것을 확증하고 진리와 바 른길로 인도하는 한 성서에 관하 여 들었노라",
                            "verse 46:31": "백성들이여 하나님의 부름에응답하여 그분을 믿으라 그리하면그분께서 너희의 과오를 용서하실것이며 고통스러운 응벌로부터 너희를 보호하여 주실 것이라",
                            "verse 46:32": "그러나 하나님의 부름에 응 답하지 아니한 자 있다해도 그는 대지위에서 하나님의 계획을 좌절케 못하니 그때 그는 하나님 외에어떤 보호자도 갖지 못하여 크게 방황하게 되리라",
                            "verse 46:33": "하늘과 대지를 창조하신 하 나님은 그것을 창조하심에 지치지아니하시고 죽은 자에게 생명을 주시는 분임을 그들은 알지 못하 느뇨 그러함이라 실로 그분은 모 든 일에 전지전능 하심이라",
                            "verse 46:34": "불신자들이 불지윽으로 끌리어 가는 날 그래도 사실이 아니뇨라고 질문하니 주여 그렇습니다 라고 말하매 너희가 진리를 거역 한 것으로 너희는 이 벌을 맛보라하더라",
                            "verse 46:35": "선지자들이 끊임없이 그랬듯이 그대여 인내하라 그리고 그들 에 대한 응벌을 서둘러 구하지 말라 그들에게 약속된 것을 그들이 지켜 볼 그날이면 그들은 현세에 서 한 시간도 체류하지 아니했던 것처럼 되리라 그대는 계시를 전 하는 것으로 충분하노라 불신자들외에는 어느 누구도 멸망하지 않 노라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "چه‌ند پیتێک له‌سه‌ره‌تای هه‌ندێ له‌سووره‌ته‌کانی قورئاندا هاتوون ژماره‌یان ( 14 ) پیته‌، نیوه‌ی کۆی پیته‌کانی زمانی عه‌ره‌بین، بۆ سه‌لماندنی (اعجاز) و مه‌زنی و گرنگی قورئان که‌له‌توانای هیچ که‌سدانیه به‌و پیتانه کتێبێکی ئاوا بێوێنه دابنێت به‌راده‌یه‌ک هه‌تا هه‌موو گرۆی ئاده‌میزاد و په‌ری کۆ ببنه‌وه‌بۆ ئه‌و مه‌به‌سته‌، بێگومان چه‌نده‌ها نهێنی تریشی تیایه‌، زاناکان له‌هه‌ندێکی دواون، هه‌ندێکیشیان وتویانه: هه‌ر خوا خۆی زانایه به‌نهێنی ئه‌و پیتانه.",
                            "verse 46:2": "ئه‌م قورئانه له‌لایه‌ن خوای باڵا ده‌ست و داناوه‌دابه‌زیوه‌.",
                            "verse 46:3": "ئێمه ئاسمانه‌کان و زه‌وی و ئه‌م هه‌موو شتانه‌ی نێوانمان دروست نه‌کردووه‌، ته‌نها له‌سه‌ر بنچینه‌ی حه‌ق و ڕاستی نه‌بێت، بۆ کاتێکی دیاریکراویش، که‌چی بێ باوه‌ڕان پشت هه‌ڵده‌که‌ن له‌و ئاگاداری و بێدارکردنه‌وه‌یه‌",
                            "verse 46:4": "ئه‌ی محمد ( صلی الله علیه وسلم ) هه‌واڵم بده‌نێ: ئایا سه‌رنجتان داوه‌له‌و شتانه‌ی که‌له‌جیاتی خوا ده‌یانپه‌رستن و، هاناو هاواریان بۆ ده‌به‌ن؟ باشه‌ئاخر ئه‌وانه‌چ شتێکیان له‌زه‌ویدا به‌دیهێناوه‌، با پێشانم بده‌ن!.",
                            "verse 46:5": "جا ئیتر کێ له‌و که‌سه گومڕاتره که دوعاو نزا و پاڕانه‌وه‌، ڕوو به‌که‌سێک یان شتێک ده‌کات، جگه له‌خوا که ئه‌گه‌ر هه‌تا ڕۆژی قیامه‌تیش لێی بپاڕێته‌وه بێ سووده‌، نه‌به‌هانایه‌وه ده‌چێت، نه‌به‌په‌رستنه‌که‌ش ده‌زانێت، له‌کاتێکدا ئه‌وانه‌له‌دۆعاو پارانه‌وه‌ی ئه‌وان بێ ئاگاو غافڵن و هه‌ستی پێ ناکه‌ن.",
                            "verse 46:6": "کاتێکیش که‌خه‌ڵکی کۆده‌کرێنه‌وه بۆ لێ پرسینه‌وه‌، بت و په‌رستراوه‌کان ده‌بنه دوژمن بۆ ئه‌و که‌سانه‌که له‌دونیادا ده‌یانپه‌رستن، به‌هیچ شێوه‌یه‌ک بڕوایان پێ ناکه‌ن، به‌ڵکو به‌درۆیان ده‌خه‌نه‌وه‌.",
                            "verse 46:7": "له کاتێکدا ئایه‌ته ئاشکراو ڕوونه‌کانی ئێمه به‌سه‌ریاندا بخوێنرێته‌وه‌، ئه‌وانه‌ی که‌بێ باوه‌ڕ بوون به‌و حه‌ق و ڕاستیه‌ی که‌بۆیان دێت ده‌ڵێن: ئه‌مه‌جادوویه‌کی ئاشکرایه.",
                            "verse 46:8": "یاخوا ده‌ڵێن محمد ( صلی الله علیه وسلم ) خۆی ئه‌م قورئانه‌ی هه‌ڵبه‌ستووه.",
                            "verse 46:9": "ئه‌ی پێغه‌مبه‌ر ( صلی الله علیه وسلم ) پێیان بڵێ: که‌من یه‌که‌م پێغه‌مبه‌رو تازه‌په‌یدابوو نیم، ناشزانم چیم به‌سه‌ر دێت، چیش به‌سه‌ر ئێوه دێت؟ ( چونکه غه‌یب زان نیم و له‌نهێنی و شاراوه‌کان ئاگادار نیم )، من ته‌نها شوێنی ئه‌و وه‌حی و نیگایه ده‌که‌وم که‌پێم ده‌گات و من ته‌نها بێدارکه‌ره‌وه‌یه‌کی ئاشکرام.",
                            "verse 46:10": "هه‌روه‌ها پێیان بڵێ: هه‌واڵم بده‌نێ، باشه‌، ئه‌ی ئه‌وه چۆنه وحاڵتان چۆن ده‌بێت ئه‌گه‌ر ئه‌م قورئانه له‌لایه‌ن خواوه‌بێت و، ئێوه ئاوا بڕوای پێنه‌که‌ن؟! هاوکات له‌گه‌ڵ ئه‌وه‌دا که‌شایه‌تێک له‌نه‌وه‌ی ئیسرائیل شایه‌تی داوه‌که‌چ ته‌ورات و، چ قورئان له‌یه‌ک سه‌رچاوه‌وه‌، ئه‌وه‌باوه‌ڕی هێنا به‌محمد ( صلی الله علیه وسلم ) و قورئان که‌چی ئێوه خۆتان به‌زل و گه‌وره‌زانی و، باوه‌ڕتان نه‌هێنا.",
                            "verse 46:11": "ئه‌وانه‌ی که‌بێ باوه‌رن ده‌رباره‌ی ئه‌وانه‌ی ئیمان و باوه‌ڕیان هێناوه ده‌ڵێن: ئه‌گه‌ر باوه‌ڕهێنان به‌قورئان وبه‌محمد ( صلى الله عليه وسلم) چاک بوایه‌، ئه‌وانه‌پێش ئێمه نه‌ده‌که‌وتن!! جا چونکه خۆیان هیدایه‌ت و ڕێنموویی قورئان وه‌رناگرن ده‌ڵێن: ئه‌مه هه‌ڵبه‌ستراو و ئه‌فسانه‌یه‌کی کۆنه!!",
                            "verse 46:12": "خۆ پێش ئه‌م قورئانه‌، ته‌وراتی موسا ڕه‌وانه‌کراوه‌تا پێشه‌واو ڕه‌حمه‌ت بێت له‌کاتی خۆیدا.",
                            "verse 46:13": "به‌ڕاستی ئه‌وانه‌ی که‌ده‌ڵێن: په‌روه‌ردگارمان الله یه‌و، پاشان پابه‌ندی ئه‌و ئیمانه ده‌بن وڕاست وره‌وان په‌یڕه‌وی ده‌که‌ن و له‌سه‌ری به‌رده‌وامن، ئه‌وانه‌هیچ جۆره ترس و بیمێکیان له‌سه‌ر نی یه و دڵته‌نگ نابن.",
                            "verse 46:14": "ئه‌وانه\\‌به‌هه‌شتین و ژیانی نه‌مریی تیایدا ده‌به‌نه‌سه‌ر، له‌پاداشتی ئه‌و کاروکرده‌وانه‌دا که‌ئه‌نجامیان ده‌دا.",
                            "verse 46:15": "ئێمه فه‌رمانمان به‌ئاده‌میزاد داوه‌که چاکه‌کارو چاک ڕه‌فتار بێت له‌گه‌ڵ دایک و باوکیدا، دایکی به‌ئازاره‌وه هه‌ڵی گرتووه‌و به‌ده‌م ئێش و ئازاره‌وه‌بوویه‌تی، سک پربوون و له‌شیر بڕینه‌وه‌ی سی دانه مانگی خایاندوون.",
                            "verse 46:16": "ئا ئه‌وانه‌ئه‌و که‌سانه‌ن که‌به‌گوێره‌ی چاکترینی کرده‌وه‌کانیان پاداشتیان ده‌ده‌ینه‌وه‌، چاوپۆشیش له‌هه‌ڵه‌و گو‌ناهه‌کانیان ده‌که‌ین له‌ڕیزی به‌هه‌شتی یه‌کاندا، ئه‌مه‌ش به‌ده‌ستهێنانی ئه‌وبه‌ڵێنه ڕاست و دروسته‌یه که‌له‌کاتی خۆی پێیان درابوو.",
                            "verse 46:17": "به‌ڵام ئه‌وه‌ی که‌بێزاره له‌دایک و باوکی باوه‌ڕداری و پێیان ده‌ڵێت: ئاخ و ئۆف له‌ده‌ست ئێوه‌، ئایا ئێوه هه‌ره‌شه‌م لێ ده‌که‌ن، ئێوه چۆن بڕواتان به‌وه‌هه‌یه من دوای مردن له‌گۆر ده‌ربهێنرێم و زیندوو ببمه‌وه‌!! له‌کاتێکدا ئه‌و هه‌موو خه‌ڵکه‌ش ساڵه‌هایه و سه‌ده‌هایه ده‌مرن و پێش من مردوون.",
                            "verse 46:18": "ئا ئه‌و جۆره که‌سانه‌ئه‌وانه‌ن که‌بڕیاری خوایان له‌سه‌ر خۆیان کردووه‌به‌ماڵ و چه‌سپاوه‌له‌سه‌ریان، هاوڕێ له‌گه‌ڵ چه‌نده‌ها گرۆو ده‌سته‌و میلله‌تانی تری ڕابوردووی بێ باوه‌ڕی پێش خۆیان، له‌هه‌ردوو به‌ره‌ی په‌ری و ئاده‌میزاد، به‌ڕاستی ئه‌وانه‌هه‌رهه‌موویان خه‌ساره‌تمه‌ند و زه‌ره‌ر مه‌ند بوون.",
                            "verse 46:19": "هه‌ر ده‌سته‌یه‌ک، هه‌ر که‌سێک له‌ئیمانداران یان له‌بێ بڕواکان پله‌و پایه‌ی به‌رز، یان نزمیان هه‌یه‌، به‌گوێره‌ی کرده‌وه‌کانیان که‌ئه‌نجامیانداوه‌، ئه‌مه‌ش بۆ ئه‌وه‌یه خوای په‌روه‌ردگار به‌گوێره‌ی کرده‌وه‌کانیان به‌ته‌واوی پاداشتیان بداته‌وه‌، بێ ئه‌وه‌ی هیچ جۆره سته‌مێکیان لێ بکرێت.",
                            "verse 46:20": "ڕۆژێک دێت ئه‌وانه‌ی که‌بێ بڕوان به‌ره‌و دۆزه‌خ ده‌برێن و نیشانیان ده‌درێت و پێیان ده‌وترێت: هه‌رچی خۆشی و شادیه‌کتان هه‌بوو له‌ژیانی دنیاتاندا به‌ئاره‌زووی خۆتان ڕاتانبوارد، که‌وابوو ئه‌مرۆ ئیتر نۆره‌ی ئه‌وه‌یه که‌سزای خه‌جاڵه‌تی و ڕیسوایی بدرێنه‌وه‌، به‌هۆی ئه‌وه‌ی که‌لووت به‌رزیتان ده‌کرد له‌زه‌ویدا به‌ناحه‌ق و به‌هۆی ده‌رچوونتان له‌سنوور و فه‌رمانی خوا.",
                            "verse 46:21": "ئه‌ی پێغه‌مبه‌ر ( صلى الله عليه وسلم) یادی براکه‌ی قه‌ومی عاد ( هود پێغه‌مبه‌ر ) بکه‌، کاتێک قه‌ومه‌که‌ی بێدارکردنه‌وه له‌دۆڵ و بیابانه‌کاندا ( مه‌به‌ست ناوچه‌ی حچر موت ) ه‌، بێگومان بێدار خه‌ره‌وه‌ی زۆر له‌پێش ئه‌و و دوای ئه‌ویش تێپه‌ریان کرد، هه‌ر هه‌موویان ئه‌وه‌یان به‌خه‌ڵکی ڕاگه‌یاندووه که‌جگه له‌خوا که‌سی تر نه‌په‌رستن.",
                            "verse 46:22": "خوانه‌ناسانی قه‌ومه‌که‌ی پێیان وت: ئایا تۆ بۆ ئه‌وه‌هاتوویت که ئێمه له‌به‌نداینتی خواکانمان لابده‌یت؟! که‌واته‌ئه‌گه‌ر له‌ڕاستگۆیانی ئه‌و هه‌ڕه‌شانه‌ی که‌لێمان ده‌که‌یت، پێشی بێنه بۆمان!",
                            "verse 46:23": "هود وتی: ڕوودانی ئه‌و سزایانه و زانینی کاته‌که‌ی به‌ڕاستی ته‌نها هه‌ر لای خوا خۆیه‌تی، من ئه‌وه‌م له‌سه‌ره که ئه‌وه‌ی من بۆی ڕه‌وانه کراوم پێتان ڕابگه‌یه‌نم، به‌ڵام به‌داخه‌وه ئێوه به قه‌وم و هۆزێکی نه‌زان و نه‌فام ده‌بینم.",
                            "verse 46:24": "جا کاتێک په‌ڵه هه‌ورێکیان بینی ڕووی کردۆته دۆڵ و ناوچه‌که‌یان، دڵیان خۆشبوو، وتیان: ئه‌مه‌بارانی پێیه بۆمان، نه‌خێر وانیه‌، به‌ڵکو ئه‌وه‌ئه‌و کاره‌ساته‌یه په‌له‌تانه‌پێش بێت، ڕه‌شه‌بایه‌کی توند، که‌سزایه‌کی به‌ئازارو به‌ئێشی پێیه.",
                            "verse 46:25": "ئه‌وه‌ره‌شه‌بایه‌، هه‌موو شتێک و هه‌موو شوێنێک کاول ده‌کات به‌فه‌رمانی په‌روه‌ردگاری، ئیتر که‌سیان دیار نه‌مان جگه‌ماڵه چۆڵ و هۆڵه‌کانیان، هه‌ر ئا به‌و شێوه‌یه و به‌و جۆره سزایانه تۆڵه له‌قه‌وم و هۆزو گه‌لانی تاوانبارو تاوانکار ده‌سێنین ( له‌هه‌موو کات و شووێنێکدا، ئه‌گه‌ر یاخی ببن ).",
                            "verse 46:26": "سوێند به‌خوا به‌ڕاستی ئێمه ده‌سه‌ڵات و تواناییه‌کی وامان به‌خشی به‌قه‌ومی ( عاد )، که‌به‌ئێوه‌مان نه‌به‌خشیووه‌، هه‌روه‌ها هۆکاره‌ی بیستن و بینین و لێکدانه‌وه‌شمان پێدابوون، مه‌خابن هۆکاره‌کانی بیستن و بینین و لێکدانه‌وه سوودی پێنه‌گه‌یاندن! ئه‌مه‌ش له‌به‌ر ئه‌وه‌بوو چونکه‌به‌به‌ڵگه‌و نیشانه‌کانی خوا بێ باوه‌ڕ بوون و، به‌رپه‌چیان ده‌دایه‌وه.",
                            "verse 46:27": "بێگومانیش ئێمه دانیشتوانی شارو دێهاته‌کانی ده‌وروبه‌رتانمان له‌ناو برد ( کاتێک یاخی بوون له‌به‌رنامه‌ی ئێمه )، به‌ڵگه و نیشانه‌ی جۆراو جۆریشمان خسته‌به‌ر چاویان، بۆ ئه‌وه‌ی بگه‌ڕێنه‌وه بۆ لای ئیمان و ڕوو بکه‌نه‌وه‌باوه‌ڕ.",
                            "verse 46:28": "جا ئه‌و بتانه‌ی که‌به‌ته‌ما بوون له‌خوا نزیکیان بخه‌نه‌وه‌و له‌کاتی ته‌نگانه‌دا فریایان بکه‌ون!! ده‌با فریایان بکه‌وتنایه‌؟! به‌ڵکو هه‌ر لێیان ون بوون و ئاسه‌واریان نه‌ما، ئائه‌وه‌بوو درۆکانیان و ئه‌وه‌ش بوو که‌هه‌ڵیانده‌به‌ست ( که‌گوایه ئه‌م بتانه‌بۆیه ده‌په‌رستن تا له‌خوا نزیکیان بکه‌نه‌وه‌، فریایان بکه‌وه‌! ).",
                            "verse 46:29": "یادی ئه‌وه‌ش بکه‌کاتێک ئێمه ده‌سته‌یه‌ک په‌ریمان لادایه لای تۆ، تا گوێ له‌قورئان بگرن، ئه‌وسا ئاماده‌بوون و به‌یه‌کتریان وت: گوێ بگرن و بێ ده‌نگ بن، کاتێک قورئان خوێندنه‌که ته‌واو بوو، په‌ریه‌کان گه‌ڕانه‌وه بۆ ناو هۆزو قه‌ومه‌که‌یان و، ده‌ستیان کرد به‌ئاگادارکردنه‌وه‌و بانگکردنیان بۆ په‌یره‌وی کردنی ئه‌م ئاینه نوێیه.",
                            "verse 46:30": "وتیان: ئه‌ی هۆز و گه‌لی ئێمه! باوه‌ڕ بکه‌ن، گوێمان له‌کتێبێک بوو که‌له‌دوای موسا نێردراوه‌، سه‌لمێنه‌ری په‌یام و کتێبه‌کانی پێش خۆیه‌تی و ڕێکه له‌گه‌ڵیاندا و، ڕێنموویی و هیدایه‌ت ده‌دات بۆ حه‌ق و ڕاسته‌شه‌قامی ڕاست و دروستیش.",
                            "verse 46:31": "ئه‌ی خزمینه!! بچن به‌ده‌م بانگه‌وازی خواوه‌و ئیمان و باوه‌ڕی پێبهێنن، ئه‌و کاته‌له‌گوناهه‌کانیان خۆش ده‌بێت و له‌سزای به‌ئێش و ئازار ده‌تانپارێزێت",
                            "verse 46:32": "جا ئه‌وه‌ی پێشوازی له‌بانگه‌وازی خوا ناکات، ئه‌وه‌وه‌نه‌بێت له‌ده‌سه‌ڵاتی خوا له‌م سه‌ر زه‌ویه‌دا ده‌رباز ببێت و خوا ده‌سه‌وسان بکات، که‌سیش ناتوانێت جگه‌له‌خوا ڕزگاری بکات و پشتیوانی لێ بکات، ئا ئه‌وانه‌له‌گومڕایی و سه‌رلێشێواویه‌کی زۆر ئاشکرادان.",
                            "verse 46:33": "ئایا ئه‌وه‌سه‌رنجیان نه‌داوه‌به‌ڕاستی ئه‌وه‌خوایه که‌ئاسمانه‌کان و زه‌وی دروست کردووه‌و له‌دروست کردنیشیاندا هیچ ماندوو نه‌بووه‌، توانای نی یه مردووه‌کان زیندوو بکاته‌وه‌، به‌ڵێ، بێگومان ئه‌و زاته‌، به‌سه‌ر هه‌موو شتێکدا ده‌سه‌ڵاتی هه‌یه.",
                            "verse 46:34": "ڕۆژێک دێت کافرو خوانه‌ناسان دۆزه‌خیان نیشان ده‌درێت و پێیان ده‌وترێت: ئێستا ده‌ڵێن چی؟! ئا ئه‌مه‌ئیتر حه‌ق و حه‌قیقه‌ت و ڕاسته‌قینه نیه؟! ( هه‌موو به‌یه‌ک ده‌نگ ) ده‌ڵێن: به‌ڵێ.",
                            "verse 46:35": "که‌وابوو ئه‌ی پێغه‌مبه‌ر ( صلى الله عليه وسلم) دان به‌خۆدا بگره‌و خۆڕاگربه‌، هه‌روه‌کوو پێغه‌مبه‌رانی خاوه‌ن ویستی به‌هێز خۆڕاگر بوون، په‌له‌شیان لێ مه‌که‌، ئه‌و ڕۆژه‌ی که‌به‌ڵێنیان دراوه‌تێ هه‌ر کاتێک پێشهات وا ده‌زانن ته‌نها ساته‌وه‌ختێکیان له‌رۆژێکدا پێچووه‌، ئه‌مه‌به‌ڵێن و په‌یام و ڕاگه‌یاندنێکی ته‌واوه‌، جا ئه‌و کاته‌مه‌گه‌ر ته‌نها تاوانباراو گوناهکاران نین که‌تیاده‌چن؟! کافربوونتاندا."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Haa, Miim.",
                            "verse 46:2": "Diturunkan Al-Quran ini, dari Allah Yang Maha Kuasa, lagi Maha Bijaksana.",
                            "verse 46:3": "(Ingatlah), tidaklah Kami menciptakan langit dan bumi serta segala yang ada di antara keduanya melainkan dengan ada gunanya yang benar dan dengan ada masa penghujungnya yang tertentu (yang padanya dijalankan pembalasan) dan orang-orang yang kafir berpaling dari menerima peringatan yang diberikan kepada mereka mengenainya.",
                            "verse 46:4": "Katakanlah (wahai Muhammad kepada orang-orang musyrik yang menentangmu): Sudahkah kamu mengetahui kekuasaan dan kelayakan makhluk yang kamu seru dan sembah yang lain dari Allah? Tunjukkanlah kepadaku apakah yang mereka ciptakan dari bahagian bumi ini? Atau adakah mereka mempunyai sebarang perkongsian (dengan Allah) dalam mencipta dan menguruskan langit? Bawalah kamu kepadaku sebuah Kitab (dari Allah) yang lain dari Al-Quran ini atau sebarang keterangan yang berdasarkan ilmu (peninggalan orang-orang yang telah lalu) kalau betul kamu orang-orang yang benar (tentang dakwaan kamu itu)!",
                            "verse 46:5": "Dan tidak ada yang lebih sesat daripada orang yang menyembah sesuatu yang lain dari Allah, yang tidak dapat menyahut atau memberikan sebarang pertolongan kepadanya (dari dunia) hinggalah ke hari kiamat, sedang makhluk-makhluk yang mereka sembah itu tidak dapat menyedari atau memberi layanan baik kepada permohonan mereka.",
                            "verse 46:6": "Dan apabila manusia dihimpunkan (untuk dihitung amalnya pada hari akhirat), menjadilah segala yang disembah itu musuh kepada orang-orang yang menyembahnya, dan segala yang disembah itu juga tidak mengakui serta mendustakan penyembahan mereka kepadanya.",
                            "verse 46:7": "Dan apabila dibacakan kepada mereka (yang kafir) ayat-ayat Quran kami yang jelas nyata, berkatalah mereka terhadap kebenaran (Al-Quran) bila sahaja disampaikan kepada mereka: Ini ialah sihir yang nyata!.",
                            "verse 46:8": "(Bukan setakat itu sahaja mereka katakan) bahkan mereka menuduh dengan berkata: Muhammad telah merekakan Al-Quran itu.",
                            "verse 46:9": "Katakanlah lagi: Bukanlah aku seorang Rasul pembawa agama yang berlainan dari agama yang dibawa oleh Rasul-rasul (yang telah lalu) dan aku tidak mengetahui apa yang akan dilakukan kepadaku dan kepada kamu.",
                            "verse 46:10": "Katakanlah lagi: Bagaimana fikiran kamu jika Al-Quran ini (yang datangnya) dari Allah dan kamu mengingkarinya, pada hal ada seorang saksi dari Bani Israil memberi keterangan mengakui (sahnya Kitab) yang sama seperti Al-Quran ini, lalu dia percayakan (Al-Quran ini dari Allah), sedang kamu dengan sombong angkuh mengingkarinya? (Tidakkah dengan yang demikian kamu bersifat zalim)? Sesungguhnya Allah tidak memberi hidayat petunjuk kepada orang-orang yang zalim (yang degil dalam kekufurannya).",
                            "verse 46:11": "Dan (kerana sombong angkuhnya orang-orang kafir itu) mereka berkata tentang kepercayaan orang-orang yang beriman: Kalaulah (apa yang dibawa oleh Muhammad) itu perkara yang baik tentulah mereka tidak mendahului kami mempercayainya (kerana kamilah yang sepatutnya menerima segala kebaikan)! Dan setelah mereka tidak dapat menerima petunjuk Al-Quran itu, (mereka memusuhinya) lalu mereka mencacinya dengan berkata: Al-Quran ini ialah rekaan dusta yang sudah lama.",
                            "verse 46:12": "(Bagaimana mereka tergamak mengatakan Al-Quran ini rekaan dusta yang telah lama?) Pada hal telah ada sebelumnya Kitab Nabi Musa yang menjadi ikutan dan rahmat (kepada umatnya) dan Al-Quran pula sebuah Kitab yang mengesahkan kebenaran (kitab-kitab yang telah lalu), diturunkan dalam bahasa Arab untuk memberi amaran kepada orang-orang yang zalim dan berita gembira bagi orang-orang yang berbuat kebaikan.",
                            "verse 46:13": "Sesungguhnya orang-orang yang menegaskan keyakinannya dengan berkata: Tuhan kami ialah Allah, kemudian mereka tetap teguh di atas jalan yang betul (dengan pengakuan iman dan tauhidnya itu), maka tidak ada kebimbangan (dari sesuatu yang tidak baik) terhadap mereka dan mereka pula tidak akan berdukacita.",
                            "verse 46:14": "Merekalah ahli Syurga, tetap kekallah mereka di dalamnya, sebagai balasan bagi amal-amal soleh yang mereka telah kerjakan.",
                            "verse 46:15": "Dan Kami wajibkan manusia berbuat baik kepada kedua ibu bapanya; ibunya telah mengandungnya dengan menanggung susah payah dan telah melahirkannya dengan menanggung susah payah.",
                            "verse 46:16": "Mereka (yang bersifat dengan sifat-sifat yang terpuji seperti itu) ialah orang-orang yang Kami terima dari mereka amalnya yang baik yang mereka telah kerjakan dan Kami ampunkan kesalahan-kesalahannya; (mereka akan dimasukkan) dalam kumpulan ahli Syurga, sebagai memenuhi janji yang benar, yang telah dijanjikan kepada mereka.",
                            "verse 46:17": "Dan (sebaliknya amatlah derhakanya) orang yang berkata kepada kedua ibu bapanya (ketika mereka mengajaknya beriman): Ah! Bosan perasaanku terhadap kamu berdua! Patutkah kamu menjanjikan kepadaku bahawa aku akan dibangkitkan keluar dari kubur, padahal berbagai umat sebelumku telah berlalu (masih lagi belum kembali)? Sambil mendengar kata-katanya itu ibu bapanya merayu memohon pertolongan Allah (menyelamatkan anak mereka) serta berkata (kepada anaknya yang ingkar itu): Selamatkanlah dirimu! Berimanlah (tentang hidup semula menerima balasan amal)! Sesungguhnya janji Allah tetap benar.",
                            "verse 46:18": "Mereka (yang ingkar derhaka seperti itu) ialah orang-orang yang tetap menerima hukuman (azab) bersama-sama dengan umat-umat yang terdahulu daripada mereka dari kalangan jin dan manusia; kerana sesungguhnya mereka telah menyebabkan diri mereka menjadi orang-orang yang rugi.",
                            "verse 46:19": "Dan bagi mereka masing-masing (dari puak jin dan manusia yang berbuat baik dan yang berbuat jahat) disediakan berbagai peringkat (balasan) yang sesuai dengan apa yang mereka telah kerjakan dan (ketetapan yang demikian ialah) supaya Allah menyempurnakan bagi mereka balasan amal-amal mereka, sedang mereka tidak dirugikan (sedikitpun).",
                            "verse 46:20": "Dan (ingatlah), semasa orang-orang kafir didedahkan kepada Neraka (serta dikatakan kepada mereka): Kamu telah habiskan nikmat-nikmat kesenangan kamu dalam kehidupan dunia kamu dan kamu telah bersenang-senang menikmatinya; maka pada hari ini kamu dibalas dengan azab yang menghina kerana kamu berlaku sombong takbur di muka bumi dengan tidak berdasarkan alasan yang benar dan kerana kamu sentiasa berlaku fasik.",
                            "verse 46:21": "Dan ingatlah peristiwa (Nabi Hud) saudara kaum Aad, ketika dia memberi amaran kepada kaumnya yang tinggal di lembah \"Al-Ahqaaf\", sedang (amarannya itu samalah seperti) amaran-amaran yang telah diberikan oleh Rasul-rasul yang terdahulu daripadanya dan yang datang sesudahnya (dengan berkata): Janganlah kamu menyembah melainkan Allah, sesungguhnya aku bimbang kamu akan beroleh azab hari yang besar (huru-haranya).",
                            "verse 46:22": "Mereka menjawab: Adakah engkau datang kepada kami untuk memesongkan kami dari menyembah tuhan-tuhan kami? Maka bawalah azab seksa yang engkau janjikan kepada kami itu jika betul engkau dari orang-orang yang benar!",
                            "verse 46:23": "Nabi Hud berkata: Sesungguhnya ilmu pengetahuan (tentang kedatangan azab itu) hanya ada di sisi Allah dan (tugasku hanya) menyampaikan kepada kamu apa yang aku diutuskan membawanya, tetapi aku lihat kamu satu kaum yang jahil (akan tugas Rasul)!",
                            "verse 46:24": "Maka apabila mereka melihat azab itu sebagai awan yang menghala ke lembah-lembah mereka, mereka berkata: Ini ialah awan yang akan membawa hujan kepada kita! (Mendengarkan kata-kata yang demikian, Nabi Hud berkata): Tidak! Bahkan itulah (azab) yang kamu minta disegerakan kedatangannya, iaitu angin yang membawa azab seksa yang tidak terperi sakitnya;",
                            "verse 46:25": "Yang menghancur leburkan segala-galanya dengan izin Tuhannya.",
                            "verse 46:26": "Dan demi sesungguhnya! Kami telah meneguhkan kedudukan mereka (dengan kekuasaan dan kemewahan) yang tidak Kami berikan kamu menguasainya (wahai kaum musyrik Mekah) dan Kami telah jadikan bagi mereka pendengaran dan penglihatan serta hati; dalam pada itu, pendengaran dan penglihatan serta hati mereka tidak memberikan faedah sedikitpun kepada mereka, kerana mereka sentiasa mengingkari ayat-ayat keterangan Allah dan (dengan yang demikian) mereka diliputi oleh azab yang mereka telah ejek-ejek itu.",
                            "verse 46:27": "Dan demi sesungguhnya! Kami telah binasakan negeri-negeri yang ada di sekeliling (negeri) kamu (wahai kaum musyrik Mekah) dan Kami telah menerangkan tanda-tanda (kekuasaan Kami) dengan berbagai cara, supaya mereka kembali (bertaubat).",
                            "verse 46:28": "Maka sepatutnya mereka dibela oleh segala yang mereka sembah yang lain dari Allah sebagai penyembahan untuk mendekatkan diri (kepada Allah)? (Tetapi tidak), bahkan segala yang mereka sembah itu telah hilang lenyap dari mereka dan demikianlah akibat penyelewengan mereka dan kepercayaan yang mereka telah ada-adakan.",
                            "verse 46:29": "Dan (ingatkanlah peristiwa) semasa Kami menghalakan satu rombongan jin datang kepadamu (wahai Muhammad) untuk mendengar Al-Quran; setelah mereka menghadiri bacaannya, berkatalah (setengahnya kepada yang lain): Diamlah kamu dengan sebulat-bulat ingatan untuk mendengarnya! Kemudian setelah selesai bacaan itu, kembalilah mereka kepada kaumnya (menyiarkan ajaran Al-Quran itu dengan) memberi peringatan dan amaran.",
                            "verse 46:30": "Mereka berkata: Wahai kaum kami! Sesungguhnya kami telah mendengar Kitab (Al-Quran) yang diturunkan (oleh Allah) sesudah Nabi Musa, yang menegaskan kebenaran Kitab-kitab Suci yang terdahulu daripadanya, lagi, memandu kepada kebenaran (tauhid) dan ke jalan yang lurus (agama Islam)",
                            "verse 46:31": "Wahai kaum kami! Sahutlah (seruan) Rasul (Nabi Muhammad) yang mengajak ke jalan Allah, serta berimanlah kamu kepadanya, supaya Allah mengampunkan sebahagian dari dosa-dosa kamu dan menyelamatkan kamu dari azab seksa yang tidak terperi sakitnya.",
                            "verse 46:32": "Dan sesiapa tidak menyahut (seruan) Rasul yang mengajaknya ke jalan Allah, maka dia tidak akan dapat melepaskan diri (dari balasan azab walau ke mana sahaja dia melarikan diri) di bumi dan dia tidak akan beroleh sesiapapun yang lain dari Allah sebagai pelindung-pelindung yang membelanya; mereka (yang demikian sifatnya) adalah dalam kesesatan yang nyata.",
                            "verse 46:33": "Masihkah mereka ingkar dan tidak mahu memikir serta mengetahui bahawa sesungguhnya Allah yang telah menciptakan langit dan bumi dengan tidak mengalami kesukaran dalam menciptakannya berkuasa menghidupkan makhluk-makhluk yang telah mati? Sudah tentu berkuasa! Sesungguhnya Dia Maha Kuasa atas tiap-tiap sesuatu.",
                            "verse 46:34": "Dan (ingatlah) hari orang-orang yang kafir didedahkan kepada Neraka, (lalu dikatakan kepada mereka): Bukankah (azab) Neraka ini benar? Mereka menjawab: Ya, benar, demi Tuhan kami! (Setelah itu) dikatakan lagi (kepada mereka): Maka sekarang rasalah azab seksa dengan sebab kamu kufur ingkar di dunia dahulu.",
                            "verse 46:35": "(Jika demikian akibat orang-orang kafir yang menentangmu wahai Muhammad) maka bersabarlah engkau sebagaimana sabarnya Rasul-rasul \"Ulul Azmi\" (yang mempunyai keazaman dan ketabahan hati) dari kalangan Rasul-rasul (yang terdahulu daripadamu); dan janganlah engkau meminta disegerakan azab untuk mereka (yang menentangmu itu)."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "حم",
                            "verse 46:2": "اين كتاب از سوى خداوند عزيز و حكيم نازل شده است!",
                            "verse 46:3": "ما آسمانها و زمين و آنچه را در ميان اين دو است جز بحق و براى سرآمد معينى نيافريديم; اما كافران از آنچه انذار مى‏شوند روى گردانند!",
                            "verse 46:4": "به آنان بگو: «اين معبودهايى را كه غير از خدا پرستش مى‏كنيد به من نشان دهيد چه چيزى از زمين را آفريده‏اند، يا شركتى در آفرينش آسمانها دارند؟ كتابى آسمانى پيش از اين، يا اثر علمى از گذشتگان براى من بياوريد (كه دليل صدق گفتار شما باشد) اگر راست مى‏گوييد!»",
                            "verse 46:5": "چه كسى گمراهتر است از آن كس كه معبودى غير خدا را مى‏خواند كه تا قيامت هم به او پاسخ نمى‏گويد و از خواندن آنها (كاملا) بى‏خبر است؟! (و صداى آنها را هيچ نمى‏شنود!)",
                            "verse 46:6": "و هنگامى كه مردم محشور مى‏شوند، معبودهاى آنها دشمنانشان خواهند بود; حتى عبادت آنها را انكار مى‏كنند!",
                            "verse 46:7": "هنگامى كه آيات روشن ما بر آنان خوانده مى‏شود، كافران در برابر حقى كه براى آنها آمده مى‏گويند: «اين سحرى آشكار است!»",
                            "verse 46:8": "بلكه مى‏گويند: «اين آيات را بر خدا افترا بسته است!» بگو: «اگر من آن را بدروغ به خدا نسبت داده باشم (لازم است مرا رسوا كند و) شما نمى‏توانيد در برابر خداوند از من دفاع كنيد! او كارهايى را كه شما در آن وارد مى‏شويد بهتر مى‏داند; همين بس كه خداوند گواه ميان من و شما باشد; و او آمرزنده و مهربان است!»",
                            "verse 46:9": "بگو: «من پيامبر نوظهورى نيستم; و نمى‏دانم با من و شما چه خواهد شد; من تنها از آنچه بر من وحى مى‏شود پيروى مى‏كنم، و جز بيم‏دهنده آشكارى نيستم!»",
                            "verse 46:10": "بگو: «به من خبر دهيد اگر اين از سوى خدا باشد و شما به آن كافر شويد، در حالى كه شاهدى از بنى اسرائيل بر آن شهادت دهد، و او ايمان آورد و شما استكبار كنيد (چه كسى گمراهتر از شما خواهد بود)؟! خداوند گروه ستمگر را هدايت نمى‏كند!»",
                            "verse 46:11": "كافران درباره مؤمنان چنين گفتند: «اگر (اسلام) چيز خوبى بود، هرگز آنها (در پذيرش آن) بر ما پيشى نمى‏گرفتند!» و چون خودشان بوسيله آن هدايت نشدند مى‏گويند: «اين يك دروغ قديمى است!»",
                            "verse 46:12": "و پيش از آن، كتاب موسى كه پيشوا و رحمت بود (نشانه‏هاى آن را بيان كرده)، و اين كتاب هماهنگ با نشانه‏هاى تورات است در حالى كه به زبان عربى و فصيح و گوياست، تا ظالمان را بيم دهد و براى نيكوكاران بشارتى باشد!",
                            "verse 46:13": "كسانى كه گفتند: «پروردگار ما الله است‏»، سپس استقامت كردند، نه ترسى براى آنان است و نه اندوهگين مى‏شوند",
                            "verse 46:14": "آنها اهل بهشتند و جاودانه در آن مى‏مانند; اين پاداش اعمالى است كه انجام مى‏دادند",
                            "verse 46:15": "ما به انسان توصيه كرديم كه به پدر و مادرش نيكى كند، مادرش او را با ناراحتى حمل مى‏كند و با ناراحتى بر زمين مى‏گذارد; و دوران حمل و از شير بازگرفتنش سى ماه است; تا زمانى كه به كمال قدرت و رشد برسد و به چهل سالگى بالغ گردد مى‏گويد: «پروردگارا! مرا توفيق ده تا شكر نعمتى را كه به من و پدر و مادرم دادى بجا آورم و كار شايسته‏اى انجام دهم كه از آن خشنود باشى، و فرزندان مرا صالح گردان; من به سوى تو بازمى‏گردم و توبه مى‏كنم، و من از مسلمانانم!»",
                            "verse 46:16": "آنها كسانى هستند كه ما بهترين اعمالشان را قبول مى‏كنيم و از گناهانشان مى‏گذريم و در ميان بهشتيان جاى دارند; اين وعده راستى است كه وعده داده مى‏شدند",
                            "verse 46:17": "و كسى كه به پدر و مادرش مى‏گويد: «اف بر شما! آيا به من وعده مى‏دهيد كه من روز قيامت مبعوث مى‏شوم؟! در حالى كه پيش از من اقوام زيادى بودند (و هرگز مبعوث نشدند)! و آن دو پيوسته فرياد مى‏كشند و خدا را به يارى مى‏طلبند كه: واى بر تو، ايمان بياور كه وعده خدا حق است اما او پيوسته مى‏گويد:» اينها چيزى جز افسانه‏هاى پيشينيان نيست!",
                            "verse 46:18": "آنها كسانى هستند كه فرمان عذاب درباره آنان همراه اقوام (كافرى) كه پيش از آنان از جن و انس بودند مسلم شده، چرا كه همگى زيانكار بودند!",
                            "verse 46:19": "و براى هر كدام از آنها درجاتى است بر طبق اعمالى كه انجام داده‏اند، تا خداوند كارهايشان را بى‏كم و كاست به آنان تحويل دهد; و به آنها هيچ ستمى نخواهد شد!",
                            "verse 46:20": "آن روز كه كافران را بر آتش عرضه مى‏كنند (به آنها گفته مى‏شود:) از طيبات و لذائذ در زندگى دنيا خود استفاده كرديد و از آن بهره گرفتيد; اما امروز عذاب ذلت‏بار بخاطر استكبارى كه در زمين بناحق كرديد و بخاطر گناهانى كه انجام مى‏داديد; جزاى شما خواهد بود!",
                            "verse 46:21": "(سرگذشت هود) برادر قوم عاد را ياد كن، آن زمان كه قومش را در سرزمين «احقاف‏» بيم داد در حالى كه پيامبران زيادى قبل از او در گذشته‏هاى دور و نزديك آمده بودند كه: جز خداى يگانه را نپرستيد! (و گفت:) من بر شما از عذاب روزى بزرگ مى‏ترسم!",
                            "verse 46:22": "آنها گفتند: «آيا آمده‏اى كه ما را (با دروغهايت) از معبودانمان بازگردانى؟! اگر راست مى‏گويى عذابى را كه به ما وعده مى‏دهى بياور!»",
                            "verse 46:23": "گفت: «علم (آن) تنها نزد خداست (و او مى‏داند چه زمانى شما را مجازات كند); من آنچه را به آن فرستاده شده‏ام به شما مى‏رسانم، (وظيفه من همين است!) ولى شما را قومى مى‏بينيم كه پيوسته در نادانى هستيد!»",
                            "verse 46:24": "هنگامى كه آن (عذاب الهى) را بصورت ابر گسترده‏اى ديدند كه بسوى دره‏ها و آبگيرهاى آنان در حركت است (خوشحال شدند) گفتند: «اين ابرى است كه بر ما مى‏بارد!» (ولى به آنها گفته شد:) اين همان چيزى است كه براى آمدنش شتاب مى‏كرديد، تندبادى است (وحشتناك) كه عذاب دردناكى در آن است!",
                            "verse 46:25": "همه چيز را بفرمان پروردگارش در هم ميكوبد و نابود ميكند (آرى) آنها صبح كردند در حالى كه چيزى جز خانه‏هايشان به چشم نمى‏خورد; ما اين‏گونه گروه مجرمان را كيفر مى‏دهيم!",
                            "verse 46:26": "ما به آنها ( قوم عاد) قدرتى داديم كه به شما نداديم، و براى آنان گوش و چشم و دل قرار داديم; (اما به هنگام نزول عذاب) نه گوشها و چشمها و نه عقلهايشان براى آنان هيچ سودى نداشت، چرا كه آيات خدا را انكار مى‏كردند; و سرانجام آنچه را استهزا مى‏كردند بر آنها وارد شد!",
                            "verse 46:27": "ما آباديهايى را كه پيرامون شما بودند نابود ساختيم، و آيات خود را بصورتهاى گوناگون (براى مردم آنها) بيان كرديم شايد بازگردند!",
                            "verse 46:28": "پس چرا معبودانى را كه غير از خدا برگزيدند -به گمان اينكه به خدا نزديكشان سازد- آنها را يارى نكردند؟! بلكه از ميانشان گم شدند! اين بود نتيجه دروغ آنها و آنچه افترا مى‏بستند!",
                            "verse 46:29": "(به ياد آور) هنگامى كه گروهى از جن را به سوى تو متوجه ساختيم كه را بشنوند; وقتى حضور يافتند به يكديگر گفتند: «خاموش باشيد و بشنويد!» و هنگامى كه پايان گرفت، به سوى قوم خود بازگشتند و آنها را بيم دادند!",
                            "verse 46:30": "گفتند: «اى قوم ما! ما كتابى را شنيديم كه بعد از موسى نازل شده، هماهنگ با نشانه‏هاى كتابهاى پيش از آن، كه به سوى حق و راه راست هدايت مى‏كند",
                            "verse 46:31": "اى قوم ما! دعوت كننده الهى را اجابت كنيد و به او ايمان آوريد تا گناهانتان را ببخشد و شما را از عذابى دردناك پناه دهد!",
                            "verse 46:32": "و هر كس به دعوت كننده الهى پاسخ نگويد، هرگز نمى‏تواند از چنگال عذاب الهى در زمين فرار كند، و غير از خدا يار و ياورى براى او نيست; چنين كسانى در گمراهى آشكارند!»",
                            "verse 46:33": "آيا آنها نمى‏دانند خداوندى كه آسمانها و زمين را آفريده و از آفرينش آنها ناتوان نشده است، مى‏تواند مردگان را زنده كند؟! آرى او بر هر چيز تواناست!",
                            "verse 46:34": "روزى را به ياد آور كه كافران را بر آتش عرضه مى‏دارند (و به آنها گفته مى‏شود:) آيا اين حق نيست؟! مى‏گويند: «آرى، به پروردگارمان سوگند (كه حق است)!» (در اين هنگام خداوند) مى‏گويد: «پس عذاب را بخاطر كفرتان بچشيد!»",
                            "verse 46:35": "پس صبر كن آن‏گونه كه پيامبران «اولو العزم‏» صبر كردند، و براى (عذاب) آنان شتاب مكن! هنگامى كه وعده‏هايى را كه به آنها داده مى‏شود ببينند، احساس مى‏كنند كه گويى فقط ساعتى از يك روز (در دنيا) توقف داشتند; اين ابلاغى است براى همگان; آيا جز قوم فاسق هلاك مى‏شوند؟!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Ha, Mim.",
                            "verse 46:2": "A revelação do Livro é de Deus, o Poderoso, o Prudentíssimo.",
                            "verse 46:3": "Não criamos os céus e a terra e tudo quanto existe entre ambos, senão com prudência, para um término prefixado.",
                            "verse 46:4": "Dize-lhes: Porventura, tendes reparado nos que invocais, em lugar de Deus? Mostrai-me o que têm criado na terra! Têm participado, acaso, (da criação) dos céus? Apresentai-me um livro, revelado antes destes, ou um vestígio de ciência, se estiverdes certos.",
                            "verse 46:5": "Porém, haverá alguém mais extraviado do que quem invoca, em vez de Deus, os que jamais o atenderão, nem mesmo no Dia da Ressurreição, uma vez que estão desatentos à sua própria invocação?",
                            "verse 46:6": "E quando os humanos forem congregados, serão (os invocados) seus inimigos e negarão a sua adoração.",
                            "verse 46:7": "E, quando lhes são recitados os Nossos lúcidos versículos, os incrédulos dizem, da verdade que lhes chega: Isto é pura magia!",
                            "verse 46:8": "Ou dizem: Ele o forjou! Dize-lhes: Se o forjei, nada podereis obter de Deus para mim.",
                            "verse 46:9": "Dize-lhes (mais): Não sou um inovador entre os mensageiros, nem sei o que será de mim ou de vós.",
                            "verse 46:10": "Dize: Vede! Se (o Alcorão) emana de Deus e vós o negais, e mesmo um israelita confirma a sua autenticidade e nele crê, vós vos ensoberbeceis! Sabei que Deus não ilumina os iníquos!",
                            "verse 46:11": "E os incrédulos dizem aos fiéis: Se esta mensagem fosse uma boa coisa, (tais humanos) não se teriam antecipado a nós.",
                            "verse 46:12": "Porém, antes deste, já existia o Livro de Moisés, o qual era guia e misericórdia.",
                            "verse 46:13": "Aqueles que dizem: Nosso Senhos é Deus, e permanecem firmes, não pensa por quanto houverem feito.",
                            "verse 46:14": "Estes serão os diletos, do Paraíso, onde morarão eternamente, em recompensa por quanto houverem feito.",
                            "verse 46:15": "E recomendamos ao homem benevolência para com os seus pais.",
                            "verse 46:16": "Tais são aqueles dos quais aceitamos o melhor do que têm feito, e lhes absolvemos as faltas, (contando-os) entre os diletos do Paraíso, porque é uma promessa verídica, que lhes foi anunciada.",
                            "verse 46:17": "E há quem diga aos seus pais: Que vergonha para ambos! Pretendeis, porventura, prometer-me que serei ressuscitado, sendo que gerações anteriores a mim têm passado (sem renascer outra vez)? E ambos interpelarão Deus, (e reprovarão o filho): Ai de ti! Crê, porque a promessa de Deus é infalível! Porém, ele lhes diz: Estas não são senão fábulas dos primitivos!",
                            "verse 46:18": "Tais são aqueles que mereceram a sentença, juntamente com os seus antepassados, gerações de gênios e humanos, porque foram desventurados.",
                            "verse 46:19": "E para todos haverá graus, segundo o que fizeram, para que Ele lhes pague pelas suas recompensas, e para que não sejam defraudados.",
                            "verse 46:20": "E no dia em que os incrédulos forem colocados perante o fogo, (ser-lhes-á dito): Aproveitastes e gozastes os vossos deleites na vida terrena! Hoje, porém, sereis retribuídos com o afrontoso castigo por vosso ensoberbecimento e depravação na terra.",
                            "verse 46:21": "Menciona-lhes o irmão de Ad (Hud), que admoestou o seu povo nas dunas, embora já tivesse havido admoestadores antes e depois dele (que lhes disseram): Nada adoreis além de Deus, porque temo por vós o castigo do dia aziago.",
                            "verse 46:22": "Disseram-lhe: Vieste, acaso, para desviar-nos das nossas divindades? Se és um dos verazes, envia-nos a calamidade com que nos ameaças!",
                            "verse 46:23": "Respondeu-lhes: O conhecimento (disso) só está nas mãos de Deus! Eu vos proclamo a missão que me tem sido encomendada; porém, vejo que sois um povo insipiente!",
                            "verse 46:24": "Mas quando viram aquilo (o castigo), como nuvens, avançando sobre os seus vales, disseram: Esta é uma nuvem de chuva! Retrucou-lhes: Qual! É a (calamidade) que desejastes fosse apressada; um vento que encerra um doloroso castigo!",
                            "verse 46:25": "Arrasará tudo, segundo os desígnios do seu Senhor! E, ao amanhecer, nada se via, além (das ruínas) dos seus lares.",
                            "verse 46:26": "Em verdade, estabelecemo-los naquilo que não vos estabelecemos (ó coraixitas).",
                            "verse 46:27": "(Ó maquenses) Destruímos as cidades que vos rodeavam, e lhes diversificamos os sinais, para que se convertessem.",
                            "verse 46:28": "Por que, então, não os socorreram as divindades que haviam adotado, além de Deus, para aproximá-los d’Ele? Qual! Eles se extraviaram, mas tamanha foi a sua falsidade e a sua invenção.",
                            "verse 46:29": "Recorda-te de quando te enviamos um grupo de gênios, para escutar o Alcorão.",
                            "verse 46:30": "Disseram: Ó povo nosso, em verdade escutamos a leitura de um Livro, que foi revelado depois do de Moisés, corroborante dos anteriores, que conduz o homem à verdade e ao caminho reto.",
                            "verse 46:31": "Ó povo nosso, obedecei ao predicador de Deus e crede nele, pois (Deus) vos absolverá as faltas e vos livrará de um doloroso castigo.",
                            "verse 46:32": "Quanto àqueles que não atenderem ao predicador de Deus, saibam que na terra não poderão frustar (os desígnios de Deus), nem encontrarão protetores, em vez d’Ele.",
                            "verse 46:33": "Não reparam, acaso, em que Deus, que criou os céus e a terra sem Se esforçar, é capaz de ressuscitar os mortos? Sim! Porque é Onipotente.",
                            "verse 46:34": "E no dia em que os incrédulos forem colocados perante o fogo (ser-lhes-á dito): Acaso, não é isto Verdade? Responderão: Sim, por nosso Senhor!",
                            "verse 46:35": "Persevera, pois, como o fizeram os inflexíveis, entre os mensageiros, e que foram ameaçados, pensarão não haver permanecido (no mundo terreno) mais do que uma hora de um só dia."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 46:1": "Ha’, Mim.",
                            "verse 46:2": "Revelarea Cãrții este de la Allah Cel Puternic",
                            "verse 46:3": "Înțelept [Al-’Aziz, Al-Hakim].",
                            "verse 46:4": "Noi nu am creat cerurile și pãmântul și cele care se aflã între eledecât întru adevãr și",
                            "verse 46:5": "un termen hotãrât.",
                            "verse 46:6": "Spune: “Ce credeți voi despre acelea pe care le chemați în locul lui Allah? Arãtați-mi ce au creat ei pe pãmânt! Sau au ei vreo parte[alãturi de Allah] la ceruri? Aduceți-mi mie o carte de dinaintea",
                            "verse 46:7": "Și cine este mai rãtãcit decât acela care invocã în locul lui Allah pe cineva care nu-i va rãspunde lui pânã în Ziua Învierii, cãci ei nu bagã în seamã chemarea acestora!",
                            "verse 46:8": "Iar când oamenii vor fi adunați [pentru judecatã], ei le vor fi dușmani și vor tãgãdui adorația lor .",
                            "verse 46:9": "Și când li se recitã lor versetele Noastre cele limpezi, zic aceia carenu cred despre Adevãr, când vine la ei: “Aceasta este vrãjitorielimpede!”",
                            "verse 46:10": "Sau zic ei: “El l-a plãsmuit!” Spune: “Dacã l-am plãsmuit, atunci voi nu aveți nici o putere pentru mine împotriva",
                            "verse 46:11": "lui Allah! Însã El știe prea bine ceea ce vorbiți voi împotriva lu",
                            "verse 46:12": "Spune: “Eu nu sunt nou între trimiși și nu știu ce se va face cu mineși nici cu voi .",
                            "verse 46:13": "Spune: “Ce ziceți voi, dacã [se adeverește cã el] este de laAllah și voi îl tãgãduiți, în vreme ce un martor dintre fiii lui Israel face mãrturie cã este deopotrivã cu",
                            "verse 46:14": "Și cei care nu cred spun cãtre cei care cred: “De ar fi fost el bun,nu ne-ar fi luat-o ei înainte cu aceasta!” Și cum nu se vor lãsacãlãuziți de el , vor zice ei: “Aceasta este o minciunã vec",
                            "verse 46:15": "Însã mai înainte de el a fost Cartea lui Moise, ca îndreptar și caîndurare, iar aceasta este o Carte care întãrește, în limba arabã, pentru a-i preveni pe aceia care au fost nedrepți și ca bun&ati",
                            "verse 46:16": "Aceia care spun “Domnul nostru este Allah!” și urmeazã calea cea dreaptã nu au a se teme și nici nu vor fi ei mâhniți.",
                            "verse 46:17": "Aceia vor fi oaspeții Raiului, veșnic sãlãșluitori în el, ca rãsplatã pentru ceea ce au sãvârșit.",
                            "verse 46:18": "Noi i-am poruncit omului sã le arate bunãtate pãrinților sãi.",
                            "verse 46:19": "Aceștia sunt aceia de la care primim [faptele lor] cele bune pe care le-au împlinit și peste ale cãror fapte rele Noi trecem .",
                            "verse 46:20": "Dar [este și] acela care zice cãtre pãrinții sãi: “Uff și voi! Îmifãgãduiți cã voi fi scos [din mormânt la viațã], dupã ce au trecut",
                            "verse 46:21": "Aceștia sunt aceia cãrora li s-a cuvenit cuvântul",
                            "verse 46:22": "dintre neamurile de djinni și de oameni care au trecut mai înainte de ei cã ei vor fi pierduți!",
                            "verse 46:23": "Și pentru fiecare sunt trepte, dupã cele pe care le-au sãvârșit, pentru ca",
                            "verse 46:24": "sã-i rãsplãteascã pe ei dupã faptele lor; și ei nu vorfi nedreptãțiți.",
                            "verse 46:25": "Și în Ziua când aceia care nu au crezut vor fi dați Focului, [li se vazice lor]: “Voi ați risipit lucrurile voastre bune în viața cea pãmân- teascã și v-ați bucurat pe deplin de ele! Astãz",
                            "verse 46:26": "Adu-ți aminte de fratele lui ’Ad , când a prevenit el pe neamul sãu din Al-’Ahqaf - și au trecut prevenitori și mai înainte de el și dupãel - :",
                            "verse 46:27": "“Adorați-L voi numai pe Allah! Eu mã tem pentru voi de",
                            "verse 46:28": "Au zis ei: “Ai venit la noi ca sã ne depãrtezi de la zeii noștri? Adu-ne nouã cele cu care ne ameninți , dacã ești tu dintre aceia care grãiesc adevãr!”",
                            "verse 46:29": "Le-a zis: “Dar știința se aflã numai la Allah .",
                            "verse 46:30": "Și când au vãzut un nor, venind cãtre vãile lor, au zis ei: “Acestaeste un nor care ne va da ploaie!” “Ba nu! El este ceea ce ați cerut voi sã vinã mai degrabã : un vânt în care se aflã osând&at",
                            "verse 46:31": "Care nimicește totul, la porunca Domnului sãu!“ Și în dimineața",
                            "verse 46:32": "nu s-au mai vãzut decât sãlașurile lor.",
                            "verse 46:33": "Și i-am întãrit Noi pe ei cu ceea ce nu v-am întãrit pe voi .",
                            "verse 46:34": "Noi am nimicit cetãțile din jurul vostru și am tâlcuit semnele în fel și chip, în nãdejdea cã ei se vor întoarce .",
                            "verse 46:35": "De ce nu i-au ajutat pe ei aceia pe care i-au luat ei, în locul lui Allah, ca zei ca sã-i apropie .",
                            "verse 46:36": "Și [adu-ți aminte] când am abãtut Noi cãtre tine o ceatã dedjinni ca sã asculte Coranul .",
                            "verse 46:37": "Și au zis ei: “O, neam al nostru! Noi am auzit o Carte, care a fosttrimisã dupã Moise, întãrind ceea ce a fost înainte de ea.",
                            "verse 46:38": "O, neam al nostru! Rãspundeți celui care cheamã la Allah și credeți în El, cãci El vã va ierta din pãcatele voastre și vã va apãra pe voi de o osândã dureroasã!”",
                            "verse 46:39": "Acela care nu va rãspunde celui care cheamã la Allah nu va scãpa de puterea [lui Allah] pe pãmânt și nu va avea ocrotitori în locul Lui .",
                            "verse 46:40": "Oare nu vãd ei cã Allah care a creat cerurile și pãmântul și nu afost neputincios la facerea lor este în stare sã-i aducã la viațã pe morți? Ba da, El este cu putere peste toate!",
                            "verse 46:41": "Și în Ziua când vor fi aduși la Foc aceia care nu au crezut, [li se vazice lor]: “Oare nu este acesta adevãrul?” Vor zice ei: “Ba da, peDomnul nostru!” Va zice: “Gustați chinul pentru ceea ce ați tãgã",
                            "verse 46:42": "Deci rabdã, așa cum au rãbdat cei statornici dintre trimiși și nu cere sã vinã degrabã asupra lor ! Și în Ziua când vor vedea ce li se promite , atunci li se va pãrea cã nu au rã tãgã"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 46:1": "Ha.",
                            "verse 46:2": "Pogorârea Cărţii este de la Dumnezeu, Puternicul, Înţeleptul.",
                            "verse 46:3": "Noi nu am creat cerurile şi pământul, precum şi ceea ce se află între ele, decât întru Adevăr şi cu un anumit soroc, însă cei care tăgăduiesc cele asupra cărora sunt preveniţi întorc spatele.",
                            "verse 46:4": "Spune: “I-aţi văzut pe cei pe care îi chemaţi în locul lui Dumnezeu?! Arătaţi-mi ce au creat pe pământ ori s-au alăturat ei oare la crearea cerurilor? Aduceţi-mi o Carte dinaintea acesteia ori o urmă de ştiinţă, dacă spuneţi adevărul.",
                            "verse 46:5": "Cine sunt mai rătăciţi decât cei care îi cheamă pe alţii în locul lui Dumnezeu, care nici măcar nu le răspund până în Ziua Învierii rămânând nepăsători la chemările lor?",
                            "verse 46:6": "Când oamenii vor fi adunaţi, ei le vor fi vrăjmaşi şi vor tăgădui închinarea către ei!",
                            "verse 46:7": "Când li se citesc versetele Noastre ca dovezi vădite, cei care tăgăduiesc spun despre Adevăr când vine la ei: “Acestea sunt o vrajă vădită!”",
                            "verse 46:8": "Ori spun: “El le-a născocit!” Spune: “Dacă le-am născocit eu, voi nu mă veţi oblădui înaintea lui Dumnezeu.",
                            "verse 46:9": "Spune: “Eu nu sunt o noutate printre trimişi.",
                            "verse 46:10": "Spune: “Vedeţi că este de la Dumnezeu, iar voi nu credeţi! Un martor dintre fiii lui Israel a mărturisit însă că este asemenea cu ceea ce au ei şi că el crede, pe când voi vă îngâmfaţi.",
                            "verse 46:11": "Cei care tăgăduiesc spuseră celor care cred: “Dacă ar fi fost un bine, nu ne-ar fi luat-o nimeni înainte.",
                            "verse 46:12": "Înaintea ei, Cartea lui Moise a fost călăuză şi milostivenie, iar aceasta este o Carte adeveritoare, în limba arabă, ca să-i prevină pe cei nedrepţi şi să-i binevestească pe cei făcători de bine.",
                            "verse 46:13": "Cei care spun: “Domnul nostru este Dumnezeu!” şi merg drept, nu vor cunoaşte nici teamă şi nici tristeţe.",
                            "verse 46:14": "Aceştia sunt soţii Raiului, unde vor veşnici ca răsplată a ceea ce au făptuit.",
                            "verse 46:15": "Noi i-am poruncit omului bunătate pentru părinţii săi, căci mama sa l-a purtat în chinuri şi l-a născut în chinuri.",
                            "verse 46:16": "Aceştia sunt cei cărora le primim cele mai bune fapte şi trecem peste faptele lor rele.",
                            "verse 46:17": "Altul spune însă părinţilor săi: “Ptiu vouă! Îmi făgăduiţi că voi fi scos când leaturi au dispărut înaintea mea? Amândoi vor cere atunci ajutorul lui Dumnezeu: “Vai ţie! Crede!.",
                            "verse 46:18": "Aceştia sunt cei asupra cărora Cuvântul se va împlini, precum s-a împlinit asupra adunărilor de ginni şi oameni ce au dispărut înaintea lor.",
                            "verse 46:19": "Toţi vor avea trepte pentru ceea ce au făptuit.",
                            "verse 46:20": "În Ziua când cei care tăgăduiesc vor fi înfăţişaţi Focului, li se va spune: “Voi aţi risipit bunurile voastre în Viaţa de Acum şi v-aţi bucurat de ele vremelnic.",
                            "verse 46:21": "Aminteşte-ţi de fratele adiţilor când l-a prevenit — cei care au prevenit au fost şi înaintea lui şi după el — pe poporul său din Al-Ahqaf: “Nu vă închinaţi decât lui Dumnezeu! Mă tem pentru voi de osânda unei Zile cumplite.",
                            "verse 46:22": "Ei spuseră: “Ai venit la noi ca să ne întorci de la zeii noştri? Adu-ne-o pe cea cu care ne amininţi, dacă spui adevărul!”",
                            "verse 46:23": "El spuse: “Ştiinţa este numai la Dumnezeu.",
                            "verse 46:24": "Când ei văzură un nor venind către văile lor spuseră: “Acesta este un nor ce ne va ploua!” Ba nu! Cel căruia voi îi cereţi venirea degrabă este un vânt cu o osândă dureroasă",
                            "verse 46:25": "care va stârpi totul din porunca Domnului său.",
                            "verse 46:26": "Noi le-am dăruit aceleaşi putinţe pe care vi le-am dăruit şi vouă.",
                            "verse 46:27": "Noi am nimicit cetăţile din jurul vostru.",
                            "verse 46:28": "Dacă i-ar fi ajutat cei pe care i-au luat în afara lui Dumnezeu, ca apropiaţi şi dumnezei, însă ei i-au părăsit! Aceasta este prefăcătoria lor şi ceea ce au născocit!",
                            "verse 46:29": "Am întors la tine o ceată de ginni ca să asculte Coranul şi când se înfăţişară spuseră: “Tăceţi!” Şi după ce se sfârşi, se întoarseră la poporul lor ca să-l predice.",
                            "verse 46:30": "Ei spuseră: “O, popor al nostru! Noi am auzit o Carte care a fost pogorâtă după Moise, întărind pe cele dinaintea ei, şi care călăuzeşte către Adevăr şi către un Drum Drept.",
                            "verse 46:31": "O, popor al nostru! Răspundeţi vestitorului lui Dumnezeu! Credeţi în El, căci El vă va ierta vouă din păcatele voastre şi vă va feri de la o dureroasă osândă.",
                            "verse 46:32": "Cel care nu răspunde vestitorului lui Dumnezeu nu-L va slăbi pe pământ şi nu va avea în afara Lui oblăduitori.",
                            "verse 46:33": "Nu văd ei oare că Dumnezeu care a creat cerurile şi pământul, şi nu a obosit la crearea lor, are puterea să învie morţii.",
                            "verse 46:34": "În Ziua când cei care tăgăduiesc vor fi înfăţişaţi Focului: “Nu acesta este Adevărul?” Ei vor spune: “Ba da, pe Domnul nostru!” El le va spune: “Gustaţi osânda a ceea ce tăgăduiaţi!”",
                            "verse 46:35": "Rabdă, precum au răbdat acei trimişi de neclintit! Nu cere grăbirea pentru ei, căci în Ziua când o vor vedea pe cea cu care au fost ameninţaţi, li se va părea că n-au stat decât un ceas dintr-o zi."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Ха– — Ми–м.",
                            "verse 46:2": "Исходит откровение сей КнигиОт Аллаха,Кто мудр и могуч!",
                            "verse 46:3": "Мы сотворили небеса и землю,А также все, что между ними,Чтобы явить вам Истину Свою;(И сотворили их) на срокопределенный.",
                            "verse 46:4": "Скажи: «Как мыслите вы тех,Кого вы призываете, опричь Аллаха?Вы покажите мне:Что из того, что на земле, онисоздали?Иль есть у них на небе своя доля(участия в делах небесных)?Иль принесите Книгу мне,Ниспосланную ранее, чем эта2123а.",
                            "verse 46:5": "Кто в большем заблуждении, чем тот,Кто призывает с Богом наравнеТаких, которые им не ответятИ безразличны к их призывамДо Дня их воскресения (на Суд)?",
                            "verse 46:6": "И вот когда весь род людской(На Суд Господень) будет собран,Они им явятся врагамиИ их служение отвергнут2124.",
                            "verse 46:7": "Когда им Наши ясные знамениячитают,То говорят неверные об истине,которая приходит к ним:«Сие — лишь колдовство2125,и только».",
                            "verse 46:8": "Иль они скажут:«Он его2126 измыслил?»Скажи: «Если измыслил я его,То для меня от ГосподаВы ни над чем не властны2127,Он лучше знает то,О чем вы так речисто говорите.",
                            "verse 46:9": "Среди посланников ГосподнихЯ — не носитель новоявленного(Слова).",
                            "verse 46:10": "Скажи: «Подумали ли вы,Что если он2128 исходит от Аллаха,А вы им все ж пренебрегли, —Хоть из сынов Исраиля свидетельесть2129,Кто утверждает о ему подобномИ потому уверовал в него, —А вы ж возноситесь гордыней передним?»Аллах, поистине, прямым путемЛюдей несправедливых не направит.",
                            "verse 46:11": "И говорят неверные о тех, которыеуверовали (в Бога):«Если б он был (действительно)хорош,То раньше нас они к нему быне пришли»2130,И, не увидев в нем стезю прямую,Говорят: «Лишь давний вымысел всеэто!»",
                            "verse 46:12": "Ему предшествовала Книга МусыКак руководство и как милость(Наша к ним2131),И утверждает эта Книга правдуна арабском,Чтобы неправедных предостеречьИ благовествовать добротворящим.",
                            "verse 46:13": "Поистине, все те, кто говорит:«Владыка наш — Аллах!» —И с твердостью стоит на этом, —На них не ляжет страх,Печаль не отягчит.",
                            "verse 46:14": "Им — быть обитателями РаяИ в нем навечно оставатьсяКак воздаяние за то, что делали они.",
                            "verse 46:15": "Мы завещали человекуДобротворить к родителям своим.",
                            "verse 46:16": "Вот от таких людейМы примем лучшее из их деянийИ обойдем дурное стороной.",
                            "verse 46:17": "Но говорит иной родителям своим:«Да пфу на вас! Неужто обещаете вымне,Что (из могилы) буду я изведен?Ведь канули (в века) те поколения,что были до меня,(И не были воскрешены никем)!»И они оба воззовут за помощьюк Аллаху:«О, горе же тебе! Уверуй (в Бога)!Ведь истинно Господне обещанье».",
                            "verse 46:18": "И это — те, над коими свершилось(Господне) Слово о народах, бывшихпрежде,Из джиннов и людей.",
                            "verse 46:19": "У каждого есть степени (оценки)Тех дел, которые они свершили,Чтобы (Господь мог) полностьювоздать за их дела, —И им не нанесут обиднесправедливых.",
                            "verse 46:20": "И в День,Когда неверные предстанутпред Огнем,(Им прозвучит):«Вы расточали свои блага в ближнейжизни,И ими насладились вы сполна.",
                            "verse 46:21": "И вспомните о брате из народа А–д2132.",
                            "verse 46:22": "Они сказали:«Неужели ты пришел,Чтоб отвратить нас от богов,которых почитаем?Тогда ты принеси нам то,Что ты (угрозами своими) обещаешь,Коль ты в словах своих правдив».",
                            "verse 46:23": "Сказал он:«Лишь в ведении Бога то,(Что Им обещано к свершенью).",
                            "verse 46:24": "И вот когда увидели ониПересекающую небо (грозовую)тучу2134,Они сказали:«Это — туча, которая прольется намдождем».",
                            "verse 46:25": "(И на пути своем) он все погубитПо повелению Владыки своего».",
                            "verse 46:26": "Мы утвердили их (во благе и)у власти,Которую Мы вам2135 не дали,И обеспечили их слухом, зрениеми сердцем2136,Но ни к чему не послужили имНи слух, ни зрение, ни сердце,Так как они отвергли все знаменияАллаха;И поразило их со всех сторон,Над чем они в сей жизнинасмехались.",
                            "verse 46:27": "Мы погубили города, что окружали вас,И Мы Свои знамения явили всюду,Чтобы они могли к Нам обратиться.",
                            "verse 46:28": "Так почему ж на помощь не пришлик ним те,Кого они богами взяли?Как средство приближения(к Аллаху)2137Они (их предали и) отошли от них, —Вот в этом и была их ложьИ то, что (для себя) измыслили они.",
                            "verse 46:29": "И вот Мы джиннов2138 сонм направилик тебе,Чтобы они послушали Коран.",
                            "verse 46:30": "Они сказали:«О наш народ! Мы Книгу слушалисейчас,Ниспосланную после МусыДля утверждения того, что былодо нее;Ведет к (Господней) Истине онаИ (направляет) верною стезею.",
                            "verse 46:31": "О наш народ! Вы слушайте зовущеговас к Богу.",
                            "verse 46:32": "А кто зовущему (к Аллаху) не ответит,Тот на земле не в силах избежать(Его)2139,Нет покровителей ему, кроме Аллаха,Такие — в явном заблужденье.",
                            "verse 46:33": "Ужель они не видят, что Аллах,Кто небеса и землю сотворилИ не ослаб в Творенье этом,Способен мертвых оживить?О да! Поистине, Он всемогущ надвсем и вся!",
                            "verse 46:34": "И в День,Когда неверные предстанутпред Огнем,(Им прозвучит):«Не истина ли это?»Они ответят:«О да! Мы нашим Господом клянемся!»И скажет он, (распорядитель Ада):«Тогда вкусите наказание за то,Что не уверовали вы».",
                            "verse 46:35": "Так будь же терпеливо-стоек,(Мухаммад!),Какими были обладатели великоймощиИз (всех) посланников(Господних)2140."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "hm.",
                            "verse 46:2": "La revelación de la Escritura procede de Alá, el Poderoso, el Sabio.",
                            "verse 46:3": "No hemos creado sino con un fin los cielos, la tierra y lo que entre ellos está, y por un período determinado.",
                            "verse 46:4": "Di: «¿Qué os parece lo que invocáis en lugar de invocar a Alá? ¡Mostradme qué han creado de la tierra o si tienen participación en los cielos! Si es verdad lo que decís, ¡traedme una Escritura anterior a ésta o un rastro de conocimiento!»",
                            "verse 46:5": "¿Hay alguien que esté más extraviado que quien, en lugar de invocar a Alá, invoca a quienes no van a escucharle hasta el día de la Resurrección, indiferentes a sus invocaciones,",
                            "verse 46:6": "que, cuando los hombres sean congregados, serán sus enemigos y renegarán de que les hayan servido?",
                            "verse 46:7": "Cuando se les recitan a los infieles Nuestras aleyas como pruebas claras, dicen de la Verdad que viene a ellos: «¡Esto es manifiesta magia!»",
                            "verse 46:8": "O dicen: «Él lo ha inventado».",
                            "verse 46:9": "Di: «Yo no soy el primero de los enviados.",
                            "verse 46:10": "Di: «¿Qué os parece? Si procede de Alá y vosotros no creéis en él, mientras que un testigo de entre los Hijos de Israel atestigua su conformidad y cree, en tanto que vosotros sois altivos.",
                            "verse 46:11": "Los infieles dicen de los creyentes: «Si hubiera sido algo bueno, no se nos habrían adelantado en ello».",
                            "verse 46:12": "Antes de él, la Escritura de Moisés servía de guía y de misericordia.",
                            "verse 46:13": "Quienes dicen: «¡Nuestro Señor es Alá!» y se portan correctamente no tienen que temer y no estarán tristes.",
                            "verse 46:14": "Esos tales morarán en el Jardín eternamente, como retribución a sus obras.",
                            "verse 46:15": "Hemos ordenado al hombre que se porte bien con sus padres.",
                            "verse 46:16": "Éstos son aquéllos de cuyas obras aceptaremos lo mejor y pasaremos por alto sus malas obras.",
                            "verse 46:17": "En cambio, quien diga a sus padres -mientras éstos imploran a Alá y dicen: «¡Ay de ti! ¡Cree! ¡Lo que Alá promete es verdad!»-: «¡Uf! ¿Vais a prometerme que me sacarán, cuando han pasado tantas generaciones anteriores a mí?» y diga: «Éstas no son sino patrañas de los antiguos»,",
                            "verse 46:18": "en ésos será en quienes se cumpla la sentencia aplicada a las comunidades precedentes de genios y de mortales.",
                            "verse 46:19": "Todos tendrán su propia categoría, según sus obras.",
                            "verse 46:20": "El día que los infieles sean expuestos al Fuego: «Disipasteis vuestros bienes en vuestra vida de acá y gozasteis de ellos.",
                            "verse 46:21": "Y recuerda al hermano de los aditas, que advirtió a su pueblo en al- Ahqaf -y hubo otras advertencias antes y después de él-.",
                            "verse 46:22": "Dijeron: «¿Has venido a nosotros para desviarnos de nuestros dioses? ¡Tráenos, pues, aquello con que nos amenazas, si es verdad lo que dices!»",
                            "verse 46:23": "Dijo: «Sólo Alá tiene conocimiento de ello.",
                            "verse 46:24": "Cuando lo vieron como una nube que se dirigía a sus valles, dijeron: «Es una nube que nos trae la lluvia».",
                            "verse 46:25": "que va a destruirlo todo a una orden de su Señor».",
                            "verse 46:26": "Les habíamos dado un poderío como no os hemos dado a vosotros.",
                            "verse 46:27": "Hemos destruido las ciudades que había alrededor de vosotros.",
                            "verse 46:28": "¿Por qué no les auxiliaron aquéllos a los que, en lugar de tomar a Alá, habían tomado como dioses para que les acercaran? Al contrario, les abandonaron.",
                            "verse 46:29": "Y cuando te llevamos un grupo de genios para que escucharan la Recitación.",
                            "verse 46:30": "Dijeron: «¡Pueblo! Hemos oído una Escritura revelada después de Moisés, en confirmación de los mensajes anteriores, que dirige a la Verdad y a una vía recta».",
                            "verse 46:31": "¡Pueblo! Aceptad al que llama a Alá y creed en Él, para que os perdone vuestros pecados y os preserve de un castigo doloroso.",
                            "verse 46:32": "Los que no acepten al que llama a Alá no podrán escapar en la tierra, ni tendrán, fuera de Él, amigos.",
                            "verse 46:33": "¿No han visto que Alá, Que ha creado los cielos y la tierra sin cansarse por ello, es capaz de devolver la vida a los muertos? Pues sí, es omnipotente.",
                            "verse 46:34": "El día que los infieles sean expuestos al Fuego: «¿No es esto la Verdad?» Dirán: «¡Claro que sí, por nuestro Señor!» Dirá: «¡Gustad, pues, el castigo debido a vuestra incredulidad!»",
                            "verse 46:35": "Ten, pues, paciencia, como la tuvieron otros enviados resueltos."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "ஹா, மீம்.",
                            "verse 46:2": "இவ்வேதம், யாவரையும் மிகைத்தோனும் ஞானம் மிக்கோனுமாகிய அல்லாஹ்விடமிருந்தே இறக்கியருளப்பட்டது.",
                            "verse 46:3": "வானங்களையும், பூமியையும் இவையிரண்டிற்கும் இடையே உள்ளவற்றையும் உண்மையையும், ஒரு குறிப்பிட்ட தவணையையும் கொண்டல்லாமல் நாம் படைக்கவில்லை ஆனால் நிராகரிப்பவர்களோ, தங்களுக்கு அச்சமூட்டி எச்சரிக்கை செய்யப்பட்டதைப் புறக்கணிப்பவர்களாக இருக்கிறார்கள்.",
                            "verse 46:4": "\"நீங்கள் அழைக்கும் அல்லாஹ் அல்லாதவற்றை கவனித்தீர்களா? பூமியிலுள்ள எதை அவை படைத்துள்ளன அல்லது அவற்றுக்கு வானங்களில் ஏதாவது பங்கு உண்டா? என்பதை எனக்குக் காண்பியுங்கள்! நீங்கள் உண்மையாளர்களாக இருந்தால், இதற்கு, முன்னேயுள்ள ஒரு வேதத்தையோ அல்லது (முன்னோர்களின்) அறிவு ஞானங்களில் மிஞ்சிய ஏதேனும் பகுதியையோ (உங்கள் கூற்றுக்கு ஆதாரமாக) என்னிடம் கொண்டு வாருங்கள்!\" என்று (நபியே!) நீர் கூறுவீராக.",
                            "verse 46:5": "கியாம நாள்வரை (அழைத்தாலும்) தனக்கு பதில் கொடுக்க மாட்டாத - அல்லாஹ் அல்லாதவர்களை அழைப்பவர்களைவிட வழி கெட்டவர்கள் யார்? தங்களை அழைப்பதையே அவர்கள் அறியமுடியாது.",
                            "verse 46:6": "அன்றியும் மனிதர் ஒன்று கூட்டப்படும் (அந்நாளில்) இவர்கள் அவர்களுடைய பகைவர்களாக இருப்பர்; அவர்கள் தங்களை வழிபட்டுக் கொண்டு இருந்ததையும் நிராகரித்து (மறுத்து) விடுவர்.",
                            "verse 46:7": "மேலும், நம்முடைய தெளிவான வசனங்கள் அவர்களுக்கு ஓதிக் காண்பிக்கப்பட்டால் தங்களிடம் வந்த அந்த உண்மையை நிராகரித்து விட்டார்களே அவர்கள், \"இது தெளிவான சூனியமே!\" என்றும் கூறுகிறார்கள்.",
                            "verse 46:8": "அல்லது, \"இதனை அவர் இட்டுக்கட்டிக் கொண்டார்\" என்று அவர்கள் கூறுகின்றார்களா? நீர் கூறுவீராக \"நான் இதை இட்டுக் கட்டிக் கொண்டிருந்தால், (அல்லாஹ் அதற்காக தண்டிப்பானே; அப்போது) அல்லாஹ்விடமிருந்து எனக்கு ஏற்படும் எதையும் (தடுக்க) நீங்கள் சக்தி பெற மாட்டீர்கள்.",
                            "verse 46:9": "\"(இறை) தூதர்களில் நாம் புதிதாக வந்தவனல்லன்; மேலும் என்னைப் பற்றியோ, உங்களைப் பற்றியோ, என்ன செய்யப்படும் என்பதை நான் அறியமாட்டேன், எனக்கு என்ன வஹீ அறிவிக்கப்படுகிறதோ அதைத் தவிர (வேறெதையும்) நான் பின்பற்றுவதில்லை; தெளிவாக அச்சமூட்டி எச்சரிப்பவனேயன்றி நான் வேறில்லை\" என்று (நபியே!) நீர் கூறும்.",
                            "verse 46:10": "\"இது அல்லாஹ்விடமிருந்து வந்திருந்து இஸ்ராயீலின் மக்களில் ஒரு சாட்சியானவர் இது போன்றது (வர வேண்டியிருந்தது) என்பதில் சாட்சியங்கூறி ஈமான் கொண்டிருக்கும் போது இதனை நீங்கள் நிராகரித்து பெருமை அடித்துக் கொண்டால் (உங்கள் நிலை என்னவாகும் என்பதை) நீங்கள் கவனித்தீர்களா?\" என்று நீர் கூறுவீராக! நிச்சயமாக அல்லாஹ் அநியாயக்கார சமூகத்திற்கு நேர்வழி காட்டமாட்டான்.",
                            "verse 46:11": "நிராகரிப்பவர்கள் ஈமான் கொண்டவர்களைப்பற்றி; \"இது (குர்ஆன்) நல்லதாக இருந்தால், இவர்கள் எங்களைவிட அதன்பால் முந்தியிருக்க மாட்டார்கள்\" என்று கூறினார்கள்.",
                            "verse 46:12": "இதற்கு முன்னர் மூஸாவின் வேதம் ஒரு இமாமாகவும் (நேர்வழி காட்டியாகவும்) ரஹ்மத்தாகவும் இருந்தது (குர்ஆனாகிய) இவ்வேதம் (முந்தைய வேதங்களை) மெய்யாக்குகிற அரபி மொழியிலுள்ளதாகும்; இது அநியாயம் செய்வோரை அச்சமூட்டி எச்சரிப்பதற்காகவும், நன்மை செய்பவர்களுக்கு நன்மாராயமாகவும் இருக்கிறது.",
                            "verse 46:13": "நிச்சயமாக எவர்கள் \"எங்கள் இறைவன் அல்லாஹ்வே\" என்று கூறி, பிறகு அதிலேயே நிலைத்து நிற்கிறார்களோ அவர்களுக்கு பயமில்லை அவர்கள் துக்கப்படவும் மாட்டார்கள்.",
                            "verse 46:14": "அவர்கள் தாம் சுவர்க்கவாசிகள்; அதில் அவர்கள் நன்மை செய்து கொண்டிருந்ததற்குக் கூலியாக அதில் அவர்கள் என்றென்றும் தங்குவார்கள்.",
                            "verse 46:15": "மனிதன் தன் பெற்றோருக்கு நன்மை செய்யும்படி உபதேசம் செய்தோம்; அவனுடைய தாய், வெகு சிரமத்துடனேயே அவனைச் சுமந்து வெகு சிரமத்துடனேயே அவனைப் பெற்றெடுக்கிறாள்; (கர்ப்பத்தில்) அவனைச் சுமப்பதும்; அவனுக்குப் பால் குடி மறக்கச் செய்வதும் (மொத்தம்) முப்பதுமாதங்களாகும்.",
                            "verse 46:16": "சுவனவாசிகளான இ(த்தகைய)வர்கள் செய்தவற்றில் அழகான - நன்மையானவற்றை நாம் அங்கீகரித்துக் கொண்டு, இவர்களின் தீவினைகளைப் பொறுப்போம்; இவர்களுக்கு அளிக்கப்பட்டிருந்த வாக்குறுதி உண்மையான வாக்குறுதியாகும்.",
                            "verse 46:17": "ஆனால் (சன்மார்க்கத்தை தழுவுமாறு கூறிய) தன் பெற்றோரை நோக்கி; \"சீச்சீ! உங்களுக்கு என்ன நேர்ந்தது! (மரணத்திற்குப் பின்) நான் உயிர்ப்பித்து எழுப்பப்படுவேன் என்று நீங்கள் என்னைப் பயமுறுத்துகிறீர்களா? திடமாக எனக்கு முன்னர் எத்தனையோ தலைமுறையினர் சென்று விட்டனரே (அவர்கள் எழுப்பப்படவில்லையா)!\" என்று கூறியவனைப் பாதுகாக்குமாறு அவ்விருவரும், (அல்லாஹ்விடம் பிரார்த்தித்து பிறகு அவனிடம்) \"உனக்கென்ன கேடு! நீ ஈமான் கொள்வாயாக! நிச்சயமாக அல்லாஹ்வின் வாக்குறுதி மெய்யானது\" என்று அல்லாஹ்விடம் காவல் தேடுகிறார்கள்; அதற்கவன் \"இவையெல்லாம் முன்னுள்ளவர்களின் கட்டுக்கதைகளேயன்றி வேறில்லை\" என்று கூறுகிறான்.",
                            "verse 46:18": "இத்தகையோரின் நிலையோ, இவர்களுக்கு முன்னே சென்று போன ஜின்கள் மனிதர்கள் கூட்டத்தினரில் (பாவம் செய்ததினால்) எவர்களுக்கு எதிராக (அல்லாஹ்வின்) வாக்கு மெய்யாக உறுதியாய் விடுகிறதோ, அது போன்றது தான்; நிச்சயமாக இவர்கள் நஷ்டவாளிகளாய் விட்டனர்.",
                            "verse 46:19": "அன்றியும், ஒவ்வொருவருக்கும் அவரவர் செய்த செய்கைகளுக்குத் தகுந்த பதவிகள் (மறுமையில்) உண்டு - ஆகவே அவர்கள் தங்கள் செயலுக்குரிய கூலியைப் பூரணமாகப் பெறுவதற்காக, ஆகவே அவர்கள் (இதில்) அநியாயம் செய்யப்பட மாட்டார்கள்",
                            "verse 46:20": "அன்றியும் (நரக) நெருப்பின் முன் நிராகரிப்பவர்கள் கொண்டுவரப்படும் நாளில், \"உங்கள் உலக வாழ்க்கையின் போது உங்களுக்குக் கிடைத்திருந்த மணமான பொருட்களையெல்லாம், வீண் செலவு செய்து, (உலக) இன்பம் தேடினீர்கள், \"ஆகவே நீங்கள் பூமியில் அநியாயமாகப் பெருமையடித்துக் கொண்டும், வரம்பு மீறி (வாழ்ந்து) கொண்டும் இருந்த காரணத்தால், இழிவு தரும் வேதனையை இன்று நீங்கள் கூலியாகக் கொடுக்கப்படுகிறீர்கள்\" (என்று அவர்களுக்குக் கூறப்படும்).",
                            "verse 46:21": "மேலும் 'ஆது' (சமூகத்தாரின்) சகோதரர் (ஹூது) திடமாகவே, அவருக்கு முன்னரும், அவருக்குப் பின்னரும் எச்சரிக்கை செய்பவர்கள் (இறை தூதர்கள்) வந்திருக்கிறார்கள் - (அவர்) தம் சமூகத்தாரை, \"அல்லாஹ்வையன்றி (வேறு எதனையும்) நீங்கள் வணங்காதீர்கள் - நிச்சயமாக ஒரு கடுமையான நாளின் வேதனை உங்களுக்கு வரும் என்று நான் பயப்படுகிறேன்\" என்று மணல் குன்றுகளிலிருந்து அச்சமூட்டி எச்சரிக்கை செய்தவை (நபியே!) நீர் நினைவு கூர்வீராக.",
                            "verse 46:22": "அதற்கு அவர்கள்; \"எங்களுடைய தெய்வங்களை விட்டும் எங்களைத் திருப்பி விட நீர் எங்களிடம் வந்தீரா? நீர் உண்மையாளராக இருந்தால், நீர் எதைக் கொண்டு எங்களை பயமுறுத்துகிறீரோ அ(வ் வேதனையான)தைக் கொண்டு வாரும்\" என்று கூறினார்கள்.",
                            "verse 46:23": "அதற்கவர்; \"(அது எப்பொழுது வரும் என்ற) ஞானம் நிச்சயமாக அல்லாஹ்விடம் தான் இருக்கிறது மேலும், நான் எதைக் கொண்டு உங்களிடம் அனுப்பப்பட்டிருக்கிறேனோ அதையே நான் உங்களுக்குச் சேர்ப்பித்து, எடுத்துரைக்கின்றேன் - எனினும் நான் உங்களை அறிவில்லாத சமூகத்தாராகவே காண்கிறேன்\" என்று கூறினார்.",
                            "verse 46:24": "ஆனால் அவர்களோ (அவர்களுக்கு அனுப்பப்பட்ட வேதனை) அவர்கள் இருந்த பள்ளத்தாக்குகளை நோக்கி மேகமாக வருவதைக் கண்டதும், \"இது நமக்கு மழையைப் பொழியும் மேகமாகும்\" எனக் கூறினார்கள்; \"அப்படியல்ல, இது நீங்கள் (எதற்காக) அவசரப்பட்டீர்களோ அதுதான்; (இது கொடுங்)காற்று - இதில் நோவினை செய்யும் வேதனை இருக்கிறது",
                            "verse 46:25": "\"அது தன் இறைவனின் கட்டளையினால் எல்லாப் பொருட்களையும் அழித்துவிடும்\" (என்று கூறப்பட்டது).",
                            "verse 46:26": "உங்களுக்கு (மக்காவாசிகளுக்கு) இங்கு எதில் வசதிகள் செய்து கொடுக்காதிருந்தோமோ அவ்வசதிகளையெல்லாம் நாம் அவர்களுக்குத் திடமாகச் செய்து கொடுத்திருந்தோம்.",
                            "verse 46:27": "அன்றியும், உங்களைச் சுற்றி இருந்த ஊ(ரா)ர்களையும் திடமாக நாம் அழித்திருக்கிறோம், அவர்கள் (நேர்வழிக்கு) மீளும் பொருட்டு நாம் (அவர்களுக்குப்) பல அத்தாட்சிகளைத் திருப்பித் திருப்பிக் காண்பித்தோம்.",
                            "verse 46:28": "(அல்லாஹ்விடம் தங்களை) நெருங்க வைக்கும் தெய்வங்களென்று அல்லாஹ் அல்லாதவற்றை இவர்கள் எடுத்துக் கொண்டார்களே, அவர்கள் ஏன் இவர்களுக்கு உதவி புரியவில்லை? ஆனால், அவர்கள் இவர்களை விட்டும் மறைந்து விட்டனர் - அவர்களே இவர்கள் பொய்யாகக் கூறியதையும், இட்டுக் கட்டியவையுமாகும்.",
                            "verse 46:29": "மேலும் (நபியே!) நாம் உம்மிடம் இந்த குர்ஆனை செவியுறும் பொருட்டு ஜின்களில் சிலரை திருப்பியதும், அவர்கள் அங்கு வந்த போது, \"மௌனமாக இருங்கள்\" என்று (மற்றவர்களுக்குச்) சொன்னார்கள்; (ஓதுதல்) முடிந்ததும் தம் இனத்தாரிடம் சென்று அவர்களை அச்சமூட்டி எச்சரிக்கை செய்தனர்.",
                            "verse 46:30": "(ஜின்கள்) கூறினார்கள்; \"எங்களுடைய சமூகத்தார்களே! நிச்சயமாக நாங்கள் ஒரு வேதத்தைச் செவிமடுத்தோம், அது மூஸாவுக்குப் பின்னர் இறக்கப்பட்டிருக்கின்றது, அது தனக்கு முன்னுள்ள வேதங்களை உண்மை படுத்துகிறது.",
                            "verse 46:31": "\"எங்கள் சமூகத்தாரே! உங்களை அல்லாஹ்வின் பக்கம் அழைப்பவருக்கு பதிலளித்து (அவர் கூறுவதை ஏற்று) அவர் மீது ஈமான் கொள்ளுங்கள்.",
                            "verse 46:32": "\"ஆனால், எவர் அல்லாஹ்வின் பக்கம் அழைப்பவருக்கு பதிலளிக்க வில்லையோ, அவர் பூமியில் (அல்லாஹ்வை) இயலாமல் ஆக்க முடியாது அவனையன்றி அவரை பாதுகாப்போர் எவருமில்லை அ(த்தகைய)வர்கள் பகிரங்கமான வழிகேட்டிலேயே இருக்கின்றார்கள்.",
                            "verse 46:33": "வானங்களையும், பூமியையும் படைத்து அவற்றின் படைப்பால் எவ்வித சோர்வுமின்றி இருக்கின்றானே அல்லாஹ் அவன் நிச்சயமாக மரித்தோரை உயிர்ப்பிக்கும் ஆற்றலுடையவன்; ஆம்! நிச்சயமாக அவன் எல்லாப் பொருள்கள் மீதும் பேராற்றலுடையவன் என்பதை அவர்கள் பார்க்கவில்லையா?",
                            "verse 46:34": "மேலும், நிராகரிப்பவர்கள் (நரக) நெருப்பின் முன் கொண்டுவரப்படும் நாளில் (அவர்களிடம்) \"இது உண்மையல்லவா?\" (என்று கேட்கப்படும்;) அதற்வர்கள், \"எங்கள் இறைவன் மீது சத்தியமாக, உண்மைதான்\" என்று கூறுவார்கள்.",
                            "verse 46:35": "\"(நபியே!) நம் தூதர்களில் திடசித்தமுடையவர்கள் பொறமையாக இருந்தது போல், நீரும் பொறுமையுடன் இருப்பீராக! இவர்களுக்காக (வேதனையை வரவழைக்க) அவசரப்படாதீர்! இவர்களுக்கு வாக்களிக்கப்பட்டதை இவர்கள் பார்க்கும் நாளில், அவர்கள் (இப்பூமியில்) ஒரு நாளில் ஒரு நாழிகைக்கு மேல் இருக்கவில்லை (என்று எண்ணுவார்கள்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "ฮามีม",
                            "verse 46:2": "การประทานลงมาของคัมภีร์นี้จากอัลลอฮ์ ผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ",
                            "verse 46:3": "เรามิได้สร้างชั้นฟ้าทั้งหลายและแผ่นดิน และสิ่งที่อยู่ระหว่างทั้งสองเพื่ออื่นใดเว้นแต่ด้วยความจริง และวาระที่ถูกกำหนดไว้ แต่บรรดาผู้ปฏิเสธศรัทธาเป็นผู้ผินหลังให้จากสิ่งที่พวกเขาถูกตักเตือน",
                            "verse 46:4": "จงกล่าวเถิด มุฮัมมัด พวกท่านไม่เห็นดอกหรือ สิ่งที่พวกท่านวิงวอนขออื่นจากอัลลอฮ์ จงแสดงให้ข้าเห็นซิว่าพวกมันได้สร้างอะไรในแผ่นดินนี้ หรือว่าพวกมันมีส่วนร่วมใน (การสร้าง) ชั้นฟ้าทั้งหลาย จงนำคัมภีร์ก่อนหน้านี้มาให้ข้าดูซิ หรือจงแสดงร่องรอยแห่งความรู้ (ที่เป็นหลักฐานยืนยันในการนี้) หากพวกท่านเป็นผู้ซื่อสัตย์จริง",
                            "verse 46:5": "และใครเล่าจะหลงทางมากไปกว่าผู้ที่วิงวอนขออื่นจากอัลลอฮ์ที่มันจะไม่ตอบรับ (การวิงวอนของ) เขาจนถึงวันกิยามะฮ์ และพวกมันเฉยเมยต่อการวิงวอนขอของพวกเขา",
                            "verse 46:6": "และเมื่อมนุษย์ถูกรวมให้มาชุมนุมกัน พวกมัน (เจว็ด) จะเป็นศัตรูกับพวกเขาและจะเป็นผู้ปฏิเสธการเคารพบูชาของพวกเขา",
                            "verse 46:7": "และเมื่ออายาตต่าง ๆ อันชัดแจ้งของเรา ถูกสาธยายแก่พวกเขา บรรดาผู้ปฏิเสธศรัทธาได้กล่าวเกี่ยวกับสัจธรรม (อัลกุรอาน) ที่ได้มีมายังพวกเขาว่า นี่คือมายากลอย่างชัดแจ้ง",
                            "verse 46:8": "หรือพวกเขากล่าวว่า เขา (มุฮัมมัด) ได้ปั้นแต่งอัลกุรอานนั้น จงกล่าวเถิดมุฮัมมัด ถ้าฉันได้ปั้นแต่งอัลกุรอานขึ้นพวกท่านก็ไม่มีอำนาจอันใดที่จะช่วยเหลือฉันได้จาก (การลงโทษของ) อัลลอฮ์ พระองค์ทรงรู้ดียิ่งถึงสิ่งที่พวกท่านกำลังง่วนอยู่ในเรื่องนี้ พอเพียงแล้วที่พระองค์ทรงเป็นพยานระหว่างฉันกับพวกท่าน และพระองค์เป็นผู้ทรงอภัย ผู้ทรงเมตตาเสมอ",
                            "verse 46:9": "จงกล่าวเถิดมุฮัมมัด ฉันมิได้เป็นคนแรกในบรรดาร่อซู้ล และฉันไม่รู้ว่าจะเกิดอะไรขึ้นแก่ฉันและแก่พวกท่าน ฉันมิได้ปฏิบัติตามสิ่งใดนอกจากสิ่งที่ถูกวะฮีย์ยฺให้แก่ฉัน และฉันมิใช่ใครอื่นนอกจากเป็นผู้ตักเตือนอันชัดแจ้ง",
                            "verse 46:10": "จงกล่าวเถิดมุฮัมมัด พวกท่านไม่เห็นดอกหรือว่า ถ้าหากอัลกุรอานมาจากอัลลอฮ์และพวกท่านปฏิเสธอัลกุรอานนั้น ทั้ง ๆ ที่มีพยานคนหนึ่งจากวงศ์วานของอิสรออีลเป็นพยานต่อลักษณะเช่นเดียวกัน (คือคัมภีร์อัตเตารอฮ์) แล้วเขาก็ศรัทธาแต่พวกท่านยังดื้อรั้นหยิ่งยะโส แท้จริงอัลลอฮ์จะไม่ทรงชี้แนะทางแก่หมู่ชนผู้อธรรม",
                            "verse 46:11": "และบรรดาผู้ปฏิเสธศรัทธาได้กล่าวแก่บรรดาผู้ศรัทธาว่า หากว่าอัลกุรอานนี้มีความดี พวกเขา (ผู้ศรัทธา) ก็จะไม่รุดหน้าไปยังอัลกุรอานก่อนเราเป็นแน่ และโดยที่พวกเขา (พวกปฏิเสธศรัทธา) มิได้รับการชี้แนะทางด้วยอัลกุรอาน ดังนั้นพวกเขาจึงกล่าวว่า นี่คือเรื่องโกหกแต่ดั้งเดิม",
                            "verse 46:12": "และก่อนหน้านี้ (อัลกุรอาน) มีคัมภีร์ของมูซาเป็นแบบอย่างและความเมตตา และนี่อัลกุรอานเป็นคัมภีร์ที่ยืนยันเป็นภาษาอาหรับเพื่อตักเตือนบรรดาผู้กระทำความผิด และเป็นข่าวดีสำหรับผู้กระทำความดี",
                            "verse 46:13": "แท้จริงบรรดาผู้ที่กล่าวว่า อัลลอฮ์คือ พระเจ้าของพวกเรา แล้วพวกเขาก็ยืนหยัด (ปฏิบัติ) ตามคำกล่าวนั้น จะไม่มีความหวาดกลัวใด ๆ แก่พวกเขา และพวกเขาก็จะไม่เศร้าสลดใจ",
                            "verse 46:14": "ชนเหล่านั้นคือชาวสวนสวรรค์ พวกเขาเป็นผู้พำนักอยู่ในนั้นตลอดกาล เป็นการตอบแทนที่พวกเขาได้กระทำไว้",
                            "verse 46:15": "และเราได้สั่งเสียมนุษย์ให้ทำดี ต่อบิดามารดาของเขา มารดาของเขาได้อุ้มครรภ์เขาด้วยความเหนื่อยยาก และได้คลอดเขาด้วยความเจ็บปวด และการอุ้มครรภ์เขาและการหย่านมของเขาในระยะเวลาสามสิบเดือน จนกระทั่งเมื่อเขาบรรลุวัยฉกรรจ์ของเขาและมีอายุถึงสี่สิบปี เขาจะกล่าววิงวอนว่า ข้าแต่พระเจ้าของเข้าพระองค์ขอพระองค์ทรงโปรดประทานแก่ข้าพระองค์ เพื่อให้ข้าพระองค์ขอบคุณต่อความโปรดของพระองค์ท่าน ซึ่งพระองค์ท่านได้ทรงโปรดปรานแก่ข้าพระองค์และบิดามารดาของข้าพระองค์ และให้ข้าพระองค์ทำความดีเพื่อให้ความดีเกิดขึ้นในลูกหลานของข้าพระองค์ แท้จริงข้าพระองค์ขอลุแก่โทษต่อพระองค์ และแท้จริงข้าพระองค์อยู่ในหมู่ผู้นอบน้อม",
                            "verse 46:16": "ชนเหล่านี้คือ บรรดาผู้ที่เรารับรองส่วนที่ดียิ่งจากพวกเขา ซึ่งพวกเขาได้ปฏิบัติไว้ และเราจะละเลยความผิดต่าง ๆของพวกเขาโดยอยู่ร่วมกับชาวสวรรค์ เป็นการสัญญาแห่งความจริงซึ่งพวกเขาได้ปฏิบัติไว้ และเราจะละเลยความผิดต่าง ๆของพวกเขาโดยอยู่ร่วมกับชาวสวรรค์ เป็นการสัญญาแห่งความจริงซึ่งพวกเขาได้ถูกสัญญาไว้",
                            "verse 46:17": "และผู้ที่กล่าวแก่บิดามารดาของเขา ว่า อุ๊ฟ แก่ท่านทั้งสอง ท่านทั้งสองขู่ฉันว่าฉันจะถูกให้ออกมาฟื้นคืนชีพอีกกระนั้นหรือ ? ทั้ง ๆ ที่หลายศตวรรษก่อนหน้าฉันได้ล่วงลับไปแล้ว และเขาทั้งสองร้องขอความช่วยเหลือต่ออัลลอฮ์ พลางกล่าวแก่ลูกว่า ความหายนะ จงประสบแก่เจ้า จงศรัทธาเถิด แท้จริงสัญญาของอัลลอฮ์นั้นเป็นความจริง แล้วเขาก็พูดว่า เรื่องนี้มิใช่อะไรอื่นนอกจากเป็นนิยายเหลวไหลสมัยก่อนเท่านั้น",
                            "verse 46:18": "ชนเหล่านี้คือ บรรดาผู้ที่พระดำรัส (แห่งการลงโทษ) เป็นที่คู่ควรแก่พวกเขาที่จะเข้าร่วมอยู่กับหมู่ชนต่าง ๆ แห่งพวกญินและมนุษย์ที่ได้ล่วงลับไปก่อนพวกเขา แท้จริงพวกเขาเป็นผู้ขาดทุน",
                            "verse 46:19": "และสำหรับทุกกลุ่มย่อมมีลำดับชั้นตามที่พวกเขาได้กระทำไว้ และพระองค์จะทรงตอบแทนพวกเขาอย่างครบถ้วนตามผลงานของพวกเขา โดยที่พวกเขาจะไม่ถูกอยุติธรรม",
                            "verse 46:20": "และวันที่บรรดาผู้ปฏิเสธศรัทธาจะถูกนำมาอยู่ต่อหน้าไฟนรก (จะมีเสียงกล่าวแก่พวกเขาว่า) พวกเจ้าได้เอาสิ่งดีงามทั้งหลายของพวกเจ้าในโลกดุนยาไปแล้ว และพวกเจ้าได้มีความสำราญกับมันแล้ว ฉะนั้นวันนี้พวกเจ้าจะได้รับการตอบแทนด้วยการลงโทษอันอัปยศ เนื่องด้วย พวกเจ้าหยิ่งยะโสในแผ่นดินโดยไม่เป็นธรรมและเนื่องด้วยพวกเจ้าฝ่าฝืน",
                            "verse 46:21": "จงรำลึกถึง (ฮูด) พี่น้องคนหนึ่งของพวกอ๊าด ขณะที่เขากล่าวเตือนหมู่ชนของเขาที่เนินเขาอัลอะฮิก๊อฟ และแน่นอน บรรดาผู้ตักเตือน (ร่อซู้ล) ก่อนหน้าเขาและภายหลังเขา (ได้กล่าวตักเตือนว่า) พวกท่านอย่าเคารพอิบาดะฮ์ผู้ใดนอกจากอัลลอฮ์ แท้จริงฉันกลัวแทนพวกท่านถึงการลงโทษแห่งวันอันยิ่งใหญ่",
                            "verse 46:22": "พวกเขากล่าวว่า ท่านมาหาพวกเราเพื่อจะหันห่างพวกเรา จากการเคารพสักการะพระเจ้าทั้งหลายของเรากระนั้นหรือ ? ดังนั้นจงนำ (การลงโทษ) ตามที่ท่านได้สัญญากับเราไว้ หากท่านอยู่ในหมู่ผู้สัตย์จริง",
                            "verse 46:23": "เขา (ฮูด) กล่าวว่า แท้จริงความรู้ (เรื่องการลงโทษ) นั้นอยู่ที่อัลลอฮ์ และฉันขอประกาศแก่พวกท่านตามที่ฉันได้ถูกส่งมาเพื่อการนี้ แต่ฉันเห็นว่าพวกท่านเป็นหมู่ชนผู้งมงาย",
                            "verse 46:24": "ครั้นเมื่อพวกเขาเห็นเมฆทึบเคลื่อนมายังที่ราบลุ่มในหมู่บ้านของพวกเขา พวกเขากล่าวว่า นี่คือเมฆที่จะให้น้ำฝนแก่เรา เปล่าเลยมันคือสิ่งที่พวกเจ้าเร่งขอให้เกิด มันคือลมพายุ ในนั้นมีการลงโทษอันเจ็บปวด",
                            "verse 46:25": "มันจะทำลายทุกสิ่งตามพระบัญชาของพระเจ้าของมันแล้วพวกเขาก็กลายเป็นไม่มีอะไรให้แลเห็นนอกจากบ้านพักอาศัยของพวกเขาเท่านั้น เช่นนี้แหละเราจะตอบแทนหมู่ชนผู้กระทำผิด",
                            "verse 46:26": "และแน่นอน เราได้ตั้งหลักแหล่งที่มั่นคงแก่พวกเขา โดยที่เรามิได้ตั้งหลักแหล่งที่มั่นคงแก่พวกเจ้าในนั้น และเราได้ทำให้พวกเขามีหู มีตา และมีหัวใจ แต่ว่าหูของพวกเขา ตาของพวกเขา และหัวใจของพวกเขามิได้อำนวยประโยชน์อันใดแก่พวกเขา โดยที่พวกเขาปฏิเสธสัญญาณต่าง ๆ ของอัลลอฮ์ และสิ่งที่พวกเขาได้เคยเยาะเย้ยไว้นั้นก็ห้อมล้อมพวกเขา",
                            "verse 46:27": "และโดยแน่นอน เราได้ทำลายหมู่บ้านต่าง ๆ ที่อยู่รอบ ๆ พวกเจ้า และเราได้แจกแจงสัญญาณต่าง ๆ หลายต่อหลายครั้ง หวังว่าพวกเขาจะกลับมาสำนึกผิด",
                            "verse 46:28": "ทำไมบรรดาที่พวกเขายึดถือมันเป็นพระเจ้าอื่นจากอัลลอฮ์เพื่อความใกล้ชิด (กับอัลลอฮ์) จึงไม่ช่วยเหลือพวกเขาเล่า ? แต่พวกมันได้หายสาปสูญไปจากพวกเขา และนั่นคือ การกล่าวเท็จของพวกเขาและสิ่งที่พวกเขากุขึ้น",
                            "verse 46:29": "และจงรำลึกเมื่อเราได้ให้ญินจำนวนหนึ่งมุ่งไปยังเจ้า เพื่อฟังอัลกุรอาน ครั้นเมื่อพวกเขามาปรากฏตัวต่อหน้าอัลกุรอาน พวกเขากล่าวว่า จงนิ่งฟังซิ เมื่อ (การอ่าน) จบลงแล้ว พวกเขาก็หันกลับไปยังหมู่ชนของพวกเขาเพื่อทำหน้าที่เป็นผู้ตักเตือน",
                            "verse 46:30": "พวกเขากล่าวว่า โอ้หมู่ชนของเราเอ๋ย แท้จริงเราได้ฟังคัมภีร์ (อัลกุรอาน) ถูกประทานลงมาหลังจากมูซา เป็นการยืนยันในสิ่งที่ได้มีมาก่อนอัลกุรอาน เพื่อชี้แนะทางไปสู่สัจธรรม และแนวทางที่เที่ยงตรง",
                            "verse 46:31": "โอ้หมู่ชนของเราเอ๋ย จงตอบรับต่อผู้เรียกร้องของอัลลอฮ์เถิด และจงศรัทธาต่อเขา พระองค์จะทรงอภัยโทษจากความผิดของพวกท่านให้แก่พวกท่าน และจะทรงให้พวกท่านรอดพ้นจากการลงโทษอันเจ็บปวด",
                            "verse 46:32": "และผู้ใดที่ไม่ตอบรับผู้เรียกร้องของอัลลอฮ์ เขาจะไม่รอดพ้น (จากการลงโทษ) ในแผ่นดินนี้ และสำหรับเขาจะไม่มีผู้คุ้มครองอื่นจากพระองค์ ชนเหล่านี้อยู่ในการหลงผิดอย่างชัดแจ้ง",
                            "verse 46:33": "และพวกเขาไม่เห็นดอกหรือว่า แท้จริงอัลลอฮ์ ซึ่งทรงสร้างชั้นฟ้าทั้งหลายและแผ่นดินนี้ และมิทรงอ่อนเพลียต่อการสร้างสิ่งเหล่านั้น ย่อมทรงเป็นผู้อานุภาพที่จะให้คนตายมีชีวิตขึ้นมาอีก แน่นอนแท้จริงพระองค์เป็นผู้ทรงอานุภาพเหนือทุก ๆ สิ่ง",
                            "verse 46:34": "และวันซึ่งบรรดาผู้ปฏิเสธศรัทธาจะถูกนำมาอยู่ต่อหน้าไฟนรก (จะมีเสียงกล่าวขึ้นว่า) นี่มิใช่ความจริงดอกหรือ ? พวกเขากล่าวว่า แน่นอนครับ ขอสาบานต่อพระเจ้าจงลิ้มรสการลงโทษตามที่พวกเจ้าได้ปฏิเสธศรัทธา",
                            "verse 46:35": "ดังนั้นเจ้าจงอดทนดังเช่นบรรดาผู้ตั้งจิตมั่นแห่งร่อซู้ลทั้งหลาย ได้อดทนมาก่อนแล้ว และอย่ารีบเร่ง (ให้มีการลงโทษ) แก่พวกเขา วันที่พวกเขาจะเห็นสิ่งที่ถูกสัญญาไว้แก่พวกเขานั้น ประหนึ่งว่าพวกเขามิได้พำนักอยู่ในโลกนี้เว้นแต่เพียงชั่วครู่หนึ่งยามกลางวันเท่านั้น นี้คือการประกาศตักเตือนดังนั้นความหายนะจะไม่ประสบแก่ผู้ใดนอกจากหมู่ชนผู้ฝ่าฝืนเท่านั้น"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Ha.",
                            "verse 46:2": "Bu Kitap aziz ve hakîm olan Allah tarafından indirilmiştir.",
                            "verse 46:3": "Gökleri, yeri ve ikisi arasında bulunanları biz, şüphesiz yerli yerince ve belli bir süre için yarattık.",
                            "verse 46:4": "De ki: Söylesenize! Allah'ı bırakıp taptığınız şeyler yeryüzünde ne yaratmışlar; göstersenize bana! Yoksa onların göklere ortaklıkları mı vardır? Eğer doğru söyleyenlerden iseniz, bundan evvel (size indirilmiş) bir kitap yahut bir bilgi kalıntısı varsa onu bana getirin.",
                            "verse 46:5": "Allah'ı bırakıp da kıyamet gününe kadar kendisine cevap veremeyecek şeylere tapandan daha sapık kim olabilir? (Oysa) onlar, bunların tapmalarından habersizdirler.",
                            "verse 46:6": "İnsanlar bir araya toplandıkları zaman (müşrikler) onlara (tapındıklarına) düşman kesilirler ve onlara kulluk ettiklerini inkâr ederler.",
                            "verse 46:7": "Ayetlerimiz onlara açıkça okunduğu zaman hakikat kendilerine geldiğinde onu inkâr edenler: \"Bu, apaçık bir büyüdür\" dediler.",
                            "verse 46:8": "Yoksa \"Onu uydurdu\" mu diyorlar? De ki: Eğer ben onu uydurmuşsam, Allah tarafından bana gelecek şeyi savmaya gücünüz yetmez.",
                            "verse 46:9": "De ki: Ben peygamberlerin ilki değilim.",
                            "verse 46:10": "De ki: Hiç düşündünüz mü; şayet bu, Allah katından ise ve siz onu inkâr etmişseniz, İsrailoğullarından bir şahit de bunun benzerini görüp inandığı halde siz yine de büyüklük taslamışsanız (haksızlık etmiş olmaz mısınız)? Şüphesiz Allah, zalimler topluluğunu doğru yola iletmez.",
                            "verse 46:11": "İnkâr edenler, iman edenler hakkında dediler ki: \"Bu iş bir hayır olsaydı, onlar bizi geçemezlerdi.",
                            "verse 46:12": "Ondan önce de bir rahmet ve rehber olarak Musa'nın kitabı vardır.",
                            "verse 46:13": "\"Rabbimiz Allah'tır\" deyip sonra da dosdoğru yaşayanlara korku yoktur ve onlar üzülmeyeceklerdir.",
                            "verse 46:14": "Onlar cennet ehlidirler.",
                            "verse 46:15": "Biz insana, ana-babasına iyilik etmesini tavsiye ettik.",
                            "verse 46:16": "İşte, yaptıklarının iyisini kabul edeceğimiz ve günahlarını bağışlayacağımız bu kimseler cennetlikler arasındadırlar.",
                            "verse 46:17": "Ana ve babasına: Öf be size! Benden önce nice nesiller gelip geçmişken, beni mi tekrar dirilmekle tehdit ediyorsunuz? diyen kimseye, ana ve babası Allah'ın yardımına sığınarak: Yazıklar olsun sana! İman et.",
                            "verse 46:18": "İşte onlar, kendilerinden önce cinlerden ve insanlardan gelip geçmiş topluluklar içinde, haklarında azabın gerçekleştiği kimselerdir.",
                            "verse 46:19": "Herkesin yaptıklarına göre dereceleri vardır.",
                            "verse 46:20": "İnkâr edenler ateşe arzolunacakları gün (onlara şöyle denir): Dünyadaki hayatınızda bütün güzel şeylerinizi harcadınız, onların zevkini sürdünüz.",
                            "verse 46:21": "Ad kavminin kardeşini (Hûd'u) an.",
                            "verse 46:22": "\"Sen bizi tanrılarımızdan çevirmek için mi bize geldin? Hadi, doğru söyleyenlerden isen, bizi tehdit ettiğin şeyi başımıza getir\" dediler.",
                            "verse 46:23": "Hûd da! Bilgi ancak Allah'ın katındadır.",
                            "verse 46:24": "Nihayet",
                            "verse 46:25": "onu, vâdilerine doğru yayılan bir bulut şeklinde görünce: Bu bize yağmur yağdıracak yaygın bir buluttur, dediler.",
                            "verse 46:26": "O (rüzgâr), Rabbinin emriyle her şeyi yıkar, mahveder.",
                            "verse 46:27": "Andolsun ki, onlara da size vermediğimiz kudret ve serveti vermiştik.",
                            "verse 46:28": "Andolsun biz, çevrenizdeki memleketleri de yok ettik.",
                            "verse 46:29": "Allah'tan başka kendilerine yakınlık sağlamak için tanrı edindikleri şeyler, kendilerine yardım etselerdi ya! Hayır, onları bırakıp gittiler.",
                            "verse 46:30": "Hani cinlerden bir gurubu, Kur'an'ı dinlemeleri için sana yöneltmiştik.",
                            "verse 46:31": "Ey kavmimiz! dediler, doğrusu biz Musa'dan sonra indirilen, kendinden öncekini doğrulayan, hakka ve doğru yola ileten bir kitap dinledik.",
                            "verse 46:32": "Ey kavmimiz! Allah'ın davetçisine uyun.",
                            "verse 46:33": "Allah'ın dâvetçisine uymayan kimse yeryüzünde Allah'ı âciz bırakacak değildir.",
                            "verse 46:34": "Gökleri ve yeri yaratan, bunları yaratmakla yorulmayan Allah'ın, ölüleri diriltmeye de gücünün yeteceğini düşünmezler mi? Evet O, her şeye kadirdir.",
                            "verse 46:35": "İnkâr edenlere, ateşe sunulacakları gün: Nasıl, bu gerçek değil miymiş? denildiğinde: Evet, Rabbimize andolsun ki gerçekmiş, derler.",
                            "verse 46:36": "O halde (Resûlum), peygamberlerden azim sahibi olanların sabrettiği gibi sen de sabret."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "حٰم",
                            "verse 46:2": "حا، ميم (حقيقي معني ا? اور رسول صلي اللہ عليہ وآلہ وسلم ہي بہتر جانتے ہيں)o",
                            "verse 46:3": "اس کتاب کا نازل کيا جانا اللہ کي جانب سے ہے جو غالب حکمت والا ہےo",
                            "verse 46:4": "(یہ) کتاب خدائے غالب (اور) حکمت والے کی طرف سے نازل ہوئی ہے",
                            "verse 46:5": "ہم نے آسمانوں اور زمین کو اور جو کچھ ان دونوں میں ہے مبنی برحکمت اور ایک وقت مقرر تک کے لئے پیدا کیا ہے۔ اور کافروں کو جس چیز کی نصیحت کی جاتی ہے اس سے منہ پھیر لیتے ہیں",
                            "verse 46:6": "اور ہم نے آسمانوں کو اور زمين کو اور اس (مخلوقات) کو جو ان کے درميان ہے پيدا نہيں کيا مگر حکمت اور مقررہ مدّت (کے تعيّن) کے ساتھ، اور جنہوں نے کفر کيا ہے انہيں جس چيز سے ڈرايا گيا اسي سے رُوگرداني کرنے والے ہيںo",
                            "verse 46:7": "آپ فرما ديں کہ مجھے بتاؤ تو کہ جن (بتوں) کي تم اللہ کے سوا عبادت کرتے ہو مجھے دکھاؤ کہ انہوں نے زمين ميں کيا چيز تخليق کي ہے يا (يہ دکھا دو کہ) آسمانوں (کي تخليق) ميں ان کي کوئي شراکت ہے? تم ميرے پاس اس (قرآن) سے پہلے کي کوئي کتاب يا (اگلوں کے) علم کا کوئي بقيہ حصہ (جو منقول چلا آرہا ہو ثبوت کے طور پر) پيش کرو اگر تم سچے ہوo",
                            "verse 46:8": "کہو کہ بھلا تم نے ان چیزوں کو دیکھا ہے جن کو تم خدا کے سوا پکارتے ہو (ذرا) مجھے بھی تو دکھاؤ کہ انہوں نے زمین میں کون سی چیز پیدا کی ہے۔ یا آسمانوں میں ان کی شرکت ہے۔ اگر سچے ہو تو اس سے پہلے کی کوئی کتاب میرے پاس لاؤ۔ یا علم (انبیاء میں) سے کچھ (منقول) چلا آتا ہو (تو اسے پیش کرو)",
                            "verse 46:9": "اور اس شخص سے بڑھ کر کون گمراہ ہوسکتا ہے جو ایسے کو پکارے جو قیامت تک اسے جواب نہ دے سکے اور ان کو ان کے پکارنے ہی کی خبر نہ ہو",
                            "verse 46:10": "اور اس شخص سے بڑھ کر گمراہ کون ہوسکتا ہے جو اللہ کے سوا ايسے (بتوں) کي عبادت کرتا ہے جو قيامت کے دن تک اسے (سوال کا) جواب نہ دے سکيں اور وہ (بت) ان کي دعاء و عبادت سے (ہي) بے خبر ہيںo",
                            "verse 46:11": "اور جب لوگ (قيامت کے دن) جمع کئے جائيں گے تو وہ (معبودانِ باطلہ) ان کے دشمن ہوں گے اور (اپني برات کي خاطر) ان کي عبادت سے ہي منکر ہو جائيں گےo",
                            "verse 46:12": "اور جب لوگ جمع کئے جائیں گے تو وہ ان کے دشمن ہوں گے اور ان کی پرستش سے انکار کریں گے",
                            "verse 46:13": "اور جب ان کے سامنے ہماری کھلی آیتیں پڑھی جاتی ہیں تو کافر حق کے بارے میں جب ان کے پاس آچکا کہتے ہیں کہ یہ تو صریح جادو ہے",
                            "verse 46:14": "اور جب ان پر ہماري واضح آيتيں پڑھي جاتي ہيں (تو) جو لوگ کفر کر رہے ہيں حق (يعني قرآن) کے بارے ميں، جبکہ وہ ان کے پاس آچکا، کہتے ہيں: يہ کھلا جادو ہےo",
                            "verse 46:15": "کيا وہ لوگ (يہ) کہتے ہيں کہ اس (قرآن) کو (پيغمبر نے) گھڑ ليا ہے? آپ فرما ديں: اگر اسے ميں نے گھڑا ہے تو تم مجھے اللہ (کے عذاب) سے (بچانے کا) کچھ بھي اختيار نہيں رکھتے، اور وہ ان (باتوں) کو خوب جانتا ہے جو تم اس (قرآن) کے بارے ميں طعنہ زني کے طور پر کر رہے ہو? وہي (اللہ) ميرے اور تمہارے درميان گواہ کافي ہے، اور وہ بڑا بخشنے والا بہت رحم فرمانے والا ہےo",
                            "verse 46:16": "کیا یہ کہتے ہیں کہ اس نے اس کو از خود بنا لیا ہے۔ کہہ دو کہ اگر میں نے اس کو اپنی طرف سے بنایا ہو تو تم خدا کے سامنے میرے (بچاؤ کے) لئے کچھ اختیار نہیں رکھتے۔ وہ اس گفتگو کو خوب جانتا ہے جو تم اس کے بارے میں کرتے ہو۔ وہی میرے اور تمہارے درمیان گواہ کافی ہے۔ اور وہ بخشنے والا مہربان ہے",
                            "verse 46:17": "کہہ دو کہ میں کوئی نیا پیغمبر نہیں آیا۔ اور میں نہیں جانتا کہ میرے ساتھ کیا سلوک کیا جائے گا اور تمہارے ساتھ کیا (کیا جائے گا) میں تو اسی کی پیروی کرتا ہوں جو مجھ پر وحی آتی ہے اور میرا کام تو علانیہ ہدایت کرنا ہے",
                            "verse 46:18": "آپ فرما ديں کہ ميں (انسانوں کي طرف) کوئي پہلا رسول نہيں آيا (کہ مجھ سے قبل رسالت کي کوئي مثال ہي نہ ہو) اور ميں اَزخود (يعني محض اپني عقل و درايت سے) نہيں جانتا کہ ميرے ساتھ کيا سلوک کيا جائے گا اور نہ وہ جو تمہارے ساتھ کيا جائے گا، (ميرا علم تو يہ ہے کہ) ميں صرف اس وحي کي پيروي کرتا ہوں جو ميري طرف بھيجي جاتي ہے (وہي مجھے ہر شے کا علم عطا کرتي ہے) اور ميں تو صرف (اس علم بالوحي کي بنا پر) واضح ڈر سنانے والا ہوںo",
                            "verse 46:19": "فرما ديجئے: ذرا بتاؤ تو اگر يہ (قرآن) اللہ کي طرف سے ہو اور تم نے اس کا انکار کر ديا ہو اور بني اسرائيل ميں سے ايک گواہ (بھي پہلي آسماني کتابوں سے) اس جيسي کتاب (کے اترنے کے ذکر) پر گواہي دے پھر وہ (اس پر) ايمان (بھي) لايا ہو اور تم (اس کے باوجود) غرور کرتے رہے (تو تمہارا انجام کيا ہوگا؟)، بيشک اللہ ظالم قوم کو ہدايت نہيں فرماتاo",
                            "verse 46:20": "کہو کہ بھلا دیکھو تو اگر یہ (قرآن) خدا کی طرف سے ہو اور تم نے اس سے انکار کیا اور بنی اسرائیل میں سے ایک گواہ اسی طرح کی ایک (کتاب) کی گواہی دے چکا اور ایمان لے آیا اور تم نے سرکشی کی (تو تمہارے ظالم ہونے میں کیا شک ہے)۔ بیشک خدا ظالم لوگوں کو ہدایت نہیں دیتا",
                            "verse 46:21": "سورة الأحقاف رکوع (۴/۲) اور کافر مومنوں سے کہتے ہیں کہ اگر یہ (دین) کچھ بہتر ہوتا تو یہ لوگ اس کی طرف ہم سے پہلے نہ دوڑ پڑتے اور جب وہ اس سے ہدایت یاب نہ ہوئے تو اب کہیں گے کہ یہ پرانا جھوٹ ہے",
                            "verse 46:22": "اور کافروں نے مومنوں سے کہا: اگر يہ (دينِ محمدي صلي اللہ عليہ وآلہ وسلم) بہتر ہوتا تو يہ لوگ اس کي طرف ہم سے پہلے نہ بڑھتے (ہم خود ہي سب سے پہلے اسے قبول کر ليتے)، اور جب ان (کفار) نے (خود) اس سے ہدايت نہ پائي تو اب کہتے ہيں کہ يہ تو پرانا جھوٹ (اور بہتان) ہےo",
                            "verse 46:23": "اور اس سے پہلے موس?ي (عليہ السلام) کي کتاب (تورات) پيشوا اور رحمت تھي، اور يہ کتاب (اس کي) تصديق کرنے والي ہے، عربي زبان ميں ہے تاکہ ان لوگوں کو ڈرائے جنہوں نے ظلم کيا ہے اور نيکوکاروں کے لئے خوشخبري ہوo",
                            "verse 46:24": "اور اس سے پہلے موسیٰ کی کتاب تھی (لوگوں کے لئے) رہنما اور رحمت۔ اور یہ کتاب عربی زبان میں ہے اسی کی تصدیق کرنے والی تاکہ ظالموں کو ڈرائے۔ اور نیکوکاروں کو خوشخبری سنائے",
                            "verse 46:25": "جن لوگوں نے کہا کہ ہمارا پروردگار خدا ہے پھر وہ (اس پر) قائم رہے تو ان کو نہ کچھ خوف ہوگا اور نہ وہ غمناک ہوں گے",
                            "verse 46:26": "بيشک جن لوگوں نے کہا کہ ہمارا رب اللہ ہے پھر انہوں نے استقامت اختيار کي تو ان پر نہ کوئي خوف ہے اور نہ وہ غمگين ہوں گےo",
                            "verse 46:27": "يہي لوگ اہلِ جنت ہيں جو اس ميں ہميشہ رہنے والے ہيں? يہ ان اعمال کي جزا ہے جو وہ کيا کرتے تھےo",
                            "verse 46:28": "یہی اہل جنت ہیں کہ ہمیشہ اس میں رہیں گے۔ (یہ) اس کا بدلہ (ہے) جو وہ کیا کرتے تھے",
                            "verse 46:29": "اور ہم نے انسان کو اپنے والدین کے ساتھ بھلائی کرنے کا حکم دیا۔ اس کی ماں نے اس کو تکلیف سے پیٹ میں رکھا اور تکلیف ہی سے جنا۔ اور اس کا پیٹ میں رہنا اور دودھ چھوڑنا ڈھائی برس میں ہوتا ہے۔ یہاں تک کہ جب خوب جوان ہوتا ہے اور چالیس برس کو پہنچ جاتا ہے تو کہتا ہے کہ اے میرے پروردگار مجھے توفیق دے کہ تو نے جو احسان مجھ پر اور میرے ماں باپ پر کئے ہیں ان کا شکر گزار ہوں اور یہ کہ نیک عمل کروں جن کو تو پسند کرے۔ اور میرے لئے میری اولاد میں صلاح (وتقویٰ) دے۔ میں تیری طرف رجوع کرتا ہوں اور میں فرمانبرداروں میں ہوں",
                            "verse 46:30": "اور ہم نے انسان کو اپنے والدين کے ساتھ نيک سلوک کرنے کاحکم فرمايا? اس کي ماں نے اس کو تکليف سے (پيٹ ميں) اٹھائے رکھا اور اسے تکليف کے ساتھ جنا، اور اس کا (پيٹ ميں) اٹھانا اور اس کا دودھ چھڑانا (يعني زمان? حمل و رضاعت) تيس ماہ (پر مشتمل) ہے? يہاں تک کہ وہ اپني جواني کو پہنچ جاتا ہے اور (پھر) چاليس سال (کي پختہ عمر) کو پہنچتا ہے، تو کہتا ہے: اے ميرے رب: مجھے توفيق دے کہ ميں تيرے اس احسان کا شکر ادا کروں جو تو نے مجھ پر اور ميرے والدين پر فرمايا ہے اور يہ کہ ميں ايسے نيک اعمال کروں جن سے تو راضي ہو اور ميرے لئے ميري اولاد ميں نيکي اور خير رکھ دے? بيشک ميں تيري طرف رجوع کرتا ہوں اور ميں يقيناً فرمانبرداروں ميں سے ہوںo",
                            "verse 46:31": "يہي وہ لوگ ہيں ہم جن کے نيک اعمال قبول کرتے ہيں اوران کي کوتاہيوں سے درگزر فرماتے ہيں، (يہي) اہلِ جنت ہيں? يہ سچا وعدہ ہے جو ان سے کيا جا رہا ہےo",
                            "verse 46:32": "یہی لوگ ہیں جن کے اعمال نیک ہم قبول کریں گے اور ان کے گناہوں سے درگزر فرمائیں گے اور (یہی) اہل جنت میں (ہوں گے)۔ (یہ) سچا وعدہ (ہے) جو ان سے کیا جاتا ہے",
                            "verse 46:33": "اور جس شخص نے اپنے ماں باپ سے کہا کہ اُف اُف! تم مجھے یہ بتاتے ہو کہ میں (زمین سے) نکالا جاؤں گا حالانکہ بہت سے لوگ مجھ سے پہلے گزر چکے ہیں۔ اور وہ دونوں خدا کی جناب میں فریاد کرتے (ہوئے کہتے) تھے کہ کم بخت ایمان لا۔ خدا کا وعدہ تو سچا ہے۔ تو کہنے لگا یہ تو پہلے لوگوں کی کہانیاں ہیں",
                            "verse 46:34": "اور جس نے اپنے والدين سے کہا: تم سے بيزاري ہے، تم مجھے (يہ) وعدہ ديتے ہو کہ ميں (قبر سے دوبارہ زندہ کر کے) نکالا جاؤں گا حالانکہ مجھ سے پہلے بہت سي امتيں گزر چکيں? اب وہ دونوں (ماں باپ) اللہ سے فرياد کرنے لگے (اور لڑکے سے کہا:) تو ہلاک ہوگا? (اے لڑکے!) ايمان لے آ، بيشک اللہ کا وعدہ حق ہے? تو وہ (جواب ميں) کہتا ہے: يہ (باتيں) اگلے لوگوں کے جھوٹے افسانوں کے سوا (کچھ) نہيں ہيںo",
                            "verse 46:35": "يہي وہ لوگ ہيں جن کے بارے ميں فرمانِ (عذاب) ثابت ہو چکا ہے بہت سي امتوں ميں جو ان سے پہلے گزر چکي ہيں جنّات کي (بھي) اور انسانوں کي (بھي)، بيشک وہ (سب) نقصان اٹھانے والے تھےo",
                            "verse 46:36": "یہی وہ لوگ ہیں جن کے بارے میں جنوں اور انسانوں کی (دوسری) اُمتوں میں سے جو ان سے پہلے گزر چکیں عذاب کا وعدہ متحقق ہوگیا۔ بیشک وہ نقصان اٹھانے والے تھے",
                            "verse 46:37": "اور لوگوں نے جیسے کام کئے ہوں گے ان کے مطابق سب کے درجے ہوں گے۔ غرض یہ ہے کہ ان کو ان کے اعمال کا پورا بدلہ دے اور ان کا نقصان نہ کیا جائے",
                            "verse 46:38": "اور سب کے لئے ان (نيک و بد) اعمال کي وجہ سے جو انہوں نے کئے (جنت و دوزخ ميں الگ الگ) درجات مقرر ہيں تاکہ (ا?) ان کو ان کے اعمال کا پورا پورا بدلہ دے اور ان پر کوئي ظلم نہيں کيا جائے گاo",
                            "verse 46:39": "اور جس دن کافر لوگ آتشِ دوزخ کے سامنے پيش کئے جائيں گے (تو ان سے کہا جائے گا:) تم اپني لذيذ و مرغوب چيزيں اپني دنيوي زندگي ميں ہي حاصل کر چکے اور ان سے (خوب) نفع اندوز بھي ہو چکے? پس آج کے دن تمہيں ذلت کے عذاب کي سزا دي جائے گي اس وجہ سے کہ تم زمين ميں ناحق تکبر کيا کرتے تھے اور اس وجہ سے (بھي) کہ تم نافرماني کيا کرتے تھےo",
                            "verse 46:40": "اور جس دن کافر دوزخ کے سامنے کئے جائیں گے (تو کہا جائے گا کہ) تم اپنی دنیا کی زندگی میں لذتیں حاصل کرچکے اور ان سے متمتع ہوچکے سو آج تم کو ذلت کا عذاب ہے، (یہ) اس کی سزا (ہے) کہ تم زمین میں ناحق غرور کیا کرتے تھے۔ اور اس کی بدکرداری کرتے تھے",
                            "verse 46:41": "سورة الأحقاف رکوع (۴/۳) اور (قوم) عاد کے بھائی (ہود) کو یاد کرو کہ جب انہوں نے اپنی قوم کو سرزمین احقاف میں ہدایت کی اور ان سے پہلے اور پیچھے بھی ہدایت کرنے والے گزرچکے تھے کہ خدا کے سوا کسی کی عبادت نہ کرو۔ مجھے تمہارے بارے میں بڑے دن کے عذاب کا ڈر لگتا ہے",
                            "verse 46:42": "اور (اے حبيب!) آپ قومِ عاد کے بھائي (ہود عليہ السلام) کا ذکر کيجئے، جب انہوں نے (عُمان اور مَہرہ کے درميان يمن کي ايک وادي) اَحقاف ميں اپني قوم کو (اَعمالِ بد کے نتائج سے) ڈرايا حالانکہ اس سے پہلے اور اس کے بعد (بھي کئي) ڈرانے والے (پيغمبر) گزر چکے تھے کہ تم ا? کے سوا کسي اور کي پرستش نہ کرنا، مجھے ڈر ہے کہ کہيں تم پر بڑے (ہولناک) دن کا عذاب (نہ) آجائےo",
                            "verse 46:43": "وہ کہنے لگے کہ کيا آپ ہمارے پاس اس لئے آئے ہيں کہ ہميں ہمارے معبودوں سے برگشتہ کر ديں، پس وہ (عذاب) لے آئيں جس سے ہميں ڈرا رہے ہيں اگر آپ سچوں ميں سے ہيںo",
                            "verse 46:44": "کہنے لگے کیا تم ہمارے پاس اس لئے آئے ہو کہ ہم کو ہمارے معبودوں سے پھیر دو۔ اگر سچے ہو تو جس چیز سے ہمیں ڈراتے ہو اسے ہم پر لے آؤ",
                            "verse 46:45": "(انہوں نے) کہا کہ (اس کا) علم تو خدا ہی کو ہے۔ اور میں تو جو (احکام)دے کر بھیجا گیا ہوں وہ تمہیں پہنچا رہا ہوں لیکن میں دیکھتا ہوں کہ تم لوگ نادانی میں پھنس رہے ہو",
                            "verse 46:46": "انہوں نے کہا کہ (اس عذاب کے وقت کا) علم تو ا? ہي کے پاس ہے اور ميں تمہيں وہي احکام پہنچا رہا ہوں جو ميں دے کر بھيجا گيا ہوں ليکن ميں تمہيں ديکھ رہا ہوں کہ تم جاہل لوگ ہوo",
                            "verse 46:47": "پھر جب انہوں نے اس (عذاب) کو بادل کي طرح اپني واديوں کے سامنے آتا ہوا ديکھا تو کہنے لگے: يہ (تو) بادل ہے جو ہم پر برسنے والا ہے، (ايسا نہيں ہے) بلکہ وہ (بادل) تو وہ (عذاب) ہے جس کي تم نے جلدي مچا رکھي تھي? (يہ) آندھي ہے جس ميں دردناک عذاب (آرہا) ہےo",
                            "verse 46:48": "پھر جب انہوں نے اس (عذاب کو) دیکھا کہ بادل (کی صورت میں) ان کے میدانوں کی طرف آرہا ہے تو کہنے لگے یہ تو بادل ہے جو ہم پر برس کر رہے گا۔ (نہیں) بلکہ (یہ) وہ چیز ہے جس کے لئے تم جلدی کرتے تھے یعنی آندھی جس میں درد دینے والا عذاب بھرا ہوا ہے",
                            "verse 46:49": "ہر چیز کو اپنے پروردگار کے حکم سے تباہ کئے دیتی ہے تو وہ ایسے ہوگئے کہ ان کے گھروں کے سوا کچھ نظر ہی نہیں آتا تھا۔ گنہگار لوگوں کو ہم اسی طرح سزا دیا کرتے ہیں",
                            "verse 46:50": "(جو) اپنے پروردگار کے حکم سے ہر شے کو تباہ و برباد کر دے گي پس وہ ايسے (تباہ) ہو گئے کہ ان کے (مِسمار) گھروں کے سوا کچھ نظر ہي نہيں آتا تھا? ہم مجرم لوگوں کو اِس طرح سزا ديا کرتے ہيںo",
                            "verse 46:51": "(اے اہلِ مکہّ!) درحقيقت ہم نے ان کو ان امور ميں طاقت و قدرت دے رکھي تھي جن ميں ہم نے تم کو قدرت نہيں دي اور ہم نے انہيں سماعت اور بصارت اور دل و دماغ (کي بے بہا صلاحيتوں) سے نوازا تھا مگر نہ تو ان کے کان ہي ان کے کچھ کام آسکے اور نہ ان کي آنکھيں اور نہ (ہي) ان کے دل و دماغ جبکہ وہ ا? کي نشانيوں کا انکار ہي کرتے رہے اور (بالآخر) اس (عذاب) نے انہيں آگھيرا جس کا وہ مذاق اڑايا کرتے تھےo",
                            "verse 46:52": "اور ہم نے ان کو ایسے مقدور دیئے تھے جو تم لوگوں کو نہیں دیئے اور انہیں کان اور آنکھیں اور دل دیئے تھے۔ تو جب کہ وہ خدا کی آیتوں سے انکار کرتے تھے تو نہ تو ان کے کان ہی ان کے کچھ کام آسکے اور نہ آنکھیں اور نہ دل۔ اور جس چیز سے استہزاء کیا کرتے تھے اس نے ان کو آ گھیرا",
                            "verse 46:53": "سورة الأحقاف رکوع (۴/۴) اور تمہارے اردگرد کی بستیوں کو ہم نے ہلاک کر دیا۔ اور بار بار (اپنی) نشانیاں ظاہر کردیں تاکہ وہ رجوع کریں",
                            "verse 46:54": "اور (اے اہلِ مکہّ!) بيشک ہم نے کتني ہي بستيوں کو ہلاک کر ڈالا جو تمہارے اردگرد تھيں اور ہم نے اپني نشانياں بار بار ظاہر کيں تاکہ وہ (کفر سے) رجوع کر ليںo",
                            "verse 46:55": "پھر ان (بتوں) نے ان کي مدد کيوں نہ کي جن کو انہوں نے تقرّبِ (ال?ہي) کے لئے ا? کے سوا معبود بنا رکھا تھا، بلکہ وہ (معبودانِ باطلہ) ان سے گم ہو گئے، اور يہ (بتوں کو معبود بنانا) ان کا جھوٹ تھا اور يہي وہ بہتان (تھا) جو وہ باندھا کرتے تھےo",
                            "verse 46:56": "تو جن کو ان لوگوں نے تقرب (خدا) کے سوا معبود بنایا تھا انہوں نے ان کی کیوں مدد نہ کی۔ بلکہ وہ ان (کے سامنے) سے گم ہوگئے۔ اور یہ ان کا جھوٹ تھا اور یہی وہ افتراء کیا کرتے تھے",
                            "verse 46:57": "اور جب ہم نے جنوں میں سے کئی شخص تمہاری طرف متوجہ کئے کہ قرآن سنیں۔ تو جب وہ اس کے پاس آئے تو (آپس میں) کہنے لگے کہ خاموش رہو۔ جب (پڑھنا) تمام ہوا تو اپنی برادری کے لوگوں میں واپس گئے کہ (ان کو) نصیحت کریں",
                            "verse 46:58": "اور (اے حبيب!) جب ہم نے جنّات کي ايک جماعت کو آپ کي طرف متوجہ کيا جو قرآن غور سے سنتے تھے? پھر جب وہ وہاں (يعني بارگاہِ نبوت ميں) حاضر ہوئے تو انہوں نے (آپس ميں) کہا: خاموش رہو، پھر جب (پڑھنا) ختم ہو گيا تو وہ اپني قوم کي طرف ڈر سنانے والے (يعني داعي الي الحق) بن کر واپس گئےo",
                            "verse 46:59": "انہوں نے کہا: اے ہماري قوم (يعني اے قومِ جنّات)! بيشک ہم نے ايک (ايسي) کتاب سني ہے جو موس?ي (عليہ السلام کي تورات) کے بعد اتاري گئي ہے (جو) اپنے سے پہلے (کي کتابوں) کي تصديق کرنے والي ہے (وہ) سچّے (دين) اور سيدھے راستے کي طرف ہدايت کرتي ہےo",
                            "verse 46:60": "کہنے لگے کہ اے قوم! ہم نے ایک کتاب سنی ہے جو موسیٰ کے بعد نازل ہوئی ہے۔ جو (کتابیں) اس سے پہلے (نازل ہوئی) ہیں ان کی تصدیق کرتی ہے (اور) سچا (دین) اور سیدھا رستہ بتاتی ہے",
                            "verse 46:61": "اے قوم! خدا کی طرف بلانے والے کی بات قبول کرو اور اس پر ایمان لاؤ۔ خدا تمہارے گناہ بخش دے گا اور تمہیں دکھ دینے والے عذاب سے پناہ میں رکھے گا",
                            "verse 46:62": "اے ہماري قوم! تم ا? کي طرف بلانے والے (يعني محمد رسول ا? صلي اللہ عليہ وآلہ وسلم) کي بات قبول کر لو اور ان پر ايمان لے آؤ (تو) ا? تمہارے گناہ بخش دے گا اور تمہيں دردناک عذاب سے پناہ دے گاo",
                            "verse 46:63": "اور جو شخص ا? کي طرف بلانے والے (رسول صلي اللہ عليہ وآلہ وسلم) کي بات قبول نہيں کرے گا تو وہ زمين ميں (بھاگ کر ا? کو) عاجز نہيں کر سکے گا اور نہ ہي اس کے لئے ا? کے سوا کوئي مددگار ہوں گے? يہي لوگ کھلي گمراہي ميں ہيںo",
                            "verse 46:64": "اور جو شخص خدا کی طرف بلانے والے کی بات قبول نہ کرے گا تو وہ زمین میں (خدا کو) عاجز نہیں کرسکے گا اور نہ اس کے سوا اس کے حمایتی ہوں گے۔ یہ لوگ صریح گمراہی میں ہیں",
                            "verse 46:65": "کیا انہوں نے نہیں سمجھا کہ جس خدا نے آسمانوں اور زمین کو پیدا کیا اور ان کے پیدا کرنے سے تھکا نہیں۔ وہ اس (بات) پر بھی قادر ہے کہ مردوں کو زندہ کر دے۔ ہاں ہاں وہ ہر چیز پر قادر ہے",
                            "verse 46:66": "کيا وہ نہيں جانتے کہ ا? جس نے آسمانوں اور زمين کو پيدا فرمايا اور وہ ان کے پيدا کرنے سے تھکا نہيں اس بات پر (بھي) قادر ہے کہ وہ مُردوں کو (دوبارہ) زندہ فرما دے? کيوں نہيں! بيشک وہ ہر چيز پر قدرت رکھتا ہےo",
                            "verse 46:67": "اور جس دن وہ لوگ جنہوں نے کفر کيا آتشِ دوزخ کے سامنے پيش کئے جائيں گے (تو ان سے کہا جائے گا:) کيا يہ (عذاب) برحق نہيں ہے؟ وہ کہيں گے: کيوں نہيں! ہمارے رب کي قسم (برحق ہے)، ارشاد ہوگا: پھر عذاب کا مزہ چکھو جس کا تم انکار کيا کرتے تھےo",
                            "verse 46:68": "اور جس روز آگ کے سامنے کئے جائیں گے (اور کہا جائے گا) کیا یہ حق نہیں ہے؟ تو کہیں گے کیوں نہیں ہمارے پروردگار کی قسم (حق ہے) حکم ہوگا کہ تم جو (دنیا میں) انکار کیا کرتے تھے (اب) عذاب کے مزے چکھو",
                            "verse 46:69": "پس (اے محمد) جس طرح اور عالی ہمت پیغمبر صبر کرتے رہے ہیں اسی طرح تم بھی صبر کرو اور ان کے لئے (عذاب) جلدی نہ مانگو۔ جس دن یہ اس چیز کو دیکھیں گے جس کا ان سے وعدہ کیا جاتا ہے تو (خیال کریں گے کہ) گویا (دنیا میں) رہے ہی نہ تھے مگر گھڑی بھر دن۔ (یہ قرآن) پیغام ہے۔ سو (اب) وہی ہلاک ہوں گے جو نافرمان تھے",
                            "verse 46:70": "(اے حبيب!) پس آپ صبر کئے جائيں جس طرح (دوسرے) عالي ہمّت پيغمبروں نے صبر کيا تھا اور آپ ان (منکروں) کے لئے (طلبِ عذاب ميں) جلدي نہ فرمائيں، جس دن وہ اس (عذابِ آخرت) کو ديکھيں گے جس کا ان سے وعدہ کيا جا رہا ہے تو (خيال کريں گے) گويا وہ (دنيا ميں) دن کي ايک گھڑي کے سوا ٹھہرے ہي نہيں تھے، (يہ ا? کي طرف سے) پيغام کا پہنچايا جانا ہے، نافرمان قوم کے سوا ديگر لوگ ہلاک نہيں کئے جائيں گےo تھے"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 46:1": "Ҳа мийм.",
                            "verse 46:2": "Китобнинг туширилиши Ғолиб ва ҳикматли Аллоҳ тарафидандир.",
                            "verse 46:3": "Осмонлару ерни ҳамда улар ўртасидаги нарсаларни фақат ҳақ ва белгиланган муддат ила яратдик.",
                            "verse 46:4": "Сен:« Аллоҳдан ўзга сиғинаётган нарсаларингизнинг хабарини беринг-чи, менга кўрсатинг-чи, улар ердан нимани яратдилар? Ёки осмонларни (яратишда) иштироклари борми? Агар ростгўй бўлсаларингиз, менга бундан (Қуръондан) олдинги китобни ёки илмий асарни келтиринг.",
                            "verse 46:5": "Аллоҳни қўйиб, қиёмат кунигича дуосини мустажоб қилолмайдиганларга илтижо этадиганлардан ҳам адашганроқлар борми?! Ҳолбуки, У(бут)лар уларнинг дуосидан ғофилдирлар.",
                            "verse 46:6": "Одамлар маҳшарга тўпланганда, (бутлар) уларга душман бўлурлар ва ибодатларига ҳам мункир бўлурлар.",
                            "verse 46:7": "Қачонки уларга равшан оятларимиз тиловот қилинса, куфр келтирганлар Ҳақ (Қуръон) уларга келгандаёқ, бу очиқ-ойдин сеҳрдир, дерлар.",
                            "verse 46:8": "Балки у(Қуръон)ни ўзи тўқиб олган ҳам дерлар.",
                            "verse 46:9": "Сен:»Мен биринчи Пайғамбар эмасман, менга ва сизларга нима қилинишини билмайсман.",
                            "verse 46:10": "Сен:«Айтинг-чи, агар у(Қуръон) Аллоҳдан бўлса-ю, сиз унга куфр келтирсангиз ва ҳолбуки, Бани Исроилдан бир гувоҳ у(Қуръон)га ўхшаш нарсага гувоҳлик бериб, иймон келтириб турибди, сиз эса, кибру ҳаво қиляпсиз.",
                            "verse 46:11": "Куфр келтирганлар иймон келтирганларга: «Агар у(Қуръон) яхшилик бўлганида, унга биздан аввал бормасдилар», дерлар.",
                            "verse 46:12": "У(Қуръон)дан олдин Мусонинг китоби йўл бошловчи ва раҳмат эди.",
                            "verse 46:13": "Албатта «Роббимиз Аллоҳдир» деган, сўнгра бунда мустақим турганларга хавф йўқдир ва улар хафа ҳам бўлмаслар.",
                            "verse 46:14": "Ана ўшалар жаннат эгаларидир, унда қилган амаллари мукофотига абадий қолурлар.",
                            "verse 46:15": "Биз инсонни ота-онасига яхшилик қилишга буюрдик.",
                            "verse 46:16": "Ана ўшаларнинг энг яхши амалларни қабул қилиб, ёмонликларини ўтиб юборурмиз.",
                            "verse 46:17": "Ота-онасига: «Уфф сизларга, (қабрдан) чиқарилишимнинг ваъдасини бераяпсизларми?! Мендан аввал ҳам асрлар ўтган-ку!» деган кишига, Аллоҳдан мадад сўраган ҳолда улар: «Ҳолингга вой бўлгур, иймон келтир, албатта, Аллоҳнинг ваъдаси ҳақдир», дедилар.",
                            "verse 46:18": "Ана ўшаларга ўзларидан аввал ўтган жин ва инс умматлари қаторида (азоб) сўзи ҳақ бўлгандир.",
                            "verse 46:19": "Ҳар бирларига қилган амалларига яраша даражалар бордир.",
                            "verse 46:20": "Куфр келтирганлар дўзахга кўндаланг қилинган кунда (уларга): «Ҳаёти дунёдаёқ ҳузур ҳаловатингизни кетказиб, мазасини татиб бўлгансиз.",
                            "verse 46:21": "Ўз қавмини қум тепаликларда огоҳлантирган Однинг биродарини эсла! Ва ҳолбуки, ундан аввал ҳам, кейин ҳам огоҳлантирувчилар ўтган.",
                            "verse 46:22": "Улар:«Бизни худоларимиздан оздиришга келдингми? Агар ростгўйлардан бўлсанг, бизга ваъда қилаётган нарсангни келтир», дедилар.",
                            "verse 46:23": "У:«Албатта, илм Аллоҳнинг ҳузуридадир.",
                            "verse 46:24": "У(азоб)нинг водийлари томон кўндаланг бўлиб юрганини кўришганда, бу кўндаланг бўлувчи, бизга ёмғир ёғдирур, дедилар.",
                            "verse 46:25": "У Роббисининг амри ила ҳар бир нарсани вайрон қилур.",
                            "verse 46:26": "Ва, дарҳақиқат, Биз уларга сизга бермаган имконларни берган эдик.",
                            "verse 46:27": "Ҳақиқатда, атрофингиздаги шаҳар-қишлоқларни ҳалокатга учратдик ва шоядки, ўзларига қайтсалар, деб ҳужжат-далилларни баён қилдик.",
                            "verse 46:28": "Қани энди, Аллоҳни қўйиб, (У зотга) яқинлаштирувчи деб тутинган худолари уларга ёрдам берсалар эди.",
                            "verse 46:29": "Ва сен томон бир гуруҳ жинларни Қуръон эшитишга бурганимизни эсла .",
                            "verse 46:30": "«Эй, қавмимиз! Биз Мусодан кейин туширилган, ўзидан аввалги нарса(китоб)ларни тасдиқловчи, ҳақ(дин)га ва тўғри йўлга ҳидоят қилувчи китобни эшитдик.",
                            "verse 46:31": "Эй, қавмимиз, Аллоҳнинг даъватчисига жавоб беринг ва Унга иймон келтиринг: У зот сизларнинг гуноҳларингизни мағфират қиладир ва аламли азобдан сақлайдир.",
                            "verse 46:32": "Кимки, Аллоҳнинг даъватчисини қабул қилмаса, бас у ер юзида қочиб қутила олувчи эмасдир ва унга У зотдан ўзга валийлар ҳам йўқдир.",
                            "verse 46:33": "Улар осмонлару ерни яратган ва уларни яратишда беҳол бўлмаган зот–Аллоҳ, ўликларни ҳам тирилтиришга қодир эканини англаб етмадиларми? Зеро, У зот ҳар бир нарсага қодирдир.",
                            "verse 46:34": "Куфр келтирганлар дўзахга кўндаланг қилинган кунда: «Бу ҳақиқат эмасми?!» (дейилур).",
                            "verse 46:35": "Бас, азму-матонат соҳиби бўлган Пайғамбарлар сабр қилгандек, сабр қил, уларга (азоб етишига) шошилма!Улар ваъда қилинган нарсани кўрганларида худди (бу дунёда) кундуздан бир лаҳзагина турганга ўхшарлар."
                        }
                    }
                }
            }
        }
    }
}