{
    "id": 47,
    "name_simple": "Muhammad",
    "revelation_place": "madinah",
    "revelation_order": 95,
    "bismillah_pre": true,
    "verses_count": 38,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah derives its name from the sentence wa amanu bi-ma nuzzila ala Muhammad-in of verse 2, thereby implying that it is the Surah in which the holy name of Muhammad (upon wham be Allah's peace and blessings) has occurred. Besides, it has another well known name 'al-Qital' also, which is derived from the sentence wa dhukira fi-hal-qital of verse 20.",
    "text": [
        "\n",
        "The Surah derives its name from the sentence wa amanu bi-ma nuzzila ala Muhammad-in of verse 2, thereby implying that it is the Surah in which the holy name of Muhammad (upon wham be Allah's peace and blessings) has occurred. Besides, it has another well known name \"al-Qital \" also, which is derived from the sentence wa dhukira fi-hal-qital of verse 20.",
        "\n",
        "Period of Revelation",
        "\n",
        "The contents of this Surah testify that it was sent down after the hijrah at Madinah at the time when the fighting had been enjoined, though active fighting had not yet been undertaken. Detailed arguments in support of this view have been given in E. N. 8 below.",
        "\n",
        "Historical Background",
        "\n",
        "The conditions at the time when this Surah was sent down were such that the Muslims were being made the target of persecution and tyranny in Makkah in particular and in Arabia in general, and life had become miserable for them. Although the Muslims had emigrated to the haven of Madinah from every side, the disbelieving Quraish were not prepared to leave them alone and let them live in peace even there. Thus, the small settlement of Madinah was hemmed in by the enemy, who was bent upon exterminating it completely. The only alternative left with the Muslims were that either they should surrender to the forces of ignorance, giving up their mission of preaching the true Faith, or even following it in their private lives, or should rise to wage a war at the cost of their lives to settle finally and for ever whether Islam would stay in Arabia or the creed of ignorance. On this occasion Allah showed the Muslims the same way of resolution and will, which is the only way for the true\r\nbelievers. He first permitted them to fight in Surah Al Hajj 39 and then enjoined fighting in Al Baqarah 190. But at that time everyone knew fully well what it meant to wage a war in those conditions. There were only a handful of Muslims in Madinah, who could not muster even a thousand soldiers; yet they were being urged to take up the sword and clash against the pagan forces of the whole of Arabia. Then the kind of the weapons needed to equip its soldiers for war could hardly be afforded by the town in which hundreds of emigrants were still homeless and unsettled even by resort to starving its members at a time when it had been boycotted economically by the Arabs on all sides.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Such were the conditions when this Surah was revealed. Its theme is to prepare the believers for war and to give them preliminary instructions in this regard. That is why it has also been entitled al-Qital. It deals with the following topics:",
        "\n",
        "At the outset it is said that of the two groups confronting each other at this time, one has refused to accept the Truth and has become an obstruction for others on the way of Allah, while the other group has accepted the Truth which had been sent down by Allah to His servant, Muhammad (upon whom be Allah's peace and blessings). Now, Allah's final decision is that He has rendered fruitless and vain all the works of the former group and set right the condition and affairs of the latter group.",
        "\n",
        "After this, the Muslims have been given the initial war instructions they have been reassured of Allah's help and guidance: they have been given hope for the best rewards on offering sacrifices in the cause of Allah and they have been assured that their struggle in the cause of the Truth will not go to waste, but they will be abundantly rewarded both in this world and in the Hereafter.",
        "\n",
        "Furthermore, about the disbelievers it has been said that they are deprived of Allah's support and guidance: none of their designs will succeed in their conflict with the believers, and they will meet a most evil fate both in this world and in the Hereafter. They thought they had achieved a great success by driving the Prophet of Allah out of Makkah, but in fact by this they had hastened their own doom.",
        "\n",
        "After this, the discourse turns to the hypocrites, who were posing to be sincere Muslims before the command to fight was sent down, but were confounded when this command actually came down, and began to conspire with the disbelievers in order to save themselves from the hazards of war. They have been plainly warned to the effect that no act and deed is acceptable to Allah of those who adopt hypocrisy with regard to Him and His Prophet. There, the basic issue against which all those who profess the Faith are being tried is whether one is on the side of the Truth or Falsehood, whether one's sympathies are with Islam and the Muslims or with disbelief and the disbelievers, whether one keeps one's own self and interests dearer or the Truth which one professes to believe in and follow. One who fails in this test is not at all a believer; his Prayer and his Fasting and his discharging of the zakat deserve no reward from Allah.",
        "\n",
        "Then the Muslims have been exhorted not to lose heart for being small in numbers and ill equipped as against the great strength of the disbelievers: they should not show weakness by offering peace to them, which might still further embolden them against Islam and the Muslims, but they should come out with trust in Allah and clash with the mighty forces of disbelief. Allah is with the Muslims: they alone shall triumph; and the might of disbelief will be humbled and vanquished.",
        "\n",
        "In conclusion, the Muslims have been invited to spend their wealth in the cause of Allah. Although at that time they were economically very weak, the problem that they confronted was the very survival of Islam and the Muslims. The importance and delicacy of the problem demanded that the Muslims should not only risk their lives for safeguarding themselves and their Faith from the dominance of disbelief and for exalting Allah's Religion but should also expend their economic resources as far as possible in the preparations for war. Therefore, they were clearly warned to the effect. Anyone who adopted a niggardly attitude at the time, would not, in fact, harm Allah at all, but would result in his own destruction, for Allah does not stand in need of help from men. If one group of men shirked offering sacrifices in the cause of His Religion, Allah would remove it and bring another group in its place.",
        "\n"
    ],
    "description": "The surah that declares that God absolves of misdeeds, and sets right the intellects, of those who work righteousness and who believe in all that God has sent down upon His final Messenger to humankind, Muḥammad. It takes its name from verse 2, where the name of the Prophet occurs. The surah deals with issues of war, those who try to prevent conversion to Islam and the carrying out of God’s commands, and the fate of the hypocrites. It specifically mentions the iniquity of those who expelled the Prophet from Mecca, it describes the futility of the disbelievers’ attempts to oppose God and His Prophet, and it urges the Muslims to obey God in all matters, lest their good deeds come to nothing on the Day of Judgement like those of the disbelievers and hypocrites.The surah is also known as: Mohammad, Muhammad (the Prophet).",
    "name_complex": "Muhammad",
    "surah_name_ar": "محمد",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 47:1": "Ata që kanë mohuar dhe që i penguan (njerëzit) në rrugën e Perëndisë – Ai, ua ka shkatërruar veprat e tyre.",
                            "verse 47:2": "E, ata që besojnë dhe punojnë vepra të mira dhe besojnë në atë që i është shpallur Muhammedit – e ajo është e Vërteta prej Zotit të tyre, - Ai do t’jua mbulojë mëkatet dhe do t’ua përmirësojë gjendjen atyre,",
                            "verse 47:3": "meqë, ata që kanë mohuar mbështeten në të pavërtetën, kurse besimtarët mbështeten në të Vërtetën e Zotit të tyre.",
                            "verse 47:4": "E, kur të takoheni në luftë me mohuesit, bini në qafë derisa t’i rraskapitni e t’i shkatërroni ata, e pastaj lidhin (zëni robër), dhe mandej, ose i lironi me zemërgjerësi ose me kompensim, përderisa të mos bëhet armëpushimi.",
                            "verse 47:5": "dhe Ai, me siguri, do t’i udhëzojë ata dhe do t’ua përmirësojë gjendjen e tyre,",
                            "verse 47:6": "dhe do t’i shpie në xhennet ata, të cilin madje, ua ka përshkruar atyre.",
                            "verse 47:7": "O besimtarë, nëse ndimoni Perëndinë (rrugën e Tij), edhe Ai do t’ju ndihmon juve dhe do t’ua mundësojë përparimin tuaj.",
                            "verse 47:8": "E, ata që nuk besojnë – shkatërrimi për ta! Ai ua humbë veprat atyre.",
                            "verse 47:9": "Kjo është, ngase ata e urrejnë atë që e ka shpallë Perëndia, andaj Ai ua ka shkatërruar veprat e tyre.",
                            "verse 47:10": "Vallë, a nuk kanë udhëtuar ata nëpër Tokë, për të parë përfundimin e atyre të mëparshmëve?! Perëndia i ka zhdukur ata plotësisht, e kështu do të përfundojnë edhe mohuesit e tjerë.",
                            "verse 47:11": "Kjo është (ngase) Perëndia është mbojtës i atyre që besojnë – dhe, meqë, me të vërtetë, për mohuesit nuk ka mbrojtës (ndihmës).",
                            "verse 47:12": "Perëndia, me të vërtetë, ata që besojnë dhe bëjnë vepra të mira, do t’i shpie në xhennete, nëpër të cilat rrjedhin lumenj; e ata që nuk besojnë – që kënaqen dhe gëlltisin ashtu siç gëlltisin shtazët, vendbanim i tyre është zjarri!",
                            "verse 47:13": "Shumë vende (qytete) kanë qenë më të fuqishme se vendi yt që të ka përzënë ty.",
                            "verse 47:14": "Vallë, a është i njëjtë ai që (pason) argumentet e qarta të Zotit të tij me atë që i zbukurohen punët e veta të shëmtuara dhe (i cili) pason epshet e veta?!",
                            "verse 47:15": "Shembulli i xhennetit, që u është premtuar besimtarëve – në të cilin gjenden lumenj me ujë të paprishur, dhe lumenj të qumështit me shije të pandryshuar, dhe lumenj të verës me shije të këndshme për ata që e pinë (pa përbërje alkooli), dhe lumenj prej mjaltit të kulluar, në të kanë edhe llojlloj pemësh dhe falje (të mëkateve) prej Zotit të tyre, (a është njësoj si shembulli i atij) i cili është përherë në zjarr dhe të cilëve u jepet ujë i vëluar, që ua copton zorrët?!",
                            "verse 47:16": "Në mes tyre ka (edhe të atillë) që të përgjojnë ty, e posa të largohen prej teje, i pyesin ata të cilëve u është dhënë dijenia: “C’tha ai më parë?!” Këta janë ata, zemrat e të cilëve ua ka vulosur Perëndia dhe të cilët ndjekin epshet e veta.",
                            "verse 47:17": "E, ata që kanë marrë rrugën e drejtë, Ai (Perëndia) ua shton udhëzimin dhe u jep atyre (forcon) ruajtjen (nga zjarri).",
                            "verse 47:18": "A mos vallë mohuesit presin që t’u vie befasisht (edhe) vetëm Casti i caktuar, e madje – me të vërtetë, shenjat e tij kanë ardhur? E, çka do t’u shërbejnë atyre këshillat kur t’ju vie ai (Casti)?!",
                            "verse 47:19": "Dije se s’ka zot (tjetër) pos Perëndisë! Kërko falje për mëkatet tua dhe për besimtarët e besimtaret.",
                            "verse 47:20": "E, thonë ata që kanë besuar: “Sikur të ishte shpallur një sure!” E, kur u shpall një sure e qartë dhe në të u përmend (obligimi) i luftës, i sheh ti ata zemrash të sëmuara (me besim të dyshimtë), si të shikojnë ty me shikimin si të agonisë së jetës! E, më e përshtatshme do të ishte për ata –",
                            "verse 47:21": "përulja dhe fjala e mirë! E, kur, madje është caktuar dispozita e luftës, më mirë do të ishte për ta, (atëherë) të jenë të sinqertë ndaj Perëndisë.",
                            "verse 47:22": "E, vallë ndoshta edhe ju (hipokritët) sikur të vinit në pushtet, do të bënit ngatërresa (zullum) në Tokë dhe do t’i shkatërronit lidhjet farefisnore?!",
                            "verse 47:23": "Këta janë ata, të cilët i ka mallkuar Perëndia dhe i ka bërë të shurdhër (ndaj së vërtetës) dhe ua ka verbuar sytë (për të parë rrugën e vërtetë).",
                            "verse 47:24": "Vallë, a nuk duan ata të mendojnë për Kur’anin, apo në zemrat e tyre ka dryna?!",
                            "verse 47:25": "Me të vërtetë, ata që janë kthyer prapa (në mohim), pasi u është treguar atyre rruga e drejtë, djalli i ka shpie në mëkat dhe i ka udhqyer ata me shpresë të rrejshme.",
                            "verse 47:26": "Kjo ngjet, ngase ata u thonin atyre, të cilët nuk e donin atë që e ka shpallur Perëndia: “Na do t’ju përulemi juve në disa gjëra”, - e Perëndia i di mirë fshehtësitë e tyre.",
                            "verse 47:27": "E, (çka do të bëjnë) ata, kur engjëjt do t’u marrin shpirtin atyre, duke i rrahur ata nëpër fytyrat dhe shpindët e tyre.",
                            "verse 47:28": "Kjo (mënyrë e vdekjes) është, ngase ata, pasuan atë që shkakton pezmin e Perëndisë dhe që urrenin kënaqësinë e Tij; e Ai, ua ka shkatërruar veprat e tyre.",
                            "verse 47:29": "Vallë, a mendojnë ata me zemra të sëmura – se, Perëndia nuk do t’ua qet në shesh urrejtjen e tyre?",
                            "verse 47:30": "E, sikur të donim, Ne do t’i tregonim ty ata, e ti me siguri, do t’i njihje ata, sipas shenjave të tyre (të fytyrës).",
                            "verse 47:31": "Ne do t’ju vëmë në sprovë juve, përderisa t’i njohim në thelb ata të cilët prej jush luftojnë (në rrugën e drejtë) dhe durojnë (mundimin), si dhe për t’i vërtetuar lajmet për veprat tuaja.",
                            "verse 47:32": "Me të vërtetë, ata që nuk besojnë dhe i pengojnë (të tjerët) nga rruga e Perëndisë dhe kundërshtojnë Pejgamberin, pasi që atyre u është shpjeguar qartë rruga e drejtë, nuk do t’i sjellin (me këtë) Perëndisë kurrfarë dëmi, e Ai do t’ua zhdukë veprat e tyre.",
                            "verse 47:33": "O ju që keni besuar! Përuljuni Perëndisë dhe përuljni Pejgamberit (të Tij) dhe mos i prishni veprat tuaja!",
                            "verse 47:34": "Me të vërtetë, ata që nuk besojnë e vdesin si mohues, Perëndia, kurrsesi, nuk do t’i falë ata.",
                            "verse 47:35": "Dhe, mos u bëni qyqarë dhe mos afroni paqë duke qenë ju më të fuqishëm, sepse Perëndia është me ju (në ndihmë tuaj), Ai nuk ua pakëson shpërblimin e veprave tuaja.",
                            "verse 47:36": "Jeta e kësaj bote nuk është asgjë tjetër, pos lojë dhe zbavitje, e nëse besoni dhe ruheni (prej të këqiave), Ai do t’ju shpërblejë juve dhe nuk do të kërkojë prej jush (tërë) pasurinë tuaj.",
                            "verse 47:37": "Sikur ta kërkonte prej jush atë (tërë pasurinë me këmbëngulje), do të bëheshit koprrac dhe do të shkaktonte urrejtjen tuaj.",
                            "verse 47:38": "Ja, pra, ju thirreni se shpenzoni në rrugën e Perëndisë, por disa prej jush janë koprrac, - e kush është koprrac, është koprrac në dëm të vet, sepse Perëndia është i pasur (s’ka nevojë për asgjë), ndërsa ju jeni të varfër (jeni nevojtarë për gjithçka)."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Kafir olanların və (insanları) Allah yolundan döndərənlərin əməllərini (Allah) puç edəcəkdir.",
                            "verse 47:2": "İman gətirib yaxşı əməllər edənlərin, Rəbbindən Muhəmmədə haqq olaraq nazil edilənə (Qur'ana) inanların isə günahlarının üstünü örtəcək, onların əhvalını (dünyada və axirətdə) düzəldəcəkdir (yaxşılaşdıracaqdır).",
                            "verse 47:3": "Bu ona görədir ki, kafirlər batilə uymuş, iman gətirənlər isə öz Rəbbindən gələn haqqa (Qur'ana) tabe olmuşlar.",
                            "verse 47:4": "(Ey mö'minlər!) Kafirlərlə (döyüş meydanında) qarşılaşdığınız zaman boyunlarını vurun.",
                            "verse 47:5": "(Allah) onları doğru yola müvəffəq edəcək, onların əhvalını (dünyada və axirətdə) düzəldəcəkdir.",
                            "verse 47:6": "Və onları (dünyada) özlərinə tanıtmış olduğu Cənnətə daxil edəcəkdir.",
                            "verse 47:7": "Ey iman gətirənlər! Əgər siz Allaha (Allahın dininə və Peyğəmbərinə) yardım göstərsəniz, O da sizə yardım göstərər və sizi sabitqədəm (cihadda möhkəm, qüvvətli) edər.",
                            "verse 47:8": "Kafirlərə gəldikdə isə - hamısı məhv olsun - onların əməllərini puça çıxardar!",
                            "verse 47:9": "Bu ona görədir ki, (kafirlər) Allahın nazil etdiyini (Qur'anı) bəyənmədilər, (Allah da) onların əməllərini puç etdi.",
                            "verse 47:10": "Məgər onlar yer üzünü dolaşıb özlərindən əvvəlkilərin aqibətinin necə olduğunu görmürlərmi?! Allah onları yerlə yeksan etdi.",
                            "verse 47:11": "Ona görə ki, Allah iman gətirənlərin dostudur (himayədarıdır).",
                            "verse 47:12": "Allah iman gətirib yaxşı əməllər edənləri (ağacları) altından çaylar axan cənnətlərə daxil edər.",
                            "verse 47:13": "(Ya Peyğəmbər! Qövmünün) səni çıxartdığı şəhərdən (şəhər əhlindən) daha qüvvətli neçə-neçə şəhərlər (şəhər əhli) var idi ki, Biz onları məhv etdik və özlərinə bir kömək edən də tapılmadı!",
                            "verse 47:14": "Məgər Rəbbindən bir dəlilə olan (dəlilə istinad edən) kimsə pis əməli özünə yaxşı göstərilən kimsə kimidirmi?! Belələri öz nəfslərinə uymuşlar.",
                            "verse 47:15": "Müttəqilərə və'd olunan Cənnətin vəsfi belədir: orada dadı dəyişməyən (qoxumayan) sudan irmaqlar, təmi çönməyən süddən çaylar, içənlərə ləzzət verən şərabdan nəhrlər və təmiz baldan irmaqlar vardır.",
                            "verse 47:16": "(Ya Peyğəmbər!) Onların (kafirlərin) içərisində elələri də vardır ki, səni dinləyər, sənin yanından çıxıb gedən kimi elm verilmiş kimsələrdən (səhabədən istehza ilə): \"(Muhəmməd) bu saat nə dedi?!\" - deyə soruşarlar.",
                            "verse 47:17": "Doğru yolu tapanlara gəldikdə isə, (Allah) onların doğruluğunu daha da artırar və onlara təqvalarının (mö'minliklərinin, Allahdan qorxub pis əməllərdən çəkinmələrinin) mükafatını verər!",
                            "verse 47:18": "Onlar (kafirlər) ancaq o saatın (qiyamət saatının) qəfildən başlarının üstünü almasınımı gözləyirlər? Onun əlamətləri artıq gəlmişdir.",
                            "verse 47:19": "(Ya Rəsulum!) Bil ki, Allahdan başqa heç bir tanrı yoxdur.",
                            "verse 47:20": "Mö'minlər: \"Kaş (cihad barəsində) bir surə nazil olaydı!\" - deyirdilər.",
                            "verse 47:21": "İtaət etmək və gözəl bir söz demək (sənin əmrini dinməz-söyləməz yerinə yetirmək).",
                            "verse 47:22": "Əgər (Muhəmməd əleyhissəlamdan) üz döndərsəniz, sizdən yer üzündə fitnə-fəsad törətmək və (Cahiliyyət dövründə olduğu kimi) qohumluq tellərini qırmaq gözlənilməzmi?!",
                            "verse 47:23": "Onlar (münafiqlər, fitnə-fəsad törədənlər) Allahın lə'nət etdiyi (qulaqlarını) kar və gözlərini kor etdiyi kimsələrdir!",
                            "verse 47:24": "Onlar Qur'an barəsində düşünməzlərmi? Yoxsa ürəklərinə kilid vurulmuşdur? (Yoxsa ürəklərinin öz kilidləri vardır?)",
                            "verse 47:25": "Doğru yol özlərinə bəlli olduqdan sonra (dindən) dönənlərə Şeytan (bu dönüklüyü) xoş göstərdi və onları tovlayıb yoldan azdırdı (və ya: bu dönüklüyün müqabilində Allah onları zəlalətə saldı).",
                            "verse 47:26": "Bu onların Allahın nazil etdiyini (cihad əmrini) bəyənməyənlərə (münafiqlərə): \"Biz bə'zi işlərdə (Allahın və Muhəmməd əleyhissəlamın əmrlərini yerinə yetirməməkdə) sizə itaət edəcəyik!\" - demələrinə görədir.",
                            "verse 47:27": "Bəs mələklər onların üzlərinə, arxalarına vura-vura canlarını alanda halları necə olacaq?",
                            "verse 47:28": "Bu da onların Allahın qəzəbinə səbəb olan şeyə (Şeytana itaət etməyə) uymaları və (Allaha) xoş gedən şeyi (kafirlərlə vuruşmağı) bəyənmədiklərinə görədir.",
                            "verse 47:29": "Yoxsa qəlblərində mərəz (şəkk və nifaq mərəzi) olanlar elə güman etdilər ki, Allah onların (ürəklərindəki) kin-küdurətlərini zahirə çıxartmayacaqdır?!",
                            "verse 47:30": "(Ya Peyğəmbər!) Əgər Biz istəsəydik, onları (münafiqləri) mütləq sənə göstərər, sən də onları mütləq üzlərindən tanıyardın (amma, bəlkə, tövbə edib dində səmimi olsunlar deyə, onları heç kəsə tanıtmadıq).",
                            "verse 47:31": "(Ey mö'minlər!) And olsun ki, Biz içərinizdəki mücahidləri və (əziyyətlərə) səbr edənləri ayırd edib bilmək (ümmətə mə'lum etmək) üçün sizi imtahana çəkəcək və sizə dair xəbərləri (əməllərinizi) də yoxlayacağıq.",
                            "verse 47:32": "Şübhəsiz ki, kafirlər, (insanları) Allah yolundan döndərənlər və doğru yol özlərinə bəlli olduqdan sonra Peyğəmbərə qarşı çıxanlar Allaha heç bir zərər verə bilməzlər.",
                            "verse 47:33": "Ey iman gətirənlər! Allaha itaət edin, Peyğəmbərə itaət edin və (şəkk-şübhə, riya, küfr və nifaq kimi şeylərlə) əməllərinizi puça çıxartmayın!",
                            "verse 47:34": "Kafir olanları, (insanları) Allah yolundan döndərənləri, sonra da kafir kimi ölənləri, şübhəsiz ki, Allah bağışlamayacaqdır!",
                            "verse 47:35": "Buna görə də (cihada) zəiflik göstərməyin və (kafirlərə) üstün (qalib) gəldiyiniz zaman (onları) sülhə də'vət etməyin.",
                            "verse 47:36": "Şübhəsiz ki, dünya həyatı oyun-oyuncaq, əyləncədir.",
                            "verse 47:37": "Əgər Allah sizdən Onun (mal-dövlətinizin) hamısını istəsə və bunu sizdən israrla tələb etsə, siz xəsislik göstərərsiniz və O da (sizin islam dininə olan) kin-küdurətinizi (yaxud malınızı xərcləmək istəməmənizi) zahirə çıxardar.",
                            "verse 47:38": "Budur, siz (mal-dövlətinizin yalnız qırxda birini) Allah yolunda sərf etməyə çağırılan kimsələrsiniz."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Allah će poništiti djela onih koji ne vjeruju i od puta Njegova odvraćaju.",
                            "verse 47:2": "A onima koji vjeruju i dobra djela čine i vjeruju u ono što se objavljuje Muhammedu - a to je Istina od Gospodara njihova - On će preko hrđavih postupaka njihovih preći i prilike njihove će poboljšati,",
                            "verse 47:3": "zato što nevjernici slijede neistinu, a vjernici slijede Istinu od Gospodara svoga.",
                            "verse 47:4": "Kada se u borbi s nevjernicima sretnete po šijama ih udarajte sve dok ih ne oslabite, a onda ih vežite, i poslije, ili ih velikodušno sužanjstva oslobodite ili otkupninu zahtijevajte, sve dok borba ne prestane.",
                            "verse 47:5": "i On će, ih, sigurno, uputiti i prilike njihove poboljšati,",
                            "verse 47:6": "i u Džennet ih uvesti, o kome ih je već upoznao.",
                            "verse 47:7": "O vjernici, ako Allaha pomognete, i On će vama pomoći i korake vaše učvrstiti.",
                            "verse 47:8": "A onima koji ne vjeruju - propast njima! On neće djela njihova prihvatiti,",
                            "verse 47:9": "zato što ne vole ono što Allah objavljuje, i On će djela njihova poništiti.",
                            "verse 47:10": "Zašto oni ne idu po svijetu da vide kakav je bio konac onih prije njih? Njih je Allah istrijebio, a to čeka i ostale nevjernike,",
                            "verse 47:11": "zato što je Allah zaštitnik onih koji vjeruju i što nevjernici zaštitnika nemaju.",
                            "verse 47:12": "Allah će one koji vjeruju i dobra djela čine uvesti u džennetske bašče kroz koje će rijeke teći, a oni koji ne vjeruju - koji se naslađuju i žderu kao što stoka ždere - njihovo će prebivališ",
                            "verse 47:13": "A koliko smo gradova razorili, mnogo moćnijih od tvoga grada koji te protjerao, i nije bilo nikoga da im pomogne.",
                            "verse 47:14": "Zar je onaj koji ima jasnu predstavu o Gospodaru svom kao onaj kojim se lijepim čine ružna djela Njegova i koji se za strastima svojim povodi?",
                            "verse 47:15": "Zar je Džennet, koji je obećan onima koji se Allaha boje - u kome su rijeke od vode neustajale i rijeke od mlijeka nepromijenjena ukusa, i rijeke od vina, prijatna onima koji piju, i rijeke od meda procijeđenog i gdje ima voća svakovrs",
                            "verse 47:16": "Ima onih koji dolaze da te slušaju, a čim se od tebe udalje, pitaju one kojima je dato znanje: \"Šta ono on maloprije reče?\" To su oni čija je srca Allah zapečatio i koji se za strastima svojim povode.",
                            "verse 47:17": "A one koji su na Pravome putu On će i dalje voditi i nadahnuće ih kako će se vatre sačuvati.",
                            "verse 47:18": "Zar oni čekaju da im Smak svijeta iznenada dođe, a već su predznaci njegovi tu? A šta će im koristiti opomena kad im on dođe?",
                            "verse 47:19": "Znaj da nema boga osim Allaha! Traži oprosta za svoje grijehe i za vjernike i za vjernice! Allah zna kud se krećete i gdje boravite.",
                            "verse 47:20": "A oni koji vjeruju govore: \"Zašto se ne objavi jedna sura?\" A kad bi objavljena jedna sura i u njoj spomenuta borba, ti si mogao vidjeti one čija su srca pritvorna kako te gledaju pogledom pred smrt onesviještenog! A bolja bi im bila",
                            "verse 47:21": "poslušnost i razuman govor! A kada je borba već propisana, bolje bi im bilo da su prema Allahu iskreni.",
                            "verse 47:22": "Zar i vi ne biste, kada bi se vlasti dočepali, nered na Zemlji činili i rodbinske veze kidali!",
                            "verse 47:23": "To su oni koje je Allah prokleo i gluhim i slijepim ih učinio.",
                            "verse 47:24": "Kako oni ne razmisle o Kur’anu, ili su im na srcima katanci!",
                            "verse 47:25": "One koji su od vjere svoje otpali, pošto im je bio jasan Pravi put, šejtan je na grijeh navodio i lažnu im nadu ulivao.",
                            "verse 47:26": "To zato što su govorili onima koji ne vole ono što Allah objavljuje: \"Mi ćemo vam se u nekim stvarima pokoravati\", a Allah dobro zna njihove tajne.",
                            "verse 47:27": "A kako će tek biti kada im meleki budu duše uzimali udarajući ih po obrazima i po leđima njihovim!",
                            "verse 47:28": "To će biti zato što su ono što izaziva Allahovu srdžbu slijedili, a ono čime je On zadovoljan prezirali; On će djela njihova poništiti.",
                            "verse 47:29": "Zar oni bolesnih srca misle da Allah zlobe njihove na vidjelo neće iznijeti?",
                            "verse 47:30": "A da hoćemo, Mi bismo ti ih, uistinu, pokazali i ti bi ih, sigurno, po biljezima njihovim poznao.",
                            "verse 47:31": "Mi ćemo vas provjeravati sve dok ne ukažemo na borce i postojane među vama, a i vijesti o vama provjeravaćemo.",
                            "verse 47:32": "Oni koji ne vjeruju i od Allahova puta odvraćaju, koji su Poslanikovi protivnici, kad im je već postao jasan Pravi put, zaista neće nimalo Allahu nauditi On će djela njihova poništiti.",
                            "verse 47:33": "O vjernici, pokoravajte se Allahu i pokoravajte se Poslaniku, i ne ništite djela svoja!",
                            "verse 47:34": "Onima koji ne vjeruju i od Allahova puta odvraćaju, pa poslije kao nevjernici umiru, Allah, zaista, neće oprostiti.",
                            "verse 47:35": "I ne budite kukavice i ne nudite primirje kad ste jači, jer Allah je s vama, On vas neće nagrada za djela vaša lišiti.",
                            "verse 47:36": "Život na ovome svijetu je samo igra i zabava! A ako budete vjerovali i grijehe izbjegavali, On će vas nagraditi i imanja vaša od vas neće tražiti.",
                            "verse 47:37": "Ako bi ih od vas tražio i prema vama uporan bio, postali biste škrti i On bi učinio vidljivim vaše mržnje.",
                            "verse 47:38": "Vi se, eto, pozivate da trošite na Allahovu putu, ali, neki od vas su škrti - a ko škrtari, na svoju štetu škrtari, jer Allah je bogat, a vi ste siromašni."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "যারা কুফরী করে এবং আল্লাহর পথে বাধা সৃষ্টি করে, আল্লাহ তাদের সকল কর্ম ব্যর্থ করে দেন।",
                            "verse 47:2": "আর যারা বিশ্বাস স্থাপন করে, সৎকর্ম সম্পাদন করে এবং তাদের পালনকর্তার পক্ষ থেকে মুহাম্মদের প্রতি অবতীর্ণ সত্যে বিশ্বাস করে, আল্লাহ তাদের মন্দ কর্মসমূহ মার্জনা করেন এবং তাদের অবস্থা ভাল করে দেন।",
                            "verse 47:3": "এটা এ কারণে যে, যারা কাফের, তারা বাতিলের অনুসরণ করে এবং যারা বিশ্বাসী, তারা তাদের পালনকর্তার নিকট থেকে আগত সত্যের অনুসরণ করে। এমনিভাবে আল্লাহ মানুষের জন্যে তাদের দৃষ্টান্তসমূহ বর্ণনা করেন।",
                            "verse 47:4": "অতঃপর যখন তোমরা কাফেরদের সাথে যুদ্ধে অবতীর্ণ হও, তখন তাদের গর্দার মার, অবশেষে যখন তা?েদরকে পূর্ণরূপে পরাভূত কর তখন তাদেরকে শক্ত করে বেধে ফেল। অতঃপর হয় তাদের প্রতি অনুগ্রহ কর, না হয় তাদের নিকট হতে মুক্তিপণ লও। তোমরা যুদ্ধ চালিয়ে যাবে যে পর্যন্ত না শত্রুপক্ষ অস্ত্র সমর্পণ করবে! একথা শুনলে। আল্লাহ ইচ্ছা করলে তাদের কাছ থেকে প্রতিশোধ নিতে পারতেন। কিন্তু তিনি তোমাদের কতককে কতকের দ্বারা পরীক্ষা করতে চান। যারা আল্লাহর পথে শহীদ হয়, আল্লাহ কখনই তাদের কর্ম বিনষ্ট করবেন না।",
                            "verse 47:5": "তিনি তাদেরকে পথ প্রদর্শন করবেন এবং তাদের অবস্থা ভাল করবেন।",
                            "verse 47:6": "অতঃপর তিনি তাদেরকে জান্নাতে দাখিল করবেন, যা তাদেরকে জানিয়ে দিয়েছেন।",
                            "verse 47:7": "হে বিশ্বাসীগণ! যদি তোমরা আল্লাহকে সাহায্য কর, আল্লাহ তোমাদেরকে সাহায্য করবেন এবং তোমাদের পা দৃঢ়প্রতিষ্ঠ করবেন।",
                            "verse 47:8": "আর যারা কাফের, তাদের জন্যে আছে দুর্গতি এবং তিনি তাদের কর্ম বিনষ্ট করে দিবেন।",
                            "verse 47:9": "এটা এজন্যে যে, আল্লাহ যা নাযিল করেছেন, তারা তা পছন্দ করে না। অতএব, আল্লাহ তাদের কর্ম ব্যর্থ করে দিবেন।",
                            "verse 47:10": "তারা কি পৃথিবীতে ভ্রমণ করেনি অতঃপর দেখেনি যে, তাদের পূর্ববর্তীদের পরিণাম কি হয়েছে? আল্লাহ তাদেরকে ধ্বংস করে দিয়েছেন এবং কাফেরদের অবস্থা এরূপই হবে।",
                            "verse 47:11": "এটা এজন্যে যে, আল্লাহ মুমিনদের হিতৈষী বন্ধু এবং কাফেরদের কোন হিতৈষী বন্ধু নাই।",
                            "verse 47:12": "যারা বিশ্বাস করে ও সৎকর্ম করে, আল্লাহ তাদেরকে জান্নাতে দাখিল করবেন, যার নিম্নদেশে নির্ঝরিণীসমূহ প্রবাহিত হয়। আর যারা কাফের, তারা ভোগ-বিলাসে মত্ত থাকে এবং চতুস্পদ জন্তুর মত আহার করে। তাদের বাসস্থান জাহান্নাম।",
                            "verse 47:13": "যে জনপদ আপনাকে বহিস্কার করেছে, তদপেক্ষা কত শক্তিশালী জনপদকে আমি ধ্বংস করেছি, অতঃপর তাদেরকে সাহায্য করার কেউ ছিল না।",
                            "verse 47:14": "যে ব্যক্তি তার পালনকর্তার পক্ষ থেকে আগত নিদর্শন অনুসরণ করে, সে কি তার সমান, যার কাছে তার মন্দ কর্ম শোভনীয় করা হয়েছে এবং যে তার খেয়াল-খুশীর অনুসরণ করে।",
                            "verse 47:15": "পরহেযগারদেরকে যে জান্নাতের ওয়াদা দেয়া হয়েছে, তার অবস্থা নিম্নরূপঃ তাতে আছে পানির নহর, নির্মল দুধের নহর যারা স্বাদ অপরিবর্তনীয়, পানকারীদের জন্যে সুস্বাদু শরাবের নহর এবং পরিশোধিত মধুর নহর। তথায় তাদের জন্যে আছে রকমারি ফল-মূল ও তাদের পালনকর্তার ক্ষমা। পরহেযগাররা কি তাদের সমান, যারা জাহান্নামে অনন্তকাল থাকবে এবং যাদেরকে পান করতে দেয়া হবে ফুটন্ত পানি অতঃপর তা তাদের নাড়িভূঁড়ি ছিন্ন বিচ্ছিন্ন করে দেবে?",
                            "verse 47:16": "তাদের মধ্যে কতক আপনার দিকে কান পাতে, অতঃপর যখন আপনার কাছ থেকে বাইরে যায়, তখন যারা শিক্ষিত, তাদেরকে বলেঃ এইমাত্র তিনি কি বললেন ? এদের অন্তরে আল্লাহ মোহর মেরে দিয়েছেন এবং তারা নিজেদের খেয়াল-খুশীর অনুসরণ করে।",
                            "verse 47:17": "যারা সৎপথপ্রাপ্ত হয়েছে, তাদের সৎপথপ্রাপ্তি আরও বেড়ে যায় এবং আল্লাহ তাদেরকে তাকওয়া দান করেন।",
                            "verse 47:18": "তারা শুধু এই অপেক্ষাই করছে যে, কেয়ামত অকস্মাৎ তাদের কাছে এসে পড়ুক। বস্তুতঃ কেয়ামতের লক্ষণসমূহ তো এসেই পড়েছে। সুতরাং কেয়ামত এসে পড়লে তারা উপদেশ গ্রহণ করবে কেমন করে ?",
                            "verse 47:19": "জেনে রাখুন, আল্লাহ ব্যতীত কোন উপাস্য নেই। ক্ষমাপ্রার্থনা করুন, আপনার ক্রটির জন্যে এবং মুমিন পুরুষ ও নারীদের জন্যে। আল্লাহ, তোমাদের গতিবিধি ও অবস্থান সম্পর্কে জ্ঞাত।",
                            "verse 47:20": "যারা মুমিন, তারা বলেঃ একটি সূরা নাযিল হয় না কেন? অতঃপর যখন কোন দ্ব্যর্থহীন সূরা নাযিল হয় এবং তাতে জেহাদের উল্লেখ করা হয়, তখন যাদের অন্তরে রোগ আছে, আপনি তাদেরকে মৃত্যুভয়ে মূর্ছাপ্রাপ্ত মানুষের মত আপনার দিকে তাকিয়ে থাকতে দেখবেন। সুতরাং ধ্বংস তাদের জন্যে।",
                            "verse 47:21": "তাদের আনুগত্য ও মিষ্ট বাক্য জানা আছে। অতএব, জেহাদের সিন্ধান্ত হলে যদি তারা আল্লাহর প্রতি পদত্ত অংগীকার পূর্ণ করে, তবে তাদের জন্যে তা মঙ্গলজনক হবে।",
                            "verse 47:22": "ক্ষমতা লাভ করলে, সম্ভবতঃ তোমরা পৃথিবীতে অনর্থ সৃষ্টি করবে এবং আত্নীয়তা বন্ধন ছিন্ন করবে।",
                            "verse 47:23": "এদের প্রতিই আল্লাহ অভিসম্পাত করেন, অতঃপর তাদেরকে বধির ও দৃষ্টিশক্তিহীন করেন।",
                            "verse 47:24": "তারা কি কোরআন সম্পর্কে গভীর চিন্তা করে না? না তাদের অন্তর তালাবদ্ধ?",
                            "verse 47:25": "নিশ্চয় যারা সোজা পথ ব্যক্ত হওয়ার পর তৎপ্রতি পৃষ্ঠপ্রদর্শন করে, শয়তান তাদের জন্যে তাদের কাজকে সুন্দর করে দেখায় এবং তাদেরকে মিথ্যা আশা দেয়।",
                            "verse 47:26": "এটা এজন্য যে, তারা তাদেরকে বলে, যারা আল্লাহর অবতীর্ণ কিতাব অপছন্দ করেঃ আমরা কোন কোন ব্যাপারে তোমাদের কথা মান্য করব। আল্লাহ তাদের গোপন পরামর্শ অবগত আছেন।",
                            "verse 47:27": "ফেরেশতা যখন তাদের মুখমন্ডল ও পৃষ্ঠদেশে আঘাত করতে করতে প্রাণ হরণ করবে, তখন তাদের অবস্থা কেমন হবে?",
                            "verse 47:28": "এটা এজন্যে যে, তারা সেই বিষয়ের অনুসরণ করে, যা আল্লাহর অসন্তোষ সৃষ্টি করে এবং আল্লাহর সন্তুষ্টিকে অপছন্দ করে। ফলে তিনি তাদের কর্মসমূহ ব্যর্থ করে দেন।",
                            "verse 47:29": "যাদের অন্তরে রোগ আছে, তারা কি মনে করে যে, আল্লাহ তাদের অন্তরের বিদ্বেষ প্রকাশ করে দেবেন না?",
                            "verse 47:30": "আমি ইচ্ছা করলে আপনাকে তাদের সাথে পরিচিত করে দিতাম। তখন আপনি তাদের চেহারা দেখে তাদেরকে চিনতে পারতেন এবং আপনি অবশ্যই কথার ভঙ্গিতে তাদেরকে চিনতে পারবেন। আল্লাহ তোমাদের কর্মসমূহের খবর রাখেন।",
                            "verse 47:31": "আমি অবশ্যই তোমাদেরকে পরীক্ষা করব যে পর্যন্ত না ফুটিয়ে তুলি তোমাদের জেহাদকারীদেরকে এবং সবরকারীদেরকে এবং যতক্ষণ না আমি তোমাদের অবস্থান সমূহ যাচাই করি।",
                            "verse 47:32": "নিশ্চয় যারা কাফের এবং আল্লাহর পথ থেকে মানুষকে ফিরিয়ে রাখে এবং নিজেদের জন্যে সৎপথ ব্যক্ত হওয়ার পর রসূলের (সঃ) বিরোধিতা করে, তারা আল্লাহর কোনই ক্ষতি করতে পারবে না এবং তিনি ব্যর্থ করে দিবেন তাদের কর্মসমূহকে।",
                            "verse 47:33": "হে মুমিনগণ! তোমরা আল্লাহর আনুগত্য কর, রসূলের (সাঃ) আনুগত্য কর এবং নিজেদের কর্ম বিনষ্ট করো না।",
                            "verse 47:34": "নিশ্চয় যারা কাফের এবং আল্লাহর পথ থেকে মানুষকে ফিরিয়ে রাখে, অতঃপর কাফের অবস্থায় মারা যায়, আল্লাহ কখনই তাদেরকে ক্ষমা করবেন না।",
                            "verse 47:35": "অতএব, তোমরা হীনবল হয়ো না এবং সন্ধির আহবান জানিও না, তোমরাই হবে প্রবল। আল্লাহই তোমাদের সাথে আছেন। তিনি কখনও তোমাদের কর্ম হ্রাস করবেন না।",
                            "verse 47:36": "পার্থিব জীবন তো কেবল খেলাধুলা, যদি তোমরা বিশ্বাসী হও এবং সংযম অবলম্বন কর, আল্লাহ তোমাদেরকে তোমাদের প্রতিদান দেবেন এবং তিনি তোমাদের ধন-সম্পদ চাইবেন না।",
                            "verse 47:37": "তিনি তোমাদের কাছে ধন-সম্পদ চাইলে অতঃপর তোমাদেরকে অতিষ্ঠ করলে তোমরা কার্পণ্য করবে এবং তিনি তোমাদের মনের সংকীর্ণতা প্রকাশ করে দেবেন।",
                            "verse 47:38": "শুন, তোমরাই তো তারা, যাদেরকে আল্লাহর পথে ব্যয় করার আহবান জানানো হচ্ছে, অতঃপর তোমাদের কেউ কেউ কৃপণতা করছে। যারা কৃপণতা করছে, তারা নিজেদের প্রতিই কৃপণতা করছে। আল্লাহ অভাবমুক্ত এবং তোমরা অভাবগ্রস্থ। যদি তোমরা মুখ ফিরিয়ে নাও, তবে তিনি তোমাদের পরিবর্তে অন্য জাতিকে প্রতিষ্ঠিত করবেন, এরপর তারা তোমাদের মত হবে না। দেবেন।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 47:1": "На онези, които не вярват и възпират от пътя на Аллах, Той ще провали делата им.",
                            "verse 47:2": "А на онези, които вярват и вършат праведни дела, и вярват в низпосланото на Мухаммад - а то е истината от техния Господ, - Той ще им опрости лошите им постъпки и ще подобри положението им.",
                            "verse 47:3": "Така е, защото неверниците следват лъжата, а вярващите следват истината от своя Господ.",
                            "verse 47:4": "И когато [в битка] срещнете неверниците, удряйте по шията, додето ги надвиете, и здраво ги вържете! А после - или милост, или откуп, когато войната приключи.",
                            "verse 47:5": "Той ще ги напъти и ще подобри положението им.",
                            "verse 47:6": "И ще ги въведе в Рая, за който ги е известил.",
                            "verse 47:7": "О, вярващи, ако подкрепите [делото на] Аллах, и Той ще ви подкрепи, и ще утвърди стъпките ви.",
                            "verse 47:8": "А които не повярват - гибел за тях! Ще провали Той делата им.",
                            "verse 47:9": "Това е, защото възненавиждат низпосланото от Аллах и затова Той прави безплодни делата им.",
                            "verse 47:10": "Нима не ходят по земята и не виждат какъв бе краят на онези преди тях? Аллах ги унищожи.",
                            "verse 47:11": "Така е, защото Аллах е Покровителят на вярващите, а неверниците нямат покровител.",
                            "verse 47:12": "Аллах ще въведе онези, които вярват и вършат праведни дела, в Градините, сред които реки текат.",
                            "verse 47:13": "И колко селища погубихме, по-силни от твоето селище ,",
                            "verse 47:14": "което те прогони! И никой не им помогна.",
                            "verse 47:15": "Нима са равни онзи, който има ясен знак от своя Господ, и онзи, чието лошо деяние му е разкрасено и следва своите страсти?",
                            "verse 47:16": "Нима Раят, обещан на богобоязливите, с реки от вода, която не застоява, и реки от мляко с вкус, който не се променя, и реки от вино приятно за пиещите, и реки пречистен мед, и в който има за тях от всякакви плодове, и опрощение от техния Господ, е като он",
                            "verse 47:17": "А някои от тях те изслушват, но щом си отидат от теб, казват на дарените със знанието: Какво рече той преди малко? Те са онези, чиито сърца Аллах запечата и които следват своите страсти.",
                            "verse 47:18": "А на онези, които следват правия път, Той увеличава напътствието и ги дарява с богобоязливост.",
                            "verse 47:19": "И нима очакват друго освен внезапно за тях да настъпи Часът? Вече се появиха неговите признаци.",
                            "verse 47:20": "И знай [о, Мухаммад], че няма друг Бог освен Аллах! И моли опрощение за своя грях и за вярващите мъже и жени! Аллах знае къде се движите и къде пребивавате.",
                            "verse 47:21": "Вярващите казват: Да бе низпослана сура [за сражение]! А щом бъде низпослана неотменима сура и в нея се споменава за сражение, виждаш как онези, в чиито сърца има болест, те гледат с поглед на изпаднал в несвяст пред смъртта.",
                            "verse 47:22": "е покорство и благо слово.",
                            "verse 47:23": "А щом се отвърнете, нима от вас се очаква друго освен да сеете развала по земята и да прекъсвате родствените си връзки?",
                            "verse 47:24": "Тези са, които Аллах прокле и ги стори глухи и слепи.",
                            "verse 47:25": "И нима не размишляват над Корана или сърцата им са под ключ?",
                            "verse 47:26": "Онези, които обръщат гръб, след като напътствието им се изясни, тях сатаната ги подвежда и им дава празни надежди.",
                            "verse 47:27": "Това е, защото казват на онези, които възненавиждат низпосланото от Аллах: Ще ви последваме в част от делото.",
                            "verse 47:28": "А как ще бъде, когато ангелите ги приберат, удряйки ги по лицето и гърба?",
                            "verse 47:29": "Това е, защото следват онова, което предизвиква гнева на Аллах и възненавиждат Неговото благоволение, затова Той проваля делата им.",
                            "verse 47:30": "Нима онези, в чиито сърца има болест, смятат, че Аллах не ще разкрие злобата им?",
                            "verse 47:31": "И ако желаехме, Ние щяхме да ти ги покажем [о, Мухаммад] и ти би ги познал по чертите им, и би ги познал по словото им.",
                            "verse 47:32": "И ще ви подложим на изпитание, докато отличим сред вас борещите се по пътя на Аллах и търпеливите, и разкрием вестите за вас.",
                            "verse 47:33": "Онези, които не вярват и възпират от пътя на Аллах, и се противят на Пратеника, след като им се изясни напътствието, не ще навредят на Аллах с нищо и Той ще провали делата им.",
                            "verse 47:34": "О, вярващи, покорявайте се на Аллах и се покорявайте на Пратеника, и не погубвайте делата си!",
                            "verse 47:35": "На онези, които не вярват и възпират от пътя на Аллах, и умират неверници, Аллах не ще опрости.",
                            "verse 47:36": "И не падайте духом [при сражение], та да зовете за мир! Вие ще надделеете! Аллах е с вас и Той не ще погуби вашите дела.",
                            "verse 47:37": "Земният живот е само игра и забава.",
                            "verse 47:38": "Ако ви ги поиска и ви принуди, вие ще се поскъпите и Той ще изкара наяве злобата ви.",
                            "verse 47:39": "Ето, вие сте онези, които са позовани да раздават по пътя на Аллах."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "不信道而且妨礙主道的人們，真主將使他們的善功無效。",
                            "verse 47:2": "信道而行善，且信仰降示穆罕默德的天經者——那部天經是認他們的主降示的真理——真主將赦宥他們的罪惡，改善他們的狀況。",
                            "verse 47:3": "那是由於不信道的人們遵守虛偽，而信道的人們遵守從他們的主降示的真理。真主如此為眾人設許多譬喻。",
                            "verse 47:4": "你們在戰場上遇到不信道者的時候，應當斬殺他們，你們既戰勝他們，就應當俘虜他們；以後或釋放他們，或准許他們贖身，直到戰爭放下他的重擔。事情就是這樣的，假若真主意欲，他必懲治他們；但他命你們抗戰，以便他以你們互相考驗。為主道而陣亡者，真主絕不枉費他們的善功，",
                            "verse 47:5": "他要引導他們，並改善他們的狀況，",
                            "verse 47:6": "且使他們入樂園——他已為他們說明那樂園了。",
                            "verse 47:7": "信道的人們啊！如果你們相助真主，他就相助你們，並使你們的腳步穩固。",
                            "verse 47:8": "不信道的人們，將一厥不振，真主將任他們的善功無效。",
                            "verse 47:9": "那是因為他們厭惡真主所降示的經典，故他將使他們的善功無效。",
                            "verse 47:10": "難道他們沒有在大地上旅行，以觀察前人的結局是怎樣的嗎？真主又毀滅了他們。不信道的人們，將有同樣的結局。",
                            "verse 47:11": "那是因為真主是信道的人們的保護者；不信道的人們，絕無保護者。",
                            "verse 47:12": "真主必定要使信道而且行善的人們入下臨諸河的樂園。不信道的人們，在今世的享受，是像畜牲樣飲食，火獄是他們的歸宿。",
                            "verse 47:13": "有許多城市，其居民的勢力，勝過那驅逐你的城市的居民；我曾毀滅了他們，他們沒有任何援助者。",
                            "verse 47:14": "依據從主降示的明証者，與那為自己的惡行所迷惑，而且順從私欲者是一樣的嗎？",
                            "verse 47:15": "敬畏的人們所蒙應許的樂園，其情狀是這樣的：其中有水河，水質不腐；有乳河，乳味不變；有酒河，飲者稱快；有蜜河，蜜質純潔；他們在樂園中，有各種水果，可以享受；還有從他們的主發出的赦宥。永居樂園者，難道與那永居火獄，常飲沸水，腸寸寸斷的人是一樣的嗎？",
                            "verse 47:16": "他們中有些人靜聽你的演說，等到他們從你的面前出去的時候，他們對有學識者說：「剛才他說些甚麼？」這等人，真主已封閉他們的心，他們順從私欲。",
                            "verse 47:17": "遵循正道者，真主要更加引導他們，並將敬畏的報酬賞賜他們。",
                            "verse 47:18": "他們只等待復活時忽然來臨他們，復活時的徵候確已來臨了。當復活時來臨的時候，他們的覺悟，對於他們那裡還會有效呢！",
                            "verse 47:19": "你應當知道，除真主外，絕無應受崇拜的，你應當為你的過失而求饒，並應當為眾信士和眾信女而求饒。真主是全知你們的活動和歸宿的。",
                            "verse 47:20": "信道的人們說：「怎麼不降示一章經呢？」當一章明確的經文降下，而其中提及戰爭的時候，你會看到心中有病的人們將像臨死時昏暈的人那樣瞪著眼看你。傷哉他們！",
                            "verse 47:21": "服從和婉辭，於他們是更相宜的。當戰爭被決定的時候，假若他們忠於真主，那對於他們是更好的。",
                            "verse 47:22": "假若你們執政，你們會不會在地方上作惡，並斷絕親戚的關係呢？",
                            "verse 47:23": "這等人，是真主所棄絕的，故他使他們變聾，使他們變瞎。",
                            "verse 47:24": "他們怎麼不沉思《古蘭經》呢？難道他們的心上有鎖？",
                            "verse 47:25": "認清正道，然後叛道者，惡魔慫恿他們，並寬慰他們。",
                            "verse 47:26": "那是因為他們曾對那些厭惡真王所降示的蹟象者說：「對於一部份的事情，我們將順從你們。」真主知道他們的隱情。",
                            "verse 47:27": "當眾天神打著他們的臉和背，而使他們死亡的時候，他們將怎麼辦呢？",
                            "verse 47:28": "那是因為他們順從那觸犯真主的事物，並厭惡他所喜悅的事物，故他使他們的善扔L效。",
                            "verse 47:29": "難道心中有病的人們以為真主不報答他們的怨根麼？",
                            "verse 47:30": "假若我意欲，我必定使你知道他們，你必定借他們的儀表而認識他們，你必定從他們的口氣而認識他們。真主知道你們的善功。",
                            "verse 47:31": "我必定要試驗你們，直到我認識你們中的奮鬥者和堅忍者，我將考核關於你們的工作的報告。",
                            "verse 47:32": "不信道，並妨礙主道，且在認識正道後反對使者的人們，絕不能損傷真主一絲毫，他要使他們的善功無效。",
                            "verse 47:33": "信道的人們啊！你們應當服從真主，應當服從使者，你們不要使你們的善功無效。",
                            "verse 47:34": "不信道、並妨礙主道、死時還不信道的人們，真主絕不赦宥他們。",
                            "verse 47:35": "你們不要氣餒，不要求和，你們是佔優勢的，真主是與你們同在的，他絕不使你們的善功無效。",
                            "verse 47:36": "今世的生活，只是游戲和娛樂。如果你們信道，並且敬畏他，他要將你們的報酬賞賜你們。他不索取你們的財產。",
                            "verse 47:37": "如果他勒索你們的財產，你們就要吝嗇，那吝嗇要揭穿你們的怨恨。",
                            "verse 47:38": "你們這等人啊！有人勸你們為主道而費用，你們中卻有若嗇的。吝嗇的人自受吝嗇之害。真主確是無求的，你們確是有求的。如果你們違背命令，他就要以別的民眾代替你們，然後，他們不像你們樣。 如果他勒索你們的財產，你們就要吝嗇，那吝嗇要揭穿你們的怨恨。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Těm, kdož neuvěřili a odchylují jiné z cesty Boží, nechá Bůh díla jejich zbloudit.",
                            "verse 47:2": "Avšak těm, kdož uvěřili a zbožné skutky konali a uvěřili v to, co bylo sesláno Muhammadovi - a to pravda je od Boha pocházející - těm Bůh vymaže špatné činy jejich a napraví myšlení jejich.",
                            "verse 47:3": "A to proto, že ti, kdož neuvěřili, následovali nicotné, zatímco ti, kdož uvěřili, následovali pravdu od Pána jejich pocházející.",
                            "verse 47:4": "A když se střetnete s nevěřícími, udeřte je do šíjí, a až jim způsobíte úplnou porážku, pevně je spoutejte! A potom je buď omilostněte, anebo je propusťte za výkupné, pokud válka neodloží své břímě.",
                            "verse 47:5": "On správnou cestou je povede a napraví jejich myšlení",
                            "verse 47:6": "a uvede je do zahrady rajské, o níž jim dal již vědění.",
                            "verse 47:7": "Vy, kteří věříte! Pomůžete-li Bohu, On zajisté pomůže vám a upevní paty vaše!",
                            "verse 47:8": "Na ty však, kdož neuvěřili, nechť padne neštěstí a nechť Bůh dá zbloudit dílům jejich!",
                            "verse 47:9": "A to proto, že nenáviděli to, co seslal Bůh, a marné bude jejich konání.",
                            "verse 47:10": "Což necestovali po zemi a neviděli, jaký byl konec těch, kdož před nimi byli? Bůh je zahubil a podobně se stane i nevěřícím.",
                            "verse 47:11": "A to proto, že Bůh je ochráncem těch, kdož uvěřili, zatímco nevěřící nebudou mít ochránce žádného.",
                            "verse 47:12": "Bůh věru uvede ty, kdož uvěřili a zbožné skutky konali, do zahrad, pod nimiž řeky tekou, zatímco nevěřící, kteří si užívají a jako dobytek se přecpávají, oheň pekelný budou mít za útulek.",
                            "verse 47:13": "A kolik měst, jež byla mocnější silou, než je město tvé, které tě vyhnalo, jsme již zahubili, a neměla pomocníka žádného.",
                            "verse 47:14": "Což je ten, jenž důkaz jasný má od Pána svého, roven tomu, jemuž byla zkrášlena špatnost činů jeho, a těm, kdož vášně své následují?",
                            "verse 47:15": "Obraz zahrady rajské, jež přislíbena byla bohabojným: v ní řeky jsou s vodou, jež nezahnívá, a řeky mléka, jehož chuť je neměnná, a řeky vína, jež rozkoší je pijícím, a řeky medu očištěného.",
                            "verse 47:16": "A jsou mezi nimi někteří, kdož ti naslouchají, avšak když od tebe odejdou, ptají se těch, jimž dostalo se vědění: \"Co to vlastně před chvílí povídal?\" A to jsou ti, jichž srdce Bůh zapečetil a kteří následují učení svá scestná.",
                            "verse 47:17": "Však těm, kdož po cestě správné jsou vedeni, těm Bůh posílí jejich vedení a dá jim bázeň Boží.",
                            "verse 47:18": "Což mohou očekávat něco jiného, než že Hodina k nim znenadání přikvačí, když již se objevily její příznaky? K čemu bude jim dobré její připomínání, až na ně udeří?",
                            "verse 47:19": "Věz tedy, že není božstva kromě Boha, a pros za odpuštění vin svých i vin mužů a žen věřících! Bůh dobře ví o přecházení vašem a zná i konečný příbytek váš.",
                            "verse 47:20": "A říkají ti, kdož uvěřili: \"Proč nebyla seslána nějaká súra?\" A když je seslána súra moudře stanovená a je v ní zmíněn boj, tu vidíš ty, v jichž srdcích je choroba, dívat se na tebe pohledem člověka obestřeného mrákotami předsmrtnými.",
                            "verse 47:21": "poslušnost a řeč vhodná.",
                            "verse 47:22": "A je možné, že obrátíte-li se zády, budete šířit pohoršení na zemi a narušíte pokrevní svazky své.",
                            "verse 47:23": "Toto jsou ti, jež Bůh proklel, hluchými je učinil a zraky jejich oslepil.",
                            "verse 47:24": "Což nebudou uvažovat o Koránu či jsou snad na srdcích jejich zámky?",
                            "verse 47:25": "Věru ty, kdož kroky své nazpět obrátili poté, co objasněno jim bylo správné vedení, ty satan svedl a našeptal jim jejich počínání.",
                            "verse 47:26": "A to proto, že říkají těm, kterým se hnusí to, co Bůh seslal: \"Budeme vás poslouchat ve věcech některých.",
                            "verse 47:27": "A jak jim bude, až andělé je povolají, bijíce je po tvářích a po zádech jejich!",
                            "verse 47:28": "A to proto, že následovali to, co hněvá Boha, a nenáviděli to, co se Mu líbí; a učinil marnými skutky jejich.",
                            "verse 47:29": "Či se domnívají ti, v jichž srdcích je choroba, že Bůh nenávist jejich neodkryje?",
                            "verse 47:30": "Kdybychom chtěli, ukázali bychom ti je a věru bys je poznal podle známek jejich; avšak ty poznáš je určitě podle popletené řeči jejich.",
                            "verse 47:31": "A věru vás budeme zkoušet, abychom rozpoznali mezi vámi ty, kdož usilovně se snaží a jsou trpěliví, a abychom prozkoumali zprávy o vás.",
                            "verse 47:32": "Věru ti, kdož neuvěřili a od cesty Boží se odvrátili a od posla se odloučili, když už jim bylo objasněno správné vedení, neuškodí v ničem Bohu, jenž marnými učiní skutky jejich.",
                            "verse 47:33": "Vy, kteří věříte! Poslouchejte Boha a poslouchejte posla jeho a nečiňte nicotným konání své!",
                            "verse 47:34": "Věru těm, kdož neuvěřili a od cesty Boží jiné odvraceli a potom jako nevěřící zemřou, Bůh neodpustí.",
                            "verse 47:35": "Neochabujte a nevybízejte k míru, když máte převahu, vždyť Bůh je s vámi a On neošidí vás o dobré skutky vaše.",
                            "verse 47:36": "Život pozemský je pouze hra a zábava; jestliže věříte a bojíte se Boha, On dá vám odměny vaše a nebude žádat na vás majetky vaše.",
                            "verse 47:37": "A kdyby je na vás žádal a nutil vás, stali byste se lakotnými a On odkryl by zlobu vaši.",
                            "verse 47:38": "Hle, takoví jste - jste vyzýváni, abyste rozdávali na cestě Boží, avšak mezi vámi jsou lakomci."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Zij, die (de Waarheid) verwerpen en mensen van God’s weg afleiden, hun werk zal Hij vruchteloos maken.",
                            "verse 47:2": "Maar zij, die geloven en goede werken doen en in hetgeen aan Mohamed is ge openbaard, geloven - dit is de Waarheid van hun Heer - hun fouten zal Hij van hen wegnemen en hun toestand verbeteren.",
                            "verse 47:3": "Dat is omdat de ongelovigen de leugen volgen, terwijl de gelovigen de Waarheid van hun Heer volgen.",
                            "verse 47:4": "Wanneer gij de ongelovigen (in oorlog) ontmoet, treft dan hun nek en wanneer gij overwinnaar zijt, bindt hen dan vast.",
                            "verse 47:5": "Hij zal hen leiden en hun toestand verbeteren.",
                            "verse 47:6": "En hen in het paradijs, dat Hij hun heeft bekend gemaakt, toelaten.",
                            "verse 47:7": "gij, die gelooft, indien gij de zaak van God steunt zal Hij u helpen en standvastig doen blijven.",
                            "verse 47:8": "Maar de ongelovigen wacht vernietiging en Hij zal hun werken vruchteloos maken.",
                            "verse 47:9": "Dat is omdat zij, hetgeen God heeft geopenbaard, haten, daarom maakte Hij hun werken vruchteloos.",
                            "verse 47:10": "Hebben zij op aarde niet gereisd en gezien wat het einde was van degenen, die vóór hen waren? God vernietigde hen geheel en hetzelfde zal voor de ongelovigen gelden.",
                            "verse 47:11": "Dat is, omdat God de Beschermer is van de gelovigen en voor de ongelovigen is er geen Beschermer.",
                            "verse 47:12": "Voorwaar, God zal hen die geloven en goede werken doen in het paradijs toelaten, waardoorheen rivieren vloeien: terwijl de ongelovigen zich vermaken en eten zoals het vee; het Vuur zal hun tehuis zijn.",
                            "verse 47:13": "En hoevele steden die sterker waren dan de stad die u heeft uitgedreven, hebben Wij vernietigd, en zij hadden geen helper!",
                            "verse 47:14": "Zijn zij die op een duidelijk bewijs van hun Heer steunen als zij voor wie hun slechte daden schoonschijnend zijn gemaakt en die hun eigen begeerten volgen?",
                            "verse 47:15": "Het beeld van het paradijs dat aan de godvruchtigen is beloofd: er zijn daarin stromen water dat niet bederft; en stromen melk waarvan de smaak niet verandert en stromen wijn, smakelijk voor degenen die drinken en rivieren van zuivere honing.",
                            "verse 47:16": "En sommigen onder hen luisteren naar u doch wanneer zij van u weggaan, zeggen zij tot hen aan wie kennis is gegeven: \"Wat zeide hij zo juist?\" God heeft hun hart verzegeld, zij volgen hun eigen neigingen.",
                            "verse 47:17": "Maar van hen die de leiding volgen vermeerdert Hij de leiding en schenkt hun rechtvaardigheid.",
                            "verse 47:18": "Zij (de ongelovigen) wachten op niets dan het Uur dat onverwachts over hen kan komen.",
                            "verse 47:19": "Weet, dat er buiten God geen God bestaat en vraag bescherming voor uw tekortkoming en voor die van gelovige mannen en vrouwen.",
                            "verse 47:20": "En de gelovigen zeggen: \"Waarom is er geen Soerah geopenbaard?\" Maar wanneer een beslissende Soerah wordt geopenbaard en daarin over vechten wordt gesproken, zult gij hen in wier hart een ziekte is naar u zien kijken als iemand die bezwijmt in de dood.",
                            "verse 47:21": "Gehoorzaamheid (te betonen) en goede woorden (te spreken).",
                            "verse 47:22": "Zult gij dan niet door u af te wenden verderf in het land brengen en uw familiebanden verbreken?",
                            "verse 47:23": "Dezen zijn het, die God heeft vervloekt, zodat Hij hen doof heeft gemaakt en hun ogen verblind.",
                            "verse 47:24": "Willen zij dan niet over de Koran nadenken, of zijn er sloten op hun hart?",
                            "verse 47:25": "Waarlijk, voor hen die hun rug omkeren nadat de leiding hun duidelijk is geworden, heeft Satan het gemakkelijk gemaakt en hun verlangens opgewekt.",
                            "verse 47:26": "Dat is doordat zij tot degenen die haten wat God heeft geopenbaard, zeggen: \"Wij willen u in sommige zaken gehoorzamen.",
                            "verse 47:27": "En hoe (zal het zjin) wanneer de engelen bij de dood hun ziel zullen nemen, hun aangezicht en hun rug treffend?",
                            "verse 47:28": "Omdat zij datgene volgen wat God vertoornt en haten wat Hem behaagt, daarom heeft Hij hun werken vruchteloos gemaakt.",
                            "verse 47:29": "Denken zij wier hart ziek is, dat God hun boosaardigheden niet aan het licht zou brengen?",
                            "verse 47:30": "En indien Wij wilden, konden Wij hen (de huichelaars) aan u tonen, zodat gij hen aan hun merkteken zoudt kennen.",
                            "verse 47:31": "En Wij zullen u zeker beproeven totdat Wij diegenen onder u onderscheiden die ijverig streven en standvastig zijn.",
                            "verse 47:32": "Voorzeker, zij die niet geloven en (anderen) van God’s pad afleiden en die de boodschapper tegenwerken, nadat de leiding hun duidelijk is geworden, zullen God stellig niet schaden doch Hij zal hun werken vruchteloos maken.",
                            "verse 47:33": "O.",
                            "verse 47:34": "Waarlijk, de ongelovigen, die van het pad van God afleiden en sterven, terwiil zij ongelovig zijn, God zal hen zeker niet vergeven.",
                            "verse 47:35": "Weifelt daarom niet noch roept om vrede, want gij zult de overhand hebben.",
                            "verse 47:36": "Het leven dezer wereld is slechts een spel en een (ijdel) vermaak, en indien gij gelooft en (God) vreest, zal Hij u belonen en zal u niet om uw (gehele) bezit vragen.",
                            "verse 47:37": "Want indien Hij dit van u zou vragen en er op zou aandringen, zoudt gij vrekkig worden en Hij zou uw boosaardigheden aan het licht brengen.",
                            "verse 47:38": "Ziet, gij zijt het, die geroepen wordt ter wille van God (een deel van uw vermogen) te geven, maar er zijn sommigen onder u die vrekkig zijn."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 47:1": "Those who disbelieve and turn (men) from the way of Allah, He rendereth their actions vain.",
                            "verse 47:2": "And those who believe and do good works and believe in that which is revealed unto Muhammad - and it is the truth from their Lord - He riddeth them of their ill-deeds and improveth their state.",
                            "verse 47:3": "That is because those who disbelieve follow falsehood and because those who believe follow the truth from their Lord.",
                            "verse 47:4": "Now when ye meet in battle those who disbelieve, then it is smiting of the necks until, when ye have routed them, then making fast of bonds; and afterward either grace or ransom till the war lay down its burdens.",
                            "verse 47:5": "He will guide them and improve their state,",
                            "verse 47:6": "And bring them in unto the Garden which He hath made known to them.",
                            "verse 47:7": "O ye who believe! If ye help Allah, He will help you and will make your foothold firm.",
                            "verse 47:8": "And those who disbelieve, perdition is for them, and He will make their actions vain.",
                            "verse 47:9": "That is because they are averse to that which Allah hath revealed, therefor maketh He their actions fruitless.",
                            "verse 47:10": "Have they not travelled in the land to see the nature of the consequence for those who were before them ? Allah wiped them out.",
                            "verse 47:11": "That is because Allah is patron of those who believe, and because the disbelievers have no patron.",
                            "verse 47:12": "Lo! Allah will cause those who believe and do good works to enter Gardens underneath which rivers flow; while those who disbelieve take their comfort in this life and eat even as the cattle eat, and the Fire is their habitation.",
                            "verse 47:13": "And how many a township stronger than thy township (O Muhammad) which hath cast thee out, have We destroyed, and they had no helper!",
                            "verse 47:14": "Is he who relieth on a clear proof from his Lord like those for whom the evil that they do is beautified while they follow their own lusts ?",
                            "verse 47:15": "A similitude of the Garden which those who keep their duty (to Allah) are promised: Therein are rivers of water unpolluted, and rivers of milk whereof the flavour changeth not, and rivers of wine delicious to the drinkers, and rivers of clear-run honey; therein for them is every kind of fruit, with pardon from their Lord.",
                            "verse 47:16": "Among them are some who give ear unto thee (Muhammad) till, when they go forth from thy presence they say unto those who have been given knowledge: What was that he said just now ? Those are they whose hearts Allah hath sealed, and they follow their own lusts.",
                            "verse 47:17": "While as for those who walk aright, He addeth to their guidance, and giveth them their protection (against evil).",
                            "verse 47:18": "Await they aught save the Hour, that it should come upon them unawares ? And the beginnings thereof have already come.",
                            "verse 47:19": "So know (O Muhammad) that there is no God save Allah, and ask forgiveness for thy sin and for believing men and believing women.",
                            "verse 47:20": "And those who believe say: If only a surah were revealed! But when a decisive surah is revealed and war is mentioned therein, thou seest those in whose hearts is a disease looking at thee with the look of men fainting unto death.",
                            "verse 47:21": "Obedience and a civil word.",
                            "verse 47:22": "Would ye then, if ye were given the command, work corruption in the land and sever your ties of kinship ?",
                            "verse 47:23": "Such are they whom Allah curseth so that He deafeneth them and maketh blind their eyes.",
                            "verse 47:24": "Will they then not meditate on the Qur’an, or are there locks on the hearts ?",
                            "verse 47:25": "Lo! those who turn back after the guidance hath been manifested unto them, Satan hath seduced them, and He giveth them the rein.",
                            "verse 47:26": "That is because they say unto those who hate what Allah hath revealed: We will obey you in some matters; and Allah knoweth their secret talk.",
                            "verse 47:27": "Then how (will it be with them) when the angels gather them, smiting their faces and their backs!",
                            "verse 47:28": "That will be because they followed that which angereth Allah, and hated that which pleaseth Him.",
                            "verse 47:29": "Or do those in whose hearts is a disease deem that Allah will not bring to light their (secret) hates ?",
                            "verse 47:30": "And if We would, We could show them unto thee (Muhammad) so that thou shouldst know them surely by their marks.",
                            "verse 47:31": "And verily We shall try you till We know those of you who strive hard (for the cause of Allah) and the steadfast, and till We test your record.",
                            "verse 47:32": "Lo! those who disbelieve and turn from the way of Allah and oppose the messenger after the guidance hath been manifested unto them, they hurt Allah not a jot, and He will make their actions fruitless.",
                            "verse 47:33": "O ye who believe! Obey Allah and obey the messenger, and render not your actions vain.",
                            "verse 47:34": "Lo! those who disbelieve and turn from the way of Allah and then die disbelievers, Allah surely will not pardon them.",
                            "verse 47:35": "So do not falter and cry out for peace when ye (will be) the uppermost, and Allah is with you, and He will not grudge (the reward of) your actions.",
                            "verse 47:36": "The life of the world is but a sport and a pastime.",
                            "verse 47:37": "If He should ask it of you and importune you, ye would hoard it, and He would bring to light your (secret) hates.",
                            "verse 47:38": "Lo! ye are those who are called to spend in the way of Allah, yet among you there are some who hoard."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 47:1": "Those who reject God and hinder (men) from the Path of God,- their deeds will God render astray (from their mark).",
                            "verse 47:2": "But those who believe and work deeds of righteousness, and believe in the (Revelation) sent down to Muhammad - for it is the Truth from their Lord,- He will remove from them their ills and improve their condition.",
                            "verse 47:3": "This because those who reject God follow vanities, while those who believe follow the Truth from their Lord: Thus does God set forth for men their lessons by similitudes.",
                            "verse 47:4": "Therefore, when ye meet the Unbelievers (in fight), smite at their necks; At length, when ye have thoroughly subdued them, bind a bond firmly (on them): thereafter (is the time for) either generosity or ransom: Until the war lays down its burdens.",
                            "verse 47:5": "Soon will He guide them and improve their condition,",
                            "verse 47:6": "And admit them to the Garden which He has announced for them.",
                            "verse 47:7": "O ye who believe! If ye will aid (the cause of) God, He will aid you, and plant your feet firmly.",
                            "verse 47:8": "But those who reject (God),- for them is destruction, and (God) will render their deeds astray (from their mark).",
                            "verse 47:9": "That is because they hate the Revelation of God; so He has made their deeds fruitless.",
                            "verse 47:10": "Do they not travel through the earth, and see what was the End of those before them (who did evil)? God brought utter destruction on them, and similar (fates await) those who reject God.",
                            "verse 47:11": "That is because God is the Protector of those who believe, but those who reject God have no protector.",
                            "verse 47:12": "Verily God will admit those who believe and do righteous deeds, to Gardens beneath which rivers flow; while those who reject God will enjoy (this world) and eat as cattle eat; and the Fire will be their abode.",
                            "verse 47:13": "And how many cities, with more power than thy city which has driven thee out, have We destroyed (for their sins)? and there was none to aid them.",
                            "verse 47:14": "Is then one who is on a clear (Path) from his Lord, no better than one to whom the evil of his conduct seems pleasing, and such as follow their own lusts?",
                            "verse 47:15": "(Here is) a Parable of the Garden which the righteous are promised: in it are rivers of water incorruptible; rivers of milk of which the taste never changes; rivers of wine, a joy to those who drink; and rivers of honey pure and clear.",
                            "verse 47:16": "And among them are men who listen to thee, but in the end, when they go out from thee, they say to those who have received Knowledge, \"What is it he said just then?\" Such are men whose hearts God has sealed, and who follow their own lusts.",
                            "verse 47:17": "But to those who receive Guidance, He increases the (light of) Guidance, and bestows on them their Piety and Restraint (from evil).",
                            "verse 47:18": "Do they then only wait for the Hour,- that it should come on them of a sudden? But already have come some tokens thereof, and when it (actually) is on them, how can they benefit then by their admonition?",
                            "verse 47:19": "Know, therefore, that there is no god but God, and ask forgiveness for thy fault, and for the men and women who believe: for God knows how ye move about and how ye dwell in your homes.",
                            "verse 47:20": "Those who believe say, \"Why is not a sura sent down (for us)?\" But when a sura of basic or categorical meaning is revealed, and fighting is mentioned therein, thou wilt see those in whose hearts is a disease looking at thee with a look of one in swoon at the approach of death.",
                            "verse 47:21": "Were it to obey and say what is just, and when a matter is resolved on, it were best for them if they were true to God.",
                            "verse 47:22": "Then, is it to be expected of you, if ye were put in authority, that ye will do mischief in the land, and break your ties of kith and kin?",
                            "verse 47:23": "Such are the men whom God has cursed for He has made them deaf and blinded their sight.",
                            "verse 47:24": "Do they not then earnestly seek to understand the Qur’an, or are their hearts locked up by them?",
                            "verse 47:25": "Those who turn back as apostates after Guidance was clearly shown to them,- the Evil One has instigated them and busied them up with false hopes.",
                            "verse 47:26": "This, because they said to those who hate what God has revealed, \"We will obey you in part of (this) matter\"; but God knows their (inner) secrets.",
                            "verse 47:27": "But how (will it be) when the angels take their souls at death, and smite their faces and their backs?",
                            "verse 47:28": "This because they followed that which called forth the Wrath of God, and they hated God’s good pleasure; so He made their deeds of no effect.",
                            "verse 47:29": "Or do those in whose hearts is a disease, think that God will not bring to light all their rancour?",
                            "verse 47:30": "Had We so wiled, We could have shown them up to thee, and thou shouldst have known them by their marks: but surely thou wilt know them by the tone of their speech! And God knows all that ye do.",
                            "verse 47:31": "And We shall try you until We test those among you who strive their utmost and persevere in patience; and We shall try your reported (mettle).",
                            "verse 47:32": "Those who reject God, hinder (men) from the Path of God, and resist the Apostle, after Guidance has been clearly shown to them, will not injure God in the least, but He will make their deeds of no effect.",
                            "verse 47:33": "O ye who believe! Obey God, and obey the apostle, and make not vain your deeds!",
                            "verse 47:34": "Those who reject God, and hinder (men) from the Path of God, then die rejecting God,- God will not forgive them.",
                            "verse 47:35": "Be not weary and faint-hearted, crying for peace, when ye should be uppermost: for God is with you, and will never put you in loss for your (good) deeds.",
                            "verse 47:36": "The life of this world is but play and amusement: and if ye believe and guard against Evil, He will grant you your recompense, and will not ask you (to give up) your possessions.",
                            "verse 47:37": "If He were to ask you for all of them, and press you, ye would covetously withhold, and He would bring out all your ill-feeling.",
                            "verse 47:38": "Behold, ye are those invited to spend (of your substance) in the Way of God: But among you are some that are niggardly."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 47:1": "Those who disbelieve and bar from God’s way, God will send their works astray.",
                            "verse 47:2": "But those who believe and do righteous deeds and believe in what is sent down to Muhammad -- and it is the truth from their Lord -- He will acquit them of their evil deeds, and dispose their minds aright.",
                            "verse 47:3": "That is because those who disbelieve follow falsehood, and those who believe follow the truth from their Lord.",
                            "verse 47:4": "When you meet the unbelievers, smite their necks, then, when you have made wide slaughter among them, tie fast the bonds; then set them free, either by grace or ransom, till the war lays down its loads.",
                            "verse 47:5": "He will guide them, and dispose their minds aright,",
                            "verse 47:6": "and He will admit them to Paradise, that He has made known to them.",
                            "verse 47:7": "O believers, if you help God, He will help you, and confirm your feet.",
                            "verse 47:8": "But as for the unbelievers, ill chance shall befall them! He will send their works astray.",
                            "verse 47:9": "That is because they have been averse to what God has sent down, so He has made their works to fail.",
                            "verse 47:10": "What, have they not journeyed in the land and beheld how was the end of those before them? God destroyed them; the unbelievers shall have the likes thereof.",
                            "verse 47:11": "That is because God is the Protector of the believers, and that the unbelievers have no protector.",
                            "verse 47:12": "God shall surely admit those who believe and do righteous deeds into gardens underneath which rivers flow.",
                            "verse 47:13": "How many a city that was stronger in might than thy city which has expelled thee have We destroyed! And there was no helper for them.",
                            "verse 47:14": "What, is he who is upon a clear sign from his Lord like unto such a one unto whom his evil deeds have been decked out fair, and they have followed their caprices?",
                            "verse 47:15": "This is the similitude of Paradise which the godfearing have been promised: therein are rivers of water unstaling, rivers of milk unchanging in flavour, and rivers of wine -- a delight to the drinkers, rivers, too, of honey purified; and therein for them is every fruit, and forgiveness from their Lord -- Are they as he who dwells forever in the Fire, such as are given to drink boiling water, that tears their bowels asunder?",
                            "verse 47:16": "And some of them there are give ear to thee, till, when they go forth from thee, they say to those who have been given knowledge, ’What said he just now?’ Those are they upon whose hearts God has set a seal, and they have followed their caprices.",
                            "verse 47:17": "But those who are guided aright, them He increases in guidance, and gives them their godfearing.",
                            "verse 47:18": "Are they looking for aught but the Hour, that it shall come upon them suddenly? Already its tokens have come; so, when it has come to them, how shall they have their Reminder?",
                            "verse 47:19": "Know thou therefore that there is no god but God, and ask forgiveness for thy sin, and for the believers, men and women.",
                            "verse 47:20": "Those who believe say, ’Why has a sura not been sent down?’ Then, when a clear sura is sent down, and therein fighting is mentioned, thou seest those in whose hearts is sickness looking at thee as one who swoons of death; but better for them would be",
                            "verse 47:21": "obedience, and words honourable.",
                            "verse 47:22": "If you turned away, would you then haply work corruption in the land, and break your bonds of kin?",
                            "verse 47:23": "Those are they whom God has cursed, and so made them deaf, and blinded their eyes.",
                            "verse 47:24": "What, do they not ponder the Koran? Or is it that there are locks upon their hearts?",
                            "verse 47:25": "Those who have turned back in their traces after the guidance has become clear to them, Satan it was that tempted them, and God respited them.",
                            "verse 47:26": "That is because they said to those who were averse to what God sent down, ’We will obey you in some of the affair’; and God knows their secrets.",
                            "verse 47:27": "How shall it be, when the angels take them, beating their faces and their backs?",
                            "verse 47:28": "That is because they have followed what angers God, and have been averse to His good pleasure, so He has made their works to fail.",
                            "verse 47:29": "Or did those in whose hearts is sickness think that God would not bring to light their rancour?",
                            "verse 47:30": "Did We will, We would show them to thee, then thou wouldst know them by their mark; and thou shalt certainly know them in the twisting of their speech; and God knows your deeds.",
                            "verse 47:31": "And We shall assuredly try you until We know those of you who struggle and are steadfast, and try your tidings.",
                            "verse 47:32": "Those who disbelieve and bar from God’s way and make a breach with the Messenger after the guidance has become clear to them, they will nothing hurt God, and He will make their works to fail.",
                            "verse 47:33": "O believers, obey God, and obey the Messenger, and do not make your own works vain.",
                            "verse 47:34": "Those who disbelieve and bar from God’s way and then die disbelieving, them God will not forgive.",
                            "verse 47:35": "So do not faint and call for peace; you shall be the upper ones, and God is with you, and will not deprive you of your works.",
                            "verse 47:36": "The present life is naught but a sport and a diversion; and if you believe and are godfearing, He will give you your wages, and will not ask of you your goods.",
                            "verse 47:37": "If He asks you for them, and presses you, you are niggardly, and He brings to light your rancour.",
                            "verse 47:38": "Ha, there you are; you are called upon to expend in God’s way, and some of you are niggardly."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 47:1": "AS FOR THOSE who are bent on denying the truth and on barring",
                            "verse 47:2": "from the path of God – all their",
                            "verse 47:3": "deeds will He let go to waste;",
                            "verse 47:4": "whereas those who have attained to faith and do righteous deeds, and have come to believe in what has been bestowed from on high on Muhammad – for it is the truth from their Sustainer – [shall attain to God’s grace:] He will efface their",
                            "verse 47:5": "bad deeds, and will set their hearts at rest.",
                            "verse 47:6": "This, because they who are bent on denying the truth pursue falsehood, whereas they who have attained to faith pursue",
                            "verse 47:7": "the truth [that flows] from their Sustainer.",
                            "verse 47:8": "NOW WHEN you meet [in war] those who are bent on denying the truth, smite their necks until you overcome them fully, and then tighten their bonds; but thereafter [set them free,] either by an act of grace or against ransom, so that the burden of war may be lifted: thus [shall it be].",
                            "verse 47:9": "but [He wills you to struggle] so as to test you",
                            "verse 47:10": "by means of one another.",
                            "verse 47:11": "He will guide them [in the hereafter as well], and will set their hearts at rest,",
                            "verse 47:12": "and will admit them to the paradise which He has promised them.",
                            "verse 47:13": "O you who have attained to faith! If you help [the cause of] God, He will help you, and will make firm your steps;",
                            "verse 47:14": "but as for those who are bent on denying the truth, ill fortune awaits them, since He will let all their",
                            "verse 47:15": "deeds go to waste:",
                            "verse 47:16": "this, because they hate [the very thought of] what God has bestowed from on high – and thus He causes all their deeds to come to nought!",
                            "verse 47:17": "Have they, then, never journeyed about the earth and beheld what happened in the end to those [willful sinners] who lived before their time? God destroyed them utterly: and the like thereof awaits all who deny the truth.",
                            "verse 47:18": "This, because God is the Protector of all who have attained to faith, whereas they who deny the truth have no protector.",
                            "verse 47:19": "Verily, God will admit all who attain to faith and do righteous deeds into gardens through which running waters flow, whereas they who are bent on denying the truth shall have – even though they may enjoy their life [in this world] and eat as cattle eat – the fire [of the hereafter] for their abode.",
                            "verse 47:20": "And how many a community of greater power than this thy community which has driven thee out, [O Muhammad,] have We destroyed, with none to succour them!",
                            "verse 47:21": "CAN, THEN, he who takes his stand on a clear evidence from his Sustainer be likened unto one to whom the evil of his own doings",
                            "verse 47:22": "seems goodly, and unto such as would follow but their own lusts?",
                            "verse 47:23": "[And can] the parable of the paradise which the God-conscious are promised – [a paradise] wherein there are rivers of water which time does not corrupt, and rivers of milk the taste whereof never alters, and rivers of wine delightful to those who drink it, and rivers of honey of all impurity cleansed, and the enjoyment of all the fruits [of their good deeds] and of forgiveness from their Sustainer – can this [parable of paradise] be likened unto [the parable of the recompense of] such as are to abide in the fire and be given waters of burning despair to drink, so that it will tear their bowels asunder?",
                            "verse 47:24": "Now among those [hapless sinners] are such as [pretend to] listen to thee, [O Muhammad,] and then, as soon as they leave thy presence, speak [with scorn] unto those who have understood [thy message]: \"What is it that he has said just now?\" It is such as these whose hearts God has sealed because they",
                            "verse 47:25": "followed but their own lusts",
                            "verse 47:26": "just as for those who are [willing to be] guided, He increases their [ability to follow His] guidance and causes them to grow in God-consciousness.",
                            "verse 47:27": "Are, then, they [whose hearts are sealed] waiting for the Last Hour –",
                            "verse 47:28": "that it come upon them of a sudden? But it has already been foretold! And what will their remembrance [of their past sins] avail them, once it has come upon them?",
                            "verse 47:29": "Know, then, [O man,] that there is no deity save God, and [while there is yet time,] ask forgiveness for thy sins and for [the sins of] all other believing men and women: for God knows all your comings and goings as well as your abiding [at rest].",
                            "verse 47:30": "NOW THOSE who have attained to faith say, \"Would that a revelation [allowing us to fight] were bestowed from on high!\" But now that a revelation clear in and by itself, mentioning war, has been bestowed from on high, thou canst see those in whose hearts is disease looking at thee, [O Muhammad,] with the look of one who is about to faint for fear of death! And yet, far better for them would be",
                            "verse 47:31": "obedience [to God’s call] and a word that could win",
                            "verse 47:32": "approval: for, since the matter has been resolved [by His revelation], it would be but for their own good to remain true to God.",
                            "verse 47:33": "[Ask them:] \"Would you, perchance, after having turned away [from God’s commandment, prefer to revert to your old ways, and] spread corruption on earth, and [once again] cut asunder your ties of kinship?\"",
                            "verse 47:34": "It is such as these whom God rejects, and whom He makes deaf [to the voice of truth], and whose eyes He blinds [to its sight]!",
                            "verse 47:35": "Will they not, then, ponder over this Qur’ān? – or are there locks upon their hearts?",
                            "verse 47:36": "VERILY, those who turn their backs [on this message] after guidance has been vouchsafed to them, [do it because] Satan has embellished their fancies and filled them with false hopes:",
                            "verse 47:37": "[they do turn their backs on it] inasmuch as they are wont to say unto those who abhor all that God has revealed, \"We will comply with your views on some points.",
                            "verse 47:38": "hence, how [will they fare] when the angels gather them in death, striking their faces and their backs?",
                            "verse 47:39": "This, because they were wont to pursue what God condemns, and to hate [whatever would meet with] His goodly acceptance: and so He has caused all their",
                            "verse 47:40": "deeds to come to nought.",
                            "verse 47:41": "Or do they in whose hearts is disease think, perchance, that God would never bring their moral failings to light?",
                            "verse 47:42": "Now had We so willed, We could have shown them clearly to thee, so that thou wouldst know them for sure as by a visible mark: but [even so,] thou wilt most certainly recognize them by the tone of their voice.",
                            "verse 47:43": "and most certainly We shall try you all, so that We might mark out those of you who strive hard [in Our cause] and are patient in adversity: for We shall put to a test [the truth of] all your assertions.",
                            "verse 47:44": "Verily, they who are bent on denying the truth and on barring",
                            "verse 47:45": "from the path of God, and [who thus] cut themselves off from the Apostle after guidance has been vouchsafed to them, can in no wise harm God; but He will cause all their deeds to come to nought.",
                            "verse 47:46": "O you who have attained to faith! Pay heed unto God, and pay heed unto the Apostle, and let not your",
                            "verse 47:47": "deeds come to nought!",
                            "verse 47:48": "Verily, as for those who are bent on denying the truth and on barring",
                            "verse 47:49": "from the path of God, and then die as deniers of the truth – indeed, God will not grant them forgiveness!",
                            "verse 47:50": "AND SO, [when you fight in a just cause,] do not lose heart and",
                            "verse 47:51": "beg for peace: for, seeing that God is with you, you are bound to rise high [in the end]; and never will He let your",
                            "verse 47:52": "deeds go to waste.",
                            "verse 47:53": "The life of this world is but a play and a passing delight: but if you believe [in God] and are conscious of Him, He will grant you your deserts.",
                            "verse 47:54": "",
                            "verse 47:55": "if He were to demand of you all of them, and urge you, you would niggardly cling [to them], and so He would",
                            "verse 47:56": "bring out your moral failings.",
                            "verse 47:57": "Behold, [O believers,] it is you who are called upon to spend freely in God’s cause: but",
                            "verse 47:58": "among you are such as turn out to be niggardly! And yet, he who acts niggardly [in God’s cause] is but niggardly towards his own self: for God is indeed self-sufficient, whereas you stand in need [of Him]; and if you turn away [from Him], He will cause other people to take your place, and they will not be the likes of you!",
                            "verse 47:59": "destroyed save iniquitous folk?”",
                            "verse 47:60": "from the path of God” – thus connecting with verse 1 and laying down the fundamental condition which alone justifies physical warfare: namely, a defence of the Faith and of freedom (cf.",
                            "verse 47:61": "deeds go to waste” occurring in verses 1 and 8.",
                            "verse 47:62": "as regards your denial of God, or of resurrection, or of the fact of revelation as such, we do agree with you that Muhammad is an impostor and that the Qur’ān is but his invention” (Rāzī)."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 47:1": "…God is the Rich, and ye are the poor.",
                            "verse 47:2": "Sources",
                            "verse 47:3": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 47:4": "The Book of Certainty (1952) •",
                            "verse 47:5": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 47:6": "What is Sufism (1975) •",
                            "verse 47:7": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 47:8": "Muhammad (1983) •",
                            "verse 47:9": "Symbol and Archetype (1991) •",
                            "verse 47:10": "Sufi Poems (2004) •",
                            "verse 47:11": "Mecca (2004) •",
                            "verse 47:12": "Return to the Spirit (2005) •",
                            "verse 47:13": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 47:14": "“Proofs of Islam”(1954).",
                            "verse 47:15": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 47:16": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 47:17": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 47:18": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 47:19": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 47:20": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 47:21": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 47:22": "“The Quranic Origins of Sufism” •",
                            "verse 47:23": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 47:24": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 47:25": "“An Introduction to Islam” •",
                            "verse 47:26": "“The Universality of the Quran” •",
                            "verse 47:27": "Private Talks Books",
                            "verse 47:28": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 47:1": "Those who disbelieved, and prevented (others) from Allah’s way, He (Allah) has rendered their deeds vain.",
                            "verse 47:2": "And those who believed and did righteous deeds and believed in that which is revealed to MuHammad,-and it is the truth (that has come) from their Lord-He will write off their evil deeds, and will set aright their state of affairs.",
                            "verse 47:3": "That is because the disbelievers have followed falsehood, while the believers have followed the truth (that has come) from their Lord.",
                            "verse 47:4": "So, when you encounter those who disbelieve, then (aim at) smiting the necks, until when you have broken their strength thoroughly, then tie fast the bond, (by making them captives).",
                            "verse 47:5": "(Instead,) He will guide them, and will set aright their state of affairs,",
                            "verse 47:6": "and will admit them to the Paradise He has identified for them.",
                            "verse 47:7": "O you who believe, if you will help (the religion prescribed by) Allah, He will help you, and will stabilize your footings.",
                            "verse 47:8": "As for those who disbelieve, (destined) for them is destruction, and He has rendered their deeds vain.",
                            "verse 47:9": "That is because they hate what Allah has sent down; therefore Allah has nullified their deeds.",
                            "verse 47:10": "Have they not travelled in the land so that they might see how was the end of those before them? Allah brought utter destruction to them.",
                            "verse 47:11": "That is because Allah is the supporter of those who believe.",
                            "verse 47:12": "Surely, Allah will admit those who believe and do good deeds to the gardens beneath which rivers flow.",
                            "verse 47:13": "How many a town, stronger in might than your town that has expelled you, have We destroyed! Then, there was none to help them.",
                            "verse 47:14": "Then, can one who holds on to a clear proof from his Lord be like those for whom their evil deeds are beautified, and who followed their desires?",
                            "verse 47:15": "(Here is) a description of the Paradise that is promised for the God-fearing! In it there are rivers of water, never spoiling, and rivers of milk the taste of which would not go bad, and rivers of wine, delicious to the drinkers, and rivers of honey, fully purified.",
                            "verse 47:16": "Among them there are ones who (pretend to) give ear to you, until when they go out from your presence, they say to those who have been given knowledge, “What did he say just now?” Those are the ones on whose hearts Allah has put a seal, and they have followed their desires.",
                            "verse 47:17": "As for those who have adopted right path, Allah improves them in guidance, and gives them their piety.",
                            "verse 47:18": "They are waiting for nothing but for the Hour (of Doom) that it should come upon them suddenly.",
                            "verse 47:19": "So, be assured that there is no god but Allah, and seek forgiveness for your fault, and for (the faults of) the believing men and believing women.",
                            "verse 47:20": "And the believers say, “Why has a (new) Sūrah not been revealed?” Then, once an operative Sūrah is sent down, and fighting (in Allah’s way) is mentioned in it, you notice those who have disease in their hearts, looking to you like one who is faint because of death.",
                            "verse 47:21": "The (reality of their) obedience and (truthfulness of their) speech is fully known (as being mere deception).",
                            "verse 47:22": "So, (O hypocrites,) do you not apprehend that, in case you turn away (from Jihād ), you will spread disorder in the land and will sever your ties of kinship?",
                            "verse 47:23": "Those are the ones whom Allah has cursed; so He has made them deaf, and made their eyes blind.",
                            "verse 47:24": "Then, do they not give serious thought to the Qur’ān, or do they have locks on their hearts?",
                            "verse 47:25": "Surely those who turn back after the guidance has appeared to them clearly, it is Satan who has tempted them and involved them in far-fetched fancies.",
                            "verse 47:26": "That is because they say to those who hate that which Allah has revealed, “We will obey you in some respects.",
                            "verse 47:27": "So, how (miserable) will they be when the angels will exact their souls, smiting their faces and their backs?",
                            "verse 47:28": "That is because they followed that which has angered Allah, and they disliked His pleasure; therefore He has nullified their deeds.",
                            "verse 47:29": "Do those having malady in their hearts think that Allah will never expose their grudges (against Islam)?",
                            "verse 47:30": "Had We willed, We would have shown them to you (by identifying each one of them,) so as you would definitely recognize them by their features.",
                            "verse 47:31": "And We will certainly test you until We know those of you who carry out Jihād (struggle in Allah’s way) and observe patience, and until We check your episodes.",
                            "verse 47:32": "Those who disbelieve and prevent (others) from Allah’s way, and oppose the Messenger, after the Guidance has appeared to them clearly, shall never bring harm to Allah in the least, and He will render their deeds vain.",
                            "verse 47:33": "O you who believe, obey Allah and obey the Messenger, and do not nullify your deeds.",
                            "verse 47:34": "Those who disbelieved and prevented (others) from Allah’s way, then died as disbelievers, Allah will never forgive them.",
                            "verse 47:35": "So, do not lose heart, and do not appeal for peace; you will be the uppermost, and Allah is with you; and He will never deprive you of your deeds.",
                            "verse 47:36": "The worldly life is but play and pastime.",
                            "verse 47:37": "If He were to ask you of it, and press you (to spend all your wealth), you would show miserliness, and He would expose your disgusts.",
                            "verse 47:38": "Yes, you are such that you are called upon to spend in Allah’s way, but some of you withhold in miserliness- and he who withholds in miserliness withholds against himself- and Allah is the Need-Free, and you are the needy."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 47:1": "Those who disbelieve and bar from the way of God, He will leave their works to waste.",
                            "verse 47:2": "But those who believe and perform righteous deeds and believe in what has been revealed to Muhammad — and it is the truth from their Lord — He will absolve them of their misdeeds and rightly dispose their mind.",
                            "verse 47:3": "That is because those who disbelieve follow falsehood, and because those who believe follow the truth from their Lord.",
                            "verse 47:4": "So when you encounter [in battle] those who disbelieve, then [attack them with] a striking of the necks.",
                            "verse 47:5": "taken vengeance on them, but that He may test some of you by means of others.",
                            "verse 47:6": "He will guide them and rightly dispose their minds.",
                            "verse 47:7": "And He will admit them into Paradise, which He has made known to them.",
                            "verse 47:8": "O you who believe! If you help God, He will help you and make your foothold firm.",
                            "verse 47:9": "And as for those who disbelieve, wretchedness shall be their lot.",
                            "verse 47:10": "That is because they are averse to what God has revealed, so He has made their works fail.",
                            "verse 47:11": "Have they not travelled in the land to see the nature of the consequence for those who were before them? God destroyed them; and [a fate] the like thereof will be for the disbelievers.",
                            "verse 47:12": "That is because God is Patron of those who believe and because the disbelievers have no patron.",
                            "verse 47:13": "God will surely admit those who believe and perform righteous deeds into gardens underneath which rivers flow.",
                            "verse 47:14": "And how many a town mightier in power than your town, which expelled you, have We destroyed, and they had none to help them.",
                            "verse 47:15": "Is he who follows a clear sign from his Lord like those whose evil deeds have been adorned for them, and who follow their desires?",
                            "verse 47:16": "A similitude of the Garden promised to the God-fearing: therein are rivers of unstaling water, and rivers of milk unchanging in flavour, and rivers of wine delicious to the drinkers, and",
                            "verse 47:17": "rivers of purified honey; and there will be for them therein every fruit and forgiveness from their Lord.",
                            "verse 47:18": "And there are some among them who listen to you, until, when they go forth from you, they say to those who have been given knowledge: ‘What was he saying just now?’ Those are the ones on whose hearts God has set a seal and who follow their own desires.",
                            "verse 47:19": "But those who are",
                            "verse 47:20": "guided, He enhances their guidance and invests them with fear [of Him].",
                            "verse 47:21": "Do they, then, await anything except that the Hour should come upon them suddenly? For already its portents have come.",
                            "verse 47:22": "will their reminder be?",
                            "verse 47:23": "Know, then, that there is no god except God, and ask forgiveness for your sin and for the believing men and believing women.",
                            "verse 47:24": "And those who believe say: ‘Why has a sūra not been revealed?’ But when a definitive sūra is revealed, and fighting is mentioned in it, you see those in whose hearts is a sickness, looking at you with the look of someone fainting at [the point of] death.",
                            "verse 47:25": "would be [to offer] obedience and honourable words.",
                            "verse 47:26": "May it not be [the case] with you that if you were to turn away, you would then cause corruption in the land and sever your kinship ties?",
                            "verse 47:27": "Those are the ones whom God has cursed, so made them deaf and blinded their eyes.",
                            "verse 47:28": "Do they not contemplate the Qur’ān? Or is it that there are locks on,",
                            "verse 47:29": "hearts?",
                            "verse 47:30": "Truly those who have turned their backs after the guidance has become clear to them, Satan has seduced them and has given them",
                            "verse 47:31": "hopes.",
                            "verse 47:32": "That is because they said to those who were averse to what God revealed: ‘We will obey you in some matters’; and God knows their secrets.",
                            "verse 47:33": "Then how will it be when the angels take them away, beating their faces and their backs?",
                            "verse 47:34": "That is because they followed what angers God, and",
                            "verse 47:35": "they were averse to what pleases Him.",
                            "verse 47:36": "Or did those in whose hearts is a sickness suppose that God would not expose their rancour?",
                            "verse 47:37": "And if We will, We could show them to you, then you would recognise them by their mark.",
                            "verse 47:38": "tone of speech, and God knows your deeds.",
                            "verse 47:39": "And We will assuredly try you until We know those of you who struggle [for God’s cause] and those who are steadfast, and We will appraise your record.",
                            "verse 47:40": "Indeed those who disbelieve and bar from way of God, and defy the Messenger after the guidance has become clear to them, they will not hurt God in any way, and He will make their works fail.",
                            "verse 47:41": "O you who believe! Obey God and obey the Messenger, and do not render your own works void.",
                            "verse 47:42": "Indeed those who disbelieve and bar from the way of God, and then die as disbelievers, God will never forgive them.",
                            "verse 47:43": "So do not falter, and [do not] call for peace when you have the upper hand, and God is with you, and He will not stint you in [the reward for] your works.",
                            "verse 47:44": "The life of this world is merely play and diversion; but if you believe and are wary, He will give you your rewards, and will not ask you your wealth [in return].",
                            "verse 47:45": "If He were to ask you for it, and press you, you would be niggardly, and this would expose your rancour.",
                            "verse 47:46": "Lo! there you are those who are being called to expend in the way of God; yet among you there are those who are niggardly; and whoever is niggardly is niggardly only to his own soul."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 47:1": "Those who disbelieve and hinder (others) from the way of Allah, Allah destroys their actions (as for their reward in the Hereafter).",
                            "verse 47:2": "And those who embrace faith and do pious works persistently and believe in this (Book) which has been revealed to Muhammad (blessings and peace be upon him), and that is the very truth from their Lord, Allah erases their evil works from their (record of deeds) and refines their states of being.",
                            "verse 47:3": "That is because those who disbelieve follow falsehood, and those who believe follow the truth (sent down) from their Lord.",
                            "verse 47:4": "So when you are to fight (for the elimination of militancy and terrorism) against the (warring) disbelievers (in the battlefield), strike their necks (whilst fighting because they slaughtered harmless human lives and destroyed peace by their terrorist activities) till, when you have killed a good many of them (in the battle), then tie (the remaining prisoners) tightly.",
                            "verse 47:5": "He will soon put them on the straight path (of Paradise), and will greatly enhance their states of being (in the Hereafter).",
                            "verse 47:6": "And He will (ultimately) admit them to Paradise which He has (already) made well known to them.",
                            "verse 47:7": "O believers! If you help (the Din",
                            "verse 47:8": "of) Allah, He will help you and will make your feet firm.",
                            "verse 47:9": "And those who disbelieve, for them is destruction and (Allah) has ruined their actions.",
                            "verse 47:10": "That is because they hate that (Book) which Allah has sent down so He has made their actions come to nothing.",
                            "verse 47:11": "Have they not travelled and toured in the earth so that they could see the fate of those who passed before them? Allah cast upon them total destruction.",
                            "verse 47:12": "That is because Allah is the Protector and Helper of those who believe, and for sure the disbelievers do not have any protector and helper.",
                            "verse 47:13": "Surely, those who believe and do pious works, Allah will admit them to Gardens with streams flowing under them, and those who disbelieve and are enjoying (worldly) gains and eat as cattle (animals) do, so Hell alone will be their abode.",
                            "verse 47:14": "And, (O Beloved,) how many a town have We destroyed whose citizens wielded greater power (i.",
                            "verse 47:15": "Is someone who is (firm) on the clear proof from his Lord like those whose evil actions are shown to them as fair and who follow the desires of their (ill-commanding) selves?",
                            "verse 47:16": "A feature of the Paradise which is promised to the Godfearing is that therein are streams of (such) water as will never putrefy (in smell or colour), and (in it) will be streams of milk whose taste and flavour will never change, and streams of (such a pure) wine that is an absolute delight for all who drink it and streams of purified honey; and (in it) will be fruits of every kind (for them) and forgiveness (of every sort) from their Lord.",
                            "verse 47:17": "And amongst them are those who give ears to you (without their heads and hearts in it) till, when they leave your presence and go (out), they ask those who have been given (profitable) knowledge: ‘What is it that he (the Messenger [blessings and peace be upon him]) said just now?’ It is they whose hearts Allah has sealed up and they are following their lusts.",
                            "verse 47:18": "And as for those who have taken guidance, Allah increases their guidance and honours them with their station of Godwariness.",
                            "verse 47:19": "So are they (the deniers) now just waiting for the Last Hour to come upon them all of a sudden? Its signs have no doubt drawn (near).",
                            "verse 47:20": "Know then that there is no God except Allah and (to offer worship and to educate the Umma )",
                            "verse 47:21": "always ask forgiveness (from Allah) lest an action unworthy of your incomparable station may come into occurrence.",
                            "verse 47:22": "And the believers say why a Sura (Chapter) is not revealed (about the command of defensive fighting).",
                            "verse 47:23": "(Best for them would be) obedience and good words.",
                            "verse 47:24": "So, (O hypocrites,) what is expected of you is that if you (escape fighting by dodging and) attain to power, you will spread only mischief in the land and break your ties of kinship (which Allah and His Messenger [blessings and peace be upon him] have commanded to strengthen with affection and care).",
                            "verse 47:25": "It is they whom Allah has cursed and made deaf (their ears) and blinded their eyes.",
                            "verse 47:26": "Do they not think over the Qur’an, or are their hearts locked?",
                            "verse 47:27": "Surely, those who turned back (to disbelief) after the guidance had become clear to them, Satan (by fraud) made (turning back to disbelief) look good to them and gave them false hope of living long (in the world).",
                            "verse 47:28": "That is because they said to those who dislike the Book revealed by Allah: ‘We shall obey you in certain matters.",
                            "verse 47:29": "Then what will be (their plight at the time) when the angels will snatch out their souls (this way) that they will be striking their faces and their backs?",
                            "verse 47:30": "That is because they followed that (path) which displeases Allah and disliked His good pleasure; so He made (all) their actions null and void.",
                            "verse 47:31": "Do those who have the disease (of hypocrisy) in their hearts think that Allah will never make known their malice and hostilities?",
                            "verse 47:32": "And if We will, We can surely show these (hypocrites) to you (in such a manner) that you may recognize them by their facial expressions and (likewise) you may recognize them by their conversation style and Allah knows (best) all your actions.",
                            "verse 47:33": "And We shall certainly try you till We bring to light those of you who strive hard and fight (firm-footed) and who observe patience and expose your (secret) news (of hypocritical cowardice) as well.",
                            "verse 47:34": "Indeed, those who disbelieved and hindered (the people) from the way of Allah and opposed the Messenger (blessings and peace be upon him), (and chose the path of breaking away from him,) after the guidance (i.",
                            "verse 47:35": "O believers! Obey Allah and obey the Messenger (blessings and peace be upon him) and do not ruin your works.",
                            "verse 47:36": "Indeed, those who disbelieved and hindered (the people) from the way of Allah and then died as disbelievers, Allah will never forgive them.",
                            "verse 47:37": "(O believers!) Do not lose heart and do not ask (the warring disbelievers) for peace (lest it should suggest your weakness).",
                            "verse 47:38": "Doubtlessly, the life of the world is nothing but merely a sport and pastime.",
                            "verse 47:39": "If He asks you for this wealth and puts you under scarcity for that, then you will feel constrained (at heart and) become miserly.",
                            "verse 47:40": "Remember! You are those who are called to spend in the way of Allah."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Jotka eivät usko, vaan kääntyvät pois Jumalan tieltä, niiden teot Hän tekee tyhjäksi.",
                            "verse 47:2": "Mutta jotka tekevät hyvää ja uskovat sen, mitä Muhammedille on ilmoitettu, joka on heidän Herraltaan saatu totuus, heidän pahat tekonsa Hän pyyhkii pois ja parantaa heidän asemansa.",
                            "verse 47:3": "Näin käy siksi, että epäuskoiset seuraavat valheen jälkiä ja uskovaiset noudattavat totuutta, joka tulee heidän Herraltaan.",
                            "verse 47:4": "Kun siis kohtaatte taistelussa uskottomat, niin nujertakaa heiltä niskat, niin että voitatte heidät! Sitten ottakaa heidät vangiksi ja jälkeenpäin joko suosiollisesti vapauttakaa heidät tai antakaa heidän lunastaa itsensä vapaiksi, kun sota on päättynyt! Niin on oleva.",
                            "verse 47:5": "Hän ohjaa heitä ja parantaa heidän asemansa,",
                            "verse 47:6": "sekä antaa heidän päästä paratiisiin, jonka Hän on tehnyt heille tunnetuksi.",
                            "verse 47:7": "Jos uskovaiset autatte Jumalan asiaa, Hän auttaa teitä ja tukee askeleitanne.",
                            "verse 47:8": "Mutta niitä, jotka ovat epäuskoisia, odottaa tuho, ja Hän tekee tyhjäksi heidän työnsä.",
                            "verse 47:9": "Näin tapahtuu sentähden, että he ylenkatsoivat Jumalan ilmoituksia, ja niin Hän antaa heidän tekojensa raueta tyhjiin.",
                            "verse 47:10": "Eivätkö he ole matkanneet ympäri maata ja nähneet, minkälaisen lopun saivat ne, jotka elivät ennen heitä? Jumala saattoi heidät perikatoon, ja uskottomilla on oleva sama kohtalo.",
                            "verse 47:11": "Näin tapahtuu, koska Jumala on uskovien suojelija ja koska uskottomilla ei ole ketään suojelijaa.",
                            "verse 47:12": "Totisesti antaa Jumala niiden, jotka uskovat ja tekevät hyvää, käydä sisälle paratiisiin, jonka kautta joet virtaavat, mutta ne, jotka ovat epäuskoisia ja nauttivat ja syövät kuin elukat, heidän olinpaikkansa on tuli.",
                            "verse 47:13": "Miten monta kaupunkia olemmekaan tuhonnut, kaupunkeja, jotka olivat mahtavampia kuin se, joka on karkoittanut sinut, eikä niillä ollut ketään auttajaa.",
                            "verse 47:14": "Onko se, joka on saanut selvän todistuksen Herraltaan niiden kaltainen, joille pahat tekonsa ovat ihanat ja jotka noudattavat alhaisia halujaan.",
                            "verse 47:15": "Tällainen on kuvaus paratiisista, joka on luvattu niille, jotka karttavat pahaa: siellä on virtoja, joiden vesi ei samene, maitovirtoja, joiden maku ei muutu, viinivirtoja, suloisia juoda, ja kirkkaita hunajavirtoja.",
                            "verse 47:16": "Jotkut näistä tosin yrittävät kuunnella sinua, mutta kun he lähtevät luotasi, he sanovat niille, jotka ovat saaneet tiedon: »Mitä uutta hän sanoi?» Näiden sydämen Jumala on paaduttanut, ja he seuraavat alhaisia himojaan.",
                            "verse 47:17": "Mutta niille, jotka seuraavat oikeata suuntaa, Hän tuo johdatustaan runsaammin ja antaa heille varjeluksensa.",
                            "verse 47:18": "Mitä muuta epäuskoiset siis odottavat, kuin että hetki tulisi heille äkkiä? Nyt ovat todella sen enteet jo tulleet, mutta mitä apua heillä on kehoituksesta, kun hetki on tullut?",
                            "verse 47:19": "Tiedä siis, ettei ole muuta jumalaa kuin Jumala, ja pyydä anteeksiantoa synneistä itsellesi ja uskoville miehille ja naisille.",
                            "verse 47:20": "Uskovaiset sanovat: »Miksi ei ole yhtään suuraa ilmoitettu?» Mutta kun selkeä suura ilmoitetaan ja siinä mainitaan taistelu, näet kuinka ne, joiden sydämessä on sairaus, katsovat sinuun niinkuin se, jonka valtaa kuoleman uupumus.",
                            "verse 47:21": "Kuuliaisuus ja lempeä sana sopisi heille paremmin; mutta kun asia on päätöksessä, olisi heille totisesti parempi, jos he pysyisivät Jumalalle uskollisina.",
                            "verse 47:22": "Mutta jos teillä olisi valta, tekisitte varmasti ilkitöitä ja katkoisitte sukulaisuussiteenne.",
                            "verse 47:23": "Nämä Jumala on kironnut ja saattanut kuuroiksi sekä sokaissut heidän silmänsä.",
                            "verse 47:24": "Eivätkö he siis tutkistele Koraania? Eivät, heidän sydämensä ovat lukitut.",
                            "verse 47:25": "Niille, jotka palaavat entiselleen sen jälkeen, kun selvä johdatus on heille annettu, on saatana totisesti tehnyt sen helpoksi asiaksi, ja Hän antaa heille vapaat kädet.",
                            "verse 47:26": "Sillä he sanovat salaa niille, jotka ylenkatsovat Jumalan ilmoituksia: »Me tahdomme totella teitä joissakin asioissa.",
                            "verse 47:27": "Mutta kuinka käy, kun enkelit tuovat heille kuoleman käskyn, lyöden heitä kasvoihin ja selkään?",
                            "verse 47:28": "Sillä he noudattavat sitä, mikä ei miellytä Jumalaa, vaan on Hänen tahtoaan vastaan; siksi Hän on tehnyt tyhjäksi heidän tekonsa.",
                            "verse 47:29": "Vai ajattelevatko ne, joiden sydämessä on sairaus, että Jumala ei tuo ilmi heidän ilkitöitään?",
                            "verse 47:30": "Ja jos Me tahtoisimme, niin olisimme voinut asettaa niin, että olisit totisesti tuntenut heidät tuntomerkeistään; ja totisesti sinä voit tuntea heidät puheestaan; niin, Jumala tuntee tekonne.",
                            "verse 47:31": "Totisesti koettelemme teitä siksi, kunnes olemme oppinut tuntemaan teistä ne, jotka ovat urhoollisia ja kestäviä, koettelemme, kunnes asianne on Meille ilmeinen.",
                            "verse 47:32": "Totisesti, ne, jotka eivät usko, vaan kääntyvät pois Jumalan tieltä vastustaen sananjulistajaa, sitten kun johdatus on heille ilmoitettu, ne eivät voi vahingoittaa Jumalaa millään tavoin, mutta Hän tekee tyhjäksi heidän tekonsa.",
                            "verse 47:33": "Te, jotka uskotte, totelkaa Jumalaa, olkaa kuuliaisia sananjulistajalle älkääkä saattako tekojanne raukeamaan!",
                            "verse 47:34": "Totisesti ne, jotka eivät usko, vaan hylkäävät Jumalan tien, kuolevat, koska he ovat epäuskoisia, eikä Jumala anna heille mitään anteeksi.",
                            "verse 47:35": "Älkää siis olko heikkoja anoen rauhaa, sillä te olette voitolla ja Jumala on kanssanne.",
                            "verse 47:36": "Maallinen elämä on vain turhaa ilvettä ja leikkiä, mutta jos te uskotte ja kartatte pahaa, Hän antaa teille palkkanne eikä kysy teiltä mitään tavaraa.",
                            "verse 47:37": "Jos Hän vaatisi teiltä sitä, te olisitte itaria ja Hän saattaisi pahuutenne ilmi.",
                            "verse 47:38": "Katso, te kuulutte niihin, jotka ovat kutsutut uhraamaan varojansa Jumalan asian edistämiseksi, mutta teidän joukossanne on kitsaita; ja jos joku on kitsas, se on vain hänen oman sielunsa vahingoksi."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 47:1": "Ceux qui mécroient et qui écartent les hommes de Son chemin, Dieu rend vaines leurs actions.",
                            "verse 47:2": "Mais ceux qui croient, qui accomplissent des œuvres pies, qui croient à ce qui a été révélé à Muhammad, à ce qui est la Vérité venue de leur Seigneur, Il efface leurs mauvaises actions et Il incline leur pensée vers le bien.",
                            "verse 47:3": "Il en est ainsi parce que ceux qui mécroient s'attachent à l'erreur, tandis que ceux qui croient suivent la Vérité de leur Seigneur.",
                            "verse 47:4": "Lorsqu'au combat vous rencontrez les mécréants, terrassez-les en les frappant sur la nuque et ligotez-les fermement ; plus tard, vous les libérerez ou les échangerez contre une rançon en attendant que la guerre dépose ses fardeaux.",
                            "verse 47:5": "Il les dirigera et Il inclinera leur pensée vers le bien,",
                            "verse 47:6": "puis Il les introduira dans le Jardin qu'Il leur a fait connaître.",
                            "verse 47:7": "O vous qui croyez : si vous aidez Dieu, Il vous aidera et Il affermira vos pas.",
                            "verse 47:8": "Puissent les mécréants périr, et que Dieu rende vaines leurs œuvres !",
                            "verse 47:9": "Il en sera ainsi à cause de l'aversion qu'ils ont éprouvée pour ce que Dieu a révélé.",
                            "verse 47:10": "N'ont-ils pas parcouru la terre et vu quelle a été la fin de ceux qui ont vécu avant eux ? Dieu les a exterminés, et voici que la même fin attend les mécréants.",
                            "verse 47:11": "Il en est ainsi parce que Dieu est le protecteur des croyants, alors que les mécréants n'ont pas de protecteur.",
                            "verse 47:12": "Certes, Dieu fera entrer ceux qui auront cru et qui auront accompli des œuvres pies dans des Jardins sous lesquels coulent les fleuves.",
                            "verse 47:13": "Combien de cités, plus redoutables en force que ta cité, celle qui t'a expulsé, n'avons- Nous pas détruites.",
                            "verse 47:14": "Est-ce que celui qui s'en tient à l'évidence fournie par son Seigneur est semblable à celui dont les mauvaises actions sont faussement embellies à ses yeux, et à ceux qui suivent leurs passions ?",
                            "verse 47:15": "Voici comment se présente le Jardin promis à ceux qui craignent Dieu : il est traversé par des fleuves dont l'eau est incorruptible, des fleuves de lait au goût inaltérable, des fleuves de vin délicieux à boire, des fleuves de miel pur.",
                            "verse 47:16": "Il y a parmi eux des gens qui te prêtent l'oreille ; mais à peine t'ont-ils quitté qu'ils vont dire à ceux qui ont reçu la science : \" Que vient-il de raconter ? \" Tels sont les hommes sur les cœurs desquels Dieu a apposé un sceau et qui suivent leurs passions.",
                            "verse 47:17": "Quant à ceux qui suivent la bonne direction, Dieu augmente leur Guidance et Il leur inspire une crainte révérencielle.",
                            "verse 47:18": "Attendent-ils que l'Heure les prenne au dépourvu ? Déjà ses prémisses sont arrivées ; mais quand elle sera là, à quoi donc leur servira le rappel qui leur a été adressé ?",
                            "verse 47:19": "Sache qu'en vérité, il n'y a de divinité que Dieu ! Demande pardon pour ton péché, pour les croyants et les croyantes.",
                            "verse 47:20": "Ceux qui croient disent : \" Puisse une sourate être révélée ! \" Mais il suffit que soit révélée une sourate péremptoire dans laquelle il est fait mention du combat, pour que tu voies ceux dont les cœurs sont malades te regarder comme celui qui défaille à l'approche de la mort.",
                            "verse 47:21": "l'obéissance et un langage bienséant.",
                            "verse 47:22": "Si vous vous détournez, ne serez-vous pas capables de semer la corruption sur la terre et de rompre vos liens du sang ?",
                            "verse 47:23": "Tels sont ceux que Dieu a maudits, qu'Il a rendus muets, et dont Il a aveuglé le regard.",
                            "verse 47:24": "Ne méditeront-ils pas sur le Coran, à moins que leurs cœurs ne soient verrouillés ?",
                            "verse 47:25": "Ceux qui sont revenus sur leurs pas après que la Guidance leur eut été clairement exposée ont été abusés par le Démon, qui leur a donné de faux espoirs.",
                            "verse 47:26": "Il en est ainsi parce qu'ils disent à ceux qui éprouvent de l'aversion pour ce que Dieu a révélé : \" Nous allons vous obéir en certaines choses \".",
                            "verse 47:27": "Que feront-ils lorsque les anges viendront leur ôter la vie et les frapperont au visage et sur le dos ?",
                            "verse 47:28": "Il en sera ainsi parce qu'ils suivent ce qui courrouce Dieu et qu'ils éprouvent de l'aversion pour ce qu'Il agrée.",
                            "verse 47:29": "Ceux dont les cœurs sont malades pensent-ils que Dieu ne mettra pas au grand jour leur malveillance ?",
                            "verse 47:30": "Si Nous voulions, Nous te les montrerions sous leur vrai jour en sorte que tu les reconnaîtrais à leurs marques, et tu les reconnaîtrais à la fausseté de leur langage.",
                            "verse 47:31": "Nous vous éprouverons afin de connaître ceux de vous qui mènent le combat et qui sont patients et afin de tester votre réputation.",
                            "verse 47:32": "Oui, ceux qui mécroient, qui détournent leurs semblables du chemin de Dieu, qui se sont séparés du Prophète après que la bonne Guidance leur eut été clairement exposée, ceux-là ne nuisent en rien à Dieu et Il rendra stériles leurs œuvres.",
                            "verse 47:33": "O vous qui croyez, obéissez à Dieu et obéissez au Prophète ! Ne rendez pas vaines vos œuvres !",
                            "verse 47:34": "En vérité, ceux qui mécroient, qui détournent leurs semblables du chemin de Dieu et qui, ensuite, meurent dans la mécréance, Dieu ne leur pardonnera pas.",
                            "verse 47:35": "Ne faiblissez pas, n'appelez pas la paix alors que vous êtes les plus forts et que Dieu est avec vous : Il ne vous privera pas du fruit de vos œuvres.",
                            "verse 47:36": "La vie de ce monde n'est que jeu et frivolité.",
                            "verse 47:37": "S'Il vous les demandait et vous pressait, vous vous montreriez avares.",
                            "verse 47:38": "C'est bien vous qui êtes appelés à dépenser dans le chemin de Dieu ; mais il y a parmi vous des avares."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 47:1": "Ceux qui ont mécru et obstrué le chemin de Dieu, Il a rendu leurs oeuvres vaines.",
                            "verse 47:2": "Et ceux qui ont cru et accompli de bonnes oeuvres et ont cru en ce qui a été descendu sur Muhammad - et c’est la vérité venant de leur Seigneur - Il leur efface leurs méfaits et améliore leur condition.",
                            "verse 47:3": "Il en est ainsi parce que ceux qui ont mécru ont suivi le Faux et que ceux qui ont cru ont suivi la Vérité émanant de leur Seigneur.",
                            "verse 47:4": "Lorsque vous rencontrez (au combat) ceux qui ont mécru frappez-en les cous.",
                            "verse 47:5": "Il les guidera et améliorera leur condition,",
                            "verse 47:6": "et les fera entrer au Paradis qu’Il leur aura fait connaître.",
                            "verse 47:7": "ô vous qui croyez ! si vous faites triompher (la cause d’) Dieu, Il vous fera triompher et raffermira vos pas.",
                            "verse 47:8": "Et quand à ceux qui ont mécru, il y aura un malheur pour eux, et Il rendra leurs oeuvres vaines.",
                            "verse 47:9": "C’est parce qu’ils ont de la répulsion pour ce que Dieu a fait descendre.",
                            "verse 47:10": "N’ont-il pas parcouru la terre pour voir ce qu’il est advenu de leurs prédécesseurs ? Dieu les a détruits.",
                            "verse 47:11": "C’est que Dieu est vraiment le Protecteur de ceux qui ont cru; tandis que les mécréants n’ont pas de protecteur.",
                            "verse 47:12": "Ceux qui croient et accomplissent de bonnes oeuvres, Dieu les fera entrer dans des Jardins sous lesquels coulent les ruisseaux.",
                            "verse 47:13": "Et que de cités, bien plus fortes que ta cité qui t’a expulsé, avons-Nous fait périr, et ils n’eurent point de secoureur.",
                            "verse 47:14": "Est-ce que celui qui se base sur une preuve claire venant de son Seigneur est comparable à ceux dont on a embelli les mauvaises actions et qui ont suivi leurs propres passions.",
                            "verse 47:15": "Voici la description du Paradis qui a été promis aux pieux : il y aura là des ruisseaux d’une eau jamais malodorante, et des ruisseaux d’un lait au goût inaltérable, et des ruisseaux d’un vin délicieux à boire, ainsi que des ruisseaux d’un miel purifié.",
                            "verse 47:16": "seront-ils pareils à ceux qui s’éternisent dans le Feu et qui sont abreuvés d’une eau bouillante qui leur déchire les entrailles ?",
                            "verse 47:17": "Et il en est parmi eux qui t’écoutent.",
                            "verse 47:18": "Quant à ceux qui se mirent sur la bonne voie, Il les guida encore plus et leur inspira leur piété.",
                            "verse 47:19": "Qu’est-ce qu’ils attendent sinon que l’Heure leur vienne à l’improviste ? Or ses signes avant-coureurs sont certes déjà venus.",
                            "verse 47:20": "Sache donc qu’en vérité, il n’y a point de divinité à part Dieu, et implore le pardon pour ton péché, ainsi que pour les croyants et les croyantes.",
                            "verse 47:21": "Ceux qui ont cru disent : «Ah ! Si une Sourate descendait ! » Puis, quand on fait descendre une Sourate explicite et qu’on y mentionne le combat, tu vois ceux qui ont une maladie au coeur te regarder du regard de celui qui s’évanouit devant la mort.",
                            "verse 47:22": "une obéissance et une parole convenable.",
                            "verse 47:23": "Si vous détournez , ne risquez-vous pas de semer la corruption sur terre et de rompre vos liens de parenté ?",
                            "verse 47:24": "Ce sont ceux-là que Dieu a maudits, a rendus sourds et a rendu leurs yeux aveugles.",
                            "verse 47:25": "Ne méditent-ils pas sur le Coran ? Ou y a-t-il des cadenas sur leurs coeurs ?",
                            "verse 47:26": "Ceux qui sont revenus sur leurs pas après que le droit chemin leur a été clairement exposé, le Diable les a séduits et trompés.",
                            "verse 47:27": "C’est parce qu’ils ont dit à ceux qui ont de la répulsion pour la révélation de Dieu : «Nous allons vous obéir dans certaines choses».",
                            "verse 47:28": "Qu’adviendra-t-il d’eux quand les Anges les achèveront, frappant leurs faces et leurs dos ?",
                            "verse 47:29": "Cela parce qu’ils ont suivi ce qui courrouce Dieu, et qu’ils ont de la répulsion pour [ce qui attire] Son agrément.",
                            "verse 47:30": "Ou bien est-ce que ceux qui ont une maladie au coeur escomptent que Dieu ne saura jamais faire apparaître leur haine ?",
                            "verse 47:31": "Or, si Nous voulions Nous te les montrerions.",
                            "verse 47:32": "Nous vous éprouverons certes afin de distinguer ceux d’entre vous qui luttent [pour la cause de Dieu] et qui endurent, et afin d’éprouver [faire apparaître] vos nouvelles.",
                            "verse 47:33": "Ceux qui ont mécru et obstrué le chemin de Dieu et se sont mis dans le clan opposé au Messager après que le droit chemin leur fut clairement exposé, ne sauront nuire à Dieu en quoi que ce soit.",
                            "verse 47:34": "ô vous qui avez cru ! Obéissez à Dieu, obéissez au Messager, et ne rendez pas vaines vos oeuvres.",
                            "verse 47:35": "Ceux qui ont mécru et obstrué le chemin de Dieu puis sont morts tout en étant mécréants, Dieu ne leur pardonnera jamais.",
                            "verse 47:36": "Ne faiblissez donc pas et n’appelez pas à la paix alors que vous êtes les plus hauts, que Dieu et avec vous, et qu’Il ne vous frustrera jamais [du mérite] de vos oeuvres.",
                            "verse 47:37": "La vie présente n’est que jeu et amusement; alors que si vous croyez et craignez ,",
                            "verse 47:38": "Il vous accordera vos récompenses et ne vous demandera pas vos biens .",
                            "verse 47:39": "S’Il vous les demandait importunément, vous deviendriez avares et Il ferait apparaître vos haines.",
                            "verse 47:40": "Vous voilà appelés à faire des dépenses dans le chemin de Dieu."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Diejenigen, die ungläubig sind und abwendig machen vom Wege Allahs - deren Werke macht Er zunichte.",
                            "verse 47:2": "Die aber gläubig sind und gute Werke tun und an das glauben, was auf Mohammed herabgesandt ward - und es ist die Wahrheit von ihrem Herrn -, denen nimmt Er ihre Sünden hinweg und bessert ihren Stand.",
                            "verse 47:3": "Dies, weil jene, die ungläubig sind, dem Falschen folgen; die aber gläubig sind, folgen der Wahrheit von ihrem Herrn.",
                            "verse 47:4": "Wenn ihr (in der Schlacht) auf die stoßet, die ungläubig sind, trefft (ihre) Nacken; und wenn ihr sie so überwältigt habt, dann schnüret die Bande fest.",
                            "verse 47:5": "Er wird ihnen zum Sieg verhelfen und ihren Stand bessern",
                            "verse 47:6": "Und sie ins Paradies führen, das Er ihnen zu wissen getan hat.",
                            "verse 47:7": "O die ihr glaubt, wenn ihr Allahs (Sache) helft; so wird Er euch helfen und euch fest Fuß fassen lassen.",
                            "verse 47:8": "Die aber ungläubig sind - wehe ihnen! Er wird ihre Werke zunichte machen.",
                            "verse 47:9": "Dies, weil sie hassen, was Allah herniedergesandt hat; so machte Er ihre Werke fruchtlos.",
                            "verse 47:10": "Sind sie nicht auf der Erde umhergereist, um zu sehen, wie das Ende derer war, die vor ihnen waren? Allah richtete sie zugrunde, und für die Ungläubigen ist das gleiche wie ihnen bestimmt.",
                            "verse 47:11": "Das ist, weil Allah der Beschützer derer ist, die glauben; die Ungläubigen aber haben keinen Beschützer.",
                            "verse 47:12": "Allah wird jene, die glauben und gute Werke tun, in Gärten führen, die Ströme durchfließen; die aber ungläubig sind, die genießen und fressen wie das Vieh, und das Feuer wird ihre Wohnstatt sein.",
                            "verse 47:13": "Und wie so manche Stadt, mächtiger als deine Stadt, die dich austrieb, haben Wir schon zerstört; und sie hatten keinen Helfer!",
                            "verse 47:14": "Sollte denn der, der sich auf einen klaren Beweis von seinem Herrn stützt, gleich denen sein, denen das Übel ihres Tuns schön gemacht wurde und die ihren bösen Gelüsten folgen?",
                            "verse 47:15": "Ein Gleichnis von dem Paradiese, den Rechtschaffenen verheißen: Darin sind Ströme von Wasser, das nicht verdirbt, und Ströme von Milch, deren Geschmack sich nicht ändert, und Ströme von Wein, köstlich für die Trinkenden, und Ströme geläuterten Honigs.",
                            "verse 47:16": "Und unter ihnen sind einige, die auf dich hören, doch wenn sie von dir fortgehen, sagen sie jenen, denen das Wissen gegeben ward: «Was hat er da soeben gesagt?» Diese sind es, deren Herzen Allah versiegelt hat und die ihren bösen Gelüsten folgen.",
                            "verse 47:17": "Denen aber, die rechtgeleitet sind, mehrt Er die Führung und verleiht ihnen Rechtschaffenheit.",
                            "verse 47:18": "Sie warten nur auf die «Stunde», daß sie plötzlich über sie komme.",
                            "verse 47:19": "Wisse drum, daß es keinen Gott gibt außer Allah, und bitte um Vergebung für deine Fehler und für die gläubigen Männer und die gläubigen Frauen.",
                            "verse 47:20": "Und die da glauben, sprechen: «Warum wird keine Sura herabgesandt?» Doch wenn eine entscheidende Sura herabgesandt wird und es ist darin von Kampf die Rede, dann siehst du die, in deren Herzen Krankheit ist, dich anschauen mit dem Blicke eines, der ob des Todes von Ohnmacht Wallen wird.",
                            "verse 47:21": "Gehorsam und ein gutes Wort (wäre besser für sie).",
                            "verse 47:22": "Wolltet ihr denn, indem ihr euch (vom Kampf) abwendet, Verderben im Land haben und die Verwandtschaftsbande zerschneiden?",
                            "verse 47:23": "Diese sind es, die Allah verflucht, so daß Er sie taub macht und ihre Blicke blendet.",
                            "verse 47:24": "Wollen sie also nicht über den Koran nachdenken, oder ist's, daß die Herzen unter ihren Schlössern sind?",
                            "verse 47:25": "Jene, die den Rücken kehren, nachdem ihnen der Weg sichtbar ward, Satan hat sie getäuscht und ihnen falsche Hoffnungen eingegeben.",
                            "verse 47:26": "Dies, weil sie zu denen, die das hassen, was Allah herniedersandte, sprachen: «Wir wollen euch in einigen Sachen folgen.",
                            "verse 47:27": "Wie aber, wenn die Engel ihre Seelen dahinnehmen im Tode und sie aufs Gesicht und den Rücken schlagen?",
                            "verse 47:28": "Dies, weil sie dem folgten, was Allah erzürntes und haßten, was Ihm wohlgefällig war.",
                            "verse 47:29": "Wähnen etwa die, in deren Herzen Krankheit ist, Allah werde ihren geheimen Groll nicht ans Licht bringen?",
                            "verse 47:30": "Und wenn Wir es wollten, Wir könnten sie dir zeigen, so daß du sie an ihren Merkmalen erkennen würdest.",
                            "verse 47:31": "Wir wollen euch sicherlich prüfen, bis Wir diejenigen unter euch ausscheiden, die (für die Sache Gottes) streiten und standhaft sind.",
                            "verse 47:32": "Jene, die ungläubig sind und die abwendig machen von Allahs Weg und sich dem Gesandten widersetzen, nachdem ihnen der Weg sichtbar geworden, sie werden Allah in nichts schaden; doch Er wird ihre Werke fruchtlos machen.",
                            "verse 47:33": "O die ihr glaubt, gehorchet Allah und gehorchet dem Gesandten und vereitelt nicht eure Werke!",
                            "verse 47:34": "Wahrlich, jene, die ungläubig sind und die abwendig machen von Allahs Weg und dann als Ungläubige sterben - ihnen wird Allah gewiß nicht verzeihen.",
                            "verse 47:35": "So ermattet nicht, damit ihr nicht nach Frieden rufen müßt; denn ihr sollt obsiegen.",
                            "verse 47:36": "Das Leben in dieser Welt ist nur ein Spiel und ein Scherz, und wenn ihr gläubig seid und euch vor Übel hütet, so wird Er euch euren Lohn geben und wird nicht euer Gut von euch verlangen.",
                            "verse 47:37": "Sollte Er es von euch verlangen und euch drängen, ihr würdet geizig sein, und Er würde euren geheimen Groll ans Licht bringen.",
                            "verse 47:38": "Siehe, ihr seid diejenigen, die berufen sind, in Allahs Weg zu spenden; doch unter euch sind manche, die geizig sind."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "ftu yksxksa us dqÝ+ ,[+rs;kj fd;k vkSj ¼yksxksa dks½ [+kqnk ds jkLrs ls jksdk [+kqnk us muds vkeky vdkjr dj fn,",
                            "verse 47:2": "vkSj ftu yksxksa us bZeku d++qcwy fd;k vkSj vPNs ¼vPNs½ dke fd, vkSj tks ¼fdrkc½ eksgEen ij muds ijojfnxkj dh rjQ ls ukft+y gq;h gS vkSj og cjgd+ gS ml ij bZeku yk, rks [+kqnk us muds xqukg muls nwj dj fn, vkSj mudh gkyr laokj nh",
                            "verse 47:3": ";s bl otg ls fd dkfQjksa us >wBh ckr dh iSjoh dh vkSj bZeku okyksa us vius ijojfnxkj dk lPpk nhu ,[+rs;kj fd;k ;w¡ [+kqnk yksxksa ds le>kus ds fy, felkysa c;ku djrk gS",
                            "verse 47:4": "rks tc rqe dkfQjksa ls fHkM+ks rks ¼mudh½ xnZusa ekjks ;gk¡ rd fd tc rqe mUgsa t+[+eksa ls pwj dj Mkyks rks mudh eq’dsa dl yks fQj mlds ckn ;k rks ,glku j[k ¼dj NksM+ ns½ ;k eqvkost+k ysdj] ;gk¡ rd fd ¼nq’keu½ yM+kbZ ds gfFk;kj j[k ns rks ¼;kn j[kks½ vxj [+kqnk pkgrk rks ¼vkSj rjg½ muls cnyk ysrk exj mlus pkgk fd rqEgkjh vkt+ekb’k ,d nwljs ls ¼yM+ok dj½ djs vkSj tks yksx [+kqnk dh jkg esa Óghn fd;s x, mudh dkjxqt+kfj;ksa dks [+kqnk gjfxt+ vdkjr u djsxk",
                            "verse 47:5": "mUgsa vud+jhc eaft+ys ed+lwn rd igq¡pk,xk",
                            "verse 47:6": "vkSj mudh gkyr lokj nsxk vkSj mudks ml csfg’r esa nkf[+ky djsxk ftldk mUgsa ¼igys ls½ Ósuklk dj j[kk gS",
                            "verse 47:7": ",s bZekunkjksa vxj rqe [+kqnk ¼ds nhu½ dh enn djksxs rks og Hkh rqEgkjh enn djsxk vkSj rqEgsa lkfcr d+ne j[ksxk",
                            "verse 47:8": "vkSj tks yksx dkfQ+j gSa muds fy, rks MxexkgV gS vkSj [+kqnk ¼muds½ vkeky cjckn dj nsxk",
                            "verse 47:9": ";s blfy, fd [+kqnk us tks pht+ ukft+y Q+jek;h mls mUgksus ¼ukilUn fd;k½ rks [+kqnk us mudh dkjLrkfu;ksa dks vdkjr dj fn;k",
                            "verse 47:10": "rks D;k ;s yksx :, t+ehu ij pys fQjs ugha rks ns[krs tks yksx muls igys Fks mudk vUtke D;k ¼[+kjkc½ gqvk fd [+kqnk us mu ij rckgh Mky nh vkSj blh rjg ¼mu½ dkfQjksa dks Hkh ¼lt+k feysxh½",
                            "verse 47:11": ";s bl otg ls fd bZekunkjksa dk [+kqnk ljijLr gS vkSj dkfQjksa dk gjfxt+ dksbZ ljijLr ugha",
                            "verse 47:12": "[+kqnk mu yksxksa dks tks beku yk, vkSj vPNs ¼vPNs½ dke djrs jgs t+:j csfg’r ds mu ckx+ksa esa tk igq¡pk,xk ftuds uhps ugjsa tkjh gSa vkSj tks dkfQ+j gSa og ¼nqfu;k esa½ pSu djrs gSa vkSj bl rjg ¼csfQØh ls [kkrs ¼ihrs½ gSa tSls pkjik, [kkrs ihrs gSa vkSj vkf[+kj½ mudk fBdkuk tgUuqe gS",
                            "verse 47:13": "vkSj ftl cLrh ls rqe yksxksa us fudky fn;k mlls t+ksj esa dgha c<+ p<+ ds cgqr lh cfLr;k¡ Fkha ftudks geus rckg cckZn dj fn;k rks mudk dksbZ ennxkj Hkh u gqvk",
                            "verse 47:14": "D;k tks Ó[+l vius ijojfnxkj dh rjQ ls jkS’ku nyhy ij gks ml Ó[+l ds cjkcj gks ldrk gS ftldh cndkfj;k¡ mls Hkyh dj fn[kk;ha x;ha gksa og viuh uQ+fl;kuh [+okfg’kksa ij pyrs gSa",
                            "verse 47:15": "ftl csfg’r dk ijgst+xkjksa ls ok;nk fd;k tkrk gS mldh flQr ;s gS fd mlesa ikuh dh ugjsa ftuesa t+jk cw ugha vkSj nw/k dh ugjsa gSa ftudk et+k rd ugha cnyk vkSj Ójkc dh ugjsa gSa tks ihus okyksa ds fy, ¼ljklj½ yT+t+r gS vkSj lkQ+ Ó¶+Q+kQ+ Ógn dh ugjsa gSa vkSj ogk¡ muds fy, gj fdLe ds esos gSa vkSj muds ijojfnxkj dh rjQ ls cf[+’k’k gS ¼Hkyk ;s yksx½ muds cjkcj gks ldrs gSa tks ges’kk nkst+[+k esa jgsaxs vkSj mudks [kkSyrk gqvk ikuh fiyk;k tk,xk rks og vk¡rksa ds VqdM+s VqdM+s dj Mkysxk",
                            "verse 47:16": "vkSj ¼,s jlwy½ muesa ls ckt+ ,sls Hkh gSa tks rqEgkjh rjQ dku yxk, jgrs gSa ;gk¡ rd fd lc lquk dj tc rqEgkjs ikl ls fudyrs gSa rks ftu yksxksa dks bYe ¼dq+jku½ fn;k x;k gS muls dgrs gSa ¼D;ksa HkbZ½ vHkh ml Ó[+l us D;k dgk Fkk ;s ogh yksx gSa ftuds fnyksa ij [+kqnk us ¼dqÝ+ dh½ vyker eqd+jZj dj nh gS vkSj ;s viuh uQfl;kuh [+okfg’kksa ij py jgs gSa",
                            "verse 47:17": "vkSj tks yksx fgnk;r ;kQ+rk gSa mudks [+kqnk ¼d+qjku ds t+fj, ls½ et+hn fgnk;r djrk gS vkSj mudks ijgst+xkjh vrk Qjekrk gS",
                            "verse 47:18": "rks D;k ;s yksx cl d+;ker gh ds equrft+j gSa fd mu ij ,d ckjxh vk tk, rks mldh fu’kkfu;k¡ vk pqdh gSa rks ftl oD+r d+;ker mu ¼ds lj½ ij vk igq¡psxh fQj mUgsa ulhgr dgk¡ eqQhn gks ldrh gS",
                            "verse 47:19": "rks fQj le> yks fd [+kqnk ds flok dksbZ ekcwn ugha vkSj ¼ge ls½ vius vkSj bZekunkj enksZa vkSj bZekunkj vkSjrksa ds xqukgksa dh ekQ+h ekaxrs jgks vkSj [+kqnk rqEgkjs pyus fQjus vkSj Bgjus ls ¼[+kwc½ okfd+Q+ gS",
                            "verse 47:20": "vkSj eksfeuhu dgrs gSa fd ¼tsgkn ds ckjs esa½ dksbZ lwjk D;ksa ugha ukft+y gksrk ysfdu tc dksbZ lkQ+ ljhgh ek;uksa dk lwjk ukft+y gqvk vkSj mlesa tsgkn dk c;ku gks rks ftu yksxksa ds fny esa ¼usQ+kd+½ dk et+Z gS rqe mudks ns[kksxs fd rqEgkjh rjQ+ bl rjg ns[krs gSa tSls fdlh ij ekSr dh csgks’kh ¼Nk;h½ gks ¼fd mldh vk¡[ksa iFkjk tk,a½ rks mu ij ok, gks",
                            "verse 47:21": "¼muds fy, vPNk dke rks½ Qjekcjnkjh vkSj ilUnhnk ckr gS fQj tc yM+kbZ Bu tk, rks vxj ;s yksx [+kqnk ls lPps jgsa rks muds gd+ esa cgqr csgrj gS",
                            "verse 47:22": "¼equkfQ+d+ksa½ D;k rqels dqN nwj gS fd vxj rqe gkfd+e cuks rks :, t+ehu esa Qlkn QSykus vkSj vius fj’rs ukrksa dks rksM+us yxks ;s ogh yksx gSa ftu ij [+kqnk us ykur dh gS",
                            "verse 47:23": "vkSj ¼xks;k [k+qn mlus½ mu ¼ds dkuksa½ dks cgjk vkSj vk¡[kksa dks v¡/kk dj fn;k gS",
                            "verse 47:24": "rks D;k yksx d++qjku esa ¼t+jk Hkh½ x+kSj ugha djrs ;k ¼muds½ fnyksa ij rkys yxs gq, gSa",
                            "verse 47:25": "cs’kd tks yksx jkgs fgnk;r lkQ+ lkQ+ ekywe gksus ds ckn myVs ik¡o ¼dqÝ+ dh rjQ½ fQj x;s ÓSrku us mUgsa ¼cqrs nsdj½ <hy ns j[kh gS vkSj mudh ¼reUukvksa½ dh jfLl;k¡ njkt+ dj nh gSa",
                            "verse 47:26": ";g blfy, tks yksx [+kqnk dh ukft+y dh gqbZ ¼fdrkc½ ls cst+kj gSa ;s muls dgrs gSa fd ckt+ dkeksa esa ge rqEgkjh gh ckr ekusaxs vkSj [+kqnk muds iks’khnk e’kojksa ls okfd+Q gS",
                            "verse 47:27": "rks tc Qfj’rsa mudh tku fudkysaxs ml oD+r mudk D;k gky gksxk fd muds psgjksa ij vkSj mudh iq’r ij ekjrs tk,¡xs",
                            "verse 47:28": ";s bl lcc ls fd ftl pht+ksa ls [+kqnk uk[+kq’k gS mldh rks ;s yksx iSjoh djrs gSa vkSj ftlesa [+kqnk dh [+kq’kh gS mlls cst+kj gSa rks [+kqnk us Hkh mudh dkjLrkfu;ksa dks vdkjr dj fn;k",
                            "verse 47:29": "D;k og yksx ftuds fnyksa esa ¼usQ+kd+ dk½ et+Z gS ;s [+;ky djrs gSa fd [+kqnk fny ds dhuksa dks Hkh u t+kfgj djsxk",
                            "verse 47:30": "rks ge pkgrs rks ge rqEgsa bu yksxksa dks fn[kk nsrs rks rqe mudh is’kkuh gh ls mudks igpku ysrs vxj rqe mUgsa muds vUnkt+s xq¶+rxw gh ls t+:j igpku yksxs vkSj [+kqnk rks rqEgkjs vkeky ls okfd+Q gS",
                            "verse 47:31": "vkSj ge rqe yksxksa dks t+:j vkt+ek,¡xs rkfd rqeesa tks yksx tsgkn djus okys vkSj ¼rdyhQ+½ >syus okys gSa mudks ns[k ysa vkSj rqEgkjs gkykr tk¡p ysa",
                            "verse 47:32": "cs’kd ftu yksxksa ij ¼nhu dh½ lh/kh jkg lkQ+ t+kfgj gks x;h mlds ckn bUdkj dj cSBs vkSj ¼yksxksa dks½ [+kqnk dh jkg ls jksdk vkSj iSx+Ecj dh eq[+kkysQ+r dh rks [+kqnk dk dqN Hkh ugha fcxkM+ ldsaxs vkSj og mudk lc fd;k djk;k vd+kjr dj nsxk",
                            "verse 47:33": ",s bZekunkjksa [+kqnk dk gqDe ekuksa vkSj jlwy dh Qjek¡cjnkjh djks vkSj vius vkeky dks t+k;k u djks",
                            "verse 47:34": "cs’kd tks yksx dkfQ+j gks x, vkSj yksxksa dks [+kqnk dh jkg ls jksdk] fQj dkfQj gh ej x, rks [+kqnk mudks gjfxt+ ugha c[+’ksxk rks rqe fgEer u gkjks",
                            "verse 47:35": "vkSj ¼nq’keuksa dks½s lqyg dh nkor u nks rqe x+kfyc gks gh vkSj [+kqnk rks rqEgkjs lkFk gS vkSj gjfxt+ rqEgkjs vkeky ¼ds lokc dks de u djsxk½",
                            "verse 47:36": "nqfu;koh ft+Unxh rks cl [ksy rek’kk gS vkSj vxj rqe ¼[+kqnk ij½ bZeku j[kksxs vkSj ijgst+xkjh djksxs rks og rqedks rqEgkjs vtz buk;r Qjek,xk vkSj rqels rqEgkjs eky ugha ryc djsxk",
                            "verse 47:37": "vkSj vxj og rqels eky ryc djs vkSj rqels fpeV dj ek¡xs Hkh rks rqe ¼t+:j½ cq[+y djus yxks",
                            "verse 47:38": "vkSj [+kqnk rks rqEgkjs dhus dks t+:j t+kfgj djds jgsxk ns[kks rqe yksx ogh rks gks fd [+kqnk dh jkg esa [+kpZ ds fy, cqyk, tkrs gks rks ckt+ rqe esa ,sls Hkh gSa tks cq[+y djrs gSa vkSj ¼;kn jgs fd½ tks cq[+y djrk gS rks [+kqn vius gh ls cq[+y djrk gS vkSj [+kqnk rks csfu;kt+ gS vkSj rqe ¼mlds½ eksgrkt gks vkSj vxj rqe ¼[+qknk ds gqDe ls½ eq¡g Qsjksxs rks [+kqnk ¼rqEgkjs flok½ nwljksa cny nsxk vkSj og rqEgkjs ,sls ¼c[+khy½ u gksaxs"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Orang-orang yang kafir dan menghalang-halangi (manusia) dari jalan Allah, Allah menghapus perbuatan-perbuatan mereka.",
                            "verse 47:2": "Dan orang-orang yang beriman (kepada Allah) dan mengerjakan amal-amal yang saleh serta beriman (pula) kepada apa yang diturunkan kepada Muhammad dan itulah yang hak dari Tuhan mereka, Allah menghapuskan kesalahan-kesalahan mereka dan memperbaiki keadaan mereka.",
                            "verse 47:3": "Yang demikian adalah karena sesungguhnya orang-orang kafir mengikuti yang bathil dan sesungguhnya orang-orang yang beriman mengikuti yang hak dari Tuhan mereka.",
                            "verse 47:4": "Apabila kamu bertemu dengan orang-orang kafir (di medan perang) maka pancunglah batang leher mereka.",
                            "verse 47:5": "Allah akan memberi pimpinan kepada mereka dan memperbaiki keadaan mereka,",
                            "verse 47:6": "dan memasukkan mereka ke dalam surga yang telah diperkenalkan-Nya kepada mereka.",
                            "verse 47:7": "Hai orang-orang yang beriman, jika kamu menolong (agama) Allah, niscaya Dia akan menolongmu dan meneguhkan kedudukanmu.",
                            "verse 47:8": "Dan orang-orang yang kafir maka kecelakaanlah bagi mereka dan Allah menghapus amal-amal mereka.",
                            "verse 47:9": "Yang demikian itu adalah karena sesungguhnya mereka benci kepada apa yang diturunkan Allah (Al Qur’an) lalu Allah menghapuskan (pahala-pahala) amal-amal mereka.",
                            "verse 47:10": "Maka apakah mereka tidak mengadakan perjalanan di muka bumi sehingga mereka dapat memperhatikan bagaimana kesudahan orang-orang yang sebelum mereka; Allah telah menimpakan kebinasaan atas mereka dan orang-orang kafir akan menerima (akibat-akibat) seperti itu.",
                            "verse 47:11": "Yang demikian itu karena sesungguhnya Allah adalah pelindung orang-orang yang beriman dan karena sesungguhnya orang-orang kafir itu tiada mempunyai pelindung.",
                            "verse 47:12": "Sesungguhnya Allah memasukkan orang-orang yang beriman dan mengerjakan amal saleh ke dalam surga yang mengalir di bawahnya sungai-sungai.",
                            "verse 47:13": "Dan betapa banyaknya negeri-negeri yang (penduduknya) lebih kuat dari (penduduk) negerimu (Muhammad) yang telah mengusirmu itu.",
                            "verse 47:14": "Maka apakah orang yang berpegang pada keterangan yang datang dari Tuhannya sama dengan orang yang (syaitan) menjadikan dia memandang baik perbuatannya yang buruk itu dan mengikuti hawa nafsunya?",
                            "verse 47:15": "(Apakah) perumpamaan (penghuni) surga yang dijanjikan kepada orang-orang yang bertakwa yang di dalamnya ada sungai-sungai dari air yang tiada berubah rasa dan baunya, sungai-sungai dari air susu yang tiada berubah rasanya, sungai-sungai dari khamar (arak) yang lezat rasanya bagi peminumnya dan sungai-sungai dari madu yang disaring; dan mereka memperoleh di dalamnya segala macam buah-buahan dan ampunan dari Tuhan mereka, sama dengan orang yang kekal dalam neraka dan diberi minuman dengan air yang mendidih sehingga memotong-motong ususnya?",
                            "verse 47:16": "Dan di antara mereka ada orang yang mendengarkan perkataanmu sehingga apabila mereka keluar dari sisimu mereka berkata kepada orang yang telah diberi ilmu pengetahuan (sahabat-sahabat Nabi): \"Apakah yang dikatakannya tadi?\" Mereka itulah orang-orang yang dikunci mati hati mereka oleh Allah dan mengikuti hawa nafsu mereka.",
                            "verse 47:17": "Dan orang-orang yang mendapat petunjuk Allah menambah petunjuk kepada mereka dan memberikan kepada mereka (balasan) ketakwaannya.",
                            "verse 47:18": "Maka tidaklah yang mereka tunggu-tunggu melainkan hari kiamat (yaitu) kedatangannya kepada mereka dengan tiba-tiba, karena sesungguhnya telah datang tanda-tandanya.",
                            "verse 47:19": "Maka ketahuilah, bahwa sesungguhnya tidak ada Tuhan (Yang Hak) melainkan Allah dan mohonlah ampunan bagi dosamu dan bagi (dosa) orang-orang mu’min, laki-laki dan perempuan.",
                            "verse 47:20": "Dan orang-orang yang beriman berkata: \"Mengapa tiada diturunkan suatu surat ?\" Maka apabila diturunkan suatu surat yang jelas maksudnya dan disebutkan di dalamnya (perintah) perang, kamu lihat orang-orang yang ada penyakit di dalam hatinya memandang kepadamu seperti pandangan orang yang pingsan karena takut mati, dan kecelakaanlah bagi mereka.",
                            "verse 47:21": "Ta’at dan mengucapkan perkataan yang baik (adalah lebih baik bagi mereka).",
                            "verse 47:22": "Maka apakah kiranya jika kamu berkuasa kamu akan membuat kerusakan di muka bumi dan memutuskan hubungan kekeluargaan?",
                            "verse 47:23": "Mereka itulah orang-orang yang dila’nati Allah dan ditulikan-Nya telinga mereka dan dibutakan-Nya penglihatan mereka.",
                            "verse 47:24": "Maka apakah mereka tidak memperhatikan Al Qur’an ataukah hati mereka terkunci?",
                            "verse 47:25": "Sesungguhnya orang-orang yang kembali ke belakang (kepada kekafiran) sesudah petunjuk itu jelas bagi mereka, syaitan telah menjadikan mereka mudah (berbuat dosa) dan memanjangkan angan-angan mereka.",
                            "verse 47:26": "Yang demikian itu karena sesungguhnya mereka (orang-orang munafik) itu berkata kepada orang-orang yang benci kepada apa yang diturunkan Allah (orang-orang Yahudi): \"Kami akan mematuhi kamu dalam beberapa urusan\", sedang Allah mengetahui rahasia mereka.",
                            "verse 47:27": "Bagaimanakah (keadaan mereka) apabila malaikat (maut) mencabut nyawa mereka seraya memukul muka mereka dan punggung mereka?",
                            "verse 47:28": "Yang demikian itu adalah karena sesungguhnya mereka mengikuti apa yang menimbulkan kemurkaan Allah dan (karena) mereka membenci (apa yang menimbulkan) keridhaan-Nya; sebab itu Allah menghapus (pahala) amal-amal mereka.",
                            "verse 47:29": "Atau apakah orang-orang yang ada penyakit dalam hatinya mengira bahwa Allah tidak akan menampakkan kedengkian mereka?",
                            "verse 47:30": "Dan kalau Kami menghendaki, niscaya Kami tunjukkan mereka kepadamu sehingga kamu benar-benar dapat mengenal mereka dengan tanda-tandanya.",
                            "verse 47:31": "Dan sesungguhnya Kami benar-benar akan menguji kamu agar Kami mengetahui orang-orang yang berjihad dan bersabar di antara kamu; dan agar Kami menyatakan (baik buruknya) hal ihwalmu.",
                            "verse 47:32": "Sesungguhnya orang-orang kafir dan menghalangi (manusia) dari jalan Allah serta memusuhi rasul setelah petunjuk itu jelas bagi mereka, mereka tidak dapat memberi mudharat kepada Allah sedikitpun.",
                            "verse 47:33": "Hai orang-orang yang beriman, ta’atlah kepada Allah dan ta’atlah kepada rasul dan janganlah kamu merusakkan (pahala) amal-amalmu.",
                            "verse 47:34": "Sesungguhnya orang-orang yang kafir dan menghalangi (manusia) dari jalan Allah kemudian mereka mati dalam keadaan kafir, maka sekali-kali Allah tidak akan memberi ampun kepada mereka.",
                            "verse 47:35": "Janganlah kamu lemah dan minta damai padahal kamulah yang di atas dan Allah (pun) beserta kamu dan Dia sekali-kali tidak akan mengurangi (pahala) amal-amalmu.",
                            "verse 47:36": "Sesungguhnya kehidupan dunia hanyalah permainan dan senda gurau.",
                            "verse 47:37": "Jika Dia meminta harta kepadamu lalu mendesak kamu (supaya memberikan semuanya) niscaya kamu akan kikir dan Dia akan menampakkan kedengkianmu.",
                            "verse 47:38": "Ingatlah, kamu ini orang-orang yang diajak untuk menafkahkan (hartamu) pada jalan Allah."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Allah vanificherà le opere dei miscredenti e di quelli che distolgono dalla Sua via .",
                            "verse 47:2": "Rimetterà i peccati e volgerà al bene lo spirito di coloro che credono e compiono il bene e credono in quel che è stato rivelato a Muhammad .",
                            "verse 47:3": "perché i miscredenti seguono il falso, mentre i credenti seguono la verità",
                            "verse 47:4": "dal loro Signore.",
                            "verse 47:5": "Quando [in combattimento] incontrate i miscredenti, colpiteli al collo finché non li abbiate soggiogati, poi legateli strettamente.",
                            "verse 47:6": "li guiderà, migliorerà la loro condizione,",
                            "verse 47:7": "e li introdurrà nel Paradiso di cui li ha resi edotti.",
                            "verse 47:8": "O credenti, se farete trionfare [la causa di] Allah, Egli vi soccorrerà e renderà saldi i vostri passi,",
                            "verse 47:9": "mentre coloro che non credono, saranno perduti: Egli vanificherà le loro opere.",
                            "verse 47:10": "Poiché ebbero ripulsa di quello che Allah ha rivelato, Egli vanificherà le loro opere.",
                            "verse 47:11": "Non hanno viaggiato sulla terra e non hanno visto quale fu la sorte di coloro che li precedettero? Allah li ha annientati.",
                            "verse 47:12": "Ciò in quanto Allah è il Patrono dei credenti, mentre i miscredenti non hanno patrono alcuno.",
                            "verse 47:13": "Quanto a coloro che credono e fanno il bene, Allah li farà entrare nei Giardini dove scorrono i ruscelli.",
                            "verse 47:14": "E quante città distruggemmo, che pure erano più potenti della tua città che ti ha bandito .",
                            "verse 47:15": "Colui che si basa su una prova del suo Signore è forse eguale a colui cui è stata abbellita la sua azione peggiore e che si abbandona alle sue passioni?",
                            "verse 47:16": "",
                            "verse 47:17": "la descrizione del Giardino che è stata promessa ai timorati [di Allah]: ci saranno ruscelli di un'acqua che mai sarà malsana e ruscelli di latte dal gusto inalterabile e ruscelli di un vino delizioso a bersi, e ruscelli di miele purificato.",
                            "verse 47:18": "Fra loro ci sono quelli che fanno finta di ascoltarti, ma, quando sono usciti dalla tua casa, dicono a coloro cui è stata data la scienza: « Che cosa ha detto poc'anzi?».",
                            "verse 47:19": "Quanto invece a coloro che si sono aperti alla guida, Egli accresce la loro guida e ispira loro il timore [di Allah] .",
                            "verse 47:20": "Cos'altro aspettano [i miscredenti], se non che venga improvvisa l'Ora? Già i segni precursori son giunti, ma quando Essa sarà giunta, a che cosa mai servirà loro il ricordarsi [di Allah] ?",
                            "verse 47:21": "Sappi che in verità non c'è dio all'infuori di Allah e implora perdono per la tua colpa e per i credenti e le credenti .",
                            "verse 47:22": "I credenti dicono: «Perché non è stata fatta scendere una sura?».",
                            "verse 47:23": "obbedire e parlare onestamente.",
                            "verse 47:24": "Se volgeste le spalle, potreste spargere corruzione sulla terra e rompere i legami del sangue ?",
                            "verse 47:25": "Essi sono coloro che Allah maledice: li rende sordi e acceca i loro occhi.",
                            "verse 47:26": "Non mediteranno sul Corano? Hanno forse catenacci sui cuori?",
                            "verse 47:27": "Coloro che volgono le spalle dopo che a loro è stata resa evidente la Guida, sono quelli che Satana ha sedotto e illuso.",
                            "verse 47:28": "Perché hanno detto a coloro che hanno ripulsa di quello che Allah ha fatto scendere: « Vi obbediremo in una parte della questione» .",
                            "verse 47:29": "Cosa faranno, quando gli angeli li finiranno colpendo i loro volti e le loro schiene?",
                            "verse 47:30": "Ciò",
                            "verse 47:31": "perché perseguono quello che suscita l'ira di Allah e hanno in odio ciò di cui Egli Si compiace, sicché",
                            "verse 47:32": "renderà vane le opere loro.",
                            "verse 47:33": "Oppure coloro che hanno una malattia nel cuore credono che Allah non saprà far trasparire il loro odio?",
                            "verse 47:34": "Se volessimo, te li mostreremmo - ma già tu li riconosci dai loro tratti - e li riconosceresti dal tono nel parlare.",
                            "verse 47:35": "Certamente vi metteremo alla prova per riconoscere quelli di voi che combattono e resistono e per verificare quello che si dice sul vostro conto .",
                            "verse 47:36": "In verità coloro che non credono e distolgono dalla via di Allah e si sono separati dall'Inviato dopo che è stata loro resa evidente la guida, non sapranno nuocere ad Allah in alcunché ed Egli vanificherà il loro agire.",
                            "verse 47:37": "O credenti! Obbedite ad Allah e obbedite al Messaggero e non vanificate le opere vostre.",
                            "verse 47:38": "In verità Allah non perdonerà mai coloro che non credono, distolgono dalla Via di Allah e muoiono nella miscredenza.",
                            "verse 47:39": "Non siate dunque deboli e non proponete l'armistizio mentre siete preponderanti.",
                            "verse 47:40": "La vita terrena non è altro che gioco e distrazione.",
                            "verse 47:41": "Se ve li chiedesse con insistenza, vi mostrereste avari e fareste trasparire il vostro odio.",
                            "verse 47:42": "Ecco, siete invitati ad essere generosi per la causa di Allah, ma qualcuno di voi è avaro."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "信仰しない者，また（人びとを）アッラーの道から妨げる者には，その行いを迷わせられる。",
                            "verse 47:2": "信仰して善行に勤しむ者，またムハンマドに下されたものを主からの真理として信仰する者には，かれはその罪障を消滅し情況を改善なされる。",
                            "verse 47:3": "それも，信仰しない者が虚偽に従い，信仰する者が主からの真理に従うためである。このようにアッラーは，人びとのために比喩により（教えを）説かれる。",
                            "verse 47:4": "あなたがたが不信心な者と（戦場で）見える時は，（かれらの）首を打ち切れ。かれらの多くを殺すまで（戦い），（捕虜には）縄をしっかりかけなさい。その後は戦いが終るまで情けを施して放すか，または身代金を取るなりせよ。もしアッラーが御望みなら，きっと（御自分で）かれらに報復されよう。だがかれは，あなたがたを互いに試みるために（戦いを命じられる）。凡そアッラーの道のために戦死した者には，決してその行いを虚しいものになされない。",
                            "verse 47:5": "かれは，かれらを導きその情況を改善なされ，",
                            "verse 47:6": "かねて告げられていた楽園に，かれらを入らせられる。",
                            "verse 47:7": "信仰する者よ，あなたがたがアッラーに助力すれば，かれはあなたがたを助けられ，その足場を堅固にされる。",
                            "verse 47:8": "また信仰なき者には滅亡（があるだけ）で，その行いを迷わせられる。",
                            "verse 47:9": "それというのも，かれらがアッラーが下されたものを嫌ったためで，かれはその行いを無効になされる。",
                            "verse 47:10": "あなたがたは地上を歴遊して，かれら以前の無信仰な者たちの最後がどうであったかを見なかったのか。アッラーはかれらを全滅なされた。不信者（の運命）もこれと同じ（運命）である。",
                            "verse 47:11": "それはアッラーが，信仰する者の守護者であられ，不信心者には守護者がないためである。",
                            "verse 47:12": "本当にアッラーは信じて善行に動しむ者を，川が下を流れる楽園に入らせられる。そして信仰しない者には，（現世の生活を）楽しませ，家畜が食うように大食させて，業火をかれらの住まいとする。",
                            "verse 47:13": "われはあなたを追放した町（マッカ）よりももっと強い多くの都市を滅ぼしたが，かれらには援助者もなかった。",
                            "verse 47:14": "それで主からの明証の上にいる者と，自分の悪行を立派なものと考え，私欲に従う者とが同じであろうか。",
                            "verse 47:15": "主を畏れる者に約束されている楽園を描いてみよう。そこには腐ることのない水を湛える川，味の変ることのない乳の川，飲む者に快い（美）酒の川，純良な蜜の川がある。またそこでは，凡ての種類の果実と，主からの御赦しを賜わる。（このような者たちと）業火の中に永遠に住み，煮えたぎる湯を飲まされて，腸が寸断する者と同じであろうか。",
                            "verse 47:16": "かれらの中には，あなたに耳を傾ける者もある。あなたの前を出て行くと，知識を授かっている者たちに向かって，「かれが今言ったことは，一体何ですか。」と訊ねる。これらの者は，アッラーに心を封じられた者で，自分の私欲に従う者である。",
                            "verse 47:17": "しかし導かれている者たちには，（一層の）導きと敬度の念を授けられる。",
                            "verse 47:18": "かれら(にせ信者）は，その時（最後の審判）を待つほかはない。それは突然かれらに下る。その兆候はすでに下っている。それ（時）が来たとき，かれらは警告をどう役立てるのか。",
                            "verse 47:19": "だから知れ。アッラーの外に神はないことを。そしてあなたの罪過に対し御赦しを請え。また信仰する男たち，信仰する女たちのためにも御赦しを請え。本当にアッラーは，あなたがたの働き振りも，休み方も（凡て）知っておられる。",
                            "verse 47:20": "信仰する者たちは，「どうして1章〔スーラ〕が下って来ないのか。」と言う。ところが断固たるl章が下され，その中で戦闘のことが述べられると，心に病の宿る者たちは，今にも死に臨むような弱々しい瞼であなたを見よう。災あれ（かれらは死んだ方がいい。）",
                            "verse 47:21": "服従することと，公正に言うこと（の方が大事である）。事（戦闘）が，決定された時は，アッラーに忠誠であることがかれらのために善い。",
                            "verse 47:22": "あなたがたが，もし御命令に背き去ったりして，地上に退廃を（打？）し，また血縁の断絶となるようなことを期待するのか。",
                            "verse 47:23": "これらの人々は，アッラーが見限った者で，聾唖（者）にされ，その目も盲目になされる。",
                            "verse 47:24": "かれらはクルアーンを熟読玩味しないのか。それとも心に鍵をかけたのか。",
                            "verse 47:25": "本当に導きが明らかにされた後それから背き去る者は，悪魔に唆され，誤った願望の虜となる。",
                            "verse 47:26": "それはかれらが，アッラーの下されるものを嫌う者に向かって，「わたしたちは場合によっては，あなたがたに従いましょう。」と言ったためである。だがアッラーはかれらの秘密を知っておられる。",
                            "verse 47:27": "天使たちが，かれらを召しよせ（死んでしまうこと）かれらの顔や背を打ったならどうであろうか。",
                            "verse 47:28": "それというのもかれらがアッラーの御怒りになることばかりを行い，かれの御喜びになられることを嫌ったため，かれがかれらの行いを虚しくしたのである。",
                            "verse 47:29": "それとも心に病を宿す者は，自分たちの（密な）悪意をアッラーが明るみに出されないとでも考えるのか。",
                            "verse 47:30": "もしわれが欲するなら，かれら（偽信者）をあなたに指し示し，その特徴によって識別出来，また（かれらは）言葉の調子によっても分る。本当にアッラーはあなたがたの行うことを知っておられる。",
                            "verse 47:31": "われはあなたがたの中，努力し，耐え忍ぶ者たちを区別するためにあなたがたを試みる。またあなたがたの言行をも確める。",
                            "verse 47:32": "本当に信仰しない者，そして（人びとを）アッラーの道から妨げ，また導きが明らかにされた後使徒に反抗する者たちがいるが，少しもアッラーを損うことは出来ない。かれは，かれらの行いを虚しくなされる。",
                            "verse 47:33": "あなたがた信仰する者よ，アッラーに従い，また使徒に従え。あなたがたの行いを，虚しくさせてはならない。",
                            "verse 47:34": "本当に信仰しないで，アッラーの道から（人びとを）妨げ，不信者として死ぬ者を，アッラーは決して御赦しにはなられない。",
                            "verse 47:35": "だから落胆してはならない。和平を唱えてはならない。あなたがたは勝利を得るのである。アッラーは，あなたがたと共におられる。決してあなたがたの行いを失敗させない。",
                            "verse 47:36": "この世の生活は，（一時の）遊びや戯れに過ぎない。あなたがたが信仰して自分の義務を果すならば，かれはあなたがたに報奨を与える。あなたがたは財産（の放棄）を求められているのではない。",
                            "verse 47:37": "もしかれがそれをあなたがたに求められ，強要されるならば，あなたがたは借しくなり，かれはあなたがたの恨み心を暴露されよう。",
                            "verse 47:38": "見よ，あなたがたは，アッラーの道のために（所有するものの一部の）施しを求められるのである。それなのにあなたがたの中には，貪欲な者がいる。だが貪欲な者は，只自分の魂を損うだけである。アッラーは自足されているが，あなたがたは貧しい。もしもあなたがたが背き去るならば，かれはあなたがた以外の民を代りに立てられよう。それらはあなたがたと同様ではないであろう。 もしかれがそれをあなたがたに求められ，強要されるならば，あなたがたは借しくなり，かれはあなたがたの恨み心を暴露されよう。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "하나님을 불신하고 하나님의길을 방해하는 자 하나님께서는 그들의 행위를 방황케 하시니라",
                            "verse 47:2": "그러나 믿음으로 선을 행하며주님으로부터 무함마드에게 계시 된 진리를 믿는 자 하나님은 그 들의 과오를 거두어 주시며 그들 의 위치를 높여 주시노라",
                            "verse 47:3": "그것은 불신자들이 거짓을 따름에 반해 믿는 자들은 주님께 서 내려주신 진리를 따르기 때문 이라 이렇듯 하나님은 비유로써 인간에게 교훈을 주시노라",
                            "verse 47:4": "너희가 전쟁에서 불신자를 만났을 때 그들의 목들을 때리라 너희가 완전히 그들을 제압했을 때 그들을 포로로 취하고 그후 은혜로써 석방을 하던지 아니면 전쟁이 종식될 때까지 그들을 보 상금으로 속죄하여 주라 그렇게 하라 너희에게 명령이 있었노라 하나님께서 원하셨다면 그들에게 응벌을 내렸을 것이라 그러나 그 분은 너희로 하여금 성전하도록 하였으니 이로 하여 너희를 다른 자들에 비유하여 시험코자 하심이라 그러나 하나님의 길에서 살해 된 자 있다면 그분은 그의 행위가결코 손실되지 않게 하실 것이라",
                            "verse 47:5": "하나님은 그들을 인도하사 그들의 위치를 높여주시고",
                            "verse 47:6": "그들에게 알려준 천국으로 그들을 들게 하노라",
                            "verse 47:7": "믿는 백성들이여 너희가 하나님의 목적을 도울 때 그분께서도 너희를 도와 너희의 발을 견고하 게 하여 주시노라",
                            "verse 47:8": "그러나 하나님을 거역한 그들에게는 멸망뿐으로 하나님은 그들의 행위를 방황케 하시니라",
                            "verse 47:9": "그것은 그들이 하나님께서 계시한 것을 혐오한 것으로 인하여 그분께서 그들의 행위를 무익하게했을 뿐이라",
                            "verse 47:10": "그들은 지상을 여행하면서 그들 이전 백성들의 말로가 어떠 했는가를 보지 못하느뇨 하나님은 그들을 멸망케 하셨으니 하나님을 거역한 불신자들도 그와 같이 되 니라",
                            "verse 47:11": "이는 하나님께서 믿는 자들 을 위한 보호자이시고 불신자들에 게는 보호자가 없기 때문이라",
                            "verse 47:12": "실로 하나님은 믿음으로 의 로움을 실천하는 자들에게는 강이 흐르는 천국으로 들게 하시나 하 나님을 거역하고 현세에 탐닉하며 가축처럼 음식을 먹는 그들의 거 주지는 불지옥이 될 뿐이라",
                            "verse 47:13": "그대를 추방한 그 도시의 백성들보다 더 큰 힘을 가졌던 도 시의 백성들도 그들의 죄악으로 하나님이 얼마나 많이 멸망케 했 더뇨 그러나 그들을 도울 자 아무 도 없었노라",
                            "verse 47:14": "주님의 길위에 있는자가 사 악한 행위에 유혹되어 그의 욕망 을 따르는 자와 같을 수 있느뇨",
                            "verse 47:15": "의로운 자들에게 약속된 천 국을 비유하사 그곳에 강물이 있 으되 변하지 아니하고 우유가 흐 르는 강이 있으되 맛이 변하지 아니하며 술이 흐르는 강이 있으 니 마시는 이들에게 기쁨을 주며 꿀이 흐르는 강이 있으되 순수하 고 깨끗하더라 그곳에는 온갖 과 일이 있으며 주님의 자비가 있노 라 이렇게 사는 자들이 지옥에 살 며 끓는 물을 마셔 그들의 내장이 산산조각이 되는 그들과 같을 수 있느뇨",
                            "verse 47:16": "그들 중에는 그대에게 귀를 기울인 자 있으나 그들이 밖으로 나가서는 그가 방금 말했던 것이 무엇이뇨 라고 지식을 부여받은 자들에게 말하더라 그들은 그들 의 욕망을 따르는 자들로 하나님 께서 그들의 마음을 봉하여 버린 자들이라",
                            "verse 47:17": "그러나 인도를 받은 자 하나님께서 그에게 인도함을 더하여 주실 것이며 사악으로부터 그들을 더욱 보호하여 주실 것이라",
                            "verse 47:18": "그들은 갑자기 닥쳐올 그 시각만을 기다리고 있느뇨 이미 그 들에게 몇 예증이 있었노라 그것 이 그들 위에 닥쳐을 때 그들은 어디로부터 교훈을 얻을 것이뇨",
                            "verse 47:19": "그러므로 하나님 외에 신이 없음을 알라 그리고 그대의 잘못 과 맏는 남성과 믿는 여성의 과오 를 위해 용서를 구하라 하나님은 너희의 행위와 너희가 거주할 곳 을 알고 계시니라",
                            "verse 47:20": "믿는 자들은 말하니 왜 우 리에게 말씀이 계시되지 않느뇨 그러나 말씀이 계시되고 그 안에 성전하라 언급되니 마음이 병들어죽음에 이르는 자가 쳐다보는 것 처럼 그대를 바라보는 자들을 그 대가 보리니 그들에게 재앙이 있 을 것이라",
                            "verse 47:21": "순종하며 아름다운 언행이 그들에게 좋으니라 그러나 성전이결정되면 하나님께 충실하는 것이가장 좋은 것이라",
                            "verse 47:22": "너희가 권력의 자리에 앉게 되면 지상에 해악을 퍼뜨리며 혈 연관계를 단절하려 하느뇨",
                            "verse 47:23": "그러한 자들을 하나님께서 저주하사 그들의 귀는 들리지 않 게 하고 그들의 눈은 장님으로 만드시노라",
                            "verse 47:24": "그들은 꾸란을 이해하려 추 구하지 아니 하느뇨 아니면 그들 의 마음이 닫혀있단 말이뇨",
                            "verse 47:25": "복음이 그들에게 밝혀진 후 에도 외면하는 자 있나니 사탄이 그들을 유혹하여 거짓 희망으로 기만했을 뿐이라",
                            "verse 47:26": "이것은 그들이 하나님께서 계시한 것을 증오한 그들에게 우리가 이 일의 일부분에 있어 너희에게 복종하리요 라고 말한 것 때문이라 그러나 하나님은 그들의비밀들을 알고 계시노라",
                            "verse 47:27": "그러나 천사들이 그들의 생 명을 앗아가며 그들의 얼굴과 뒤 를 채찍질 할 때 그들은 어떻게 되겠느뇨",
                            "verse 47:28": "그것은 그들이 하나님을 노 하게 하는 것을 따르며 그분의 기쁨에 역행되는 갓들 때문으로 그분은 그들의 행위들이 헛되도록하시노라",
                            "verse 47:29": "아니면 마음이 병든 그들이 하나님께서 그들의 증오들을 밝 히지 아니 하리라 생각하느뇨",
                            "verse 47:30": "하나님이 원하였다면 그분은그대로 하여금 그들의 표적으로 인하여 그들을 알게 되었으리라 그러나 그대는 그들의 언행으로부터 그들을 곧 알게 되리라 하나님은 너희가 행하는 모든 것을 알고계시니라",
                            "verse 47:31": "하나님은 너희 스스로 성전 하며 인내하는 너희를 시험할 것 이며 또한 행위들로 시험하실 것 이라",
                            "verse 47:32": "하나님을 거역하고 하나님 의 길에 있는 자들을 방해하며 복음이 그들에게 밝혀진 후에도 선지자에게 거역하는 자들 있나니이들이 하나님을 욕되게 할 수 없노라 그분께서 그들의 행위를 헛 되이 하실 것이라",
                            "verse 47:33": "믿는 사람들이여 하나님께 순종하고 선지자에게 순종하라 그리고 너희들의 행위를 헛되게 하 지 말라",
                            "verse 47:34": "하나님을 거역하고 하나님의길에 있는 자들을 방해하며 불신 자로 세상을 떠나는 그들에게 하 나님은 결코 관용을 베풀지 아니 하시니라",
                            "verse 47:35": "약한 자가 되어 휴전을 촉구하지 말라 너희가 위에 있노라 하나님이 너희와 함께 하시어 너 희의 일들이 헛되게 두지 아니 하시니라",
                            "verse 47:36": "현세의 삶은 유희에 불과한 것이라 너희가 믿음으로 의로운자 된다면 그분께서는 너희에게보상을 주실 것이요 너희가 소유 하고 있는 것을 요구하지 않으시 니라",
                            "verse 47:37": "하나님이 그것을 요구하여 너희에게 강요하는 것은 너희를 인색하게 하여 증오감을 이르게 할 뿐이라",
                            "verse 47:38": "하나님의 사업을 위해 재물을 쓰라고 하셨지만 너희 가운데 는 인색해 하는 자 있나니 인색해하는 자는 그의 영혼에 거역하여 인색해 하는 것이라 그러나 하나 넘은 풍요로우시니 너희가 가난한자들로 하나님을 필요로 하고 있 노라 그래도 너희가 외면한다면 그분은 너희의 거주지에 너희 같 이 아니한 다른 백성으로 너희를 대체하시니라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "ئه‌وانه‌ی بێ بڕوا بوون و به‌رهه‌ڵستی ڕێبازی خوایان کرد، ئه‌وانه‌خوا کاروکرده‌وه‌کانیانی ون و پووچ کردۆته‌وه‌، (ته‌نانه‌ت چاکه‌کانیشیان بێ پاداشته‌، چونکه‌مه‌به‌ستیان خوا نه‌بووه‌).",
                            "verse 47:2": "ئه‌وانه‌ش باوه‌ڕیان هێناوه و کارو کرده‌وه‌چاکه‌کانیان ئه‌نجام داوه‌و باوه‌ڕیان هێناوه به‌و قورئانه‌بوو که‌بۆ محمد (صلى الله عليه وسلم) دابه‌زێنراوه‌، هه‌ر ئه‌ویش ڕاسته‌و له‌لایه‌ن په‌روه‌ردیگاره‌وه‌، ئه‌وانه‌خوا چاوپۆشی کردووه‌له‌هه‌موو گوناهه‌کانیان، چاکه‌شی ڕواندووه‌له‌دڵ و ده‌روونیانداو بۆچوونیانی ڕێک و پێک کردووه‌.",
                            "verse 47:3": "ئه‌وه‌ش به‌هۆی ئه‌وه‌وه‌یه چونکه‌به‌ڕاستی ئه‌وانه‌ی که‌بێ باوه‌ڕ بوون شوێنی ناڕاستی که‌وتبوون.",
                            "verse 47:4": "(ئه‌م فه‌رمانه‌بۆ کاتی ڕووبه‌ڕوو بوونه‌وه‌یه‌ک له‌گۆره‌پانی جه‌نگدا) جا کاتێک گه‌یشتن به‌وانه‌ی بێ باوه‌ڕ بوون، بێنه ده‌ست لێیان و له‌گه‌ردنیان بده‌ن (ئه‌گینا ئه‌وان ئێوه ده‌کوژن)، تا کاتێک کوشتاری زۆریان لێ ده‌که‌ن، ئینجا که‌هێزیان نه‌ما، به‌دیل بیانگرن به‌توندی باڵبه‌ستیان بکه‌ن، ئه‌وسا یه‌کێک له‌م دوو کاره‌یان له‌گه‌ڵدا ئه‌نجام بده‌ن: یان به‌پیاوه‌تی و منه‌ت، یاخود به‌گۆڕینه‌وه‌و فیدیه ئازادیان بکه‌ن، تا شه‌ر کۆتایی دێت و ئاسه‌واری نامێنێت و دوژمنان چه‌ک داده‌نێن، بڕیاره‌که ئاوهایه‌، ئه‌گه‌ر خوا بیویستایه خۆی تۆڵه‌ی لێ ده‌سه‌ندن، به‌ڵام ده‌یه‌وێت به‌یه‌کتر تاقیان بکاته‌وه‌، ئه‌وانه‌ش له‌پێناوی خوادا شه‌هید بوون، هه‌رگیز پاداشتی هه‌وڵ و کۆششیان به‌زایه نادات.",
                            "verse 47:5": "ئه‌وانه‌رێنموویی ده‌کات بۆ جێگه و ڕێگه‌ی خۆش و دڵ و ده‌رون و بیرو هۆشیان ئاسووده‌ده‌کات.",
                            "verse 47:6": "هه‌روه‌ها ده‌یانخاته ئه‌و به‌هه‌شته‌وه که‌به‌جۆره‌ها شێواز بۆی باس کردوون.",
                            "verse 47:7": "ئه‌ی ئه‌و که‌سانه‌ی ئیمان و باوه‌ڕتان هێناوه‌، ئه‌گه‌ر ئێوه پشتیوانی له ئاینی خوا بکه‌ن و هه‌وڵی سه‌رکه‌وتنی بده‌ن، ئه‌وه‌خوایش پشتیوانی له‌ئێوه ده‌کات و سه‌رتان ده‌خات و پایه‌دارو جێگیرتان ده‌کات.",
                            "verse 47:8": "ئه‌وانه‌ش بێ بڕوا بوون خه‌جاڵه‌تی و سه‌رشۆریان بۆ هه‌یه کاروکرده‌وه‌شیان له‌دنیادا بێ ئاکامه‌و له‌قیامه‌تیشدا مایه پووچن.",
                            "verse 47:9": "ئائه‌وه‌به‌هۆی ئه‌وه‌وه‌یه بێگومان ئه‌وان ڕقیان له‌قورئان بۆته‌وه و حه‌زیان له‌به‌رنامه‌ی خوا نه‌بووه‌، جا خوایش کارو کرده‌وه‌کانی پووچ کردنه‌وه‌.",
                            "verse 47:10": "ئایا ئه‌وه‌نه‌گه‌ڕاون به‌سه‌ر زه‌ویداو سه‌رنج بده‌ن، تا بزانن سه‌ره‌نجامی ئه‌و خه‌ڵکه ناله‌باره‌ی پێش ئه‌مان چۆن بووه‌؟! خوای به‌ده‌سه‌ڵات ماڵ و حاڵیانی به‌سه‌ردا ڕووخاندن، جا بۆ هه‌موو بێ باوه‌ڕان سزای ئاوا شتێکی چاوه‌ڕوان کراوه (دره‌نگ یان زوو) دووچاریان ده‌بێت.",
                            "verse 47:11": "ئه‌وه‌به‌هۆی ئه‌وه‌وه‌یه چونکه‌به‌ڕاستی خوا پشتگیرو پشتیوانی ئه‌وانه‌یه که‌ئیمان و باوه‌ڕیان هێناوه‌، بێگومان بێ باوه‌ڕانیش هیچ پشتیوانێکیان نیه.",
                            "verse 47:12": "به‌ڕاستی ئه‌وانه‌ی که‌باوه‌ڕیان هێناوه وکارو کرده‌وه‌چاکه‌کانیان ئه‌نجام داوه‌، خوا ده‌یانخاته باخه‌کانی به‌هه‌شته‌وه‌، که‌چه‌نده‌ها ڕوبار به‌ناویدا ده‌ڕوات، ئه‌وانه‌ش بێ بڕوا بوون له‌م دنیایه‌دا ڕاده‌بوێرن و ده‌خۆن وه‌ک ئاژه‌ڵ، له‌ئاینه‌که‌شدا دۆزه‌خ جێ و شوێنیانه!",
                            "verse 47:13": "زۆر شارو شارۆچکه‌مان له‌ناو برد، له‌و شاره‌ی که‌تۆیان ده‌رکرد به‌هێزتر بوون، هیچ که‌سیش نه‌یتوانی پشتیوانیان بێت.",
                            "verse 47:14": "ئایا ئه‌و که‌سه‌ی که‌له‌لایه‌ن په‌روه‌ردگاریه‌وه به‌ڵگه‌و نیشانه‌ی ڕوونی پێگه‌یشتووه و، باوه‌ڕی دامه‌زراوی پێیه‌تی و له‌سه‌ری ده‌ڕوات، وه‌کو ئه‌و که‌سه‌وایه که‌کاروکرده‌وه‌ی ناشرین و نادروستی له‌به‌ر چاو ڕازێنرابێته‌وه‌، ئه‌و جۆره که‌سانه‌شوێنی ویست و ئاره‌زووی ناپوختی خۆیان که‌وتوون؟!",
                            "verse 47:15": "وێنه‌ی ئه‌و به‌هه‌شته‌ی که‌به‌ڵێن دراوه‌بدرێت به‌خواناس و پارێزکاران، ئه‌مه‌یه‌: چه‌نده‌ها ڕووباری له‌ئاوی سازگارو تام و نه‌گۆڕاوی تێدایه‌، هه‌روه‌ها چه‌نده‌ها ڕووباری شیر که‌تامی تێک نه‌چووه‌، هه‌روه‌ها چه‌نده‌ها ڕوبار له‌شه‌رابی تام خۆش و بۆنخۆش، (که‌له‌خواردنه‌وه‌ی بێزار نابن و له‌به‌ر چاویان ناکه‌وێت) بۆ ئه‌وانه‌ی ده‌یخۆنه‌وه‌، چه‌نده‌ها ڕوبار له‌هه‌نگوینی پاڵفته‌و بێگه‌رد، هه‌روه‌ها بۆیان هه‌یه له‌و به‌هه‌شته‌دا له‌هه‌موو جۆره به‌رو و بووم و میوه‌یه‌کی جوان و به‌تام و بۆنخۆش، هاوکات له‌گه‌ڵ لێخۆشبوون و خۆشه‌ویستی په‌روه‌ردگاریاندا، ئایا ئه‌و به‌خته‌وه‌رانه‌وه‌کو ئه‌و که‌سانه‌وان که‌له‌ناو ئاگری دۆزه‌خدا نه‌مرن و ئاوی له‌کوڵ ده‌کرێت به‌گه‌روویاندا، که‌ریخۆڵه‌کانیان پارچه‌پارچه‌و تۆی تۆی ده‌کات؟!",
                            "verse 47:16": "ئه‌ی محمد (صلى الله عليه وسلم) هه‌ندێک له‌و بێ باوه‌ڕو دووڕوانه دێن وگوێت بۆ ده‌گرن، هه‌تا کاتێک له‌قسه‌و گوفتارت بوویته‌وه‌، جێت ده‌هێڵن و به‌دوودڵیه‌وه ده‌پرسن له‌ئیمانداران: ئه‌وه‌باسی چی ده‌کرد؟ ئه‌وه‌له‌چی ده‌دوا؟ تا ئه‌وانه‌خوا مۆری ناوه‌به‌سه‌ر دڵیاندا و شوێنی ئاره‌زوو ویستی نه‌گونجاوی خۆیان که‌وتوون.",
                            "verse 47:17": "ئه‌وانه‌ش ڕێبازی هیدایه‌ت و ئیماندارییان گرتۆته به‌ر به‌گوفتاری پێغه‌مبه‌ر (صلى الله عليه وسلم) هیدایه‌ت و دیندارییان گه‌شه‌ده‌کات و په‌ره‌ده‌سێنێت، خوایش شاره‌زایی و پارێزگاریی و دڵنیایی زیاتری پێبه‌خشین.",
                            "verse 47:18": "ئایا ئه‌وانه‌چاوه‌ڕێی چی ده‌که‌ن جگه‌له‌قیامه‌ت که‌له‌ناکاو یه‌خه‌یان پێ بگرێت؟ چونکه‌به‌ڕاستی هه‌ندێک له‌نیشانه‌کانی ده‌رکه‌وتووه (که‌یه‌کێک له‌وانه‌ره‌وانه‌کردنی دواهه‌مین پێغه‌مبه‌ره‌)، جا ئه‌وکاته‌که‌به‌رپا بێت بیرکردنه‌وه و ئامۆژگارییان چ سوودێکی ده‌بێت؟!",
                            "verse 47:19": "ئه‌ی ئینسان!! ده‌ی که‌واتا چاک بزانه‌و دڵنیابه جگه‌له‌خوا، هیچ خوایه‌کی ترنیه‌، داوای لێخۆشبوونی گوناه بۆ خۆت و ئیمانداران له‌پیاوان و ئافره‌تان هه‌ر له‌و بکه‌و دڵنیابه که‌خوا ده‌زانێت له‌رۆژدا به‌چی یه‌وه خه‌ریکن و، له‌شه‌ویشدا له‌کۆی ده‌حه‌وێنه‌وه و ئارام ده‌گرن، یاخود ده‌زانێت چی ده‌که‌ن له‌دونیاداو، ده‌ره‌نجامه‌که‌شی له‌قیامه‌تدا چۆنه.",
                            "verse 47:20": "هه‌ندێک له‌ئیمانداران ده‌ڵێن: خۆزگه سووره‌تێک (جه‌نگ دژی کافران ده‌هاته‌خواره‌وه‌)، که‌چی کاتێک که‌سووره‌تێک به‌روونی داده‌به‌زێت و باسی جه‌نگی تێدایه‌، ئه‌وه‌ده‌بینیت ئه‌وانه‌ی له‌دڵیاندا نه‌خۆشی باوه‌ڕ لاوازی ودووڕوویی هه‌یه‌، چاویان ئه‌بڵه‌ق ده‌بێت، سه‌یرت ده‌که‌ن وه‌کو که‌سێک له‌سه‌ره‌مه‌رگدا بێ هۆشی به‌سه‌ردا هاتبێت، جا باشتر وابوو.",
                            "verse 47:21": "که گوێڕایه‌ڵ بوونایه و قسه‌ی جوان و به‌جێیان بکردایه‌، جا کاتێک کار گه‌یشته قایمی و جه‌نگ به‌رپابوو ئه‌گه‌ر له‌گه‌ڵ خوادا ڕاست بوونایه‌، ئه‌وه‌چاکتر بوو بۆیان.",
                            "verse 47:22": "ئایا ئێوه به‌ته‌مان ئه‌گه‌ر له‌غه‌زا پشت هه‌ڵبکه‌ن یاخود ده‌سه‌ڵاتتان که‌وته‌ده‌ست، تۆوی ئاژاوه‌و فه‌ساد و تاوان له‌زه‌ودا بچێنن و هه‌رچی په‌یوه‌ندی خزمایه‌تیش هه‌یه بیپچڕێنن و له‌ناوی به‌رن؟!",
                            "verse 47:23": "ئه‌و جۆره که‌سانه‌ئه‌وانه‌ن که‌خوا نه‌فرینی لێ کردوون و که‌ڕی کردوون کوێرایی هێناوه به‌سه‌ر چاویاندا (ڕاستیه‌کان نابینن)",
                            "verse 47:24": "ئایا ئه‌وه‌بۆچی ئه‌وانه‌وردبینی له‌قورئاندا ناکه‌ن و گوێی بۆ ناگرن؟! یان ئه‌وه‌یه دڵه‌کان له‌ئاستی ڕاستیدا قفڵ دراوه‌؟!",
                            "verse 47:25": "به‌ڕاستی ئه‌وانه‌ی پاشگه‌ز بوونه‌وه‌و به‌ره‌ودوا گه‌ڕانه‌وه‌، دوای ئه‌وه‌ی ڕێگه‌ی هیدایه‌ت و ئیمانیان بۆ ده‌رکه‌وتبوو، ئه‌وانه شه‌یتان به‌فێڵ و ته‌ڵه‌که ته‌ماداری کرد بوون، به‌هیوای ته‌مه‌ن درێژی و خۆشگوزه‌رانیش فریوی ده‌بوون.",
                            "verse 47:26": "ئه‌و زاڵ بوونی شه‌یتانه به‌هۆی ئه‌وه‌وه‌بوو که‌به‌ڕاستی دووڕووه‌کان ده‌یانوت به‌وانه‌ی که‌داخ له‌دڵ بوون به‌رامبه‌ر ئه‌وه‌ی خوا دایبه‌زاندووه که‌قورئانه‌: ئێمه له‌مه‌ودوا له‌هه‌ندێک هه‌ڵوێستدا به‌قسه‌تان ده‌که‌ین، خوایش خۆی چاک ئاگاداره‌له‌و نهێنی و پیلانانه‌ی که‌ده‌یشارنه‌وه.",
                            "verse 47:27": "ئاخۆ حاڵیان چۆن بێت که‌فریشته‌کان له‌کاتی گیان کێشانیاندا به‌ده‌م و چاوو به‌ره‌و پشتیاندا ده‌ماڵن.",
                            "verse 47:28": "ئه‌و سووکایه‌تی سه‌ره‌مه‌رگه‌بۆیه به‌سه‌ریاندا دێت، چونکه‌ئه‌وانه‌شوێنی ئه‌و شتانه‌که‌وتبوون که‌قین و خه‌شمی خوا ده‌بزوێنێت، ئه‌وانه‌بێزار بوون له‌ره‌زامه‌ندی خوا، خوایش کاروکرده‌وه‌یانی پووچ و بێ ئاکام کرد.",
                            "verse 47:29": "ئایا ئه‌وانه‌ی که‌دڵیان نه‌خۆشی دووڕویی تیادایه‌، وایانزانیووه خوا هه‌رگیز کینه و بوغزی ده‌روونیان ئاشرا ناکات؟!",
                            "verse 47:30": "خۆ ئه‌گه‌ر بمانویستایه ئه‌وانه‌مان پیشان ده‌دات، ئه‌وکاته‌به‌رواڵه‌ت ده‌تناسینه‌وه‌، سوێند به‌خوا له‌شێواز و ناوه‌رۆکی قسه‌و گوفتاریاندا ده‌یانناسیته‌وه‌، خوا خۆیشی ئاگا و زانایه به‌کارده‌وه‌کانتان.",
                            "verse 47:31": "سوێند به‌خوا ئێمه ده‌تانخه‌ینه به‌ر تاقیکردنه‌وه‌، تا له‌جیهانی واقعدا تێکۆشه‌ر و خۆگرانتان ده‌ربکه‌وێت و ئاشکرا ببێت بۆمان، بۆ ئه‌وه‌ش هه‌واڵی چالاکی ئێوه‌مان بێته ده‌ست.",
                            "verse 47:32": "به‌ڕاستی ئه‌وانه‌ی که‌بێ باوه‌ڕن و ڕێگه له‌بڵاوکردنه‌وه‌ی په‌یامی خوا ده‌گرن دژایه‌تی ڕێبازی پێغه‌مبه‌ر (صلى الله عليه وسلم) ده‌که‌ن، دوای ئه‌وه‌ی ڕێبازی هیدایه‌ت و ڕاستیان بۆ ڕوون بۆته‌وه‌، ئا ئه‌وانه‌هه‌رگیز ناتوانن زیان به‌خواو ئاینی خوا بگه‌یه‌نن.",
                            "verse 47:33": "ئه‌ی ئه‌و که‌سانه‌ی ئیمان و باوه‌ڕتان هێناوه! گوێڕایه‌ڵی فه‌رمانی خواو فه‌رمانی پێغه‌مبه‌ر بن، کاروکرده‌وه‌چاکه‌کانتان پووچ و بێ نرخ مه‌که‌ن، (به ڕووپامایی و خۆ به‌زل زانین و په‌شیمان بونه‌وه‌له‌خێر ومنه‌ت کردن و.",
                            "verse 47:34": "به‌ڕاستی ئه‌وانه‌ی که‌بێ باوه‌ڕ بوون و به‌ربه‌ست و کۆسپیان ده‌خسته‌به‌رده‌م ڕێبازی خوا، پاشان مردن له‌کاتێکدا که‌کافر بوون، ئه‌وه‌هه‌رگیز خوا لێیان خۆش نابێت و چاوپۆشیان لێ ناکات.",
                            "verse 47:35": "ئێوه سستی مه‌که‌ن و داوای ئاشتی پێش وه‌خت له‌دوژمنان مه‌که‌ن، چونکه‌هه‌ر ئێوه سه‌رکه‌وتوو ده‌بن، دڵنیا بن که‌خوایش له‌گه‌ڵتانه‌، کاروکرده‌وه‌تان به‌زایه نادات و لێی که‌م ناکاته‌وه‌.",
                            "verse 47:36": "به‌ڕاستی ژیانی دنیا ته‌نها بریتیه له‌یاری و گه‌مه‌یه‌کی ته‌مه‌ن کۆتا، جا ئه‌گه‌ر باوه‌ڕ بهێنن و پارێزکاربن، ئه‌وه‌خوا به‌چاکی پاداشتان ده‌داته‌وه‌، خوایش وه‌نه‌بێت داوای به‌خشینی هه‌موو سامانتان لێ بکات.",
                            "verse 47:37": "خۆ ئه‌گه‌ر داوای به‌خشینی هه‌موو سامانتان لێ بکات و ئه‌رکێکی گران بخاته‌سه‌رتان، ئه‌وه‌ره‌زیل و به‌رچاو ته‌نگ ده‌بن، هه‌موو كینه و بوغزیشتان ده‌رده‌هێنێت.",
                            "verse 47:38": "ئا ئه‌وه‌ته‌ئێوه بانگ ده‌کرێن تا به‌خشینتان هه‌بێت له‌پێناوی خوادا، که‌چی هه‌تانه‌ره‌زیل و به‌رچاو ته‌نگه‌، خۆ ئه‌وه‌ی ڕه‌زیل و به‌رچاو ته‌نگی هه‌بێت، ئه‌وه‌بێگومان هه‌ر ڕه‌زیلی له‌خۆی ده‌کات و زه‌ره‌ر له‌خۆی ده‌دات، چونکه‌هه‌ر خوا خۆی ده‌وڵه‌مه‌ندو بێ نیازه‌، هه‌ر ئێوه‌ن هه‌ژارو نه‌دارو که‌مده‌ستن."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Orang-orang yang kafir serta menghalangi (dirinya dan orang lain) dari jalan Allah, Allah sia-siakan segala amal mereka.",
                            "verse 47:2": "Dan (sebaliknya) orang-orang yang beriman dan mengerjakan amal yang soleh serta beriman kepada Al-Quran yang diturunkan kepada Nabi Muhammad s.",
                            "verse 47:3": "Berlakunya yang demikian, kerana sesungguhnya orang-orang yang kafir menurut perkara yang salah dan sesungguhnya orang-orang yang beriman menurut perkara yang benar dari Tuhan mereka.",
                            "verse 47:4": "Dengan yang demikian, apabila kamu berjuang menentang orang-orang kafir (dalam peperangan jihad) maka pancunglah lehernya, sehingga apabila kamu dapat membunuh mereka dengan banyaknya (serta mengalahkannya) maka tawanlah (mana-mana yang hidup) dan ikatlah mereka dengan kukuhnya.",
                            "verse 47:5": "Allah akan memimpin mereka yang berjuang (ke jalan mendapat sebaik-baik balasan) dan menjadikan keadaan mereka baik dan berguna (di dunia dan di akhirat)",
                            "verse 47:6": "Serta memasukkan mereka ke dalam Syurga yang telah dijanjikan dan diterangkan sifat-sifatnya kepada mereka.",
                            "verse 47:7": "Wahai orang-orang yang beriman, kalau kamu membela (agama) Allah nescaya Allah membela kamu (untuk mencapai kemenangan) dan meneguhkan tapak pendirian kamu.",
                            "verse 47:8": "Dan (sebaliknya) orang-orang yang kafir, maka kecelakaanlah bagi mereka dan (Allah) mensia-siakan amal-amal mereka.",
                            "verse 47:9": "Berlakunya yang demikian, kerana sesungguhnya mereka tidak menyukai apa yang diturunkan oleh Allah (mengenai ajaran tauhid dan hukum-hukum syarak yang diterangkan di dalam Al-Quran), lalu Allah menggugurkan amal-amal mereka.",
                            "verse 47:10": "Maka tidakkah mereka telah mengembara di muka bumi, serta mereka memerhatikan bagaimana akibat orang-orang kafir yang terdahulu dari mereka? Allah telah menghancurkan orang-orang itu dan orang-orang kafir (yang menurut jejak mereka) akan beroleh akibat-akibat buruk yang seperti itu.",
                            "verse 47:11": "Balasan yang demikian, kerana sesungguhnya Allah menjadi Pelindung orang-orang yang beriman dan sesungguhnya orang-orang yang kafir: Tiada sesiapapun yang dapat memberikan perlindungan kepada mereka.",
                            "verse 47:12": "Sesungguhnya Allah akan memasukkan orang-orang yang beriman serta mengerjakan amal-amal yang soleh ke dalam Syurga yang mengalir di bawahnya beberapa sungai; dan (sebaliknya) orang-orang yang kafir menikmati kesenangan di dunia serta mereka makan minum sebagaimana binatang-binatang ternak makan minum, sedang Nerakalah menjadi tempat tinggal mereka.",
                            "verse 47:13": "Dan bukan sedikit (penduduk) negeri-negeri yang lebih kuat dari (penduduk) negerimu (wahai Muhammad) yang telah memaksamu keluar (berhijrah) Kami binasakan mereka, maka tiadalah sesiapa pun yang dapat membela mereka.",
                            "verse 47:14": "Dengan yang demikian, adakah orang-orang (yang beriman dan taat) yang keadaannya sentiasa berdasarkan bukti yang nyata dari Tuhannya: Sama seperti orang-orang (yang ingkar derhaka) yang telah diperhiaskan kepadanya (oleh Syaitan) akan kejahatan amalnya (sehingga dipandangnya baik) dan yang telah menurut hawa nafsunya? (Sudah tentu tidak sama)!",
                            "verse 47:15": "Sifat Syurga yang telah dijanjikan kepada orang-orang yang bertakwa (ialah seperti berikut): Ada padanya beberapa sungai dari air yang tidak berubah (rasa dan baunya) dan beberapa sungai dari susu yang tidak berubah rasanya, serta beberapa sungai dari arak yang lazat bagi orang-orang yang meminumnya dan juga beberapa sungai dari madu yang suci bersih dan ada pula untuk mereka di sana segala jenis buah-buahan, serta keredaan dari Tuhan mereka.",
                            "verse 47:16": "Dan di antara mereka (yang hadir di majlismu wahai Muhammad, ialah orang-orang munafik) yang mendengar ajaranmu (dengan sambil lewa), sehingga apabila mereka keluar dari sisimu berkatalah mereka (secara mengejek-ejek) kepada orang-orang yang diberi ilmu (dari kalangan sahabat-sahabatmu yang setia): Apa yang dikatakan oleh Muhammad tadi? Mereka (yang munafik) itu ialah orang-orang yang telah dimeteraikan Allah atas hati mereka dan ialah orang-orang yang menurut hawa nafsunya.",
                            "verse 47:17": "Dan (sebaliknya) orang-orang yang menerima petunjuk (ke jalan yang benar), Allah menambahi mereka dengan hidayat petunjuk, serta memberi kepada mereka (dorongan) untuk mereka bertakwa.",
                            "verse 47:18": "(Kiranya golongan yang ingkar masih tidak mahu menerima peringatan yang diberi kepadanya) maka tidak ada lagi yang mereka tunggu melainkan saat kiamat yang akan datang kepada mereka secara mengejut, kerana sesungguhnya telah lahirlah tanda-tanda kedatangannya.",
                            "verse 47:19": "Oleh itu, maka tetapkanlah pengetahuanmu dan keyakinanmu (wahai Muhammad) bahawa sesungguhnya tiada Tuhan yang berhak disembah melainkan Allah dan mintalah ampun kepadaNya bagi salah silap yang engkau lakukan dan bagi dosa-dosa orang-orang yang beriman lelaki dan perempuan dan (ingatlah), Allah mengetahui akan keadaan gerak-geri kamu (di dunia) dan keadaan penetapan kamu (di akhirat).",
                            "verse 47:20": "Dan (kerana gemarkan pahala berjuang menegakkan Islam) orang-orang yang beriman berkata: Alangkah baiknya sekiranya diturunkan satu surah (dari Al-Quran, yang memerintahkan kami berjuang)? Maka apabila diturunkan satu surah (dari Al-Quran) yang tegas keterangannya dan tersebut padanya hukum-hukum yang mewajibkan perang Jihad (menentang pencerobohan musuh), sudah tentu engkau akan melihat orang-orang yang ada penyakit (kufur) dalam hatinya memandang kepadamu dengan terbeliak matanya kerana gerun takut menghadapi mati; dengan yang demikian, maka kebinasaanlah lebih hampir kepada mereka.",
                            "verse 47:21": "(Mereka selalu berkata: Pendirian kami) mematuhi perintah dan memperkatakan perkataan yang baik (yang diredhai Allah).",
                            "verse 47:22": "(Kalau kamu tidak mematuhi perintah) maka tidakkah kamu harus dibimbang dan dikhuatirkan jika kamu dapat memegang kuasa kamu akan melakukan kerosakan di muka bumi dan memutuskan hubungan silaturrahim dengan kaum kerabat?",
                            "verse 47:23": "(Orang-orang yang melakukan perkara yang tersebut) merekalah yang dilaknat oleh Allah serta ditulikan pendengaran mereka dan dibutakan penglihatannya",
                            "verse 47:24": "(Setelah diterangkan yang demikian) maka adakah mereka sengaja tidak berusaha memahami serta memikirkan isi Al-Quran? Atau telah ada di atas hati mereka kunci penutup (yang menghalangnya daripada menerima ajaran Al-Quran)?",
                            "verse 47:25": "Sesungguhnya orang-orang yang telah berbalik kepada keingkaran mereka sesudah terang nyata kepada mereka kebenaran petunjuk (yang dikemukakan kepadanya), Syaitanlah yang memperdayakan mereka (berlaku demikian), serta memanjangkan angan-angan mereka.",
                            "verse 47:26": "Berlakunya yang demikian ialah kerana mereka berkata kepada orang-orang yang tidak menyukai perkara yang diturunkan oleh Allah: Kami akan patuh kepada kamu pada setengah perkara (yang berhubung dengan menentang Muhammad dan pengikutnya) itu; sedang Allah mengetahui segala (perkataan dan perbuatan) yang mereka sembunyikan.",
                            "verse 47:27": "(Kalaulah mereka terlepas sekarang dari bencana kejahatan mereka) maka bagaimanakah (mereka dapat menolak azab seksa) apabila malaikat mengambil nyawa mereka sambil memukul muka dan punggung mereka?",
                            "verse 47:28": "(Kematian mereka dalam keadaan yang buruk) itu, kerana mereka menurut (serta melakukan) perkara-perkara yang menyebabkan kemurkaan Allah dan mereka pula membenci perkara-perkara yang diredhaiNya; oleh itu, Allah gugurkan amal-amal mereka (yang baik, yang pernah mereka lakukan).",
                            "verse 47:29": "Patutkah orang-orang (munafik) yang ada penyakit (syak, ragu-ragu) dalam hatinya menyangka bahawa Allah tidak sekali-kali akan mendedahkan perasaan dendam dan hasad dengki mereka (terhadap Nabi Muhammad s.",
                            "verse 47:30": "Dan sekiranya Kami kehendaki, tentulah Kami akan memperkenalkan mereka kepadamu (wahai Muhammad), lalu engkau tetap mengenalinya dengan tanda-tanda (yang menjadi sifat) mereka dan demi sesungguhnya, engkau akan mengenali mereka dari gaya dan tutur katanya dan (ingatlah kamu masing-masing), Allah mengetahui segala yang kamu lakukan.",
                            "verse 47:31": "Dan demi sesungguhnya! Kami tetap menguji kamu (wahai orang-orang yang mengaku beriman) sehingga ternyata pengetahuan Kami tentang adanya orang-orang yang berjuang dari kalangan kamu dan orang-orang yang sabar (dalam menjalankan perintah Kami) dan (sehingga) Kami dapat mengesahkan (benar atau tidaknya) berita-berita tentang keadaan kamu.",
                            "verse 47:32": "Sesungguhnya orang-orang yang kafir dan menghalangi (dirinya dan orang lain) dari jalan Allah, serta mereka memusuhi Rasul Allah setelah ternyata kepada mereka kebenaran petunjuk (yang dibawanya), mereka tidak sekali-kali akan dapat mendatangkan mudarat kepada Allah sedikitpun dan (sebaliknya) Allah akan menghampakan perbuatan dan amal-amal mereka.",
                            "verse 47:33": "Wahai orang-orang yang beriman! Taatlah kamu kepada Allah dan taatlah kepada Rasul Allah dan janganlah kamu batalkan amal-amal kamu!",
                            "verse 47:34": "Sesungguhnya orang-orang yang kafir dan menghalangi (dirinya dan orang lain) dari jalan Allah, kemudian mereka mati dengan keadaan kafirnya, maka Allah tidak sekali-kali akan mengampunkan mereka.",
                            "verse 47:35": "(Apabila kamu telah mengetahui bahawa orang-orang kafir itu dihampakan amalnya dan diseksa oleh Allah) maka janganlah kamu (wahai orang-orang yang beriman) merasa lemah dan mengajak (musuh yang menceroboh) untuk berdamai, padahal kamulah orang-orang yang tertinggi keadaannya, lagi pula Allah bersama-sama kamu (untuk membela kamu mencapai kemenangan) dan Dia tidak sekali-kali akan mengurangi (pahala) amal-amal kamu.",
                            "verse 47:36": "(Ingatlah) bahawa kehidupan dunia (yang tidak berdasarkan iman dan takwa) hanyalah ibarat permainan dan hiburan dan jika kamu beriman serta bertakwa, Allah akan memberikan kamu pahala amal kamu dan Dia tidak meminta kepada kamu harta benda kamu (melainkan untuk memberikan kamu barang yang lebih baik daripadanya).",
                            "verse 47:37": "(Tabiat kamu wahai manusia) jika Tuhan meminta kepada kamu harta benda kamu serta mendesak kamu memberikanNya, nescaya kamu akan berlaku bakhil kedekut, dan kebakhilan itu akan melahirkan kemarahan dan kebencian kamu.",
                            "verse 47:38": "(Ingatlah), kamu ini adalah orang-orang yang bertabiat demikian kamu diseru supaya menderma dan membelanjakan sedikit dari harta benda kamu pada jalan Allah, maka ada di antara kamu yang berlaku bakhil, padahal sesiapa yang berlaku bakhil maka sesungguhnya dia hanyalah berlaku bakhil kepada dirinya sendiri dan (ingatlah) Allah Maha kaya (tidak berhajat kepada sesuatupun), sedang kamu semua orang-orang miskin (yang sentiasa berhajat kepadaNya dalam segala hal) dan jika kamu berpaling (daripada beriman, bertakwa dan berderma) Dia akan menggantikan kamu dengan kaum yang lain; setelah itu mereka tidak akan berkeadaan seperti kamu."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "كسانى كه كافر شدند و (مردم را) از راه خدا بازداشتند، (خداوند) اعمالشان را نابود مى‏كند!",
                            "verse 47:2": "و كسانى كه ايمان آوردند و كارهاى شايسته انجام دادند و به آنچه بر محمد (ص) نازل شده -و همه حق است و از سوى پروردگارشان- نيز ايمان آوردند، خداوند گناهانشان را مى‏بخشد و كارشان را اصلاح مى‏كند!",
                            "verse 47:3": "اين بخاطر آن است كه كافران از باطل پيروى كردند، و مؤمنان از حقى كه از سوى پروردگارشان بود تبعيت نمودند; اين‏گونه خداوند براى مردم مثلهاى (زندگى) آنان را بيان مى‏كند!",
                            "verse 47:4": "و هنگامى كه با كافران (جنايت‏پيشه) در ميدان جنگ روبه‏رو شديد گردنهايشان را بزنيد، (و اين كار را همچنان ادامه دهيد) تا به اندازه كافى دشمن را در هم بكوبيد; در اين هنگام اسيران را محكم ببنديد; سپس يا بر آنان منت گذاريد (و آزادشان كنيد) يا در برابر آزادى از آنان فديه ( غرامت) بگيريد; (و اين وضع بايد همچنان ادامه يابد) تا جنگ بار سنگين خود را بر زمين نهد، (آرى) برنامه اين است! و اگر خدا مى‏خواست خودش آنها را مجازات مى‏كرد، اما مى‏خواهد بعضى از شما را با بعضى ديگر بيازمايد; و كسانى كه در راه خدا كشته شدند، خداوند هرگز اعمالشان را از بين نمى‏برد!",
                            "verse 47:5": "بزودى آنان را هدايت نموده و كارشان را اصلاح مى‏كند;",
                            "verse 47:6": "و آنها را در بهشت (جاويدانش) كه اوصاف آن را براى آنان بازگو كرده وارد مى‏كند",
                            "verse 47:7": "اى كسانى كه ايمان آورده‏ايد! اگر (آيين) خدا را يارى كنيد، شما را يارى مى‏كند و گامهايتان را استوار مى‏دارد",
                            "verse 47:8": "و كسانى كه كافر شدند، مرگ بر آنان! و اعمالشان نابود باد!",
                            "verse 47:9": "اين بخاطر آن است كه از آنچه خداوند نازل كرده كراهت داشتند; از اين رو خدا اعمالشان را حبط و نابود كرد!",
                            "verse 47:10": "آيا در زمين سير نكردند تا ببينند عاقبت كسانى كه قبل از آنان بودند چگونه بود؟! خداوند آنها را هلاك كرد; و براى كافران امثال اين مجازاتها خواهد بود!",
                            "verse 47:11": "اين براى آن است كه خداوند مولا و سرپرست كسانى است كه ايمان آوردند; اما كافران مولايى ندارند!",
                            "verse 47:12": "خداوند كسانى را كه ايمان آوردند و اعمال صالح انجام دادند وارد باغهايى از بهشت مى‏كند كه نهرها از زير (درختانش) جارى است; در حالى كه كافران از متاع زودگذر دنيا بهره مى‏گيرند و همچون چهارپايان مى‏خورند، و سرانجام آتش دوزخ جايگاه آنهاست!",
                            "verse 47:13": "« و چه بسيار شهرهايى كه از شهرى كه تو را بيرون كرد نيرومندتر بودند; ما همه آنها را نابود كرديم و هيچ ياورى نداشتند!",
                            "verse 47:14": "آيا كسى كه دليل روشنى از سوى پروردگارش دارد، همانند كسى است كه زشتى اعمالش در نظرش آراسته شده و از هواى نفسشان پيروى مى‏كنند؟!",
                            "verse 47:15": "توصيف بهشتى كه به پرهيزگاران وعده داده شده، چنين است: در آن نهرهايى از آب صاف و خالص كه بدبو نشده، و نهرهايى از شير كه طعم آن دگرگون نگشته، و نهرهايى از شراب (طهور) كه مايه لذت نوشندگان است، و نهرهايى از عسل مصفاست، و براى آنها در آن از همه انواع ميوه‏ها وجود دارد; و (از همه بالاتر) آمرزشى است از سوى پروردگارشان! آيا اينها همانند كسانى هستند كه هميشه در آتش دوزخند و از آب جوشان نوشانده مى‏شوند كه اندرونشان را از هم متلاشى مى‏كند؟!",
                            "verse 47:16": "گروهى از آنان به سخنانت گوش فرامى‏دهند، اما هنگامى كه از نزد تو خارج مى‏شوند به كسانى كه علم و دانش به آنان بخشيده شده (از روى استهزا) مى‏گويند: «(اين مرد) الان چه گفت؟!» آنها كسانى هستند كه خداوند بر دلهايشان مهر نهاده و از هواى نفسشان پيروى كرده‏اند (از اين رو چيزى نمى‏فهمند)!",
                            "verse 47:17": "كسانى كه ه18",
                            "verse 47:18": "آيا آنها ( كافران) جز اين انتظارى دارند كه قيامت ناگهان فرا رسد (آنگاه ايمان آورند)، در حالى كه هم‏اكنون نشانه‏هاى آن آمده است; اما هنگامى كه بيايد، تذكر (و ايمان) آنها سودى نخواهد داشت!",
                            "verse 47:19": "پس بدان كه معبودى جز «الله‏» نيست; و براى گناه خود و مردان و زنان باايمان استغفار كن! و خداوند محل حركت و قرارگاه شما را مى‏داند!",
                            "verse 47:20": "كسانى كه ايمان آورده‏اند مى‏گويند: «چرا سوره‏اى نازل نمى‏شود (كه در آن فرمان جهاد باشد)؟ !» اما هنگامى كه سوره واضح و روشنى نازل مى‏گردد كه در آن سخنى از جنگ است، منافقان بيماردل را مى‏بينى كه همچون كسى كه در آستانه مرگ قرار گرفته به تو نگاه مى‏كنند; پس مرگ و نابودى براى آنان سزاوارتر است!",
                            "verse 47:21": "(ولى) اطاعت و سخن سنجيده براى آنان بهتر است; و اگر هنگامى كه فرمان جهاد قطعى مى‏شود به خدا راست گويند (و از در صدق و صفا درآيند) براى آنها بهتر مى‏باشد!",
                            "verse 47:22": "اگر (از اين دستورها) روى گردان شويد، جز اين انتظار مى‏رود كه در زمين فساد و قطع پيوند خويشاوندى كنيد؟!",
                            "verse 47:23": "آنها كسانى هستند كه خداوند از رحمت خويش دورشان ساخته، گوشهايشان را كر و چشمهايشان را كور كرده است!",
                            "verse 47:24": "آيا آنها در تدبر نمى‏كنند، يا بر دلهايشان قفل نهاده شده است؟!",
                            "verse 47:25": "كسانى كه بعد از روشن شدن هدايت براى آنها، پشت به حق كردند، شيطان اعمال زشتشان را در نظرشان زينت داده و آنان را با آرزوهاى طولانى فريفته است!",
                            "verse 47:26": "اين بخاطر آن است كه آنان به كسانى كه نزول وحى الهى را كراهت داشتند گفتند: «ما در بعضى از امور از شما پيروى مى‏كنيم؟» در حالى كه خداوند پنهانكارى آنان را مى‏داند",
                            "verse 47:27": "حال آنها چگونه خواهد بود هنگامى كه فرشتگان (مرگ) بر صورت و پشت آنان مى‏زنند و جانشان را مى‏گيرند؟!",
                            "verse 47:28": "اين بخاطر آن است كه آنها از آنچه خداوند را به خشم مى‏آورد پيروى كردند، و آنچه را موجب خشنودى اوست كراهت داشتند; از اين رو (خداوند) اعمالشان را نابود كرد!",
                            "verse 47:29": "آيا كسانى كه در دلهايشان بيمارى است گمان كردند خدا كينه‏هايشان را آشكار نمى‏كند؟!",
                            "verse 47:30": "و اگر ما بخواهيم آنها را به تو نشان مى‏دهيم تا آنان را با قيافه‏هايشان بشناسى، هر چند مى‏توانى آنها را از طرز سخنانشان بشناسى; و خداوند اعمال شمارا مى‏داند!",
                            "verse 47:31": "ما همه شما را قطعا مى‏آزمائيم تا معلوم شود مجاهدان واقعى و صابران از ميان شما كيانند، و اخبار شما را بيازماييم!",
                            "verse 47:32": "آنان كه كافر شدند و (مردم را) از راه خدا بازداشتند و بعد از روشن‏شدن هدايت براى آنان (باز) به مخالفت با رسول (خدا) برخاستند، هرگز زيانى به خدا نمى‏رسانند و (خداوند) بزودى اعمالشان را نابود مى‏كند!",
                            "verse 47:33": "اى كسانى كه ايمان آورده‏ايد! اطاعت كنيد خدا را، و اطاعت كنيد رسول (خدا) را، و اعمال خود را باطل نسازيد!",
                            "verse 47:34": "كسانى كه كافر شدند و (مردم را) از راه خدا بازداشتند سپس در حال كفر از دنيا رفتند، خدا هرگز آنها را نخواهد بخشيد",
                            "verse 47:35": "پس هرگز سست نشويد و (دشمنان را) به صلح (ذلت‏بار) دعوت نكنيد در حالى كه شما برتريد، و خداوند با شماست و چيزى از (ثواب) اعمالتان را كم نمى‏كند!",
                            "verse 47:36": "زندگى دنيا تنها بازى و سرگرمى است; و اگر ايمان آوريد و تقوا پيشه كنيد، پاداشهاى شما را مى‏دهد و اموال شما را نمى‏طلبد،",
                            "verse 47:37": "چرا كه هر گاه اموال شما را مطالبه كند و حتى اصرار نمايد، بخل مى‏ورزيد; و كينه و خشم شما را آشكار مى‏سازد!",
                            "verse 47:38": "آرى، شما همان گروهى هستيد كه براى انفاق در راه خدا دعوت مى‏شويد، بعضى از شما بخل مى‏ورزند; و هر كس بخل ورزد، نسبت به خود بخل كرده است; و خداوند بى‏نياز است و شما همه نيازمنديد; و هرگاه سرپيچى كنيد، خداوند گروه ديگرى را جاى شما مى‏آورد پس آنها مانند شما نخواهند بود (و سخاوتمندانه در راه خدا انفاق مى‏كنند)"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Quanto aos incrédulos, que desencaminham os demais da senda de Deus, Ele desvanecerá as suas ações.",
                            "verse 47:2": "Outrossim, quanto aos fiéis, que praticam o bem e crêem no que foi revelado a Mohammad - esta é a verdade do seu Senhor - Deus absolverá as suas faltas e lhes melhorará as condições.",
                            "verse 47:3": "(Isso não ocorrerá com os incrédulos) porque os incrédulos seguem a falsidade, enquanto os fiéis seguem a verdade do seu Senhor.",
                            "verse 47:4": "E quando vos enfrentardes com os incrédulos, (em batalha), golpeai-lhes os pescoços, até que os tenhais dominado, e tomai (os sobreviventes) como prisioneiros.",
                            "verse 47:5": "Iluminá-los-á e melhorará as suas condições,",
                            "verse 47:6": "E os introduzirá no Paraíso, que lhes tem sido anunciado.",
                            "verse 47:7": "Ó fiéis, se socorrerdes á Deus, Ele vos socorrerá e firmará os vosso passos.",
                            "verse 47:8": "Enquanto que os incrédulos.",
                            "verse 47:9": "Isso, por terem recusado o que Deus revelou; então, Ele tornará as suas obras sem efeito.",
                            "verse 47:10": "Porventura, não percorreram a terra, para ver qual foi a sorte dos seus antecessores? Deus os exterminou! Semelhante sorte haverá para os incrédulos.",
                            "verse 47:11": "(Tal não ocorrerá aos fiéis) porque Deus é o protetor dos fiéis, e os incrédulos jamais terão protetor algum.",
                            "verse 47:12": "Em verdade, Deus introduzirá os fiéis, que praticam o bem, em jardins, abaixo dos quais correm os rios; quanto aos incrédulos, que comem como come o gado, o fogolhes servirá de morada.",
                            "verse 47:13": "E quantas cidades, mais poderosas do que a tua, que te expulsou, destruímos, sem que ninguém tivesse pedido socorrê-las!",
                            "verse 47:14": "Porventura, aqueles que observam a evidência do seu Senhor poderão ser equiparados àqueles cujas ações foram abrilhantadas e que se entregaram às suas luxúrias?",
                            "verse 47:15": "Eis aqui uma descrição do Paraíso, que foi prometido aos tementes: Lá há rios de água impoluível; rios de leite de sabor inalterável; rios de vinho deleitante para os que o bebem; e rios de mel purificado; ali terão toda a classe de frutos, com a indulgência do seu Senhor.",
                            "verse 47:16": "E entre eles, há os que te escutam e, ao se retirarem da tua assembléia, dizem,",
                            "verse 47:17": "àqueles, que foram agraciados com a sabedoria: Que é que foi dito agora? Tais são os",
                            "verse 47:18": "que têm os seus corações sigilados por Deus, porque se entregam às suas luxúrias!",
                            "verse 47:19": "Por outra, quanto àqueles que os orientam, Ele lhes aumenta a orientação e lhes concede piedade.",
                            "verse 47:20": "Porventura, aguardam algo, a não ser a Hora, que os açoutará subitamente? Já lhes chegaram os indícios.",
                            "verse 47:21": "Sabe, portanto, que não há mais divindade, além de Deus e implora o perdão das tuas faltas, assim como das dos fiéis e das fiéis, porque Deus conhece as vossas atividades e os vossos destinos.",
                            "verse 47:22": "Os fiéis dizem: Por que não nos foi revelada uma surata? Porém, quando é revelada uma surata peremptória, em que se menciona o combate, tu vês os que abrigam a morbidez em seus corações, que te olham com olhares de quem está na agonia da morte.",
                            "verse 47:23": "Obedecer e falar o que é justo.",
                            "verse 47:24": "É possível que causeis corrupção na terra e que rompais os vínculos consangüíneos, quando assumirdes o comando.",
                            "verse 47:25": "Tais são aqueles que Deus amaldiçoou, ensurdecendo-os e cegando-lhes as vistas.",
                            "verse 47:26": "Não meditam, acaso, no Alcorão, ou que seus corações são insensíveis?",
                            "verse 47:27": "Certamente, aqueles que renunciaram à fé, depois de lhes haver sido evidenciada a orientação, foram seduzidos e lhes foi dada esperança pelo demônio.",
                            "verse 47:28": "Isso, porque disseram àqueles que recusaram o que Deus revelou: Obedecer-vos-emos em certas coisas! Porém, Deus conhece os seus segredos.",
                            "verse 47:29": "Assim, o que farão, quando os anjos se apossarem das suas almas e lhes golpearem os rostos e os dorsos?",
                            "verse 47:30": "Isso, porque se entregaram ao que indigna Deus, e recusaram ao que Lhe agradava; por isso, Ele tornou sem efeito as suas obras.",
                            "verse 47:31": "Pensam, acaso, aqueles que abrigam a morbidez em seus corações, que Deus não descobrirá os seus rancores?",
                            "verse 47:32": "E, se quiséssemos, tê-los-íamos mostrado, mas tu os conhecerás por suas fisionomias.",
                            "verse 47:33": "Sabei que vos provaremos, para certificar-Nos de quem são os combatentes e perseverantes, dentre vós, e para provarmos a vossa reputação.",
                            "verse 47:34": "Em verdade, os incrédulos, que desencaminham os demais da senda de Deus e contrariam o Mensageiro, depois de lhes ser evidenciada a orientação, em nada prejudicarão Deus, que tomará as suas obras sem efeito.",
                            "verse 47:35": "Ó fiéis, obedecei a Deus e ao Mensageiro, e não desmereçais as vossas ações.",
                            "verse 47:36": "Em verdade, quanto aos incrédulos, que desencaminham os demais da senda de Deus e morrem na incredulidade, Deus jamais os perdoará.",
                            "verse 47:37": "Não fraquejeis (ó fiéis), pedindo a paz, quando sois superiores; sabei que Deus está convosco e jamais defraudará as vossas ações.",
                            "verse 47:38": "A vida terrena é tão-somente jogo e diversão.",
                            "verse 47:39": "Porque, se vo-lo pedisse ou vo-lo exigisse, escatimá-los-íeis então, revelando assim os vossos rancores.",
                            "verse 47:40": "Eis, então, que sois convidados a contribuir na causa de Deus."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 47:1": "Acelora care nu cred și opresc de la calea lui Allah, El le va zãdãr nici faptele lor,",
                            "verse 47:2": "Iar acelora care cred și sãvârșesc fapte bune și cred în ceea ce i-a fost trimis lui Muhammed - și acesta este Adevãrul de la Domnul lor! -, El le va șterge faptele lor cele rele și va îndrepta starea lor.",
                            "verse 47:3": "Aceasta pentru cã aceia care nu cred urmeazã deșertãciunea șipentru cã aceia care cred urmeazã Adevãrul",
                            "verse 47:4": "de la Domnul lor.",
                            "verse 47:5": "Atunci când îi întâlniți [în luptã] pe aceia care nu cred, loviți gâturilelor, iar când îi slãbiți pe ei, legați-i strașnic în lanțuri! Apoi, fie îndurare, fie rãscumpãrare, pân&at",
                            "verse 47:6": "El îi va cãlãuzi și va îndrepta starea lor",
                            "verse 47:7": "Și îi va face pe ei sã intre în Raiul pe care El li l-a fãcut cunoscut .",
                            "verse 47:8": "O, voi cei care credeți! Dacã voi veți face sã triumfe cauza luiAllah, vã va sprijini și El pe voi și va întãri picioarele voastre .",
                            "verse 47:9": "Iar aceia care nu cred vor avea parte de nenorocire și Allah va lãsa faptele lor sã fie în deșert.",
                            "verse 47:10": "Aceasta fiindcã ei au pizmuit ceea ce a pogorât Allah și, de aceea, El a zãdãr nicit faptele lor.",
                            "verse 47:11": "Oare nu au purces ei prin lume pentru ca sã vadã cum a fost sfârșitul celor de dinainte de ei? Allah i-a nimicit .",
                            "verse 47:12": "vor avea cei care nu cred .",
                            "verse 47:13": "Aceasta pentru cã Allah este Ocrotitorul celor care cred și pentru cã aceia, care nu cred, nu au nici un ocrotitor.",
                            "verse 47:14": "Allah îi duce pe aceia care cred și sãvârșesc fapte bune în grãdinipe sub care curg pâraie, în vreme ce aceia care nu cred se vorbucura [în aceastã lume] și vor mânca așa cum m&atild",
                            "verse 47:15": "Și câte cetãți mai puternice decât cetatea ta , care te-a alungat, am fãcut Noi sã piarã, fãrã sã aibã ei nici un ajutor!",
                            "verse 47:16": "Oare acela care se ține de o dovadã limpede",
                            "verse 47:17": "de la Domnul sãu este ca acela cãruia i s-a înfrumusețat fapta sa rea și a urmat poftelor lor?",
                            "verse 47:18": "Iatã descrierea Raiului care le-a fost fãgãduit celor cu fricã de Allah: în el sunt râuri cu apã care nu este stricatã și râuri cu lapte al cãrui gust nu se stricã și râuri de v",
                            "verse 47:19": "Și printre ei sunt unii care ascultã la tine, însã numai ce ies dela tine și le zic ei acelora cãrora li s-a dãruit cunoașterea : “Ce aspus el adineauri?” Aceștia sunt cei cãrora",
                            "verse 47:20": "Acelora care se aflã pe calea cea bunã, El le sporește cãlãuzireași le dãruiește lor evlavie.",
                            "verse 47:21": "Și oare așteaptã ei altceva decât Ceasul, sã vinã asupra lor pe neașteptate? Semnele lui au și venit! Și cum sã mai fie prevenirea lor, când va veni asupra lor?",
                            "verse 47:22": "Deci sã știi cã nu existã altã divinitate afarã de Allah și cere iertare pentru pãcatele tale și pentru dreptcredincioși și dreptcredincioase! Allah cunoaște umbletul vostru",
                            "verse 47:23": "Aceia care cred zic: “De-ar fi trimisã o Surã !” Dar când este revelatã o surã limpede, în care este pomenitã lupta , îi vezi pe cei care au o boalã în inimile lor privind spre tine cu privirea aceluiacare este",
                            "verse 47:24": "Ascultarea și vorba cuviincioasã.",
                            "verse 47:25": "Și dacã vã întoarceți voi , nu s-ar putea sã semãnați voi stricãciune pe pãmânt și sã rupeți legãturile voastre de rudenie?",
                            "verse 47:26": "Aceștia sunt cei pe care i-a blestemat Allah și i-a fãcut pe ei surzi și le-a orbit vederile lor.",
                            "verse 47:27": "Oare ei nu cugetã la Coran sau peste inimile lor sunt lacãte?",
                            "verse 47:28": "Pe aceia care întorc spatele , dupã ce drumul cel drept li s-a arãtat cu limpezime, îi ispitește Șeitan și-i înșealã .",
                            "verse 47:29": "Aceasta pentru cã ei le zic acelora care pizmuiesc ceea ce trimite Allah: “Noi voim sã dãm ascultare la o parte a poruncilor voas- tre!” Însã Allah cunoaște ceea ce tãinuiesc ei .",
                            "verse 47:30": "Și cum [va fi] când îi vor lua îngerii și-i vor lovi peste fețele și peste spatele lor?",
                            "verse 47:31": "Aceasta pentru cã ei urmeazã ceea ce Îl mâniazã pe Allah șipizmuiesc ceea ce este mulțumire a Lui și, de aceea, El va facezadarnice faptele lor.",
                            "verse 47:32": "Ori își închipuie aceia care au boalã în inimile lor cã Allah nu va scoate la ivealã ura lor ascunsã?",
                            "verse 47:33": "Dacã am voi Noi, ți i-am arãta ție și tu i-ai recunoaște pe ei dupã semnele lor .",
                            "verse 47:34": "Și vã vom încerca pânã ce îi vom cunoaște pe cei care luptã[pentru cauza lui Allah] dintre voi și pe cei statornici și vom încercaveștile despre voi .",
                            "verse 47:35": "Aceia care nu cred, împiedicã de la calea lui Allah și se împo- trivesc Trimisului, dupã ce li s-a arãtat lor limpede calea cea dreaptã, nu-i vor pricinui lui Allah nimic rãu și El va zãdãr nici",
                            "verse 47:36": "O, voi cei care credeți! Fiți cu ascultare fațã de Allah și fiți cu ascultare fațã de Trimis și nu faceți ca faptele voastre sã fie în deșert!",
                            "verse 47:37": "Pe aceia care nu cred și împiedicã de la calea lui Allah, iar apoi mor fiind necredincioși, Allah nu-i va ierta .",
                            "verse 47:38": "Nu slãbiți și nu chemați la pace , pentru cã voi sunteți dea-supra , cãci Allah este alãturi de voi și nu vã va lãsa niciodatã sãpierdeți rãspl",
                            "verse 47:39": "Iarã viața pãmânteascã este numai joacã și glumã .",
                            "verse 47:40": "Și de vi le-ar cere El și v-ar stânjeni pe voi, ați fi voi zgârciți și El ar scoate la ivealã rãutãțile voastre .",
                            "verse 47:41": "Iatã cã voi sunteți chemați sã cheltuiți pe calea lui Allah ."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 47:1": "Celor care tăgăduiesc şi se îndepărtează de la Calea lui Dumnezeu, El le rătăceşte faptele.",
                            "verse 47:2": "Celor care cred şi săvârşesc fapte bune, celor care cred în ceea ce a fost pogorât asupra lui Muhamad, acesta este Adevărul de la Domnul lor, El le şterge lor faptele rele şi le îndreaptă cugetul.",
                            "verse 47:3": "Aceasta, căci cei care tăgăduiesc urmează deşertăciunea, iar cei care cred urmează Adevărul de la Domnul lor.",
                            "verse 47:4": "Atunci când vă întâlniţi cu tăgăduitorii, loviţi-le grumazurile şi când le-aţi nimicit forţele, legaţi-i cu tărie şi după aceea: fie îndurare, fie răscumpărare, până când războiul îşi lasă jos poverile.",
                            "verse 47:5": "ci El îi călăuzeşte şi le îndreaptă cugetul,",
                            "verse 47:6": "apoi îi va lăsa să intre în Grădina de care le-a dat ştire.",
                            "verse 47:7": "O, voi cei ce credeţi! Dacă voi Îl ajutaţi pe Dumnezeu, El vă va ajuta şi vă va întări picioarele.",
                            "verse 47:8": "Vai celor care tăgăduiesc, căci Dumnezeu le va rătăci faptele,",
                            "verse 47:9": "căci au urât ceea ce Dumnezeu a pogorât.",
                            "verse 47:10": "N-au străbătut pământul? N-au văzut cum a fost sfârşitul celor dinaintea lor pe care Dumnezeu i-a stârpit.",
                            "verse 47:11": "Şi aceasta, căci Dumnezeu este Oblăduitorul celor care cred, iar tăgăduitorii nu au nici un oblăduitor.",
                            "verse 47:12": "Dumnezeu va lăsa să intre pe cei care cred şi săvârşesc fapte bune în Grădinile pe sub care curg râuri.",
                            "verse 47:13": "Câte cetăţi mult mai de temut decât cetatea ta care te-a prigonit n-am nimicit! Şi nimeni nu le-a fost de ajutor!",
                            "verse 47:14": "Oare cel care se sprijină pe o dovadă vădită de la Domnul său este asemenea celui ce i-a fost împodobită răutatea faptei sale ori celor care îşi urmează poftele?",
                            "verse 47:15": "Grădina care a fost făgăduită celor temători este astfel: în ea sunt râuri de apă care nu se strică, râuri de lapte cu gust neschimbător, râuri de vin întru desfătarea celor care-l beau, râuri de miere curată.",
                            "verse 47:16": "Printre ei sunt unii care te ascultă, însă, odată ieşiţi de la tine, spun celor cărora li s-a dat ştiinţa:“Ce-a spus adineauri?” Acestora Dumnezeu le-a pecetluit inimile, iar ei îşi urmează poftele.",
                            "verse 47:17": "Celor călăuziţi însă Dumnezeu le sporeşte călăuzirea şi îi dăruieşte întru teama lor.",
                            "verse 47:18": "Vor sta de veghe ca să nu le vină Ceasul deodată? Semnele Sale au venit deja, însă la ce le va mai sluji Aducerea aminte când le va veni?",
                            "verse 47:19": "Să ştii că nu este dumnezeu afară de Dumnezeu! Cere iertare pentru păcatele tale, precum şi pentru credincioşi şi credincioase! Dumnezeu vă cunoaşte umbletul şi odihna.",
                            "verse 47:20": "Cei care cred spun: “De ce nu ni se pogoară o sură?” Când li se pogoară însă o sură întărită în care li se aminteşte lupta, îi vezi pe cei care au boala în inimă privindu-te de parcă ar fi pe moarte,",
                            "verse 47:21": "cu toate că ascultarea şi un cuvânt cuviincios ar fi mai bune pentru ei.",
                            "verse 47:22": "Puteţi, dacă întoarceţi spatele, să semănaţi stricăciunea pe pământ şi să rupeţi legăturile voastre de sânge?",
                            "verse 47:23": "Aceştia sunt cei pe care Dumnezeu îi blestemă, surzindu-i şi orbindu-le privirile.",
                            "verse 47:24": "Ei nu pricep Coranul ori asupra inimilor au zăvoare?",
                            "verse 47:25": "Cei care s-au întors pe aceleaşi urme după ce călăuzirea le-a fost desluşit arătată au fost amăgiţi de Satan care le-a dat un răgaz.",
                            "verse 47:26": "Şi aceasta, căci ei spun celor care urăsc ceea ce Dumnezeu a pogorât: “Vă vom da ascultare în unele porunci.",
                            "verse 47:27": "Cum va fi când îngerii îi vor lua la ei lovindu-le feţele şi spatele?",
                            "verse 47:28": "Şi aceasta, căci ei îl urmează pe cel care Îl mânie pe Dumnezeu şi pe cel care urăşte ceea ce Lui îi place.",
                            "verse 47:29": "Ori socot cei care au în inimă boală că Dumnezeu nu va scoate la iveală urile lor?",
                            "verse 47:30": "Dacă am voi, ţi i-am arăta: tu îi vei cunoaşte după însemnele lor, tu îi vei cunoaşte după tonul vorbei lor.",
                            "verse 47:31": "Noi vă vom pune la încercare ca să-i cunoaştem pe cei dintre voi ce sunt luptători şi răbdători, după cum vom pune la încercare şi veştile voastre.",
                            "verse 47:32": "Cei care tăgăduiesc şi îi împiedică şi pe alţii de la Calea lui Dumnezeu şi se rup de trimis, după ce călăuzirea le-a fost desluşit arătată, nu-l vor păgubi cu nimic pe Dumnezeu, căci El va zădărnici faptele lor.",
                            "verse 47:33": "O, voi cei ce credeţi! Daţi ascultare lui Dumnezeu! Daţi ascultare trimisului! Nu zădărniciţi faptele voastre!",
                            "verse 47:34": "Celor care tăgăduiesc şi îi împiedică şi pe alţii de la Calea lui Dumnezeu şi apoi mor tăgăduitori, Dumnezeu nu le iartă.",
                            "verse 47:35": "Nu vă înmuiaţi şi nu cereţi pacea când voi sunteţi sus, căci Dumnezeu este cu voi şi El nu vă va amăgi pentru faptele voastre.",
                            "verse 47:36": "Viaţa de Acum este o joacă şi o desfătare.",
                            "verse 47:37": "Dacă vi le-ar cere şi v-ar plictisi, v-aţi zgârci, iar El v-ar scoate la iveală urile voastre.",
                            "verse 47:38": "Voi sunteţi chemaţi să cheltuiţi pe calea lui Dumnezeu."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Кто не уверовал в АллахаИ уклонил с Его пути (других), —Дела таких Он в тще’ту обратит.",
                            "verse 47:2": "А с тех, которые уверовали (в Бога)и добрые дела вершатИ верят в то, что Мухаммадув Откровении дано, —А это — Истина от их Владыки, —Сотрет Господь их прегрешеньяИ добрым сделает их состоянье(деяний, тела и души).",
                            "verse 47:3": "Так будет потому, что нечестивыепошли за ложью,А кто уверовал —Последовал за Истинойот их Владыки, —Так их самих Аллах приводитв притчи людям.",
                            "verse 47:4": "А потому, когда вы встретитесьс неверными в бою,По шеям головы ссекайте2142,Когда же проведете основноеподавленье,(Берите в плен их и) удерживайтекрепко.",
                            "verse 47:5": "Он их направит (в жизнь другую),И добрым сделает их состоянье,",
                            "verse 47:6": "И в Рай введет,Который дал им (в Откровении) узнать.",
                            "verse 47:7": "О вы, кто верует!Коль вы поможете в Господнем (деле),Тогда и Он поможет вамИ укрепит ваши стопы.",
                            "verse 47:8": "А те, кто не уверовал,Пусть гибнут!И обратятся тще’той их дела.",
                            "verse 47:9": "И это им за то,Что невзлюбили откровение Аллаха, —Он сделает бесплодными дела их.",
                            "verse 47:10": "Ужель они не ездят по земле?Не видят то, каков конец был тех,Которые до них (грешили)?Их погубил Аллах, —Подобная же участь ждет неверных.",
                            "verse 47:11": "И это потому, что покровительверных — Бог.",
                            "verse 47:12": "Тех, кто уверовал (в Аллаха) и добрыедела творит,Аллах, поистине, введет в Сады,реками омовенны,А те, которые Его отвергли,Сладятся и едят, как ест (голодный)скот.",
                            "verse 47:13": "И сколько городов Мы погубили,Превосходящих мощью город твой2143,Тебя обрекший на изгнанье, —И не было ни одного защитника у них.",
                            "verse 47:14": "Неужто тот, кто утвердилсяНа ясном (житии) от своего Владыки,Сравни тому, кто обольщенГреховностью своих деяний,И тем, кто следует своим страстям?",
                            "verse 47:15": "Вот образная притча Рая,Который был обещан правоверным2144:В нем — реки из воды, что никогдане испытает порчи,И реки молока, что не меняет вкус,И реки из вина в усладу тем, кто пьет,И реки меда, что очищен.",
                            "verse 47:16": "И среди них есть те, кто слушает тебя.",
                            "verse 47:17": "А в тех, кто правый путь избрал,Бог увеличит правотуИ одарит их благочестьем.",
                            "verse 47:18": "Чего же дожидаться им — неужтотого Часа,Который к ним внезапно подойдет?Ведь признаки его уже, поистине,пришли;И вот когда он их настигнет,К чему им будут увещанья?",
                            "verse 47:19": "Так знай: нет божества, кроме Аллаха!Проси прощенья за свои грехиИ за грехи мужчин и женщин,Которые уверовали (в Бога);Ему известны все движенья ваши(днем)И место вашего покоя (ночью).",
                            "verse 47:20": "И те, которые уверовали (в Бога),говорят:«О, если б Сура снизошла,(Зовущая к сражению за веру)!»Но лишь нисходит Сура ясного(значенья),Где упомянуто сраженье,Ты видишь, как те люди,Сердца которых схвачены недугом2145,Взирают на тебя таким же взором,Как тот, кто в обморок впадаетПри виде приближающейся смерти.",
                            "verse 47:21": "ПовиноватьсяИ речь пристойную вести.",
                            "verse 47:22": "А если будет власть дана вам2146,То может ли (случиться так),Что будете вы нечесть сеять на землеИ разорвете родственные связи?",
                            "verse 47:23": "И это — те, что прокляты Аллахом.",
                            "verse 47:24": "Что ж им не поразмыслитьнад Кораном?Иль на сердцах у них затворы?",
                            "verse 47:25": "Но те, кто, повернув назад,отступниками сталиПосле того, как путь прямой открылсяясно им, —Их подстрекает СатанаИ красит им (греховность их деяний).",
                            "verse 47:26": "И это — потому, что говорилиони тем,Кто ненависть питает к тому,что им низвел Аллах:«Мы будем вам повиноватьсяв некотором деле»2147.",
                            "verse 47:27": "Но что же (будут они делать),Когда их души ангелы возьмутна упокойИ будут их по лицам битьи по хребтам?2148",
                            "verse 47:28": "И это — потому,Что шли они за тем, что вызывалогнев Аллаха;Что было ненавистно имблаговоление Его, —За это их дела Он в тще’ту обратил.",
                            "verse 47:29": "Неужто те,Сердца которых схвачены недугом,Считают, что Господь не обнаружитих вражды?",
                            "verse 47:30": "И если б Мы того желали,Мы б указали их тебе,И ты бы узнавал их по особым знакам.",
                            "verse 47:31": "И Мы пошлем вам испытанья,Чтобы узнать, которые из васУсердствуют в сражениях (за веру)И терпеливо-стойки (в них),И испытаем сообщения от вас(на их правдивость).",
                            "verse 47:32": "Поистине, кто не уверовал в АллахаИ уклонил с Его пути другихИ кто противится посланнику ЕгоПосле того, как путь прямойоткрылся ясно им,Не причинят Аллаху ни малейшеговреда,Дела же их Он в тще’ту обратит.",
                            "verse 47:33": "О вы, кто верует!Аллаху повинуйтесь и посланнику Его!Не обращайте в тще’ту все ваши дела.",
                            "verse 47:34": "Кто не уверовал в Аллаха,И уклонил с Его пути других,И умирает, не уверовав (в Аллаха), —Тем не простит Он.",
                            "verse 47:35": "(Крепитесь), слабость подавляя,И к примиренью не зовите,Когда (над ними) держите вы верх, —Аллах ведь с вами,И Он не даст пропасть(Награде) за деянья ваши.",
                            "verse 47:36": "И жизнь в этом мире (суеты) —Забава легкая да тще’та.",
                            "verse 47:37": "А если бы у вас Он попросил его2149,То в вас бы возыграла скупость2150,И (тем) Он вызвал бы у вас враждуи злобу.",
                            "verse 47:38": "И помните, что вы есть те,Кого зовут расходовать из своегодобраНа (праведном) пути Аллаха."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "A quienes no crean y aparten a otros del camino de Alá, Él les invalidará sus obras.",
                            "verse 47:2": "En cambio, borrará las malas obras y mejorará la condición de quienes hayan creído, obrado bien y creído en la revelación hecha a Mahoma, la cual es la Verdad que viene de su Señor.",
                            "verse 47:3": "Y esto es así porque los infieles siguen lo falso, mientras que los creyentes siguen la Verdad venida de su Señor.",
                            "verse 47:4": "Cuando sostengáis, pues, un encuentro con los infieles, descargad los golpes en el cuello hasta someterlos.",
                            "verse 47:5": "Él les dirigirá, mejorará su condición",
                            "verse 47:6": "y les introducirá en el Jardín, que Él les habrá dado ya a conocer.",
                            "verse 47:7": "¡Creyentes! Si auxiliáis a Alá, Él os, auxiliará y afirmará vuestros pasos.",
                            "verse 47:8": "¡Ay de aquéllos, en cambio, que no hayan creído! Invalidará sus obras.",
                            "verse 47:9": "Y esto es así porque les repugnó la revelación de Alá.",
                            "verse 47:10": "¿No han ido por la tierra y mirado cómo terminaron sus antecesores? Alá los destruyó.",
                            "verse 47:11": "Y esto es así porque Alá es el Protector de los creyentes, mientras que los infieles no tienen protector.",
                            "verse 47:12": "Alá introducirá a quienes hayan creído y obrado bien en jardines por cuyos bajos fluyen arroyos.",
                            "verse 47:13": "¡Cuántas ciudades hemos hecho perecer, más fuertes que tu ciudad, que te ha expulsado, sin que hubiera quien les auxiliara!",
                            "verse 47:14": "¿Es que quien se basa en una prueba clara venida de su Señor es comparable a aquéllos cuya mala conducta ha sido engalanada y que siguen sus pasiones?",
                            "verse 47:15": "Imagen del Jardín prometido a quienes temen a Alá: habrá en él arroyos de agua incorruptible, arroyos de leche de gusto inalterable, arroyos de vino, delicia de los bebedores, arroyos de depurada miel.",
                            "verse 47:16": "Hay algunos de ellos que te escuchan, pero que, apenas salidos de tu casa, dicen a quienes han recibido la Ciencia: «¿Qué es lo que acaba de decir?» Éstos son aquéllos cuyo corazón Alá ha sellado y que siguen sus pasiones.",
                            "verse 47:17": "A quienes se dejen dirigir, Él les dirigirá aún mejor y les dará que Le teman.",
                            "verse 47:18": "¡,Qué pueden esperar, sino que les llegue la Hora de repente? Ya se han manifestado síntomas de la misma.",
                            "verse 47:19": "Sabe, pues, que no hay más dios que Alá y pide perdón por tu pecado, así como por los creyentes y las creyentes.",
                            "verse 47:20": "Los creyentes dicen: «¿Por qué no se revela una sura?» Pero, cuando se revela una sura unívoca en la que se menciona el combate, ves que los enfermos de corazón te miran como mira uno a quien ronda la muerte.",
                            "verse 47:21": "obedecer y hablar como es debido.",
                            "verse 47:22": "Si volvéis la espalda, os exponéis a corromper en la tierra y a cortar vuestros lazos de sangre.",
                            "verse 47:23": "A éstos es a quienes Alá maldice, volviéndoles sordos y ciegos.",
                            "verse 47:24": "¿Es que no meditan en el Corán ¿O es que sus corazones están cerrados con candado?",
                            "verse 47:25": "Quienes han vuelto sobre sus pasos, después de haberse manifestado a ellos la Dirección claramente, han sido seducidos por el Demonio, pero les ha concedido una tregua.",
                            "verse 47:26": "Esto es así porque dicen a quienes les repugna lo que Alá ha revelado: «En algunas cosas os obedeceremos».",
                            "verse 47:27": "¡Qué pasará cuando los ángeles les llamen, golpeándoles en el rostro y en la espalda?",
                            "verse 47:28": "Esto es así porque van en pos de algo que irrita a Alá y, en cambio, les repugna lo que Le satisface.",
                            "verse 47:29": "¿Es que creen los enfermos de corazón que Alá no va a descubrir su odio?",
                            "verse 47:30": "Si quisieramos, haríamos que les vieras: es reconocerías por sus rasgos: y, ciertamente, les reconocerás por el tono de sus palabras.",
                            "verse 47:31": "Hemos de probaros para saber quiénes de vosotros luchan y perseveran, así como para comprobar lo que se cuenta de vosotros.",
                            "verse 47:32": "Los infieles que hayan desviado a otros del camino de Alá y se hayan separado del Enviado, después de habérseles manifestado claramente la Dirección, no causarán ningún daño a Alá.",
                            "verse 47:33": "¡Creyentes! ¡Obedeced a Alá y obedeced al Enviado! ¡No hagáis vanas vuestras obras!",
                            "verse 47:34": "Alá no perdonará a los infieles que hayan desviado a otros del camino de Alá y mueran siendo infieles.",
                            "verse 47:35": "¡No flaqueéis, pues, invitando a la paz, ya que seréis vosotros los que ganen! Alá está con vosotros y no dejará de premiar vuestras obras.",
                            "verse 47:36": "La vida de acá es sólo juego y distracción.",
                            "verse 47:37": "Si os los reclamara con insistencia, os mostraríais avaros y descubriría vuestro odio.",
                            "verse 47:38": "He aquí que sois vosotros los invitados a gastar por la causa de Alá, pero hay entre vosotros algunos avaros."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "எவர்கள் (சன்மார்க்கத்தை) நிராகரித்தும், அல்லாஹ்வின் பாதையை விட்டும் (மனிதர்களைத்) தடுத்தும் கொண்டிருந்தார்களோ, அவர்களுடைய செயல்களை (அல்லாஹ்) பயனில்லாமல் ஆக்கிவிட்டான்.",
                            "verse 47:2": "ஆனால், எவர்கள் ஈமான் கொண்டு, ஸாலிஹான (நல்ல) அமல்கள் செய்து, முஹம்மது மீது இறக்கி அருளப்பட்ட (வேதத்)தின் மீது - இது அவர்களுடைய இறைவினிடமிருந்து (வந்து)ள்ள உண்மையாக இருக்கிறது என்று நம்பிக்கை கொள்கிறார்களோ, அவர்களுடைய தீமைகளை அவர்களை விட்டும் போக்கி, அவர்களுடை நிலையையும் சீராக்குகின்றான்.",
                            "verse 47:3": "இது ஏனெனில்; நிராகரிப்போர் அசத்தியத்தையே நிச்சயமாகப் பின்பற்றுகிறார்கள்; நம்பிக்கை கொண்டவர்களோ, நிச்சயமாகத் தங்களுடைய இறைவனிடமிருந்து (வந்து)ள்ளதையே பின்பற்றுகிறார்கள் - இவ்வாறே மனிதர்களுக்கு அல்லாஹ் அவர்கள் நிலைமையை உவமானங்களா(கக் கூறி விள)க்குகிறான்.",
                            "verse 47:4": "(முஃமின்களே! வலிந்து உங்களுடன் போரிட வரும்) நிராகரிப்பவர்களை நீங்கள் (போரில்) சந்திப்பீர்களாயின், அவர்களுடைய கழுத்துகளை வெட்டுங்கள்; கடும் போர் செய்து (நீங்கள் அவர்களை வென்று) விட்டால் (அவர்களுடைய) கட்டுகளை பலப்படுத்தி விடுங்கள்; அதன் பிறகு யாதொரு ஈடுபெற்றோ அல்லது (ஈடு பெறாது) உபகாரமாகவோ அவர்களை விட்டு விடுங்கள்.",
                            "verse 47:5": "அவன் அவர்களை நேர்வழியில் செலுத்துவான்; இன்னும், அவர்களுடைய நிலைமையையும் சீர்படுத்தி விடுவான்.",
                            "verse 47:6": "மேலும், அவன் அவர்களுக்கு அறிவித்திருந்த சுவர்க்கத்தில் அவர்களைப் பிரவேசிக்கச் செய்வான்.",
                            "verse 47:7": "ஈமான் கொண்டவர்களே! நீங்கள் அல்லாஹ்வுக்கு உதவி செய்தால், அவன் உங்களுக்கு உதவி செய்து உங்கள் பாதங்களையும் உறுதியாக்கி வைப்பான்.",
                            "verse 47:8": "அன்றியும், எவர்கள் நிராகரிக்கின்றார்களோ, அவர்களுக்குக் கேடுதான்; அவர்களுடைய செயல்களை அவன் பயனற்றவையாகவும் ஆக்கிவிடுவான்.",
                            "verse 47:9": "ஏனெனில்; அல்லாஹ் இற்ககிய (வேதத்)தை, திட்டமாகவே அவர்கள் வெறுத்தார்கள்; ஆகவே, அவர்களுடைய செயல்களை அவன் பயனற்றவையாக ஆக்கி விட்டான்.",
                            "verse 47:10": "அவர்கள் பூமியில் பிரயாணம் செய்து இவர்களுக்கு முன்பு இருந்தவர்களின் முடிவு எப்படியிருந்தது என்பதைப் பார்க்கவில்லையா? அல்லாஹ் அவர்களை அடியோடு அழித்து விட்டான், காஃபிர்களுக்கும் இவை போன்றவைதாம் (முடிவுகள்) உண்டு.",
                            "verse 47:11": "இது ஏனெனில்; அல்லாஹ் ஈமான் கொண்டவர்களுக்கு பாது காவலனாக இருக்கிறான்; அன்றியும் காஃபிர்களுக்குப் பாதுகாவலர் எவரும் இல்லை என்பதனால்தான்.",
                            "verse 47:12": "நிச்சயமாக அல்லாஹ்; எவர்கள் ஈமான் கொண்டு ஸாலிஹான (நல்ல) அமல்கள் செய்கிறார்களோ அவர்களைச் சுவர்க்கங்களில் பிரவேசிக்கச் செய்கிறான்; அவற்றின் கீழே ஆறகள் ஓடிக் கொண்டிருக்கும்; ஆனால் நிராகரிப்பவர்களோ (இவ்வுலக சுகங்களை) அனுபவித்துக் கொண்டும், மிருகங்கள் தீனி தின்பதைப் போல் தின்று கொண்டும் இருக்கிறார்கள்.",
                            "verse 47:13": "மேலும், (நபியே!) உம்முடைய ஊரை விடடு உம்மை வெளியேற்றியவர்களை விட, எத்தனையோ ஊ(ரா)ர்கள் மிக்க பல முடையவர்களாக இருந்தார்கள்.",
                            "verse 47:14": "எனவே எவர் தம் இறைவனின் தெளிவான பாதையில் இருக்கிறாரோ அவர் எவனுடைய செயலின் தீமை அவனுக்கு அழகாக் காண்பிக்கப் பட்டுள்தோ, இன்னும், எவர்கள் தம் மனோ இச்சைகளைப் பின்பற்றுகின்றார்களோ அத்தகையோருக்கு ஒப்பாவாரா?",
                            "verse 47:15": "பயபக்தியுடையவர்களுக்கு வாக்களிக்கப்பட்டுள்ள சுவர்க்கத்தின் உதாரணமாவது அதில் மாறுபடாத தெளிந்த நீரைக் கொண்ட ஆறுகளும், தன் சுவை மாறாத பாலாறுகளும், அருந்துவோருக்கு இன்பமளிக்கும் மது ரச ஆறுகளும், தெளிவான தேன் ஆறுகளும் இருக்கின்றன இன்னும், அதில் அவர்களுக்கு எல்லா விதமான கனிவகைகளும், தங்கள் இறைவனின் மன்னிப்பும் உண்டு.",
                            "verse 47:16": "இன்னும், அவர்களில் உம்மைச் செவிமடுப்பவர்களும் இருக்கின்றனர்; ஆனால் அவர்கள் உம்மை விட்டு வெளியேறியதும், எவர்களுக்கு (வேத) ஞானம் அருளப் பெற்றதோ அவர்களைப் பார்த்து \"அவர் சற்று முன் என்ன கூறினார்?\" என்று (பரிகாசமாகக்) கேட்கின்றனர்; இத்தகையோரின் இருதயங்களின் மீது அல்லாஹ் முத்திரையிட்டுவிட்டான்.",
                            "verse 47:17": "மேலும், எவர்கள் நேர்வழியில் செல்கிறார்களோ, அவர்களுடை நேர்வழியை (இன்னும்) அதிகப்படுத்தி, அவர்களுக்கு தக்வாவை - பயபக்தியை (இறைவன்) அளிக்கின்றான்.",
                            "verse 47:18": "எனவே இவர்கள் தங்கள் பால் திடுகூறாக (தீப்ப்புக்குரிய) அவ்வேளை வருவதை அன்றி (வேறு எதனையும்) எதிர்பார்க்கின்றனரா? அதன் அடையாளங்கள் திட்டமாக வந்து விட்டன ஆகவே அது அவர்களிடம் வந்து விட்டால், அவர்களுக்கு நினைவூட்டும் நல்லுபதேசம் எவ்வாறு பயனளிக்கும்.",
                            "verse 47:19": "ஆகவே, நிச்சயமாக அல்லாஹ்வைத் தவிர (வேறு) நாயன் இல்லை என்று நீர் அறிந்து கொள்வீராக இன்னும் உம்முடைய பாவத்திற்காகவும், முஃமின்களாகன ஆண்களுக்காகவும், பெண்களுக்காகவும் (பாவ) மன்னிப்புத் தேடுவீராக - அன்றியும் உங்களுடைய நடமாட்டத்தலத்தையும் உங்கள் தங்குமிடங்களையும் அல்லாஹ் நன்கறிகிறான்.",
                            "verse 47:20": "இன்னும், ஈமான் கொண்டவர்கள் கூறுகிறார்கள்; \"(புனிதப் போர் பற்றி) ஓர் அத்தியாயம் இறக்கி வைப்படவேண்டாமா?\" என்று.",
                            "verse 47:21": "(ஆகவே, இறைதூதருக்கு) வழிபட்டு நடப்பதும், நன்மையான சொல்லுமே (மேலானதாகும்) எனவே, ஒரு காரியம் உறுதியாகி விட்டால், அல்லாஹ்வுக்கு அவர்கள் உண்மையாக நடந்து கொண்டால் அதுவே அவர்களுக்கு நன்மையாக இருக்கும்.",
                            "verse 47:22": "(போருக்கு வராது) நீங்கள் பின் வாங்குவீர்களாயின், நீங்கள் பூமியில் குழப்பம் உண்டாக்கி உங்கள் சுற்றத்தாரை (அவர்களுடன் கலந்து உறவாடுவதிலிருந்தும்) துண்டித்து விடுவும் முனைவீர்களோ?",
                            "verse 47:23": "இத்தகையோரைத் தாம் அல்லாஹ் சபித்து, இவர்களைச் செவிடாக்கி இவர்கள் பார்வைகளையும் குருடாக்கி விட்டான்.",
                            "verse 47:24": "மேலும் அவர்கள் இந்தக் குர்ஆனை ஆராய்ந்து பார்க்க வேண்டாமா? அல்லது அவர்கள் இருதயங்கள் (இருக்கின்றனவே) அவற்றின் மீது பூட்டுப் போடப்பட்டு விட்டனவா?",
                            "verse 47:25": "நிச்சயமாக, எவர்கள் நேர்வழி இன்னதென்று அவர்களுக்குத் தெளிவானபின், தம் முதுகுகளைத் திருப்பிக் கொண்டு போகிறார்களோ, (அவ்வாறு போவதை) ஷைத்தான் அழகாக்கி, (அவர்களுடைய தவறான எண்ணங்களையும்) அவர்களுக்குப் பெருக்கி விட்டான்.",
                            "verse 47:26": "இது ஏனெனில் அவர்கள் எதை அல்லாஹ் இறக்கிவைக்கிறானோ, அதை வெறுப்பவர்களிடம், \"நாங்கள் சில காரியங்களில் உங்களையே பின்பற்றி நடப்போம்\" என்று கூறியதனாலேயாம்.",
                            "verse 47:27": "ஆகவே, அவர்களுடைய முகங்களிலும், அவர்களுடைய முதுகுகளிலும் அடித்து (உயிர்களைக் கைப்பற்றும்) மலக்குகள் அவர்களை மரணமடையச் செய்யும் போது (அவர்கள் நிலைமை) எப்படியிருக்கும்,",
                            "verse 47:28": "இது ஏனெனில்; நிச்சயமாக இவர்கள் அல்லஹ்வுக்குக் கோபமூட்டுவதையே பின்பற்றி, அவனுடைய திருப்தியை வெறுத்தமைதான்; ஆகவே அவர்களுடைய செய்கைகளை அவன் பயனில்லாதவையாக ஆக்கி விட்டான்.",
                            "verse 47:29": "அல்லது எவர்களுடைய இருதயங்களில் (வஞ்சக) நோயிருக்கிறதோ, அவர்கள், தங்களுடைய கபடங்களை அல்லாஹ் வெளியாக்க மாட்டான் என்று எண்ணுகிறார்களா?",
                            "verse 47:30": "அன்றியும், நாம் நாடினால், திடமாக நாம் அவர்களை உமக்குக் காண்பித்திருப்போம்; அவர்களுடைய முகக்குறிகளைக் கொண்டு நீர் அவர்களை நன்கு அறிந்து கொள்வீர்; நிச்சயமாக அவர்களுடைய சூழ்ச்சியான பேச்சைக் கொண்டும் அவர்களை நீர் அறிந்து கொள்வீர்; மேலும் அல்லாஹ் உங்களை செய்கைகளை நன்கறிகிறான்.",
                            "verse 47:31": "அன்றியும், (அல்லாஹ்வின் பாதையில் போரிடும்) உங்களிலிருந்துள்ள முஜாஹிதுகளையும், பொறுமையாளர்களையும் நாம் அறியும் வரை உங்களை நிச்சயமாக நாம் சோதிப்போம்; உங்கள் செய்திகளையும் நாம் சோதிப்போம் (அவற்றின் உண்மையை வெளிப்படுத்துவதற்காக).",
                            "verse 47:32": "நிச்சயமாக, நிராகரிப்பவர்கள் (பிறரை) அல்லாஹ்வின் பாதையை விட்டுத் தடுத்தும், நேர்வழி தங்களுக்குத் தெளிவான பிறகு (நம்) தூதரை எதிர்த்து முரண்பட்டுக் கொண்டும் இருக்கன்றனரோ - அவர்கள் அல்லாஹ்வுக்கு எவ்வித இடர்பாடும் செய்துவிட முடியாது அன்றியும் அவர்களுடைய செய்கைகளை அவன் பயனற்றவையாக ஆக்கியும் விடுவான்.",
                            "verse 47:33": "ஈமான் கொண்டவர்களே! நீங்கள் அல்லாஹ்வுக்கு வழிபடுங்கள்.",
                            "verse 47:34": "நிச்சியமாக, எவர்களை நிராகரித்துக் கொண்டும், (மக்களை) அல்லாஹ்வின் பாதையை விட்டு தடுத்துக் கொண்டும், பின்னர் காஃபிர்களாக இருக்கும் நிலையிலேயே இறந்தும் விடுகிறார்களோ - இ(த்தகைய)வர்களை அல்லாஹ் மன்னிக்கவே மாட்டான்.",
                            "verse 47:35": "(முஃமின்களே! போரில்) நீங்கள் தளர்ச்சியடைந்து, தைரியமிழந்து சமாதானத்தைக் கோராதீர்கள்; (ஏனென்றால்) நீங்கள் தாம் மேலோங்குபவர்கள்; அல்லாஹ் உங்களுடனேயே இருக்கின்றான் - மேலும், அவன் உங்கள் (நற்) செய்கைகளை உங்களுக்கு (ஒரு போதும்) குறைத்து விடமாட்டான்.",
                            "verse 47:36": "திடமாக இவ்வுலக வாழ்க்கை வீண்விளையாட்டாகவும் வேடிக்கையாகவுமிருக்கிறது ஆனால், நீங்கள் ஈமான் கொண்டு பயபக்தியுடையவர்களாயிருந்தால், அவன் உங்களுடைய கூலிகளை உங்களுக்கு அறிப்பான்.",
                            "verse 47:37": "அவன் உங்களிடம் அவற்றைக் கேட்டு வற்புறுத்தினாலும், நீங்கள் கஞ்சத்தனம் செய்வீர்கள்.",
                            "verse 47:38": "அறிந்துகொள்க! அல்லாஹ்வின் பாதையில் செலவு செய்யுமாறு அழைக்கப்படும் கூட்டத்தினர் நீங்கள், ஆனால் உங்களில் கஞ்சத்தனம் உடையோரும் இருக்கிறார்கள்; ஆனால் எவன் கஞ்சத்தனம் செய்கிறானோ, அவன் தன் ஆத்மாவுக்கே கஞ்சத்தனம் செய்கிறான் - அல்லாஹ் எவ்விதத் தேவையுமற்றவன் - நீங்க்ள தேவையுடையவர்களாக இருக்கின்றீர்கள்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "บรรดาผู้ปฏิเสธศรัทธา และปิดกั้นให้ห่างจากทางของอัลลอฮ์นั้น พระองค์ได้ทรงทำให้การงานของพวกเขาไร้ผล",
                            "verse 47:2": "ส่วนบรรดาผู้ศรัทธาและกระทำความดีทั้งหลาย และศรัทธาในสิ่งที่ถูกประทานแก่มุฮัมมัด และว่าอัลกุรอานนั้นเป็นสัจธรรมมาจากพระเจ้าของพวกเขา พระองค์จะทรงลบล้างความชั่วของพวกเขา ให้ออกไปจากพวกเขาและจะทรงปรับปรุงสภาพของพวกเขาให้ดีขึ้น",
                            "verse 47:3": "ทั้งนี้เพราะว่า บรรดาผู้ปฏิเสธศรัทธาได้ปฏิบัติตามความเท็จ แต่ส่วนบรรดาผู้ศรัทธาได้ปฏิบัติตามสัจธรรมมาจากพระเจ้าของพวกเขา เช่นนี้แหละอัลลอฮ์ทรงยกอุทาหรณ์ทั้งหลายของพวกเขาแก่ปวงมนุษย์",
                            "verse 47:4": "และเมื่อพวกเจ้าพบบรรดาผู้ปฏิเสธศรัทธาก็จงฟันที่คอ (จงฆ่าเสีย) จนกระทั่งเมื่อพวกเจ้าปราบพวกเขาจนแพ้แล้ว ก็จงจับพวกเขาเป็นเชลยหลังจากนั้นจะปล่อยเป็นไทหรือจะเรียกเอาค่าไถ่ก็ได้ จนกระทั่งการทำสงครามได้สิ้นสุดลงด้วยการวางอาวุธ เช่นนั้นแหละ และหากอัลลอฮ์ทรงประสงค์แน่นอน พระองค์จะทรงตอบแทนการลงโทษพวกเขา แต่ทั้งนี้เพื่อพระองค์จะทรงทดสอบบางคนในหมู่พวกเจ้ากับอีกบางคน ส่วนบรรดาผู้ที่ถูกฆ่าตายในทางของอัลลอฮ์พระองค์จะไม่ทรงทำให้การงานของพวกเขาไร้ผลเป็นอันขาด",
                            "verse 47:5": "พระองค์จะทรงชี้แนะทางแก่พวกเขาและจะทรงปรับปรุงสภาพของพวกเขาให้ดีขึ้น",
                            "verse 47:6": "และจะทรงให้พวกเขาเขาสวนสวรรค์ ซึ่งพระองค์ทรงแจ้งให้พวกเขารู้แล้ว",
                            "verse 47:7": "โอ้บรรดาผู้ศรัทธาเอ๋ย หากพวกเจ้าสนับสนุน (ศาสนาของ) อัลลอฮ์พระองค์ก็จะทรงสนับสนุนพวกเจ้าและจะทรงตรึงเท้าของพวกเจ้าให้มั่นคง",
                            "verse 47:8": "ส่วนบรรดาผู้ปฏิเสธศรัทธานั้น ความพินาศหายนะจะได้แก่พวกเขาและพระองค์ได้ทรงทำให้การงานของพวกเขาไร้ผล",
                            "verse 47:9": "ทั้งนี้เพราะว่า พวกเขาเกลียดชังสิ่งที่อัลลอฮ์ทรงประทานลงมา พระองค์จึงทรงทำให้การงานของพวกเขาไร้ผล",
                            "verse 47:10": "พวกเขามิได้ท่องเที่ยวไปตามแผ่นดินดอกหรือ แล้วพิจารณาดูว่า บั้นปลายของประชาชาติในยุคก่อนหน้าพวกเขานั้นเป็นเช่นใด? อัลลอฮ์ได้ทรงทำลายล้างพวกเขา และสำหรับพวกปฏิเสธศรัทธาก็เป็นเช่นเดียวกัน",
                            "verse 47:11": "ทั้งนี้เพราะว่าอัลลอฮ์เป็นผู้ทรงคุ้มครองบรรดาผู้ศรัทธา และแน่นอนพวกปฏิเสธศรัทธาไม่มีผู้คุ้มครองสำหรับพวกเขา",
                            "verse 47:12": "แท้จริงอัลลอฮ์จะทรงให้บรรดาผู้ศรัทธาและกระทำความดีทั้งหลายเข้าสู่สวนสวรรค์หลากหลาย ณ เบื้องล่างสวนสวรรค์มีลำน้ำหลายสายไหลผ่าน ส่วนบรรดาผู้ปฏิเสธศรัทธานั้นพวกเขาจะหลงระเริงและกินเยี่ยงปศุสัตว์กัน และไฟนรกคือที่พำนักของพวกเขา",
                            "verse 47:13": "และกี่เมืองมาแล้ว ที่มันมีพลังเข้มแข็งกว่าเมืองของเจ้า ซึ่งมันขับใสเจ้า (มุฮัมมัด) ออกไป เราได้ทำลายล้างพวกเขา ดังนั้น สำหรับพวกเขาจึงไม่มีผู้ช่วยเหลือ",
                            "verse 47:14": "ดังนั้นผู้ที่อยู่บนหลักฐานอันชัดแจ้งจากพระเจ้าของเขาจะเหมือนกับผู้ที่ความชั่วแห่งการงานของเขาได้ถูกทำให้เพริศแพร้วแก่เขา และพวกเขาก็ปฏิบัติตามอารมณ์ต่ำของพวกเขากระนั้นหรือ?",
                            "verse 47:15": "อุปมาของสวนสวรรค์ซึ่งบรรดาผู้ยำเกรงได้ถูกสัญญาไว้ในสวนสวรรค์นั้นมีธารน้ำหลายสายที่ไม่ผันแปร (ทั้งรสและกลิ่น) และธารน้ำนมหลายสาย ที่รสชาติของมันไม่เปลี่ยนแปลง และธารน้ำจัณฑ์ (เหล้า) หลายสายเป็นโอชะอร่อยแก่ผู้ดื่ม และธารน้ำผึ้งที่สะอาดบริสุทธิ์หลายสาย และสำหรับพวกเขาในสวนสวรรค์นั้นมีผลไม้หลายชนิด และการอภัยโทษจากพระเจ้าของพวกเขาจะเหมือนกับผู้ที่พำนักอยู่ในไฟนรก และถูกให้ดื่มน้ำร้อนจัดแล้วมันตัดลำไส้ของพวกเขากระนั้นหรือ?",
                            "verse 47:16": "ในหมู่พวกเขามีผู้เงี่ยหูฟังเจ้าจนกระทั่งเมื่อพวกเขาออกไปจากเจ้า พวกเขาก็จะพูดแก่ผู้มีความรู้ว่า เมื่อกี้นี้เขา (มุฮัมมัด) พูดอะไรกัน ชนเหล่านี้แหละคือบรรดาผู้ที่อัลลอฮ์ทรงประทับตราบนหัวใจของพวกเขา และพวกเขาปฏิบัติตามอารมณ์ต่ำของพวกเขา",
                            "verse 47:17": "ส่วนผู้ที่ปฏิบัติตามแนวทางที่ถูกต้อง พระองค์ทรงเพิ่มแนวทางที่ถูกต้องให้แก่พวกเขา และจะทรงประทานให้แก่พวกเขาซึ่งการยำเกรงของพวกเขา",
                            "verse 47:18": "ดังนั้น พวกเขามิได้คอยสิ่งใดนอกจากยามอวสานซึ่งมันจะมาหาพวกเขาอย่างกระทันหัน แต่ว่าเครื่องหมายต่าง ๆ ของมันได้มีมาแล้ว ดังนั้น เมื่อการตักเตือนของพวกเขาได้มายังพวกเขาแล้วจะเกิดประโยชน์อันใดเล่าแก่พวกเขา?",
                            "verse 47:19": "ฉะนั้นพึงรู้เถิดว่า ไม่มีพระเจ้าอื่นใดนอกจากอัลลอฮ์และจงขออภัยโทษต่อความผิดเพื่อตัวเจ้าและเพื่อบรรดาผู้ศรัทธาหญิง และอัลลอฮ์ทรงรู้ดียิ่งถึงพฤติการณ์ของพวกเจ้าและที่พำนักของพวกเจ้า",
                            "verse 47:20": "และบรรดาผู้ศรัทธากล่าวว่า ทำไม่สักซูเราะฮ์หนึ่งจึงไม่ถูกประทานลงมา? ครั้นเมื่อซูเราะฮ์หนึ่งที่รัดกุมชัดเจนถูกประทานลงมา และได้มีการทำสงครามถูกรวมไว้ในนั้น เจ้าจะเห็นบรรดาผู้ที่ในหัวใจของพวกเขามีโรคจะจ้องมองไปยังเจ้าเสมือนการมองของผู้เป็นลมใกล้จะตาย ดังนั้นความหายนะจงประสบแก่พวกเขาเถิด",
                            "verse 47:21": "การเชื่อฟังและปฏิบัติตามคำพูดที่ดีไพเราะ (นั้นเป็นการที่ดียิ่ง) ดังนั้นเมื่อกิจการใดถูกกำหนดไว้แล้ว หากว่าพวกเขาจริงใจต่ออัลลอฮ์แล้ว ก็จะเป็นการดีแก่เขา",
                            "verse 47:22": "ดังนั้น หวังกันว่า หากพวกเจ้าผินหลังให้ (กับการอีมานแล้ว) พวกเจ้าก็จะก่อความเสียหายในแผ่นดินและตัดความสัมพันธ์ทางเครือญาติของพวกเจ้ากระนั้นหรือ?",
                            "verse 47:23": "ชนเหล่านี้คือบรรดาผู้ที่อัลลอฮ์ทรงสาปแช่งพวกเขา ดังนั้นพระองค์จึงทรงทำให้พวกเขาหูหนวก และทรงทำให้พวกเขาตาบอด",
                            "verse 47:24": "พวกเขามิได้พิจารณาใคร่ครวญอัลกุรอานดอกหรือ? แต่ว่าบนหัวใจของพวกเขามีกุญแจหลายดอกลั่นอยู่",
                            "verse 47:25": "แท้จริงบรรดาผู้ผินหลังกลับของพวกเขาหลังจากที่แนวทางที่ถูกต้องเป็นที่ประจักษ์แก่พวกเขาแล้ว ชัยตอนมารร้ายได้ล่อลวง พวกเขาได้ให้ความหวังแก่พวกเขา (ว่าจะมีชีวิตยืนนาน)",
                            "verse 47:26": "ทั้งนี้เพราะว่าพวกเขาได้กล่าวแก่บรรดาผู้เกลียดชังสิ่งที่อัลลอฮ์ทรงประทานลงมาว่าเราจะเชื่อฟังปฏิบัติตามในกิจการบางอย่าง แต่อัลลอฮ์ทรงทราบดีถึงความลับของพวกเขา",
                            "verse 47:27": "แล้ว (สภาพของพวกเขา) จะเป็นเช่นไร เมื่อมลาอิกะฮ์มาเอาชีวิตของพวกเขาโดยตีใบหน้าของพวกเขาและหลังของพวกเขา",
                            "verse 47:28": "ทั้งนี้เพราะว่าพวกเขาได้ปฏิบัติตามสิ่งที่จะก่อความกริ้วแด่อัลลอฮ์และพวกเขารังเกียจความโปรดปรานของพระองค์ ดังนั้นพระองค์จึงทรงทำให้การงานของพวกเขาไร้ผล",
                            "verse 47:29": "บรรดาผู้ที่หัวใจของพวกเขามีโรคคิดหรือว่าอัลลอฮ์จะไม่ทรงนำเอาความอิจฉาริษยาของพวกเขาออกมาให้เป็นที่ประจักษ์",
                            "verse 47:30": "และหากเราประสงค์แน่นอนเราจะเปิดเผยพวกเขาแก่เจ้า แล้วเจ้าก็จะรู้จักพวกเขาอย่างแน่นอนที่เครื่องหมายของพวกเขา และแน่นอนเจ้าจะรู้จักพวกเขาได้ในน้ำเสียงแห่งการพูด และอัลลอฮ์ทรงรู้ดีถึงการงานของพวกเจ้า",
                            "verse 47:31": "และแน่นอนเราจะทดสอบพวกเจ้าจนกระทั่งเราจะได้รู้ถึงบรรดาผู้ต่อสู้ดิ้นรน และบรรดาผู้หนักแน่นอดทนในหมู่พวกเจ้า และเราจะทดสอบการงานของพวกเจ้า",
                            "verse 47:32": "แท้จริงบรรดาผู้ปฏิเสธศรัทธาและปิดกั้นให้ห่างจากทางของอัลลอฮ์และต่อต้านร่อซู้ลนี้หลังจากที่แนวทางที่ถูกต้องได้เป็นที่ประจักษ์แก่พวกเขาแล้ว พวกเขาจะไม่ก่อให้เกิดอันตรายใด ๆ แก่อัลลอฮ์ได้เลย พระองค์จะทรงทำให้การงานของพวกเขาไร้ผล",
                            "verse 47:33": "โอ้บรรดาผู้ศรัทธาเอ๋ย จงเชื่อฟังปฏิบัติตามอัลลอฮ์และจงเชื่อฟังปฏิบัติตามร่อซู้ลคนนี้เถิดและอย่าทำให้การงานของพวกเจ้าไร้ประโยชน์",
                            "verse 47:34": "แท้จริง บรรดาผู้ปฏิเสธศรัทธาและปิดกั้นให้ห่างจากทางของอัลลอฮ์ แล้วพวกเขาตายลงทั้ง ๆ ที่พวกเขาเป็นผู้ปฏิเสธศรัทธาอยู่ อัลลอฮ์จะไม่ทรงอภัยโทษให้พวกเขาเลย",
                            "verse 47:35": "ดังนั้น พวกเจ้าอย่าท้อแท้และเรียกร้องไปสู่การสงบศึก เพราะพวกเจ้าเป็นผู้อยู่เหนือสุด และอัลลอฮ์ทรงอยู่ร่วมกับพระเจ้าและพระองค์จะไม่ทรงลิดรอนผลตอบแทนแห่งการงานของพวกเจ้า",
                            "verse 47:36": "การมีชีวิตอยู่ในโลกนี้ เป็นแต่เพียงการละเล่นและการสนุกสนานร่าเริงเท่านั้น และหากพวกเจ้าศรัทธาและยำเกรงพระองค์จะทรงประทานรางวัลของพวกเจ้าแก่พวกเจ้าและพระองค์จะไม่ทรงขอทรัพย์สินของพวกเจ้า",
                            "verse 47:37": "หากพระองค์จะทรงขอทรัพย์สินต่อพวกเจ้าและทรงรบเร้าพวกเจ้า (ให้บริจาค) พวกเจ้าก็จะตระหนี่ และพระองค์จะทรงนำเอาความอึดอัดใจของพวกเจ้าออกมาให้ประจักษ์",
                            "verse 47:38": "พึงรู้เถิดว่าพวกเจ้านี้แหละคือหมู่ชนที่ถูกเรียกร้องให้บริจาคในทางของอัลลอฮ์แต่มีบางคนในหมู่พวกเจ้าเป็นผู้ตระหนี่ ดังนั้น ผู้ใดตระหนี่เขาก็ตระหนี่แก่ตัวของเขาเอง เพราะอัลลอฮ์เป็นผู้ทรงมั่งมี แต่พวกเจ้าเป็นผู้ขัดสนและถ้าพวกเจ้าเผินหลังออก พระองค์ก็จะทรงเปลี่ยนหมู่ชนอื่นแทนพวกเจ้า แล้วพวกเขาเหล่านั้นจะไม่เป็นเช่นพวกเจ้า"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "İman edip yararlı işler yapanların, Rableri tarafından hak olarak Muhammed'e indirilene inananların günahlarını Allah örtmüş ve hallerini düzeltmiştir.",
                            "verse 47:2": "Bunun sebebi, inkâr edenlerin bâtıla uymaları, inananların da Rablerinden gelen hakka uymuş olmalarıdır.",
                            "verse 47:3": "(Savaşta) inkâr edenlerle karşılaştığınız zaman boyunlarını vurun.",
                            "verse 47:4": "Allah onları muratlarına erdirecek, gönüllerini şâdedecek .",
                            "verse 47:5": "Onları, kendilerine tanıttığı cennete sokacaktır.",
                            "verse 47:6": "Ey iman edenler! Eğer siz Allah'a (Allah'ın dinine) yardım ederseniz O da size yardım eder, ayaklarınızı kaydırmaz.",
                            "verse 47:7": "Bunun sebebi, Allah'ın indirdiğini beğenmemeleridir.",
                            "verse 47:8": "Yeryüzünde dolaşıp kendilerinden öncekilerin sonlarının nasıl olduğunu görmezler mi? Allah onları yere batırmıştır.",
                            "verse 47:9": "Bu, Allah'ın, inananların yardımcısı olmasından dolayıdır.",
                            "verse 47:10": "Muhakkak ki Allah, inanıp iyi işler yapanları, altlarından ırmaklar akan cennetlere koyar; inkâr edenler ise (dünyadan) faydalanırlar, hayvanların yediği gibi yerler.",
                            "verse 47:11": "Senin şehrinden -ki ora (halkı) seni çıkardı daha kuvvetli nice şehirleri yok ettik; onlara bir yardım eden de çıkmadı.",
                            "verse 47:12": "Rabbinden apaçık bir delil üzerinde bulunan kimse, kötü işi kendisine güzel görünen ve heveslerine uyan kimse gibi olur mu?",
                            "verse 47:13": "Müttakîlere vâdolunan cennetin durumu şöyledir: İçinde bozulmayan sudan ırmaklar, tadı değişmeyen sütten ırmaklar, içenlere lezzet veren şaraptan ırmaklar ve süzme baldan ırmaklar vardır.",
                            "verse 47:14": "Onların arasında, seni dinleyenler vardır.",
                            "verse 47:15": "Doğru yolu bulanlara gelince, Allah onların hidayetlerini arttırır ve sakınmalarını sağlar.",
                            "verse 47:16": "Onlar, kıyamet gününün ansızın gelip çatmasını mı bekliyorlar? Şüphesiz onun alâmetleri belirmiştir.",
                            "verse 47:17": "Bil ki, Allah'tan başka ilâh yoktur.",
                            "verse 47:18": "İman etmiş olanlar: Keşke cihad hakkında bir sûre indirilmiş olsaydı! derler.",
                            "verse 47:19": "(Onların vazifesi) itaat ve güzel sözdür.",
                            "verse 47:20": "Geri dönerseniz, yeryüzünde bozgunculuk yapmaya ve akrabalık bağlarını kesmeye dönmüş olmaz mısınız?",
                            "verse 47:21": "İşte bunlar, Allah'ın kendilerini lânetlediği, sağır kıldığı ve gözlerini kör ettiği kimselerdir.",
                            "verse 47:22": "Onlar Kur'an'ı düşünmüyorlar mı? Yoksa kalpleri kilitli mi?",
                            "verse 47:23": "Şüphesiz ki, kendilerine doğru yol belli olduktan sonra, arkalarına dönenleri, şeytan sürüklemiş ve kendilerine ümit vermiştir.",
                            "verse 47:24": "Bunun sebebi; onların, Allah'ın indirdiğinden hoşlanmayanlara: Bazı hususlarda size itaat edeceğiz, demeleridir.",
                            "verse 47:25": "Ya melekler onların yüzlerine ve sırtlarına vurarak canlarını alırken durumları nasıl olacak!",
                            "verse 47:26": "Bunun sebebi, onların Allah'ı gazaplandıran şeylerin ardınca gitmeleri ve O'nu razı edecek şeylerden hoşlanmamalarıdır.",
                            "verse 47:27": "Kalplerinde hastalık olanlar, yoksa Allah'ın, kinlerini ortaya çıkarmayacağını mı sandılar?",
                            "verse 47:28": "Biz dileseydik onları sana gösterirdik de, sen onları yüzlerinden tanırdın.",
                            "verse 47:29": "Andolsun",
                            "verse 47:30": "ki içinizden cihad edenlerle sabredenleri belirleyinceye ve haberlerinizi açıklayıncaya kadar sizi imtihan edeceğiz.",
                            "verse 47:31": "İnkâr edenler, Allah yolundan alıkoyanlar ve kendilerine doğru yol belli olduktan sonra Peygamber'e karşı gelenler, Allah'a hiçbir zarar veremezler.",
                            "verse 47:32": "Ey iman edenler! Allah'a itaat edin, Peygambere itaat edin.",
                            "verse 47:33": "İnkâr edip Allah yolundan alıkoyanları ve sonra da kâfir olarak ölenleri Allah asla bağışlamaz.",
                            "verse 47:34": "Üstün durumda iken gevşeyip barışa çağırmayın.",
                            "verse 47:35": "Doğrusu dünya hayatı ancak bir oyun ve eğlencedir.",
                            "verse 47:36": "Eğer onları (tamamını) isteseydi ve sizi zorlasaydı, cimrilik ederdiniz ve bu da sizin kinlerinizi ortaya çıkarırdı.",
                            "verse 47:37": "İşte sizler, Allah yolunda harcamaya çağırılıyorsunuz."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "جن لوگوں نے کفر کیا اور (اَوروں کو) خدا کے رستے سے روکا۔ خدا نے ان کے اعمال برباد کر دیئے",
                            "verse 47:2": "جن لوگوں نے کفر کيا اور (دوسروں کو) ا? کي راہ سے روکا (تو) ا? نے ان کے اعمال (اخروي اجر کے لحاظ سے) برباد کر ديئےo",
                            "verse 47:3": "اور جو لوگ ايمان لائے اور نيک عمل کرتے رہے اور اس (کتاب) پر ايمان لائے جو محمد (صلي اللہ عليہ وآلہ وسلم) پر نازل کي گئي ہے اور وہي ان کے رب کي جانب سے حق ہے ا? نے ان کے گناہ ان (کے نام? اعمال) سے مٹا ديئے اور ان کا حال سنوار دياo",
                            "verse 47:4": "اور جو ایمان لائے اور نیک عمل کرتے رہے اور جو (کتاب) محمد پر نازل ہوئی اسے مانتے رہے اور وہ ان کے پروردگار کی طرف سے برحق ہے ان سے ان کے گناہ دور کردیئے اور ان کی حالت سنوار دی",
                            "verse 47:5": "یہ (حبط اعمال اور اصلاح حال) اس لئے ہے کہ جن لوگوں نے کفر کیا انہوں نے جھوٹی بات کی پیروی کی اور جو ایمان لائے وہ اپنے پروردگار کی طرف سے (دین) حق کے پیچھے چلے۔ اسی طرح خدا لوگوں سے ان کے حالات بیان فرماتا ہے",
                            "verse 47:6": "يہ اس لئے کہ جن لوگوں نے کفر کيا وہ باطل کے پيچھے چلے اور جو لوگ ايمان لائے انہوں نے اپنے رب کي طرف سے (اتارے گئے) حق کي پيروي کي، اسي طرح ا? لوگوں کے لئے ان کے احوال بيان فرماتا ہےo",
                            "verse 47:7": "پھر جب (ميدان جنگ ميں) تمہارا مقابلہ (متحارب) کافروں سے ہو تو (دورانِ جنگ) ان کي گردنيں اڑا دو (کيونکہ انہوں نے انسانيت کا قتل عام کيا اور فساد انگيزي کے ذريعے امن برباد کيا)، يہاں تک کہ جب تم انہيں (جنگي معرکہ ميں) خوب قتل کر چکو تو (بقيہ قيديوں کو) مضبوطي سے باندھ لو، پھر اس کے بعد يا تو (انہيں) احسان کرتے ہوئے (بلا معاوضہ چھوڑ دو) يا فديہ (يعني معاوض? رہائي) لے کر (آزاد کر دو) يہاں تک کہ جنگ (کرنے والي مخالف فوج) اپنے ہتھيار رکھ دے (يعني صلح و امن کا اعلان کر دے)? يہي (حکم) ہے، اور اگر ا? چاہتا تو ان سے (بغير جنگ) انتقام لے ليتا مگر (اس نے ايسا نہيں کيا) تاکہ تم ميں سے بعض کو بعض کے ذريعے آزمائے، اور جو لوگ ا? کي راہ ميں قتل کر ديئے گئے تو وہ ان کے اعمال کو ہرگز ضائع نہ کرے گاo",
                            "verse 47:8": "جب تم کافروں سے بھڑ جاؤ تو ان کی گردنیں اُڑا دو۔ یہاں تک کہ جب ان کو خوب قتل کرچکو تو (جو زندہ پکڑے جائیں ان کو) مضبوطی سے قید کرلو۔ پھر اس کے بعد یا تو احسان رکھ کر چھوڑ دینا چاہیئے یا کچھ مال لے کر یہاں تک کہ (فریق مقابل) لڑائی (کے) ہتھیار (ہاتھ سے) رکھ دے۔ (یہ حکم یاد رکھو) اور اگر خدا چاہتا تو (اور طرح) ان سے انتقام لے لیتا۔ لیکن اس نے چاہا کہ تمہاری آزمائش ایک (کو) دوسرے سے (لڑوا کر) کرے۔ اور جو لوگ خدا کی راہ میں مارے گئے ان کے عملوں کو ہرگز ضائع نہ کرے گا",
                            "verse 47:9": "(بلکہ) ان کو سیدھے رستے پر چلائے گا اور ان کی حالت درست کر دے گا",
                            "verse 47:10": "وہ عنقريب انہيں (جنت کي) سيدھي راہ پر ڈال دے گا اور ان کے احوالِ (اُخروي) کو خوب بہتر کر دے گاo",
                            "verse 47:11": "اور (بالآخر) انہيں جنت ميں داخل فرما دے گا جس کي اس نے (پہلے ہي سے) انہيں خوب پہچان کرا دي ہےo",
                            "verse 47:12": "اور ان کو بہشت میں جس سے انہیں شناسا کر رکھا ہے داخل کرے گا",
                            "verse 47:13": "اے اہل ایمان! اگر تم خدا کی مدد کرو گے تو وہ بھی تمہاری مدد کرے گا اور تم کو ثابت قدم رکھے گا",
                            "verse 47:14": "اے ايمان والو! اگر تم ا? (کے دين) کي مدد کرو گے تو وہ تمہاري مدد فرمائے گا اور تمہارے قدموں کو مضبوط رکھے گاo",
                            "verse 47:15": "اور جنہوں نے کفر کيا تو ان کے لئے ہلاکت ہے اور (ا? نے) ان کے اعمال برباد کر ديئےo",
                            "verse 47:16": "اور جو کافر ہیں ان کے لئے ہلاکت ہے۔ اور وہ ان کے اعمال کو برباد کر دے گا",
                            "verse 47:17": "یہ اس لئے کہ خدا نے جو چیز نازل فرمائی انہوں نے اس کو ناپسند کیا تو خدا نے بھی ان کے اعمال اکارت کردیئے",
                            "verse 47:18": "يہ اس وجہ سے کہ انہوں نے اس (کتاب) کو ناپسند کيا جو ا? نے نازل فرمائي تو اس نے ان کے اعمال اکارت کر ديئےo",
                            "verse 47:19": "کيا انہوں نے زمين ميں سفر و سياحت نہيں کي کہ وہ ديکھ ليتے کہ ان لوگوں کا انجام کيسا ہوا جو ان سے پہلے تھے? ا? نے ان پر ہلاکت و بربادي ڈال دي? اور کافروں کے لئے اسي طرح کي بہت سي ہلاکتيں ہيںo",
                            "verse 47:20": "کیا انہوں نے ملک میں سیر نہیں کی تاکہ دیکھتے کہ جو لوگ ان سے پہلے تھے ان کا انجام کیسا ہوا؟ خدا نے ان پر تباہی ڈال دی۔ اور اسی طرح کا (عذاب) ان کافروں کو ہوگا",
                            "verse 47:21": "یہ اس لئے کہ جو مومن ہیں ان کا خدا کارساز ہے اور کافروں کا کوئی کارساز نہیں",
                            "verse 47:22": "يہ اس وجہ سے ہے کہ ا? ان لوگوں کا ولي و مددگار ہے جو ايمان لائے ہيں اور بيشک کافروں کے لئے کوئي ولي و مددگار نہيں ہےo",
                            "verse 47:23": "بيشک ا? ان لوگوں کو جو ايمان لائے اور نيک اعمال کرتے رہے بہشتوں ميں داخل فرمائے گا جن کے نيچے نہريں جاري ہوں گي، اور جن لوگوں نے کفر کيا اور (دنيوي) فائدے اٹھا رہے ہيں اور (اس طرح) کھا رہے ہيں جيسے چوپائے (جانور) کھاتے ہيں سو دوزخ ہي ان کا ٹھکانا ہےo",
                            "verse 47:24": "سورة محَمَّد رکوع (۴/۲) جو لوگ ایمان لائے اور عمل نیک کرتے رہے ان کو خدا بہشتوں میں جن کے نیچے نہریں بہہ رہی ہیں داخل فرمائے گا۔ اور جو کافر ہیں وہ فائدے اٹھاتے ہیں اور (اس طرح) کھاتے ہیں جیسے حیوان کھاتے ہیں۔ اور ان کا ٹھکانہ دوزخ ہے",
                            "verse 47:25": "اور بہت سی بستیاں تمہاری بستی سے جس (کے باشندوں نے تمہیں وہاں) سے نکال دیا زور وقوت میں کہیں بڑھ کر تھیں ہم نے ان کا ستیاناس کردیا اور ان کا کوئی مددگار نہ ہوا",
                            "verse 47:26": "اور (اے حبيب!) کتني ہي بستياں تھيں جن کے باشندے (وسائل و اقتدار ميں) آپ کے اس شہر (مکّہ کے باشندوں) سے زيادہ طاقتور تھے جس (کے مقتدر وڈيروں) نے آپ کو (بصورتِ ہجرت) نکال ديا ہے، ہم نے انہيں (بھي) ہلاک کر ڈالا پھر ان کا کوئي مددگار نہ ہوا (جو انہيں بچا سکتا)o",
                            "verse 47:27": "سو کيا وہ شخص جو اپنے رب کي طرف سے واضح دليل پر (قائم) ہو ان لوگوں کي مثل ہو سکتا ہے جن کے برے اعمال ان کے لئے آراستہ کر کے دکھائے گئے ہيں اور وہ اپني نفساني خواہشات کے پيچھے چل رہے ہوںo",
                            "verse 47:28": "بھلا جو شخص اپنے پروردگار (کی مہربانی) سے کھلے رستے پر (چل رہا) ہو وہ ان کی طرح (ہوسکتا) ہے جن کے اعمال بد انہیں اچھے کرکے دکھائی جائیں اور جو اپنی خواہشوں کی پیروی کریں",
                            "verse 47:29": "جنت جس کا پرہیزگاروں سے وعدہ کیا جاتا ہے۔ اس کی صفت یہ ہے کہ اس میں پانی کی نہریں ہیں جو بو نہیں کرے گا۔ اور دودھ کی نہریں ہیں جس کا مزہ نہیں بدلے گا۔ اور شراب کی نہریں ہیں جو پینے والوں کے لئے (سراسر) لذت ہے۔ اور شہد مصفا کی نہریں ہیں (جو حلاوت ہی حلاوت ہے) اور (وہاں) ان کے لئے ہر قسم کے میوے ہیں اور ان کے پروردگار کی طرف سے مغفرت ہے۔ (کیا یہ پرہیزگار) ان کی طرح (ہوسکتے) ہیں جو ہمیشہ دوزخ میں رہیں گے اور جن کو کھولتا ہوا پانی پلایا جائے گا تو ان کی انتڑیوں کو کاٹ ڈالے گا",
                            "verse 47:30": "جس جنّت کا پرہيزگاروں سے وعدہ کيا گيا ہے اس کي صفت يہ ہے کہ اس ميں (ايسے) پاني کي نہريں ہوں گي جس ميں کبھي (بو يا رنگت کا) تغيّر نہ آئے گا، اور (اس ميں ايسے) دودھ کي نہريں ہوں گي جس کا ذائقہ اور مزہ کبھي نہ بدلے گا، اور (ايسے) شرابِ (طہور) کي نہريں ہوں گي جو پينے والوں کے لئے سراسر لذّت ہے، اور خوب صاف کئے ہوئے شہد کي نہريں ہوں گي، اور ان کے لئے اس ميں ہر قسم کے پھل ہوں گے اور ان کے رب کي جانب سے (ہر طرح کي) بخشائش ہوگي، (کيا يہ پرہيزگار) ان لوگوں کي طرح ہو سکتا ہے جو ہميشہ دوزخ ميں رہنے والے ہيں اور جنہيں کھولتا ہوا پاني پلايا جائے گا تو وہ ان کي آنتوں کو کاٹ کر ٹکڑے ٹکڑے کر دے گاo",
                            "verse 47:31": "اور ان ميں سے بعض وہ لوگ بھي ہيں جو آپ کي طرف (دل اور دھيان لگائے بغير) صرف کان لگائے سنتے رہتے ہيں يہاں تک کہ جب وہ آپ کے پاس سے نکل کر (باہر) جاتے ہيں تو ان لوگوں سے پوچھتے ہيں جنہيں علمِ (نافع) عطا کيا گيا ہے کہ ابھي انہوں نے (يعني رسول ا? صلي اللہ عليہ وآلہ وسلم نے) کيا فرمايا تھا؟ يہي وہ لوگ ہيں جن کے دلوں پر ا? نے مہر لگا دي ہے اور وہ اپني خواہشات کي پيروي کر رہے ہيںo",
                            "verse 47:32": "اور ان میں بعض ایسے بھی ہیں جو تمہاری طرف کان لگائے یہاں تک کہ (سب کچھ سنتے ہیں لیکن) جب تمہارے پاس سے نکل کر چلے جاتے ہیں تو جن لوگوں کو علم (دین) دیا گیا ہے ان سے کہتے ہیں کہ (بھلا) انہوں نے ابھی کیا کہا تھا؟ یہی لوگ ہیں جن کے دلوں پر خدا نے مہر لگا رکھی ہے اور وہ اپنی خواہشوں کے پیچھے چل رہے ہیں",
                            "verse 47:33": "اور جو لوگ ہدایت یافتہ ہیں ان کو وہ ہدایت مزید بخشتا اور پرہیزگاری عنایت کرتا ہے",
                            "verse 47:34": "اور جن لوگوں نے ہدايت پا لي ہے، ا? ان کي ہدايت کو اور زيادہ فرما ديتا ہے اور انہيں ان کے مقامِ تقو?ي سے سرفراز فرماتا ہےo",
                            "verse 47:35": "تو اب يہ (منکر) لوگ صرف قيامت ہي کا انتظار کر رہے ہيں کہ وہ ان پر اچانک آپہنچے؟ سو واقعي اس کي نشانياں (قريب) آپہنچي ہيں، پھر انہيں ان کي نصيحت کہاں (مفيد) ہوگي جب (خود) قيامت (ہي) آپہنچے گےo",
                            "verse 47:36": "اب تو یہ لوگ قیامت ہی کو دیکھ رہے ہیں کہ ناگہاں ان پر آ واقع ہو۔ سو اس کی نشانیاں (وقوع میں) آچکی ہیں۔ پھر جب وہ ان پر آ نازل ہوگی اس وقت انہیں نصیحت کہاں (مفید ہوسکے گی؟)",
                            "verse 47:37": "پس جان رکھو کہ خدا کے سوا کوئی معبود نہیں اور اپنے گناہوں کی معافی مانگو اور (اور) مومن مردوں اور مومن عورتوں کے لئے بھی۔ اور خدا تم لوگوں کے چلنے پھرنے اور ٹھیرنے سے واقف ہے",
                            "verse 47:38": "پس جان ليجئے کہ ا? کے سوا کوئي معبود نہيں اور آپ (اظہارِ عبوديت اور تعليمِ امت کي خاطر ا? سے) معافي مانگتے رہا کريں کہ کہيں آپ سے خلافِ اولي? (يعني آپ کے مرتبہ عاليہ سے کم درجہ کا) فعل صادر نہ ہو جائے? اور مومن مردوں اور مومن عورتوں کے لئے بھي طلبِ مغفرت (يعني ان کي شفاعت) فرماتے رہا کريں (يہي ان کا سامانِ بخشش ہے)، اور (اے لوگو!) ا? (دنيا ميں) تمہارے چلنے پھرنے کے ٹھکانے اور (آخرت ميں) تمہارے ٹھہرنے کي منزليں (سب) جانتا ہےo? (خواہ وہ فعل اپني جگہ شرعاً جائز اور مستحسن ہي کيوں نہ ہو مگر آپ صلي اللہ عليہ وآلہ وسلم کا مقام و مرتبہ اتنا بلند اور ارفع و اعل?ي ہے کہ کئي اعمال صالحہ بھي آپ صلي اللہ عليہ وآلہ وسلم کي شان کے لحاظ سے کمتر ہيں?)",
                            "verse 47:39": "اور ايمان والے کہتے ہيں کہ (دفاعي جنگ سے متعلق) کوئي سورت کيوں نہيں اتاري جاتي؟ پھر جب کوئي واضح سورت نازل کي جاتي ہے اور اس ميں (دفاعي) جنگ کا (صريحاً) ذکر کيا جاتا ہے تو آپ ايسے لوگوں کو جن کے دلوں ميں (نفاق کي) بيماري ہے ملاحظہ فرماتے ہيں کہ وہ آپ کي طرف (اس طرح) ديکھتے ہيں جيسے وہ شخص ديکھتا ہے جس پر موت کي غشي طاري ہو رہي ہو? سو ان کے لئے خرابي ہےo",
                            "verse 47:40": "سورة محَمَّد رکوع (۴/۳) اور مومن لوگ کہتے ہیں کہ (جہاد کی) کوئی سورت کیوں نازل نہیں ہوتی؟ لیکن جب کوئی صاف معنوں کی سورت نازل ہو اور اس میں جہاد کا بیان ہو تو جن لوگوں کے دلوں میں (نفاق کا) مرض ہے تم ان کو دیکھو کہ تمہاری طرف اس طرح دیکھنے لگیں جس طرح کسی پر موت کی بیہوشی (طاری) ہو رہی ہو۔ سو ان کے لئے خرابی ہے",
                            "verse 47:41": "(خوب کام تو) فرمانبرداری اور پسندیدہ بات کہنا (ہے) پھر جب (جہاد کی) بات پختہ ہوگئی تو اگر یہ لوگ خدا سے سچے رہنا چاہتے تو ان کے لئے بہت اچھا ہوتا",
                            "verse 47:42": "فرمانبرداري اور اچھي گفتگو (ان کے حق ميں بہتر) ہے، پھر جب حکمِ جہاد قطعي (اور پختہ) ہو گيا تو اگر وہ ا? سے (اپني اطاعت اور وفاداري ميں) سچے رہتے تو ان کے لئے بہتر ہوتاo",
                            "verse 47:43": "پس (اے منافقو!) تم سے توقع يہي ہے کہ اگر تم (قتال سے گريز کر کے بچ نکلو اور) حکومت حاصل کر لو تو تم زمين ميں فساد ہي برپا کرو گے اور اپنے (ان) قرابتي رشتوں کو توڑ ڈالو گے (جن کے بارے ميں ا? اور اس کے رسول صلي اللہ عليہ وآلہ وسلم نے مواصلت اور مُودّت کا حکم ديا ہے)o",
                            "verse 47:44": "(اے منافقو!) تم سے عجب نہیں کہ اگر تم حاکم ہو جاؤ تو ملک میں خرابی کرنے لگو اور اپنے رشتوں کو توڑ ڈالو",
                            "verse 47:45": "یہی لوگ ہیں جن پر خدا نے لعنت کی ہے اور ان (کے کانوں) کو بہرا اور (ان کی) آنکھوں کو اندھا کردیا ہے",
                            "verse 47:46": "يہي وہ لوگ ہيں جن پر ا? نے لعنت کي ہے اور ان (کے کانوں) کو بہرا کر ديا ہے اور ان کي آنکھوں کو اندھا کر ديا ہےo",
                            "verse 47:47": "کيا يہ لوگ قرآن ميں غور نہيں کرتے يا ان کے دلوں پر تالے (لگے ہوئے) ہيںo",
                            "verse 47:48": "بھلا یہ لوگ قرآن میں غور نہیں کرتے یا (ان کے) دلوں پر قفل لگ رہے ہیں",
                            "verse 47:49": "جو لوگ راہ ہدایت ظاہر ہونے کے بعد پیٹھ دے کر پھر گئے۔ شیطان نے (یہ کام) ان کو مزین کر دکھایا اور انہیں طول (عمر کا وعدہ) دیا",
                            "verse 47:50": "بيشک جو لوگ پيٹھ پھير کر پيچھے (کفر کي طرف) لوٹ گئے اس کے بعد کہ ان پر ہدايت واضح ہو چکي تھي شيطان نے انہيں (کفر کي طرف واپس پلٹنا دھوکہ دہي سے) اچھا کر کے دکھايا، اور انہيں (دنيا ميں) طويل زندگي کي اميد دلائيo",
                            "verse 47:51": "يہ اس لئے کہ انہوں نے ان لوگوں سے کہا جو ا? کي نازل کردہ کتاب کو ناپسند کرتے تھے کہ ہم بعض امور ميں تمہاري پيروي کريں گے، اور ا? ان کے خفيہ مشورہ کرنے کو خوب جانتا ہےo",
                            "verse 47:52": "یہ اس لئے کہ جو لوگ خدا کی اُتاری ہوئی (کتاب) سے بیزار ہیں یہ ان سے کہتے ہیں کہ بعض کاموں میں ہم تمہاری بات بھی مانیں گے۔ اور خدا ان کے پوشیدہ مشوروں سے واقف ہے",
                            "verse 47:53": "تو اُس وقت (ان کا) کیسا (حال) ہوگا جب فرشتے ان کی جان نکالیں گے اور ان کے مونہوں اور پیٹھوں پر مارتے جائیں گے",
                            "verse 47:54": "پھر (اس وقت ان کا حشر) کيسا ہوگا جب فرشتے ان کي جان (اس حال ميں) نکاليں گے کہ ان کے چہروں اور ان کي پيٹھوں پر ضربيں لگاتے ہوں گےo",
                            "verse 47:55": "يہ اس وجہ سے ہے کہ انہوں نے اُس (رَوِش) کي پيروي کي جو ا? کو ناراض کرتي ہے اور انہوں نے اس کي رضا کو ناپسند کيا تو اس نے ان کے (جملہ) اعمال اکارت کر ديئےo",
                            "verse 47:56": "یہ اس لئے کہ جس چیز سے خدا ناخوش ہے یہ اس کے پیچھے چلے اور اس کی خوشنودی کو اچھا نہ سمجھے تو اُس نے بھی ان کے عملوں کو برباد کر دیا",
                            "verse 47:57": "ورة محَمَّد رکوع (۴/۴) کیا وہ لوگ جن کے دلوں میں بیماری ہے یہ خیال کئے ہوئے ہیں کہ خدا ان کے کینوں کو ظاہر نہیں کرے گا؟",
                            "verse 47:58": "کيا وہ لوگ جن کے دلوں ميں (نفاق کي) بيماري ہے يہ گمان کرتے ہيں کہ ا? ان کے کينوں اور عداوتوں کو ہرگز ظاہر نہ فرمائے گاo",
                            "verse 47:59": "اور اگر ہم چاہيں تو آپ کو بلاشبہ وہ (منافق) لوگ (اس طرح) دکھا ديں کہ آپ انہيں ان کے چہروں کي علامت سے ہي پہچان ليں، اور (اسي طرح) يقيناً آپ ان کے اندازِ کلام سے بھي انہيں پہچان ليں گے، اور ا? تمہارے سب اعمال کو (خوب) جانتا ہےo",
                            "verse 47:60": "اور اگر ہم چاہتے تو وہ لوگ تم کو دکھا بھی دیتے اور تم ان کو ان کے چہروں ہی سے پہچان لیتے۔ اور تم انہیں (ان کے) انداز گفتگو ہی سے پہچان لو گے! اور خدا تمہارے اعمال سے واقف ہے",
                            "verse 47:61": "اور ہم تو لوگوں کو آزمائیں گے تاکہ جو تم میں لڑائی کرنے والے اور ثابت قدم رہنے والے ہیں ان کو معلوم کریں۔ اور تمہارے حالات جانچ لیں",
                            "verse 47:62": "اور ہم ضرور تمہاري آزمائش کريں گے يہاں تک کہ تم ميں سے (ثابت قدمي کے ساتھ) جہاد کرنے والوں اور صبر کرنے والوں کو (بھي) ظاہر کر ديں اور تمہاري (منافقانہ بزدلي کي مخفي) خبريں (بھي) ظاہر کر ديںo",
                            "verse 47:63": "بيشک جن لوگوں نے کفر کيا اور (لوگوں کو) ا? کي راہ سے روکا اور رسول (صلي اللہ عليہ وآلہ وسلم) کي مخالفت (اور ان سے جدائي کي راہ اختيار) کي اس کے بعد کہ ان پر ہدايت (يعني عظمتِ رسول صلي اللہ عليہ وآلہ وسلم کي معرفت) واضح ہو چکي تھي وہ اللہ کا ہرگز کچھ نقصان نہيں کر سکيں گے (يعني رسول صلي اللہ عليہ وآلہ وسلم کي قدر و منزلت کو گھٹا نہيں سکيں گے)،? اور ا? ان کے (سارے) اعمال کو (مخالفتِ رسول صلي اللہ عليہ وآلہ وسلم کے باعث) نيست و نابود کر دے گاo? تمام ائمہ تفسير نے لکھا ہے: (لَن يَضُرُوا اللّہَ شَيْئًا) أي: لن يضرّوا رسولَ ا? صلي اللہ عليہ وآلہ وسلم بمشاقتہ و حذف المضاف لتعظيم شانہ? ملاحظہ فرمائيں: الطبري، البيضاوي، روح المعاني، روح البيان، الجمل، البحر المديد وغيرہ? اس اُسلوبِ کلام کي مثاليں قرآن مجيد ميں بہت ہيں جن ميں سے ايک سور? البقر? کي آيت نمبر 9 (يُخ?دِعُوْنَ ا?َ وَالَّذِيْنَ ا?مَنُوْا) ہے? اس مقام پر يخ?دعون ا? (وہ اللہ کو دھوکہ دينا چاہتے ہيں) کہہ کر مراد يُخ?دِعُونَ رَسُولَ ا?ِ (وہ اللہ کے رسول صلي اللہ عليہ وآلہ وسلم کو دھوکہ دينا چاہتے ہيں) ليا گيا ہے?",
                            "verse 47:64": "جن لوگوں کو سیدھا رستہ معلوم ہوگیا (اور) پھر بھی انہوں نے کفر کیا اور (لوگوں کو) خدا کی راہ سے روکا اور پیغمبر کی مخالفت کی وہ خدا کا کچھ بھی بگاڑ نہیں سکیں گے۔ اور خدا ان کا سب کیا کرایا اکارت کردے گا",
                            "verse 47:65": "مومنو! خدا کا ارشاد مانو اور پیغمبر کی فرمانبرداری کرو اور اپنے عملوں کو ضائع نہ ہونے دو",
                            "verse 47:66": "اے ايمان والو! تم ا? کي اطاعت کيا کرو اور رسول (صلي اللہ عليہ وآلہ وسلم) کي اطاعت کيا کرو اور اپنے اعمال برباد مت کروo",
                            "verse 47:67": "بيشک جن لوگوں نے کفر کيا اور (لوگوں کو) ا? کي راہ سے روکا پھر اس حال ميں مر گئے کہ وہ کافر تھے تو ا? انہيں کبھي نہ بخشے گاo",
                            "verse 47:68": "جو لوگ کافر ہوئے اور خدا کے رستے سے روکتے رہے پھر کافر ہی مرگئے خدا ان کو ہرگز نہیں بخشے گا",
                            "verse 47:69": "تو تم ہمت نہ ہارو اور (دشمنوں کو) صلح کی طرف نہ بلاؤ۔ اور تم تو غالب ہو۔ اور خدا تمہارے ساتھ ہے وہ ہرگز تمہارے اعمال کو کم (اور گم) نہیں کرے گا",
                            "verse 47:70": "(اے مومنو!) پس تم ہمت نہ ہارو اور ان (متحارب کافروں) سے صلح کي درخواست نہ کرو (کہيں تمہاري کمزوري ظاہر نہ ہو)، اور تم ہي غالب رہو گے، اور ا? تمہارے ساتھ ہے اور وہ تمہارے اعمال (کا ثواب) ہرگز کم نہ کرے گاo",
                            "verse 47:71": "بس دنيا کي زندگي تو محض کھيل اور تماشا ہے، اور اگر تم ايمان لے آؤ اور تقو?ي اختيار کرو تو وہ تمہيں تمہارے (اعمال پر کامل) ثواب عطا فرمائے گا اور تم سے تمہارے مال طلب نہيں کرے گاo",
                            "verse 47:72": "دنیا کی زندگی تو محض کھیل اور تماشا ہے۔ اور اگر تم ایمان لاؤ گے اور پرہیزگاری کرو گے تو وہ تم کو تمہارا اجر دے گا۔ اور تم سے تمہارا مال طلب نہیں کرے گا",
                            "verse 47:73": "اگر وہ تم سے مال طلب کرے اور تمہیں تنگ کرے تو تم بخل کرنے لگو اور وہ (بخل) تمہاری بدنیتی ظاہر کرکے رہے",
                            "verse 47:74": "اگر وہ تم سے اس مال کو طلب کر لے پھر تمہيں طلب ميں تنگي دے تو تمہيں (دل ميں) تنگي محسوس ہوگي (اور) تم بخل کرو گے اور (اس طرح) وہ تمہارے (دنيا پرستي کے باعث باطني) زنگ ظاہر کر دے گاo",
                            "verse 47:75": "ياد رکھو! تم وہ لوگ ہو جنہيں ا? کي راہ ميں خرچ کرنے کے لئے بلايا جاتا ہے تو تم ميں سے بعض ايسے بھي ہيں جو بُخل کرتے ہيں، اور جو کوئي بھي بُخل کرتا ہے وہ محض اپني جان ہي سے بخل کرتا ہے، اور ا? بے نياز ہے اور تم (سب) محتاج ہو، اور اگر تم (حکمِ ال?ہي سے) رُوگرداني کرو گے تو وہ تمہاري جگہ بدل کر دوسري قوم کو لے آئے گا پھر وہ تمہارے جيسے نہ ہوں گےo",
                            "verse 47:76": "دیکھو تم وہ لوگ ہو کہ خدا کی راہ میں خرچ کرنے کے لئے بلائے جاتے ہو۔ تو تم میں ایسے شخص بھی ہیں جو بخل کرنے لگتے ہیں۔ اور جو بخل کرتا ہے اپنے آپ سے بخل کرتا ہے۔ اور خدا بینیاز ہے اور تم محتاج۔ اور اگر تم منہ پھیرو گے تو وہ تمہاری جگہ اور لوگوں کو لے آئے گا اور وہ تمہاری طرح کے نہیں ہوں گے گےo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 47:1": "Куфр келтирган ва Аллоҳнинг йўлидан тўсганларнинг амалларини У зот ботил қилди.",
                            "verse 47:2": "У зот иймон келтирган, солиҳ амалларни қилган ва Муҳаммадга нозил қилинган нарса(Қуръон)га–ҳолбуки у Роббиларидан келган ҳақдир–иймон келтирганларнинг айбларини беркитур ва аҳволларини яхшилар.",
                            "verse 47:3": "Ундоқ бўлишига, албатта, куфр келтирганларнинг ботилга эргашганлари ва иймон келтирганларнинг Роббиларидан бўлган ҳаққа эргашганликлари сабабдир.",
                            "verse 47:4": "Қачонки куфр келтирганлар билан тўқнашсангиз, бас, бўйинига урмоқ керак.",
                            "verse 47:5": "Албатта, уларни ҳидоят қилар ва аҳволларни яхшилар.",
                            "verse 47:6": "Ҳамда Ўзи уларга таърифлаб берган жаннатга киритар.",
                            "verse 47:7": "Эй иймон келтирганлар! Агар Аллоҳга ёрдам берсангиз, сизга ҳам ёрдам берадир ва қадамларингизни собит қиладир.",
                            "verse 47:8": "Ва куфр келтирганларга бахтсизлик ва амалларини зое қилиш бўлур.",
                            "verse 47:9": "Бу уларнинг Аллоҳ нозил қилган нарсани хуш кўрмаганлари сабабидандир.",
                            "verse 47:10": "Ер юзида юриб, ўзларидан аввалгиларнинг оқибати қандоқ бўлганлигига назар солмасларми? Аллоҳ уларни вайрон қилди-ку! Кофирларга ҳам шунга ўхшаш бўлур.",
                            "verse 47:11": "Шундоқ бўлиши, албатта, Аллоҳ иймон келтирганларга дўст эканлигидан ва албатта, кофирларга дўст йўқлигидандир.",
                            "verse 47:12": "Албатта, Аллоҳ иймон келтирганлар ва яхши амал қилганларни тагидан анҳорлар оқиб турган жаннатларга киритур.",
                            "verse 47:13": "Кўпгина шаҳарлар сени чиқарган шаҳарингдан кўра қувватлироқ эди, уларни ҳалок қилдик.",
                            "verse 47:14": "Ўз Роббисидан (аниқ) ҳужжатга эга бўлган шахс ёмон амали ўзига зийнатли кўринган ва ҳавои нафсига эргашганларга ўхшаши мумкинми?!",
                            "verse 47:15": "Тақводорларга ваъда қилинган жаннатнинг мисоли: ичида айнимаган сувли анҳорлари, таъми ўзгармаган сутли анҳорлари, ичувчиларга лаззатбахш хамр-шаробли анҳорлари, мусаффо асалли анҳорлари бор.",
                            "verse 47:16": "Ва улардан сенга қулоқ осадиганлари бор.",
                            "verse 47:17": "У зот ҳидоят топганларнинг ҳидоятини зиёда қилгай ва уларнинг тақволарини бергай.",
                            "verse 47:18": "Улар (қиёмат) соатининг бирдан келишидан бошқа нарсага интизор бўлишаётгани йўқ.",
                            "verse 47:19": "Бас, билгин: Аллоҳдан ўзга ибодатга сазовор зот йўқ, ўзингнинг, мўминларнинг ва мўминаларнинг гуноҳларини мағфират қилинишини сўра.",
                            "verse 47:20": "Ва иймон келтирганлар, бирон сура нозил қилинса эди, дерлар.",
                            "verse 47:21": "Уларга тоат ва яхши сўз яхшироқдир, бас, иш жиддийлашганда, Аллоҳга содиқ қолсалар, ўзларига яхши бўлур эди.",
                            "verse 47:22": "Эҳтимол, (иймондан) юз ўгирсангиз, ер юзида фасод қилиб, қардошлик ришталарини узарсиз?! (Бу оятда иймондан юз ўгириб, жоҳилиятга қайтишдан келадиган бу дунёдаги зарарлар эслатилмоқда.",
                            "verse 47:23": "Ана ўшаларни Аллоҳ лаънатлади, уларни кар қилди ва кўзларини кўр қилди.",
                            "verse 47:24": "Қуръонни тадаббур ила ўйлаб кўрмасларми? Ёки қалбларида қулф борми? (Ҳар бир оятни, ҳар бир сўзни чуқур тушунишга ҳаракат қилиш Қуръонни тадаббур қилишдир.",
                            "verse 47:25": "Албатта,ҳидоят равшан бўлгандан сўнг ортларига қайтганларга шайтон зийнатлаб кўрсатди ва уларни ўша йўллади.",
                            "verse 47:26": "Ундоқ бўлишлиги, албатта, уларнинг Аллоҳ нозил қилган нарсани хуш кўрмаганларга: »Сизларга баъзи ишларда итоат қиламиз», дейишлари сабабидандир.",
                            "verse 47:27": "Фаришталар юзларига ва ортларига уриб жонларини олаётганларида қандоқ бўларкин?!",
                            "verse 47:28": "Бундай бўлиши, албатта уларнинг Аллоҳни ғазаблантирган нарсага эргашганлари ва Унинг розилигини хуш кўрмаганликлари сабабидандир.",
                            "verse 47:29": "Қалбларида касал борлар, Аллоҳ уларнинг қаттиқ ҳасадларини ошкор қилмайди, деб ҳисоблайдиларми?! (Мунофиқлар ўзларича, мунофиқлик санъатини қоиллатиб қўямиз, бизнинг Исломга, мусулмонларга бўлган душманлигимизни ҳеч ким билмайди, деб ўйлашади.",
                            "verse 47:30": "Агар хоҳласак, Биз уларни сенга кўрсатамиз, таъкидки, сен уларни сиймоларидан танийсан, албатта, сен уларни гап оҳангларидан танийсан.",
                            "verse 47:31": "Ва таъкидки, Биз сизларни синаймиз, токи сизлардан мужоҳидларни, сабрлиларни билсак ва хабарларингизни имтиҳон этсак.",
                            "verse 47:32": "Албатта, куфр келтирганлар ва Аллоҳнинг йўлидан тўсганлар ҳамда ҳидоят аниқ бўлгандан сўнг Пайғамбарга қарши чиққанлар Аллоҳга ҳеч зарар келтира олмаслар.",
                            "verse 47:33": "Эй иймон келтирганлар! Аллоҳга итоат этинг ва Расулга итоат этинг.",
                            "verse 47:34": "Албатта куфр келтирганлар ва Аллоҳнинг йўлидан тўсган, сўнгра кофир ҳолларида ўлганларни Аллоҳ ҳеч-ҳеч мағфират қилмас.",
                            "verse 47:35": "Бас, бўш келманглар ва ўзингиз устун бўлиб туриб, ярашга чақирманглар.",
                            "verse 47:36": "Албатта, бу дунё ҳаёти ўйин ва кўнгил хушидир ва гар иймон келтирсангиз ва тақво қилсангиз, У зот ажрларингизни берур ва молу дунёларингизни сўрамас.",
                            "verse 47:37": "Агар сиздан уларни сўраса, қийнаса, бахиллик қилурсизлар ва кек-ҳиқдларингизни чиқарадир.",
                            "verse 47:38": "Ҳой сизлар! Анавилар! Аллоҳнинг йўлида нафақа қилишга чақирилсангиз, бас, баъзиларингиз бахиллик қилурсизлар."
                        }
                    }
                }
            }
        }
    }
}