{
    "id": 49,
    "name_simple": "Al-Hujurat",
    "revelation_place": "madinah",
    "revelation_order": 106,
    "bismillah_pre": true,
    "verses_count": 18,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah takes its name from verse 4 in which the word hujurat has occurred.",
    "text": [
        "\n",
        "The Surah takes its name from verse 4 in which the word hujurat has occurred.",
        "\n",
        "Period of Revelation",
        "\n",
        "Traditions show and the subject matter of the Surah also supports the same that this Surah is a collection of the commandments and instructions sent down on different occasions, which have been put together because of the relevancy of the theme. Moreover, the traditions also show that most of these commandments were sent down during the final stage of the Holy Prophet's life at Madinah. For instance, about verse 4 the commentators state that it was sent down concerning the Bani Tamim whose deputation had arrived in Madinah and started calling out to the Holy Prophet from outside the apartments (hujurat) of his wives, and according to all biographical books on the Holy Prophet's life this deputation had visited Madinah in A. H. 9. Likewise, about verse 6 a large number of the traditions of Hadith confirm that it was sent down concerning Walid bin Uqbah whom the Holy Prophet had sent to collect the zakat from the Bani al-Mustaliq, and it is well known that Walid\r\nbin Uqabah had become a Muslim on the conquest of Makkah.",
        "\n",
        "Subject Matter and Topics",
        "\n",
        "The subject matter of this Surah is to teach the Muslims the manners worthy of true believers.",
        "\n",
        "In the first five verses they have been taught the manners they should observe with regard to Allah and His Messenger.",
        "\n",
        "Then, they have been given the instruction that it is not right to believe in every news blindly and to act according to it, without due thought. If information is received about a person, a group or a community, it should be seen carefully whether the means of the information is reliable or not. If the means is not reliable, it should be tested and examined to see whether the news is authentic or not before taking any action on it.",
        "\n",
        "Then, it has been told what attitude should the other Muslims adopt in case two groups of the Muslims fall to mutual fighting.",
        "\n",
        "Then the Muslims have been exhorted to safeguard against the evils that corrupt collective life and spoil mutual relationships. Mocking and taunting each other, calling others by nicknames, creating suspicions, prying into other people's affairs and back biting are the evils which are not only sins in themselves but they also corrupt society. Allah has mentioned all these evils separately and forbidden them as unlawful.",
        "\n",
        "After this, the national and racial distinctions that cause universal corruption in the world have been condemned. Nations and tribes and families pride of Ancestry and their looking down upon others as inferior to themselves and their pulling down others only for the sake of establishing their own superiority is an important factor that has filled the world with injustices and tyranny. Allah in a brief verse has cut at the root of this evil by stating that all men are descendants of the same one pair and their division into tribes and communities is only for the sake of recognition, not for boasting and pride, and there is no lawful basis of one man's superiority over the other except on the basis of moral excellence.",
        "\n",
        "In conclusion, the people have been told that the real thing is not the verbal Profession of the Faith but to believe in Allah and His messenger truly, to obey them in practical life and to exert sincerely with one's self and wealth in the cause of Allah. True believers are only those who adopt this attitude. As for those who profess Islam merely orally without affirmation by the heart and then adopt an attitude as if they had done someone a favor by accepting Islam, may be counted among the Muslims in the world, may even be treated as Muslims in society, but they cannot be counted as believers in the sight of Allah.",
        "\n"
    ],
    "description": "The surah that criticized as ill-mannered and uncouth those who would stand behind the Apartments of the Prophet’s wives and call him forth for discourse with raised voices. It takes its name from the word “apartments” (ḥujurāt) in verse 4. The surah guides the believers on how to behave with proper respect towards their leader (verse 1 .), and with mutual respect and trust towards each other (verse 9 .). It stresses the unity of mankind and God’s intention that people should live together in harmony (verse 13). It criticizes the desert Arabs for their presumptuous attitude to their faith and to God (verse 14 .).The surah is also known as: The (Inner) Apartments, The Chambers, The Inner Apartments, The Private Quarters, The Private Rooms.",
    "name_translation": "APARTMENTS",
    "name_complex": "Al-Hujurât",
    "surah_name_ar": "الحجرات",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 49:1": "O ju që keni besuar! Mos nxitoi para urdhërit (dispozitës) së Perëndisë dhe Pejgamberit të Tij dhe druani Perëndisë! Perëndia, me të vërtetë, i dëgjon të gjitha dhe i di të gjitha.",
                            "verse 49:2": "O ju që keni besuar! Mos ngritni zërin tuaj mbi zërin e Pejgamberit dhe mos bisedoni me të me zë të lartë, ashtu si flitni zëshëm njëri me tjetrin, në mëhyrë që mos t’u humbin veprat tuaja – e që ju të mos i hetoni.",
                            "verse 49:3": "Me të vërtetë, ata që ulin zërin para (në prezencën e) Pejgamberit të Perëndisë – e ata janë (ata), zemrat e të cilëve Perëndia i ka kalitur për besim.",
                            "verse 49:4": "Me të vërtetë, ata që të thërrasin ty pas (mureve) të dhomave (tuaja), shumica e tyre nuk mendojnë.",
                            "verse 49:5": "E sikur të durojnë ata deri sa t’ju dalish ti atyre, do të ishte më mirë për ta; e Perëndia ësht falës dhe mëshirues.",
                            "verse 49:6": "O ju që keni besuar! Nëse ndonjë njeri i pandershëm ju sjell ndonjë lajm, analizoni mirë, për të mos i bërë dëm ndokujt nga mosdijenia, e të pendoheni pastaj për atë që keni punuar.",
                            "verse 49:7": "Dhe, dijeni se në mes jush gjendet Pejgamberi i Perëndisë; sikur ai t’ju dëgjonte juve në shumë gjëra, ju do të kishit pësuar; por Perëndia disave prej jush ua ka bërë të këndshëm besimin dhe ua ka zbukuruar atë në zemrat tuaja, e ua ka urryer juve mohimin, ngatërresat dhe mëkatet.",
                            "verse 49:8": "me mirësinë dhe dhuntinë e Perëndisë.",
                            "verse 49:9": "Nëse dy grupe muslimanësh luftojnë në mes vete, pajtoni ata, e nëse njëra prej tyre sulmon atë tjetrën, atëherë luftoni kundër sulmuesit, përderisa të mos kthehet në dispozitat e Perëndisë.",
                            "verse 49:10": "Me të vërtetë, muslimanët janë vëllezër, andaj pajtoni vëllezërit tuaj në mes vete dhe druajuni Perëndisë, për t’u mëshiruar ju.",
                            "verse 49:11": "O ju që keni besuar! Le të mos e përqeshin një popull atë tjetrin.",
                            "verse 49:12": "O ju që keni besuar! Shmanguni prej shumë dyshimeve, meqë disa dyshime janë mëkat.",
                            "verse 49:13": "O njerëz! Ne, me të vërtetë, u krijuam juve prej një mashkulli dhe një femre dhe u bëmë juve popuj dhe fise, për t’u njohur (në mes vete).",
                            "verse 49:14": "Beduinët (arabët e shkretëtirës) thanë: “Na besojmë”.",
                            "verse 49:15": "Besimtarë të vërtetë janë vetëm ata që besojnë Perëndinë dhe Pejgamberin e Tij, dhe pastja nuk dyshojnë dhe luftojnë në rrugën e Perëndisë me pasurinë dhe jetën e tyre.",
                            "verse 49:16": "Thuaju (atyre): “Vallë, a ju ta lajmëroni Perëndinë për besimin tuaj, e Perëndia i di të gjitha çka ka në qiej dhe në Tokë! Perëndia është i dijshëm për çdo gjë.",
                            "verse 49:17": "Ata të përkujtojnë ty, (mirësitë), ngase kanë pranuar islamizmin.",
                            "verse 49:18": "Perëndia, me të vërtetë; i di fshehtësitë e qiejve dhe Tokës."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "Ey iman gətirənlər! (Sözləriniz, iş və hərəkətlərinizdə) Allahdan və Peyğəmbərindən önə keçməyin.",
                            "verse 49:2": "Ey iman gətirənlər! Səsinizi Peyğəmbərin səsindən artıq qaldırmayın və bir-birinizlə ucadan danışdığınız kimi onunla ucadan danışmayın! Yoxsa, özünüz də bilmədən, əməlləriniz puç olar.",
                            "verse 49:3": "Həqiqətən, Allahın Peyğəmbəri yanında astadan danışanlar (səslərini asta çıxardanlar) o kimsələrdir ki, Allah onların ürəklərini təqva üçün imtahana çəkmişdir (mö'minliyə layiq etmişdir).",
                            "verse 49:4": "(Ya Peyğəmbər!) Şübhəsiz ki, səni otaqların arxasından çağıranların çoxusunun ağlı kəsmir!",
                            "verse 49:5": "Əgər onlar sən qarşılarına çıxancaya qədər səbr etsəydilər, (bu, Allahın yanında) onlar üçün, əlbəttə, daha yaxşı olardı.",
                            "verse 49:6": "Ey iman gətirənlər! Əgər bir fasiq sizə (pis) bir xəbər gətirsə, dərhal (onun doğruluğunu) yoxlayın, yoxsa bilmədən bir qövmə pislik edər, sonra da etdiyinizə peşman olarsınız!",
                            "verse 49:7": "(Ey iman gətirənlər!) Bilin ki, aranızda Allahın Peyğəmbəri vardır.",
                            "verse 49:8": "Bu isə Allah dərgahından olan lütf və ne'mət sayəsindədir.",
                            "verse 49:9": "Əgər mö'minlərdən iki dəstə bir-biri ilə vuruşsa, onları dərhal barışdırın.",
                            "verse 49:10": "Həqiqətən, mö'minlər (dində) qardaşdırlar.",
                            "verse 49:11": "Ey iman gətirənlər! Bir qövm digərini lağa qoymasın.",
                            "verse 49:12": "Ey iman gətirənlər! Cox zənnə-gümana qapılmaqdan çəkinin.",
                            "verse 49:13": "Ey insanlar! Biz sizi bir kişi və bir qadından (Adəm və Həvvadan) yaratdıq.",
                            "verse 49:14": "(Qənimət əldə etmək iştahası ilə islama daxil olan) bədəvi ərəblər: \"Biz iman gətirdik!\" - dedilər.",
                            "verse 49:15": "Mö'minlər yalnız Allaha və Peyğəmbərinə iman gətirən, (iman gətirdikdən) sonra heç bir şəkk-şübhəyə düşməyən, Allah yolunda malları və canları ilə vuruşanlardır! Məhz belələri (imanlarında) sadiq olanlardır!",
                            "verse 49:16": "(Ya Peyğəmbər! Bu bədəvilərə) de: \"Siz dininizi (həqiqi müsəlman olduğunuzu) Allahamı öyrədirsiniz?\" Halbuki Allah göylərdə və yerdə nə varsa, (hamısını) bilir.",
                            "verse 49:17": "Onlar islamı qəbul etdiklərinə görə sənə minnət qoyurlar.",
                            "verse 49:18": "Şübhəsiz ki, Allah göylərin və yerin qeybini (gözə görünməyən sirlərini) bilir."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "O vjernici, ne odlučujte se ni za što dok za to ne upitate Allaha i Poslanika Njegova, i bojte se Allaha! Allah, zaista, sve čuje i sve zna.",
                            "verse 49:2": "O vjernici, ne dižite glasove svoje iznad Vjerovjesnikova glasa i ne razgovarajte s njima glasno, kao što glasno jedan s drugim razgovarate, da ne bi bila poništena vaša djela, a da vi i ne primijetite.",
                            "verse 49:3": "One koji utišaju glasove svoje pred Allahovim Poslanikom - a to su oni čija je srca Allah prekalio u čestitosti - čeka oprost i nagrada velika.",
                            "verse 49:4": "Većina onih koji te dozivaju ispred soba nije dovoljno pametna.",
                            "verse 49:5": "A da su se oni strpjeli dok im ti sam iziđeš, bilo bi im bolje, a Allah prašta i samilostan je.",
                            "verse 49:6": "O vjernici, ako vam nekakav nepošten čovjek donese kakvu vijest, dobro je provjerite, da u nezananju nekome zlo ne učinite, pa da se zbog onoga što ste učinili pokajete.",
                            "verse 49:7": "I znajte da je među vama Allahov Poslanik; kad bi vas u mnogo čemu poslušao, doista biste nastradali; ali Allah je nekima od vas pravo vjerovanje omilio, i u srcima vašim ga lijepim prikazao, a nezahvalnost i neposlušnost vam omra",
                            "verse 49:8": "dobrotom i blagodati Allahovom.",
                            "verse 49:9": "Ako se dvije skupine vjernika sukobe, izmirite ih; a ako jedna od njih ipak učini nasilje drugoj, onda se borite protiv one koja je učinila nasilje sve dok se Allahovim propisima ne prikloni.",
                            "verse 49:10": "Vjernici su samo braća, zato pomirite vaša dva brata i bojte se Allaha, da bi vam se milost ukazala.",
                            "verse 49:11": "O vjernici, neka se muškarci jedni rugima ne rugaju, možda su oni bolji od njih, a ni žene drugim ženama, možda su one bolje od njih.",
                            "verse 49:12": "O vjernici, klonite se mnogih sumnjičenja, neka sumnjičenja su, zaista, grijeh.",
                            "verse 49:13": "O ljudi, Mi vas od jednog čovjeka i jedne žene stvaramo i na narode i plemena vas dijelimo da biste se upoznali.",
                            "verse 49:14": "Neki beduini govore: \"Mi vjerujemo!\" Reci: \"Vi ne vjerujete, ali recite: ’Mi se pokoravamo!’, jer u srca vaša prava vjera još nije ušla.",
                            "verse 49:15": "Pravi vjernici su samo oni koji u Allaha i Poslanika Njegova vjeruju, i poslije više ne sumnjaju, i bore se na Allahovom putu imecima svojim i životima svojim.",
                            "verse 49:16": "Reci: \"Zar vi da obavještavate Allaha o vjerovanju svome, kad Allah zna sve što je na nebesima i na Zemlji! Allah sve zna.",
                            "verse 49:17": "Oni ti prebacuju što su primili islam.",
                            "verse 49:18": "Allah, sigurno, zna tajne nebesa i Zemlje i Allah dobro vidi ono što radite."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "মুমিনগণ! তোমরা আল্লাহ ও রসূলের সামনে অগ্রণী হয়ো না এবং আল্লাহকে ভয় কর। নিশ্চয় আল্লাহ সবকিছু শুনেন ও জানেন।",
                            "verse 49:2": "মুমিনগণ! তোমরা নবীর কন্ঠস্বরের উপর তোমাদের কন্ঠস্বর উঁচু করো না এবং তোমরা একে অপরের সাথে যেরূপ উঁচুস্বরে কথা বল, তাঁর সাথে সেরূপ উঁচুস্বরে কথা বলো না। এতে তোমাদের কর্ম নিস্ফল হয়ে যাবে এবং তোমরা টেরও পাবে না।",
                            "verse 49:3": "যারা আল্লাহর রসূলের সামনে নিজেদের কন্ঠস্বর নীচু করে, আল্লাহ তাদের অন্তরকে শিষ্টাচারের জন্যে শোধিত করেছেন। তাদের জন্যে রয়েছে ক্ষমা ও মহাপুরস্কার।",
                            "verse 49:4": "যারা প্রাচীরের আড়াল থেকে আপনাকে উচুস্বরে ডাকে, তাদের অধিকাংশই অবুঝ।",
                            "verse 49:5": "যদি তারা আপনার বের হয়ে তাদের কাছে আসা পর্যন্ত সবর করত, তবে তা-ই তাদের জন্যে মঙ্গলজনক হত। আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
                            "verse 49:6": "মুমিনগণ! যদি কোন পাপাচারী ব্যক্তি তোমাদের কাছে কোন সংবাদ আনয়ন করে, তবে তোমরা পরীক্ষা করে দেখবে, যাতে অজ্ঞতাবশতঃ তোমরা কোন সম্প্রদায়ের ক্ষতিসাধনে প্রবৃত্ত না হও এবং পরে নিজেদের কৃতকর্মের জন্যে অনুতপ্ত না হও।",
                            "verse 49:7": "তোমরা জেনে রাখ তোমাদের মধ্যে আল্লাহর রসূল রয়েছেন। তিনি যদি অনেক বিষয়ে তোমাদের আবদার মেনে নেন, তবে তোমরাই কষ্ট পাবে। কিন্তু আল্লাহ তোমাদের অন্তরে ঈমানের মহব্বত সৃষ্টি করে দিয়েছেন এবং তা হৃদয়গ্রাহী করে দিয়েছেন। পক্ষান্তরে কুফর, পাপাচার ও নাফরমানীর প্রতি ঘৃণা সৃষ্টি করে দিয়েছেন। তারাই সৎপথ অবলম্বনকারী।",
                            "verse 49:8": "এটা আল্লাহর কৃপা ও নিয়ামতঃ আল্লাহ সর্বজ্ঞ প্রজ্ঞাময়।",
                            "verse 49:9": "যদি মুমিনদের দুই দল যুদ্ধে লিপ্ত হয়ে পড়ে, তবে তোমরা তাদের মধ্যে মীমাংসা করে দিবে। অতঃপর যদি তাদের একদল অপর দলের উপর চড়াও হয়, তবে তোমরা আক্রমণকারী দলের বিরুদ্ধে যুদ্ধ করবে; যে পর্যন্ত না তারা আল্লাহর নির্দেশের দিকে ফিরে আসে। যদি ফিরে আসে, তবে তোমরা তাদের মধ্যে ন্যায়ানুগ পন্থায় মীমাংসা করে দিবে এবং ইনছাফ করবে। নিশ্চয় আল্লাহ ইনছাফকারীদেরকে পছন্দ করেন।",
                            "verse 49:10": "মুমিনরা তো পরস্পর ভাই-ভাই। অতএব, তোমরা তোমাদের দুই ভাইয়ের মধ্যে মীমাংসা করবে এবং আল্লাহকে ভয় করবে-যাতে তোমরা অনুগ্রহপ্রাপ্ত হও।",
                            "verse 49:11": "মুমিনগণ, কেউ যেন অপর কাউকে উপহাস না করে। কেননা, সে উপহাসকারী অপেক্ষা উত্তম হতে পারে এবং কোন নারী অপর নারীকেও যেন উপহাস না করে। কেননা, সে উপহাসকারিণী অপেক্ষা শ্রেষ্ঠ হতে পারে। তোমরা একে অপরের প্রতি দোষারোপ করো না এবং একে অপরকে মন্দ নামে ডেকো না। কেউ বিশ্বাস স্থাপন করলে তাদের মন্দ নামে ডাকা গোনাহ। যারা এহেন কাজ থেকে তওবা না করে তারাই যালেম।",
                            "verse 49:12": "মুমিনগণ, তোমরা অনেক ধারণা থেকে বেঁচে থাক। নিশ্চয় কতক ধারণা গোনাহ। এবং গোপনীয় বিষয় সন্ধান করো না। তোমাদের কেউ যেন কারও পশ্চাতে নিন্দা না করে। তোমাদের কেউ কি তারা মৃত ভ্রাতার মাংস ভক্ষণ করা পছন্দ করবে? বস্তুতঃ তোমরা তো একে ঘৃণাই কর। আল্লাহকে ভয় কর। নিশ্চয় আল্লাহ তওবা কবুলকারী, পরম দয়ালু।",
                            "verse 49:13": "হে মানব, আমি তোমাদেরকে এক পুরুষ ও এক নারী থেকে সৃষ্টি করেছি এবং তোমাদেরকে বিভিন্ন জাতি ও গোত্রে বিভক্ত করেছি, যাতে তোমরা পরস্পরে পরিচিতি হও। নিশ্চয় আল্লাহর কাছে সে-ই সর্বাধিক সম্ভ্রান্ত যে সর্বাধিক পরহেযগার। নিশ্চয় আল্লাহ সর্বজ্ঞ, সবকিছুর খবর রাখেন।",
                            "verse 49:14": "মরুবাসীরা বলেঃ আমরা বিশ্বাস স্থাপন করেছি। বলুনঃ তোমরা বিশ্বাস স্থাপন করনি; বরং বল, আমরা বশ্যতা স্বীকার করেছি। এখনও তোমাদের অন্তরে বিশ্বাস জন্মেনি। যদি তোমরা আল্লাহ ও তাঁর রসূলের আনুগত্য কর, তবে তোমাদের কর্ম বিন্দুমাত্রও নিস্ফল করা হবে না। নিশ্চয়, আল্লাহ ক্ষমাশীল, পরম মেহেরবান।",
                            "verse 49:15": "তারাই মুমিন, যারা আল্লাহ ও তাঁর রসূলের প্রতি ঈমান আনার পর সন্দেহ পোষণ করে না এবং আল্লাহর পথে প্রাণ ও ধন-সম্পদ দ্বারা জেহাদ করে। তারাই সত্যনিষ্ঠ।",
                            "verse 49:16": "বলুনঃ তোমরা কি তোমাদের ধর্ম পরায়ণতা সম্পর্কে আল্লাহকে অবহিত করছ? অথচ আল্লাহ জানেন যা কিছু আছে ভূমন্ডলে এবং যা কিছু আছে নভোমন্ডলে। আল্লাহ সর্ববিষয়ে সম্যক জ্ঞাত।",
                            "verse 49:17": "তারা মুসলমান হয়ে আপনাকে ধন্য করেছে মনে করে। বলুন, তোমরা মুসলমান হয়ে আমাকে ধন্য করেছ মনে করো না। বরং আল্লাহ ঈমানের পথে পরিচালিত করে তোমাদেরকে ধন্য করেছেন, যদি তোমরা সত্যনিষ্ঠ হয়ে থাক।",
                            "verse 49:18": "আল্লাহ নভোমন্ডল ও ভূমন্ডলের অদৃশ্য বিষয় জানেন, তোমরা যা কর আল্লাহ তা দেখেন। থাক।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 49:1": "О, вярващи, не предварвайте Аллах и Неговия Пратеник, и бойте се от Аллах.",
                            "verse 49:2": "О, вярващи, не надигайте глас над гласа на Пророка и не му говорете високо, както говорите помежду си, за да не пропаднат делата ви, без да усетите!",
                            "verse 49:3": "Онези, които снишават глас пред Пратеника на Аллах, те са онези, чиито сърца Аллах е изпитал за богобоязънта.",
                            "verse 49:4": "Онези, които те призовават иззад стаите - повечето от тях не проумяват.",
                            "verse 49:5": "А ако бяха изтърпели, докато им се покажеш, щеше да е най-доброто за тях.",
                            "verse 49:6": "О, вярващи, ако нечестивец ви донесе вест, проучете я, за да не засегнете някои хора от неведение, та за онова, което сте извършили, да съжалявате!",
                            "verse 49:7": "И знайте, че сред вас е Пратеника на Аллах! Ако той се вслушваше във вас за много дела, щяхте да пострадате.",
                            "verse 49:8": "Това е щедрост и благодат от Аллах.",
                            "verse 49:9": "И ако две групи от вярващите се сбият, помирете ги! Но ако едната от тях престъпи спрямо другата, сражавайте се против онази, която е престъпила, докато се върне към повелята на Аллах! А щом се върне, помирете ги справедливо и постъпете безпристрастно! Ал",
                            "verse 49:10": "Вярващите са братя, затова помирявайте своите братя и бойте се от Аллах, за да бъдете помилвани!",
                            "verse 49:11": "О, вярващи, едни мъже от вас да не се присмиват на други! Може да са по-добри от тях.",
                            "verse 49:12": "О, вярващи, много странете от подозрението! Понякога подозрението е грях.",
                            "verse 49:13": "О, хора, Ние ви сътворихме от един мъж и една жена, и ви сторихме народи и племена, за да се опознавате.",
                            "verse 49:14": "Бедуините рекоха: Ние повярвахме.",
                            "verse 49:15": "Вярващи са именно онези, които вярват в Аллах и в Неговия Пратеник, после не се усъмняват и се борят чрез своите имоти и души по пътя на Аллах.",
                            "verse 49:16": "Кажи: Нима Аллах известявате вие за вашата религия, след като Аллах знае всичко на небесата и всичко на земята.",
                            "verse 49:17": "Смятат, че теб облагодетелстват, приемайки Исляма.",
                            "verse 49:18": "Аллах знае неведомото на небесата и на земята."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "信道的人們啊！你們在真主和使者的面前不要先做任何一件事，你們應當敬畏真主；真主確是全聰的，確是全知的。",
                            "verse 49:2": "信道的人們啊！不要使你們的聲音高過先知的聲音，不要對他高聲說話，猶如你們彼此間高聲說話那樣，以免你們的善功變為無效，而你們是不知不覺的。",
                            "verse 49:3": "在真主的使者面前低聲說話的人們，真主確已為敬畏而試驗他們的心，他們將蒙赦宥和重大的報酬。",
                            "verse 49:4": "在寢室後面喊叫你的人們，大半是不明理的。",
                            "verse 49:5": "假若他們忍耐，直到你出去會他們，那對他們是更好的。真主是至赦的，是至慈的。",
                            "verse 49:6": "信道的人們啊！如果一個惡人報告你們一個消息，你們應當弄清楚，以免你們無知地傷害他人，到頭來悔恨自己的行為。",
                            "verse 49:7": "你們應當知道，真主的使者在你們之間，假若他對許多事情都順從你們，你們必陷於苦難。但真主使你們熱愛正信，並在你們的心中修飾它；他使你們覺得迷信、罪惡、放蕩是可惡的；這等人，確是循規蹈矩的。",
                            "verse 49:8": "這是由於真主所降的恩惠和福澤。真主是全知的，是至睿的。",
                            "verse 49:9": "如果兩伙信士相鬥，你們應當居間調停。如果這伙壓迫那伙，你們應當討伐壓迫的這伙，直到他們歸順真主的命令。如果他們歸順，你們應當秉公調停，主持公道；真主確是喜愛公道者的。",
                            "verse 49:10": "信士們皆為教胞，故你們應當排除教胞中的紛爭，你們應敬畏真主，以便你們蒙主的憐恤。",
                            "verse 49:11": "信道的人們啊！你們中的男子，不要互相嘲笑；被嘲笑者，或許勝於嘲笑者。你們中的女子，也不要互相嘲笑；被嘲笑者，或許勝於嘲笑者。你們不要互相誹謗，不要以諢名相稱；信道後再以諢名相稱，這稱呼真惡劣！未悔罪者，是不義的。",
                            "verse 49:12": "信道的人們啊！你們應當遠離許多猜疑；有些猜疑，確是罪過。你們不要互相偵探，不要互相背毀，難道你們中有人喜歡吃他的已死的教胞的肉嗎？你們是厭惡那種行為的。你們應當敬畏真主，真主確是至赦的，確是至慈的。",
                            "verse 49:13": "眾人啊！我確已從一男一女創造你們，我使你們成為許多民族和宗教，以便你們互相認識。在真主看來，你們中最尊貴者，是你們中最敬畏者。真主確是全知的，確是徹知的。",
                            "verse 49:14": "游牧人們曾說：「我們已經信道了。」你說：「你們沒有信道。雖然你們可以說：『我們已歸順了』，但正信還沒有入你們的心。如果你們服從真主和使者，他不減少你們的善功一絲毫。真主確是至赦的，確是至慈的。」",
                            "verse 49:15": "信士，只是確信真主和使者，然後沒有懷疑，能以自己的財產和生命為主道而奮鬥的人；這等人，確是誠實的。",
                            "verse 49:16": "你說：「難道你們以你們的宗教通知真主嗎？真主是知道天地間的一切的，真主是全知萬物的。」",
                            "verse 49:17": "他們以自己信奉伊斯蘭，示惠於你，你說：「你們不要以你們的信奉伊斯蘭示惠於我；不然，真主以引導你們於正信示惠於你們，如果你們是說實話的。」",
                            "verse 49:18": "真主確是知道天地的幽玄的，真主是明察你們的行為的。 他們以自己信奉伊斯蘭，示惠於你，你說：「你們不要以你們的信奉伊斯蘭示惠於我；不然，真主以引導你們於正信示惠於你們，如果你們是說實話的。」"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "Vy, kteří věříte! Nesnažte se předejít Boha a posla jeho! Buďte bohabojní, vždyť Bůh věru je slyšící, vševědoucí!",
                            "verse 49:2": "Vy, kteří věříte! Nezvedejte hlas svůj nad hlas prorokův a neobracejte se k němu s řečí hlučnou, tak jak to děláte mezi sebou, aby se skutky vaše nestaly marnými, aniž o tom budete mít tušení.",
                            "verse 49:3": "Věru ti, kdož snižují hlasy své před poslem Božím jsou ti, jejichž srdce Bůh podrobil zkoušce bohabojnosti a těm náleží odměna nesmírná a odpuštění.",
                            "verse 49:4": "Avšak většina z těch, kdož tě hlasitě vyvolávají z komnat tvých, jsou lidé nerozumní.",
                            "verse 49:5": "Kdyby trpělivě vyčkali, dokud k nim nevyjdeš, bylo by to pro ně lepší; a Bůh je odpouštějící, slitovný.",
                            "verse 49:6": "Vy, kteří věříte! Přijde-li k vám hanebník s nějakou zvěstí, snažte se ji objasnit tak, abyste z nevědomosti své nepoškodili lidi a abyste nemusili litovat toho, co jste učinili.",
                            "verse 49:7": "Vězte, že kdyby posel Boží, který mezi vámi dlí, vás uposlechl ve většině záležitostí, věru byste škodu utrpěli! Avšak Bůh způsobil, že milujete víru, a učinil ji krásnou v srdcích vašich, zatímco vám zošklivil nevěrectví, hanebnosti a neposlušnost.",
                            "verse 49:8": "díky laskavosti a dobrodiní Božímu.",
                            "verse 49:9": "Bojují-li mezi sebou dvě skupiny věřících, usmiřte je! A činí-li jedna skupina z těch dvou bezpráví druhé, bojujte proti těm, kdo činí bezpráví, dokud se před rozkazem Božím neskloní! A když se skloní, usmiřte obě strany spravedlivě a buďte nestranní, neboť Bůh věru miluje ty, kdož jsou nestranní!",
                            "verse 49:10": "Věřící jsou si přece bratry; usmiřujte tedy oba bratry své a buďte bohabojní - snad dostane se vám smilování!",
                            "verse 49:11": "Vy, kteří věříte! Nechť neposmívají se jedni lidé druhým, možná že tito jsou lepší než oni! A nechť jedny ženy se neposmívají druhým, možná že tyto jsou lepší než ony! Neurážejte se vzájemně a nenazývejte se přezdívkami! A jak hnusný je název \"hanebník\" poté, co byla přijata víra! A ti, kdož se nebudou kát, jsou věru nespravedliví!",
                            "verse 49:12": "Vy, kteří věříte! Střezte se přílišného podezřívání druhých, vždyť některá podezření jsou hříchem! Nevyzvídejte a nepomlouvejte se vzájemně! Což si někdo z vás přeje jíst maso bratra svého mrtvého - vždyť by vám to bylo odporné! Buďte bohabojní, neboť Bůh věru je blahovolný ke kajícníku a slitovný.",
                            "verse 49:13": "Lidé, věru jsme vás stvořili z muže a ženy a učinili jsme z vás národy a kmeny, abyste se vzájemně poznali.",
                            "verse 49:14": "A říkají kočovní Arabové: \"Uvěřili jsme!\" Rci: \"Neuvěřili jste! Spíše řekněte:, Přistoupili jsme k islámu!?, neboť víra ještě nevešla do srdcí vašich.",
                            "verse 49:15": "Věřícími jsou pouze ti, kdož uvěřili v Boha a posla Jeho a poté nepodlehli pochybnostem, nýbrž bojovali majetky i osobami svými na cestě Boží - a tito jsou věru upřímní.",
                            "verse 49:16": "Rci: \"Chcete snad poučovat Boha o náboženství svém, když Bůh dobře zná vše, co na nebesích je i na zemi? Bůh o každé věci je vševědoucí.",
                            "verse 49:17": "A domnívají se, že tobě udělali milost, když přistoupili k islámu.",
                            "verse 49:18": "A Bůh vskutku zná nepoznatelné na nebesích i na zemi a Bůh vše, co děláte, jasně zří."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "O, gij die gelooft, weest niet voorbarig bij God en Zijn boodschapper, maar vreest God.",
                            "verse 49:2": "O gij gelovigen, verheft uw stem niet boven de stem van de profeet en spreekt niet hardop tot hem, zoals gij hardop tot elkander spreekt, opdat uw werken niet vruchteloos mogen worden zonder dat gij het bemerkt.",
                            "verse 49:3": "Waarlijk, zij die hun stem verzachten in het bijzijn van de boodschapper van God, zijn degenen wier hart God tot rechtvaardigheid heeft gezuiverd.",
                            "verse 49:4": "Zij, die van buiten de huizen uit naar u schreeuwen - de meesten hunner hebben geen verstand.",
                            "verse 49:5": "Als zij geduld tonen totdat gij tot hen komt, zou het beter voor hen zijn.",
                            "verse 49:6": "O gij gelovigen, indien een slecht persoon u nieuws brengt, onderzoekt het nauwkeurig opdat gij sommige mensen niet in onwetendheid schaadt en naderhand spijt krijgt van hetgeen gij hebt gedaan.",
                            "verse 49:7": "En weet, dat de boodsehapper van God onder u is; als hij in verschillende opzichten aan uw wensen gehoor zou geven zoudt gij zeker in moeilijkheden zijn geraakt, maar God heeft in uw hart het geloof dierbaar en schoon gemaakt, en ongeloof, buitensporigheid en ongehoorzaamheid afkeurenswaardig.",
                            "verse 49:8": "Door de genade en gunst van God.",
                            "verse 49:9": "Indien twee partijen van gelovigen beginnen te vechten treft dan een schikking onder hen, maar indien één hunner tegen de andere in overtreding is, bestrijdt dan de overtredende partij totdat zij tot de verordening van God terugkeert.",
                            "verse 49:10": "De gelovigen zijn voorzeker broeders.",
                            "verse 49:11": "O, gij die gelooft! Laat een volk het andere volk dat waarschijnlijk beter is dan zij, niet bespotten, noch vrouwen andere vrouwen, die misschien beter zijn dan zij.",
                            "verse 49:12": "O, gij die gelooft! Vermijdt in het algemeen verdenking want achterdoeht is een zonde.",
                            "verse 49:13": "O, mensdom! Wij hebben u uit man en vrouw geschapen en Wij hebben u tot volkeren en stammen gemaakt, opdat gij elkander moogt kennen.",
                            "verse 49:14": "De bewoners der woestijn zeggen: \"Wij geloven.",
                            "verse 49:15": "De ware gelovigen zijn slechts degenen, die in God en Zijn boodschapper geloven en daarna niet twijfelen, doch met hun bezittingen en persoon voor de zaak van God strijden.",
                            "verse 49:16": "Zeg: \"Wilt gij God uw geloof doen weten, terwijl Hij weet wat in de hemelen en op aarde is; waarlijk God heeft kennis van alle dingen.",
                            "verse 49:17": "Zij achten het een gunst voor u dat zij de Islam hebben omhelsd.",
                            "verse 49:18": "Voorwaar, God kent de geheimen der hemelen en der aarde."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 49:1": "O ye who believe! Be not forward in the presence of Allah and His messenger, and keep your duty to Allah.",
                            "verse 49:2": "O ye who believe! Lift not up your voices above the voice of the Prophet, nor shout when speaking to him as ye shout one to another, lest your works be rendered vain while ye perceive not.",
                            "verse 49:3": "Lo! they who subdue their voices in the presence of the messenger of Allah, those are they whose hearts Allah hath proven unto righteousness.",
                            "verse 49:4": "Lo! those who call thee from behind the private apartments, most of them have no sense.",
                            "verse 49:5": "And if they had had patience till thou camest forth unto them, it had been better for them.",
                            "verse 49:6": "O ye who believe! If an evil-liver bring you tidings, verify it, lest ye smite some folk in ignorance and afterward repent of what ye did.",
                            "verse 49:7": "And know that the messenger of Allah is among you.",
                            "verse 49:8": "(It is) a bounty and a grace from Allah; and Allah is Knower, Wise.",
                            "verse 49:9": "And if two parties of believers fall to fighting, then make peace between them.",
                            "verse 49:10": "The believers are naught else than brothers.",
                            "verse 49:11": "O ye who believe! Let not a folk deride a folk who may be better than they (are), not let women (deride) women who may be better than they are; neither defame one another, nor insult one another by nicknames.",
                            "verse 49:12": "O ye who believe! Shun much suspicion; for lo! some suspicion is a crime.",
                            "verse 49:13": "O mankind! Lo! We have created you male and female, and have made you nations and tribes that ye may know one another.",
                            "verse 49:14": "The wandering Arabs say: We believe.",
                            "verse 49:15": "The (true) believers are those only who believe in Allah and His messenger and afterward doubt not, but strive with their wealth and their lives for the cause of Allah.",
                            "verse 49:16": "Say (unto them, O Muhammad): Would ye teach Allah your religion, when Allah knoweth all that is in the heavens and all that is in the earth, and Allah is Aware of all things ?",
                            "verse 49:17": "They make it a favour unto thee (Muhammad) that they have surrendered (unto Him).",
                            "verse 49:18": "Lo! Allah knoweth the Unseen of the heavens and the earth."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 49:1": "O Ye who believe! Put not yourselves forward before God and His Apostle; but fear God: for God is He Who hears and knows all things.",
                            "verse 49:2": "O ye who believe! Raise not your voices above the voice of the Prophet, nor speak aloud to him in talk, as ye may speak aloud to one another, lest your deeds become vain and ye perceive not.",
                            "verse 49:3": "Those that lower their voices in the presence of God’s Apostle,- their hearts has God tested for piety: for them is Forgiveness and a great Reward.",
                            "verse 49:4": "Those who shout out to thee from without the inner apartments - most of them lack understanding.",
                            "verse 49:5": "If only they had patience until thou couldst come out to them, it would be best for them: but God is Oft-Forgiving, Most Merciful.",
                            "verse 49:6": "O ye who believe! If a wicked person comes to you with any news, ascertain the truth, lest ye harm people unwittingly, and afterwards become full of repentance for what ye have done.",
                            "verse 49:7": "And know that among you is God’s Apostle: were he, in many matters, to follow your (wishes), ye would certainly fall into misfortune: But God has endeared the Faith to you, and has made it beautiful in your hearts, and He has made hateful to you Unbelief, wickedness, and rebellion: such indeed are those who walk in righteousness;-",
                            "verse 49:8": "A Grace and Favour from God; and God is full of Knowledge and Wisdom.",
                            "verse 49:9": "If two parties among the Believers fall into a quarrel, make ye peace between them: but if one of them transgresses Beyond bounds against the other, Then fight ye (all) against The one that transgresses Until it complies with The command of God; But if it complies, then Make peace between them With justice, and be fair; For God loves those Who are fair (and just).",
                            "verse 49:10": "The Believers are but a single Brotherhood: So make peace and reconciliation between your two (contending) brothers; and fear God, that ye may receive Mercy.",
                            "verse 49:11": "O ye who believe! Let not some men among you laugh at others: It may be that the (latter) are better than the (former): Nor let some women laugh at others: It may be that the (latter are better than the (former): Nor defame nor be sarcastic to each other, nor call each other by (offensive) nicknames: Ill-seeming is a name connoting wickedness, (to be used of one) after he has believed: And those who do not desist are (indeed) doing wrong.",
                            "verse 49:12": "O ye who believe! Avoid suspicion as much (as possible): for suspicion in some cases is a sin: And spy not on each other behind their backs.",
                            "verse 49:13": "O mankind! We created you from a single (pair) of a male and a female, and made you into nations and tribes, that ye may know each other (not that ye may despise (each other).",
                            "verse 49:14": "The desert Arabs say, \"We believe.",
                            "verse 49:15": "Only those are Believers who have believed in God and His Apostle, and have never since doubted, but have striven with their belongings and their persons in the Cause of God: Such are the sincere ones, Were We then weary with the first Creation, that they should be in confused doubt about a new Creation?",
                            "verse 49:16": "Say: \"What! Will ye instruct God about your religion? But God knows all that is in the heavens and on earth: He has full knowledge of all things.",
                            "verse 49:17": "They impress on thee as a favour that they have embraced Islam.",
                            "verse 49:18": "\"Verily God knows the secrets of the heavens and the earth: and God Sees well all that ye do."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 49:1": "O believers, advance not before God and His Messenger; and fear God.",
                            "verse 49:2": "O believers, raise not your voices above the Prophet’s voice, and be not loud in your speech to him, as you are loud one to another, lest your works fail while you are not aware.",
                            "verse 49:3": "Surely those who lower their voices in the presence of God’s Messenger, those are they whose hearts God has tested for godfearing; they shall have forgiveness and a mighty wage.",
                            "verse 49:4": "Surely those who call unto thee from behind the apartments, the most of them do not understand.",
                            "verse 49:5": "And if they had patience, until thou comest out to them, that would be better for them; and God is All-forgiving, All-compassionate.",
                            "verse 49:6": "O believers, if an ungodly man comes to you with a tiding, make clear, lest you afflict a people unwittingly, and then repent of what you have done.",
                            "verse 49:7": "And know that the Messenger of God is among you.",
                            "verse 49:8": "by God’s favour and blessing; God is All-knowing, All-wise.",
                            "verse 49:9": "If two parties of the believers fight, put things right between them; then, if one of them is insolent against the other, fight the insolent one till it reverts to God’s commandment.",
                            "verse 49:10": "The believers indeed are brothers; so set things right between your two brothers, and fear God; haply so you will find mercy.",
                            "verse 49:11": "O believers, let not any people scoff at another people who may be better than they; neither let women scoff at women who may be better than themselves.",
                            "verse 49:12": "O believers, eschew much suspicion; some suspicion is a sin.",
                            "verse 49:13": "O mankind, We have created you male and female, and appointed you races and tribes, that you may know one another.",
                            "verse 49:14": "The Bedouins say, ’We believe.",
                            "verse 49:15": "The believers are those who believe in God and His Messenger, then have not doubted, and have struggled with their possessions and their selves in the way of God; those -- they are the truthful ones.",
                            "verse 49:16": "Say: ’What, would you teach God what your religion is, and God knows what is in the heavens and what is in the earth? And God has knowledge of everything.",
                            "verse 49:17": "They count it as a favour to thee that they have surrendered! Say: ’Do not count your surrendering as a favour to me; nay, but rather God confers a favour upon you, in that He has guided you to belief, if it be that you are truthful.",
                            "verse 49:18": "God knows the Unseen of the heavens and of the earth; and God sees the things you do."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 49:1": "O you who have attained to faith! Do not put yourselves forward in the presence of",
                            "verse 49:2": "God and His Apostle [may have ordained], but remain conscious of God: for, verily, God is all-hearing, all-knowing!",
                            "verse 49:3": "O you who have attained to faith! Do not raise your voices above the voice of the Prophet, and neither speak loudly to him, as you would speak loudly to one another, lest all your",
                            "verse 49:4": "deeds come to nought without your perceiving it.",
                            "verse 49:5": "Behold, they who lower their voices in the presence of God’s Apostle – it is they whose hearts God has tested [and opened] to consciousness of Himself;",
                            "verse 49:6": "theirs shall be forgiveness and a reward supreme.",
                            "verse 49:7": "Verily, [O Prophet,] as for those who call thee from without thy private apartments – most of them do not use their reason:",
                            "verse 49:8": "for if they had the patience [to wait] until thou come forth to them [of thine own accord], it would be for their own good.",
                            "verse 49:9": "O YOU who have attained to faith! If any iniquitous person comes to you with a",
                            "verse 49:10": "tale, use your discernment, lest you hurt people unwittingly and afterwards be filled with remorse for what you have done.",
                            "verse 49:11": "And know that God’s Apostle is among you: were he to comply with your inclinations in each and every case, you would be bound to come to harm [as a community].",
                            "verse 49:12": "faith to be dear to you, and has given it beauty in your hearts, and has made hateful to you all denial of the truth, and all iniquity, and all rebellion [against what is good].",
                            "verse 49:13": "through God’s bounty and favour; and God is all-knowing, truly wise.",
                            "verse 49:14": "Hence, if two groups of believers fall to fighting, make peace between them; but then, if one of the two",
                            "verse 49:15": "goes on acting wrongfully towards the other, fight against the one that acts wrongfully until it reverts to God’s commandment; and if they revert, make peace between them with justice, and deal equitably [with them]: for, verily, God loves those who act equitably!",
                            "verse 49:16": "All believers are but brethren.",
                            "verse 49:17": "O YOU who have attained to faith! No men shall deride",
                            "verse 49:18": "men: it may well be that those [whom they deride] are better than themselves; and no women [shall deride other] women: it may well be that those [whom they deride] are better than themselves.",
                            "verse 49:19": "epithets: evil is all imputation of iniquity after [one has attained to] faith; and they who [become guilty thereof and] do not repent – it is they, they who are evildoers!",
                            "verse 49:20": "O you who have attained to faith! Avoid most guesswork [about one another] – for, behold, some of",
                            "verse 49:21": "guesswork is [in itself] a sin; and do not spy upon one another, and neither allow yourselves to speak ill of one another behind your backs.",
                            "verse 49:22": "O men! Behold, We have created you all out of a male and a female, and have made you into nations and tribes, so that you might come to know one another.",
                            "verse 49:23": "THE BEDOUIN say, \"We have attained to faith.",
                            "verse 49:24": "attained to faith; you should",
                            "verse 49:25": "say, ‘We have",
                            "verse 49:26": "surrendered’ – for",
                            "verse 49:27": "faith has not yet entered your hearts.",
                            "verse 49:28": "pay heed unto God and His Apostle, He will not let the least of your deeds go to waste: for, behold, God is much-forgiving, a dispenser of grace.",
                            "verse 49:29": "[Know that true] believers are only those who have attained to faith in God and His Apostle and have left all doubt behind, and who strive hard in God’s cause with their possessions and their lives: it is they, they who are true to their word!",
                            "verse 49:30": "Say: \"Do you, perchance, [want to] inform God of [the nature of] your faith – although God knows all that is in the heavens and all that is on earth? Indeed, God has full knowledge of everything!\"",
                            "verse 49:31": "Many people think that they have bestowed a favour upon thee [O Prophet] by having surrendered [to thee].",
                            "verse 49:32": "Verily, God knows the hidden reality of the heavens and the earth; and God sees all that you do.",
                            "verse 49:33": "who have not obscured their faith by wrongdoing."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 49:1": "The Arabs say: We believe.",
                            "verse 49:2": "Arabs of the desert say: “We believe”.",
                            "verse 49:3": "Arabs of the desert say: We have faith.",
                            "verse 49:4": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 49:5": "The Book of Certainty (1952) •",
                            "verse 49:6": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 49:7": "What is Sufism (1975) •",
                            "verse 49:8": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 49:9": "Muhammad (1983) •",
                            "verse 49:10": "Symbol and Archetype (1991) •",
                            "verse 49:11": "Sufi Poems (2004) •",
                            "verse 49:12": "Mecca (2004) •",
                            "verse 49:13": "Return to the Spirit (2005) •",
                            "verse 49:14": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 49:15": "“Proofs of Islam”(1954).",
                            "verse 49:16": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 49:17": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 49:18": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 49:19": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 49:20": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 49:21": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 49:22": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 49:23": "“The Quranic Origins of Sufism” •",
                            "verse 49:24": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 49:25": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 49:26": "“An Introduction to Islam” •",
                            "verse 49:27": "“The Universality of the Quran” •",
                            "verse 49:28": "Private Talks Books",
                            "verse 49:29": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 49:1": "O you who believe, do not proceed ahead of Allah and His Messenger, and fear Allah.",
                            "verse 49:2": "O you who believe, do not raise your voices above the voice of the Prophet, and be not loud when speaking to him, as you are loud when speaking to one another, lest your good deeds should become void while you are not aware.",
                            "verse 49:3": "Surely, those who lower their voices before Allah’s Messenger are the ones whose hearts Allah has tested for piety; for them there is forgiveness, and a great reward.",
                            "verse 49:4": "As for those who call you from behind the chambers, most of them have no sense.",
                            "verse 49:5": "Had they remained patient until you come out to them, it would have been much better for them.",
                            "verse 49:6": "O you who believe, if a sinful person brings you a report, verify its correctness, lest you should harm a people out of ignorance, and then become remorseful on what you did.",
                            "verse 49:7": "And know that among you there is the Messenger of Allah.",
                            "verse 49:8": "as a grace from Allah, and as a blessing.",
                            "verse 49:9": "If two groups of the believers fight each other, seek reconciliation between them.",
                            "verse 49:10": "All believers are but brothers, therefore seek reconciliation between your two brothers, and fear Allah, so that you may be blessed with mercy.",
                            "verse 49:11": "O you who believe, no men should ever scoff at other men.",
                            "verse 49:12": "O you who believe, abstain from many of the suspicions.",
                            "verse 49:13": "O mankind, We have created you from a male and a female, and made you into races and tribes, so that you may identify one another.",
                            "verse 49:14": "The Bedouins say, “We have come to believe.",
                            "verse 49:15": "Believers, in fact, are those who believe in Allah and His Messenger, then have no doubt, and struggle, with their riches and their lives, in the way of Allah.",
                            "verse 49:16": "Say, “Would you apprise Allah of your religion, while Allah knows all that is in the heavens and all that is in the earth, and Allah is All-Knowing about every thing?”",
                            "verse 49:17": "They oblige you that they have accepted Islam, (as if it was a favour shown to you).",
                            "verse 49:18": "Surely Allah knows the Unseen of the heavens and the earth, and Allah keeps in sight whatever you do."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 49:1": "O you who believe, do not venture ahead of God and His Messenger, and fear God.",
                            "verse 49:2": "O you who believe, do not raise your voices above the voice of the Prophet, and do not shout words at him, as you shout to one another, lest your works should be invalidated without your being aware.",
                            "verse 49:3": "Truly those who lower their voices in the presence of God’s Messenger — they are the ones whose hearts God has tested for God-fearing.",
                            "verse 49:4": "Truly those who call you from behind the apartments — most of them do not understand.",
                            "verse 49:5": "And had they been patient until you came out to them, it would have been better for them; and God is Forgiving, Merciful.",
                            "verse 49:6": "O you who believe, if a reprobate should come to you with some tiding, verify ,",
                            "verse 49:7": "lest you injure a folk out of ignorance; and then become remorseful of what you have perpetrated.",
                            "verse 49:8": "And know that the Messenger of God is among you.",
                            "verse 49:9": "[that is] a favour from God and a grace, and God is Knower, Wise.",
                            "verse 49:10": "And if two parties of believers fall to fighting, make peace between them.",
                            "verse 49:11": "The believers are indeed brothers.",
                            "verse 49:12": "make peace between your brethren, and fear God, so that perhaps you might receive mercy.",
                            "verse 49:13": "O you who believe, do not let any people deride another people: who may be better than they are; nor let any women deride",
                            "verse 49:14": "women who may be better than they are.",
                            "verse 49:15": "O you who believe, shun much suspicion.",
                            "verse 49:16": "O mankind! We have indeed created you from a male and a female, and made you nations and tribes that you may come to know one another.",
                            "verse 49:17": "The Bedouins say, ‘We believe’.",
                            "verse 49:18": "The",
                            "verse 49:19": "believers are only those who believe in God and His Messenger, and then have not doubted, and who strive with their wealth and their souls for the cause of God.",
                            "verse 49:20": "Say: ‘Do you [pretend to] inform God about your religion, when God knows all that is in the heavens and all that is in the earth, and [even though] God is Knower of all things?’",
                            "verse 49:21": "They deem it to be a favour to you that they have submitted.",
                            "verse 49:22": "Truly God knows the Unseen of the heavens and the earth, and God is Seer of what you do’."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 49:1": "O believers! Do not step ahead of Allah and His Messenger ([blessings and peace be upon him] in any matter) and keep fearing Allah (lest some discourtesy should occur displeasing the Messenger [blessings and peace be upon him]).",
                            "verse 49:2": "O believers! Do not raise your voices above the voice of the Prophet (blessings and peace be upon him), and (also) do not speak to him so loud as you are loud when you speak to one another (lest) all your actions should come to nothing (including your faith), and you are not even aware (that your faith and all pious works have been wrecked).",
                            "verse 49:3": "Assuredly, those who keep their voices low in the presence of Allah’s Messenger (out of profound veneration and submissiveness), it is they whose hearts Allah has chosen for Godwariness and permeated with sincerity.",
                            "verse 49:4": "Verily, those who call out to you from outside your apartments, most of them do not have the understanding (of your exalted station and incomparable status and polite manners of veneration that are due to you).",
                            "verse 49:5": "And if they had only been patient till you had come out to them, it would have been better for them.",
                            "verse 49:6": "O believers! If some wicked person brings you any news, inquire thoroughly into its truth (lest) you should cause (undue) harm to a people unknowingly, and later feel regret for what you have done.",
                            "verse 49:7": "And remember that the Messenger of Allah (blessings and peace be upon him) is amongst you.",
                            "verse 49:8": "(It) is due to Allah’s bounty and favour (i.",
                            "verse 49:9": "And if two parties of the Muslims fight, make them reconcile.",
                            "verse 49:10": "The truth is that (all) believers are brothers (to one another).",
                            "verse 49:11": "O believers! Let no community ridicule another community.",
                            "verse 49:12": "O believers! Avoid most conjectures.",
                            "verse 49:13": "O people! We created you from a male and a female, and (divided) you into (large) peoples and tribes, so that you might recognize one another.",
                            "verse 49:14": "The Bedouins say: ‘We have believed.",
                            "verse 49:15": "The true believers are only those who have believed in Allah and His Messenger (blessings and peace be upon him) and then never have any doubt, and who fight in the way of Allah with their material as well as human resources.",
                            "verse 49:16": "Say: ‘Are you trying to show off to Allah your Din (Religion) whilst Allah knows all that is in the heavens and in the earth? And Allah is Well Aware of everything.",
                            "verse 49:17": "These people are showing off to you that they have done a favour to you by embracing Islam.",
                            "verse 49:18": "Surely, Allah knows all the unseen of the heavens and the earth, and Allah monitors best whatever you do."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "Te, jotka uskotte, älkää estäkö Jumalan ja Hänen sananjulistajansa läsnäoloa, vaan pitäkää huoli velvollisuudestanne Jumalaa kohtaan.",
                            "verse 49:2": "Te, jotka uskotte, älkää korottako ääntänne profeetan äänen yli älkääkä puhuko hänelle niin äänekkäästi, kuin puhutte toinen toisillenne, jotta tekojanne ei huomaamattanne tehtäisi tyhjiksi.",
                            "verse 49:3": "Totisesti ne, jotka alentavat äänensä Jumalan sananjulistajan edessä, ovat niitä, joiden sydäntä Jumala on koetellut pahan vastustamisessa; he saavat anteeksiannon ja suuren palkinnon.",
                            "verse 49:4": "Useimmat niistä, jotka kutsuvat sinua pois sisähuoneista, ovat totisesti ymmärrystä vailla.",
                            "verse 49:5": "Ja jos he odottaisivat kärsivällisesti siksi, kunnes sinä tulet heidän luokseen, olisi se varmasti heille parempi; niin, Jumala on anteeksiantavainen, armollinen.",
                            "verse 49:6": "Te uskovaiset, jos jumalaton ihminen tulee luoksenne tuoden jonkin sanoman, niin tutkikaa sitä tarkoin, ettette tietämättänne vahingoittaisi ihmisiä ja sitten saisi katua, mitä olette tehneet.",
                            "verse 49:7": "Tietäkää, että keskuudessanne on Jumalan sananjulistaja! Jos hän tottelisi teitä monessa asiassa, te totisesti joutuisitte ahdinkoon, mutta Jumala on tehnyt uskon teille rakkaaksi ja saattanut sen sydämissänne ihanaksi.",
                            "verse 49:8": "Jumalan armosta ja suosiosta; Jumalan on tieto, viisaus.",
                            "verse 49:9": "Ja jos kaksi uskovaisten ryhmää joutuu riitaan, tehkää sovinto heidän välilleen.",
                            "verse 49:10": "Uskovaiset ovat veljiä; tehkää sentähden sovinto veljienne kanssa ja huolehtikaa velvollisuudestanne Jumalaa kohtaan, jotta armo tulisi osaksenne.",
                            "verse 49:11": "Te, jotka uskotte, älkää antako ihmisten nauraa toisilleen, olkoonpa, että he ovat näitä parempia; älkööt naiset naurako toisille naisille, vaikka olisivatkin parempia kuin nämä.",
                            "verse 49:12": "Te, jotka uskotte, karttakaa pahoja luuloja, sillä epäileminen on totisesti joissakin tapauksissa synti.",
                            "verse 49:13": "Ihmiset, Me olemme totisesti luonut teidät miehestä ja naisesta ja jakanut teidät heimoihin ja sukuihin, jotta tuntisitte toinen toisenne.",
                            "verse 49:14": "Erämaan asukkaat sanovat: »Me uskomme»; sano: »Te ette usko, vaan sanotte: 'Alistumme', mutta usko ei ole vielä voittanut sydämiänne.",
                            "verse 49:15": "Uskovaisia ovat vain ne, jotka uskovat Jumalaan ja Hänen sananjulistajaansa eivätkä epäile, vaan panevat alttiiksi omaisuutensa ja henkensä ponnistellessaan Jumalan tiellä; nämä ovat vanhurskaita.",
                            "verse 49:16": "Sano: »Tekö saatatte Jumalan tietoon uskontonne, vaikka Jumala tietää kaiken, mitä on taivaassa ja maan päällä? Jumala on kaikkitietävä.",
                            "verse 49:17": "He luulevat saattavansa sinut kiitollisuuden velkaan kääntymällä muslimeiksi.",
                            "verse 49:18": "Jumala tuntee totisesti näkymättömät asiat taivaassa ja maan päällä; Jumala näkee, mitä te teette."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 49:1": "O vous qui croyez ! Ne soyez pas présomptueux envers Dieu et envers Son Envoyé ! Craignez Dieu ! En vérité, Dieu entend tout et Il sait tout.",
                            "verse 49:2": "O vous qui croyez ! N'élevez pas la voix au-dessus de celle du Prophète.",
                            "verse 49:3": "Ceux qui baissent la voix en présence de Son Envoyé sont vraiment ceux dont Dieu a sondé les cœurs pour en éprouver la crainte révérencielle.",
                            "verse 49:4": "Ceux qui t'interpellent de l'extérieur de tes appartements sont, pour la plupart, des gens qui n'ont pas de tête.",
                            "verse 49:5": "S'ils patientaient jusqu'à ce que tu sortes à leur rencontre, ce serait préférable pour eux.",
                            "verse 49:6": "O vous qui croyez ! Si quelqu'un de mal intentionné vous apporte une nouvelle, soyez circonspects ; car si, par ignorance, vous nuisiez à certaines personnes, vous auriez à vous repentir d'avoir agi ainsi.",
                            "verse 49:7": "Sachez que l'Envoyé de Dieu est parmi vous.",
                            "verse 49:8": "par la grâce de Dieu et Son bienfait.",
                            "verse 49:9": "Si deux groupes de croyants se combattent, réconciliez-les.",
                            "verse 49:10": "Les croyants sont frères.",
                            "verse 49:11": "O vous qui croyez ! Qu'il n'y ait pas des hommes qui se moquent des autres ; il se pourrait que ceux-ci fussent meilleurs que les railleurs ; et que les femmes ne se moquent pas des autres femmes ; il se pourrait que celles-ci fussent meilleures que les railleuses.",
                            "verse 49:12": "O vous qui croyez ! Evitez de trop conjecturer sur autrui : il y a des conjectures qui sont des péchés.",
                            "verse 49:13": "O vous, les hommes ! Nous vous avons créés d'un mâle et d'une femelle.",
                            "verse 49:14": "Les Arabes du désert disent : \" Nous croyons ! \".",
                            "verse 49:15": "actions.",
                            "verse 49:16": "Seuls sont vraiment croyants ceux qui croient en Dieu et en Son Envoyé sans jamais douter par la suite, et qui combattent avec leurs biens et leurs personnes dans le chemin de Dieu.",
                            "verse 49:17": "Dis : \" Enseignerez-vous à Dieu votre religion, à Dieu qui sait ce qui est dans les cieux et sur la terre, à Dieu qui connaît parfaitement toute chose ? \"",
                            "verse 49:18": "Ils disent qu'en embrassant l'Islam ils t'ont fait une faveur.",
                            "verse 49:19": "Certes, Dieu connaît le mystère des cieux et de la terre, et Dieu voit parfaitement ce que vous faites."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 49:1": "ô vous qui avez cru ! Ne devancez pas Dieu et Son messager .",
                            "verse 49:2": "ô vous qui avez cru ! N’élevez pas vos voix au-dessus de la voix du Prophète, et ne haussez pas le ton en lui parlant, comme vous le haussez les uns avec les autres, sinon vos oeuvres deviendraient vaines sans que vous vous en rendiez compte.",
                            "verse 49:3": "Ceux qui auprès du Messager de Dieu baissent leurs voix sont ceux dont Dieu a éprouvé les coeurs pour la piété.",
                            "verse 49:4": "Ceux qui t’appellent à haute voix de derrière les appartements, la plupart d’entre eux ne raisonnent pas.",
                            "verse 49:5": "Et s’ils patientaient jusqu’à ce que tu sortes à eux, ce serait certes mieux pour eux.",
                            "verse 49:6": "ô vous qui avez cru ! Si un pervers vous apporte une nouvelle, voyez bien clair [de crainte] que par inadvertance vous ne portiez atteinte à des gens et que vous ne regrettiez par la suite ce que vous avez fait.",
                            "verse 49:7": "Et sachez que le Messager de Dieu est parmi vous.",
                            "verse 49:8": "c’est là en effet une grâce de Dieu et une bienfait.",
                            "verse 49:9": "Et si deux groupes de croyants se combattent, faites la conciliation entre eux.",
                            "verse 49:10": "Les croyants ne sont que des frères.",
                            "verse 49:11": "ô vous qui avez cru ! Qu’un groupe ne se raille pas d’un autre groupe : ceux-ci sont peut-être meilleurs qu’eux.",
                            "verse 49:12": "ô vous qui avez cru ! évitez de trop conjecturer [sur autrui] car une partie des conjectures est péché.",
                            "verse 49:13": "ô hommes ! Nous vous avons créés d’un mâle et d’une femelle, et Nous avons fait de vous des nations et des tribus, pour que vous vous entreconnaissiez.",
                            "verse 49:14": "Les Bédouins ont dit : «Nous avons la foi».",
                            "verse 49:15": "Les vrais croyants sont seulement ceux qui croient en Dieu et en Son messager, qui par la suite ne doutent point et qui luttent avec leurs biens et leurs personnes dans le chemin de Dieu.",
                            "verse 49:16": "Dis : «Est-ce vous qui apprendrez à Dieu votre religion, alors que Dieu sait tout ce qui est dans les cieux et sur la terre ? » Et Dieu est Omniscient.",
                            "verse 49:17": "Ils te rappellent leur conversion à l’Islam comme si c’était une faveur de leur part.",
                            "verse 49:18": "Dieu connaît l’Inconnaissable des cieux et de la terre et Dieu est Clairvoyant sur ce que vous faites."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "O die ihr glaubt, seid nicht dreist vor Allah und Seinem Gesandten, sondern fürchtet Allah.",
                            "verse 49:2": "O die ihr glaubt, erhebt nicht eure Stimmen über die Stimme des Propheten und sprecht nicht so laut zu ihm, wie ihr laut zueinander redet, auf daß eure Werke nicht eitel werden, ohne daß ihr es merkt.",
                            "verse 49:3": "Diejenigen, die ihre Stimmen vor dem Gesandten Allahs senken, sie sind es, deren Herzen Allah zur Gerechtigkeit geläutert hat.",
                            "verse 49:4": "Jene aber, die dich von außerhalb der Wohnräume rufen - die meisten von ihnen sind bar der Einsicht.",
                            "verse 49:5": "Wenn sie sich geduldeten, bis du zu ihnen herauskämest, so wäre es besser für sie.",
                            "verse 49:6": "O die ihr glaubt, wenn ein Ruchloser euch eine Kunde bringt, prüft (sie) nach, damit ihr nicht anderen Leuten in Unwissenheit ein Unrecht zufügt und hernach bereuen müßt, was ihr getan.",
                            "verse 49:7": "Und wisset, daß der Gesandte Allahs unter euch ist.",
                            "verse 49:8": "Durch die Gnade und die Huld Allahs.",
                            "verse 49:9": "Wenn zwei Parteien der Gläubigen miteinander streiten, dann stiftet Frieden unter ihnen; wenn aber eine von ihnen sich gegen die andere vergeht, so bekämpft die Partei, die sich verging, bis sie zu Allahs Befehl zurückkehrt.",
                            "verse 49:10": "Die Gläubigen sind ja Brüder.",
                            "verse 49:11": "O die ihr glaubt! lasset nicht ein Volk über das andere spotten, vielleicht sind diese besser als jene; noch Frauen (eines Volkes) über Frauen (eines andern Volkes), vielleicht sind diese besser als jene.",
                            "verse 49:12": "O die ihr glaubt! vermeidet häufigen Argwohn, denn mancher Argwohn ist Sünde.",
                            "verse 49:13": "O ihr Menschen, Wir haben euch von Mann und Weib erschaffen und euch zu Völkern und Stämmen gemacht, daß ihr einander kennen möchtet.",
                            "verse 49:14": "Die Wüstenaraber sprechen: «Wir glauben.",
                            "verse 49:15": "Die Gläubigen sind nur jene, die an Allah und Seinen Gesandten glauben und dann nicht zweifeln, sondern mit ihrem Besitz und ihrer Person für Allahs Sache streiten.",
                            "verse 49:16": "Sprich: «Wollt ihr Allah über eure Religion belehren, während Allah doch alles kennt, was in den Himmeln und was auf Erden ist, und Allah alle Dinge weiß?»",
                            "verse 49:17": "Sie halten es dir als eine Gnade vor, daß sie den Islam angenommen haben.",
                            "verse 49:18": "Allah kennt die Geheimnisse der Himmel und der Erde; und Allah sieht alles, was ihr tut."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": ",s bZekunkjksa [+kqnk vkSj mlds jlwy ds lkeus fdlh ckr esa vkxs u c<+ tk;k djks vkSj [+kqnk ls Mjrs jgks cs’kd [+kqnk cM+k lquus okyk okfd+Q+dkj gS",
                            "verse 49:2": ",s bZekunkjksa ¼cksyus esa½ viuh vkokt+s iSx+Ecj dh vkokt+ ls Å¡ph u fd;k djks vkSj ftl rjg rqe vkil esa ,d nwljs ls t+ksj ¼t+ksj½ ls cksyk djrs gks muds :c: t+ksj ls u cksyk djks ¼,slk u gks fd½ rqEgkjk fd;k djk;k lc vdkjr gks tk, vkSj rqedks [+kcj Hkh u gks",
                            "verse 49:3": "cs’kd tks yksx jlwys [+kqnk ds lkeus viuh vkokt+sa /kheh dj fy;k djrs gSa ;gh yksx gSa ftuds fnyksa dks [+kqnk us ijgst+xkjh ds fy, tk¡p fy;k gS muds fy, ¼vk[+skjr esa½ cf[+’k’k vkSj cM+k vtz gS",
                            "verse 49:4": "¼,s jlwy½ tks yksx rqedks gqtjksa ds ckgj ls vkokt+ nsrs gSa muesa ds vD+lj cs vD+y gSa",
                            "verse 49:5": "vkSj vxj ;s yksx bruk rkEeqy djrs fd rqe [+kqn fudy dj muds ikl vk tkrs ¼rc ckr djrs½ rks ;s muds fy, csgrj Fkk vkSj [+kqnk rks cM+k c[+’kus okyk esgjcku gS",
                            "verse 49:6": ",s bZekunkjksa vxj dkssbZ cnfdjnkj rqEgkjs ikl dksbZ [+kcj ysdj vk, rks [+kwc rgd+hd+ dj fy;k djks ¼,slk u gks½ fd rqe fdlh d+kSe dks uknkuh ls uqd+lku igq¡pkvks fQj vius fd, ij ukfne gks",
                            "verse 49:7": "vkSj tku j[kks fd rqe esa [+kqnk ds iSx+Ecj ¼ekStwn½ gSa cgqr lh ckrsa ,slh gSa fd vxj jlwy muesa rqEgkjk dgk eku fy;k djsa rks ¼myVs½ rqe gh eqf’dy esa iM+ tkvks ysfdu [+kqnk us rqEgsa bZeku dh eksgCcr ns nh gS vkSj mldks rqEgkjs fnyksa esa menk dj fn[kk;k gS vkSj dqÝ+ vkSj cndkjh vkSj ukQ+jekuh ls rqedks cst+kj dj fn;k gS ;gh yksx [+kqnk ds Q+t+y o ,glku ls jkgs fgnk;r ij gSa",
                            "verse 49:8": "vkSj [+kqnk rks cM+k okfd+Q+dkj vkSj fgder okyk gS",
                            "verse 49:9": "vkSj vxj eksfeuhu esa ls nks fQjd+s vkil esa yM+ iM+s rks mu nksuksa esa lqyg djk nks fQj vxj muesa ls ,d ¼Q+jhd+½ nwljs ij T+;knrh djs rks tks ¼fQjd+k½ T+;knrh djs rqe ¼Hkh½ mlls yM+ks ;gk¡ rd og [+kqnk ds gqDe dh rjQ :>w djs fQj tc :tw djs rks QjhdS+u esa elkokr ds lkFk lqyg djk nks vkSj bUlkQ+ ls dke yks cs’kd [+kqnk bUlkQ+ djus okyksa dks nksLr j[krk gS",
                            "verse 49:10": "eksfeuhu rks vkil esa cl HkkbZ HkkbZ gSa rks vius nks HkkbZ;ksa esa esy tksy djk fn;k djks vkSj [+kqnk ls Mjrs jgks rkfd rqe ij jge fd;k tk,",
                            "verse 49:11": ",s bZekunkjksa ¼rqe fdlh d+kSe dk½ dksbZ enZ ¼ nwljh d+kSe ds enksZa dh g¡lh u mM+k;s eqefdu gS fd og yksx ¼[+kqnk ds ut+nhd½ muls vPNs gksa vkSj u vkSjrs vkSjrksa ls ¼rel[+kqj djsa½ D;k vtc gS fd og muls vPNh gksa vkSj rqe vkil esa ,d nwljs dks feyus u nks u ,d nwljs dk cqjk uke /kjks bZeku ykus ds ckn cndkjh ¼dk½ uke gh cqjk gS vkSj tks yksx ckt+ u vk,¡ rks ,sls gh yksx t+kfye gSa",
                            "verse 49:12": ",s bZekunkjksa cgqr ls xqeku ¼cn½ ls cps jgks D;ksa fd ckt+ cnxqekuh xqukg gSa vkSj vkil esa ,d nwljs ds gky dh Vksg esa u jgk djks vkSj u rqeesa ls ,d nwljs dh x+hcr djs D;k rqeesa ls dksbZ bl ckr dks ilUn djsxk fd vius ejs gq, HkkbZ dk xks’r [kk, rks rqe mlls ¼t+:j½ uQjr djksxs vkSj [+kqnk ls Mjks] cs’kd [+kqnk cM+k rkSck d+qcwy djus okyk esgjcku gS",
                            "verse 49:13": "yksxksa geus rks rqe lcdks ,d enZ vkSj ,d vkSjr ls iSnk fd;k vkSj ge gh us rqEgkjs dchys vkSj fcjknfj;k¡ cuk;ha rkfd ,d nwljs dh f’kuk[+r djs blesa Ód ugha fd [+kqnk ds ut+nhd rqe lcesa cM+k bT+t+rnkj ogh gS tks cM+k ijgst+xkj gks cs’kd [+kqnk cM+k okfd+Q+dkj [+kcjnkj gS",
                            "verse 49:14": "vjc ds nsgkrh dgrs gSa fd ge bZeku yk, ¼,s jlwy½ rqe dg nks fd rqe bZeku ugha yk, cfYd ¼;w¡½ dg nks fd bLyke yk, gkykWfd bZeku dk vHkh rd rqEgkjs fny esa xqt+j gqvk gh ugha vkSj vxj rqe [+kqnk dh vkSj mlds jlwy dh Qjekcjnkjh djksxs rks [+kqnk rqEgkjs vkeky esa ls dqN de ugha djsxk & cs’kd [+kqnk cM+k c[+’kus okyk esgjcku gS",
                            "verse 49:15": "¼lPps eksfeu½ rks cl ogh gSa tks [+kqnk vkSj mlds jlwy ij bZeku yk, fQj mUgksaus mlesa fdlh rjg dk Ód Óqcg u fd;k vkSj vius eky ls vkSj viuh tkuksa ls [+kqnk dh jkg esa tsgkn fd;k ;gh yksx ¼nkok, bZeku esa½ lPps gSa",
                            "verse 49:16": "¼,s jlwy buls½ iwNks rks fd D;k rqe [+kqnk dks viuh nhnkjh trkrs gks vkSj [+kqnk rks tks dqN vklekuksa es gS vkSj tks dqN t+ehu esa gS ¼x+jt+ lc dqN½ tkurk gS vkSj [+kqnk gj pht+ ls [+kcjnkj gS",
                            "verse 49:17": "¼,s jlwy½ rqe ij ;s yksx ¼blyke ykus dk½ ,glku trkrs gSa rqe ¼lkQ+½ dg nks fd rqe vius blyke dk eq> ij ,glku u trkvks ¼cfYd½ vxj rqe ¼nkok, bZeku esa½ lPps gks rks le>ks fd] [+kqnk us rqe ij ,glku fd;k fd mlus rqedks bZeku dk jkLrk fn[kk;k",
                            "verse 49:18": "cs’kd [+kqnk rks lkjs vklekuksa vkSj t+ehu dh fNih gq;h ckrksa dks tkurk gS vkSj tks rqe djrs gks [+kqnk mls ns[k jgk gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "Hai orang-orang yang beriman, janganlah kamu mendahului Allah dan Rasul-Nya dan bertakwalah kepada Allah.",
                            "verse 49:2": "Hai orang-orang yang beriman, janganlah kamu meninggikan suaramu lebih dari suara Nabi, dan janganlah kamu berkata kepadanya dengan suara keras sebagaimana kerasnya (suara) sebahagian kamu terhadap sebahagian yang lain, supaya tidak hapus (pahala) amalanmu sedangkan kamu tidak menyadari.",
                            "verse 49:3": "Sesungguhnya orang-orang yang merendahkan suaranya di sisi Rasulullah mereka itulah orang-orang yang telah diuji hati mereka oleh Allah untuk bertakwa.",
                            "verse 49:4": "Sesungguhnya orang-orang yang memanggil kamu dari luar kamar (mu) kebanyakan mereka tidak mengerti.",
                            "verse 49:5": "Dan kalau sekiranya mereka bersabar sampai kamu keluar menemui mereka sesungguhnya itu adalah lebih baik bagi mereka, dan Allah Maha Pengampun lagi Maha Penyayang.",
                            "verse 49:6": "Hai orang-orang yang beriman, jika datang kepadamu orang fasik membawa suatu berita, maka periksalah dengan teliti, agar kamu tidak menimpakan suatu musibah kepada suatu kaum tanpa mengetahui keadaannya yang menyebabkan kamu menyesal atas perbuatanmu itu.",
                            "verse 49:7": "Dan ketahuilah olehmu bahwa di kalangan kamu ada Rasulullah.",
                            "verse 49:8": "sebagai karunia dan ni’mat dari Allah.",
                            "verse 49:9": "Dan jika ada dua golongan dari orang-orang mu’min berperang maka damaikanlah antara keduanya.",
                            "verse 49:10": "Sesungguhnya orang-orang mu’min adalah bersaudara karena itu damaikanlah antara kedua saudaramu dan bertakwalah kepada Allah supaya kamu mendapat rahmat.",
                            "verse 49:11": "Hai orang-orang yang beriman janganlah suatu kaum mengolok-olok kaum yang lain (karena) boleh jadi mereka (yang diolok-olok) lebih baik dari mereka (yang mengolok-olok) dan jangan pula wanita-wanita (mengolok-olok) wanita-wanita lain (karena) boleh jadi wanita-wanita (yang diperolok-olokkan) lebih baik dari wanita (yang mengolok-olok) dan janganlah kamu mencela dirimu sendiri dan janganlah kamu panggil memanggil dengan gelar-gelar yang buruk.",
                            "verse 49:12": "Hai orang-orang yang beriman, jauhilah kebanyakan dari prasangka, sesungguhnya sebagian prasangka itu adalah dosa dan janganlah kamu mencari-cari kesalahan orang lain dan janganlah sebahagian kamu menggunjing sebahagian yang lain.",
                            "verse 49:13": "Hai manusia, sesungguhnya Kami menciptakan kamu dari seorang laki-laki dan seorang perempuan dan menjadikan kamu berbangsa-bangsa dan bersuku-suku supaya kamu saling kenal mengenal.",
                            "verse 49:14": "Orang-orang Arab Badwi itu berkata: \"Kami telah beriman\".",
                            "verse 49:15": "Sesungguhnya orang-orang yang beriman hanyalah orang-orang yang beriman kepada Allah dan Rasul-Nya kemudian mereka tidak ragu-ragu dan mereka berjihad dengan harta dan jiwa mereka pada jalan Allah, mereka itulah orang-orang yang benar.",
                            "verse 49:16": "Katakanlah (kepada mereka): \"Apakah kamu akan memberitahukan kepada Allah tentang agamamu (keyakinanmu), padahal Allah mengetahui apa yang ada di langit dan apa yang ada di bumi dan Allah Maha Mengetahui segala sesuatu.",
                            "verse 49:17": "Mereka merasa telah memberi ni’mat kepadamu dengan keislaman mereka.",
                            "verse 49:18": "Sesungguhnya Allah mengetahui apa yang ghaib di langit dan di bumi."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "O credenti, non anticipate Allah e il Suo Messaggero e temete Allah! Allah è audiente, sapiente.",
                            "verse 49:2": "O credenti, non alzate la vostra voce al di sopra di quella del Profeta, e non alzate con lui la voce come l'alzate quando parlate tra voi, ché rischiereste di rendere vane le opere vostre a vostra insaputa.",
                            "verse 49:3": "Coloro che abbassano la voce davanti all'Inviato di Allah, sono quelli cui Allah ha disposto il cuore al timore [di Lui].",
                            "verse 49:4": "Quanto a coloro che ti chiamano dall'esterno delle tue stanze intime.",
                            "verse 49:5": "Se avessero atteso con pazienza finché tu non esca loro incontro, sarebbe stato meglio per loro .",
                            "verse 49:6": "O credenti, se un malvagio vi reca una notizia, verificatela, affinché non portiate, per disinformazione, pregiudizio a qualcuno e abbiate poi a pentirvi di quel che avrete fatto .",
                            "verse 49:7": "E sappiate che il Messaggero di Allah è tra voi.",
                            "verse 49:8": "voi sareste in gravi difficoltà; ma Allah vi ha fatto amare la fede e l'ha resa bella ai vostri cuori, così come vi ha fatto detestare la miscredenza, la malvagità e la disobbedienza.",
                            "verse 49:9": "",
                            "verse 49:10": "è la grazia di Allah e il Suo favore.",
                            "verse 49:11": "Se due gruppi di credenti combattono tra loro, riconciliateli.",
                            "verse 49:12": "uno di loro commettesse degli eccessi, combattete quello che eccede, finché non si pieghi all'Ordine di Allah.",
                            "verse 49:13": "In verità i credenti sono fratelli: ristabilite la concordia tra i vostri fratelli e temete Allah.",
                            "verse 49:14": "O credenti, non scherniscano alcuni di voi gli altri, ché forse questi sono migliori di loro.",
                            "verse 49:15": "O credenti, evitate di far troppe illazioni, ché una parte dell'illazione è peccato.",
                            "verse 49:16": "O uomini, vi abbiamo creato da un maschio e una femmina e abbiamo fatto di voi popoli e tribù, affinché vi conosceste a vicenda.",
                            "verse 49:17": "I Beduini hanno detto: «Crediamo».",
                            "verse 49:18": "azioni.",
                            "verse 49:19": "I veri credenti solo coloro che credono in Allah e nel Suo Inviato senza mai dubitarne e che lottano con i loro beni e le loro persone per la causa di Allah: essi sono i sinceri.",
                            "verse 49:20": "Di': « Sareste forse voi ad istruire Allah sulla vostra religione, mentre Allah conosce ciò che è nei cieli e sulla terra?».",
                            "verse 49:21": "Vantano questa sottomissione, come fosse un favore da parte loro.",
                            "verse 49:22": "Allah conosce l'invisibile dei cieli e della terra e Allah ben osserva quel che fate»."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "信仰する者よ，あなたがたはアッラーとその使徒を差し置いて勝手な振舞いをしてはならない。アッラーを畏れなさい。本当にアッラーは全聴にして全知であられる。",
                            "verse 49:2": "信仰する者よ，あなたがたの声を預言者の声よりも高く上げてはならない。またあなたがたが互いに声高に話す時のように，かれに大声で（話して）はならない。あなたがたの気付かない中に，自分の行いを虚しくしないために。",
                            "verse 49:3": "本当にアッラーの使徒の前でその声を低くする者は，アッラーがその心の敬虔さを試みられた者である。かれらには，赦しと偉大な報奨があろう。",
                            "verse 49:4": "本当に部屋の外から大声であなたを呼ぶ者の多くは，思慮分別のない者である。",
                            "verse 49:5": "もしかれらが，あなたの出て来るのを待つならば，それはかれらのためにも良い。本当にアッラーは寛容にして慈悲深くあられる。",
                            "verse 49:6": "信仰する者よ，もし邪な者が情報をあなたがたに(湾?)したならば，慎重に検討しなさい。これはあなたがたが，気付かない中に人びとに危害を及ぼし，その行ったことを後悔することにならないためである。",
                            "verse 49:7": "あなたがたの間にアッラーの使徒がいることを知れ。かれがもし多くの事柄に就いてあなたがたに従ったならば，あなたがたはきっと不幸に陥ったことであろう。だがアッラーは，あなたがたに信仰を好ましいものとなされ，またあなたがたの心を，それに相応しくして，あなたがたに不信心と邪悪と反逆を嫌うようになされた。これは正しく導かれた者である。",
                            "verse 49:8": "それもアッラーからの御恵みであり，恩恵である。アッラーは全知にして英明であられる。",
                            "verse 49:9": "もしも信者が2つに分れて争えば，両者の間を調停しなさい。もしかれらの一方が他方に対して，（一方的に）無法なことをするならば，無法者がアッラーの命令に立ち返るまで戦いなさい。だがかれらが立ちかえったならば，正義と公平を� としてかれらの間を調停しなさい。本当にアッラーは公正な者を愛される。",
                            "verse 49:10": "信者たちは兄弟である。だからあなたがたは兄弟の間の融和を図り，アッラーを畏れなさい。必ずあなたがたは慈悲にあずかるのである。",
                            "verse 49:11": "信仰する者よ，或る者たちに外の者たちを嘲笑させてはならない。それら（嘲笑された方）がかれらよりも優れているかも知れない。女たちにも外の女たちを（嘲笑させては）ならない。その女たちがかの女たちよりも，優れているかも知れない。そして互いに中傷してはならない。また綽名で，罵り合ってはならない。信仰に入った後は，悪を暗示するような呼名はよくない。それでも止めない者は不義の徒である。",
                            "verse 49:12": "信仰する者よ，邪推の多くを祓え。本当に邪推は，時には罪である。無用の詮索をしたりまた互いに陰日してはならない。死んだ兄弟の肉を，食べるのを誰が好もうか。あなたがたはそれを忌み嫌うではないか。アッラーを畏れなさい。本当にアッラーは度々赦される方，慈悲深い方であられる。",
                            "verse 49:13": "人びとよ，われは一人の男と一人の女からあなたがたを創り，種族と部族に分けた。これはあなたがたを，互いに知り合うようにさせるためである。アッラーの御許で最も貴い者は，あなたがたの中最も主を畏れる者である。本当にアッラーは，全知にして凡ゆることに通暁なされる。",
                            "verse 49:14": "砂漠のアラブたちは，「わたしたちは信仰します。」と言う。言ってやるがいい。「あなたがたは信じてはいない。ただ『わたしたちは入信しました』と言っているだけで，信仰はまだあなたがたの心の中に入ってはいない。もしあなたがたが，アッラーとその使徒に従うなら，かれはその行いに就いて，少しも（報奨を）軽減されることはない。本当にアッラーは寛容にして慈悲深くあられる。",
                            "verse 49:15": "本当に信者とは，一途にアッラーとその使徒を信じる者たちで，疑いを持つことなく，アッラーの道のために，財産と生命とを捧げて奮闘努力する者である。これらの者こそ真の信者である。」",
                            "verse 49:16": "言ってやるがいい。「あなたがたは自分の宗教を，アッラーに教えようとでも（思うのか）。アッラーは天地にある凡てのものを知っておられる。本当にアッラーは凡てのことを熟知しておられる。」",
                            "verse 49:17": "かれらは，自分がイスラームに帰依して，あなたに対する恩を施したように思っている。言ってやるがいい。「あなたがたの帰依は，わたしヘの恵みとはならない。もしあなたがたが真実（帰依した）なら，アッラーは，あなたがたを信仰に導くことを，あなたがたへの恵みとなされるのである。」",
                            "verse 49:18": "本当にアッラーは，天と地の奥義を知っておられる。アッラーは，あなたがたの所行をよく洞察なされる方である。 かれらは，自分がイスラームに帰依して，あなたに対する恩を施したように思っている。言ってやるがいい。「あなたがたの帰依は，わたしヘの恵みとはならない。もしあなたがたが真実（帰依した）なら，アッラーは，あなたがたを信仰に導くことを，あなたがたへの恵みとなされるのである。」"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "믿는 사람들이여 하나님과 그 분의 선지자 앞에서 자신을 앞세 우지 말고 하나님을 두려워 하라 실로 하나님은 모든 것을 들으시 고 아시니라",
                            "verse 49:2": "믿는 사람들이여 예언자의 목 소리보다 너희의 목소리가 높아서 는 아니 되나니 그분과 대화할 때는 소리를 높여 서는 아니되매 너희가 알지 못하여 너희 행위가 헛 되지 아니 하도록 함이라",
                            "verse 49:3": "하나님의 선지자 앞에서 목소 리를 낮추는 자들은 하나님께서 그들의 경건함을 시험한 자들이라 실로 그들에게는 관용과 큰 보상 이 있노라",
                            "verse 49:4": "안방 됫편에서 그대를 소리 쳐 부르는 자 그들 대다수는 알 지 못하는 자들이라",
                            "verse 49:5": "그대가 나올 때까지 인내하며기다리는 것이 그들에게 더 좋은 것이리라 실로 하나님은 관용과 자비로 충만하시니라",
                            "verse 49:6": "믿는 사람들이여 사학한 자가너희에게 소식을 전할 때는 그 소식을 확인하라 이는 너희가 사실 을 알지 못하여 백성에게 해악을 끼치지 아니하고 너희가 후희하지않도록 함이라",
                            "verse 49:7": "그리고 너희 가운데 선지자가함께 하고 있음을 알라 그가 어떤많은 일들에 너희의 뜻을 따랐다 면 실로 너희는 곤경에 빠졌으리 라 그러나 하나님은 너희로 하여 금 믿음을 더 사랑케 하고 너희 심중을 더 아름답게 하사 너희로 하여금 불신과 죄악과 거역함을 증오하도록 하셨으니 실로 그것이옳은 길을 걷는 자들이라",
                            "verse 49:8": "실로 이것은 하나님의 은혜와은총이니 실로 하나님은 아심과 지혜로 충만하심이라",
                            "verse 49:9": "믿음을 가진 신도들이 두 무 리로 분리되어 싸운다면 그들 사 이를 화해시키되 그들 증의 한 무리가 다른 무리에 대하여 죄악을 범한다면 너희 모두는 그들이 하 나님의 명령에 동의할 때까지 죄 악을 범한 무리와 싸우라 그러나 그들이 동의한다면 정의와 공평으로써 그들을 화해시키라 실로 하 나님은 의로운 자들만을 사랑하시니라",
                            "verse 49:10": "믿는 자들은 한 \\xC2Á제라 그러므로 싸우는 너희 두 형제들 사 이를 화해시키며 하나님을 두려워 하라 그리하면 너희가 은혜를 받 으리라",
                            "verse 49:11": "믿는 사람들이여 사람이 다 른 사람을 비웃지 않도록 하라 후 자가 전자보다 훌륭할 수도 있노 라 여성이 다른 여성을 비웃지 않 도록 하라 후자가 전자보다 훌륭 할 수도 있노라 서로가 서로에게 중상하는 것과 저속한 변명도 아 니 되니라 믿음을 가진 후의 저속 한 이름은 사악한 것이며 회개하 지 아니 한 자 실로 죄인이라",
                            "verse 49:12": "믿는 사람들이여 가능한 의 심을 피하라 어떤 일에 있어서의 의심은 하나의 죄악이라 그리고 서로가 서로를 감시하지 말며 서 로가 서로를 험담하지 말라 너희 중에 죽은 형제의 살을 먹고자 하 는자 아무도 없노라 실로 너희는 그것을 증오하리라 하나님을 두려 워 하라 실로 하나님은 관용과 자 비로 충만하시니라",
                            "verse 49:13": "사람들이여 하나님이 너희를창조하사 남성과 여성을 두고 종 족과 부족을 두었으되 서로가 서 로를 알도록 하였노라 하나님 앞 에서 가장 크게 영광을 받을 자는 가장 의로운 자로 하나님은 모든 것을 아시며 관찰하시는 분이시라",
                            "verse 49:14": "사막의 유목민들이 저희는믿나이다 라고 말하도다 일러가로 되 너희는 믿지 아니하고 귀의하 였습니다 라고 말할 뿐이라 저희 심중에 아직 믿음이 이르지 아니 하였노라 만일 너희가 하나님과 그분의 선지자를 믿는다면 그분께 서는 너희 행위에 대한 보상을 조 금도 감소하지 아니 하시니라 실 로 하나님은 관용과 자비로 충만 하심이라",
                            "verse 49:15": "믿는 신앙인이란 하나님과 선지자를 믿되 의심하지 아니하고 하나님의 사업을 위해 그들의 재 산과 생명으로 성전하는 자들이 바로 믿는 신앙인들이라",
                            "verse 49:16": "일러가로되 너희가 하나님께너희의 종교를 일러 주겠다는 것 이뇨 그러나 하나님은 하늘과 대 지위에 있는 모든 것을 아시나니 실로 하나님은 모든 것을 아심으 로 충만하시니라",
                            "verse 49:17": "그들이 무슬림 됨이 그대에 게 은혜를 베푼 것으로 생각하나 일러가로되 너희가 무슬림 됨이 나에게 은혜된 것이라 생각지 말 라 하나님께서 너희에게 은혜를 베푸사 너희를 믿음으로 인도하셨 나니 너희는 진실되고 성실해야 하니라",
                            "verse 49:18": "실로 하나님은 하늘과 대지 의 모든 비밀을 알고 계시며 너희 가 행하는 모든 것을 지켜보고 계 시니라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "ئه‌ی ئه‌و که‌سانه‌ی باوه‌ڕتان هێناوه پێشی خواو پێغه‌مبه‌ری خوا مه‌که‌ون له‌بڕیار و پێشنیاردا له‌خوا بترسن و پارێزکاربن، چونکه‌به‌ڕاستی خوا بیسه‌ره به‌گوفتار‌تان، زانایه به‌نیازو نهێنیه‌کانتان.",
                            "verse 49:2": "ئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه‌، ده‌نگتان به‌سه‌ر ده‌نگی پێغه‌مبه‌ر (صلى الله عليه وسلم) به‌رز مه‌که‌نه‌وه‌له‌کاتی گفتو گۆدا، قسه‌بێ په‌رده‌مه‌که‌ن له‌خزمه‌تیدا، نه‌وه‌کو کرده‌وه‌کانتان پووچ بێته‌وه و هه‌ستیشی پێ نه‌که‌ن.",
                            "verse 49:3": "به‌ڕاستی ئه‌وانه‌ی که‌ده‌نگیان هێواش ده‌که‌نه‌وه‌له‌خزمه‌ت پێغه‌مبه‌ری خوادا، ئه‌وانه‌ئه‌و که‌سانه‌ن که‌خوای گه‌وره‌دڵه‌کانیانی زاخاو داوه‌بۆ ته‌قواو خواناسین، ئه‌وانه‌لێ خۆشبوون و پاداشتی گه‌وره‌و گرانبه‌ها بۆیان ئاماده‌یه.",
                            "verse 49:4": "به‌ڕاستی ئه‌وانه‌ی له‌ده‌ره‌وه‌ی ژووره‌کان بانگت ده‌که‌ن، ئه‌وانه‌زۆربه‌یان نه‌فامن و ژیری وه‌رناگرن (چونکه‌ره‌وشتی کۆمه‌ڵایه‌تی دروستیان له‌و بواره‌دا ڕه‌چاو نه‌کردووه‌).",
                            "verse 49:5": "خۆ ئه‌گه‌ر ئه‌وانه‌خۆگربوونایه‌، تا ده‌چویته ده‌ره‌وه‌بۆ لایان، ئه‌وه‌چاکتر و ڕه‌واتر بوو بۆیان خوا لێخۆشبوو میهره‌بانه‌، (ده‌کرێت ئه‌م چوار ئایه‌ته ڕێنموویی بێت بۆ سه‌رجه‌م ئیمانداران، تا ڕێزی پێشه‌واکانیان بگرن).",
                            "verse 49:6": "ئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناون ئه‌گه‌ر که‌سێکی متمانه‌پێ نه‌کراو هه‌واڵێکی گرنگی بۆ هێنان، خێرا بڕوای پێ مه‌که‌ن، به‌ڵکو سه‌رنج بده‌ن، لێی بکۆڵنه‌وه تا بۆتان ڕوون ده‌بێته‌وه‌، نه‌وه‌کو ئازارو ناخۆشی و گیروگرفت بۆ خه‌ڵکی دروست بکه‌ن به‌نه‌زانی، جا دوای په‌شیمان ببنه‌وه‌له‌و کاره‌ی که‌پێی هه‌ستاون.",
                            "verse 49:7": "ئێوه دڵنیابن و بزانن که‌پێغه‌مبه‌ری خوا له‌ناوتاندایه (پرس و ڕای پێ بکه‌ن) زۆر شت هه‌یه ئه‌گه‌ر ئه‌و، به‌ڕای ئێوه‌ی بکردایه تووشی گیروگرفت و ناخۆشی ده‌بوون.",
                            "verse 49:8": "ئه‌مه‌ش خۆی ڕێزو به‌خششێکی تایبه‌تی و نازو نیعمه‌تێکه له‌لایه‌ن خواوه‌پێیان دراوه‌، خوایش زاناو داناو کاربه‌جێیه.",
                            "verse 49:9": "ئه‌گه‌ر دوو ده‌سته‌، یان دوو تاقم له‌موسوڵمانان بوو به‌شه‌ڕیان، ئه‌وه‌ده‌ستبه‌جێ هه‌وڵ بده‌ن ڕێکیان بخه‌ن و ئاشتیان بکه‌نه‌وه‌، خۆ ئه‌گه‌ر لایه‌کیان هه‌ر ده‌ستدرێژی ده‌کرده‌سه‌ر لاکه‌ی تر، ئه‌وا ئێوه به‌گژ ئه‌وه‌یاندا بچن که‌سته‌م و ده‌ستدرێژی ده‌کات،، هه‌تا ده‌گه‌ڕێته‌وه بۆ فه‌رمانی خوا.",
                            "verse 49:10": "له‌ڕاستیدا هه‌ر ئیمانداران برای یه‌کن، که‌واته‌هه‌رکاتێک له‌نێوان دوو براتاندا ناکۆکی په‌یدا بوو، ئێوه نێوانیان چاک بکه‌ن و ئاشتیان بكه‌نه‌وه‌، هه‌میشه له‌خوا بترسن و پارێزکار بن، بۆ ئه‌وه‌ی ڕه‌حمتان پێ بکرێت.",
                            "verse 49:11": "ئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه! هیچ که‌س و هیچ هۆزێک گاڵته به‌که‌س و هۆزێکی تر نه‌کات و زه‌لیلی نه‌کات، چونکه‌له‌وانه‌یه ئه‌وان چاکتر بن له‌مان، ژنانیش به‌گاڵته به‌یه‌ک نه‌که‌ن و یه‌کتر زه‌لیل نه‌که‌ن، چونکه‌له‌وانه‌یه ئه‌مان له‌وان چاکتر بن.",
                            "verse 49:12": "ئه‌ی ئه‌و که‌سانه‌ی باوه‌ڕتان هێناوه‌، خۆتان زۆر بپارێزن له‌گومانی خراپ، له‌ڕاستیدا هه‌ندێ له‌و گومانانه گوناهو تاوانن (بۆیه حه‌ق وایه له‌هه‌موو گومانێک خۆپارێزبین) به‌شوێن که‌مو کووڕیی و عه‌یب و عاری یه‌کتردا مه‌گه‌ڕێن و سیخوڕی مه‌که‌ن و له‌پاش مله‌باسی یه‌کتری به‌خراپ مه‌به‌ن، ئایا که‌ستان خۆشی دێت له‌وه‌ی گۆشتی برای خۆی به‌مردوویی بخوات؟! دیاره کاری واتان زۆر پێ سه‌خت و ناخۆشه‌، ده‌ی که‌واته‌له‌خوا بترسن و پارێزگار بن، چونکه‌به‌ڕاستی خوا گه‌ڕانه‌وه‌ی خه‌ڵکی وه‌رده‌گرێت و میهره‌بانه بۆتان.",
                            "verse 49:13": "ئه‌ی خه‌ڵکینه بێگومان ئێمه هه‌مووتانمان له‌نێرو مێیه‌ک دروستکردووه (که‌باوکه‌ئاده‌م و دایکه حه‌وایه‌) و کردوومانن به‌چه‌نده‌ها گه‌ل و تیره و هۆزی جۆربه‌جۆر، تا یه‌کتر بناسن و په‌یوه‌ندیتان خۆش بێت به‌یه‌که‌وه.",
                            "verse 49:14": "هه‌ندێک له‌بیابان نشینه عه‌ره‌به‌کان وتیان: باوه‌ڕمان هێناو و موسڵمانین، پێیان بڵێ: نه‌خێر، باوه‌ڕتان نه‌هێناوه‌، به‌ڵام بڵێن: به‌ناچاری موسوڵمان بووین، هێشتا باوه‌ڕ نه‌چۆته ناو دڵه‌کانتانه‌وه و تیایدا جێگیر نه‌بووه (چاوه‌ڕێ ده‌کرێت که‌باوه‌ڕ بهێنن)، خۆ ئه‌گه‌ر به‌ڕاستی ئێوه گوێڕایه‌ڵی فه‌رمانی خواو پێغه‌مبه‌ری خوا بن، ئه‌وه‌خوای گه‌وره‌له‌پاداشتی چاکه‌کانتان هیچ که‌م ناکاته‌وه‌، چونکه‌به‌ڕاستی خوا لێخۆشبوو میهره‌بانه.",
                            "verse 49:15": "بێگومان ئیماندارانی ڕاست ئه‌وانه‌ن که‌باوه‌ڕیان به‌خواو پێغه‌مبه‌ری خوا هێناوه و پاشان نه‌که‌وتوونه‌ته‌هیچ گومان و دوودڵیه‌که‌وه‌، به‌خۆیان و سه‌رو ماڵیشیانه‌وه تێکۆشاون له‌پێناوی ئاینی خوادا، ته‌نها ئا ئه‌وانه‌ڕاستن.",
                            "verse 49:16": "ئه‌ی محمد (صلى الله عليه وسلم) بڵێ: ئایا ئێوه خوای گه‌وره‌له‌ئاینی خۆتان ئاگادار ده‌که‌ن و پێی ڕاده‌گه‌یه‌نن، له حاڵێکدا خوا زانایه به‌هه‌رچی له‌ئاسمانه‌کان و زه‌ویدا هه‌یه‌، خوا به‌هه‌موو شتێک زاناو ئاگاداره‌؟!",
                            "verse 49:17": "ئه‌وانه‌منه‌ت ده‌که‌ن به‌سه‌ر تۆدا که‌گوایه موسڵمان بوون، پێیان بڵێ: منه‌ت مه‌که‌ن به‌سه‌رمدا له‌سه‌ر موسڵمان بوونه‌که‌تان، به‌ڵکو خوا منه‌ت ده‌کات به‌سه‌ر ئێوه‌دا که‌هیدایه‌تی داون بۆ ئیمان و باوه‌ڕ ئه‌گه‌ر ئێوه ڕاستگۆن.",
                            "verse 49:18": "بێگومان خوا نهێنی و شاراوه‌کانی ئاسمان و زه‌وی ده‌زانێت، هه‌روه‌ها خوای گه‌وره‌بینایه به‌هه‌موو ئه‌و کرده‌وانه‌ی که‌ئه‌نجانی ده‌ده‌ن."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "Wahai orang-orang yang beriman! Janganlah kamu memandai-mandai (melakukan sesuatu perkara) sebelum (mendapat hukum atau kebenaran) Allah dan RasulNya dan bertakwalah kamu kepada Allah; sesungguhnya Allah Maha Mendengar, lagi Maha Mengetahui.",
                            "verse 49:2": "Wahai orang-orang yang beriman! Janganlah kamu mengangkat suara kamu melebihi suara Nabi dan janganlah kamu menyaringkan suara (dengan lantang) semasa bercakap dengannya sebagaimana setengah kamu menyaringkan suaranya semasa bercakap dengan setengahnya yang lain.",
                            "verse 49:3": "Sesungguhnya orang-orang yang merendahkan suaranya semasa mereka berada di sisi Rasulullah s.",
                            "verse 49:4": "Sesungguhnya orang-orang yang memanggilmu dari luar bilik-bilik (tempat ahlimu, wahai Muhammad), kebanyakan mereka tidak mengerti (adab dan tata tertib).",
                            "verse 49:5": "Dan kalaulah mereka bersabar menunggu sehingga engkau keluar menemui mereka, tentulah cara yang demikian lebih baik bagi mereka dan (ingatlah), Allah Maha Pengampun, lagi Maha Mengasihani.",
                            "verse 49:6": "Wahai orang-orang yang beriman! Jika datang kepada kamu seorang fasik membawa sesuatu berita, maka selidikilah (untuk menentukan) kebenarannya, supaya kamu tidak menimpakan sesuatu kaum dengan perkara yang tidak diingini dengan sebab kejahilan kamu (mengenainya) sehingga menjadikan kamu menyesali apa yang kamu telah lakukan.",
                            "verse 49:7": "Dan ketahuilah! Bahawasanya dalam kalangan kamu ada Rasulullah (maka janganlah kemahuan atau pendapat kamu mendahului pentadbirannya); kalaulah ia menurut kehendak kamu dalam kebanyakan perkara, tentulah kamu akan mengalami kesukaran; akan tetapi (Rasulullah tidak menurut melainkan perkara yang diwahyukan kepadanya, dan kamu wahai orang-orang yang beriman hendaklah bersyukur kerana) Allah menjadikan iman suatu perkara yang kamu cintai serta di perhiaskannya dalam hati kamu dan menjadikan kekufuran dan perbuatan fasik serta perbuatan derhaka itu: Perkara-perkara yang kamu benci; mereka yang bersifat demikian ialah orang-orang yang tetap menurut jalan yang lurus; -",
                            "verse 49:8": "(Mereka dijadikan berkeadaan demikian) sebagai limpah kurnia dan nikmat pemberian dari Allah dan (ingatlah), Allah Maha Mengetahui, lagi Maha Bijaksana.",
                            "verse 49:9": "Dan jika dua puak dari orang-orang yang beriman berperang, maka damaikanlah di antara keduanya; jika salah satunya berlaku zalim terhadap yang lain, maka lawanlah puak yang zalim itu sehingga dia kembali mematuhi perintah Allah; jika dia kembali patuh maka damaikanlah di antara keduanya dengan adil (menurut hukum Allah), serta berlaku adillah kamu (dalam segala perkara); sesungguhnya Allah mengasihi orang-orang yang berlaku adil.",
                            "verse 49:10": "Sebenarnya orang-orang yang beriman itu adalah bersaudara, maka damaikanlah di antara dua saudara kamu (yang bertelingkah) itu dan bertakwalah kepada Allah supaya kamu beroleh rahmat.",
                            "verse 49:11": "Wahai orang-orang yang beriman! Janganlah sesuatu puak (dari kaum lelaki) mencemuh dan merendah-rendahkan puak lelaki yang lain, (kerana) harus puak yang dicemuhkan itu lebih baik daripada mereka dan janganlah pula sesuatu puak dari kaum perempuan mencemuh dan merendah-rendahkan puak perempuan yang lain, (kerana) harus puak yang dicemuhkan itu lebih baik daripada mereka dan janganlah setengah kamu menyatakan keaiban setengahnya yang lain dan janganlah pula kamu panggil-memanggil antara satu dengan yang lain dengan gelaran yang buruk.",
                            "verse 49:12": "Wahai orang-orang yang beriman! Jauhilah kebanyakan dari sangkaan (supaya kamu tidak menyangka sangkaan yang dilarang) kerana sesungguhnya sebahagian dari sangkaan itu adalah dosa dan janganlah kamu mengintip atau mencari-cari kesalahan dan keaiban orang dan janganlah setengah kamu mengumpat setengahnya yang lain.",
                            "verse 49:13": "Wahai umat manusia! Sesungguhnya Kami telah menciptakan kamu dari lelaki dan perempuan dan Kami telah menjadikan kamu berbagai bangsa dan bersuku puak, supaya kamu berkenal-kenalan (dan beramah mesra antara satu dengan yang lain).",
                            "verse 49:14": "Orang-orang \" A'raab\" berkata: Kami telah beriman.",
                            "verse 49:15": "Sesungguhnya orang-orang yang sebenar-benarnya beriman hanyalah orang-orang yang percaya kepada Allah dan RasulNya, kemudian mereka (terus percaya dengan) tidak ragu-ragu lagi, serta mereka berjuang dengan harta benda dan jiwa mereka pada jalan Allah; mereka itulah orang-orang yang benar (pengakuan imannya).",
                            "verse 49:16": "Katakanlah (kepada orang-orang \"A'raab\" itu wahai Muhammad): Patutkah kamu hendak memberitahu kepada Allah tentang agama kamu (dengan berkata: Kami telah beriman)? Padahal Allah mengetahui segala yang ada di langit dan yang ada di bumi dan Allah Maha Mengetahui akan tiap-tiap sesuatu.",
                            "verse 49:17": "Mereka mengira dirinya berbudi kepadamu (wahai Muhammad) dengan sebab mereka telah Islam (tidak melawan dan tidak menentang).",
                            "verse 49:18": "Sesungguhnya Allah mengetahui segala rahsia langit dan bumi dan Allah Maha Melihat akan segala yang kamu kerjakan."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "اى كسانى كه ايمان آورده‏ايد! چيزى را بر خدا و رسولش مقدم نشمريد (و پيشى مگيريد)، و تقواى الهى پيشه كنيد كه خداوند شنوا و داناست!",
                            "verse 49:2": "اى كسانى كه ايمان آورده‏ايد! صداى خود را فراتر از صداى پيامبر نكنيد، و در برابر او بلند سخن مگوييد (و داد و فرياد نزنيد) آن گونه كه بعضى از شما در برابر بعضى بلند صدا مى‏كنند، مبادا اعمال شما نابود گردد در حالى كه نمى‏دانيد!",
                            "verse 49:3": "آنها كه صداى خود را نزد رسول خدا كوتاه مى‏كنند همان كسانى هستند كه خداوند دلهايشان را براى تقوا خالص نموده، و براى آنان آمرزش و پاداش عظيمى است!",
                            "verse 49:4": "(ولى) كسانى كه تو را از پشت حجره‏ها بلند صدا مى‏زنند، بيشترشان نمى‏فهمند!",
                            "verse 49:5": "اگر آنها صبر مى‏كردند تا خود به سراغشان آيى، براى آنان بهتر بود; و خداوند آمرزنده و رحيم است!",
                            "verse 49:6": "اى كسانى كه ايمان آورده‏ايد! اگر شخص فاسقى خبرى براى شما بياورد، درباره آن تحقيق كنيد، مبادا به گروهى از روى نادانى آسيب برسانيد و از كرده خود پشيمان شويد!",
                            "verse 49:7": "و بدانيد رسول خدا در ميان شماست; هرگاه در بسيارى از كارها از شما اطاعت كند، به مشقت خواهيد افتاد; ولى خداوند ايمان را محبوب شما قرار داده و آن را در دلهايتان زينت بخشيده، و (به عكس) كفر و فسق و گناه را منفورتان قرار داده است; كسانى كه داراى اين صفاتند هدايت يافتگانند!",
                            "verse 49:8": "(و اين براى شما بعنوان) فضل و نعمتى از سوى خداست; و خداوند دانا و حكيم است!",
                            "verse 49:9": "و هرگاه دو گروه از مؤمنان با هم به نزاع و جنگ پردازند، آنها را آشتى دهيد; و اگر يكى از آن دو بر ديگرى تجاوز كند، با گروه متجاوز پيكار كنيد تا به فرمان خدا بازگردد; و هرگاه بازگشت (و زمينه صلح فراهم شد)، در ميان آن دو به عدالت صلح برقرار سازيد; و عدالت پيشه كنيد كه خداوند عدالت پيشگان را دوست مى‏دارد",
                            "verse 49:10": "مؤمنان برادر يكديگرند; پس دو برادر خود را صلح و آشتى دهيد و تقواى الهى پيشه كنيد، باشد كه مشمول رحمت او شويد!",
                            "verse 49:11": "اى كسانى كه ايمان آورده‏ايد! نبايد گروهى از مردان شما گروه ديگر را مسخره كنند، شايد آنها از اينها بهتر باشند; و نه زنانى زنان ديگر را، شايد آنان بهتر از اينان باشند; و يكديگر را مورد طعن و عيبجويى قرار ندهيد و با القاب زشت و ناپسند يكديگر را ياد نكنيد، بسيار بد است كه بر كسى پس از ايمان نام كفرآميز بگذاريد; و آنها كه توبه نكنند، ظالم و ستمگرند!",
                            "verse 49:12": "اى كسانى كه ايمان آورده‏ايد! از بسيارى از گمانها بپرهيزيد، چرا كه بعضى از گمانها گناه است; و هرگز (در كار ديگران) تجسس نكنيد; و هيچ يك از شما ديگرى را غيبت نكند، آيا كسى از شما دوست دارد كه گوشت برادر مرده خود را بخورد؟! (به يقين) همه شما از اين امر كراهت داريد; تقواى الهى پيشه كنيد كه خداوند توبه‏پذير و مهربان است!",
                            "verse 49:13": "اى مردم! ما شما را از يك مرد و زن آفريديم و شما را تيره‏ها و قبيله‏ها قرار داديم تا يكديگر را بشناسيد; (اينها ملاك امتياز نيست،) گرامى‏ترين شما نزد خداوند با تقواترين شماست; خداوند دانا و آگاه است!",
                            "verse 49:14": "عربهاى باديه‏نشين گفتند: «ايمان آورده‏ايم‏» بگو: «شما ايمان نياورده‏ايد، ولى بگوييد اسلام آورده‏ايم، اما هنوز ايمان وارد قلب شما نشده است! و اگر از خدا و رسولش اطاعت كنيد، چيزى از پاداش كارهاى شما را فروگذار نمى‏كند، خداوند، آمرزنده مهربان است»",
                            "verse 49:15": "مؤمنان واقعى تنها كسانى هستند كه به خدا و رسولش ايمان آورده‏اند، سپس هرگز شك و ترديدى به خود راه نداده و با اموال و جانهاى خود در راه خدا جهاد كرده‏اند;آنها راستگويانند",
                            "verse 49:16": "بگو: «آيا خدا را از ايمان خود با خبر مى‏سازيد؟! او تمام آنچه را در آسمانها و زمين است مى‏داند; و خداوند از همه چيز آگاه است!»",
                            "verse 49:17": "آنها بر تو منت مى‏نهند كه اسلام آورده‏اند; بگو: «اسلام آوردن خود را بر من منت نگذاريد، بلكه خداوند بر شما منت مى‏نهد كه شما را به سوى ايمان هدايت كرده است، اگر (در ادعاى ايمان) راستگو هستيد!",
                            "verse 49:18": "خداوند غيبت آسمانها و زمين را مى‏داند و نسبت به آنچه انجام مى‏دهيد بيناست!»"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "Ó fiéis, não vos antecipeis a Deus e ao Seu Mensageiro, e temei a Deus, porque Deus é Oniouvinte, Sapientíssimo.",
                            "verse 49:2": "Ó fiéis, não altereis as vossas vozes acima da voz do Profeta, nem lhe faleis em voz alta, como fazeis entre vós, para não tornardes sem efeito as vossas obras, involuntariamente.",
                            "verse 49:3": "Sabei que os que baixam as suas vozes na presença do Mensageiro de Deus, são aqueles cujos corações Deus testou para a piedade; obterão o perdão e uma magnífica recompensa.",
                            "verse 49:4": "Em verdade, a maioria daqueles que gritam (o teu nome), do lado de fora dos (teus) aposentos, é insensata.",
                            "verse 49:5": "Mas, se aguardassem pacientemente, até que tu saísses ao seu encontro, seria muito melhor para eles.",
                            "verse 49:6": "Ó fiéis, quando um ímpio vos trouxer uma notícia, examinai-a prudentemente, para não prejudicardes ninguém, por ignorância, e não vos arrependerdes depois.",
                            "verse 49:7": "E sabei que o Mensageiro de Deus está entre vós e que se ele vos obedecesse em muitos assuntos, cairíeis em desgraça.",
                            "verse 49:8": "Isso, pela graça e favor de Deus; e Deus é Prudente, Sapientíssimo.",
                            "verse 49:9": "E quando dois grupos de fiéis combaterem entre si, reconciliai-os, então.",
                            "verse 49:10": "Sabe que os fiéis são irmãos uns dos outros; reconciliai, pois, os vossos irmãos, e temei a Deus, para vos mostrar misericórdia.",
                            "verse 49:11": "Ó fiéis, que nenhum povo zombe do outro; é possível que (os escarnecidos) sejam melhores do que eles (os escarnecedores).",
                            "verse 49:12": "Ó fiéis, evitai tanto quanto possível a suspeita, porque algumas suspeitas implicam em pecado.",
                            "verse 49:13": "Ó humanos, em verdade, Nós vos criamos de macho e fêmea e vos dividimos em povos e tribos, para reconhecerdes uns aos outros.",
                            "verse 49:14": "Os beduínos dizem: Cremos! Dize-lhes: Qual! Ainda não credes; deveis dizer: Tornamo-nos muçulmanos, pois que a fé ainda não penetrou vossos corações.",
                            "verse 49:15": "Somente são fiéis aqueles que crêem em Deus e em Seu Mensageiro e não duvidam, mas sacrificam os seus bens e as suas pessoas pela causa de Deus.",
                            "verse 49:16": "Dize-lhes: Pretendeis, acaso, ensinar a Deus a vossa religião, quando Deus bem conhece tudo quanto existe nos céus e na terra? Sabei que Deus é Onisciente.",
                            "verse 49:17": "Dizem que te fizeram um favor por se terem tornado muçulmanos.",
                            "verse 49:18": "Sabei que Deus conhece o mistério dos céus e da terra, e Deus bem vê tudo o quanto fazeis!"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 49:1": "O, voi cei care credeți! Nu o luați înaintea lui Allah și a Trimisului Sãu și fiți cu fricã de Allah! Allah este Cel care Aude Totul [și este] Atoateștiutor [Sami', 'Alim].",
                            "verse 49:2": "O, voi cei care credeți! Nu ridicați glasurile voastre peste glasul Profetului și nu strigați când vorbiți cu el, așa cum strigați voi unii la alții , pentru ca faptele voastre sã nu fie în",
                            "verse 49:3": "Aceia care coboarã glasurile lor înaintea Trimisului lui Allah sunt aceia ale cãror inimi le-a încercat Allah pentru evlavie; ei vor avea parte de iertare și de rãsplatã mare,",
                            "verse 49:4": "Aceia care te cheamã din afara odãilor tale , cei mai mulți dintreei nu au judecatã .",
                            "verse 49:5": "Dacã ar avea ei rãbdare pânã ce tu ieși la ei, ar fi mai bine pentru ei.",
                            "verse 49:6": "O, voi cei care credeți! Dacã vine la voi un nelegiuit cu o veste,chibzuiți cu",
                            "verse 49:7": "bãgare de seamã , ca sã nu pricinuiți rãu unuineam, din neștiințã, și sã",
                            "verse 49:8": "Și sã știți cã Trimisul lui Allah este printre voi.",
                            "verse 49:9": "Un har de la Allah și o îndurare.",
                            "verse 49:10": "Înțelept ['Alim, Hakim].",
                            "verse 49:11": "Și dacã douã cete de dreptcredincioși se ceartã între ele, voi împã- cați-le! Dacã una dintre ele este nedreaptã cu cealaltã, atunci luptați împotriva celei care este nedreaptã",
                            "verse 49:12": "Dreptcredincioșii sunt frați.",
                            "verse 49:13": "O, voi cei care credeți! Sã nu râdã un neam de alt neam, care s-ar putea sã fie mai bun decât el, nici muierile [sã nu râdã] de alte muieri, care s-ar putea sã fie mai bune decât ele! Nu vã",
                            "verse 49:14": "O, voi cei care credeți! Feriți-vã cu strãșnicie de bãnuieli, cãci unele bãnuieli sunt pãcat ! Nu vã iscodiți și nu vã ponegriți unii pe alții! Oar",
                            "verse 49:15": "O, voi oameni! Noi v-am creat pe voi dintr-un bãrbat și o muiereși v-am fãcut pe voi popoare și triburi, pentru ca sã vã cunoașteți.",
                            "verse 49:16": "Au zis arabii beduini : \"Noi credem!\" Spune: \"Voi nu credeți! Ci ziceți: \"Noi suntem supuși!\", fiindcã nu a intrat credința încã în inimile voastre! Și de veți arãta ascultare lui Allah ș",
                            "verse 49:17": "Dreptcredincioși sunt numai aceia care cred în Allah și în Trimisul Sãu, care apoi nu s-au mai îndoit și au luat parte la luptã cu averile lor și cu sufletele lor, pe calea lui Allah .",
                            "verse 49:18": "Spune : \"Oare voiți sã-I vorbiți lui Allah despre credința voastrã, când Allah știe ce este în ceruri și ce este pre pãmânt și când Allah este a toate știutor?\"",
                            "verse 49:19": "Ei îți amintesc cã ți-au fãcut cinste îmbrãțișând Islamul.",
                            "verse 49:20": "Allah știe Necunoscutul din ceruri și de pre pãmânt și Allah vede bine ceea ce faceți voi."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 49:1": "O, voi cei ce credeţi! Nu o luaţi înaintea lui Dumnezeu şi a trimisului Său! Temeţi-vă de Dumnezeu! Dumnezeu este Auzitorul, Ştiutorul!",
                            "verse 49:2": "O, voi cei ce credeţi! Nu vă ridicaţi glasurile peste glasul Profetului şi nu-i vorbiţi în gura mare, precum faceţi între voi, căci deşarte vor fi faptele voastre, fără să vă daţi seama.",
                            "verse 49:3": "Cei care îşi coboară însă glasurile în preajma trimisului lui Dumnezeu, acelora Dumnezeu le-a pus la încercare inimile întru teamă şi ei vor căpăta iertare şi mare răsplată.",
                            "verse 49:4": "Cei care te cheamă din afara încăperilor, în majoritatea lor, nu au minte.",
                            "verse 49:5": "Dacă ar răbda până când ai ieşi la ei, ar fi mai bine pentru ei.",
                            "verse 49:6": "O, voi cei ce credeţi! Dacă un desfrânat vă aduce o veste, limpeziţi-o ca să nu loviţi un popor din neştiinţă, iar apoi să vă pară rău de ceea ce-aţi făcut.",
                            "verse 49:7": "Să ştiţi că între voi este trimisul lui Dumnezeu.",
                            "verse 49:8": "prin harul lui Dumnezeu şi binefacerea Sa.",
                            "verse 49:9": "Dacă două tabere de credincioşi se războiesc, împăcaţi-le.",
                            "verse 49:10": "Credincioşii sunt fraţi.",
                            "verse 49:11": "O, voi cei ce credeţi! Să nu-şi bată joc unii oameni de alţii care ar putea fi mai buni decât ei.",
                            "verse 49:12": "O, voi cei ce credeţi! Feriţi-vă mult de născociri, căci unele născociri sunt cu păcat.",
                            "verse 49:13": "O, voi oameni! Noi v-am creat dintr-un bărbat şi o femeie şi v-am făcut popoare şi triburi ca voi să vă cunoaşteţi unii pe alţii.",
                            "verse 49:14": "Beduinii spun: “Noi credem!” Spune: “Voi nu credeţi, ci mai bine aţi spune: Noi ne supunem.",
                            "verse 49:15": "Credincioşii sunt numai cei care cred în Dumnezeu şi în trimisul Său şi nu se îndoiesc mai apoi şi se luptă pe calea lui Dumnezeu cu averile şi făpturile lor.",
                            "verse 49:16": "Spune: “Îl învăţaţi pe Dumnezeu legea voastră?” Dumnezeu cunoaşte ceea ce este în ceruri, precum şi pe pământ.",
                            "verse 49:17": "Beduinii vor să le fii recunoscător pentru supunerea lor! Spune: “Nu trebuie să vă fiu eu recunoscător pentru supunerea voastră, ci voi trebuie să-I fiţi recunoscători lui Dumnezeu că v-a călăuzit către credinţă, dacă spuneţi adevărul!”",
                            "verse 49:18": "Da, Dumnezeu cunoaşte Taina cerurilor şi a pământului."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "О вы, кто верует!(В решениях и действиях своих)Себя перед Аллахом и посланникомЕго ни в чем не выставляйте,Страшитесь (разгневить) Его, —Он, истинно, все слышит и все знает!",
                            "verse 49:2": "О вы, кто верует!Не возвышайте голос свойНад голосом Господнего пророкаИ громким голосом речь не ведитес ним,Как вы порою обращаетесь другк другу,Чтобы поступки ваши тщетнымине стали,А вы к тому ж не ведали об этом.",
                            "verse 49:3": "Ведь те, кто пред посланникомАллаха голос понижает,Суть те, сердца которых испытална благочестие Аллах, —Их ждет прощение и щедрая награда.",
                            "verse 49:4": "А те, кто громко из покоев тебякличет, —Они же, в большинстве своем,Любого разуменья лишены.",
                            "verse 49:5": "И если б им терпения хватилоподождать,Пока ты сам к ним выйдешь,Для них бы это было лучше, —Аллах ведь всепрощающ, милосерд!",
                            "verse 49:6": "О вы, кто верует!Коль человек злонравный с вестьюк вам придет,То постарайтесь истинность сей вестиуточнить,Чтоб по неведению своемуЗла не причинить (невинным) людям,А после не раскаиваться в том,что сделал.",
                            "verse 49:7": "И знайте, что средь вас — посланникот Аллаха,И если бы в делах мирскихОн часто следовал советам вашим,Вы б претерпели много бед.",
                            "verse 49:8": "По милости и щедрости Аллаха, —Исполнен знания и мудрости Аллах!",
                            "verse 49:9": "А коль средь тех, кто верует,Одни вступили в спор с другими,Вы примирите их.",
                            "verse 49:10": "Ведь те, кто верует, — в единомбратстве,А потому — мирите ваших братьев,Страшитесь гнева Господа, и этимВы обретете милосердие Его.",
                            "verse 49:11": "О вы, кто верует!Одним мужчинам непристойноВысмеивать других мужчин:Быть может, те, другие, лучше первых.",
                            "verse 49:12": "О вы, кто верует! (С особым тщанием)Себя от подозрительностиберегите, —Бывают случаи, в которыхона становится грехом;И не подсматривайте друг за другом,И за спиной друг друга не злословьте.",
                            "verse 49:13": "О люди! Мы сотворили вас от (пары):мужа и жены.",
                            "verse 49:14": "А бедуины говорят:«Уверовали мы».",
                            "verse 49:15": "И верующие — только те,Которые в Аллаха и посланника ЕгоУверовали (всей душой и сердцем)И вслед сомнениями не терзались,А отдавали средства все и душу,Сражаясь на Его пути.",
                            "verse 49:16": "Скажи: «Ужель вы станете Аллахусообщать о вашей вере?Ведь знает Он о всем, что сущеи в небесах, и на земле, —Аллах о всякой вещи знающ!»",
                            "verse 49:17": "Они вменяют милостью тебе,Что приняли они ислам.",
                            "verse 49:18": "Аллаху, истинно, известно все,Что в небесах и на земле сокрыто."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "¡Creyentes! ¡No os adelantéis a Alá y a su Enviado y temed a Alá! Alá todo lo oye, todo lo sabe.",
                            "verse 49:2": "¡Creyentes! ¡No elevéis vuestra voz por encima de la del Profeta! ¡No le habléis en voz alta, como hacéis entre vosotros! Os expondríais a hacer vanas vuestras obras sin daros cuenta.",
                            "verse 49:3": "Quienes en presencia del Enviado de Alá bajan la voz son aquéllos cuyos corazones ha probado Alá para disponerlos a Su temor.",
                            "verse 49:4": "La mayoría de los que te llaman desde fuera de las habitaciones privadas no tienen entendimiento.",
                            "verse 49:5": "Más les valdría esperar a que tú salieras adonde ellos están.",
                            "verse 49:6": "¡Creyentes! Si un malvado os trae una noticia, examinadla bien, no sea que lastiméis a gente por ignorancia y tengáis que arrepentiros de lo que habéis hecho.",
                            "verse 49:7": "Sabed que está entre vosotros el Enviado de Alá.",
                            "verse 49:8": "por favor y gracia de Alá.",
                            "verse 49:9": "Si dos grupos de creyentes combaten unos contra otros, ¡reconciliadles! Y, si uno de ellos oprime al otro, ¡combatid contra el opresor hasta reducirle a la obediencia de Alá! Y, cuando sea reducido, ¡reconciliadles de acuerdo con la justicia y sed equitativos! Alá ama a los que observan la equidad.",
                            "verse 49:10": "Los creyentes son, en verdad, hermanos.",
                            "verse 49:11": "¡Creyentes! ¡No os burléis unos de otros! Podría ser que los burlados fueran mejores que los que se burlan.",
                            "verse 49:12": "¡Creyentes! ¡Evitad conjeturar demasiado! Algunas conjeturas son pecado.",
                            "verse 49:13": "¡Hombres! Os hemos creado de un varón y de una hembra y hemos hecho de vosotros pueblos y tribus, para que os conozcáis unos a otros.",
                            "verse 49:14": "Los beduinos dicen: «¡Creemos!» Di: «¡No creéis! ¡Decid, más bien: 'Hemos abrazado el islam'! La fe no ha entrado aún en vuestros corazones.",
                            "verse 49:15": "Son creyentes únicamente los que creen en Alá y en Su Enviado, sin abrigar ninguna duda, y combaten por Alá con su hacienda y sus personas.",
                            "verse 49:16": "Di: «¿Vais a enseñar a Alá en qué consiste vuestra religión, siendo así que Alá conoce lo que está en los cielos y en la tierra?» Alá es omnisciente.",
                            "verse 49:17": "Te recuerdan su conversión al islam como si, con ello, te hubieran agraciado.",
                            "verse 49:18": "Alá conoce lo oculto de los cielos y de la tierra."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "முஃமின்களே! அல்லாஹ்வுக்கும், அவனுடைய தூதருக்கும் முன்னர் (பேசவதற்கு) நீங்கள் முந்தாதீர்கள்; அல்லாஹ்விடம் பயபக்தியுடன் இருங்கள்; நிச்சயமாக அல்லாஹ் (யாவற்றையும்) செவியுறுபவன்; நன்கறிபவன்.",
                            "verse 49:2": "முஃமினகளே! நீங்கள் நபியின் சப்தத்திற்கு மேலே, உங்கள் சப்தங்களை உயர்த்தாதீர்கள்; மேலும், உங்களுக்குள் ஒருவர் மற்றொருவருடன் இரைந்து பேசவதைப் போல், அவரிடம் நீங்கள் இரைந்து போசாதீர்கள், (இவற்றால்) நீங்கள் அறிந்து கொள்ள முடியாத நிலையில் உங்கள் அமல்கள் அழிந்து போகும்.",
                            "verse 49:3": "நிச்சயமாக, எவர்கள் அல்லாஹ்வுடைய தூதரின் முன்பு, தங்களுடைய சப்தங்களைத் தாழ்த்திக் கொள்கிறார்களோ அ(த்தகைய)வர்களின் இதயங்களை அல்லாஹ் பயபக்திக்காகச் சோதனை செய்கிறான் - அவர்களுக்கு மன்னிப்பும், மகத்தான் கூலியும் உண்டு.",
                            "verse 49:4": "(நபியே!) நிச்சயமாக, எவர்கள் (உம்) அறைகளுக்கு வெளியே இருந்து உம்மை இரைந்து அழைக்கிறார்களோ, அவர்களில் பெரும்பாலோர் விளங்கிக் கொள்ளாதவர்களே!",
                            "verse 49:5": "நீர் அவர்களிடம் வெளிப்பட்டு வரும் வரையில், அவர்கள் பொறுத்திருந்தார்களானால், அது அவர்களுக்கு நலமாக இருக்கும்; (எனினும்) அல்லாஹ் மிக மன்னப்பவன்; மிக்க கிருபையுடையவன்.",
                            "verse 49:6": "முஃமின்களே! ஃபாஸிக் (தீயவன்) எவனும் உங்களிடம் ஒரு செய்தியைக் கொண்டு வந்தால், அதைத் தீர்க்க விசாரித்துக் கொள்ளுங்கள்; (இல்லையேல்) அறியாமையினால் (குற்ற மற்ற) ஒரு சமூகத்தாருக்கு நீங்கள் தீங்கு செய்து விடலாம்; பின்னர் நீங்கள் செய்தவை பற்றி நீங்களே கைசேதப் படுபவர்களாக (கவலைப்படுபவர்களாக) ஆவீர்கள்.",
                            "verse 49:7": "அறிந்துகொள்ளுங்கள்; நிச்சயமாக உங்களிடையே அல்லாஹ்வின் தூதர் இருக்கிறார்; அநேக காரியங்களில் அவர் உங்களுக்கு வழிப்பட்டால், திடமாக நீங்கள் தாம் கஷ்டத்திற்குள்ளாவீர்கள், எனினும் அல்லாஹ் ஈமானை (நம்பிக்கையை) உங்களுக்குப் பிரியமுடையதாக்கி உங்கள் இதயங்களிலும் அதனை அழகாக்கியும் வைத்தான் - அன்றியும் குஃப்ரையும் (நிராகரிப்பையும்) பாவத்தையும், மாறுபாடு செய்வதையும் உங்களுக்கு வெறுப்பாகவும் ஆக்கினான்; இத்தகையவர்கள் தாம் நேர்வழியில் நடப்பவர்கள்.",
                            "verse 49:8": "(இது) அல்லாஹ்விடமிருந்துள்ள அனுக்கிரமும், அருள்கொடையினாலுமேயாகும், மேலும் அல்லாஹ் நன்கறிந்தவன்; ஞானம் மிக்கோன்.",
                            "verse 49:9": "முஃமின்களில் இருசாரார் தங்களுக்குள் சண்டை செய்து கொண்டால், அவ்விருசாராருக்கிடையில் சமாதானம் உண்டாக்குங்கள்.",
                            "verse 49:10": "நிச்சயமாக முஃமின்கள் (யாவரும்) சகோரர்களே ஆகவே, உங்கள் இரு சகோதரர்களுக்கிடையில் நீங்கள் சமாதானம் உண்டாக்குங்கள்; இன்னும் உங்கள் மீது கிருபை செய்யப்படும் பொருட்டு, நீங்கள் அல்லாஹ்வை அஞ்சங்கள்.",
                            "verse 49:11": "முஃமின்களே! ஒரு சமூகத்தார் பிறியதொரு சமூகத்தாரைப் பரிகாசம் செய்ய வேண்டாம்.",
                            "verse 49:12": "முஃமின்களே! (சந்தேகமான) பல எண்ணங்களிலிருந்து விலகிக் கொள்ளுங்கள்; ஏனெனில் நிச்சயமாக எண்ணங்களில் சில பாவங்களாக இருக்கும்; (பிறர் குறைகளை) நீங்கள் துருவித் துருவி ஆராய்ந்து கொண்டிராதீர்கள்; அன்றியும், உங்களில் சிலர் சிலலைப் பற்றிப் புறம் பேசவேண்டாம், உங்களில் எவராவது தம்முடைய இறந்த சகோதரனின் மாமிசத்தைப் புசிக்க விரும்புவாரா? (இல்லை!) அதனை நீங்கள் வெறுப்பீர்கள்.",
                            "verse 49:13": "மனிதர்களே! நிச்சயமாக நாம் உங்களை ஓர் ஆண், ஒரு பெண்ணிலிருந்தே படைத்தோம்; நீங்கள் ஒருவரை ஒருவர் அறிந்து கொள்ளும் பொருட்டு.",
                            "verse 49:14": "\"நாங்களும் ஈமான் கொண்டோம்\" என்று (நபியே! உம்மிடம்) நாட்டுப் புறத்து அரபிகள் கூறுகிறார்கள், \"நீங்கள் ஈமான் கொள்ளவில்லை.",
                            "verse 49:15": "நிச்சயமாக, (உண்மையான) முஃமின்கள் யார் என்றால், அவர்கள் அல்லாஹ்வின் மீதும், அவனுடைய தூதர் மீதும், ஈமான் கொண்டு, பின்னர் (அது பற்றி அவர்கள் எத்தகைய) சந்தேகமும் கொள்ளாது, தம் செல்வங்களைக் கொண்டும், தம் உயிர்களைக் கொண்டும் அல்லாஹ்வின் பாதையில் தியாகம் செய்வார்கள் - இத்தகையவர்கள் தாம் உண்மையாளர்கள்.",
                            "verse 49:16": "\"நீங்கள் உங்கள் மார்க்க (வழிபாடுகள்) பற்றி அல்லாஹ்வுக்கு அறிவிக்(க விரும்பு)கறீர்களோ? அல்லாஹ்வோ வானங்களிலுள்ளவற்றையும், பூமியிலுள்ளவற்றையும் நன்கு அறிகிறான் - அன்றியும், அல்லாஹ் எல்லாப் பொருள்களையும் நன்கறிகிறவன்\" என்று (நபியே!) நீர் கூறும்.",
                            "verse 49:17": "அவர்கள் இஸ்லாம் மார்க்கத்தைத் தழுவியதால், உமக்கு உபகாரம் செய்து விட்டதாகக் கருதுகிறார்கள்; \"நீங்கள் இஸ்லாம் மார்க்கத்தைத் தழுவியதால் எனக்கு உபகாரம் செய்து விட்டதாகக் கருதாதீர்கள்; எனினும், நீங்கள் உண்மையாளர்களாக இருப்பின் ஈமானின் நேர் வழியில் உங்களைச் சேர்த்ததனால் அல்லாஹ் தான் உங்கள் மீது உபகாரம் செய்திருக்கிறான்\" என்று (நபியே!) நீர் கூறுவீராக.",
                            "verse 49:18": "\"நிச்சயமாக அல்லாஹ் வானங்களிலும், பூமியிலுமுள்ள மறைவானவற்றை (யெல்லாம்) நன்கறிகிறான்; அன்றியும் அல்லாஹ் நீங்கள் செய்பவற்றை பார்த்துக் கொண்டிருக்கின்றான்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "โอ้ศรัทธาชนทั้งหลาย ! พวกเจ้าอย่าได้ล้ำหน้า (ในการกระทำใด ๆ) เมื่ออยู่ต่อหน้าอัลลอฮ์ และร่อซู้ลของพระองค์ พวกเจ้าจงยำเกรงอัลลอฮ์เถิด แท้จริงอัลลอฮ์นั้นเป็นผู้ทรงได้ยิน ผู้ทรงรอบรู้",
                            "verse 49:2": "โอ้ศรัทธาชนทั้งหลาย! พวกเจ้าอย่าได้ยกเสียงของพวกเจ้าเหนือเสียงของอัลนบี และอย่าพูดเสียงดังกับเขา (มุฮัมมัด) เยี่ยงการพูดเสียงดังของบางคนของพวกเจ้ากับอีกบางคน เพราะ (เกรงว่า) การงานต่าง ๆ ของพวกเจ้าจะสูญเสียไป โดยที่พวกเจ้าไม่รู้สึกตัว",
                            "verse 49:3": "แท้จริงบรรดาผู้ที่ลดเสียงของพวกเขา ณ ที่ร่อซู้ลุลลอฮ์นั้น ชนเหล่านั้น คือบรรดาผู้ที่อัลลอฮ์ทรงทดสอบจิตใจของพวกเขาเพื่อความยำเกรง สำหรับพวกเขาจะได้รับการอภัยโทษและรางวัลอันใหญ่หลวง",
                            "verse 49:4": "แท้จริงบรรดาผู้ส่งเสียงเรียกเจ้าทางเบื้องหลังห้องหับเหล่านั้น ส่วนใหญ่ของพวกเขาไม่ใช้สติปัญญา",
                            "verse 49:5": "และหากว่าพวกเขาอดทนไว้จนกว่าเจ้าจะออกมาหาพวกเขาแล้ว แน่นอนมันย่อมเป็นการดีสำหรับพวกเขา และอัลลอฮ์เป็นผู้ทรงอภัยโทษ ผู้ทรงเมตตาเสมอ",
                            "verse 49:6": "โอ้ศรัทธาชนทั้งหลาย ! หากคนชั่วนำข่าวใดๆ มาแจ้งแก่พวกเจ้า พวกเจ้าก็จงสอบสวนให้แน่ชัด หาไม่แล้วพวกเจ้าก็จะก่อเคราะห์กรรมแก่พวกหนึ่งโดยไม่รู้ตัว แล้วพวกเจ้าจะกลายเป็นผู้เสียใจในสิ่งที่พวกเจ้าได้กระทำไป",
                            "verse 49:7": "และพวกเจ้าพึงรู้เถิดว่า ในหมู่พวกเจ้านั้นมีร่อซู้ลของอัลลอฮ์อยู่ หากเขา (มุฮัมมัด) เชื่อฟังพวกเจ้าในส่วนใหญ่ของกิจการแล้ว แน่นอนพวกเจ้าก็จะลำบากกัน แต่อัลลอฮ์ทรงให้การศรัทธาเป็นที่รักแก่พวกเจ้า และทรงให้การปฏิเสธศรัทธา และความชั่วช้าและการฝ่าฝืนเป็นที่น่าเกลียดชังแก่พวกเจ้า ชนเหล่านั้นคือพวกที่ดำเนินอยู่ในแนวทางที่ถูกต้อง",
                            "verse 49:8": "มันเป็นคุณธรรมและความโปรดปรานจากอัลลอฮ์ และอัลลอฮ์นั้นเป็นผู้ทรงรอบรู้ ผู้ทรงปรีชาญาณ",
                            "verse 49:9": "และหากมีสองฝ่ายจากบรรดาผู้ศรัทธาทะเลาะวิวาทกัน พวกเจ้าก็จงไกล่เกลี่ยระหว่างทั้งสองฝ่าย หากฝ่ายหนึ่งในสองฝ่ายนั้นละเมิดอีกฝ่ายหนึ่ง พวกเจ้าก็จงปรามฝ่ายที่ละเมิดจนกว่าฝ่ายนั้นจะกลับสู่พระบัญชาของอัลลอฮ์ ฉะนั้นหากฝ่ายนั้นกลับ (สู่พระบัญชาของอัลลอฮ์) แล้ว พวกเจ้าก็จงประนีประนอมระหว่างทั้งสองฝ่ายด้วยความยุติธรรม และพวกเจ้าจงให้ความเที่ยงธรรม (แก่ทั้งสองฝ่าย) เถิด แท้จริงอัลลอฮ์ทรงรักใคร่บรรดาผู้ให้ความเที่ยงธรรม",
                            "verse 49:10": "แท้จริงบรรดาผู้ศรัทธานั้นเป็นพี่น้องกัน ดังนั้นพวกเจ้าจงไกล่เกลี่ยประนีประนอมกันระหว่างพี่น้องทั้งสองฝ่ายของพวกเจ้า และจงยำเกรงอัลลอฮ์เถิด หวังว่าพวกเจ้าจะได้รับความเมตตา",
                            "verse 49:11": "โอ้ศรัทธาชนทั้งหลาย! ชนกลุ่มหนึ่งอย่าได้เยาะเย้ยชนอีกกลุ่มหนึ่ง บางทีชนกลุ่มที่ถูกเยาะเย้ยนั้นจะดีกว่าชนกลุ่มที่เยาะเย้ย และสตรีกลุ่มหนึ่งอย่าได้เยาะเย้ยจะดีกว่ากลุ่มที่เยาะเย้ย และพวกเจ้าอย่าได้ตำหนิตัวของพวกเจ้าเอง และอย่าได้เรียกกันด้วยฉายาที่ไม่ชอบ ช่างเลวทรามจริง ๆ ที่บรรดาผู้ศรัทธาจะเรียกกันว่าเป็นผู้ฝ่าฝืน ภายหลังจากที่ได้มีการศรัทธากันแล้ว และผู้ใดไม่สำนึกผิด ชนเหล่านั้นคือบรรดาผู้อธรรม",
                            "verse 49:12": "โอ้ศรัทธาชนทั้งหลาย! พวกเจ้าจงปลีกตัวให้พ้นจากส่วนใหญ่ของการสงสัย แท้จริงการสงสัยบางอย่างนั้นเป็นบาป และพวกเจ้าอย่าสอดแนม และบางคนในหมู่พวกเจ้าอย่านินทาซึ่งกันและกัน คนหนึ่งในหมู่พวกเจ้านั้นชอบที่จะกินเนื้อพี่น้องของเขาที่ตายไปแล้วกระนั้นหรือ? พวกเจ้าย่อมเกลียดมัน และจงยำเกรงอัลลอฮ์เถิด แท้จริงอัลลอฮ์นั้นเป็นผู้ทรงอภัยโทษ ผู้ทรงเมตตาเสมอ",
                            "verse 49:13": "โอ้มนุษยชาติทั้งหลาย แท้จริงเราได้สร้างพวกเจ้าจากเพศชาย และเพศหญิง และเราได้ให้พวกเจ้าแยกเป็นเผ่า และตระกูลเพื่อจะได้รู้จักกัน แท้จริงผู้ที่มีเกียรติยิ่งในหมู่พวกเจ้า ณ ที่อัลลอฮ์นั้น คือผู้ที่มีความยำเกรงยิ่งในหมู่พวกเจ้า แท้จริงอัลลอฮ์นั้นเป็นผู้ทรงรอบรู้อย่างละเอียดถี่ถ้วน",
                            "verse 49:14": "อาหรับชาวชนบทกล่าวว่า เราศรัทธาแล้ว จงกล่าวเถิดมุฮัมมัดว่า พวกท่านยังมิได้ศรัทธา แต่จงกล่าวเถิดว่า เราเข้ารับอิสลามแล้ว เพราะการศรัทธายังมิได้เข้าสู่หัวใจของพวกท่าน และถ้าหากพวกท่านเชื่อฟังปฏิบัติตามอัลลอฮ์และร่อซู้ลของพระองค์แล้ว พระองค์จะไม่ทำให้การงานของพวกท่านด้อยลงแต่ประการใด แท้จริงอัลลอฮ์เป็นผู้ทรงอภัย ผู้ทรงเมตตาเสมอ",
                            "verse 49:15": "แท้จริงศรัทธาชนที่แท้จริงนั้น คือ บรรดาผู้ศรัทธาต่ออัลลอฮ์และร่อซู้ลของพระองค์ แล้วพวกเขาไม่สงสัยเคลือบแคลงใจ แต่พวกเขาได้เสียสละต่อสู้ดิ้นรนด้วยทรัพย์สมบัติของพวกเขา และชีวิตของพวกเขาไปในหนทางของอัลลอฮ์ ชนเหล่านั้นแหละคือบรรดาผู้สัตย์จริง",
                            "verse 49:16": "จงกล่าวเถิดมุฮัมมัดว่า พวกท่านจะบอกอัลลอฮ์เกี่ยวกับศาสนาของพวกท่านกระนั้นหรือ? อัลลอฮ์นั้นทรงรอบรู้สิ่งที่อยู่ในชั้นฟ้าทั้งหลาย และแผ่นดิน และอัลลอฮ์นั้นทรงรอบรู้ทุกสิ่งทุกอย่าง",
                            "verse 49:17": "พวกเขาถือเป็นบุญคุณแก่เจ้าว่าพวกเขาได้รับอิสลามแล้ว จงกล่าวเถิดมุฮัมมัดว่าพวกท่านอย่าถือเอาการเป็นอิสลามของพวกท่านมาเป็นบุญคุณแก่ฉันเลย แต่ทว่าอัลลอฮ์ทรงประทานบุญคุณแก่พวกท่านต่างหาก โดยชี้นำพวกท่านสู่การศรัทธา หากพวกท่านเป็นผู้สัตย์จริง",
                            "verse 49:18": "แท้จริงอัลลอฮ์ทรงรอบรู้สิ่งเร้นลับในชั้นฟ้าทั้งหลายและแผ่นดิน และอัลลอฮ์ทรงเห็นสิ่งที่พวกเจ้ากระทำ"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "Ey iman edenler! Allah'ın ve Resûlünün önüne geçmeyin.",
                            "verse 49:2": "Ey iman edenler! Seslerinizi Peygamber'in sesinin üstüne yükseltmeyin.",
                            "verse 49:3": "Allah'ın elçisinin huzurunda seslerini kısanlar, şüphesiz Allah'ın kalplerini takvâ ile imtihan ettiği kimselerdir.",
                            "verse 49:4": "(Resûlüm!) Sana odaların arka tarafından bağıranların çoğu aklı ermez kimselerdir.",
                            "verse 49:5": "Eğer onlar, sen yanlarına çıkıncaya kadar sabretselerdi, elbette kendileri için daha iyi olurdu.",
                            "verse 49:6": "Ey iman edenler! Eğer bir fâsık size bir haber getirirse onun doğruluğunu araştırın.",
                            "verse 49:7": "Hem bilin ki, içinizde Allah'ın elçisi vardır.",
                            "verse 49:8": "Bu, Allah'tan bir lütuf ve nimettir.",
                            "verse 49:9": "Eğer müminlerden iki gurup birbirleriyle vuruşurlarsa aralarını düzeltin.",
                            "verse 49:10": "Müminler ancak kardeştirler.",
                            "verse 49:11": "Ey müminler! Bir topluluk diğer bir topluluğu alaya almasın.",
                            "verse 49:12": "Ey iman edenler! Zannın çoğundan kaçının.",
                            "verse 49:13": "Ey insanlar! Doğrusu biz sizi bir erkekle bir dişiden yarattık.",
                            "verse 49:14": "Bedevîler \"İnandık\" dediler.",
                            "verse 49:15": "Müminler ancak Allah'a ve Resûlüne iman eden, ondan sonra asla şüpheye düşmeyen, Allah yolunda mallarıyla ve canlarıyla savaşanlardır.",
                            "verse 49:16": "De ki: Siz dininizi Allah'a mı öğretiyorsunuz? Oysa Allah göklerde olanları da bilir, yerde olanları da.",
                            "verse 49:17": "Onlar İslâm'a girdikleri için seni minnet altına sokuyorlar.",
                            "verse 49:18": "Şüphesiz Allah, göklerin ve yerin gizliliklerini bilir."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "مومنو! (کسی بات کے جواب میں) خدا اور اس کے رسول سے پہلے نہ بول اٹھا کرو اور خدا سے ڈرتے رہو۔ بیشک خدا سنتا جانتا ہے",
                            "verse 49:2": "اے ايمان والو! (کسي بھي معاملے ميں) ا? اور اس کے رسول (صلي اللہ عليہ وآلہ وسلم) سے آگے نہ بڑھا کرو اور ا? سے ڈرتے رہو (کہ کہيں رسول صلي اللہ عليہ وآلہ وسلم کي بے ادبي نہ ہوجائے)، بيشک ا? (سب کچھ) سننے والا خوب جاننے والا ہےo",
                            "verse 49:3": "اے ايمان والو! تم اپني آوازوں کو نبيِ مکرّم (صلي اللہ عليہ وآلہ وسلم) کي آواز سے بلند مت کيا کرو اور اُن کے ساتھ اِس طرح بلند آواز سے بات (بھي) نہ کيا کرو جيسے تم ايک دوسرے سے بلند آواز کے ساتھ کرتے ہو (ايسا نہ ہو) کہ تمہارے سارے اعمال ہي (ايمان سميت) غارت ہو جائيں اور تمہيں (ايمان اور اعمال کے برباد ہوجانے کا) شعور تک بھي نہ ہوo",
                            "verse 49:4": "اے اہل ایمان! اپنی آوازیں پیغمبر کی آواز سے اونچی نہ کرو اور جس طرح آپس میں ایک دوسرے سے زور سے بولتے ہو (اس طرح) ان کے روبرو زور سے نہ بولا کرو (ایسا نہ ہو) کہ تمہارے اعمال ضائع ہوجائیں اور تم کو خبر بھی نہ ہو",
                            "verse 49:5": "جو لوگ پیغمبر خدا کے سامنے دبی آواز سے بولتے ہیں خدا نے ان کے دل تقویٰ کے لئے آزما لئے ہیں۔ ان کے لئے بخشش اور اجر عظیم ہے",
                            "verse 49:6": "بيشک جو لوگ رسول اللہ (صلي اللہ عليہ وآلہ وسلم) کي بارگاہ ميں (ادب و نياز کے باعث) اپني آوازوں کو پست رکھتے ہيں، يہي وہ لوگ ہيں جن کے دلوں کو ا? نے تقو?ي کے لئے چن کر خالص کر ليا ہے? ان ہي کے لئے بخشش ہے اور اجرِ عظيم ہےo",
                            "verse 49:7": "بيشک جو لوگ آپ کو حجروں کے باہر سے پکارتے ہيں ان ميں سے اکثر (آپ کے بلند مقام و مرتبہ اور آدابِ تعظيم کي) سمجھ نہيں رکھتےo",
                            "verse 49:8": "جو لوگ تم کو حجروں کے باہر سے آواز دیتے ہیں ان میں اکثر بیعقل ہیں",
                            "verse 49:9": "اور اگر وہ صبر کئے رہتے یہاں تک کہ تم خود نکل کر ان کے پاس آتے تو یہ ان کے لئے بہتر تھا۔ اور خدا تو بخشنے والا مہربان ہے",
                            "verse 49:10": "اور اگر وہ لوگ صبر کرتے يہاں تک کہ آپ خود ہي ان کي طرف باہر تشريف لے آتے تو يہ اُن کے لئے بہتر ہوتا، اور ا? بڑا بخشنے والا بہت رحم فرمانے والا ہےo",
                            "verse 49:11": "اے ايمان والو! اگر تمہارے پاس کوئي فاسق (شخص) کوئي خبر لائے تو خوب تحقيق کر ليا کرو (ايسا نہ ہو) کہ تم کسي قوم کو لاعلمي ميں (ناحق) تکليف پہنچا بيٹھو، پھر تم اپنے کئے پر پچھتاتے رہ جاؤo",
                            "verse 49:12": "مومنو! اگر کوئی بدکردار تمہارے پاس کوئی خبر لے کر آئے تو خوب تحقیق کرلیا کرو (مبادا) کہ کسی قوم کو نادانی سے نقصان پہنچا دو۔ پھر تم کو اپنے کئے پر نادم ہونا پڑے",
                            "verse 49:13": "اور جان رکھو کہ تم میں خدا کے پیغمبر ہیں۔ اگر بہت سی باتوں میں وہ تمہارا کہا مان لیا کریں تو تم مشکل میں پڑ جاؤ لیکن خدا نے تم کو ایمان عزیز بنا دیا اور اس کو تمہارے دلوں میں سجا دیا اور کفر اور گناہ اور نافرمانی سے تم کو بیزار کردیا۔ یہی لوگ راہ ہدایت پر ہیں",
                            "verse 49:14": "اور جان لو کہ تم ميں رسول ا? (صلي اللہ عليہ وآلہ وسلم) موجود ہيں، اگر وہ بہت سے کاموں ميں تمہارا کہنا مان ليں تو تم بڑي مشکل ميں پڑ جاؤ گے ليکن اللہ نے تمہيں ايمان کي محبت عطا فرمائي اور اسے تمہارے دلوں ميں آراستہ فرما ديا اور کفر اور نافرماني اور گناہ سے تمہيں متنفر کر ديا، ايسے ہي لوگ دين کي راہ پر ثابت اور گامزن ہيںo",
                            "verse 49:15": "(يہ) ا? کے فضل اور (اس کي) نعمت (يعني تم ميں رسولِ اُمّي صلي اللہ عليہ وآلہ وسلم کي بعثت اور موجودگي) کے باعث ہے، اور ا? خوب جاننے والا اور بڑي حکمت والا ہےo",
                            "verse 49:16": "(یعنی) خدا کے فضل اور احسان سے۔ اور خدا جاننے والا (اور) حکمت والا ہے",
                            "verse 49:17": "اور اگر مومنوں میں سے کوئی دو فریق آپس میں لڑ پڑیں تو ان میں صلح کرا دو۔ اور اگر ایک فریق دوسرے پر زیادتی کرے تو زیادتی کرنے والے سے لڑو یہاں تک کہ وہ خدا کے حکم کی طرف رجوع لائے۔ پس جب وہ رجوع لائے تو وہ دونوں فریق میں مساوات کے ساتھ صلح کرا دو اور انصاف سے کام لو۔ کہ خدا انصاف کرنے والوں کو پسند کرتا ہے",
                            "verse 49:18": "اور اگر مسلمانوں کے دو گروہ آپس ميں لڑائي کريں تو اُن کے درميان صلح کرا ديا کرو، پھر اگر ان ميں سے ايک (گروہ) دوسرے پر زيادتي اور سرکشي کرے تو اس (گروہ) سے لڑو جو زيادتي کا مرتکب ہو رہا ہے يہاں تک کہ وہ (قيام امن کے) حکم اِل?ہي کي طرف لوٹ آئے، پھر اگر وہ رجوع کر لے تو دونوں کے درميان عدل کے ساتھ صلح کرا دو اور انصاف سے کام لو، بيشک ا? انصاف کرنے والوں کو بہت پسند فرماتا ہےo",
                            "verse 49:19": "بات يہي ہے کہ (سب) اہلِ ايمان (آپس ميں) بھائي ہيں? سو تم اپنے دو بھائيوں کے درميان صلح کرايا کرو، اور ا? سے ڈرتے رہو تاکہ تم پر رحم کيا جائےo",
                            "verse 49:20": "مومن تو آپس میں بھائی بھائی ہیں۔ تو اپنے دو بھائیوں میں صلح کرادیا کرو۔ اور خدا سے ڈرتے رہو تاکہ تم پر رحمت کی جائے",
                            "verse 49:21": "سورة الحُجرَات رکوع (۲/۲) مومنو! کوئی قوم کسی قوم سے تمسخر نہ کرے ممکن ہے کہ وہ لوگ ان سے بہتر ہوں اور نہ عورتیں عورتوں سے (تمسخر کریں) ممکن ہے کہ وہ ان سے اچھی ہوں۔ اور اپنے (مومن بھائی) کو عیب نہ لگاؤ اور نہ ایک دوسرے کا برا نام رکھو۔ ایمان لانے کے بعد برا نام (رکھنا) گناہ ہے۔ اور جو توبہ نہ کریں وہ ظالم ہیں",
                            "verse 49:22": "اے ايمان والو! کوئي قوم کسي قوم کا مذاق نہ اڑائے ممکن ہے وہ لوگ اُن (تمسخر کرنے والوں) سے بہتر ہوں اور نہ عورتيں ہي دوسري عورتوں کا (مذاق اڑائيں) ممکن ہے وہي عورتيں اُن (مذاق اڑانے والي عورتوں) سے بہتر ہوں، اور نہ آپس ميں طعنہ زني اور الزام تراشي کيا کرو اور نہ ايک دوسرے کے برے نام رکھا کرو، کسي کے ايمان (لانے) کے بعد اسے فاسق و بدکردار کہنا بہت ہي برا نام ہے، اور جس نے توبہ نہيں کي سو وہي لوگ ظالم ہيںo",
                            "verse 49:23": "اے ايمان والو! زيادہ تر گمانوں سے بچا کرو بيشک بعض گمان (ايسے) گناہ ہوتے ہيں (جن پر اُخروي سزا واجب ہوتي ہے) اور (کسي کے عيبوں اور رازوں کي) جستجو نہ کيا کرو اور نہ پيٹھ پيچھے ايک دوسرے کي برائي کيا کرو، کيا تم ميں سے کوئي شخص پسند کرے گا کہ وہ اپنے مُردہ بھائي کا گوشت کھائے، سو تم اس سے نفرت کرتے ہو? اور (اِن تمام معاملات ميں) ا? سے ڈرو بيشک ا? توبہ کو بہت قبول فرمانے والا بہت رحم فرمانے والا ہےo",
                            "verse 49:24": "اے اہل ایمان! بہت گمان کرنے سے احتراز کرو کہ بعض گمان گناہ ہیں۔ اور ایک دوسرے کے حال کا تجسس نہ کیا کرو اور نہ کوئی کسی کی غیبت کرے۔ کیا تم میں سے کوئی اس بات کو پسند کرے گا کہ اپنے مرے ہوئے بھائی کا گوشت کھائے؟ اس سے تو تم ضرور نفرت کرو گے۔ (تو غیبت نہ کرو) اور خدا کا ڈر رکھو بیشک خدا توبہ قبول کرنے والا مہربان ہے",
                            "verse 49:25": "لوگو! ہم نے تم کو ایک مرد اور ایک عورت سے پیدا کیا اور تمہاری قومیں اور قبیلے بنائے۔ تاکہ ایک دوسرے کو شناخت کرو۔ اور خدا کے نزدیک تم میں زیادہ عزت والا وہ ہے جو زیادہ پرہیزگار ہے۔ بیشک خدا سب کچھ جاننے والا (اور) سب سے خبردار ہے",
                            "verse 49:26": "اے لوگو! ہم نے تمہيں مرد اور عورت سے پيدا فرمايا اور ہم نے تمہيں (بڑي بڑي) قوموں اور قبيلوں ميں (تقسيم) کيا تاکہ تم ايک دوسرے کو پہچان سکو? بيشک ا? کے نزديک تم ميں زيادہ باعزت وہ ہے جو تم ميں زيادہ پرہيزگارہو، بيشک ا? خوب جاننے والا خوب خبر رکھنے والا ہےo",
                            "verse 49:27": "ديہاتي لوگ کہتے ہيں کہ ہم ايمان لائے ہيں، آپ فرما ديجئے: تم ايمان نہيں لائے، ہاں يہ کہو کہ ہم اسلام لائے ہيں اور ابھي ايمان تمہارے دلوں ميں داخل ہي نہيں ہوا، اور اگر تم ا? اور اس کے رسول (صلي اللہ عليہ وآلہ وسلم) کي اطاعت کرو تو وہ تمہارے اعمال (کے ثواب ميں) سے کچھ بھي کم نہيں کرے گا، بيشک ا? بہت بخشنے والا بہت رحم فرمانے والا ہےo",
                            "verse 49:28": "دیہاتی کہتے ہیں کہ ہم ایمان لے آئے۔ کہہ دو کہ تم ایمان نہیں لائے (بلکہ یوں) کہو کہ ہم اسلام لائے ہیں اور ایمان تو ہنوز تمہارے دلوں میں داخل ہی نہیں ہوا۔ اور تم خدا اور اس کے رسول کی فرمانبرداری کرو گے تو خدا تمہارے اعمال سے کچھ کم نہیں کرے گا۔ بیشک خدا بخشنے والا مہربان ہے",
                            "verse 49:29": "مومن تو وہ ہیں جو خدا اور اس کے رسول پر ایمان لائے پھر شک میں نہ پڑے اور خدا کی راہ میں مال اور جان سے لڑے۔ یہی لوگ (ایمان کے) سچے ہیں",
                            "verse 49:30": "ايمان والے تو صرف وہ لوگ ہيں جو ا? اور اس کے رسول (صلي اللہ عليہ وآلہ وسلم) پر ايمان لائے، پھر شک ميں نہ پڑے اور ا? کي راہ ميں اپنے اموال اور اپني جانوں سے جہاد کرتے رہے، يہي وہ لوگ ہيں جو (دعوائے ايمان ميں) سچےّ ہيںo",
                            "verse 49:31": "فرما ديجئے: کيا تم ا? کو اپني دين داري جتلا رہے ہو، حالانکہ ا? اُن (تمام) چيزوں کو جانتا ہے جو آسمانوں ميں ہيں اور جو زمين ميں ہيں، اور ا? ہر چيز کا خوب علم رکھنے والا ہےo",
                            "verse 49:32": "ان سے کہو کیا تم خدا کو اپنی دینداری جتلاتے ہو۔ اور خدا تو آسمانوں اور زمین کی سب چیزوں سے واقف ہے۔ اور خدا ہر شے کو جانتا ہے",
                            "verse 49:33": "یہ لوگ تم پر احسان رکھتے ہیں کہ مسلمان ہوگئے ہیں۔ کہہ دو کہ اپنے مسلمان ہونے کا مجھ پر احسان نہ رکھو۔ بلکہ خدا تم پر احسان رکھتا ہے کہ اس نے تمہیں ایمان کا رستہ دکھایا بشرطیکہ تم سچے (مسلمان) ہو",
                            "verse 49:34": "يہ لوگ آپ پر احسان جتلاتے ہيں کہ وہ اسلام لے آئے ہيں? فرما ديجئے: تم اپنے اسلام کا مجھ پر احسان نہ جتلاؤ بلکہ ا? تم پر احسان فرماتا ہے کہ اس نے تمہيں ايمان کا راستہ دکھايا ہے، بشرطيکہ تم (ايمان ميں) سچے ہوo",
                            "verse 49:35": "بيشک ا? آسمانوں اور زمين کے سب غيب جانتا ہے، اور ا? جو عمل بھي تم کرتے ہو اسے خوب ديکھنے والا ہےo",
                            "verse 49:36": "بیشک خدا آسمانوں اور زمین کی پوشیدہ باتوں کو جانتا ہے اور جو کچھ تم کرتے ہو اسے دیکھتا ہے ہےo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 49:1": "Эй иймон келтирганлар ! Аллоҳдан ва Унинг Расулдан олдин шошилманглар.",
                            "verse 49:2": "Эй иймон келтирганлар! Овозингизни Пайғамбар овозидан юқори кўтарманг ва унга бир-бирингиз ила сўзлашгандек дағал сўз айтманг, ўзингиз сезмаган ҳолда амалларингиз ҳабата бўлиб қолмасин.",
                            "verse 49:3": "Албатта, Расулуллоҳнинг ҳузурида овозларини пастлатганлар, ана ўшалар Аллоҳ қалбларини тақвога имтиҳон қилган зотлардир.",
                            "verse 49:4": "Албатта, сени ҳужралар ортидан чақираётганларнинг кўплари ақл ишлатмаслар.",
                            "verse 49:5": "Агар уларнинг ҳузурига чиққунингча сабр қилсалар, ўзлари учун яхши бўларди.",
                            "verse 49:6": "Эй иймон келтирганлар! Агар фосиқ хабар келтирса, аниқлаб кўринглар, бир қавмга билмасдан мусибат етказиб қўйиб, қилганингизга надомат чекувчи бўлманглар.",
                            "verse 49:7": "Ва билингларки, албатта, ичларингизда Расулуллоҳ бордир.",
                            "verse 49:8": "Бу Аллоҳ томонидан фазл ва неъматдир.",
                            "verse 49:9": "Агар мўминлардан икки тоифа урушиб кетсалар, бас, ўрталарини ислоҳ қилинг.",
                            "verse 49:10": "Албатта, мўминлар биродардирлар, бас, икки биродарингиз ўртасини ислоҳ қилинг, Аллоҳга тақво қилинг, шоядки, раҳм қилинсангиз.",
                            "verse 49:11": "Эй иймон келтирганлар ! Бир қавм бошқасини масхара қилмасин, эҳтимол улар булардан яхшироқдир.",
                            "verse 49:12": "Эй иймон келтирганлар! Кўп гумонлардан четда бўлинглар, чунки баъзи гумонлар гуноҳдир.",
                            "verse 49:13": "Эй одамлар! Биз сизларни бир эркак ва аёлдан яратдик ва сизларни ўзаро танишишингиз учун халқлар ва қабилалар қилиб қўйдик.",
                            "verse 49:14": "Аъробийлар, иймон келтирдик, дедилар.",
                            "verse 49:15": "Албатта, ҳақиқий мўминлар Аллоҳга ва Унинг Расулига иймон келтирган, сўнгра шубҳа қилмаган ва Аллоҳнинг йўлидан моллари ва жонлари ила жиҳод қилганлардир.",
                            "verse 49:16": "Сен:«Аллоҳга динингизни билдирмоқчимисиз? Ва ҳолбуки, Аллоҳ осмонлару ердаги нарсани билувчи зотдир.",
                            "verse 49:17": "Сенга мусулмон бўлганларини миннат қилурлар.",
                            "verse 49:18": "Албатта, Аллоҳ осмонлару ернинг ғайбини билувчи зотдир."
                        }
                    }
                }
            }
        }
    }
}