{
    "surah_name": "Adh-Dhâriyât",
    "surah_name_ar": "الذاريات",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 51:1": "Pasha ato erëra që çojnë (pluhurin),",
                            "verse 51:2": "dhe të cilat bartin ngarkesat,",
                            "verse 51:3": "dhe ato (erëra) që lundrojnë lehtë,",
                            "verse 51:4": "dhe pasha engjëjt që shpërndajnë urdhërat, -",
                            "verse 51:5": "me të vërtetë, është e sigurt ajo që ju premtohet,",
                            "verse 51:6": "dhe çdo shpërblim (i premtuar) do të ndodhë!",
                            "verse 51:7": "Pasha qiellin e stolisur me yje,",
                            "verse 51:8": "ju jeni të larmishëm në fjalë,",
                            "verse 51:9": "prej tij (Pejgamberit ose Kur’anit) është shmangur ai që ka qenë i shmangur (edhe më parë).",
                            "verse 51:10": "U mallkofshin gënjeshtarët!",
                            "verse 51:11": "Ata që janë thelluar në injorancë (dhe harrojnë ringjalljen).",
                            "verse 51:12": "Ata pyesin: “Kur do të jetë Dita e shpërblimit?”",
                            "verse 51:13": "(Do të jetë) atë Ditë kur ata do të përcëllohen në zjarr!",
                            "verse 51:14": "(U thuhet atyre): “Shijoni dënimin tuaj! Ky (dënim) është ai që e nxitojshit!”",
                            "verse 51:15": "Ata që i druajnë Perëndisë, me të vërtetë, do të jenë në kopshte dhe burime,",
                            "verse 51:16": "duke marrë atë që ua ka dhuruar Zoti i tyre, meqë ata, me të vërtetë, më parë kanë qenë bamirës,",
                            "verse 51:17": "ata, kanë fjetur pak natën (duke iu lutur Perëndisë)",
                            "verse 51:18": "po dhe në agim kërkonin falje,",
                            "verse 51:19": "e, në pasuritë e tyre ka pasur pjesë për lypësit dhe nevojtarët.",
                            "verse 51:20": "Në Tokë ka argumente (të shumta) për ata që besojnë qëndrueshëm,",
                            "verse 51:21": "po edhe në ju – a nuk shihni vallë?",
                            "verse 51:22": "E në qiell është furnizimi dhe premtimi juaj.",
                            "verse 51:23": "Dhe, Pasha Zotin e qiellit dhe të Tokës, kjo është vërtetë e saktë, ashtu si është e vërtetë (aftësia e) të folurit tuaj.",
                            "verse 51:24": "A të ka arritur ty lajmi për mysafirët e ndershëm të Ibrahimit?",
                            "verse 51:25": "Kur ata hynë tek ai, e i thanë: “Selam (Paqë! – shpëtimi u qoftë!)” dhe ai u tha: “Selam (Paqë! Qofshi të shpëtuar!)” Ju jeni – (tha në vetvete) popull i panjohur!”",
                            "verse 51:26": "Dhe, pa u hetuar, ai shkoi te njerëzit e shtëpisë dhe solli viç të majmë (të pjekur),",
                            "verse 51:27": "e ua afroi atyre, e u tha: “A s’po hani?”",
                            "verse 51:28": "Dhe, ndjeu frikë prej tyre, (e) ata i thanë: “Mos u friko!” dhe e sihariquan atë (se do t’i lindë) një djalë i dijshëm.",
                            "verse 51:29": "Dhe, u duk gruaja e tij, duke thërritur dhe duke e rrahur fytyrën, e tha: “Vallë, unë plaka, sterile (a mund) të lind?!",
                            "verse 51:30": "Ata thanë: “Kështu ka thënë Zoti yt.",
                            "verse 51:31": "(Ibrahimi u tha atyre): “Cfarë është obligimi juaj, o pejgamberë?”",
                            "verse 51:32": "Ata thanë: “Na jemi dërguar te një popull mëkatar,",
                            "verse 51:33": "për të hudhur gurë mbi ta prej (baltës) së forcuar,",
                            "verse 51:34": "të shënuar te Zoti yt për ata që e kalojnë kufirin (në të këqia)",
                            "verse 51:35": "Dhe, Ne i nxorëm ata besimtarë që ishin aty (në atë vendbanim) –",
                            "verse 51:36": "e në të kemi gjetur vetëm një shtëpi muslimane –",
                            "verse 51:37": "dhe, në të – kemi lënë argument (shenjë) për ata që i druajnë dënimit të dhembshëm.",
                            "verse 51:38": "Dhe, ne kemi sjellë këshillë edhe te Musai kur ia dërguam atë – Faraonit, me argument të qartë,",
                            "verse 51:39": "e u shmang (Faraoni), duke u mbështetur në pushtetin e vet, dhe tha: “(Ai është) magjistar ose i çmendur!”",
                            "verse 51:40": "Dhe, ne e kapëm atë dhe ushtrinë e tij dhe e hodhëm në det; ai është i qortuar (mëkatar).",
                            "verse 51:41": "(Dhe, Ne, kemi dhënë këshillë mbi ngjarjen) e Adit, kur e dërguam frymën shkatërruese mbi ta,",
                            "verse 51:42": "e cila nuk kurseu asgjë ngado që kaloi, e që të mos e ketë bërë si kalbësirë.",
                            "verse 51:43": "Edhe për Themudin, kur iu tha atyre: “Kënaquni një kohë!”",
                            "verse 51:44": "E, u madhështuan ndaj urdhërave të Perëndisë, e pastaj i goditi rrufeja (zëri i tmerrshëm), e ata e shikonin atë (dënimin),",
                            "verse 51:45": "dhe nuk mundën as të ngritën, as të mbrohen prej dënimit.",
                            "verse 51:46": "Edhe për popullin e Nuhut, që më parë (i kemi shkatërruar).",
                            "verse 51:47": "Ne, e kemi ndërtuar qiellin me pushtetin Tonë, e Ne, me të vërtetë, jemi të pushtetshëm edhe më tepër,",
                            "verse 51:48": "dhe Tokën e kemi shtruar – sa i mrekullueshëm është Ai që e ka shtruar! –",
                            "verse 51:49": "dhe, prej çdo gjëje kemi krijuar çifte, që të meditoni ju!",
                            "verse 51:50": "Andaj, mbështetuni te Perëndia, se unë, me të vërtetë, jam dërguar te ju – prej Tij, paralajmërues i qartë;",
                            "verse 51:51": "Dhe, mos i përshkruani Perëndisë zot tjetër, se unë, me të vërtetë, jam dërguar te ju – prej Tij, paralajmërues i qartë!”",
                            "verse 51:52": "Po ashtu, nuk ka ardhur as para tyre asnjë pejgamber, e që të mos thonin (për te): “Eshtë magjistar”, apo: “Eshtë i çmendur!”",
                            "verse 51:53": "Vallë, a mos ia kanë rekomanduar këtë njëri-tjetrit? Jo, por ata janë popull rebel,",
                            "verse 51:54": "e, shmangu prej tyre; ti nuk do të qortohesh për këtë,",
                            "verse 51:55": "dhe (vazhdoje) këshillimin, se, me të vërtetë, këshilla u bën dobi besimtarëve.",
                            "verse 51:56": "Xhindët dhe njerëzit i kam krijuar vetëm që të Më adhurojnë,",
                            "verse 51:57": "Unë nuk kërkoj prej tyre furnizim, as nuk dëshiroj që të Më ushqejnë,",
                            "verse 51:58": "furnizimin e jep vetëm Perëndia, i Fuqishmi, i Paluhatshmi!",
                            "verse 51:59": "Me të vërtetë, për ata që kanë bërë zullum, kanë pjesë (të dënimit), të ngjashëm pjesës së shokëve të tyre që kanë qenë si ata, e le të mos e nxitojnë atë (dënimin),",
                            "verse 51:60": "sepse, mjerë për mohuesit prej Ditës që u është premtuar! (dënimin),"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "(Toz-torpağı) sovurub-dağıdan küləklərə;",
                            "verse 51:2": "Yağış yüklü buludlara;",
                            "verse 51:3": "Asanlıqla üzüb gedən gəmilərə;",
                            "verse 51:4": "Və ruzi bölən (hərəsi bir işə müvəkkil olan) mələklərə and olsun ki,",
                            "verse 51:5": "Sizə və'd olunan (qiyamət) həqiqətdir (mütləq vaqe olacaqdır).",
                            "verse 51:6": "Haqq-hesab (əmələ görə cəza və mükafat) da labüddür!",
                            "verse 51:7": "(Cürbəcür ulduz) yolları olan göyə and olsun ki,",
                            "verse 51:8": "(Ey müşriklər!) Sizin (Qur'an və Muhəmməd əleyhissəlam barəsində) sözləriniz müxtəlifdir (bə'ziniz Qur'ana şe'r, Peyğəmbərə şair, bə'ziniz də Qur'ana kahinlik əsəri, Peyğəmbərə kahin deyirsiniz).",
                            "verse 51:9": "Ondan (Qur'andan, yaxud Muhəmməd əleyhissəlamdan) zatında dönüklük olan kimsə dönər! (Allahın əzəli elmində imandan kim dönmüşdürsə, Qur'andan və Peyğəmbərdən də elə o dönər!)",
                            "verse 51:10": "Məhv olsun yalançılar! (Allah onlara lə'nət eləsin!)",
                            "verse 51:11": "O kəslər ki, cəhalət girdabına düşüb (haqdan) qafil olmuşlar!",
                            "verse 51:12": "Onlar (səndən istehza ilə) haqq-hesab gününün nə vaxt olacağını soruşarlar.",
                            "verse 51:13": "O gün onlara cəhənnəm odunda əzab veriləcəkdir.",
                            "verse 51:14": "(Mələklər onlara deyəcəklər: ) \"Dadın əzabınızı! Bu sizin (dünyada) tez-tələsik gəlməsini istədiyiniz şeydir (əzabdır)!\"",
                            "verse 51:15": "Həqiqətən, müttəqilər cənnətlərdə və çeşmələr başında olacaqlar;",
                            "verse 51:16": "Rəbbinin onlara verdiyini alacaqlar.",
                            "verse 51:17": "Onlar gecələr (ibadətlə məşğul olub) az yatırdılar.",
                            "verse 51:18": "Səhərlər isə (Allahdan) bağışlanmalarını diləyirdilər.",
                            "verse 51:19": "Mallarında da dilənçinin və (abrına qısılıb dilənməyən) yoxsulun haqqı (payı) var idi.",
                            "verse 51:20": "Yerdə (Allaha) tam yəqinliklə inananlar üçün (Onun əzəmət və qüdrətinə, vəhdaniyyətinə dəlalət edən) əlamətlər vardır.",
                            "verse 51:21": "Sizin özünüz də (sizi yaradanın birliyini sübut edən) əlamətlər vardır.",
                            "verse 51:22": "Göydə də ruzinin (yağış, qar) və və'd olunduğunuz şey (mükafat, cəza) vardır! (Sizə və'd olunan mükafat, yaxud cəza Allah dərgahındakı lövhi-məhfuzda yazılmışdır).",
                            "verse 51:23": "Göyün və yerin Rəbbinə (sahibinə) and olsun ki, bu (deyilənlər) sizin danışığınız (dediyiniz sözün öz sözünüz olması) kimi həqiqətdir.",
                            "verse 51:24": "(Ya Rəsulum!) İbrahimin möhtərəm qonaqlarının (mələklərin) söhbəti sənə gəlib çatdımı?",
                            "verse 51:25": "Onlar (İbrahimin) yanına gəlib salam verdikdə (İbrahim) salamı alıb (öz-özünə): \"Bunlar tanımadığım kimsələrdir!\" -dedi.",
                            "verse 51:26": "O (bir bəhanə ilə) ailəsinin yanına getdi və bir buzov (kəsib qızardaraq) gətirdi.",
                            "verse 51:27": "Onu qabaqlarına (qonaqların qabağına) qoyub: \"Bəlkə, yeyəsiniz!\" - dedi.",
                            "verse 51:28": "(İbrahim qonaqların yeməyə əl uzatmadıqlarını gördükdə) onlardan qorxuya düşdü.",
                            "verse 51:29": "(Bunu eşidən) zövcəsi (Sara) çağır-bağır salıb (təəccübündən əlini) üzünə çırparaq dedi: \"Mən qoca, qısır bir qarıyam! (Mənim necə uşağım ola bilər?)\"",
                            "verse 51:30": "Onlar: \"Sənin Rəbbin belə buyurmuşdur.",
                            "verse 51:31": "(Sonra İbrahim) dedi: \"Ey elçilər! Sizin işiniz nədir?\"",
                            "verse 51:32": "Onlar dedilər: \"Biz günahkar bir qövmə (Lut tayfasına cəza verməyə) göndərilmişik.",
                            "verse 51:33": "Onların başına gildən daşlar yağdırmaq üçün (gəlmişik).",
                            "verse 51:34": "(Elə daşlar ki, onlara pozğunluqla məşğul olub) həddi aşanlar üçün sənin Rəbbinin dərgahında xüsusi nişan qoyulmuşdur!\"",
                            "verse 51:35": "Nəhayət, (Lut qövmünü məhv etmək üçün) orada (Sədumda) olan mö'minləri çıxartdıq.",
                            "verse 51:36": "Lakin orada bir evdən (Lutun ailəsindən) başqa müsəlman (tövhid dinində olan) tapmadıq.",
                            "verse 51:37": "Və orada (axirətdəki) şiddətli əzabdan qorxanlar üçün bir nişanə qoyduq.",
                            "verse 51:38": "Musanın hekayətində də (bir ibrət dərsi vardır).",
                            "verse 51:39": "O, bütün ə'yanları (və qoşunu) ilə birlikdə (imandan) üz döndərib (Musa barəsində): \"Bu sehrbazdır, yaxud da dəlidir!\" - demişdi.",
                            "verse 51:40": "Nəhayət, onu və əsgərlərini tutub dənizə atdıq.",
                            "verse 51:41": "Adın (Ad qövmünün) başına gələnlərdə də (bir ibrət dərsi vardır).",
                            "verse 51:42": "O, qarşısına çıxan heç bir şeyi buraxmır, onu sovurub külə (çör-çöpə) döndərirdi.",
                            "verse 51:43": "Səmudun (Səmud qövmünün) başına gələnlərdə də (bir ibrət dərsi vardır).",
                            "verse 51:44": "Onlar öz Rəbbinin əmrinə (tabe olmağa) təkəbbür göstərmiş və onları gözləri baxa-baxa ildırım vurmuşdu.",
                            "verse 51:45": "Onların nə (yıxıldıqları yerdən) qalxmağa gücləri çatmış, nə də (bir kimsədən özlərinə) kömək istəyə bilmişdilər (yaxud nə də özlərinə cəza verəndən intiqam ala bilmişdilər).",
                            "verse 51:46": "Daha əvvəl Nuh qövmünü (məhv etmişdik).",
                            "verse 51:47": "Biz göyü qüdrətimizlə (qüdrət əlimizlə) yaratdıq və Biz (istədiyimiz hər şeyi yaratmağa) qadirik.",
                            "verse 51:48": "Yeri də Biz döşədik.",
                            "verse 51:49": "Biz hər şeydən (erkək və dişi, bir-birinin əksi olmaqla) cüt-cüt yaratdıq.",
                            "verse 51:50": "(Ya Rəsulum! Bu insanlara de: ) \"Allaha tərəf qaçın! (Allahın qəzəbindən qaçıb Onun mərhəmətinə sığının, küfrü atıb imana gəlin!) Mən sizi Ondan (Allahın əzabından) açıq-aşkar qorxudan bir peyğəmbərəm!",
                            "verse 51:51": "Allahla yanaşı başqa bir tanrı qəbul etməyin.",
                            "verse 51:52": "(Ya Rəsulum! Sənin qövmün sənə şair, sehrbaz, divanə dediyi kimi) eləcə də onlardan əvvəlkilər özlərinə bir peyğəmbər gələr-gəlməz ona sehrbaz, divanə dedilər.",
                            "verse 51:53": "Görəsən, onlar bunu (bu dediklərini) bir-birinə vəsiyyətmi etmişlər?! (Hamısı eyni şeyi deyir).",
                            "verse 51:54": "(Ya Rəsulum!) Artıq onlardan üz döndər! Sən buna görə qınanası deyilsən (çünki sənə həvalə olunmuş risaləti layiqincə təbliğ etdin).",
                            "verse 51:55": "Sən (onlara Qur'anla) öyüd-nəsihət ver.",
                            "verse 51:56": "Mən cinləri və insanları yalnız Mənə ibadət etmək üçün yaratdım!",
                            "verse 51:57": "Mən onlardan ruzi istəmirəm.",
                            "verse 51:58": "Şübhəsiz ki, ruzi verən də, qüvvət sahibi də, yenilməz olan da Allahdır!",
                            "verse 51:59": "Həqiqət, zülm edənlərin (özlərindən əvvəlki) yoldaşlarının qisməti kimi bir qisməti vardır! (Allaha şərik qoşmaqla özlərinə zülm edən Məkkə müşriklərini də əvvəlki ümmətlər kimi şiddətli bir əzab gözləyir!) Qoy onlar Məni (özlərinə əzab verməyə) tələsdirməsinlər!",
                            "verse 51:60": "Və'd olunduqları gündən (qiyamət günündən) dolayı vay kafirlərin halına!"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "Tako Mi onih koji pušu snažno,",
                            "verse 51:2": "i onih koji teret nose,",
                            "verse 51:3": "i onih koji plove lahko,",
                            "verse 51:4": "i onih koji naredbe sprovode -",
                            "verse 51:5": "istina je, zaista, ono čime vam se prijeti,",
                            "verse 51:6": "nagrada i kazna sigurno će biti!",
                            "verse 51:7": "Tako Mi neba punog zvjezdanih puteva,",
                            "verse 51:8": "vi govorite nejednako,",
                            "verse 51:9": "od njega se odvraća onaj za kog se znalo da će se odvratiti.",
                            "verse 51:10": "Neka prokleti budu lažljivci",
                            "verse 51:11": "koji su, utonuli u neznanje, ravnodušni!",
                            "verse 51:12": "Oni pitaju: \"Kada će Dan sudnji?\"",
                            "verse 51:13": "Onoga Dana kada se u vatri budu pržili!",
                            "verse 51:14": "Iskusite kaznu svoju - to je ono što ste požurivali!",
                            "verse 51:15": "Oni koji su se Allaha bojali - u džennetskim baščama će, među izvorima, boraviti,",
                            "verse 51:16": "primaće ono što im Gospodar njihov bude darovao, jer, oni su prije toga dobra djela činili,",
                            "verse 51:17": "noću su malo spavali",
                            "verse 51:18": "i u praskazorje oprost od grijeha molili,",
                            "verse 51:19": "a u imecima njihovim bio je udio i za onoga koji prosi i za onoga koji ne prosi.",
                            "verse 51:20": "Na Zemlji su dokazi za one koji čvrsto vjeruju,",
                            "verse 51:21": "a i u vama samima - zar ne vidite? -",
                            "verse 51:22": "a na nebu je opskrba vaša i ono što vam se obećava.",
                            "verse 51:23": "I, tako Mi Gospodara neba i Zemlje, to je istina, kao što je istina da govorite!",
                            "verse 51:24": "Da li je doprla do tebe vijest o uvaženim gostima Ibrahimovim",
                            "verse 51:25": "kada mu oni uđoše i rekoše: \"Mir vama!\", i on reče: \"Mir vama, ljudi neznani!\"",
                            "verse 51:26": "I on neprimijetno ode ukućanima svojim i donese debelo tele,",
                            "verse 51:27": "i primače im ga: \"Zar nećete da jedete?\" - upita,",
                            "verse 51:28": "osjetivši od njih u duši zebnju.",
                            "verse 51:29": "I pojavi se se žena njegova uzvikujući i po licu se udarajući, i reče: \"Zar ja, stara, nerotkinja?!\"",
                            "verse 51:30": "Tako je odredio Gospodar tvoj - rekoše oni -",
                            "verse 51:31": "A šta vi hoćete, o izaslanici? - upita Ibrahim.",
                            "verse 51:32": "Poslani smo narodu grješnom - rekoše -",
                            "verse 51:33": "da sručimo na njih grumenje od ilovače,",
                            "verse 51:34": "svako obilježeno u Gospodara tvoga za one koji su u razvratu svaku mjeru prešli.",
                            "verse 51:35": "I Mi iz njega vjernike izvedosmo -",
                            "verse 51:36": "a u njemu samo jednu kuću muslimansku nađosmo -",
                            "verse 51:37": "i u njemu za sve one koji se boje patnje neizdržive znak ostavismo.",
                            "verse 51:38": "I o Musau, kada ga s očiglednim dokazom faraonu poslasmo,",
                            "verse 51:39": "a on, uzdajući se u moć svoju, okrenu glavu i reče: \"Čarobnjak je ili lud!\"",
                            "verse 51:40": "I Mi i njega i vojske njegove dohvatismo, pa ih u more bacismo, jer je bio osudu zaslužio.",
                            "verse 51:41": "I o Adu, kada na njih vjetar poslasmo u kome nije bilo nikakva dobra -",
                            "verse 51:42": "pored čega god je prošao, ništa nije poštedio, sve je u gnjilež pretvorio.",
                            "verse 51:43": "I o Semudu, kad mu bi rečeno: \"Uživajte još izvjesno vrijeme!\"",
                            "verse 51:44": "I oni se oglušiše o naređenje Gospodara svoga, pa ih uništi strašan glas na oči njihove,",
                            "verse 51:45": "i ne mogaše se ni dići ni od kazne odbraniti.",
                            "verse 51:46": "I o Nuhovu narodu, davno prije; to, zaista, bijaše narod neposlušni!",
                            "verse 51:47": "Mi smo nebo moći Svojoj sazdali, a Mi, uistinu, još neizmjerno mnogo možemo,",
                            "verse 51:48": "i Zemlju smo prostrli - tako je divan Onaj koji je prostro! -",
                            "verse 51:49": "i od svega po par stvaramo da biste vi razmislili!",
                            "verse 51:50": "Zato požurite Allahu, ja sam vam od Njega da vas javno upozorim;",
                            "verse 51:51": "ne prihvatajte drugog boga osim Allaha, ja sam vam od Njega da vas jasno opomenem!\"",
                            "verse 51:52": "I tako je bilo, ni onima prije ovih nije došao nijedan poslanik, a da nisu rekli: \"Čarobnjak je!\", ili: \"Lud je!\"",
                            "verse 51:53": "Zar su to jedni drugima u amanet ostavljali? Nisu, nego su oni ljudi koji su u zlu svaku mjeru bili prevršili,",
                            "verse 51:54": "zato ove ostavi, prijekor nećeš zaslužiti,",
                            "verse 51:55": "i nastavi savjetovati, savjet će vjernicima, doista, koristiti.",
                            "verse 51:56": "Džine i ljude sam stvorio samo zato da Mi se klanjaju,",
                            "verse 51:57": "Ja ne tražim od njih opskrbu niti želim da Me hrane,",
                            "verse 51:58": "opskrbu daje jedino Allah, Moćni i Jaki!",
                            "verse 51:59": "A nevjernike će stići kazna kao što je stigla i one koji su bili kao oni, i neka Me ne požuruju,",
                            "verse 51:60": "jer, teško nevjernicima na Dan kojim im se prijeti! požuruju,"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "কসম ঝঞ্ঝাবায়ুর।",
                            "verse 51:2": "অতঃপর বোঝা বহনকারী মেঘের।",
                            "verse 51:3": "অতঃপর মৃদু চলমান জলযানের,",
                            "verse 51:4": "অতঃপর কর্ম বন্টনকারী ফেরেশতাগণের,",
                            "verse 51:5": "তোমাদের প্রদত্ত ওয়াদা অবশ্যই সত্য।",
                            "verse 51:6": "ইনসাফ অবশ্যম্ভাবী।",
                            "verse 51:7": "পথবিশিষ্ট আকাশের কসম,",
                            "verse 51:8": "তোমরা তো বিরোধপূর্ণ কথা বলছ।",
                            "verse 51:9": "যে ভ্রষ্ট, সেই এ থেকে মুখ ফিরায়,",
                            "verse 51:10": "অনুমানকারীরা ধ্বংস হোক,",
                            "verse 51:11": "যারা উদাসীন, ভ্রান্ত।",
                            "verse 51:12": "তারা জিজ্ঞাসা করে, কেয়ামত কবে হবে?",
                            "verse 51:13": "যেদিন তারা অগ্নিতে পতিত হবে,",
                            "verse 51:14": "তোমরা তোমাদের শাস্তি আস্বাদন কর। তোমরা একেই ত্বরান্বিত করতে চেয়েছিল।",
                            "verse 51:15": "খোদাভীরুরা জান্নাতে ও প্রস্রবণে থাকবে।",
                            "verse 51:16": "এমতাবস্থায় যে, তারা গ্রহণ করবে যা তাদের পালনকর্তা তাদেরকে দেবেন। নিশ্চয় ইতিপূর্বে তারা ছিল সৎকর্মপরায়ণ,",
                            "verse 51:17": "তারা রাত্রির সামান্য অংশেই নিদ্রা যেত,",
                            "verse 51:18": "রাতের শেষ প্রহরে তারা ক্ষমাপ্রার্থনা করত,",
                            "verse 51:19": "এবং তাদের ধন-সম্পদে প্রার্থী ও বঞ্চিতের হক ছিল।",
                            "verse 51:20": "বিশ্বাসকারীদের জন্যে পৃথিবীতে নিদর্শনাবলী রয়েছে,",
                            "verse 51:21": "এবং তোমাদের নিজেদের মধ্যেও, তোমরা কি অনুধাবন করবে না?",
                            "verse 51:22": "আকাশে রয়েছে তোমাদের রিযিক ও প্রতিশ্রুত সবকিছু।",
                            "verse 51:23": "নভোমন্ডল ও ভূমন্ডলের পালনকর্তার কসম, তোমাদের কথাবার্তার মতই এটা সত্য।",
                            "verse 51:24": "আপনার কাছে ইব্রাহীমের সম্মানিত মেহমানদের বৃত্তান্ত এসেছে কি?",
                            "verse 51:25": "যখন তারা তাঁর কাছে উপস্থিত হয়ে বললঃ সালাম, তখন সে বললঃ সালাম। এরা তো অপরিচিত লোক।",
                            "verse 51:26": "অতঃপর সে গ্রহে গেল এবং একটি ঘৃতেপক্ক মোটা গোবৎস নিয়ে হাযির হল।",
                            "verse 51:27": "সে গোবৎসটি তাদের সামনে রেখে বললঃ তোমরা আহার করছ না কেন?",
                            "verse 51:28": "অতঃপর তাদের সম্পর্কে সে মনে মনে ভীত হলঃ তারা বললঃ ভীত হবেন না। তারা তাঁকে একট জ্ঞানীগুণী পুত্র সন্তানের সুসংবাদ দিল।",
                            "verse 51:29": "অতঃপর তাঁর স্ত্রী চীৎকার করতে করতে সামনে এল এবং মুখ চাপড়িয়ে বললঃ আমি তো বৃদ্ধা, বন্ধ্যা।",
                            "verse 51:30": "তারা বললঃ তোমার পালনকর্তা এরূপই বলেছেন। নিশ্চয় তিনি প্রজ্ঞাময়, সর্বজ্ঞ।",
                            "verse 51:31": "ইব্রাহীম বললঃ হে প্রেরিত ফেরেশতাগণ, তোমাদের উদ্দেশ্য কি?",
                            "verse 51:32": "তারা বললঃ আমরা এক অপরাধী সম্প্রদায়ের প্রতি প্রেরিত হয়েছি,",
                            "verse 51:33": "যাতে তাদের উপর মাটির ঢিলা নিক্ষেপ করি।",
                            "verse 51:34": "যা সীমাতিক্রমকারীদের জন্যে আপনার পালনকর্তার কাছে চিহি?ত আছে।",
                            "verse 51:35": "অতঃপর সেখানে যারা ঈমানদার ছিল, আমি তাদেরকে উদ্ধার করলাম।",
                            "verse 51:36": "এবং সেখানে একটি গৃহ ব্যতীত কোন মুসলমান আমি পাইনি।",
                            "verse 51:37": "যারা যন্ত্রণাদায়ক শাস্তিকে ভয় করে, আমি তাদের জন্যে সেখানে একটি নিদর্শন রেখেছি।",
                            "verse 51:38": "এবং নিদর্শন রয়েছে মূসার বৃত্তান্তে; যখন আমি তাকে সুস্পষ্ট প্রমাণসহ ফেরাউনের কাছে প্রেরণ করেছিলাম।",
                            "verse 51:39": "অতঃপর সে শক্তিবলে মুখ ফিরিয়ে নিল এবং বললঃ সে হয় যাদুকর, না হয় পাগল।",
                            "verse 51:40": "অতঃপর আমি তাকে ও তার সেনাবাহিনীকে পাকড়াও করলাম এবং তাদেরকে সমুদ্রে নিক্ষেপ করলাম। সে ছিল অভিযুক্ত।",
                            "verse 51:41": "এবং নিদর্শন রয়েছে তাদের কাহিনীতে; যখন আমি তাদের উপর প্রেরণ করেছিলাম অশুভ বায়ু।",
                            "verse 51:42": "এই বায়ু যার উপর দিয়ে প্রবাহিত হয়েছিলঃ তাকেই চুর্ণ-বিচুর্ণ করে দিয়েছিল।",
                            "verse 51:43": "আরও নিদর্শন রয়েছে সামূদের ঘটনায়; যখন তাদেরকে বলা হয়েছিল, কিছুকাল মজা লুটে নাও।",
                            "verse 51:44": "অতঃপর তারা তাদের পালনকর্তার আদেশ অমান্য করল এবং তাদের প্রতি বজ্রঘাত হল এমতাবস্থায় যে, তারা তা দেখেছিল।",
                            "verse 51:45": "অতঃপর তারা দাঁড়াতে সক্ষম হল না এবং কোন প্রতিকারও করতে পারল না।",
                            "verse 51:46": "আমি ইতিপূর্বে নূহের সম্প্রদায়কে ধ্বংস করেছি। নিশ্চিতই তারা ছিল পাপাচারী সম্প্রদায়।",
                            "verse 51:47": "আমি স্বীয় ক্ষমতাবলে আকাশ নির্মাণ করেছি এবং আমি অবশ্যই ব্যাপক ক্ষমতাশালী।",
                            "verse 51:48": "আমি ভূমিকে বিছিয়েছি। আমি কত সুন্দরভাবেই না বিছাতে সক্ষম।",
                            "verse 51:49": "আমি প্রত্যেক বস্তু জোড়ায় জোড়ায় সৃষ্টি করেছি, যাতে তোমরা হৃদয়ঙ্গম কর।",
                            "verse 51:50": "অতএব, আল্লাহর দিকে ধাবিত হও। আমি তাঁর তরফ থেকে তোমাদের জন্যে সুস্পষ্ট সতর্ককারী।",
                            "verse 51:51": "তোমরা আল্লাহর সাথে কোন উপাস্য সাব্যস্ত করো না। আমি তাঁর পক্ষ থেকে তোমাদের জন্য সুস্পষ্ট সতর্ককারী।",
                            "verse 51:52": "এমনিভাবে, তাদের পূর্ববর্তীদের কাছে যখনই কোন রসূল আগমন করেছে, তারা বলছেঃ যাদুকর, না হয় উম্মাদ।",
                            "verse 51:53": "তারা কি একে অপরকে এই উপদেশই দিয়ে গেছে? বস্তুতঃ ওরা দুষ্ট সম্প্রদায়।",
                            "verse 51:54": "অতএব, আপনি ওদের থেকে মুখ ফিরিয়ে নিন। এতে আপনি অপরাধী হবেন না।",
                            "verse 51:55": "এবং বোঝাতে থাকুন; কেননা, বোঝানো মুমিনদের উপকারে আসবে।",
                            "verse 51:56": "আমার এবাদত করার জন্যই আমি মানব ও জিন জাতি সৃষ্টি করেছি।",
                            "verse 51:57": "আমি তাদের কাছে জীবিকা চাই না এবং এটাও চাই না যে, তারা আমাকে আহার্য যোগাবে।",
                            "verse 51:58": "আল্লাহ তা’আলাই তো জীবিকাদাতা শক্তির আধার, পরাক্রান্ত।",
                            "verse 51:59": "অতএব, এই যালেমদের প্রাপ্য তাই, যা ওদের অতীত সহচরদের প্রাপ্য ছিল। কাজেই ওরা যেন আমার কাছে তা তাড়াতাড়ি না চায়।",
                            "verse 51:60": "অতএব, কাফেরদের জন্যে দুর্ভোগ সেই দিনের, যেদিনের প্রতিশ্রুতি ওদেরকে দেয়া হয়েছে। চায়।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 51:1": "Кълна се в отвяващите с веене",
                            "verse 51:2": "и в носещите товар ,",
                            "verse 51:3": "и в плаващите с лекота ,",
                            "verse 51:4": "и в разпределящите по повеля ,",
                            "verse 51:5": "че е истина това, което ви е обещано!",
                            "verse 51:6": "И че възмездието ще настъпи.",
                            "verse 51:7": "Кълна се в небето, осеяно с пътища!",
                            "verse 51:8": "Объркани са вашите слова [о, неверници].",
                            "verse 51:9": "Отклонява се от него онзи, който е бил отклонен.",
                            "verse 51:10": "Проклети да са лъжците,",
                            "verse 51:11": "които в бездната [на неверието] нехаят!",
                            "verse 51:12": "Питат: Кога ще е Съдният ден?",
                            "verse 51:13": "В този Ден върху Огъня ще бъдат измъчвани.",
                            "verse 51:14": "Вкусете своето мъчение! Това е, за което бързахте.",
                            "verse 51:15": "Богобоязливите ще бъдат сред градини и извори,",
                            "verse 51:16": "ще взимат онова, което им дарява техният Господ.",
                            "verse 51:17": "малко спяха през нощта",
                            "verse 51:18": "и на развиделяване молеха за опрощение,",
                            "verse 51:19": "и в техните имоти имаше дял за просяка и нуждаещия се.",
                            "verse 51:20": "За убедените на земята има знамения",
                            "verse 51:21": "и в самите вас.",
                            "verse 51:22": "На небето има препитание за вас и там е онова, което ви е обещано.",
                            "verse 51:23": "А то, кълна се в Господа на небето и на земята, е истина, както това, че говорите.",
                            "verse 51:24": "Стигна ли до теб разказът за почетните гости на Ибрахим?",
                            "verse 51:25": "Влязоха при него и рекоха: Мир! Каза: Мир! И си рече: Непознати хора!",
                            "verse 51:26": "И без да го видят, свърна към своето семейство и дойде с тлъсто",
                            "verse 51:27": "теле,",
                            "verse 51:28": "и им го поднесе.",
                            "verse 51:29": "И спотаи страх от тях.",
                            "verse 51:30": "И пристъпи жена му с вик, удряйки лицето си, и рече: Но аз съм бездeтна старица!",
                            "verse 51:31": "Рекоха: Тъй каза твоят Господ.",
                            "verse 51:32": "Рече: А какво ви е намерението, о, пратеници?",
                            "verse 51:33": "Рекоха: Изпратени сме при хора-престъпници,",
                            "verse 51:34": "за да изсипем върху тях камъни от глина,",
                            "verse 51:35": "белязани при твоя Господ за прекаляващите.",
                            "verse 51:36": "И изведохме Ние само вярващите, които бяха там.",
                            "verse 51:37": "И намерихме там отдадени [на Аллах] само в един дом.",
                            "verse 51:38": "И оставихме там знамение за онези, които се страхуват от болезненото мъчение.",
                            "verse 51:39": ".",
                            "verse 51:40": "И се отвърна той със своята опора, и каза: Магьосник или луд.",
                            "verse 51:41": "И сграбчихме него и войските му, и ги хвърлихме в морето.",
                            "verse 51:42": "И за адитите, срещу които изпратихме опустошителния вятър.",
                            "verse 51:43": "И не остави той нищо, над което премина, без да го превърне в прах.",
                            "verse 51:44": "И за самудяните, когато им бе казано: Наслаждавайте се до време!",
                            "verse 51:45": "И се възгордяха пред повелята на техния Господ,",
                            "verse 51:46": "мълнията ги порази, както си гледаха.",
                            "verse 51:47": "И не можаха да се изправят, и не им се помогна.",
                            "verse 51:48": "И народа на Нух",
                            "verse 51:49": "преди.",
                            "verse 51:50": "И небето изградихме с",
                            "verse 51:51": "сила.",
                            "verse 51:52": "И земята Ние разстлахме.",
                            "verse 51:53": "И от всяко нещо сътворихме двойки, за да се поучите!",
                            "verse 51:54": "Затова към Аллах се устремете! Аз съм Негов явен предупредител за вас.",
                            "verse 51:55": "И не приемайте друг Бог заедно с Аллах! Аз съм Негов явен предупредител за вас.",
                            "verse 51:56": "Така и онези преди тях, щом дойдеше пратеник, казваха: Магьосник или луд.",
                            "verse 51:57": "Нима си завещаваха това един другиму? Не, ала те са престъпващи хора.",
                            "verse 51:58": "Отвърни се от тях и не ще бъдеш упрекван!",
                            "verse 51:59": "И поучавай! Наистина поучението носи полза на вярващите.",
                            "verse 51:60": "Сътворих Аз джиновете и хората единствено за да Ми служат.",
                            "verse 51:61": "Не искам от тях препитание и не искам да Ме хранят.",
                            "verse 51:62": "Аллах! Той е Даващия препитанието, Владетеля на силата, Всемогъщия.",
                            "verse 51:63": "Угнетителите имат участ като участта на техните другари.",
                            "verse 51:64": "Горко на неверниците в техния Ден, който им е обещан! избързват!"
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "誓以播種者，",
                            "verse 51:2": "載重者，",
                            "verse 51:3": "飄流者，",
                            "verse 51:4": "分配者，",
                            "verse 51:5": "警告你們的事確是真實的，",
                            "verse 51:6": "報應確是要發生的。",
                            "verse 51:7": "以有軌道的諸天盟誓，",
                            "verse 51:8": "你們確是各執一說的，",
                            "verse 51:9": "原被阻遏者，將被阻遏，而不得到達他。",
                            "verse 51:10": "願常常說謊者被棄絕！",
                            "verse 51:11": "他們浸沉在愚昧之中，他們是昏憒的。",
                            "verse 51:12": "他們問報應日在什麼時候，",
                            "verse 51:13": "那是他們在火刑上受刑之日。",
                            "verse 51:14": "你們嘗試你們的刑罰吧！這就是你們要求早日實現的。",
                            "verse 51:15": "敬畏的人們必定在許多樂園中，在許多泉源畔，",
                            "verse 51:16": "接受他們的主所賞賜的。他們在生前確是行善的，",
                            "verse 51:17": "他們在夜間只稍稍睡一下，",
                            "verse 51:18": "他們在黎明時向主求饒，",
                            "verse 51:19": "他們的財產中，有乞丐和貧民的權利。",
                            "verse 51:20": "在大地上對於篤信的人們，有許多跡象；",
                            "verse 51:21": "在你們自身中也有許多跡象，難道你們看不見嗎？",
                            "verse 51:22": "在天上，有你們的給養，也有應許你們的賞罰。",
                            "verse 51:23": "以天地的主盟誓，這確是真實的，猶如你們能說話一樣。",
                            "verse 51:24": "關於易卜拉欣的受優待的賓客的故事，已來臨你了嗎？",
                            "verse 51:25": "當時，他們進去見他，他們說：「祝你平安！」他說：「祝你們平安！」他想這些是生客。",
                            "verse 51:26": "於是他悄悄地走到他的家屬那裡，拿來一頭肥嫩的牛犢，",
                            "verse 51:27": "他把那牛犢送到客人面前，說：「你們怎麼不吃呢！」",
                            "verse 51:28": "他為他們而心懷恐懼。他們說：「你不要恐懼。」他們以一個有學識的兒童向他報喜。",
                            "verse 51:29": "他的女人便喊叫著走來，她打自己的臉，說：「我是一個不能生育的老婦人。」",
                            "verse 51:30": "他們說：「你的主是這樣說的，他確是至睿的，確是全知的。」",
                            "verse 51:31": "他說：「諸位使者啊！你們有什麼差事呢？」",
                            "verse 51:32": "他們說：「我們確已奉派去懲治一群犯罪的民眾，",
                            "verse 51:33": "我們將因毀滅他們而降下黏土變成的石頭，",
                            "verse 51:34": "那是從你的主那裡為過分者而發出的。」",
                            "verse 51:35": "我把城裡所有的信士都救了出來，",
                            "verse 51:36": "我在城裡只發現一家歸順者。",
                            "verse 51:37": "我曾在城裡留下一種跡象，以便畏懼痛苦的刑罰的人們用作鑒戒。",
                            "verse 51:38": "在穆薩的故事裡也有一種跡象。當時，我曾派遣他帶著一件明証去見法老。",
                            "verse 51:39": "但法老因有勢力故背棄穆薩，他說：「這是一個術士，或是一個瘋人。」",
                            "verse 51:40": "所以我懲治他和他的軍隊，而將他們投入海中，他是受責備的。",
                            "verse 51:41": "在阿德人的故事裡，也有一種跡象。當時，我曾使無益的暴風去毀滅他們，",
                            "verse 51:42": "凡經那暴風吹過的東西，無一不變成破碎的。",
                            "verse 51:43": "在賽莫德人的故事裡，也有一種跡象。當時，有人對他們說：「你們暫時享受吧！」",
                            "verse 51:44": "他們曾違抗他們主的命令，故疾雷毀滅了他們，同時，他們眼見刑罰降臨，",
                            "verse 51:45": "他們未能站起，他們也未能自衛。",
                            "verse 51:46": "以前，我毀滅了努哈的宗族，他們確是悖逆的民眾。",
                            "verse 51:47": "天，我曾以權力建造它，我確是大能的；",
                            "verse 51:48": "地，我曾鋪張它。美哉鋪張者！",
                            "verse 51:49": "我將每種物造成配偶，以便你們覺悟。",
                            "verse 51:50": "你說：「你們應當逃歸真主，我對於你們確是一個坦率的警告者。",
                            "verse 51:51": "你們不要以別的神靈與真主同受崇拜，我對於你們確是一個坦率的警告者。」",
                            "verse 51:52": "他們以前的各民族也象這樣，每有一個使者來臨他們，他們就說：「他是一個術士，或是一個瘋人。」",
                            "verse 51:53": "難道他們曾以此話互相囑咐嗎？不然，他們都是悖逆的民眾。",
                            "verse 51:54": "你應當退避他們，你絕不是受責備的。",
                            "verse 51:55": "你應當教誨眾人，因為教誨對於信士們確是有益的。",
                            "verse 51:56": "我創造精靈和人類，只為要他們崇拜我。",
                            "verse 51:57": "我不望他們的供給，我也不望他們的奉養。",
                            "verse 51:58": "真主確是供給萬物的，確是有權力的，確是堅定的。",
                            "verse 51:59": "不義的人們，和他們的朋友一樣，必得一份刑罰，所以叫他們不要催促我。",
                            "verse 51:60": "傷哉不信道的人們！當他們被警告的日子來臨的時候。 不義的人們，和他們的朋友一樣，必得一份刑罰，所以叫他們不要催促我。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "Při rychle běžících,",
                            "verse 51:2": "břímě nesoucích,",
                            "verse 51:3": "lehce plynoucích",
                            "verse 51:4": "a rozkaz rozdělujících!",
                            "verse 51:5": "To, co vám je slíbeno, je vskutku pravdivé",
                            "verse 51:6": "a soud dozajista nastane!",
                            "verse 51:7": "Při nebi plném drah hvězdných,",
                            "verse 51:8": "vy libujete si v řečech rozporných,",
                            "verse 51:9": "od nichž odvrátí se ten, kdo byl odvrácen.",
                            "verse 51:10": "Nechť zhynou lháři prolhaní,",
                            "verse 51:11": "kteří v hlouposti své jsou lhostejní",
                            "verse 51:12": "a ptají se: \"Kdy dostaví se den poslední?\"",
                            "verse 51:13": "V den, kdy budou ohněm zkoušeni!",
                            "verse 51:14": "Okuste tuto svou zkoušku! Tohle je to, co přáli jste si uspíšit!",
                            "verse 51:15": "Však v zahradách a u pramenů bohabojní budou dlít",
                            "verse 51:16": "přijímajíce to, co Pán jejich jim dává, neb před tím dobré skutky konali",
                            "verse 51:17": "a jen malou část noci spávali",
                            "verse 51:18": "a za úsvitu o odpuštění prosívali",
                            "verse 51:19": "a ze svých majetků vždy patřičně žebrákům a nemajetným dávali.",
                            "verse 51:20": "Na zemi znamení jsou pro věřící přesvědčené,",
                            "verse 51:21": "a také ve vašich duších.",
                            "verse 51:22": "A na nebesích je váš příděl obživy a rovněž to, co vám je slíbeno.",
                            "verse 51:23": "Při Pánu nebes i země, toto je skutečnost stejná jako to, že hovoříte.",
                            "verse 51:24": "Zdaž doneslo se ti o Abrahamových poctěných hostech vyprávění?",
                            "verse 51:25": "Hle, vešli k němu a pravili \"Mír\", a on odvětil: \"I vám mír, lidé neznámí!\"",
                            "verse 51:26": "A k rodině své odešel a tučné tele připravil",
                            "verse 51:27": "a se slovy \"Což jíst nebudete?\" jim je předložil.",
                            "verse 51:28": "A pocítil strach před nimi, však oni mu pak pravili \"Neboj se!\" a zvěst o narození chlapce moudrého mu oznámili.",
                            "verse 51:29": "Pak žena jeho přiběhla vzrušena a do tváře se bila a volala: \"Vždyť já neplodná jsem již stařena!\"",
                            "verse 51:30": "I odpověděli: \"Takto Pán tvůj děl a On věru moudrý je i vševědoucí.",
                            "verse 51:31": "A otázal se Abraham: \"Jaká věc vás přivádí, vyslanci?\"",
                            "verse 51:32": "Odvětili: \"Posláni jsme byli mezi lidi hříšné,",
                            "verse 51:33": "abychom na ně seslali kameny z hlíny pálené,",
                            "verse 51:34": "u Pána tvého jmény přestupníků označené.",
                            "verse 51:35": "Ty z nich, kdož věřící byli, jsme odtamtud vyvedli,",
                            "verse 51:36": "však dům jen jediný těch, kdož do vůle Boží se odevzdali, jsme tam nalezli.",
                            "verse 51:37": "A zanechali jsme je jako znamení těm, kdo trestu bolestného se obávají.",
                            "verse 51:38": ".",
                            "verse 51:39": "ten však se obrátil i se svou oporou a prohlásil: \"Kouzelník je to nebo blázen!\"",
                            "verse 51:40": "A uchvátili jsme jej i vojska jeho a do moře jsme je uvrhli, neb pokárání byl hoden.",
                            "verse 51:41": ".",
                            "verse 51:42": "jež nic z toho, nad čím se převalila, nenechala, aby v prach to neproměnila.",
                            "verse 51:43": ".",
                            "verse 51:44": "Však rozkazu Pána svého neposlechli a zemětřesení je postihlo, zatímco se dívali,",
                            "verse 51:45": "a nebyli schopni se zpříma postavit a nebylo jim pomoci.",
                            "verse 51:46": ".",
                            "verse 51:47": "Nebe jsme důkladně postavili, vždyť My jsme rozšiřovateli,",
                            "verse 51:48": "a zemi jsme rozprostřeli - a jak výteční jsme v tom byli!",
                            "verse 51:49": "A každou věc jsme v párech stvořili - snad si to připomenete!",
                            "verse 51:50": "K Bohu se utíkejte, neb já jsem od Něho pro vás varovatel zjevný,",
                            "verse 51:51": "a nepřidružujte k Bohu žádné jiné božstvo, neb já jsem od Něho pro vás varovatel zjevný!",
                            "verse 51:52": "A stejně tak nepřišel k těm, kdož před těmito byli, žádný posel, aby o něm neprohlásili: \"Kouzelník je to nebo blázen!\"",
                            "verse 51:53": "Což po sobě to dědí? Nikoliv, však lid je to vzpurný.",
                            "verse 51:54": "Odvrať se proto od nich, a nebudeš za to kárán!",
                            "verse 51:55": "Připomínej, vždyť připomenutí je věřícím prospěšné!",
                            "verse 51:56": "A džiny a lidi jsem jedině proto stvořil, aby Mne uctívali,",
                            "verse 51:57": "a nechci od nich žádný příděl obživy a netoužím po tom, aby Mne živili,",
                            "verse 51:58": "vždyť Bůh sám je živitel, vládce síly a nezviklatelný!",
                            "verse 51:59": "Věru těm, kdož křivdili, se dostane přídělu podobného, přídělu jim rovných před nimi; nechť se tedy o uspíšení nesnaží!",
                            "verse 51:60": "Běda nevěřícím v ten jejich den, jenž byl jim přislíben! nesnaží!"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "(Wij roepen als getuigen) degenen die wijd en zijd verspreiden,",
                            "verse 51:2": "En degenen die de last dragen,",
                            "verse 51:3": "En degenen die rustig voortgaan,",
                            "verse 51:4": "En degenen die de zaak uitdelen.",
                            "verse 51:5": "Voorzeker, hetgeen u is beloofd, is waar,",
                            "verse 51:6": "En voorwaar, het gericht zal zeker plaats hebben.",
                            "verse 51:7": "Bij de hemelen vol van paden,",
                            "verse 51:8": "Waarlijk gij hebt uiteenlopende meningen,",
                            "verse 51:9": "Daarvan wordt afgewend wie zich (van het ware geloof) afwendt.",
                            "verse 51:10": "Vervloekt zijn zij die vermoedens uiten.",
                            "verse 51:11": "Die onachtzaam zijn in onwetendheid.",
                            "verse 51:12": "Zij vragen: \"Wanneer zal de Tijd des Gerichts zijn?\"",
                            "verse 51:13": "Het zal op de Dag zijn, wanneer zij in het Vuur zullen worden beproefd.",
                            "verse 51:14": "\"Ondergaat uw beproeving.",
                            "verse 51:15": "Maar de rechtvaardigen zullen te midden van tuinen en bronnen verkeren,",
                            "verse 51:16": "Nemend hetgeen hun Heer zal geven omdat zij voorheen goed plachten te doen.",
                            "verse 51:17": "Gedurende de nacht sliepen zij weinig.",
                            "verse 51:18": "Tijdens de morgenstond zochten zij vergiffenis.",
                            "verse 51:19": "En van hun rijkdommen was een deel voor de bedelaars en ook voor degenen die niet konden bedelen.",
                            "verse 51:20": "En er zijn tekenen op aarde voor hen die zekerheid van geloof willen hebben,",
                            "verse 51:21": "En ook in uzelf, wilt gij dat niet inzien?",
                            "verse 51:22": "En in de hemel is uw onderhoud en hetgeen u is beloofd.",
                            "verse 51:23": "Bij de Heer van de hemel en de aarde - dit is inderdaad de waarheid zoals gij spreekt.",
                            "verse 51:24": "Heeft het verhaal van Abrahams geeerde gasten u bereikt?",
                            "verse 51:25": "Toen zij bij hem binnentraden en zeiden: \"Vrede\", antwoordde hij: \"Vrede\".",
                            "verse 51:26": "Maar hij ging rustig naar zijn gezin en bracht een (toebereid) vet kalf.",
                            "verse 51:27": "En plaatste het voor hen.",
                            "verse 51:28": "Daarop begon hij hen te vrezen.",
                            "verse 51:29": "Toen kwam zijn vrouw, in verbijstering en sloeg de hand voor het gezicht en zeide: \"Een verwelkte, bejaarde vrouw!\"",
                            "verse 51:30": "\"Uw Heer heeft het zo gezegd,\" zeiden zij.",
                            "verse 51:31": "Abraham zeide: \"Wat is uw taak, o boodsehappers?\"",
                            "verse 51:32": "Zij antwoordden: \"Wij zijn naar een schuldig volk gezonden",
                            "verse 51:33": "Om brokken klei op hen neder te zenden",
                            "verse 51:34": "Door uw Heer gemerkt (ter verdelging) voor de buitensporigen.",
                            "verse 51:35": "De gelovigen die daarin waren lieten Wij (veilig) weggaan.",
                            "verse 51:36": "Maar Wij vonden er slechts één huis der Moslims.",
                            "verse 51:37": "En Wij lieten daarin een teken achter voor hen, die de pijnlijke straf vrezen.",
                            "verse 51:38": "En in Mozes (is eveneens een teken), toen Wij hem tot Pharao zonden met openlijk gezag.",
                            "verse 51:39": "Maar deze wendde zich af om zijn macht en zeide: \"Een tovenaar of een waanzinnige.",
                            "verse 51:40": "Daarom grepen Wij hem en zijn scharen en wierpen hen in de zee, waardoor hij zelfverwijt kreeg.",
                            "verse 51:41": "En er was een teken in de Aad, toen Wij een orkaan tegen hen zonden.",
                            "verse 51:42": "Deze liet van hetgeen hij teisterde niets over of hij maakte het als as,",
                            "verse 51:43": "En er was een teken in de Samoed toen er tot hen werd gezegd: \"Vermaakt u voor een wijle.",
                            "verse 51:44": "Maar zij overtraden het gebod van hun Heer.",
                            "verse 51:45": "En zij konden niet opstaan noch konden zij zich hiertegen beschermen.",
                            "verse 51:46": "En in het volk van Noach (is ook een teken), voorwaar zij waren een ongehoorzaam volk.",
                            "verse 51:47": "Voorzeker Wij bouwden de hemel door Onze macht en waarlijk Wij zin het, Die hem hebben uitgebreid.",
                            "verse 51:48": "En Wij hebben de aarde uitgespreid en hoe uitmuntend hebben Wij dit gedaan.",
                            "verse 51:49": "En Wij hebben alles in paren geschapen opdat gij er lering uit moogt trekken.",
                            "verse 51:50": "Haast u daarom tot God.",
                            "verse 51:51": "En werpt geen andere God op naast God, waarlijk ik ben voor u een duidelijke waarschuwer van Hem.",
                            "verse 51:52": "En er kwam tot degenen, die vóór hen waren, geen boodschapper of zij zeiden: \"Dit is een tovenaar of een bezetene!\"",
                            "verse 51:53": "Hebben zij elkander er toe aangespoord? Neen, zij zijn een opstandig volk.",
                            "verse 51:54": "Wend u daarom van hen af en u zal niets worden verweten.",
                            "verse 51:55": "Maar ga door met het vermanen want de vermaning helpt degenen die willen geloven.",
                            "verse 51:56": "En ik heb de djinn en de mensen slechts tot Mijn aanbidding geschapen.",
                            "verse 51:57": "Ik wens van hen geen onderhoud noch wens Ik dat zij Mij zullen voeden.",
                            "verse 51:58": "Voorzeker, God is de grootste Voorziener, de Almachtige, de Alsterke.",
                            "verse 51:59": "Voorzeker het lot der onrechtvaardigen is gelijk aan dat van hun gezellen.",
                            "verse 51:60": "Wee over de ongelovigen vanwege de Dag waarmede zij worden bedreigd! verhaasten."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 51:1": "By those that winnow with a winnowing",
                            "verse 51:2": "And those that bear the burden (of the rain)",
                            "verse 51:3": "And those that glide with ease (upon the sea)",
                            "verse 51:4": "And those who distribute (blessings) by command,",
                            "verse 51:5": "Lo! that wherewith ye are threatened is indeed true,",
                            "verse 51:6": "And lo! the judgment will indeed befall.",
                            "verse 51:7": "By the heaven full of paths,",
                            "verse 51:8": "Lo! ye, forsooth, are of various opinion (concerning the truth).",
                            "verse 51:9": "He is made to turn away from it who is (himself) averse.",
                            "verse 51:10": "Accursed be the conjecturers",
                            "verse 51:11": "Who are careless in an abyss!",
                            "verse 51:12": "They ask: When is the Day of Judgment ?",
                            "verse 51:13": "(It is) the day when they will be tormented at the Fire,",
                            "verse 51:14": "(And it will be said unto them): Taste your torment (which ye inflicted).",
                            "verse 51:15": "Lo! those who keep from evil will dwell amid gardens and watersprings,",
                            "verse 51:16": "Taking that which their Lord giveth them; for lo! aforetime they were doers of good;",
                            "verse 51:17": "They used to sleep but little of the night,",
                            "verse 51:18": "And ere the dawning of each day would seek forgiveness,",
                            "verse 51:19": "And in their wealth the beggar and the outcast had due share.",
                            "verse 51:20": "And in the earth are portents for those whose faith is sure.",
                            "verse 51:21": "And (also) in yourselves.",
                            "verse 51:22": "And in the heaven is your providence and that which ye are promised;",
                            "verse 51:23": "And by the Lord of the heavens and the earth, it is the truth, even as (it is true) that ye speak.",
                            "verse 51:24": "Hath the story of Abraham’s honoured guests reached thee (O Muhammad) ?",
                            "verse 51:25": "When they came in unto him and said: Peace! he answered, Peace! (and thought): Folk unknown (to me).",
                            "verse 51:26": "Then he went apart unto his housefolk so that they brought a fatted calf;",
                            "verse 51:27": "And he set it before them, saying: Will ye not eat ?",
                            "verse 51:28": "Then he conceived a fear of them.",
                            "verse 51:29": "Then his wife came forward, making moan, and smote her face, and cried: A barren old woman!",
                            "verse 51:30": "They said: Even so saith thy Lord.",
                            "verse 51:31": "(Abraham) said: And (afterward) what is your errand, O ye sent (from Allah) ?",
                            "verse 51:32": "They said: Lo! we are sent unto a guilty folk,",
                            "verse 51:33": "That we may send upon them stones of clay,",
                            "verse 51:34": "Marked by thy Lord for (the destruction of) the wanton.",
                            "verse 51:35": "Then we brought forth such believers as were there.",
                            "verse 51:36": "But We found there but one house of those surrendered (to Allah).",
                            "verse 51:37": "And We left behind therein a portent for those who fear a painful doom.",
                            "verse 51:38": "And in Moses (too, there is a portent) when We sent him unto Pharaoh with clear warrant,",
                            "verse 51:39": "But he withdrew (confiding) in his might, and said: A wizard or a madman.",
                            "verse 51:40": "So We seized him and his hosts and flung them in the sea, for he was reprobate.",
                            "verse 51:41": "And in (the tribe of) A’ad (there is a portent) when we sent the fatal wind against them.",
                            "verse 51:42": "It spared naught that it reached, but made it (all) as dust.",
                            "verse 51:43": "And in (the tribe of) Thamud (there is a portent) when it was told them: Take your ease awhile.",
                            "verse 51:44": "But they rebelled against their Lord’s decree, and so the thunderbolt overtook them even while they gazed;",
                            "verse 51:45": "And they were unable to rise up, nor could they help themselves.",
                            "verse 51:46": "And the folk of Noah aforetime.",
                            "verse 51:47": "We have built the heaven with might, and We it is Who make the vast extent (thereof).",
                            "verse 51:48": "And the earth have We laid out, how gracious is the Spreader (thereof)!",
                            "verse 51:49": "And all things We have created by pairs, that haply ye may reflect.",
                            "verse 51:50": "Therefor flee unto Allah; lo! I am a plain warner unto you from him.",
                            "verse 51:51": "And set not any other god along with Allah; lo! I am a plain warner unto you from Him.",
                            "verse 51:52": "Even so there came no messenger unto those before them but they said: A wizard or a madman!",
                            "verse 51:53": "Have they handed down (the saying) as an heirloom one unto another ? Nay, but they are froward folk.",
                            "verse 51:54": "So withdraw from them (O Muhammad), for thou art in no wise blameworthy,",
                            "verse 51:55": "And warn, for warning profiteth believers.",
                            "verse 51:56": "I created the jinn and humankind only that they might worship Me.",
                            "verse 51:57": "I seek no livelihood from them, nor do I ask that they should feed",
                            "verse 51:58": "Lo! Allah! He it is that giveth livelihood, the Lord of unbreakable might.",
                            "verse 51:59": "And lo! for those who (now) do wrong there is an evil day like unto the evil day (which came for) their likes (of old); so let them not ask Me to hasten on (that day).",
                            "verse 51:60": "And woe unto those who disbelieve, from (that) their day which they are promised."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 51:1": "By the (Winds) that scatter broadcast;",
                            "verse 51:2": "And those that lift and bear away heavy weights;",
                            "verse 51:3": "And those that flow with ease and gentleness;",
                            "verse 51:4": "And those that distribute and apportion by Command;-",
                            "verse 51:5": "Verily that which ye are promised is true;",
                            "verse 51:6": "And verily Judgment and Justice must indeed come to pass.",
                            "verse 51:7": "By the Sky with (its) numerous Paths,",
                            "verse 51:8": "Truly ye are in a doctrine discordant,",
                            "verse 51:9": "Through which are deluded (away from the Truth) such as would be deluded.",
                            "verse 51:10": "Woe to the falsehood-mongers,-",
                            "verse 51:11": "Those who (flounder) heedless in a flood of confusion:",
                            "verse 51:12": "They ask, \"When will be the Day of Judgment and Justice?\"",
                            "verse 51:13": "(It will be) a Day when they will be tried (and tested) over the Fire!",
                            "verse 51:14": "\"Taste ye your trial! This is what ye used to ask to be hastened!\"",
                            "verse 51:15": "As to the Righteous, they will be in the midst of Gardens and Springs,",
                            "verse 51:16": "Taking joy in the things which their Lord gives them, because, before then, they lived a good life.",
                            "verse 51:17": "They were in the habit of sleeping but little by night,",
                            "verse 51:18": "And in the hour of early dawn, they (were found) praying for Forgiveness;",
                            "verse 51:19": "And in their wealth and possessions (was remembered) the right of the (needy,) him who asked, and him who (for some reason) was prevented (from asking).",
                            "verse 51:20": "On the earth are signs for those of assured Faith,",
                            "verse 51:21": "As also in your own selves: Will ye not then see?",
                            "verse 51:22": "And in heaven is your Sustenance, as (also) that which ye are promised.",
                            "verse 51:23": "Then, by the Lord of heaven and earth, this is the very Truth, as much as the fact that ye can speak intelligently to each other.",
                            "verse 51:24": "Has the story reached thee, of the honoured guests of Abraham?",
                            "verse 51:25": "Behold, they entered his presence, and said: \"Peace!\" He said, \"Peace!\" (and thought, \"These seem) unusual people.",
                            "verse 51:26": "Then he turned quickly to his household, brought out a fatted calf,",
                            "verse 51:27": "And placed it before them.",
                            "verse 51:28": "(When they did not eat), He conceived a fear of them.",
                            "verse 51:29": "But his wife came forward (laughing) aloud: she smote her forehead and said: \"A barren old woman!\"",
                            "verse 51:30": "They said, \"Even so has thy Lord spoken: and He is full of Wisdom and Knowledge.",
                            "verse 51:31": "(Abraham) said: \"And what, O ye Messengers, is your errand (now)?\"",
                            "verse 51:32": "They said, \"We have been sent to a people (deep) in sin;-",
                            "verse 51:33": "\"To bring on, on them, (a shower of) stones of clay (brimstone),",
                            "verse 51:34": "\"Marked as from thy Lord for those who trespass beyond bounds.",
                            "verse 51:35": "Then We evacuated those of the Believers who were there,",
                            "verse 51:36": "But We found not there any just (Muslim) persons except in one house:",
                            "verse 51:37": "And We left there a Sign for such as fear the Grievous Penalty.",
                            "verse 51:38": "And in Moses (was another Sign): Behold, We sent him to Pharaoh, with authority manifest.",
                            "verse 51:39": "But (Pharaoh) turned back with his Chiefs, and said, \"A sorcerer, or one possessed!\"",
                            "verse 51:40": "So We took him and his forces, and threw them into the sea; and his was the blame.",
                            "verse 51:41": "And in the ’Ad (people) (was another Sign): Behold, We sent against them the devastating Wind:",
                            "verse 51:42": "It left nothing whatever that it came up against, but reduced it to ruin and rottenness.",
                            "verse 51:43": "And in the Thamud (was another Sign): Behold, they were told, \"Enjoy (your brief day) for a little while!\"",
                            "verse 51:44": "But they insolently defied the Command of their Lord: So the stunning noise (of an earthquake) seized them, even while they were looking on.",
                            "verse 51:45": "Then they could not even stand (on their feet), nor could they help themselves.",
                            "verse 51:46": "So were the People of Noah before them for they wickedly transgressed.",
                            "verse 51:47": "With power and skill did We construct the Firmament: for it is We Who create the vastness of pace.",
                            "verse 51:48": "And We have spread out the (spacious) earth: How excellently We do spread out!",
                            "verse 51:49": "And of every thing We have created pairs: That ye may receive instruction.",
                            "verse 51:50": "Hasten ye then (at once) to God: I am from Him a Warner to you, clear and open!",
                            "verse 51:51": "And make not another an object of worship with God: I am from Him a Warner to you, clear and open!",
                            "verse 51:52": "Similarly, no apostle came to the Peoples before them, but they said (of him) in like manner, \"A sorcerer, or one possessed\"!",
                            "verse 51:53": "Is this the legacy they have transmitted, one to another? Nay, they are themselves a people transgressing beyond bounds!",
                            "verse 51:54": "So turn away from them: not thine is the blame.",
                            "verse 51:55": "But teach (thy Message) for teaching benefits the Believers.",
                            "verse 51:56": "I have only created Jinns and men, that they may serve Me.",
                            "verse 51:57": "No Sustenance do I require of them, nor do I require that they should feed Me.",
                            "verse 51:58": "For God is He Who gives (all) Sustenance,- Lord of Power,- Steadfast (for ever).",
                            "verse 51:59": "For the Wrong-doers, their portion is like unto the portion of their fellows (of earlier generations): then let them not ask Me to hasten (that portion)!",
                            "verse 51:60": "Woe, then, to the Unbelievers, on account of that Day of theirs which they have been promised!"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 51:1": "By the swift scatterers",
                            "verse 51:2": "and the burden-bearers",
                            "verse 51:3": "and the smooth runners",
                            "verse 51:4": "and the partitioners,",
                            "verse 51:5": "surely that you are promised is true,",
                            "verse 51:6": "and surely the Doom is about to fall!",
                            "verse 51:7": "By heaven with all its tracks",
                            "verse 51:8": "surely you speak at variance,",
                            "verse 51:9": "and perverted therefrom are some.",
                            "verse 51:10": "Perish the conjecturers",
                            "verse 51:11": "who are dazed in perplexity",
                            "verse 51:12": "asking, ’When shall be the Day of Doom?’",
                            "verse 51:13": "Upon the day when they shall be tried at the Fire:",
                            "verse 51:14": "’Taste your trial! This is that you were seeking to hasten.",
                            "verse 51:15": "Surely the godfearing shall be among gardens and fountains",
                            "verse 51:16": "taking whatsoever their Lord has given them; they were good-doers before that.",
                            "verse 51:17": "Little of the night would they slumber,",
                            "verse 51:18": "and in the mornings they would ask for forgiveness;",
                            "verse 51:19": "and the beggar and the outcast had a share in their wealth.",
                            "verse 51:20": "In the earth are signs for those having sure faith;",
                            "verse 51:21": "and in your selves; what, do you not see?",
                            "verse 51:22": "And in heaven is your provision, and that you are promised.",
                            "verse 51:23": "So by the Lord of heaven and earth, it is as surely true as that you have speech.",
                            "verse 51:24": "Hast thou received the story of the honoured guests of Abraham?",
                            "verse 51:25": "When they entered unto him, saying ’Peace!’ he said ’Peace! You are a people unknown to me.",
                            "verse 51:26": "Then he turned to his household and brought a fattened calf,",
                            "verse 51:27": "and he laid it before them saying, ’Will you not eat?’",
                            "verse 51:28": "Then he conceived a fear of them.",
                            "verse 51:29": "Then came forward his wife, clamouring, and she smote her face, and said, ’An old woman, barren!’",
                            "verse 51:30": "They said, ’So says thy Lord; He is the All-wise, the All-knowing.",
                            "verse 51:31": "Said he, ’And what is your business, envoys?’",
                            "verse 51:32": "They said, ’We have been sent to a people of sinners,",
                            "verse 51:33": "to loose upon them stones of clay",
                            "verse 51:34": "marked with thy Lord for the prodigal.",
                            "verse 51:35": "So We brought forth such believers as were in it,",
                            "verse 51:36": "but We found not therein except one house of those that have surrendered themselves.",
                            "verse 51:37": "And therein We left a sign to those who fear the painful chastisement.",
                            "verse 51:38": "And also in Moses, when We sent him unto Pharaoh, with a clear authority,",
                            "verse 51:39": "but he turned his back, with his court, saying, ’A sorcerer, or a man possessed!’",
                            "verse 51:40": "So We seized him and his hosts, and We cast them into the sea, and he blameworthy.",
                            "verse 51:41": "And also in Ad, when We loosed against them the withering wind",
                            "verse 51:42": "that left nothing it came upon, but made it as stuff decayed.",
                            "verse 51:43": "And also in Thamood, when it was said to them, ’Take your enjoyment for a while!’",
                            "verse 51:44": "Then they turned in disdain from the commandment of their Lord, and the thunderbolt took them and they themselves beholding",
                            "verse 51:45": "and they were not able to stand upright, and were not helped.",
                            "verse 51:46": "And the people of Noah before; surely they were an ungodly people.",
                            "verse 51:47": "And heaven -- We built it with might, and We extend it wide.",
                            "verse 51:48": "And the earth -- We spread it forth; O excellent Smoothers!",
                            "verse 51:49": "And of everything created We two kinds; haply you will remember",
                            "verse 51:50": "Therefore flee unto God! I am a clear warner from Him to you.",
                            "verse 51:51": "And set not up with God another god; I am a clear warner from Him to you.",
                            "verse 51:52": "Even so not a Messenger came to those before them but they said, ’A sorcerer, or a man possessed!’",
                            "verse 51:53": "What, have they bequeathed it one to another? Nay, but they are an insolent people.",
                            "verse 51:54": "So turn thou from them; thou wilt not be reproached.",
                            "verse 51:55": "And remind; the Reminder profits the believers.",
                            "verse 51:56": "I have not created jinn and mankind except to serve Me.",
                            "verse 51:57": "I desire of them no provision, neither do I desire that they should feed Me.",
                            "verse 51:58": "Surely God is the All-provider, the Possessor of Strength, the Ever-Sure.",
                            "verse 51:59": "The evildoers shall have their portion, like the portion of their fellows; so let them not hasten Me!",
                            "verse 51:60": "So woe to the unbelievers, for that day of theirs that they are promised."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 51:1": "CONSIDER the winds that scatter the dust far and wide,",
                            "verse 51:2": "and those that carry the burden [of heavy clouds],",
                            "verse 51:3": "and those that speed along with gentle ease,",
                            "verse 51:4": "and those that apportion [the gift of life] at",
                            "verse 51:5": "behest!",
                            "verse 51:6": "Verily, that which you are promised is true indeed,",
                            "verse 51:7": "and, verily, judgment is bound to come!",
                            "verse 51:8": "CONSIDER the firmament full of starry paths!",
                            "verse 51:9": "Verily, [O men,] you are deeply at variance as to what to believe:",
                            "verse 51:10": "perverted in his views thereon is he who would deceive himself!",
                            "verse 51:11": "They but destroy themselves, they who are given to guessing at what they cannot ascertain",
                            "verse 51:12": "they who blunder along, in ignorance lost",
                            "verse 51:13": "they who",
                            "verse 51:14": "ask, \"When is that Day of Judgment to be?\"",
                            "verse 51:15": "[It will be] a Day when they will be sorely tried by the fire,",
                            "verse 51:16": "[and will be told:] \"Taste this your trial! It is this that you were so hastily asking for!\"",
                            "verse 51:17": "",
                            "verse 51:18": "behold, the God-conscious will find themselves amid gardens and springs,",
                            "verse 51:19": "enjoying all that their Sustainer will have granted them ,",
                            "verse 51:20": "verily, they were doers of good in the past:",
                            "verse 51:21": "they would lie asleep during but a small part of the night,",
                            "verse 51:22": "and would pray for forgiveness from their innermost hearts;",
                            "verse 51:23": "and [would assign] in all that they possessed a due share unto such as might ask [for help] and such as might suffer privation.",
                            "verse 51:24": "AND ON EARTH there are signs [of God’s existence, visible] to all who are endowed with inner certainty,",
                            "verse 51:25": "just as [there are signs thereof] within your own selves: can you not, then, see?",
                            "verse 51:26": "And in heaven is [the source of] your sustenance [on earth] and",
                            "verse 51:27": "all that you are promised [for your life after death]:",
                            "verse 51:28": "for, by the Sustainer of heaven and earth, this [life after death] is the very truth – as true as that you are endowed with speech!",
                            "verse 51:29": "AND HAS the story of Abraham’s honoured guests ever come within thy ken?",
                            "verse 51:30": "When those [heavenly messengers] came unto him and bade him peace, he answered, \"[And upon you be] peace!\" – [saying to himself,] \"They are strangers.",
                            "verse 51:31": "Then he turned quietly to his household, and brought forth a fat",
                            "verse 51:32": "calf,",
                            "verse 51:33": "and placed it before them, saying, \"Will you not eat?\"",
                            "verse 51:34": "[And when he saw that the guests would not eat,] he became apprehensive of them;",
                            "verse 51:35": "they said, \"Fear not\" – and gave him the glad tiding of [the birth of] a son who would be endowed with deep knowledge.",
                            "verse 51:36": "Thereupon his wife approached [the guests] with a loud cry, and struck her face [in astonishment] and exclaimed: \"A barren old woman [like me]!\"",
                            "verse 51:37": "They answered: \"Thus has thy Sustainer decreed; and, verily, He alone is truly wise, all-knowing!\"",
                            "verse 51:38": "Said :",
                            "verse 51:39": "\"And what",
                            "verse 51:40": "may you have in view, O you",
                            "verse 51:41": "messengers?\"",
                            "verse 51:42": "They answered: \"Behold, we have been sent unto a people lost in sin,",
                            "verse 51:43": "to let loose upon them stone-hard blows of chastisement,",
                            "verse 51:44": "marked out in thy Sustainer’s sight for [the punishment of] such as have wasted their own selves.",
                            "verse 51:45": "And in the course of time We brought out [of Lot’s city] such",
                            "verse 51:46": "believers as were there:",
                            "verse 51:47": "for apart from one",
                            "verse 51:48": "house We did not find there any who had surrendered themselves to Us.",
                            "verse 51:49": "And so We left therein a message for those who fear the grievous suffering [which awaits all evildoers].",
                            "verse 51:50": "AND IN [the story of Pharaoh and] Moses, too, [We left the same message: for] when We sent him unto Pharaoh with",
                            "verse 51:51": "manifest authority,",
                            "verse 51:52": "and he turned away in [the pride of] his power and said, \"A sorcerer [is this Moses], or a madman!\"",
                            "verse 51:53": "We seized him and his hosts, and cast them all into the sea: and [none but Pharaoh] himself was to blame [for what happened].",
                            "verse 51:54": "And [you have the same message] in [what happened to the tribe of] ’ād, when We let loose against them that life-destroying wind",
                            "verse 51:55": "which spared nothing of what it came upon, but caused [all of] it to become like bones dead and decayed.",
                            "verse 51:56": "And in [the story of the tribe of] Thamūd, too, when they were told, \"You shall enjoy your life for",
                            "verse 51:57": "a little while,\"",
                            "verse 51:58": "after they had turned with disdain from their Sustainer’s commandment – whereupon the thunderbolt of punishment overtook them while they were",
                            "verse 51:59": "looking on:",
                            "verse 51:60": "for they were unable even to rise, and could not defend themselves.",
                            "verse 51:61": "And [thus, too, We destroyed] Noah’s people aforetime: for they were iniquitous folk.",
                            "verse 51:62": "AND IT IS We who have built the universe with [Our creative] power; and, verily, it is We who are steadily expanding it.",
                            "verse 51:63": "And the earth have We spread out wide – and how well have We ordered it!",
                            "verse 51:64": "And in everything have We created opposites, so that you might bear in mind [that God alone is one].",
                            "verse 51:65": "And so, [O Muhammad, say unto them:] \"Flee unto God [from all that is false and evil]! Verily, I am a plain warner to you from Him!",
                            "verse 51:66": "And do not ascribe divinity to aught side by side with God: verily, I am a plain warner to you from Him!\"",
                            "verse 51:67": "",
                            "verse 51:68": "thus it is: never yet came any apostle to those who lived before their time but they said, \"A spellbinder [is he], or a madman!\"",
                            "verse 51:69": "Have they, perchance, handed down this [way of thinking] as a legacy unto one another? Nay, they are people filled with overweening arrogance!",
                            "verse 51:70": "Turn, then, away from them, and thou shalt incur no blame;",
                            "verse 51:71": "yet go on reminding [all who would listen]: for, verily, such a reminder will profit the believers.",
                            "verse 51:72": "And [tell them that] I have not created the invisible beings and men to any end other than that they may [know and] worship Me.",
                            "verse 51:73": "[But withal,] no sustenance do I ever demand of them, nor do I demand that they feed Me:",
                            "verse 51:74": "for, verily, God Himself is the Provider of all sustenance, the Lord of all might, the Eternal!",
                            "verse 51:75": "And, verily, they who are bent on doing evil shall have their share [of evil] like unto the share of their fellows [of old]: so let them not ask Me to hasten [their doom]!",
                            "verse 51:76": "For woe unto those who are bent on denying the truth –",
                            "verse 51:77": "on the Day which they have been promised!",
                            "verse 51:78": "is he who is made to lie” – or, according to the Tāj al-‘Arūs, “he who is perverted in his reason and opinion,” i.",
                            "verse 51:79": "v."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 51:1": "Flee unto God.",
                            "verse 51:2": "",
                            "verse 51:3": "Be a remembrancer, for verily remembrancing profiteth the believers.",
                            "verse 51:4": "I did not create jinn and men except that they should worship Me.",
                            "verse 51:5": "Sources",
                            "verse 51:6": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 51:7": "The Book of Certainty (1952) •",
                            "verse 51:8": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 51:9": "What is Sufism (1975) •",
                            "verse 51:10": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 51:11": "Muhammad (1983) •",
                            "verse 51:12": "Symbol and Archetype (1991) •",
                            "verse 51:13": "Sufi Poems (2004) •",
                            "verse 51:14": "Mecca (2004) •",
                            "verse 51:15": "Return to the Spirit (2005) •",
                            "verse 51:16": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 51:17": "“Proofs of Islam”(1954).",
                            "verse 51:18": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 51:19": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 51:20": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 51:21": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 51:22": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 51:23": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 51:24": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 51:25": "“The Quranic Origins of Sufism” •",
                            "verse 51:26": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 51:27": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 51:28": "“An Introduction to Islam” •",
                            "verse 51:29": "“The Universality of the Quran” •",
                            "verse 51:30": "Private Talks Books",
                            "verse 51:31": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 51:1": "By those (winds) that scatter dust,",
                            "verse 51:2": "then those that bear load (of clouds),",
                            "verse 51:3": "then those that float with ease,",
                            "verse 51:4": "then those who distribute things,",
                            "verse 51:5": "whatever you are being promised is surely true,",
                            "verse 51:6": "and Recompense (of deeds) is sure to happen.",
                            "verse 51:7": "By the sky, having paths,",
                            "verse 51:8": "you are (involved) in a contradictory discussion.",
                            "verse 51:9": "Turned away from this (Qur’ān) is the one who is turned away (totally from the truth.",
                            "verse 51:10": "Death upon those who make conjectures (against the true faith),",
                            "verse 51:11": "- those who are drowned in ignorance, forgetful!",
                            "verse 51:12": "They ask, “When shall be the Day of Recompense?”",
                            "verse 51:13": "(It will be) the Day when they will be heated on the Fire,",
                            "verse 51:14": "(and it will be said to them,) “Taste (the punishment of) your mischief.",
                            "verse 51:15": "The God-fearing (on the other hand) will be in gardens and springs,",
                            "verse 51:16": "receiving what their Lord will have given to them.",
                            "verse 51:17": "They used to sleep little in the night;",
                            "verse 51:18": "and in the hours before dawn they used to pray for forgiveness,",
                            "verse 51:19": "and in their wealth, there was a right for one who asks and for one who is deprived.",
                            "verse 51:20": "In the earth, there are signs for those who (seek truth to) believe,",
                            "verse 51:21": "and in your own selves! So, do you not perceive?",
                            "verse 51:22": "And in the heavens, there is your sustenance and all that you have been promised.",
                            "verse 51:23": "So, by the Lord of the heavens and the earth, it (the Day of Recompense) is a reality, as sure as the fact that you (can) speak.",
                            "verse 51:24": "Has there come to you the story of the honoured guests of Ibrāhīm?",
                            "verse 51:25": "When they (the angels in human form) entered unto him and said, “We greet you with Salām .",
                            "verse 51:26": "Then he slipped off to his home and fetched a fattened calf.",
                            "verse 51:27": "So he presented it before them (to eat, but being angels, they refrained.",
                            "verse 51:28": "So he felt some fear in his heart.",
                            "verse 51:29": "So his wife came forward with a clamor, and slapped her own face and said, “(How can I have a child when I am) a barren old woman?”",
                            "verse 51:30": "They said, “This is how your Lord has said.",
                            "verse 51:31": "He (Ibrāhīm) said (to the angels), “Then, what is your mission O messengers?”",
                            "verse 51:32": "They said, “We are sent to a guilty people, (i.",
                            "verse 51:33": "so that we may send down upon them stones of clay,",
                            "verse 51:34": "marked by your Lord for the transgressors.",
                            "verse 51:35": "So, We let the believers who were there to come out (from danger),",
                            "verse 51:36": "but We did not find in it any Muslims, except one house.",
                            "verse 51:37": "And We left in this (event) a sign (of deterrence) for those who fear the painful punishment.",
                            "verse 51:38": "And (We left a similar sign) in (the story of) Mūsā, when We sent him to Fir‘aun (Pharaoh) with a clear proof.",
                            "verse 51:39": "So he turned away along with his chiefs and said, “ (Mūsā is) a magician or a madman!”",
                            "verse 51:40": "So We seized him and his army, and cast them into the sea, as he was of culpable behaviour.",
                            "verse 51:41": "And (a similar sign was left) in (the story of) ‘Ād, when We sent upon them the wind that was barren (from any benefit);",
                            "verse 51:42": "it spared nothing it came upon, but rendered it like a stuff smashed by decay.",
                            "verse 51:43": "And (a similar sign was left) in (the story of) Thamūd, when it was said to them, “Enjoy yourselves for a while.",
                            "verse 51:44": "Then they rebelled against the command of your Lord; so the thunderbolt (of divine punishment) seized them, while they were looking on.",
                            "verse 51:45": "Then they were neither able to stand (before the punishment), nor could they defend themselves.",
                            "verse 51:46": "And (We have destroyed) the people of NūH even before; indeed they were a sinful people.",
                            "verse 51:47": "And the sky was built by Us with might; and indeed We are the expanders.",
                            "verse 51:48": "And the earth was spread out by Us as a floor; so how well have We spread it out!",
                            "verse 51:49": "And from every thing We have created pairs of twos, so that you may heed.",
                            "verse 51:50": "So, flee to Allah.",
                            "verse 51:51": "And do not make up any other god along with Allah.",
                            "verse 51:52": "In similar way, no messenger came to those before them, but they said, “(He is) a magician or a madman.",
                            "verse 51:53": "Have they handed down (this saying) to each other as a legacy? Rather they are a rebellious people.",
                            "verse 51:54": "So, turn away from them, for you are not blamed.",
                            "verse 51:55": "And keep reminding, because reminding benefits the believers.",
                            "verse 51:56": "I did not create the Jinns and the human beings except for the purpose that they should worship Me.",
                            "verse 51:57": "I do not want any sustenance from them, nor do I want them to feed Me.",
                            "verse 51:58": "In fact, Allah is the All-Sustainer, Possessor of power, the Strong.",
                            "verse 51:59": "So, those who did wrong will have their turn like the turn of their counterparts.",
                            "verse 51:60": "Woe, then, to those who disbelieve because of the Day of theirs that they are promised (for punishment)."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 51:1": "By the scatterers that scatter",
                            "verse 51:2": "and those that bear a burden",
                            "verse 51:3": "and those that run with ease",
                            "verse 51:4": "and those that apportion by command,",
                            "verse 51:5": "assuredly what you are promised is true,",
                            "verse 51:6": "and assuredly judgement will take place!",
                            "verse 51:7": "And by the heaven with all its tracks,",
                            "verse 51:8": "indeed you are of differing opinions.",
                            "verse 51:9": "He is turned away therefrom who has deviated.",
                            "verse 51:10": "Perish the conjecturers,",
                            "verse 51:11": "who are in a stupor, heedless.",
                            "verse 51:12": "They ask: ‘When is the Day of Judgement?’",
                            "verse 51:13": "On the day when they will be tormented in the Fire:",
                            "verse 51:14": "‘Taste this torment of yours.",
                            "verse 51:15": "Truly the God-fearing will be amid gardens and springs,",
                            "verse 51:16": "receiving what their Lord has given them, for indeed formerly they had been virtuous.",
                            "verse 51:17": "Little of the night did they use to sleep,",
                            "verse 51:18": "and at dawns they used to seek forgiveness,",
                            "verse 51:19": "and there was a share in their wealth",
                            "verse 51:20": "for the beggar and the deprived.",
                            "verse 51:21": "And in the earth there are signs for those who know with certainty,",
                            "verse 51:22": "and in your souls.",
                            "verse 51:23": "And in the heaven is your provision, and [there is also] what you are promised.",
                            "verse 51:24": "So by the Lord of the heaven and the earth, it is as assuredly true as [the fact] that you have [power of] speech.",
                            "verse 51:25": "Has the story reached you of Abraham’s honoured guests?",
                            "verse 51:26": "When they entered upon him and said, ‘Peace!’ He said, ‘Peace!’ [These are] an unfamiliar folk.",
                            "verse 51:27": "Then he went aside to his family and brought a fat calf;",
                            "verse 51:28": "and he placed it near them saying, ‘Will you not eat?’",
                            "verse 51:29": "Then he conceived a fear of them.",
                            "verse 51:30": "Then his wife came forward clamouring and smote her face, and said, ‘A barren old woman!’",
                            "verse 51:31": "They said, ‘So has your Lord said.",
                            "verse 51:32": "He said, ‘So what is your business, O you who have been sent [by God]?’",
                            "verse 51:33": "They said, ‘Lo! we have been sent to a guilty folk",
                            "verse 51:34": "that we may unleash upon them stones of clay,",
                            "verse 51:35": "marked by your Lord for [the destruction of] the prodigal’.",
                            "verse 51:36": "So We brought forth those in them who were believers,",
                            "verse 51:37": "but We did not find therein other than one house of those who had submitted [to God].",
                            "verse 51:38": "And We left therein a sign for those who fear the painful chastisement.",
                            "verse 51:39": "And [a sign too] in Moses when We sent him to Pharaoh with a clear warrant,",
                            "verse 51:40": "but he turned away to his supports, saying, ‘A sorcerer, or a madman!’",
                            "verse 51:41": "So We seized him and his hosts and cast them into the waters, for he was blameworthy.",
                            "verse 51:42": "And",
                            "verse 51:43": "in ‘ād [was another sign], when We unleashed against them a barren wind.",
                            "verse 51:44": "It did not leave anything that it came upon without making it like decayed bones.",
                            "verse 51:45": "And",
                            "verse 51:46": "in Thamūd, when it was said to them, ‘Enjoy",
                            "verse 51:47": "for a while!’",
                            "verse 51:48": "Then they defied the command of their Lord; so the thunderbolt seized them as they were looking around.",
                            "verse 51:49": "So they were unable to rise up, nor were they victors.",
                            "verse 51:50": "And the people of Noah aforetime.",
                            "verse 51:51": "And the heaven, We built it with might, and indeed We are powerful.",
                            "verse 51:52": "And the earth, We spread it out: what excellent Spreaders then!",
                            "verse 51:53": "And of all things We created pairs that perhaps you might remember.",
                            "verse 51:54": "So flee unto God.",
                            "verse 51:55": "And do not set up another god alongside God.",
                            "verse 51:56": "Thus there did not come to those who were before them any messenger but they said: ‘A sorcerer, or a madman!’",
                            "verse 51:57": "Have they enjoined this upon one another? Nay, but they are an insolent folk.",
                            "verse 51:58": "So shun them, for you will not be reproached.",
                            "verse 51:59": "And remind for reminding truly benefits believers.",
                            "verse 51:60": "And I did not create the jinn and mankind except that they may worship Me.",
                            "verse 51:61": "I do not desire from them any provision, nor do I desire that they should feed Me.",
                            "verse 51:62": "Indeed it is God Who is the Provider, the Lord of Strength, the Firm.",
                            "verse 51:63": "And for those who have wronged, there will assuredly be a lot like the lot of their counterparts.",
                            "verse 51:64": "For woe to those who disbelieve, from that day of theirs which they are promised."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 51:1": "By the winds that blow and scatter,",
                            "verse 51:2": "And by the clouds that carry a heavy load (of water),",
                            "verse 51:3": "And by the vessels that float with elegance,",
                            "verse 51:4": "And by the angels that distribute work,",
                            "verse 51:5": "Surely the promise (of the Hereafter) being made to you is absolutely true.",
                            "verse 51:6": "And surely, the reward and the punishment (of actions) are bound to take place.",
                            "verse 51:7": "And by the heaven with its galaxies and orbits (of stars and planets),",
                            "verse 51:8": "Certainly you are (caught) in inconsistent statements.",
                            "verse 51:9": "He alone who is turned away (from the knowledge of pre-eternity) turns away (from the Holy Messenger [blessings and peace be upon him] and the Qur’an).",
                            "verse 51:10": "Ruined are those who tell lies out of assumption and conjecture,",
                            "verse 51:11": "Those who are oblivious (of the Hereafter) due to negligence and ignorance.",
                            "verse 51:12": "They ask: ‘When is the Day of Requital?’",
                            "verse 51:13": "(Say:) ‘The Day (when) they will be roasted in the Fire of Hell.",
                            "verse 51:14": "(It will be said to them:) ‘Relish your punishment.",
                            "verse 51:15": "Surely, the pious will be (rejoicing) in gardens and springs,",
                            "verse 51:16": "Receiving those blessings (in ecstatic delight) which their Lord will be giving them (with munificence and benevolence).",
                            "verse 51:17": "They used to sleep at night only for a short while,",
                            "verse 51:18": "And used to (get up and) seek forgiveness in the later part of the night.",
                            "verse 51:19": "And in their wealth was appointed a due share for the beggars and the destitute (i.",
                            "verse 51:20": "And there are many signs in the earth for the people with the truth of certitude (i.",
                            "verse 51:21": "And in your selves (as well).",
                            "verse 51:22": "And (also) there is sustenance for you in the heaven and (all that too) which you are promised.",
                            "verse 51:23": "So, by the Lord of heavens and the earth, this (promise of Ours) is true just as is your speech.",
                            "verse 51:24": "Has the news of the venerable guests of Ibrahim (Abraham) come to you?",
                            "verse 51:25": "When those (angels) came to him, they wished him peace.",
                            "verse 51:26": "Then he went to his home in haste and brought a healthy, roasted calf.",
                            "verse 51:27": "Then he presented it to them and said: ‘Will you not eat?’",
                            "verse 51:28": "Then he felt somewhat concerned about them (when they did not eat).",
                            "verse 51:29": "Then his wife (Sara) came with a voice laden with wonder and frustration, patted her forehead in astonishment and said: ‘(Will) an old and barren woman (give birth to a child)?’",
                            "verse 51:30": "The (angels) said: ‘It will happen exactly as your Lord has said; surely, He is Most Wise, All-Knowing.",
                            "verse 51:31": "Ibrahim (Abraham) said: ‘O deputed angels, what is your intent (for coming, apart from this good news)?’",
                            "verse 51:32": "They said: ‘We have been sent to the evildoing people (the people of Lut ),",
                            "verse 51:33": "So that we may rain on them THE the stones of baked clay,",
                            "verse 51:34": "(The stones) that have been marked from your Lord for those who transgress.",
                            "verse 51:35": "Then We moved everyone who was of the believers in it out (from the town of the people of Lut ).",
                            "verse 51:36": "So We did not find in that town (any house) of the Muslims except one (in which were the Prophet Lut",
                            "verse 51:37": "and his two daughters).",
                            "verse 51:38": "And We made in that (town) a sign to subsist (as a lesson of warning) for those who fear the grievous torment.",
                            "verse 51:39": "And (there are signs) in (the incident of) Musa (Moses) as well when We sent him to Pharaoh with clear proof.",
                            "verse 51:40": "He turned away along with his cabinet members and said: ‘(Here is) a magician or a madman.",
                            "verse 51:41": "Then We seized him and his army (with torment), and drowned them (all) in the river.",
                            "verse 51:42": "And there is (a sign) in (the destruction of) the people of ‘Ad too when We sent upon them a wind devoid of any good and blessing.",
                            "verse 51:43": "Whatever it passed over, it did not leave without turning it to dust.",
                            "verse 51:44": "And also there is (a sign of warning) in the (destruction of) the people of Thamud when they were told: ‘Take benefit for an appointed term.",
                            "verse 51:45": "But they disobeyed the command of their Lord.",
                            "verse 51:46": "Then they could neither gather strength to stand, nor take revenge (on Us).",
                            "verse 51:47": "And (We also destroyed) the people of Nuh (Noah) before this.",
                            "verse 51:48": "And We built the heavenly universe with great might.",
                            "verse 51:49": "And We alone made (the surface of the) earth a (livable) floor.",
                            "verse 51:50": "And of everything We have created two pairs so that you may concentrate and understand.",
                            "verse 51:51": "So run towards Allah.",
                            "verse 51:52": "And do not set up any god apart from Allah.",
                            "verse 51:53": "Likewise, no Messenger came to those before them, but they said the same: ‘(This is) a magician or a madman.",
                            "verse 51:54": "Were they transmitting this advice to one another? In truth, they were (all) a disobedient and rebellious people.",
                            "verse 51:55": "So turn away your kind and caring looks from them.",
                            "verse 51:56": "And keep giving direction and guidance, for direction and guidance surely benefits the believers.",
                            "verse 51:57": "And I created the jinn and human beings solely to adopt My servitude.",
                            "verse 51:58": "I do not ask for any sustenance (i.",
                            "verse 51:59": "Truly, Allah alone is the Sustainer of everyone, the Lord of Great Might, the Most Strong.",
                            "verse 51:60": "So there is a fixed share of the torment for these wrongdoers (too) like the share of the torment of their companions (who have passed before).",
                            "verse 51:61": "So a terrible destruction awaits the disbelievers on that Day of theirs which they have been promised."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "Katso niitä, jotka tuhlaavat hajalle viskoen,",
                            "verse 51:2": "niitä, jotka taakkaa kantavat,",
                            "verse 51:3": "niitä, joiden kulku on kevyttä,",
                            "verse 51:4": "niitä, jotka jakelevat määräyksiä.",
                            "verse 51:5": "Se, millä teitä uhataan, on totista totta,",
                            "verse 51:6": "ja tuomion täytyy totisesti tulla.",
                            "verse 51:7": "Katso taivasta, tähtiratainsa täyttämää.",
                            "verse 51:8": "Totisesti te riitelette puhuessanne toistenne kanssa.",
                            "verse 51:9": "Mutta vain se kääntyy uskosta pois, joka tahtoo kääntyä.",
                            "verse 51:10": "Kirotut olkoot valehtelijat,",
                            "verse 51:11": "jotka tietämättömyytensä kuilussa eivät mistään välitä.",
                            "verse 51:12": "He kysyvät: »Milloin tulee tuomion päivä?»",
                            "verse 51:13": "Se on päivä, jolloin heidät tulessa koetellaan.",
                            "verse 51:14": "Maistakaa nyt rangaistustanne.",
                            "verse 51:15": "Totisesti ovat ne, jotka pahaa karttavat, kerran puutarhoissa ja lähteitten partaalla",
                            "verse 51:16": "ottaen vastaan, mitä heidän Herransa heille antaa.",
                            "verse 51:17": "Vähän nukkuivat he yleensä yöllä,",
                            "verse 51:18": "ja aamulla he anoivat anteeksiantoa,",
                            "verse 51:19": "heidän omaisuudestaan riitti sopiva osa anojalle ja avuttomalle.",
                            "verse 51:20": "Maan päällä on tunnusmerkkejä niille, joilla on varmuus;",
                            "verse 51:21": "niin myöskin omissa sieluissanne.",
                            "verse 51:22": "Ja taivaassa on ravintonne sekä se, mikä teille on luvattu.",
                            "verse 51:23": "Taivaitten ja maan Herran nimessä.",
                            "verse 51:24": "Onko sinulle tullut sanoma Aabrahamin kunnioitetuista vieraista?",
                            "verse 51:25": "He astuivat sisään hänen luokseen ja sanoivat: »Rauha!» Ja hän vastasi: »Rauha, olette vieraita ihmisiä.",
                            "verse 51:26": "Ja hän hiipi salaa perheensä luokse ja palasi tuoden mukanaan juottovasikan,",
                            "verse 51:27": "jonka hän asetti heidän eteensä sanoen: »Ettekö tahdo syödä?»",
                            "verse 51:28": "Ja hän alkoi pelätä heitä, mutta he sanoivat: »Älä pelkää», ja he ilmoittivat hänelle ilosanoman viisaan pojan syntymästä.",
                            "verse 51:29": "Silloin tuli hänen vaimonsa paikalle suuren murheen vallassa, löi kasvoihinsa ja sanoi: »Vanha hedelmätön nainen.",
                            "verse 51:30": "He sanoivat: »Sanomamme on Herraltasi, Hänen on totisesti viisaus ja tieto».",
                            "verse 51:31": "Ja Aabraham sanoi: »Mikä on asianne, viestintuojat?»",
                            "verse 51:32": "He vastasivat: »Meidät on totisesti lähetetty syntisten ihmisten luo,",
                            "verse 51:33": "heittämään heidän päälleen tiilikiviä,",
                            "verse 51:34": "jotka Herrasi on varannut jumalattomille,",
                            "verse 51:35": "ja Me olemme erottanut heistä pois ne, jotka uskoivat,",
                            "verse 51:36": "Mutta Me emme löytänyt enempää kuin yhden Jumalalle alamaisen suvun.",
                            "verse 51:37": "Me jätimme merkin niitä varten, jotka pelkäävät tuskallista rangaistusta.",
                            "verse 51:38": "Kun lähetimme Mooseksen Faraon luo selvin valtuuksin,",
                            "verse 51:39": "niin tämä mahtavuudessaan käänsi hänelle selkänsä ja sanoi: »Noita tai hullu.",
                            "verse 51:40": "Me tartuimme häneen ja hänen sotajoukkoihinsa ja paiskasimme heidät mereen, koska hänen tekonsa oli rangaistava.",
                            "verse 51:41": "Ja Aadia vastaan Me päästimme tuhoavan tuulen,",
                            "verse 51:42": "joka ei sinne, missä puhalsi, jättänyt mitään jälkeensä, vaan muutti kaiken tuhaksi.",
                            "verse 51:43": "Ja Tamuudille sanottiin: »Nauttikaa hetkinen!»",
                            "verse 51:44": "Mutta he kapinoivat Herransa käskyä vastaan, ja niin iski heihin heidän nähtensä ukkonen.",
                            "verse 51:45": "Eivätkä he kyenneet nousemaan ylös eivätkä puolustautumaan.",
                            "verse 51:46": "Ja Nooan kansan tuhosimme jo aikaisemmin.",
                            "verse 51:47": "Ja taivaan olemme Me voimallamme kohottanut korkealle ja totisesti tehnyt sen laajaksi.",
                            "verse 51:48": "Maan olemme tehnyt suureksi ja avaraksi.",
                            "verse 51:49": "Kaikkea olemme luonut kaksittain, jotta ottaisitte vaarin.",
                            "verse 51:50": "Paetkaa Jumalan luo! Minä olen totisesti Jumalan lähettämä julkinen varoittajanne.",
                            "verse 51:51": "Älkää asettako Jumalan rinnalle muuta jumalaa.",
                            "verse 51:52": "Ei yksikään sananjulistaja ole tullut niiden luokse, jotka ennen heitä elivät, heidän sanomattansa: »Noita tai hullu.",
                            "verse 51:53": "Ovatko he antaneet tämän toisilleen perinnöksi? Totisesti, he ovat väärämielisiä ihmisiä.",
                            "verse 51:54": "Käänny siis pois heistä, niin ei tätä lueta sinulle viaksi.",
                            "verse 51:55": "Ja jatka kehoituksiasi, sillä totisesti muistutus koituu uskovien hyödyksi.",
                            "verse 51:56": "Olen luonut henkiolennot ja ihmiset vain palvelemaan Itseäni.",
                            "verse 51:57": "En halua heiltä mitään ravintoa enkä vaadi, että he ruokkisivat Minua.",
                            "verse 51:58": "Jumala on totisesti ravinnon jakaja, Herra, jonka on valta ja voima.",
                            "verse 51:59": "Niin on totisesti jumalattomilla oleva sama osa kuin heidän kaltaisillaan; heidän ei sentähden tarvitse pyytää Minua jouduttamaan asiaa.",
                            "verse 51:60": "Voi siis niitä, jotka eivät usko, sen päivän takia, joka heitä uhkaa."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 51:1": "Par ceux qui éparpillent !",
                            "verse 51:2": "Par ceux qui portent une charge !",
                            "verse 51:3": "Par ceux qui courent avec agilité !",
                            "verse 51:4": "Par ceux qui répartissent sur ordre !",
                            "verse 51:5": "Certes, ce qui vous est promis est véridique.",
                            "verse 51:6": "Certes, le Jugement est inéluctable.",
                            "verse 51:7": "Par le ciel rayé de nuées !",
                            "verse 51:8": "Vous tenez [sur la vérité] des discours divergents ;",
                            "verse 51:9": "de l'insensé on se détournera.",
                            "verse 51:10": "Que périssent les menteurs,",
                            "verse 51:11": "ceux qui sont plongés dans l'insouciance !",
                            "verse 51:12": "Ils demandent : \" A quand le Jour du Jugement ? \"",
                            "verse 51:13": "Le jour où ils seront éprouvés par le Feu [on leur dira] :",
                            "verse 51:14": "\" Goûtez votre épreuve que voici, celle dont vous vouliez hâter la venue ! \"",
                            "verse 51:15": "Ceux qui craignent Dieu séjourneront au milieu de jardins et de sources,",
                            "verse 51:16": "jouissant de ce que leur Seigneur leur donnera.",
                            "verse 51:17": "ils dormaient peu la nuit,",
                            "verse 51:18": "et dès l'aube ils imploraient le pardon de Dieu.",
                            "verse 51:19": "Une partie de leurs biens revenait de droit au mendiant et au banni.",
                            "verse 51:20": "Il y a sur la terre des signes pour ceux qui croient fermement,",
                            "verse 51:21": "et il y en a en vous-mêmes ; n'êtes-vous pas capables de voir ?",
                            "verse 51:22": "Et il y a dans le ciel ce qui assure votre subsistance et ce qui vous est promis.",
                            "verse 51:23": "Par le Seigneur du ciel et de la terre, c'est là une vérité, tout comme le fait que vous êtes doués de parole.",
                            "verse 51:24": "L'histoire des nobles hôtes d'Abraham ne t'est-elle pas parvenue ?",
                            "verse 51:25": "Entrant chez lui, ils dirent : \" Salut ! \" ; \" Salut ! \" répondit Abraham.",
                            "verse 51:26": "Puis il alla discrètement vers les siens et revint avec un veau gras.",
                            "verse 51:27": "Il le leur présenta en disant : \" Ne mangerez-vous pas ? \"",
                            "verse 51:28": "Il ressentait quelque crainte à leur égard.",
                            "verse 51:29": "Sa femme s'avança avec un gémissement ; elle se frappait le visage et disait : \" Une vieille femme stérile ?.",
                            "verse 51:30": "Ils dirent : \" Ton Seigneur a parlé ainsi ; Il est, en vérité, le Sage, l'Omniscient ! \"",
                            "verse 51:31": "Abraham dit : \" O vous les envoyés ! Quelle est donc votre mission ? \"",
                            "verse 51:32": "Ils dirent : \" Nous sommes envoyés vers un peuple criminel",
                            "verse 51:33": "pour lancer contre lui des pierres d'argile",
                            "verse 51:34": "marquées auprès de ton Seigneur à l'intention des pervers \".",
                            "verse 51:35": "Nous avons fait sortir de cette cité les croyants qui y demeuraient.",
                            "verse 51:36": "Nous n'y avons trouvé qu'une seule maison habitée par des gens soumis à Dieu.",
                            "verse 51:37": "Nous avons laissé là un signe pour ceux qui redoutent le châtiment douloureux,",
                            "verse 51:38": "comme Nous l'avons fait pour Moïse lorsque Nous l'avons envoyé à Pharaon avec un pouvoir évident",
                            "verse 51:39": "et que, sûr de sa puissance, Pharaon lui tourna le dos en disant : \" C'est un magicien ou un possédé ! \"",
                            "verse 51:40": "Nous les avons saisis, lui et ses armées, puis Nous les avons jetés dans l'abîme, le laissant se blâmer lui-même.",
                            "verse 51:41": "Il en fut ainsi pour les 'Ad lorsque Nous avons envoyé contre eux le vent dévastateur",
                            "verse 51:42": "qui ne laissait rien sur son passage sans l'avoir réduit en poussière.",
                            "verse 51:43": "Il en fut de même pour les Thamoud lorsqu'on leur dit : \" Jouissez jusqu'à un certain terme ! \"",
                            "verse 51:44": "Ils transgressèrent l'ordre de leur Seigneur et la foudre les surprit tandis qu'ils avaient les yeux ouverts.",
                            "verse 51:45": "Ils ne purent alors ni se lever ni se mettre à l'abri.",
                            "verse 51:46": "Il en fut de même auparavant pour le peuple de Noé : c'étaient des gens pervers.",
                            "verse 51:47": "Et le ciel ? Nous l'avons construit puissamment et Nous lui donnons son étendue.",
                            "verse 51:48": "Et la terre ? Nous l'avons déployée comme un tapis, et quelle perfection pour Celui qui l'a ainsi étendue !",
                            "verse 51:49": "De chaque chose Nous avons créé un couple.",
                            "verse 51:50": "Fuyez auprès de Dieu ! Certes, je suis pour vous, de Sa part, un avertisseur explicite.",
                            "verse 51:51": "Ne mettez pas une autre divinité à côté de Dieu ! Oui, je suis pour vous, de Sa part, un avertisseur explicite.",
                            "verse 51:52": "Il en est ainsi : aucun envoyé n'est venu à leurs prédécesseurs sans qu'ils aient dit : \" C'est un sorcier ou un possédé ! \"",
                            "verse 51:53": "Se seraient-ils légués cette façon d'agir ? A vrai dire c'est un peuple rebelle !",
                            "verse 51:54": "Détourne-toi d'eux, tu n'en seras pas blâmé.",
                            "verse 51:55": "Et lance le Rappel, car vraiment le Rappel est profitable aux croyants.",
                            "verse 51:56": "Je n'ai créé les djinns et les hommes que pour qu'ils M'adorent.",
                            "verse 51:57": "Je ne désire de leur part nulle offrande et Je ne désire pas qu'ils Me nourrissent.",
                            "verse 51:58": "C'est Dieu qui est le Dispensateur suprême, le Maître de la force, l'Invincible.",
                            "verse 51:59": "A ceux qui auront commis des iniquités, il sera infligé la même peine qu'à leurs comparses ; qu'ils ne cherchent donc pas à hâter le jugement.",
                            "verse 51:60": "Malheur aux mécréants, à cause du Jour dont ils sont menacés !"
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 51:1": "Par les vents qui éparpillent !",
                            "verse 51:2": "Par les porteurs de fardeaux !",
                            "verse 51:3": "Par les glisseurs agiles !",
                            "verse 51:4": "Par les distributeurs selon un commandement !",
                            "verse 51:5": "Ce qui vous est promis est certainement vrai.",
                            "verse 51:6": "Et la Rétribution arrivera inévitablement.",
                            "verse 51:7": "Par le ciel aux voies parfaitement tracées !",
                            "verse 51:8": "Vous divergez sur ce que vous dites .",
                            "verse 51:9": "Est détourné de lui quiconque a été détourné de la foi.",
                            "verse 51:10": "Maudits soient les menteurs,",
                            "verse 51:11": "qui sont plongés dans l’insouciance.",
                            "verse 51:12": "Ils demandent : «A quand le jour de la Rétribution ? »",
                            "verse 51:13": "Le jour où ils seront éprouvés au Feu :",
                            "verse 51:14": "«Goûtez à votre épreuve ;",
                            "verse 51:15": "voici ce que vous cherchiez à hâter».",
                            "verse 51:16": "Les pieux seront dans des Jardins et",
                            "verse 51:17": "des sources,",
                            "verse 51:18": "recevant ce que leur Seigneur leur aura donné.",
                            "verse 51:19": "ils dormaient peu, la nuit ,",
                            "verse 51:20": "et aux dernières heures de la nuit ils imploraient le pardon [de Dieu];",
                            "verse 51:21": "et dans leurs biens, il y avait un droit au mendiant et au déshérité.",
                            "verse 51:22": "Il y a sur terre des preuves pour ceux qui croient avec certitude;",
                            "verse 51:23": "ainsi qu’en vous-mêmes.",
                            "verse 51:24": "Et il y dans le ciel votre subsistance et ce qui vous a été promis.",
                            "verse 51:25": "Par le Seigneur du ciel et de la terre ! Ceci est tout aussi vrai que le fait que vous parliez.",
                            "verse 51:26": "T’est-il parvenu le récit des visiteurs honorables d’Abraham ?",
                            "verse 51:27": "Quand ils entrèrent chez lui et dirent : «Paix ! », il",
                            "verse 51:28": "dit : «Paix, visiteurs inconnus».",
                            "verse 51:29": "Puis il alla discrètement à sa famille et apporta un veau gras.",
                            "verse 51:30": "Ensuite il l’approcha d’eux.",
                            "verse 51:31": "Il ressentit alors de la peur vis-à-vis d’eux.",
                            "verse 51:32": "Alors sa femme s’avança en criant, se frappa le visage et dit : «Une vieille femme stérile.",
                            "verse 51:33": "Ils dirent : «Ainsi a dit ton Seigneur.",
                            "verse 51:34": "Alors",
                            "verse 51:35": "dit: «Quelle est donc votre mission, ô envoyés?»",
                            "verse 51:36": "Ils dirent : «Nous avons été envoyés vers des gens criminels,",
                            "verse 51:37": "pour lancer sur eux des pierres de glaise,",
                            "verse 51:38": "marquées auprès de ton Seigneur à l’intention des outranciers».",
                            "verse 51:39": "Nous en fîmes sortir alors ce qu’il y avait comme croyants,",
                            "verse 51:40": "mais Nous n’y trouvâmes qu’une seule maison de gens soumis.",
                            "verse 51:41": "Et Nous y laissâmes un signe pour ceux qui redoutent le douloureux châtiment ;",
                            "verse 51:42": "[Il y a même un signe]: en Moïse quand Nous l’envoyâmes, avec une preuve évidente, vers Pharaon.",
                            "verse 51:43": "Mais :",
                            "verse 51:44": "se détourna confiant en sa puissance, et dit : «C’est un magicien ou un possédé ! »",
                            "verse 51:45": "Nous le saisîmes ainsi que ses troupes, puis les jetâmes dans les flots, pour son comportement blâmable.",
                            "verse 51:46": "De même pour les Aad, quand Nous envoyâmes contre eux le vent dévastateur",
                            "verse 51:47": "n’épargnant rien sur son passage sans le réduire en poussière.",
                            "verse 51:48": "De même pour les Tamud, quand il leur fut dit : «Jouissez jusqu’à un certain temps ! »",
                            "verse 51:49": "Ils défièrent le commandement de leur Seigneur.",
                            "verse 51:50": "Ils ne purent ni se mettre debout ni être secourus.",
                            "verse 51:51": "De même, pour le peuple de Noé auparavant.",
                            "verse 51:52": "Le ciel, Nous l’avons construit par Notre puissance : et Nous l’étendons :",
                            "verse 51:53": "dans l’immensité.",
                            "verse 51:54": "Et la terre, Nous l’avons étendue.",
                            "verse 51:55": "Et de toute chose Nous avons créé [deux éléments]: de couple.",
                            "verse 51:56": "«Fuyez donc vers Dieu.",
                            "verse 51:57": "Ne placez pas avec Dieu une autre divinité.",
                            "verse 51:58": "Ainsi aucun Messager n’est venu à leurs prédécesseurs sans qu’ils n’aient dit : «C’est un magicien ou un possédé» !",
                            "verse 51:59": "est-ce qu’ils se sont transmis cette injonction ? Ils sont plutôt des gens transgresseurs.",
                            "verse 51:60": "Détourne-toi d’eux, tu ne seras pas blâmé [à leur sujet]: .",
                            "verse 51:61": "Et rappelle; car le rappel profite aux croyants.",
                            "verse 51:62": "Je n’ai créé les djinns et les hommes que pour qu’ils M’adorent.",
                            "verse 51:63": "Je ne cherche pas d’eux une subsistance; et Je ne veux pas qu’ils me nourrissent.",
                            "verse 51:64": "En vérité, c’est Dieu qui est le Grand Pourvoyeur, Le Détenteur de la force, l’Inébranlable.",
                            "verse 51:65": "Ceux qui ont été injustes auront une part [de tourments]: pareille à celle de leurs compagnons",
                            "verse 51:66": "Malheur donc à ceux qui ont mécru à cause du jour dont ils sont menacés ! compagnons"
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "Bei den (Winden), die (die Wolken) heftig wegwehen,",
                            "verse 51:2": "Dann die Last (des Regens) tragen,",
                            "verse 51:3": "Dann leicht dahinwehen,",
                            "verse 51:4": "Und schließlich den Befehl ausführen,",
                            "verse 51:5": "Wahrlich, was euch verheißen wird, ist wahr,",
                            "verse 51:6": "Und das Gericht wird ganz sicherlich eintreffen.",
                            "verse 51:7": "Bei dem Himmel voll von Pfaden,",
                            "verse 51:8": "Wahrlich, ihr seid in widerspruchsvolle Rede verwickelt.",
                            "verse 51:9": "Der allein wird von der (Wahrheit) abwendig gemacht, der abwendig gemacht werden sollte.",
                            "verse 51:10": "Verflucht seien die Erzeuger von Lügengespinsten,",
                            "verse 51:11": "Die achtlos sind in Unwissenheit.",
                            "verse 51:12": "Sie fragen: «Wann wird der Tag des Gerichtes sein?»",
                            "verse 51:13": "Es wird der Tag sein, an dem sie im Feuer gepeinigt werden.",
                            "verse 51:14": "«Kostet nun eure Pein.",
                            "verse 51:15": "Die Gerechten aber werden inmitten von Gärten und Quellen sein,",
                            "verse 51:16": "Empfangend, was ihr Herr ihnen geben wird, weil sie, vordem, Gutes zu tun pflegten.",
                            "verse 51:17": "Sie schliefen nur einen kleinen Teil der Nacht;",
                            "verse 51:18": "Und vor Tagesanbruch suchten sie stets Vergebung;",
                            "verse 51:19": "Und in ihrem Vermögen war ein Anteil für den, der bat, wie für den, der es nicht konnte.",
                            "verse 51:20": "Und auf Erden sind Zeichen für jene, die fest im Glauben sind,",
                            "verse 51:21": "Und in euch selber.",
                            "verse 51:22": "Und im Himmel ist eure Versorgung, und das, was euch verheißen wird.",
                            "verse 51:23": "Darum, bei dem Herrn des Himmels und der Erde, dies ist gewißlich wahr, eben wie (es wahr ist) daß ihr redet.",
                            "verse 51:24": "Ist die Geschichte von Abrahams geehrten Gästen nicht zu dir gedrungen?",
                            "verse 51:25": "Da sie bei ihm eintraten und sprachen: «Frieden!», sprach er: «Frieden!» (Es waren) alles fremde Leute.",
                            "verse 51:26": "Und er ging stillschweigend zu den Seinen und brachte ein gemästetes Kalb.",
                            "verse 51:27": "Und er setzte es ihnen vor.",
                            "verse 51:28": "Es erfaßte ihn Furcht vor ihnen.",
                            "verse 51:29": "Da kam seine Frau heran, scheu, und sie schlug ihr Angesicht und sprach: «Ein unfruchtbares altes Weib!»",
                            "verse 51:30": "Sie sprachen: «Das ist so, aber dein Herr hat's gesprochen.",
                            "verse 51:31": "(Abraham) sprach: «Wohlan, was ist euer Auftrag, ihr Boten?»",
                            "verse 51:32": "Sie sprachen: «Wir sind zu einem sündigen Volke entsandt worden,",
                            "verse 51:33": "Auf daß wir Steine von Ton auf sie niedersenden,",
                            "verse 51:34": "Bezeichnet von deinem Herrn für die Ruchlosen.",
                            "verse 51:35": "Und Wir ließen alle die Gläubigen, die dort waren, fortgehen,",
                            "verse 51:36": "Allein Wir fanden dort nur ein Haus von den Gottergebenen.",
                            "verse 51:37": "Und Wir hinterließen darin ein Zeichen für jene, die die qualvolle Strafe fürchten.",
                            "verse 51:38": "Und (ein weiteres Zeichen) in Moses, da Wir ihn zu Pharao sandten mit offenkundigem Beweis.",
                            "verse 51:39": "Da wandte er sich zu seiner Säule (Tempel) und sprach: «Ein Zauberer oder ein Wahnsinniger!»",
                            "verse 51:40": "So faßten Wir ihn und seine Heerscharen und warfen sie ins Meer; und er ist zu tadeln.",
                            "verse 51:41": "Und (ein Zeichen war) in den Àd, da Wir den verheerenden Wind wider sie sandten.",
                            "verse 51:42": "Er ließ nichts von allem, was er heimsuchte, zurück, ohne daß er es gleich einem vermoderten Knochen gemacht hätte.",
                            "verse 51:43": "Und (ein Zeichen war) in den Thamüd, da zu ihnen gesprochen ward: «Laßt es euch eine Weile gut gehn.",
                            "verse 51:44": "Doch sie trotzten dem Befehl ihres Herrn.",
                            "verse 51:45": "Und sie vermochten nicht (wieder) aufzustehn, noch fanden sie Hilfe.",
                            "verse 51:46": "Und vordem (vertilgten Wir) das Volk Noahs; denn sie waren ein widerspenstiges Volk.",
                            "verse 51:47": "Und den Himmel haben Wir erbaut mit (Unseren) Kräften, und Unsere Kräfte sind wahrlich gewaltig.",
                            "verse 51:48": "Und die Erde haben Wir ausgebreitet, und wie schön breiten Wir aus!",
                            "verse 51:49": "Und von jeglichem Ding haben Wir Paare erschaffen, auf daß ihr euch vielleicht doch besinnen möchtet.",
                            "verse 51:50": "Fliehet darum zu Allah.",
                            "verse 51:51": "Und setzet nicht einen andern Gott neben Allah.",
                            "verse 51:52": "So auch kam zu denen vor ihnen kein Gesandter, ohne daß sie gesprochen hätten: «Ein Zauberer oder ein Wahnsinniger!»",
                            "verse 51:53": "Haben sie es etwa einander vermacht? Sie sind vielmehr (alle) ein widerspenstiges Volk.",
                            "verse 51:54": "So kehre dich ab von ihnen; und dich soll kein Tadel treffen.",
                            "verse 51:55": "Doch fahre fort, zu ermahnen, denn Ermahnung nützt denen, die glauben mögen.",
                            "verse 51:56": "Und Ich habe die Dschinn und die Menschen nur darum erschaffen, daß sie Mir dienen.",
                            "verse 51:57": "Ich wünsche keine Versorgung von ihnen, noch wünsche Ich, daß sie Mich speisen.",
                            "verse 51:58": "Allah allein ist der große Versorger, der Allmächtige, der Starke.",
                            "verse 51:59": "Und für jene, die Unrecht tun, ist ein Los wie das Los ihrer Gefährten; möchten sie Mich darum nicht bitten (die Strafe) zu beschleunigen.",
                            "verse 51:60": "Wehe also denen, die ungläubig sind, ihres Tages wegen, der ihnen angedroht ist! beschleunigen."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "mu ¼gokvksa dh d+le½ tks ¼cknyksa dks½ mM+k dj frrj fcrj dj nsrh gSa",
                            "verse 51:2": "fQj ¼ikuh dk½ cks> mBkrh gSa",
                            "verse 51:3": "fQj vkfgLrk vkfgLrk pyrh gSa",
                            "verse 51:4": "fQj ,d t+:jh pht+ ¼ckfj’k½ dks rd+lhe djrh gSa",
                            "verse 51:5": "fd rqe ls tks ok;nk fd;k tkrk gS t+:j fcYdqy lPpk gS",
                            "verse 51:6": "vkSj ¼vkeky dh½ tt+k ¼lt+k½ t+:j gksxh",
                            "verse 51:7": "vkSj vkleku dh d+le ftlesa jgrs gSa",
                            "verse 51:8": "fd ¼,s ,gys eDdk½ rqe yksx ,d ,slh eq[+rfyQ+ cstksM+ ckr esa iM+s gks",
                            "verse 51:9": "fd mlls ogh Qsjk tk,xk ¼xqejkg gksxk½",
                            "verse 51:10": "tks ¼[+kqnk ds bYe esa½ Qsjk tk pqdk gS vVdy nkSM+kus okys gykd gksa",
                            "verse 51:11": "tks x+Qyr esa Hkwys gq, ¼iM+s½ gSa iwNrs gSa fd tt+k dk fnu dc gksxk",
                            "verse 51:12": "ml fnu ¼gksxk½",
                            "verse 51:13": "tc budks ¼tgUuqe dh½ vkx esa vt+kc fn;k tk,xk",
                            "verse 51:14": "¼vkSj muls dgk tk,xk½ vius vt+kc dk et+k p[kks ;s ogh gS ftldh rqe tYnh epk;k djrs Fks",
                            "verse 51:15": "cs’kd ijgst+xkj yksx ¼csfg’r ds½ ckx+ksa vkSj p’eksa esa ¼,s’k djrs½ gksxsa",
                            "verse 51:16": "tks mudk ijojfnxkj mUgsa vrk djrk gS ;s ¼[+kq’k [+kq’k½ ys jgs gSa ;s yksx blls igys ¼nqfu;k esa½ usdks dkj Fks",
                            "verse 51:17": "¼bcknr dh otg ls½ jkr dks cgqr gh de lksrs Fks",
                            "verse 51:18": "vkSj fiNys igj dks viuh ex+fQ+jr dh nqvk,a djrs Fks",
                            "verse 51:19": "vkSj muds eky esa ek¡xus okys vkSj u ek¡xus okys ¼nksuksa½ dk fgLlk Fkk",
                            "verse 51:20": "vkSj ;d+hu djus okyksa ds fy, t+ehu esa ¼d+qnjrs [+kqnk dh½ cgqr lh fu’kkfu;k¡ gSa",
                            "verse 51:21": "vkSj [+kqnk rqe esa Hkh gSa rks D;k rqe ns[krs ugha",
                            "verse 51:22": "vkSj rqEgkjh jkst+h vkSj ftl pht+ dk rqels ok;nk fd;k tkrk gS vkleku esa gS",
                            "verse 51:23": "rks vkleku o t+ehu ds ekfyd dh d+le ;s ¼d+qjku½ fcYdqy Bhd gS ftl rjg rqe ckrsa djrs gks",
                            "verse 51:24": "D;k rqEgkjs ikl bcjkghe ds eqvft+t+ esgekuks ¼Q+fj’rksa½ dh Hkh [+kcj igq¡ph gS fd tc og yksx muds ikl vk,",
                            "verse 51:25": "rks dgus yxs ¼lykequ vySdqe½ rks bcjkghe us Hkh ¼vySdqe½ lyke fd;k ¼ns[kk rks½ ,sls yksx ftuls u tku u igpku",
                            "verse 51:26": "fQj vius ?kj tkdj tYnh ls ¼Hkquk gqvk½ ,d eksVk rkt+k cNM+k ys vk,",
                            "verse 51:27": "vkSj mls muds vkxs j[k fn;k ¼fQj½ dgus yxs vki yksx rukmy D;ksa ugha djrs",
                            "verse 51:28": "¼bl ij Hkh u [kk;k½ rks bcjkghe muls tks gh th esa Mjs og yksx cksys vki vUns’kk u djsa vkSj mudks ,d nkfu’keUn yM+ds dh [+kq’k[+kcjh nh",
                            "verse 51:29": "rks ¼;s lqurs gh½ bcjkghe dh choh ¼lkjk½ fpYykrh gq;h muds lkeus vk;ha vkSj viuk eq¡g ihV fy;k dgus yxha ¼,s gS½ ,d rks ¼eSa½ cqf<+;k ¼ml ij½ cka>",
                            "verse 51:30": "yM+dk D;ksa dj gksxk Q+fj’rs cksys rqEgkjs ijojfnxkj us ;w¡ gh Qjek;k gS og cs’kd fgder okyk okfd+Q+dkj gS",
                            "verse 51:31": "rc bcjkghe us iwNk fd ¼,s [+kqnk ds½ Hksts gq, Qfj’rksa vkf[+kj rqEgsa D;k eqfge nj is’k gS",
                            "verse 51:32": "og cksys ge rks xqukgxkjksa ¼d+kSes ywr½ dh rjQ Hksts x, gSa",
                            "verse 51:33": "rkfd mu ij feVVh ds iFkjhys [kjUts cjlk,¡",
                            "verse 51:34": "ftu ij gn ls c<+ tkus okyksa ds fy, rqEgkjs ijojfnxkj dh rjQ ls fu’kku yxk fn, x, gSa",
                            "verse 51:35": "x+jt+ ogk¡ ftrus yksx eksfeuhu Fks mudks geus fudky fn;k",
                            "verse 51:36": "vkSj ogk¡ rks geus ,d ds flok eqlyekuksa dk dksbZ ?kj ik;k Hkh ugha",
                            "verse 51:37": "vkSj tks yksx nnZukd vt+kc ls Mjrs gSa muds fy, ogk¡ ¼bcjr dh½ fu’kkuh NksM+ nh vkSj ewlk ¼ds gky½ esa Hkh ¼fu’kkuh gS½",
                            "verse 51:38": "tc geus mudks fQjvkÅu ds ikl [kqyk gqvk ekSftt+k nsdj Hkstk",
                            "verse 51:39": "rks mlus vius y’kdj ds fcjrs ij eq¡g eksM+ fy;k vkSj dgus yxk ;s rks ¼vPNk [+kklk½ tknwxj ;k lkSnkbZ gS",
                            "verse 51:40": "rks geus mldks vkSj mlds y’kdj dks ys Mkyk fQj mu lcdks nfj;k esa iVd fn;k",
                            "verse 51:41": "vkSj og rks d+kfcys eyker dke djrk gh Fkk vkSj vkn dh d+kSe ¼ds gky½ esa Hkh fu’kkuh gS geus mu ij ,d cs cjdr vk¡/kh pyk;h",
                            "verse 51:42": "fd ftl pht+ ij pyrh mldks ckslhnk gMMh dh rjg jst+k jst+k fd, cx+Sj u NksM+rh",
                            "verse 51:43": "vkSj lewn ¼ds gky½ esa Hkh ¼d+qnjr dh fu’kkuh½ gS tc mlls dgk x;k fd ,d [+kkl oD+r rd [+kwc pSu dj yks",
                            "verse 51:44": "rks mUgksus vius ijojfnxkj ds gqDe ls ljd’kh dh rks mUgsa ,d jkst+ dM+d vkSj fctyh us ys Mkyk vkSj ns[krs gh jg x,",
                            "verse 51:45": "fQj u og mBus dh rkd+r j[krs Fks vkSj u cnyk gh ys ldrs Fks",
                            "verse 51:46": "vkSj ¼muls½ igys ¼ge½ uwg dh d+kSe dks ¼gykd dj pqds Fks½ cs’kd og cndkj yksx Fks",
                            "verse 51:47": "vkSj geus vklekuksa dks vius cy cwrs ls cuk;k vkSj cs’kd geesa lc d+qnjr gS",
                            "verse 51:48": "vkSj t+ehu dks Hkh ge gh us fcNk;k rks ge dSls vPNs fcNkus okys gSa",
                            "verse 51:49": "vkSj ge gh us gj pht+ dh nks nks fd+Lesa cuk;ha rkfd rqe yksx ulhgr gkfly djks",
                            "verse 51:50": "rks [+kqnk gh dh rjQ+ Hkkxks eSa rqedks ;d+huu mldh rjQ ls [kqYye [kqYyk Mjkus okyk gw¡",
                            "verse 51:51": "vkSj [+kqnk ds lkFk nwljk ekcwn u cukvks eSa rqedks ;d+huu mldh rjQ ls [kqYye [kqYyk Mjkus okyk gw¡",
                            "verse 51:52": "blh rjg muls igys yksxksa ds ikl tks iSx+Ecj vkrk rks og mldks tknwxj dgrs ;k flM+h nhokuk ¼crkrs½",
                            "verse 51:53": ";s yksx ,d nwljs dks ,slh ckr dh olh;r djrs vkrs gSa ¼ugha½ cfYd ;s yksx gSa gh ljd’k",
                            "verse 51:54": "rks ¼,s jlwy½ rqe buls eq¡g Qsj yks rqe ij rks dqN bYt+ke ugha gS",
                            "verse 51:55": "vkSj ulhgr fd, tkvks D;ksafd ulhgr eksfeuhu dks Qk;nk nsrh gS",
                            "verse 51:56": "vkSj eSus ftuksa vkSj vknfe;ksa dks blh x+jt+ ls iSnk fd;k fd og esjh bcknr djsa",
                            "verse 51:57": "u rks eSa muls jkst+h dk rkfyc gw¡ vkSj u ;s pkgrk gw¡ fd eq>s [kkuk f[kyk,¡",
                            "verse 51:58": "[+kqnk [+kqn cM+k jkst+h nsus okyk t+ksjkoj ¼vkSj½ t+cjnLr gS",
                            "verse 51:59": "rks ¼bu½ t+kfyeksa ds okLrs Hkh vt+kc dk dqN fgLlk gS ftl rjg muds lkfFk;ksa ds fy, fgLlk Fkk rks budks ge ls tYnh u djuh pkfg,",
                            "verse 51:60": "rks ftl fnu dk bu dkfQ+jksa ls ok;nk fd;k tkrk gS blls buds fy, [+kjkch gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "Demi (angin) yang menerbangkan debu dengan sekuat-kuatnya,",
                            "verse 51:2": "dan awan yang mengandung hujan,",
                            "verse 51:3": "dan kapal-kapal yang berlayar dengan mudah,",
                            "verse 51:4": "dan (malaikat-malaikat) yang membagi-bagi urusan,",
                            "verse 51:5": "sesungguhnya apa yang dijanjikan kepadamu pasti benar,",
                            "verse 51:6": "dan sesungguhnya (hari) pembalasan pasti terjadi.",
                            "verse 51:7": "Demi langit yang mempunyai jalan-jalan,",
                            "verse 51:8": "sesungguhnya kamu benar-benar dalam keadaan berbeda-beda pendapat,",
                            "verse 51:9": "dipalingkan daripadanya (Rasul dan Al Qur'an) orang yang dipalingkan.",
                            "verse 51:10": "Terkutuklah orang-orang yang banyak berdusta,",
                            "verse 51:11": "(yaitu) orang-orang yang terbenam dalam kebodohan lagi lalai,",
                            "verse 51:12": "mereka bertanya: \"Bilakah hari pembalasan itu?\"",
                            "verse 51:13": "(Hari pembalasan itu ialah) pada hari ketika mereka diazab di atas api neraka.",
                            "verse 51:14": "(Dikatakan kepada mereka): \"Rasakanlah azabmu itu.",
                            "verse 51:15": "Sesungguhnya orang-orang yang bertakwa berada di dalam taman-taman (surga) dan di mata air-mata air,",
                            "verse 51:16": "sambil mengambil apa yang diberikan kepada mereka oleh Tuhan mereka.",
                            "verse 51:17": "Mereka sedikit sekali tidur di waktu malam;",
                            "verse 51:18": "Dan di akhir-akhir malam mereka memohon ampun (kepada Allah).",
                            "verse 51:19": "Dan pada harta-harta mereka ada hak untuk orang miskin yang meminta dan orang miskin yang tidak mendapat bahagian.",
                            "verse 51:20": "Dan di bumi itu terdapat tanda-tanda (kekuasaan Allah) bagi orang-orang yang yakin,",
                            "verse 51:21": "dan (juga) pada dirimu sendiri.",
                            "verse 51:22": "Dan di langit terdapat (sebab-sebab) rezkimu dan terdapat (pula) apa yang dijanjikan kepadamu.",
                            "verse 51:23": "Maka demi Tuhan langit dan bumi, sesungguhnya yang dijanjikan itu adalah benar-benar (akan terjadi) seperti perkataan yang kamu ucapkan.",
                            "verse 51:24": "Sudahkah sampai kepadamu (Muhammad) cerita tamu Ibrahim (malaikat-malaikat) yang dimuliakan?",
                            "verse 51:25": "(Ingatlah) ketika mereka masuk ke tempatnya lalu mengucapkan: \"Salaaman\", Ibrahim menjawab: \"Salaamun\" (kamu) adalah orang-orang yang tidak dikenal.",
                            "verse 51:26": "Maka dia pergi dengan diam-diam menemui keluarganya, kemudian dibawanya daging anak sapi gemuk (yang dibakar),",
                            "verse 51:27": "lalu dihidangkannya kepada mereka.",
                            "verse 51:28": "(Tetapi mereka tidak mau makan), karena itu Ibrahim merasa takut terhadap mereka.",
                            "verse 51:29": "Kemudian istrinya datang memekik (tercengang) lalu menepuk mukanya sendiri seraya berkata: \"(Aku adalah) seorang perempuan tua yang mandul\".",
                            "verse 51:30": "Mereka berkata: \"Demikianlah Tuhanmu memfirmankan\".",
                            "verse 51:31": "Ibrahim bertanya: \"Apakah urusanmu hai para utusan?\"",
                            "verse 51:32": "Mereka menjawab: \"Sesungguhnya kami diutus kepada kaum yang berdosa (kaum Lut),",
                            "verse 51:33": "agar kami timpakan kepada mereka batu-batu dari tanah yang (keras),",
                            "verse 51:34": "yang ditandai di sisi Tuhanmu untuk (membinasakan) orang-orang yang melampaui batas\".",
                            "verse 51:35": "Lalu Kami keluarkan orang-orang yang beriman yang berada di negeri kaum Lut itu.",
                            "verse 51:36": "Dan Kami tidak mendapati di negeri itu, kecuali sebuah rumah dari orang-orang yang berserah diri.",
                            "verse 51:37": "Dan Kami tinggalkan pada negeri itu suatu tanda bagi orang-orang yang takut kepada siksa yang pedih.",
                            "verse 51:38": "Dan juga pada Musa (terdapat tanda-tanda kekuasaan Allah) ketika Kami mengutusnya kepada Firaun dengan membawa mukjizat yang nyata.",
                            "verse 51:39": "Maka dia (Fir’aun) berpaling (dari iman) bersama tentaranya, dan berkata: \"Dia adalah seorang tukang sihir atau seorang gila\".",
                            "verse 51:40": "Maka Kami siksa dia dan tentaranya lalu Kami lemparkan mereka ke dalam laut, sedang dia melakukan pekerjaan yang tercela.",
                            "verse 51:41": "Dan juga pada (kisah) ’Aad ketika Kami kirimkan kepada mereka angin yang membinasakan,",
                            "verse 51:42": "angin itu tidak membiarkan suatu pun yang dilandanya, melainkan dijadikannya seperti serbuk.",
                            "verse 51:43": "Dan pada (kisah) kaum Tsamud ketika dikatakan kepada mereka, \"Bersenang-senanglah kamu sampai suatu waktu\".",
                            "verse 51:44": "Maka mereka berlaku angkuh terhadap perintah Tuhannya, lalu mereka disambar petir sedang mereka melihatnya.",
                            "verse 51:45": "Maka mereka sekali-kali tidak dapat bangun dan tidak pula mendapat pertolongan,",
                            "verse 51:46": "dan (Kami membinasakan) kaum Nuh sebelum itu.",
                            "verse 51:47": "Dan langit itu Kami bangun dengan kekuasaan (Kami) dan sesungguhnya Kami benar-benar meluaskannya.",
                            "verse 51:48": "Dan bumi itu Kami hamparkan; maka sebaik-baik yang menghamparkan (adalah Kami).",
                            "verse 51:49": "Dan segala sesuatu Kami ciptakan berpasang-pasangan supaya kamu mengingat akan kebesaran Allah.",
                            "verse 51:50": "Maka segeralah kembali kepada (menta’ati) Allah.",
                            "verse 51:51": "Dan janganlah kamu mengadakan tuhan yang lain di samping Allah.",
                            "verse 51:52": "Demikianlah tidak seorang rasulpun yang datang kepada orang-orang yang sebelum mereka, melainkan mereka mengatakan: \"Ia adalah seorang tukang sihir atau orang gila\"",
                            "verse 51:53": "Apakah mereka saling berpesan tentang apa yang dikatakan itu.",
                            "verse 51:54": "Maka berpalinglah kamu dari mereka, dan kamu sekali-kali tidak tercela.",
                            "verse 51:55": "Dan tetaplah memberi peringatan, karena sesungguhnya peringatan itu bermanfaat bagi orang-orang yang beriman.",
                            "verse 51:56": "Dan Aku tidak menciptakan jin dan manusia melainkan supaya mereka menyembah-Ku.",
                            "verse 51:57": "Aku tidak menghendaki rezeki sedikit pun dari mereka dan Aku tidak menghendaki supaya mereka memberi Aku makan.",
                            "verse 51:58": "Sesungguhnya Allah Dialah Maha Pemberi rezeki Yang Mempunyai Kekuatan lagi Sangat Kokoh.",
                            "verse 51:59": "Maka sesungguhnya untuk orang-orang lalim ada bahagian (siksa) seperti bahagian teman-teman mereka (dahulu); maka janganlah mereka meminta kepada-Ku menyegerakannya.",
                            "verse 51:60": "Maka kecelakaanlah bagi orang-orang yang kafir pada hari yang diancamkan kepada mereka."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "Per i venti che spargono,",
                            "verse 51:2": "per quelle che portano un carico ,",
                            "verse 51:3": "per quelle che scivolano leggere ,",
                            "verse 51:4": "per quelli che trasmettono l'ordine .",
                            "verse 51:5": "Quello che vi è stato promesso è vero,",
                            "verse 51:6": "e il Giudizio avverrà inevitabilmente.",
                            "verse 51:7": "Per il cielo solcato di percorsi ,",
                            "verse 51:8": "invero avete opinioni contrastanti ,",
                            "verse 51:9": "è maldisposto chi è maldisposto .",
                            "verse 51:10": "Maledetti i blasfemi",
                            "verse 51:11": "che nell'abisso dimenticano .",
                            "verse 51:12": "Chiedono: « A quando il Giorno del Giudizio? ».",
                            "verse 51:13": "Il Giorno in cui saranno messi alla prova del Fuoco",
                            "verse 51:14": "[sarà detto loro]: « Gustate la vostra prova! Ecco quello che volevate affrettare!».",
                            "verse 51:15": "I timorati staranno tra i giardini e le fonti,",
                            "verse 51:16": "prendendo ciò che il Signore darà loro, poiché in passato facevano il bene,",
                            "verse 51:17": "dormivano poco di notte,",
                            "verse 51:18": "e all'alba imploravano il perdono;",
                            "verse 51:19": "e nei loro beni c'era un diritto per il mendicante e il diseredato .",
                            "verse 51:20": "Sulla terra ci sono segni per coloro che credono fermamente,",
                            "verse 51:21": "e anche in voi stessi.",
                            "verse 51:22": "Nel cielo c'è la vostra sussistenza e anche ciò che vi è stato promesso .",
                            "verse 51:23": "Per il Signore del cielo e della terra: tutto questo è vero come è vero che parlate.",
                            "verse 51:24": "Ti è giunta la storia degli ospiti onorati di Abramo ?",
                            "verse 51:25": "Quando entrarono da lui dicendo: « Pace», egli rispose: «Pace, o sconosciuti ».",
                            "verse 51:26": "Poi andò discretamente dai suoi e tornò con un vitello grasso ,",
                            "verse 51:27": "e l'offrì loro.",
                            "verse 51:28": "« Non mangiate nulla?».",
                            "verse 51:29": "Ebbe allora paura di loro.",
                            "verse 51:30": "Venne dunque sua moglie gridando, colpendosi il volto e dicendo: « Sono una vecchia sterile! ».",
                            "verse 51:31": "Dissero: «Così ha comandato il tuo Signore.",
                            "verse 51:32": "Disse :",
                            "verse 51:33": "« O inviati, qual è la vostra missione?».",
                            "verse 51:34": "Risposero: « Siamo stati inviati a un popolo di pervertiti,",
                            "verse 51:35": "per lanciare su di loro pietre d'argilla",
                            "verse 51:36": "contrassegnate presso il tuo Signore, per coloro che eccedono».",
                            "verse 51:37": "Ne facemmo uscire i credenti",
                            "verse 51:38": "e non vi trovammo che una casa di sottomessi .",
                            "verse 51:39": "Colà lasciammo un segno per coloro che temono il castigo doloroso;",
                            "verse 51:40": "come in Mosè, quando lo inviammo a Faraone con autorità incontestabile,",
                            "verse 51:41": "ma volse le spalle insieme coi suoi.",
                            "verse 51:42": "Afferrammo lui e le sue truppe e li gettammo nei flutti, per il suo comportamento biasimevole .",
                            "verse 51:43": "E [ci fu segno] negli 'Âd, quando inviammo contro di loro il vento devastante",
                            "verse 51:44": "che nulla lasciava sul suo percorso senza ridurlo in polvere.",
                            "verse 51:45": "E [ci fu segno] nei Thamûd, quando fu detto loro: «Godete per un periodo».",
                            "verse 51:46": "Trasgredirono l'ordine del loro Signore.",
                            "verse 51:47": "e non poterono restare in piedi né essere soccorsi.",
                            "verse 51:48": "Già",
                            "verse 51:49": "il popolo di Noè: erano gente malvagia.",
                            "verse 51:50": "Il cielo lo abbiamo costruito con la Nostra potenza e",
                            "verse 51:51": "lo estendiamo nell'immensità;",
                            "verse 51:52": "la terra l'abbiamo distesa ,e quanto bene la distendemmo !",
                            "verse 51:53": "Di ogni cosa creammo una coppia, affinché possiate riflettere.",
                            "verse 51:54": "«Accorrete allora verso Allah! In verità io sono per voi un ammonitore esplicito da parte Sua.",
                            "verse 51:55": "Non associate altra divinità ad Allah.",
                            "verse 51:56": "Non mai giunse un messaggero a quelli che li precedettero senza che gli dicessero: « Sei uno stregone, un pazzo! ».",
                            "verse 51:57": "E' questo quel che si sono tramandati ? E' davvero gente ribelle.",
                            "verse 51:58": "Volgi loro le spalle: non sarai biasimato ;",
                            "verse 51:59": "e ricorda, ché il ricordo giova ai credenti .",
                            "verse 51:60": "E' solo perché Mi adorassero che ho creato i dèmoni gli uomini .",
                            "verse 51:61": "Non chiedo loro nessun sostentamento e non chiedo che Mi nutrano.",
                            "verse 51:62": "In verità Allah è il Sostentatore, il Detentore della forza, l'Irremovibile.",
                            "verse 51:63": "Coloro che saranno stati ingiusti avranno la stessa sorte che toccò ai loro simili: non cerchino quindi di affrettarla.",
                            "verse 51:64": "Guai a coloro che non credono, per via del Giorno di cui sono stati minacciati."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "広く撤き散らす（風）にかけて，",
                            "verse 51:2": "重く（雨を）運ぶ（雲）にかけて，",
                            "verse 51:3": "安々と走る（船）にかけて，",
                            "verse 51:4": "御命を奉じて配付を司るものにかけて（誓う）。",
                            "verse 51:5": "あなたがたに約束されたことは，真実で，",
                            "verse 51:6": "本当に審判は，必ず下る。",
                            "verse 51:7": "おびただしい軌道をもつ天にかけて（誓う）。",
                            "verse 51:8": "本当にあなたがたは，信条がまちまちで，",
                            "verse 51:9": "これ（復活の信仰）から背く者は，（真実から）背き去る者である。",
                            "verse 51:10": "臆測者は処罰されよう。",
                            "verse 51:11": "混乱の洪水の中でぼんやりしている者，",
                            "verse 51:12": "かれらは，「審判の日は何時のことですか。」と問う。",
                            "verse 51:13": "（それは）かれらが，火獄で試みられる日。",
                            "verse 51:14": "（言ってやるがいい。）「あなたがたの責め苦を味わえ。これこそあなたがたが，催促していたものである。」",
                            "verse 51:15": "だが主を畏れ（敬虔であっ）た者は，楽園と泉に（住み），",
                            "verse 51:16": "主がかれらに授けられる物を授かる。本当にかれらは，以前善行に動しんでいた。",
                            "verse 51:17": "かれらは，夜間でも少しだけ眠り，",
                            "verse 51:18": "また黎明には，御赦しを祈っていた。",
                            "verse 51:19": "またかれらの財産には，乞う者や，乞うこともできない困窮者たちの権利があると認識していた。",
                            "verse 51:20": "地上には信心深い者たちへの種々の印があり，",
                            "verse 51:21": "またあなたがた自身の中にもある。それでもあなたがたは見ようとしないのか。",
                            "verse 51:22": "天には，あなたがたへの糧と，あなたがたに約束されたものがある。",
                            "verse 51:23": "それで天と地の主にかけて（誓う）。本当にそれは真実である。丁度あなたがたが話すことが（事実で）あるように。",
                            "verse 51:24": "あなたがたは，イブラーヒームの尊い賓客たちの物語を聞いたのか。",
                            "verse 51:25": "かれらはかれ（イブラーヒーム）の家に入って，「平安あれ。」と言った時，かれも「平安あれ。見知らぬ方々よ。」と答えた。",
                            "verse 51:26": "それでかれはそっと家族のところに引き返し，肥えた仔牛（の焼肉）を持って出て，",
                            "verse 51:27": "それをかれらの前に置いた。（だが手を付けないので）かれは言った。「あなたがたは，召し上りませんか。」",
                            "verse 51:28": "かれは，かれら（賓客）が薄気味悪くなり，心配になった。かれらは「恐れるには及びません。」と言い，やがて，かれに賢い息子が授かるであろうという吉報を伝えた。",
                            "verse 51:29": "するとかれの妻は声をあげて進み出て，額を打って，「わたしは老婆で，石女ですのに。」と言った。",
                            "verse 51:30": "かれらは言った。「あなたの主がこう仰せられたのです。本当にかれは英明にして全知であられます。」",
                            "verse 51:31": "かれは言った。「それで，あなたがたの御用件は何ですか，使徒の方がたよ。」",
                            "verse 51:32": "かれらは，「わたしたちは罪深い民に遣わされたのです。",
                            "verse 51:33": "泥の磔を（雨のように）かれらの上に降らすために。",
                            "verse 51:34": "放埓を尽す者にたいして，主の御許で印された（泥の磔を降らそう）。」と言った。",
                            "verse 51:35": "それから，われはそこにいた信者たちを立ちのかせようとした。",
                            "verse 51:36": "しかし，その（町の）中で見出したムスリムの家は，只の一軒だけであった。",
                            "verse 51:37": "われは痛ましい懲罰を，恐れる者のために一つの印としてそこに残した。",
                            "verse 51:38": "またムーサーにも（印があった）。われが明らかな権威を授けて，かれをフィルアウンに遣わした時を思い起せ。",
                            "verse 51:39": "かれ（フィルアウン）はその権勢を傘に，背を向け，「こいつは魔術師か，それとも気違いだ。」と言った。",
                            "verse 51:40": "それであれは，かれとその軍勢を捕えて海に投げ込んだ。本当にかれは，けしからぬ者であった。",
                            "verse 51:41": "またアードにも（印があった）。われが惨害を(西?)す風をかれらに送った時を思い起せ。",
                            "verse 51:42": "それはかれらを襲って，凡てを壊滅し廃墟のようにして，何も残さなかった。",
                            "verse 51:43": "またサムードにも（印があった）。「束の間（のあなたがたの生）を楽しめ。」と言われた時を思い起しなさい。",
                            "verse 51:44": "その時かれらは，主の命令に横柄に背いたので，あれよと見ているまに雷に襲われた。",
                            "verse 51:45": "最早かれらは起き上ることも出来ず，また守ることも出来なかった。",
                            "verse 51:46": "以前にも，ヌーフの民を（われは滅ぼした）。本当にかれらは反逆の民であった。",
                            "verse 51:47": "われは偉力をもって天を打ち建て，果しない広がりにした。",
                            "verse 51:48": "またわれは大地を打ち広げた。何と見事に広げたことよ。",
                            "verse 51:49": "またわれは，凡てのものを両性に創った。あなたがたは訓戒を受け入れるであろう（という配慮から）。",
                            "verse 51:50": "「それであなたがたは，アッラーの庇護の下に赴け。本当にわたしはかれからあなたがたに遣わされた公明な警告者である。",
                            "verse 51:51": "それでアッラーと一緒に外の神を立ててはならない。本当にわたしは，かれからあなたがたに遣わされた公明な警告者である」。",
                            "verse 51:52": "同様にかれら以前の者も，使徒がかれらにやって来る度に，「魔術師か，または気違いだ。」と言った。",
                            "verse 51:53": "かれらはそれを遺訓として継承して来たのか。いや，かれらは法外の民である。",
                            "verse 51:54": "それで，かれらを避けて去れ。あなたがたは（かれらの行いに対して）咎めはないのである。",
                            "verse 51:55": "だが訓戒しなさい。訓戒は信者たちを益する。",
                            "verse 51:56": "ジンと人間を創ったのはわれに仕えさせるため。",
                            "verse 51:57": "われはかれらにどんな糧も求めず，また扶養されることも求めない。",
                            "verse 51:58": "本当にアッラーこそは，糧を授けられる御方，堅固なる偉力の主であられる。",
                            "verse 51:59": "悪行の徒の授かり分（罰）は，かれらの仲間の授かり分（罰）と同じであろう。だからそう（われを）急き立てなくてもいい。",
                            "verse 51:60": "信仰しない者に災いあれ。約束の日がかれらに必ずやって来る。 悪行の徒の授かり分（罰）は，かれらの仲間の授かり分（罰）と同じであろう。だからそう（われを）急き立てなくてもいい。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "분산케 하는 바람으로 맹세하며",
                            "verse 51:2": "무거운 것을 운반하는 구름으 로 맹세하며",
                            "verse 51:3": "순항하는 배로써 맹세하며",
                            "verse 51:4": "하나님의 명령에 따라 축복을분배하여 주는 천사로써 맹세하 노니",
                            "verse 51:5": "실로 너희에게 약속된 것은 진실이라",
                            "verse 51:6": "심판이 곧 오리라",
                            "verse 51:7": "완전한 궤도를 가진 하늘로 맹세하나니",
                            "verse 51:8": "실로 너희는 일치하지 않는 논쟁을 일삼는 자들이라",
                            "verse 51:9": "진실로부터 멀어져 현혹된 자 마찬가지로 유흑되노라",
                            "verse 51:10": "거짓하는 자들 위에 저주가 있으리니",
                            "verse 51:11": "그들은 혼란의 홍수 속에서 무관심했던 자들로",
                            "verse 51:12": "심판의 날이 언제 오느뇨 라고 물으매",
                            "verse 51:13": "그들이 불지옥에 들어가 태 워지는 날이라",
                            "verse 51:14": "이 벌을 맛보라 너희가 서둘 러 재촉했던 것이라",
                            "verse 51:15": "그러나 의로운 자들은 샘이 있는 천국에서 거주하며",
                            "verse 51:16": "주님께서 부여한 은혜속에서 기뻐하나니 이는 그들이 의롭게 살았기 때문이라",
                            "verse 51:17": "그들은 밤에도 많은 잠을 자 지 아니하고",
                            "verse 51:18": "이른 새벽부터",
                            "verse 51:19": "그가 가진 재산중에서 필요 로 한 자와 요구하지 못한 자에게 일정한 몫을 베푸는 자라",
                            "verse 51:20": "대지 위에는 믿음이 확고한 자들을 위한 예증들이 있으며",
                            "verse 51:21": "너희 마음속에도 있거늘 너 희는 알지 못하느뇨",
                            "verse 51:22": "하늘에는 너희가 일용할 양 식이 있으며 또한 너희에게 약속 된 것도 있노라",
                            "verse 51:23": "하늘과 대지의 주님으로 맹 세하사 이것은 너희가 서로에게 말하고 있는 것처럼 진리라",
                            "verse 51:24": "아브라함의 존경받는 손님의얘기가 그대에게 이르렀느뇨",
                            "verse 51:25": "그들이 그에게 평안하소서 라고 인사하니 그도 평안하소서라고 알지 못한 그들에게 인사하더 라",
                            "verse 51:26": "그때는 재빨리 그의 집안으 로 들어가 살찐 송아지 한마리를 가져와",
                            "verse 51:27": "그것을 그들 앞에 놓으면서 드시지 않겠습니까 라고 말하였더라",
                            "verse 51:28": "그들이 먹지 아니하자 그는 그들을 두려워 하였노라 이때 그 들이 두려워 하지 말라고 말하며 그에게 총명한 아들이 있을 것이 라는 기쁜 소식을 전하였더라",
                            "verse 51:29": "이때 크게 웃으며 그의 아내가 다가와 그녀의 이마를 때리며 늙고 불임의 여성이 애를 갖는단 말이요 라고 말하매",
                            "verse 51:30": "그들은 주님께서 그렇게 말 씀이 있었으니 실로 그분은 지혜 와 아심으로 충만하심이라 대답하였더라",
                            "verse 51:31": "그가 사자들이여 당신들 의 용무는 무엇입니까 물으니",
                            "verse 51:32": "그들이 말하길 우리는 죄악 에 빠진 백성에게 보내어져",
                            "verse 51:33": "그들 위에 찰흙의 돌을 빗발처럼 보내니",
                            "verse 51:34": "그것은 죄지은 자들에게 주 님의 표시가 쩍혀 보내진 것이라 하더라",
                            "verse 51:35": "그때 하나님은 그곳에 있었던 믿음을 가진 신도들을 구하노라",
                            "verse 51:36": "그러나 하나님은 한 가정 외에는 어떤 무슬림도 발견치 못하여",
                            "verse 51:37": "무서운 징벌을 두려워 하는 그들을 위해 그곳에 예증을 남겨 두었노라",
                            "verse 51:38": "모세의 이야기 속에도 예증 이 있나니 보라 하나님은 그에게 명백한 권능을 주어 파라오에게 보냈노라",
                            "verse 51:39": "그러나 그는 그의 군대와 더불어 외면하며 그는 마술사인가 아니면 미친 자인가 라고 말하였 더라",
                            "verse 51:40": "그리하여 하나님은 그와 그 리고 그의 군대를 포획하여 바다 속에 던졌으매 그에 대한 비난은 당연했더라",
                            "verse 51:41": "아드의 백성 속에서도 예증 이 있나니 보라 하나님이 그들에 게 파멸의 바람을 보냈으니",
                            "verse 51:42": "바람이 불었던 곳에는 아무것도 남겨진 것없이 재처럼 파괴 되어 버렸더라",
                            "verse 51:43": "사무드 백성 속에서도 예증 이 있었으니 보라 잠시동안 향락 하고자 하였으되",
                            "verse 51:44": "그들은 주님의 명령을 거역 하였으매 지켜보던 징벌의 광음이그들을 멸망케 하였더라",
                            "verse 51:45": "그들은 일어설 수도 없었고 스스로를 보호할 수도 없었노라",
                            "verse 51:46": "그들 이전의 노아의 백성도 그랬으니 그들도 사악한 백성들이었노라",
                            "verse 51:47": "하나님께서 하늘을 두사 권 능과 능력으로 높이 두고 넓게 두셨으며",
                            "verse 51:48": "대지를 두되 넓게 펼쳤으너 얼마나 아름답게 펼쳐 졌느뇨",
                            "verse 51:49": "하나님이 모든 것을 창조하 시되 자웅을 두었으니 이로 하여 너희가 교훈을 얻도록 함이라",
                            "verse 51:50": "그러므로 서둘러 하나님께로오라 실로 나는 그분께서 너희에 게 보낸 분명한 선지자라",
                            "verse 51:51": "하나님과 더불어 다른 것을 숭배하지 말라 실로 내가 그분으 로부터 너희에게 온 분명한 선지 자라",
                            "verse 51:52": "그들 이전에도 선지자가 백성들에게 왔으되 그들 또한 그는 마 술사요 아니면 미친자라 말했더라",
                            "verse 51:53": "그들이 서로에게 상속한 유 산이라도 된단 말인가 실로 그들 은 오만한 백성들이라",
                            "verse 51:54": "그러므로 그들을 멀리하라 그리하면 문책받지 않을 것이라",
                            "verse 51:55": "그러나 그대의 메세지를 가르치라 믿는 신도들에게 유익하니라",
                            "verse 51:56": "내가 영마와 인간을 창조함은그들이 나를 섬기게 하려 함이라",
                            "verse 51:57": "내가 그들에게 일용할 양식 을 구하지 아니하며 또한 나를 부 양하길 바라지도 않노라",
                            "verse 51:58": "실로 하나님은 권능과 힘의 주님으로서 일용할 양식을 베푸는 수여자이시라",
                            "verse 51:59": "죄지은 무리는 그들 동료의 무리와 유사한 벌을 받노라 그러 므로 나에게 서둘러 구하지 않도 록 하라",
                            "verse 51:60": "그들이 약속받은 그날을 믿지 아니한 자들에게 재앙이 있으리라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "سوێند به‌و ڕه‌شه‌با و ئه‌و بایه‌ی که‌هه‌ورو هه‌ڵمی ئاو هه‌ڵده‌گرێت و په‌خشی ده‌کاته‌وه‌، یان ته‌پ و تۆز به‌رز ده‌کاته‌وه (که‌ڕۆڵی هه‌یه له‌باران بارایندا).",
                            "verse 51:2": "ئینجا به‌هه‌ڵگرانی باری قورس و گران (له‌هه‌ڵمی ئاو).",
                            "verse 51:3": "هه‌روه‌ها به‌و هه‌ورانه‌ک ه‌به‌ئاسانی به‌ئاسماندا له‌شوێنێکوه ده‌گوێزرێته‌وه بۆ شوێنێکی تر، یاخود سوێند به‌و که‌شتیانه‌ی به‌ئاسانی به‌سه‌ر ئاودا دێن و ده‌چن.",
                            "verse 51:4": "ئینجا سوێند به‌و فریشتانه‌ی که‌کاروبار دابه‌ش ده‌که‌ن.",
                            "verse 51:5": "به‌ڕاستی ئه‌و به‌ڵێنانه‌ی پێتان دراوه‌ڕاسته‌و هه‌ر دێته دی.",
                            "verse 51:6": "بێگومان ڕۆژی لێ پرسینه‌وه‌ش هه‌ر دێت و به‌ڕێوه‌یه.",
                            "verse 51:7": "سوێند به‌ئاسمانی خاوه‌ن ڕێگه‌و ڕێک و پێک و ڕازاوه‌.",
                            "verse 51:8": "بێگومان ئه‌ی خوانه‌ناسان ئێوه له‌گوفتارێکی بێ سه‌روبندان که‌دووره له‌ڕاستی و حه‌قیقه‌ته‌وه.",
                            "verse 51:9": "ئه‌و که‌سه‌ی له‌زانستی خوادا لادراو ه‌به‌هۆی تاوانیه‌وه له‌باوه‌ڕ هێنان لاده‌درێت.",
                            "verse 51:10": "ده‌ک به‌کوشتچن درۆزن و بوختانچیه‌کان.",
                            "verse 51:11": "ئه‌وانه‌ی که‌له‌گومڕای و تاریکیدا ڕۆچوون و پێوه‌ی سه‌رگه‌رمن.",
                            "verse 51:12": "به‌گاڵته و ته‌ڵفیسیه‌وه ده‌ڵێن یان ده‌پرسن: ڕۆژی قیامه‌ت که‌ی پێش دێت؟!",
                            "verse 51:13": "ئه‌و ڕۆژه که‌به‌رپا ده‌بێت به‌ئاگر ده‌برژێنرێن.",
                            "verse 51:14": "پێیان ده‌وترێت: بچێژن ئه‌و به‌ڵایه‌ی که‌به‌سه‌ر خۆتان هێنا، ئه‌مه‌ئه‌و سزاو ئازاره‌یه که‌به‌گاڵته‌وه په‌له‌تان له‌پێشهاتنی ده‌کرد.",
                            "verse 51:15": "به‌ڕاستی پارێزکارانیش له‌باخه‌کان و کانیاوه‌کانی به‌هه‌شتدا ژیانی خۆش ده‌به‌نه‌سه‌ر.",
                            "verse 51:16": "ئه‌و شتانه‌ی که‌په‌روه‌ردگار بۆی ئاماده‌کردون پێیان ده‌به‌خشێت، ئه‌وانه‌یش به‌خۆشی و شادیه‌وه وه‌ریده‌گرن، به‌ڕاستی ئه‌وانه‌پێشتر و شادیه‌وه وه‌ریده‌گرن، به‌ڕاستی ئه‌وانه پێشتر له‌دنیاداچاکه‌کارو چاکه‌خواز بوون.",
                            "verse 51:17": "له‌شه‌وگاردا زۆر که‌م ده‌خه‌وتن و ڕاده‌کشان (چونکه‌سه‌رگه‌رمی شه‌و نوێژ و ده‌ور کردنه‌وه‌ی قورئان و یادی خوا بوون).",
                            "verse 51:18": "له‌به‌ره‌به‌یانه‌کانیشدا داوای لێخۆشبوونیان له‌په‌روه‌ردگاریان ده‌کرد (تا لێیان ببورێت).",
                            "verse 51:19": "له‌ماڵ و سامانیشیاندا به‌شی هه‌ژارو نه‌داریان ته‌رخان کردبوو.",
                            "verse 51:20": "بێگومان له‌سه‌ر گۆی زه‌ویدا به‌ڵگه و نیشانه‌ی زۆر هه‌یه (له‌سه‌ر ده‌سه‌ڵات و زانیاری خوا) بۆ که‌سانێک که‌به‌شوێن دڵنیاییدا ده‌گه‌ڕێن.",
                            "verse 51:21": "هه‌روه‌ها له‌خودی خۆشتاندا (له‌هه‌موو خانه‌یه‌کی له‌شدا، له‌هه‌موو ئه‌ندامێکداو، له‌هه‌موو کۆئه‌ندامێکدا، له‌رۆح ونه‌فس و عه‌قڵدا.",
                            "verse 51:22": "سه‌رچاوه‌ی ڕزق و ڕۆزیتان له‌ئاسمانه‌وه‌یه (له‌خوا داوابکه‌ن) هه‌روه‌ها ئه‌وانیش که‌به‌ڵێنتان پێدراوه.",
                            "verse 51:23": "سوێند به‌په‌روه‌ردگاری ئاسمان و زه‌وی، ئه‌و به‌ڵێنانه حه‌قیقه‌ت و ڕاسته‌قینه‌یه‌، هه‌روه‌ک چۆن ئێوه قسه‌ی ڕاست و دروست ده‌که‌ن.",
                            "verse 51:24": "ئه‌ی پێغه‌مبه‌ر (صلى الله عليه وسلم) ئایا هه‌واڵی میوانه به‌ڕێزه‌کانی ئیبراهیمت پێنه‌گه‌یشتووه؟",
                            "verse 51:25": "کاتێک چوون بۆ سه‌ردانی و وتیان: سڵاو، ئه‌ویش وتی، سڵاو له‌ئێوه‌ش بێت، هه‌رچه‌نده‌ناتانناسم.",
                            "verse 51:26": "ئه‌وسا ئیتر خۆی دزیه‌وه چوو به‌هاوکاری خێزانی گوێره‌که‌یه‌کی قه‌ڵه‌وی (سه‌ری بڕی و سووریانکرده‌وه و) هێنای.",
                            "verse 51:27": "بردی و لێی نزیک کردنه‌وه‌،، فه‌رمووی لێکردن که‌بینی ناخۆن، وتی: ئه‌وه‌نا فه‌رموون، ئه‌وه‌ناخۆن؟!",
                            "verse 51:28": "ئیبراهیم ترسێکی لێنیشت (چونکه‌وای زانی شتێکیان له‌ژێر سه‌ردایه‌) بۆیه خچرا وتیان: مه‌ترسه‌ئێمه فریشته‌یه‌، مژده‌شیان پێده‌به‌خشێت.",
                            "verse 51:29": "خێزانه‌که‌ی قریوه‌یه‌کی کرد و ده‌نگی لێ به‌رز بۆوه و ده‌ستی به‌ئاسته‌م دا به‌روومه‌تی خۆیدا (وه‌کو داب و نـریتی ئافره‌تان له‌کاتی سه‌رسامیدا) وتی: پیریژنێکی نه‌زۆک، چۆن منداڵی ده‌بێت؟!",
                            "verse 51:30": "فریشته‌کان وتیان: ئه‌وه‌فه‌رمانی په‌روه‌ردگارته‌و ئه‌و زاتێکی دانا و زانایه.",
                            "verse 51:31": "ئینجا ئیبراهیم لێی، پرسین: بێجگه له‌و مژده‌یه چ کارێکی گرنگتان به‌ده‌سته‌وه‌یه؟!",
                            "verse 51:32": "فریشته‌کان وتیان: بڕاستی ئێمه ڕه‌وانه‌کراوین بۆ گه‌لێکی تاوانبار و تاوانکار.",
                            "verse 51:33": "بۆ ئه‌وه‌ی به‌رد بارانیان بکه‌ین به‌به‌ردێک که‌له‌قوڕ دروست کراوه‌.",
                            "verse 51:34": "هه‌موو ئه‌و به‌ردانه‌نیشانه‌دارن له‌لایه‌ن په‌روه‌ردگارته‌وه‌بۆ ناپوخت و له‌سنوور درچووه‌کان.",
                            "verse 51:35": "جا هه‌رچی له‌و ناوچه‌یه‌دا بوو له‌ئیمانداران ده‌رمانکردن و ڕزگارمان کردن.",
                            "verse 51:36": "له‌ماڵه موسوڵمانێکیش زیاترمان به‌دی نه‌کرد.",
                            "verse 51:37": "(له‌پاشان ئه‌و شوێنه‌مان به‌شێوه‌یه‌ک کاول کرد)، کردمانه‌په‌ند و به‌ڵگه بۆ هه‌موو ئه‌و که‌سانه‌ی له‌سزای به‌ئێشی ئێمه ده‌ترسن.",
                            "verse 51:38": "له‌به‌سه‌رهاتی موسایشدا په‌ند و ئامۆژگاری هه‌یه که‌ناردمان بۆ لای فیرعه‌ون به‌موعجزه‌یه‌کی ئاشکراو ڕوونه‌وه‌.",
                            "verse 51:39": "ئه‌ویش پشتی هه‌لکرد به‌هۆی سه‌ربازو دارو ده‌سته‌که‌یه‌وه‌و وتی (ئه‌م فرستاده‌یه‌) جادووگه‌ره‌، یان شێته!!",
                            "verse 51:40": "جا ئێمه‌ش خۆی و سه‌ربازه‌کانیمان گرفتار کرد و پێچاماننه‌وه و فڕێمان دانه‌ده‌ریاوه‌، له‌کاتێکدا ئه‌و لۆمه‌کراوه.",
                            "verse 51:41": "هه‌روه‌ها له‌به‌سه‌رهاتی عادیش‌دا په‌ند و ئامۆژگاری هه‌یه‌، کاتێک له‌سه‌ره‌نجامی سه‌رکه‌شیان بایه‌کی بێ خێرمان هه‌ڵکرده سه‌ریان.",
                            "verse 51:42": "ئه‌و بایه هه‌ر شوێنێک و هه‌ر شتێک و هه‌ر که‌سێکدا بڕۆیشتایه وازی لێ نه‌ده‌هێنا هه‌تا بێ که‌ڵکی ده‌کرد و وه‌ک شتێکی فڕێ دراوی لێ ده‌کرد.",
                            "verse 51:43": "هه‌روه‌ها له‌به‌سه‌رهاتی پمودیشدا په‌ند و ئامۆژگاری هه‌یه‌، کاتێک پێیان وترا: تا ماوه‌یه‌ک ڕابوێرن!!",
                            "verse 51:44": "ئه‌وانیش له‌فه‌رمانی په‌روه‌ردگاریان یاخی بوون، کتوپڕ بروسکه‌یه‌ک پێچانیه‌وه وبه‌چاوی ئه‌بڵه‌قه‌وه ده‌یانروانی.",
                            "verse 51:45": "ئیتر نه‌یانتوانی هه‌ڵسنه‌وه و سه‌رکه‌وتووش نه‌بوون.",
                            "verse 51:46": "پێشتریش هۆزی نوح به‌ڕاستی هه‌ر تاوانبارو خوانه‌ناس ولارو وێربوون (ئه‌وانیشمان به‌زریانه‌که له‌ناوبرد).",
                            "verse 51:47": "ئێمه ئاسمانمان به‌ده‌ستی قودره‌تی خۆمان دروست کرد، به‌رده‌وامیش گه‌وره‌ی ده‌که‌ین و فراوانی ده‌که‌ین.",
                            "verse 51:48": "زه‌ویشمان ڕاخستووه (ژیانمان له‌سه‌ری ئاسان کردووه‌) به‌ڕاستی خوا زاتێکی کارساز و کاربه‌جێیه.",
                            "verse 51:49": ": له‌هه‌موو شتێک ئێمه جووتمان دروست کردوه (له‌جیهانی ئاده‌میزاد و گیاندار و ڕوه‌ک و بێ گیاندا، له‌هه‌موو شتێکی ماددی و مه‌عنه‌ویدا) بۆ ئه‌وه‌ی بیربکه‌نه‌وه و یاده‌وه‌ری وه‌ربگرن.",
                            "verse 51:50": "به‌په‌له‌و گورج و گۆڵ بن بۆ به‌ده‌ست هێنانی ڕه‌زامه‌ندی خوا، بۆ هه‌رچی په‌روه‌ردگار پێی خۆشه‌، دڵنیاش بن که‌من (واته‌پێغه‌مبه‌ر (صلى الله عليه وسلم) له‌لایه‌ن خواوه‌ترسێنه‌رێکی ئاشکرام ئه‌گه‌ر یاخی و سه‌رکه‌ش بن.",
                            "verse 51:51": "هیچ مه‌که‌ن به‌هاوه‌ڵ و هاوتای خوا، چونکه من به‌ڕاستی نێردراوێکی ترسێنه‌ری ئاشکرام بۆتان له‌لایه‌ن خواوه‌.",
                            "verse 51:52": "هه‌ر نا به‌و شێوه‌یه هیچ پێغه‌مبه‌رێک له‌پێش ئه‌ماندا نه‌هاتووه‌، خوانه‌ناسان نه‌یانوتبێت جادووگه‌ره‌، یان شێته.",
                            "verse 51:53": "سه‌یره! ئایا ده‌ڵێی به‌گوێی یه‌کدا خوێدویانه و یه‌کتریان ڕاسپاردووه‌، نه‌خێر، به‌ڵکو ئه‌وانه‌هه‌ر قه‌ومێکی سته‌مکارو سه‌رکه‌شن.",
                            "verse 51:54": "تۆ ئه‌ی محمد (صلى الله عليه وسلم) گوێیان مه‌ده‌رێ چونکه تۆ لۆمه‌کراو نابیت (له‌سه‌ر باوه‌ڕ نه‌هێنانیان).",
                            "verse 51:55": "به‌ڵکو تۆ هه‌میشه ئامۆژگاریان بکه‌، چونکه‌به‌ڕاستی ئامۆژگاری سوود به‌ئیمانداران ده‌گه‌یه‌نێت.",
                            "verse 51:56": "بێگومان من په‌ری و ئاده‌میزاد م دروست نه‌کردووه‌ته‌نها بۆ ئه‌وه‌نه‌بێت که‌من بپه‌رستن و فه‌رمانبه‌ردارم بن.",
                            "verse 51:57": "نه‌رۆزیم لێیان ده‌وێت نه‌خواردن و خواردنه‌وه‌.",
                            "verse 51:58": "چونکه‌به‌ڕاستی هه‌ر خوا خۆی ڕۆزی به‌خشه‌و خاوه‌نی هێزو ده‌سه‌ڵاتی پته‌وه‌.",
                            "verse 51:59": "بێگومان بۆ ئه‌وانه‌ی سته‌میان کردووه‌تۆڵه‌و سزای زۆرمان بۆ ئاماده‌کردوون، هه‌روه‌ک چۆن بۆ هاوه‌ڵ و هاوبیره‌کانیان ئاماده‌مانکردووه‌، ده‌با ئیتر په‌له‌م لێنه‌که‌ن (چونکه‌به‌م زوانه‌یه‌خه‌یان ده‌گرێت).",
                            "verse 51:60": "ئینجا وه‌یل و ئاهو ناڵه بۆ ئه‌وانه‌ی که‌رێبازی کوفرو خوانه‌ناسیان گرتۆته‌به‌ر له‌و ڕۆژه‌ی که‌هه‌ڕه‌شه‌یان لێ کراوه‌و به‌م زووانه‌پێش دێت."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "Demi angin yang menerbang dan menaburkan (debu, biji-bijian benih dan lain-lainnya), dengan penerbangan dan penaburan yang sesungguh-sungguhnya;",
                            "verse 51:2": "Dan awan yang membawa dan mengangkut muatannya (ke tempat yang dikehendaki);",
                            "verse 51:3": "Dan kapal-kapal yang belayar laju dengan kemudahan yang diberikan kepadanya;",
                            "verse 51:4": "Dan malaikat-malaikat yang membahagi-bahagikan segala perkara yang mereka ditugaskan membahagikannya;",
                            "verse 51:5": "(Sumpah demi sumpah) bahawa sesungguhnya segala yang dijanjikan kepada kamu (mengenai hari akhirat) tetap benar;",
                            "verse 51:6": "Dan bahawa sesungguhnya balasan amal, tetap berlaku.",
                            "verse 51:7": "Demi langit yang mempunyai jalan-jalan yang berbagai bentuk keadaannya,",
                            "verse 51:8": "Sesungguhnya kamu berada dalam keadaan berlainan pendapat (mengenai agama yang dibawa oleh Nabi Muhammad s.",
                            "verse 51:9": "Dipalingkan daripada (perselisihan) itu orang-orang yang telah dipalingkan Allah (dengan sebab keikhlasannya mencari kebenaran).",
                            "verse 51:10": "Binasalah orang-orang yang sentiasa mengeluarkan pendapat dengan cara agak-agak sahaja,",
                            "verse 51:11": "(Iaitu) orang-orang yang tenggelam alam kejahilan, serta lalaikan (hari pembalasan).",
                            "verse 51:12": "Mereka bertanya (secara mengejek): Bilakah datangnya hari pembalasan itu?",
                            "verse 51:13": "(Jawabnya: Hari itu ialah) hari mereka diseksa (dengan dibakar) atas api Neraka, -",
                            "verse 51:14": "(Sambil dikatakan kepada mereka): Rasalah azab seksa yang disediakan untuk kamu; inilah dia yang dahulu kamu minta disegerakan kedatangannya.",
                            "verse 51:15": "Sesungguhnya orang-orang yang bertakwa adalah ditempatkan di dalam beberapa taman Syurga, dengan mata air-mata air terpancar padanya.",
                            "verse 51:16": "(Keadaan mereka di sana) sentiasa menerima nikmat dan rahmat yang diberikan kepadanya oleh Tuhan mereka.",
                            "verse 51:17": "Mereka sentiasa mengambil sedikit sahaja: Masa dari waktu malam, untuk mereka tidur.",
                            "verse 51:18": "Dan pada waktu akhir malam (sebelum fajar) pula, mereka selalu beristighfar kepada Allah (memohon ampun).",
                            "verse 51:19": "Dan pada harta-harta mereka, (ada pula bahagian yang mereka tentukan menjadi) hak untuk orang miskin yang meminta dan orang miskin yang menahan diri (daripada meminta).",
                            "verse 51:20": "Dan pada bumi ada tanda-tanda (yang membuktikan keesaan dan kekuasaan Allah) bagi orang-orang (yang mahu mencapai pengetahuan) yang yakin,",
                            "verse 51:21": "Dan juga pada diri kamu sendiri.",
                            "verse 51:22": "Dan di langit pula terdapat (sebab-sebab) rezeki kamu dan juga terdapat apa yang telah (ditakdirkan dan) dijanjikan kepada kamu.",
                            "verse 51:23": "Maka demi Tuhan langit dan bumi, sesungguhnya (apa yang tersebut) itu tetap benar, (tidak patut diragu-ragukan) sebagaimana (tidak sepatutnya diragukan) benarnya kamu dapat berkata-kata.",
                            "verse 51:24": "Sudahkah sampai kepadamu (wahai Muhammad) perihal tetamu Nabi Ibrahim yang dimuliakan?",
                            "verse 51:25": "Ketika mereka masuk mendapatkannya lalu memberi salam dengan berkata: Salam sejahtera kepadamu! Dia menjawab: Salam sejahtera kepada kamu! (Sambil berkata dalam hati): Mereka ini orang-orang yang tidak dikenal.",
                            "verse 51:26": "Kemudian dia masuk mendapatkan Ahli rumahnya serta dibawanya keluar seekor anak lembu gemuk (yang dipanggang).",
                            "verse 51:27": "Lalu dihidangkannya kepada mereka sambil berkata: Silalah makan.",
                            "verse 51:28": "(Setelah dilihatnya mereka tidak menjamah makanan itu), maka dia merasa takut dari keadaan mereka.",
                            "verse 51:29": "(Mendengarkan berita yang menggembirakan itu), maka datanglah isterinya sambil menjerit (kehairanan) lalu menepuk mukanya sambil berkata: Aku sudah tua, lagi mandul, (bagaimana aku boleh mendapat anak)?",
                            "verse 51:30": "Mereka berkata: Demikianlah Tuhanmu berfirman, (kami hanya menyampaikan sahaja); Sesungguhnya Dialah Yang Maha Bijaksana, lagi Maha Mengetahui.",
                            "verse 51:31": "Nabi Ibrahim bertanya: (Selain dari itu) apa lagi tugas penting kamu wahai utusan Tuhan?",
                            "verse 51:32": "Mereka menjawab: Sesungguhnya Kami diutus kepada suatu kaum yang berdosa (untuk membinasakan mereka);",
                            "verse 51:33": "Supaya Kami menimpakan mereka dengan batu-batu dari tanah (yang dibakar),",
                            "verse 51:34": "Batu-batu itu ditandakan di sisi Tuhanmu, untuk membinasakan orang-orang yang melampaui batas (dalam keingkarannya).",
                            "verse 51:35": "(Setelah sampai utusan Kami ke tempat itu), Kami (perintahkan mereka) mengeluarkan orang-orang yang beriman yang tinggal di situ.",
                            "verse 51:36": "(Sesudah dipereksa) maka (utusan) Kami tidak mendapati di situ melainkan sebuah rumah sahaja yang ada penduduknya dari orang-orang Islam (yang beriman kepada Nabi Lut).",
                            "verse 51:37": "Dan Kami tinggalkan di negeri itu (timbunan batu-batu yang telah menghujani dan membinasakan mereka), sebagai tanda (yang mendatangkan keinsafan) bagi orang-orang yang sedia takut kepada azab seksa yang tidak terperi sakitnya.",
                            "verse 51:38": "Dan juga pada (kisah) Nabi Musa (terdapat dalil-dalil yang memberi keinsafan), ketika kami mengutusnya kepada Firaun dengan membawa mukjizat yang nyata.",
                            "verse 51:39": "Maka Firaun berpaling ingkar dengan berdasarkan kekuasaannya sambil berkata: (Musa itu) adalah seorang ahli sihir atau seorang gila!",
                            "verse 51:40": "Lalu Kami (adakan jalan) mengambil Firaun bersama-sama tenteranya, kemudian Kami humbankan mereka ke dalam laut, sedang dia berkeadaan tercela.",
                            "verse 51:41": "Dan juga pada (kisah) kaum Aad (terdapat perkara-perkara yang menjadi iktibar), ketika kami hantarkan kepada mereka angin ribut yang tidak mengandungi sebarang kebaikan;",
                            "verse 51:42": "Angin itu tidak meninggalkan sesuatupun yang dirempuhnya, melainkan menjadikannya (hancur) seperti debu.",
                            "verse 51:43": "Dan juga pada (kisah) kaum Thamud (terdapat perkara-perkara yang menjadi pelajaran) ketika dikatakan kepada mereka: Bersenang-senanglah kamu hingga ke suatu waktu (yang termaklum)!",
                            "verse 51:44": "Maka mereka membesarkan diri terhadap perintah Tuhannya, lalu mereka disambar petir (dengan tidak dapat melarikan diri), sedang mereka melihatnya.",
                            "verse 51:45": "Dengan yang demikian, mereka tidak dapat bangun lagi dan mereka juga tidak mendapat pertolongan.",
                            "verse 51:46": "Dan kaum Nuh (Kami juga telah binasakan) sebelum itu; sesungguhnya mereka adalah kaum yang fasik (derhaka).",
                            "verse 51:47": "Dan langit itu Kami dirikan dengan kekuasaan Kami (dalam bentuk binaan yang kukuh rapi) dan sesungguhnya Kami adalah mempunyai kekuasaan yang luas tidak terhingga.",
                            "verse 51:48": "Dan bumi pula Kami hamparkan (untuk kemudahan kamu mendiaminya); maka Kamilah sebaik-baik yang menghamparkannya.",
                            "verse 51:49": "Dan tiap-tiap jenis Kami ciptakan berpasangan, supaya kami dan mengingati (kekuasaan kami dan mentauhidkan Kami).",
                            "verse 51:50": "(Katakanlah wahai Muhammad kepada mereka): Maka segeralah kamu kembali kepada Allah (dengan bertaubat dan taat), sesungguhnya aku diutuskan Allah kepada kamu, sebagai pemberi amaran yang nyata.",
                            "verse 51:51": "Dan janganlah kamu adakan tuhan yang lain bersama Allah (dalam kepercayaan kamu), sesungguhnya aku diutus oleh Allah kepada kamu sebagai pemberi amaran yang nyata.",
                            "verse 51:52": "Demikianlah (keadaan tiap-tiap kaum terhadap Rasulnya samalah seperti keadaan kaummu wahai Muhammad) tidak ada seorang Rasul pun yang datang kepada kaum-kaum yang terdahulu dari mereka, melainkan ada yang berkata: Dia adalah seorang ahli sihir atau seorang gila.",
                            "verse 51:53": "Adakah mereka semua telah berpesan-pesan (dan mencapai kata sepakat) untuk melemparkan tuduhan itu ? (Sudah tentu mereka tidak dapat berbuat demikian), bahkan mereka semuanya adalah kaum yang melampaui batas (dalam keingkarannya).",
                            "verse 51:54": "Oleh itu, berpalinglah (wahai Muhammad) daripada mereka (yang menentangmu itu dan janganlah dihiraukan), kerana engkau tidak akan disalahkan (setelah engkau memberi amaran kepada mereka).",
                            "verse 51:55": "Dan tetap tekunlah engkau memberi peringatan, kerana sesungguhnya peringatan itu mendatangkan faedah kepada orang-orang yang beriman.",
                            "verse 51:56": "Dan (ingatlah) Aku tidak menciptakan jin dan manusia melainkan untuk mereka menyembah dan beribadat kepadaKu.",
                            "verse 51:57": "Aku tidak sekali-kali menghendaki sebarang rezeki pemberian dari mereka dan Aku tidak menghendaki supaya mereka memberi makan kepadaKu.",
                            "verse 51:58": "Sesungguhnya Allah Dialah sahaja Yang Memberi rezeki (kepada sekalian makhlukNya, dan Dialah sahaja) Yang Mempunyai Kekuasaan yang tidak terhingga, lagi Yang Maha Kuat Kukuh kekuasaanNya.",
                            "verse 51:59": "(Setelah ternyata hakikat yang demikian), maka sesungguhnya bagi orang-orang yang zalim (yang menentang ajaran Nabi Muhammad) itu ada bahagiannya (dari azab seksa) seperti bahagian rakan-rakan mereka (kaum kafir yang telah lalu).",
                            "verse 51:60": "Maka kecelakaan dan kebinasaanlah bagi orang-orang yang kafir pada hari yang telah dijanjikan kepada mereka."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "سوگند به بادهايى كه (ابرها را) به حركت درمى‏آورند،",
                            "verse 51:2": "سوگند به آن ابرها كه بار سنگينى (از باران را) با خود حمل مى‏كنند،",
                            "verse 51:3": "و سوگند به كشتيهايى كه به آسانى به حركت درمى‏آيند،",
                            "verse 51:4": "و سوگند به فرشتگانى كه كارها را تقسيم مى‏كنند،",
                            "verse 51:5": "(آرى سوگند به همه اينها) كه آنچه به شما وعده شده قطعا راست است;",
                            "verse 51:6": "و بى‏شك (رستاخيز) و جزاى اعمال واقع‏شدنى است!",
                            "verse 51:7": "قسم به آسمان كه داراى چين و شكنهاى زيباست،",
                            "verse 51:8": "كه شما (درباره قيامت) در گفتارى مختلف و گوناگونيد!",
                            "verse 51:9": "(تنها) كسى از ايمان به آن منحرف مى‏شود كه از قبول حق سرباز مى‏زند!",
                            "verse 51:10": "كشته باد دروغگويان (و مرگ بر آنها)!",
                            "verse 51:11": "همانها كه در جهل و غفلت فرو رفته‏اند،",
                            "verse 51:12": "و پيوسته سؤال مى‏كنند: «روز جزا چه موقع است؟!»",
                            "verse 51:13": "(آرى) همان روزى است كه آنها را بر آتش مى‏سوزانند!",
                            "verse 51:14": "(و گفته مى‏شود:) بچشيد عذاب خود را، اين همان چيزى است كه براى آن شتاب داشتيد!",
                            "verse 51:15": "به يقين، پرهيزگاران در باغهاى بهشت و در ميان چشمه‏ها قرار دارند،",
                            "verse 51:16": "و آنچه پروردگارشان به آنها بخشيده دريافت مى‏دارند، زيرا پيش از آن (در سراى دنيا) از نيكوكاران بودند!",
                            "verse 51:17": "آنها كمى از شب را مى‏خوابيدند،",
                            "verse 51:18": "و در سحرگاهان استغفار مى‏كردند،",
                            "verse 51:19": "و در اموال آنها حقى براى سائل و محروم بود!",
                            "verse 51:20": "و در زمين آياتى براى جويندگان يقين است،",
                            "verse 51:21": "و در وجود خود شما (نيز آياتى است); آيا نمى‏بينيد؟!",
                            "verse 51:22": "و روزى شما در آسمان است و آنچه به شما وعده داده مى‏شود!",
                            "verse 51:23": "سوگند به پروردگار آسمان و زمين كه اين مطلب حق است همان گونه كه شما سخن مى‏گوييد!",
                            "verse 51:24": "آيا خبر مهمانهاى بزرگوار ابراهيم به تو رسيده است؟",
                            "verse 51:25": "در آن زمان كه بر او وارد شدند و گفتند: «سلام بر تو!» او گفت: «سلام بر شما كه جمعيتى ناشناخته‏ايد!»",
                            "verse 51:26": "سپس پنهانى به سوى خانواده خود رفت و گوساله فربه (و بريان شده‏اى را براى آنها) آورد،",
                            "verse 51:27": "و نزديك آنها گذارد، (ولى با تعجب ديد دست بسوى غذا نمى‏برند) گفت: «آيا شما غذا نمى‏خوريد؟!»",
                            "verse 51:28": "و از آنها احساس وحشت كرد، گفتند: «نترس (ما رسولان و فرشتگان پروردگار توايم)!» و او را بشارت به تولد پسرى دانا دادند",
                            "verse 51:29": "در اين هنگام همسرش جلو آمد در حالى كه (از خوشحالى و تعجب) فرياد مى‏كشيد به صورت خود زد و گفت: «(آيا پسرى خواهم آورد در حالى كه) پيرزنى نازا هستم؟!»",
                            "verse 51:30": "گفتند: «پروردگارت چنين گفته است، و او حكيم و داناست!»",
                            "verse 51:31": "(ابراهيم) گفت: «ماموريت شما چيست اى فرستادگان (خدا)؟»",
                            "verse 51:32": "گفتند: «ما به سوى قوم مجرمى فرستاده شده‏ايم",
                            "verse 51:33": "تا بارانى از «سنگ - گل‏» بر آنها بفرستيم;",
                            "verse 51:34": "سنگهايى كه از ناحيه پروردگارت براى اسرافكاران نشان گذاشته شده است!»",
                            "verse 51:35": "ما مؤمنانى را كه در آن شهرها(ى قوم لوط) زندگى مى‏كردند (قبل از نزول عذاب) خارج كرديم،",
                            "verse 51:36": "ولى جز يك خانواده باايمان در تمام آنها نيافتيم!",
                            "verse 51:37": "و در آن (شهرهاى بلا ديده) نشانه‏اى روشن براى كسانى كه از عذاب دردناك مى‏ترسند به جاى گذارديم",
                            "verse 51:38": "و در (زندگى) موسى نيز (نشانه و درس عبرتى بود) هنگامى كه او را با دليلى آشكار به سوى فرعون فرستاديم;",
                            "verse 51:39": "اما او با تمام وجودش از وى روى برتافت و گفت: «اين مرد يا ساحر است يا ديوانه!»",
                            "verse 51:40": "از اين رو ما او و لشكريانش را گرفتيم و به دريا افكنديم در حالى كه در خور سرزنش‏بود!",
                            "verse 51:41": "و (همچنين) در سرگذشت «عاد» (آيتى است) در آن هنگام كه تندبادى بى‏باران بر آنها فرستاديم،",
                            "verse 51:42": "كه بر هيچ چيز نمى‏گذشت مگر اينكه آن را همچون استخوانهاى پوسيده مى‏ساخت",
                            "verse 51:43": "و نيز در سرگذشت قوم «ثمود» عبرتى است در آن هنگام كه به آنان گفته شد: «مدتى كوتاه بهره‏مند باشيد (و سپس منتظر عذاب)!»",
                            "verse 51:44": "آنها از فرمان پروردگارشان سرباز زدند، و صاعقه آنان را فراگرفت در حالى كه (خيره خيره) نگاه مى‏كردند (بى‏آنكه قدرت دفاع داشته باشند)!",
                            "verse 51:45": "چنان بر زمين افتادند كه توان برخاستن نداشتند و نتوانستند از كسى يارى طلبند!",
                            "verse 51:46": "همچنين قوم نوح را پيش از آنها هلاك كرديم، چرا كه قوم فاسقى بودند!",
                            "verse 51:47": "و ما آسمان را با قدرت بنا كرديم، و همواره آن را وسعت مى‏بخشيم!",
                            "verse 51:48": "و زمين را گسترديم، و چه خوب گستراننده‏اى هستيم!",
                            "verse 51:49": "و از هر چيز دو جفت آفريديم، شايد متذكر شويد!",
                            "verse 51:50": "پس به سوى خدا بگريزيد، كه من از سوى او براى شما بيم‏دهنده‏اى آشكارم!",
                            "verse 51:51": "و با خدا معبود ديگرى قرار ندهيد، كه من براى شما از سوى او بيم‏دهنده‏اى آشكارم!",
                            "verse 51:52": "اين گونه است كه هيچ پيامبرى قبل از اينها بسوى قومى فرستاده نشد مگر اينكه گفتند: س‏خ‏للّهاو ساحر است يا ديوانه!»",
                            "verse 51:53": "آيا يكديگر را به آن سفارش مى‏كردند (كه همه چنين تهمتى بزنند)؟! نه، بلكه آنها قومى طغيانگرند",
                            "verse 51:54": "حال كه چنين است از آنها روى بگردان كه هرگز در خور ملامت نخواهى بود;",
                            "verse 51:55": "و پيوسته تذكر ده، زيرا تذكر مؤمنان را سود مى‏بخشد",
                            "verse 51:56": "من جن و انس را نيافريدم جز براى اينكه عبادتم كنند (و از اين راه تكامل يابند و به من نزديك شوند)!",
                            "verse 51:57": "هرگز از آنها روزى نمى‏خواهم، و نمى‏خواهم مرا اطعام كنند!",
                            "verse 51:58": "خداوند روزى‏دهنده و صاحب قوت و قدرت است!",
                            "verse 51:59": "و براى كسانى كه ستم كردند، سهم بزرگى از عذاب است همانند سهم يارانشان (از اقوام ستمگر پيشين); بنابر اين عجله نكنند!",
                            "verse 51:60": "پس واى بر كسانى كه كافر شدند از روزى كه به آنها وعده داده مى‏شود!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "1.",
                            "verse 51:2": "2.",
                            "verse 51:3": "3.",
                            "verse 51:4": "4.",
                            "verse 51:5": "5.",
                            "verse 51:6": "6.",
                            "verse 51:7": "7.",
                            "verse 51:8": "8.",
                            "verse 51:9": "9.",
                            "verse 51:10": "10.",
                            "verse 51:11": "11.",
                            "verse 51:12": "12.",
                            "verse 51:13": "13.",
                            "verse 51:14": "14.",
                            "verse 51:15": "15.",
                            "verse 51:16": "16.",
                            "verse 51:17": "17.",
                            "verse 51:18": "18.",
                            "verse 51:19": "E há em seus bens uma parte para o mendigo e o desafortunado",
                            "verse 51:20": "E na terra, há sinais para os que estão seguros na fé.",
                            "verse 51:21": "E também (os há) em vós mesmos.",
                            "verse 51:22": "E no céu está o vosso sustento, bem como tudo quanto vos tem sido prometido.",
                            "verse 51:23": "Pelo Senhor dos céus e da terra, que isto é tão verdadeiro como é certo que falais!",
                            "verse 51:24": "Tens ouvido (ó Mensageiro) a história dos honoráveis hóspedes de Abraão?",
                            "verse 51:25": "Quando se apresentaram a ele e disseram: Paz!, respondeu-lhes: Paz! (E pensou): \"É gente desconhecida\".",
                            "verse 51:26": "E voltou rapidamente para os seus, e trouxe (na volta) um bezerro cevado.",
                            "verse 51:27": "Que lhes ofereceu.",
                            "verse 51:28": "Então sentiu medo deles.",
                            "verse 51:29": "E sua mulher irrompeu, (rindo) em voz alta; e, batendo na própria face, disse: Eu, uma anciã estéril!",
                            "verse 51:30": "Disseram-lhe: Assim prescreveu teu Senhor, porque Ele é o Prudente, o Sapientíssimo.",
                            "verse 51:31": "Perguntou Abraão: Qual é, então, a vossa incumbência, ó mensageiro?",
                            "verse 51:32": "Responderam-lhe: Em verdade, fomos enviados a um povo de pecadores,",
                            "verse 51:33": "Para que lançássemos sobre eles pedras de argila,",
                            "verse 51:34": "Destinados, da parte do teu Senhor, aos transgressores.",
                            "verse 51:35": "E evacuamos os fiéis que nela (Sodoma) havia.",
                            "verse 51:36": "Porém, encontramos nela uma só casa de muçulmanos.",
                            "verse 51:37": "E deixamos lá um sinal, para aqueles que temem o doloroso castigo.",
                            "verse 51:38": "E em Moisés (também, havia um sinal), quando o enviamos ao Faraó, com uma autoridade evidente.",
                            "verse 51:39": "Porém, (o Faraó) o rechaçou, com os seus chefes, dizendo: É um mago ou um energúmeno!",
                            "verse 51:40": "Porém, apanhamo-lo, juntamente com as suas hostes, e os precipitamos no mar, porque eram réprobos.",
                            "verse 51:41": "E (na história do povo de) Ad há um exemplo; desencadeamos contra eles um vento assolador,",
                            "verse 51:42": "Que não passava sobre aquilo a que ia de encontro, sem o reduzir a cinzas.",
                            "verse 51:43": "E (no povo de) Tamud tendes um exemplo, ao lhes ser dito: Desfrutai transitoriamente!",
                            "verse 51:44": "Porém, desacataram insolentemente a ordem de seu Senhor, e a centelha os fulminou, enquanto observavam.",
                            "verse 51:45": "E não puderam manter-se de pé, nem socorrer-se mutuamente.",
                            "verse 51:46": "E anteriormente a eles houve o povo de Noé; em verdade, era um povo depravado.",
                            "verse 51:47": "E construímos o firmamento com poder e perícia, e Nós o estamos expandindo.",
                            "verse 51:48": "E dilatamos a terra; e que excelente Dilatador tendes em Nós!",
                            "verse 51:49": "E criamos um casal de cada espécie, para que mediteis.",
                            "verse 51:50": "Apressai-vos, pois, para Deus, porque sou, da Sua parte, um elucidativo admoestador para vós.",
                            "verse 51:51": "E não coloqueis outra divindade junto a Deus, porque sou da Sua parte, um elucidativo admoestador para vós.",
                            "verse 51:52": "Mesmo assim, não se apresentou mensageiro algum àquelas que vos precederam, sem que dissessem: É um mago ou um energúmeno!",
                            "verse 51:53": "Acaso, tê-la-ão eles transmitido (a expressão), de um para o outro? Qual! São um povo de transgressores.",
                            "verse 51:54": "Afasta-te, pois, deles, porque não serás reprovado.",
                            "verse 51:55": "E admoesta-os, porque a admoestação será proveitosa para os fiéis.",
                            "verse 51:56": "Não criei os gênios e os humanos, senão para Me adorarem.",
                            "verse 51:57": "Não lhes peço sustento algum, nem quero que Me alimentam.",
                            "verse 51:58": "Sabei que Deus é o Sustentador por excelência, Potente, Inquebrantabilíssimo.",
                            "verse 51:59": "Em verdade, os iníquos auferirão a mesma sorte que os seus antepassados.",
                            "verse 51:60": "Ai, pois, dos incrédulos no dia que lhes tem sido prometido!"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 51:1": "Pe cele care risipesc, împrãștiind",
                            "verse 51:2": "Și pe cele care poartã povarã",
                            "verse 51:3": "Și pe cele care lunecã ușor",
                            "verse 51:4": "Și pe cele care împart dupã poruncã!",
                            "verse 51:5": "Ceea ce vi se promite este adevãrat,",
                            "verse 51:6": "Iar rãsplata este hotãrâtã!",
                            "verse 51:7": "Pe cerul cel bine întocmit!",
                            "verse 51:8": "Voi vã aflați în vorbã învrãjbitã ,",
                            "verse 51:9": "Prin care este ținut departe de el cel care a fost îndepãrtat .",
                            "verse 51:10": "Sã fie blestemați mincinoșii",
                            "verse 51:11": "Care stau nepãsãtori într-un potop!",
                            "verse 51:12": "Ei întreabã: \"Când va fi Ziua Judecãții?\"",
                            "verse 51:13": "În Ziua aceea, ei vor fi încercați prin Foc!",
                            "verse 51:14": "\"Gustați încercarea voastrã! Aceasta este ceea ce voi ați cãutat sã grãbiți!\"",
                            "verse 51:15": "Cei ce se tem [de Allah] vor fi în grãdini și",
                            "verse 51:16": "izvoare,",
                            "verse 51:17": "Primind ceea ce le dãruiește Domnul lor; înainte de aceasta ei doarã au fost de bine fãcãtori;",
                            "verse 51:18": "Ei nu dormeau decât puțin în timpul nopții ,",
                            "verse 51:19": "Iar înainte de ivirea zorilor ei se rugau de iertare",
                            "verse 51:20": "Și în averea lor se afla un drept pentru cerșetor și pentru cel nevoiaș.",
                            "verse 51:21": "Pe pãmânt se aflã semne pentru cei care cred cu putere,",
                            "verse 51:22": "Ca și în voi înșivã.",
                            "verse 51:23": "Și în cer se aflã înzestrarea voastrã și ceea ce vi se fãgã- duiește .",
                            "verse 51:24": "Pe Stãpânul cerului și al pãmântului! Aceasta este la fel de adevãrat precum aceea cã voi puteți vorbi!",
                            "verse 51:25": "Oare nu a ajuns la tine istoria despre oaspeții cei cinstiți ai luiAvraam?",
                            "verse 51:26": "Când au intrat la el și au zis \"Pace!\", iar el le-a zis lor \"Pace, oa- meni necunoscuți!\"",
                            "verse 51:27": "Apoi s-a dus el pe furiș la familia lui și a adus un vițel gras.",
                            "verse 51:28": "Și l-a apropiat de ei, zicând: \"Voi nu mâncați?\"",
                            "verse 51:29": "Și l-a cuprins pe el frica, însã ei i-au zis: \"Nu te teme!\" Și i-au vestit lui",
                            "verse 51:30": "unui fecior înțelept .",
                            "verse 51:31": "S-a apropiat muierea lui, vãicãrindu-se, lovindu-și obrajii și a zis:\"[Eu sunt] o babã stearpã.",
                            "verse 51:32": "Dar ei au zis: \"Așa a grãit Domnul tãu și El este Înțelept",
                            "verse 51:33": "Atoateștiutor [Al-Hakim, Al-'Alim]\".",
                            "verse 51:34": "A zis : \"Și ce v-a adus pe voi, trimișilor?\"",
                            "verse 51:35": "Au rãspuns ei: \"Noi am fost trimiși la un neam de nelegiuiți ,",
                            "verse 51:36": "Ca sã aruncãm asupra lor pietre de lut,",
                            "verse 51:37": "Însemnate de Domnul tãu pentru nelegiuiți!\"",
                            "verse 51:38": "Și i-am scos Noi din ea pe aceia care erau credincioși,",
                            "verse 51:39": "Dar nu am gãsit printre ei decât o singurã casã de supuși ,",
                            "verse 51:40": "Și am lãsat Noi în ea un semn pentru aceia care se tem de chinul cel dureros.",
                            "verse 51:41": "[Și a fost un semn] și în Moise , când l-am trimis Noi cu o dovadã limpede la Faraon.",
                            "verse 51:42": "Însã",
                            "verse 51:43": "s-a întors cu cãpeteniile sale și a zis: \"Un vrãjitor sau un nebun!\"",
                            "verse 51:44": "Și l-am apucat Noi împreunã cu oștenii lui și l-am aruncat în mare, cãci a fost el vinovat.",
                            "verse 51:45": "[Și a fost un semn] și în ’Ad , când am trimis la ei vântul nerod- nic ,",
                            "verse 51:46": "Care nu a lãsat nici un lucru peste care s-a abãtut, fãrã sã nu-l fi fãcut asemenea pulberii.",
                            "verse 51:47": "Și în Thamud când li s-a zis lor : \"Bucurați-vã voi pânã la ovreme!\"",
                            "verse 51:48": "Și s-au împotrivit ei cu îndârjire poruncii Domnului lor și i-a lovit pe ei trãsnetul , pe când ei priveau .",
                            "verse 51:49": "Și n-au mai fost ei în stare sã se ridice și nu au fost de nimeni ajutați.",
                            "verse 51:50": "Și în neamul lui Noe , mai înainte, cãci și ei au fost un neam de spurcați.",
                            "verse 51:51": "Iar cerul l-am înãlțat cu puterea Noastrã și Noi îl lãrgim.",
                            "verse 51:52": "Iar pãmântul l-am întins și ce frumos l-am netezit!",
                            "verse 51:53": "Și din fiecare lucru Noi am creat perechi.",
                            "verse 51:54": "Deci fugiți voi la Allah! Eu sunt pentru voi prevenitor limpede din partea Lui.",
                            "verse 51:55": "Și nu așezați lângã Allah un alt dumnezeu! Eu sunt pentru voi prevenitor limpede din partea Lui.",
                            "verse 51:56": "Tot astfel nu a venit la cei de dinainte de ei nici un trimis fãrã ca ei sã nu zicã: \"Este un vrãjitor sau un nebun!\"",
                            "verse 51:57": "Oare și-au lãsat ei aceastã moștenire unii altora? Ba ei sunt mai degrabã un neam de ticãloși.",
                            "verse 51:58": "Deci întoarce-te de la ei și nu vei fi tu osândit!",
                            "verse 51:59": "Și îndeamnã, cãci îndemnarea le este spre folos dreptcredin- cioșilor!",
                            "verse 51:60": "Eu nu i-am creat pe djinni și oameni decât pentru ca ei sã Mãadore.",
                            "verse 51:61": "Eu nu voiesc de la ei întreținere și nici nu voiesc ca ei sã Mã hrãneascã pe Mine.",
                            "verse 51:62": "Ci Allah este Întreținãtorul ,",
                            "verse 51:63": "Stãpânul puterii, Cel Sta-tornic .",
                            "verse 51:64": "Aceia care sunt nedrepți au o parte [de pedeapsã] asemã- nãtoare cu partea tovarãșilor lor.",
                            "verse 51:65": "Și vai celor care nu cred în Ziua lor , cu care sunt amenin- țați! grãbesc!"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 51:1": "Pe împrăştietoarele ce împrăştie!",
                            "verse 51:2": "Pe cărătoarele de povară!",
                            "verse 51:3": "Pe alergătoarele cu iuţeală!",
                            "verse 51:4": "Pe împărţitoarele de poruncă!",
                            "verse 51:5": "Ceea ce vi s-a făgăduit este adevărat.",
                            "verse 51:6": "Judecata de Apoi este fără tăgadă.",
                            "verse 51:7": "Pe cerul cu ale sale cărări!",
                            "verse 51:8": "Voi aveţi asupra lui păreri felurite,",
                            "verse 51:9": "şi îl întoarce pe dos cel care este întors.",
                            "verse 51:10": "Să fie ucişi bănuitorii,",
                            "verse 51:11": "ei, cei care sunt într-o prăpastie şi nu-şi dau seama!",
                            "verse 51:12": "Ei întreabă: “Când va veni Ziua Judecăţii?”",
                            "verse 51:13": "În Ziua când vor fi puşi la încercare în Foc:",
                            "verse 51:14": "“Gustaţi încercarea voastră! Aceasta este ceea ce voi cereaţi degrabă!”",
                            "verse 51:15": "Cei temători vor trăi în Grădini cu izvoare,",
                            "verse 51:16": "luând ceea ce Domnul lor le va dărui.",
                            "verse 51:17": "ce dormeau noaptea puţin,",
                            "verse 51:18": "iar dis-de-dimineaţă cereau iertare.",
                            "verse 51:19": "Din averile lor aveau parte şi cerşetorul şi lipsitul!",
                            "verse 51:20": "Pe pământ sunt semne pentru cei care cred cu tărie.",
                            "verse 51:21": "Precum şi în voi înşivă.",
                            "verse 51:22": "În cer este înzestrarea voastră şi ceea ce vi s-a făgăduit.",
                            "verse 51:23": "Pe Domnul cerului şi al pământului! Acesta este Adevărul precum faptul că vorbiţi.",
                            "verse 51:24": "A venit la tine spusa despre oaspeţii prea-cinstiţi ai lui Abraham?",
                            "verse 51:25": "Ei intrară la el spunându-i: “Pace!” Abraham spuse: “Pace! O, oameni necunoscuţi!”",
                            "verse 51:26": "El s-a dus apoi pe nesimţite la ai săi şi a adus un viţel gras.",
                            "verse 51:27": "L-a apropiat de ei, spunând: “Nu mâncaţi?”",
                            "verse 51:28": "Şi atunci îl prinse frica de ei.",
                            "verse 51:29": "Femeia sa înaintă văitându-se şi lovindu-se peste faţă.",
                            "verse 51:30": "Ei spuseră: “Domnul tău a spus astfel.",
                            "verse 51:31": "Abraham spuse: “O, voi trimişilor! Care este treaba voastră?”",
                            "verse 51:32": "Ei spuseră: “Noi am fost trimişi la un popor de nelegiuiţi",
                            "verse 51:33": "ca să trimitem asupra lui bolovani de lut",
                            "verse 51:34": "însemnaţi de Domnul tău pentru cei desfrânaţi.",
                            "verse 51:35": "Noi i-am scos aşadar din cetate pe cei credincioşi şi",
                            "verse 51:36": "nu am aflat decât o casă de supuşi.",
                            "verse 51:37": "Am pus în ea un semn pentru cei care se tem de Osânda cea dureroasă,",
                            "verse 51:38": "precum în Moise când l-am trimis cu o împuternicire desluşită la Faraon",
                            "verse 51:39": "care s-a întors către suita sa spunând: “Este fie vrăjitor, fie îndrăcit!”",
                            "verse 51:40": "Noi i-am luat pe ei şi oştile lor şi i-am aruncat în mare, în vreme ce el se dojenea pe sine.",
                            "verse 51:41": "Aşa a fost şi cu adiţii când am trimis asupra lor vântul pustiilor",
                            "verse 51:42": "care nu a lăsat nimic peste care a trecut fără să nu-l facă fărâme.",
                            "verse 51:43": "Aşa a fost şi cu tamudiţii când li s-a spus: “Bucuraţi-vă o vreme!”",
                            "verse 51:44": "Ei n-au luat însă în seamă porunca Domnului lor, iar trăsnetul i-a luat pe când priveau.",
                            "verse 51:45": "Atunci nu s-au putut ţine pe picioare şi nici ajuta.",
                            "verse 51:46": "Aşa a fost şi cu poporul lui Noe: Era un popor de desfrânaţi.",
                            "verse 51:47": "Şi cerul? Noi l-am zidit cu trăinicie şi i-am dat apoi lărgime!",
                            "verse 51:48": "Şi pământul? Noi l-am aşternut şi ce buni întinzători am fost!",
                            "verse 51:49": "Din fiece lucru am creat o pereche.",
                            "verse 51:50": "Zoriţi către Dumnezeu! Eu de la El vă previn desluşit!",
                            "verse 51:51": "Nu puneţi lângă Dumnezeu alt dumnezeu! Eu de la El vă previn desluşit!",
                            "verse 51:52": "Aşa a fost întotdeauna.",
                            "verse 51:53": "Ei s-au sfătuit unii pe alţii asupra lui? Acesta este un popor de ticăloşi!",
                            "verse 51:54": "Întoarce-le spatele şi nu vei fi dojenit!",
                            "verse 51:55": "Adu-le aminte, căci amintirea le este credincioşilor de folos.",
                            "verse 51:56": "Eu nu i-am creat nici pe ginnii şi nici pe oamenii decât ca să Mi se închine.",
                            "verse 51:57": "Eu nu vreau nici un dar de la ei.",
                            "verse 51:58": "Dumnezeu este Împărţitorul de bunuri.",
                            "verse 51:59": "Cei care s-au ticăloşit în păcate, precum păcatele semenilor lor, să nu o ceară degrabă (Judecata)!",
                            "verse 51:60": "Vai tăgăduitorilor pentru Ziua ce li s-a făgăduit! (Judecata)!"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "Клянусь рассеивающими (то, чтонадлежит рассеять),",
                            "verse 51:2": "И теми, что сметают ноши тяжкие(с пути),",
                            "verse 51:3": "И теми, что плывут покойно и легко,",
                            "verse 51:4": "И теми, что (по повелению Господню)Распределяют соразмерно, —",
                            "verse 51:5": "Ведь то, что вам сулит Господь, —верно’!",
                            "verse 51:6": "Поистине, Суд (воздаяния) настанет.",
                            "verse 51:7": "В знак неба, обладателя путей,",
                            "verse 51:8": "Поистине, вы пребываете в речахразноголосых.",
                            "verse 51:9": "И через них отвращены (от ИстиныГосподней) те,Кто отвращению сему предался.",
                            "verse 51:10": "Проклятье сеятелям лжи —",
                            "verse 51:11": "Тем, кто с беспечностью бредетв потоке заблуждений",
                            "verse 51:12": "И вопрошает:«Когда наступит День (Господнего)Суда?»",
                            "verse 51:13": "То будет День,Когда их испытаниям подвергнутНад (адовым) огнем!",
                            "verse 51:14": "«Вкусите ваше испытанье!Ведь это — то, с чем торопили вы».",
                            "verse 51:15": "А праведники —Им пребывать в Садах средь родников",
                            "verse 51:16": "И черпать радость в том, что Богдарует, —Ведь перед этим жизнь благочестивуюони вели,",
                            "verse 51:17": "Сну отдавая только малую часть ночи",
                            "verse 51:18": "И в ранние часы зари взываяо прощенье,",
                            "verse 51:19": "И в достоянии у нихВсегда имелась доля для лишенных,Для тех, которые о помощи взывают,И тех, которые о помощи(в смирении) молчат.",
                            "verse 51:20": "Ведь на земле имеются знамениядля убежденных,",
                            "verse 51:21": "А также в вас самих, — ужельне видите вы это?",
                            "verse 51:22": "И в небе — ваш наделИ то, что вам обещано (в сей жизни).",
                            "verse 51:23": "А потому, клянусь Властителем землии неба,Сие есть истина такая же, как та,Что вы разумно обращаетесь другк другу!",
                            "verse 51:24": "К тебе пришел рассказ об ИбрахимеИ почитаемых его гостях2174?",
                            "verse 51:25": "Итак, они вошли к нему и молвили:«Мир (вам)».",
                            "verse 51:26": "Затем он быстро вышел к домочадцамИ вынес мясо сочное теленка",
                            "verse 51:27": "И, положив его пред ними, сказал:«Быть может, поедите вы?»",
                            "verse 51:28": "(Когда ж они отведать пищуотказались),В нем страх проснулся к ним.",
                            "verse 51:29": "Но тут жена его вперед вступилаИ, стукнув в изумлении себя по лбу,Воскликнула:«Ведь я неплодная старуха!»",
                            "verse 51:30": "(На что) ответили они:«Так говорит Господь ваш,А Он, поистине, и мудрости,и знания исполнен».",
                            "verse 51:31": "И Ибрахим сказал:«В чем ваша миссия, посланники,сейчас?»",
                            "verse 51:32": "Они ответили:«Мы посланы к народу, погрязшемув грехе2175,",
                            "verse 51:33": "Чтоб их камнями забросать из глины,",
                            "verse 51:34": "Как вашим Господом назначенодля тех,Кто перешел дозволенного грани».",
                            "verse 51:35": "Затем Мы вывели оттуда тех2176,В ком вера в Господа жила.",
                            "verse 51:36": "Но там нашли Мы лишь один очагислама —(Дом Лута и его двух дочерей).",
                            "verse 51:37": "Мы в нем оставили знамение для тех,В ком страх есть перед мукой (Божьейкары).",
                            "verse 51:38": "И в Мусе вы узреть должны (знаменьеНаше) —Мы к Фараону с властью яснойего послали.",
                            "verse 51:39": "Но Фараон и все правители егоОтворотились и сказали:«Колдун он или одержимый!»",
                            "verse 51:40": "Тогда Мы взяли Фараона и его войскаИ ввергли их в пучину моря.",
                            "verse 51:41": "(Другим знамением предстали) людиА–д, —На них Мы ветер сокрушительныйпослали,",
                            "verse 51:42": "Что на своем пути был беспощаден,Все превращая в прах и пепел.",
                            "verse 51:43": "(И вот еще одно знаменье) —самудяне.",
                            "verse 51:44": "Они отвергли дерзостно приказГосподень,И вот тогда на их глазахИх охватил ужасный гул(землетрясенья)2177,",
                            "verse 51:45": "И не могли они ни выстоять,ни защититься.",
                            "verse 51:46": "Еще до них такой же участиподверглись люди Нуха2178За то, что все дозволенные гранипреступили.",
                            "verse 51:47": "Своим державием Мы водрузили своднебесныйИ для него раскинули бескрайнеепространство;",
                            "verse 51:48": "И землю разостлали Мы, —Как совершенно Мы творим (все это)!",
                            "verse 51:49": "Мы в паре сотворили всяку вещь, —Быть может, вам над этим стоитпоразмыслить!",
                            "verse 51:50": "А потому — спешите же к Аллаху,А я, поистине, — к вам увещательясный от Него.",
                            "verse 51:51": "И в поклонении ЕмуДругих божеств не измышляйте.",
                            "verse 51:52": "Ведь ни один посланник и до нихК другим народам не пришел,Чтобы они ему не говорили:«Колдун иль одержимый (ты)!»",
                            "verse 51:53": "Является ль сие преданьем,Что ими друг от друга завещалось?Но нет! Ведь они сами все пределыперешли.",
                            "verse 51:54": "Является ль сие преданьем,Что ими друг от друга завещалось?Но нет! Ведь они сами все пределыперешли.",
                            "verse 51:55": "И проповедуй (весть свою), —Ведь будет проповедь твоя на помощьправоверным.",
                            "verse 51:56": "Я создал джиннов и людейЛишь для того, чтоб Мне они служили.",
                            "verse 51:57": "От них надела никакого Я не жду,От них и пищи не прошу Я,(Чтоб прокормить всех тех,кто в услуженье Мне).",
                            "verse 51:58": "Ведь лишь Аллах — податель всехщедрот,Хранитель мощи,Нерушимый (на века).",
                            "verse 51:59": "Для грешников, поистине, их доля(наказанья)Подобна доле ранних братьевпо греху, —А потому Меня не торопите(О предъявлении сей доли).",
                            "verse 51:60": "И горе всем невернымОт Дня того, что Им обещан был! доли)."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "¡Por los que aventan!",
                            "verse 51:2": "¡Por las que llevan una carga!",
                            "verse 51:3": "¡Por las que se deslizan ligeras!",
                            "verse 51:4": "¡Por los que distribuyen una orden!",
                            "verse 51:5": "¡Ciertamente, aquello con que se os amenaza es verdad!",
                            "verse 51:6": "Y el Juicio, sí, tendrá lugar.",
                            "verse 51:7": "¡Por el cielo surcado de órbitas!",
                            "verse 51:8": "Estáis en desacuerdo.",
                            "verse 51:9": "Algunos son desviados de él.",
                            "verse 51:10": "¡Malditos sean los que siempre están conjeturando,",
                            "verse 51:11": "que están en un abismo, despreocupados,",
                            "verse 51:12": "que preguntan: «¿Cuándo llegará el día del Juicio?»!",
                            "verse 51:13": "El día que se les pruebe al fuego:",
                            "verse 51:14": "«¡Gustad vuestra prueba! Esto es lo que estabais impacientes por conocer».",
                            "verse 51:15": "Los que temen a Alá estarán entre jardines y fuentes,",
                            "verse 51:16": "tomando lo que su Señor les dé.",
                            "verse 51:17": "de noche dormían poco;",
                            "verse 51:18": "al rayar el alba, pedían perdón,",
                            "verse 51:19": "y parte de sus bienes correspondía de derecho al mendigo y al indigente.",
                            "verse 51:20": "En la tierra hay signos para los convencidos,",
                            "verse 51:21": "y en vosotros mismos también.",
                            "verse 51:22": "Y en el cielo tenéis vuestro sustento y lo que se os ha prometido.",
                            "verse 51:23": "¡Por el Señor del cielo y de la tierra, que es tanta verdad como que habláis!",
                            "verse 51:24": "¿Te has enterado de la historia de los huéspedes honrados de Abraham?",
                            "verse 51:25": "Cuando entraron en su casa.",
                            "verse 51:26": "Se fue discretamente a los suyos y trajo un ternero cebado,",
                            "verse 51:27": "que les ofreció.",
                            "verse 51:28": "Y sintió temor de ellos.",
                            "verse 51:29": "Su mujer, entonces, se puso a gritar.",
                            "verse 51:30": "Dijeron: «Así ha dicho tu Señor.",
                            "verse 51:31": "Dijo: «¿Qué es lo que os trae, ¡enviados!?»",
                            "verse 51:32": "Dijeron: «Se nos ha enviado a un pueblo pecador",
                            "verse 51:33": "para enviar contra ellos piedras de barro cocido,",
                            "verse 51:34": "marcadas junto a tu Señor para los inmoderados».",
                            "verse 51:35": "Y sacamos a los creyentes que en ella había,",
                            "verse 51:36": "pero sólo encontramos en ella una casa de gente sometida a Alá.",
                            "verse 51:37": "Y dejamos en ella un signo para los que temen el castigo doloroso.",
                            "verse 51:38": "Y en Moisés.",
                            "verse 51:39": "Pero, seguro de su poder, se volvió y dijo: «¡Es un mago o un poseso!»",
                            "verse 51:40": "Entonces les sorprendimos, a él y a sus tropas, y los arrojamos al mar.",
                            "verse 51:41": "Y en los aditas.",
                            "verse 51:42": "que pulverizaba todo cuanto encontraba a su paso.",
                            "verse 51:43": "Y en los tamudeos.",
                            "verse 51:44": "Pero infringieron la orden de su Señor y les sorprendió el Rayo, viéndolo venir.",
                            "verse 51:45": "No pudieron tenerse en pie, ni defenderse.",
                            "verse 51:46": "Y al pueblo de Noé.",
                            "verse 51:47": "Y el cielo, lo construimos con fuerza.",
                            "verse 51:48": "Y la tierra, la extendimos.",
                            "verse 51:49": "Todo lo creamos por parejas.",
                            "verse 51:50": "«¡Refugiaos, pues, en Alá! Soy para vosotros, de Su parte, un monitor que habla claro.",
                            "verse 51:51": "¡No pongáis a otro dios junto con Alá! Soy para vosotros, de Su parte, un monitor que habla claro».",
                            "verse 51:52": "Asimismo, no vino a los que fueron antes ningún enviado que no dijeran: «¡Es un mago o un poseso!»",
                            "verse 51:53": "¿Es que se han legado eso unos a otros? ¡No! ¡Son gente rebelde!",
                            "verse 51:54": "¡Apártate de ellos y, así, no incurrirás en censura!",
                            "verse 51:55": "¡Y amonesta, que la amonestación aprovecha a los creyentes!",
                            "verse 51:56": "No he creado a los genios y a los hombres sino para que Me sirvan.",
                            "verse 51:57": "No quiero de ellos ningún sustento, no quiero que Me alimenten.",
                            "verse 51:58": "Alá es el Proveedor de todo, el Fuerte, el Firme.",
                            "verse 51:59": "Los impíos correrán la misma suerte que corrieron sus semejantes.",
                            "verse 51:60": "¡Ay de los que no creen, por el día con que se les amenaza!"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "(புழுதிகளை எழுப்பி) நன்கு பரத்தும் (காற்றுகள்) மீது சத்தியமாக!",
                            "verse 51:2": "(மழைச்)சுமையைச் சுமந்து செல்பவற்றின் மீதும்,",
                            "verse 51:3": "பின்னர் (கடலில்) இலேசாகச் செல்பவற்றின் மீதும்,",
                            "verse 51:4": "(பூமியிலுள்ளோருக்கு விதியானவற்றை அல்லாஹ்வின்) கட்டளைப்படி பங்கிடுவோர் மீதும் சத்தியமாக",
                            "verse 51:5": "நிச்சயமாக நீங்கள் வாக்களிக்கப் படுவதெல்லாம் உண்மையேயாகும்.",
                            "verse 51:6": "அன்றியும், (நன்மை, தீமைக்குரிய) கூலி வழங்குவதும் நிச்சயமாக நிகழ்வதேயாகும்.",
                            "verse 51:7": "அழகு நிரம்பிய வானத்தின் மீது சத்தியமாக!",
                            "verse 51:8": "நீங்கள் (குர்ஆனைப் பற்றி) முரண்பட்ட பேச்சிலேயே இருக்கின்றீர்கள்.",
                            "verse 51:9": "அ(வ் வேதத்)திலிருந்து திருப்பப்பட்டவன் (இப்பொழுதும்) திருப்பப்படுகிறான்.",
                            "verse 51:10": "பொய் சொல்பவர்கள் அழிந்தே போவார்கள்.",
                            "verse 51:11": "வர்கள் எத்தகையோரென்றால் மடமையினால் மறதியில் இருக்கின்றனர்.",
                            "verse 51:12": "(நன்மை, தீமைக்குக்) \"கூலி கொடுக்கும் நாள் எப்போது வரும்?\" என்று அவர்கள் கேட்கின்றனர்.",
                            "verse 51:13": "நெருப்பிலே அவர்கள் சோதிக்கப்படும் நாளாகும் அது (என்று நபியே! நீர் கூறும்).",
                            "verse 51:14": "\"உங்களுடைய சோதனையைச் சுவைத்துப் பாருங்கள்,\" எதனை நீங்கள் அவசரப்படுத்திக் கொண்டிருந்தீர்களோ, இதுதான்.",
                            "verse 51:15": "நிச்சயமாக பயபக்தியுடையவர்கள், (சுவர்க்கத்தின்) சோலைகளிலும், நீரூற்றுகளிலும் இருப்பார்கள்.",
                            "verse 51:16": "அவர்கள் தங்களிறைவன் அவர்களுக்கு அளித்ததை (திருப்தியுடன்) பெற்றுக் கொள்வார்கள்; நிச்சயமாக அவர்கள் இதற்கு முன்னர் நன்மை செய்வோராகவே இருந்தனர்.",
                            "verse 51:17": "அவர்கள் இரவில் மிகவும் சொற்ப நேரமேயன்றித் தூங்கமாட்டார்கள்.",
                            "verse 51:18": "அவர்கள் விடியற் காலங்களில் (பிரார்த்தனைகளின் போது இறைவனிடம்) மன்னிப்புக் கோரிக் கொண்டிருப்பார்கள்.",
                            "verse 51:19": "அவர்களுடைய செல்வத்தில் இரப்போருக்கும், வசதியற்றோருக்கும் பாத்தியதை உண்டு.",
                            "verse 51:20": "உறுதியாக நம்பிக்கை கொண்டவர்களுக்கு பூமியில் (பல) அத்தாட்சிகள் இருக்கின்றன.",
                            "verse 51:21": "உங்களுக்குள்ளேயும் (பல) அத்தாட்சிகள் இருக்கின்றன, (அவற்றை) நீங்கள் உற்று நோக்க வேண்டாமா?",
                            "verse 51:22": "அன்றியும் வானத்தில் உங்கள் உணவும், (மற்றும்) நீங்கள் வாக்களிக்கப் பட்டவையும் இருக்கின்றன.",
                            "verse 51:23": "ஆகவே, வானங்கள், பூமி ஆகியவற்றின் இறைவன் மீது ஆணையாக! நீங்கள் பேசிக் கொண்டிருப்பது உங்கள் வார்த்தையாக இருப்பது போன்று இது பிரத்தியட்சமான உண்மையாகும்.",
                            "verse 51:24": "இப்றாஹீமின் கண்ணியம் மிக்க விருந்தினர்களின் செய்தி உமக்கு வந்ததா?",
                            "verse 51:25": "அவர்கள், அவரிடம் பிரவேசித்த போது, (அவரை நோக்கி; \"உங்களுக்கு) \"ஸலாம்' என்று கூறினார்கள்; (அதற்கவர்), \"(உங்களுக்கு) \"ஸலாம்\" என்று கூறினார்.",
                            "verse 51:26": "எனினும் அவர் தம் குடும்பத்தாரிடம் விரைந்து சென்று, ஒரு கொழுத்த காளைக் கன்றை(ப் பொறித்துக்) கொண்டு வந்தார்.",
                            "verse 51:27": "அதை அவர்கள் முன் வைத்து, \"நீங்கள் புசிக்க மாட்டீர்களா?\" என்று கூறினார்.",
                            "verse 51:28": "(அவர்கள் அதைப் புசிக்காததால்,) அவருக்கு இவர்களைப் பற்றி உள்ளூர ஓர் அச்சம் ஏற்படடது, \"(இதனை அறிந்த) அவர்கள், பயப்படாதீர்!\" எனக் கூறினார்; அன்றியும், அவருக்கு அறிவு மிக்க புதல்வர் (பிறப்பார்) என்று நன்மாராயங் கூறினர்.",
                            "verse 51:29": "பின்னர் இதைக்கேட்ட அவருடைய மனைவியார் சப்தமிட்டவராக (அவர்கள்) எதிரில் வந்து, தம் முகத்தில் அடித்துக் கொண்டு \"நான் மலட்டுக் கிழவியாயிற்றே!\" என்று கூறினார்.",
                            "verse 51:30": "(அறிவு மிக்க புதல்வர் பிறப்பார் என்று;) \"இவ்வாறே உம் இறைவன் கூறினான், நிச்சயமாக அவன் ஞானம் மிக்கவன்; (யாவற்றையும்,) நன்கறிந்தவன்\" என்று கூறினார்கள்.",
                            "verse 51:31": "(பின்னர் இப்றாஹீம்;) \"தூதர்களே! உங்களுடைய காரியம் என்ன?\" என்று வினவினார்.",
                            "verse 51:32": "\"குற்றவாளிகளான ஒரு சமூகத்தினர் பால் நாங்கள் நிச்சயமாக அனுப்பப்பட்டிருக்கிறோம்\" என்று அவர்கள் கூறினார்கள்.",
                            "verse 51:33": "\"அவர்கள் மீது (சுட்ட) களிமண் கற்களை எறிவதற்காக (நாங்கள் அனுப்பப்பட்டுள்ளோம்)-",
                            "verse 51:34": "\"வரம்பு மீறியவர்களுக்காக உங்கள் இறைவனிடம் (அக்கற்கள்) அடையாள மிடப்பட்டவை.",
                            "verse 51:35": "ஆகவே அவ்வூரில் இருந்த முஃமின்களை (முதலில்) நாம் வெளியேற்றி விட்டோம்.",
                            "verse 51:36": "எனவே, அதில் முஸ்லிம்களிலிருந்து ஒரு வீட்டாரைத் தவிர, ஒருவரையும் நாம் காணவில்லை.",
                            "verse 51:37": "நோவினை தரும் வேதனையை அஞசுகிறார்களே அவர்களுக்கு நாம் இதில் ஓர் அத்தாட்சிளை விட்டு வைத்தோம்.",
                            "verse 51:38": "மலும், மூஸாவி(ன் வரலாற்றி)லும் ஓர் அத்தாட்சி இருக்கிறது நாம் அவரைத் தெளிவான ஆதாரத்துடன் ஃபிர்அவ்னிடத்தில் அனுப்பிய போது",
                            "verse 51:39": "அவன் தன் (ஆட்சி, செல்வம், படைகள் ஆகியவற்றின்) வல்லமையின் காரணமாக (அவரைப்) புறக்கணித்து; \"இவர் ஒரு சூனியக்காரர், அல்லது பைத்தியக்காரர்\" என்று கூறினான்.",
                            "verse 51:40": "ஆகவே, நாம் அவனையும், அவனுடைய படைகளையும் பிடித்து அவர்களைக் கடலில் எறிந்தோம்; அவன் நிந்தனைக்கும் ஆளாகி விட்டான்.",
                            "verse 51:41": "இன்னும், 'ஆது' (சமூகத்தாரிலும் ஒரு படிப்பினை இருக்கிறது); நாம் அவர்கள் மீது (நாசம் விளைவிக்கக் கூடிய) மலட்டுக் காற்றை அனுப்பியN போது",
                            "verse 51:42": "(க்காற்றான)து தன் எதிரில் பட்டதையெல்லாம் தூள் தூளாக்காமல் விடவில்லை.",
                            "verse 51:43": "மேலும் 'ஸமூது' (சமூகத்தாரிலும் ஒரு படிப்பினை இருக்கிறது); \"ஒரு காலம் சுகம் அனுபவியுங்கள்\" என்று அவர்களுக்குக் கூறப்பட்டபோது",
                            "verse 51:44": "அவர்கள் தங்கள் இறைவனுடைய கடடளையை மீறினார்கள்; அவர்கள் பார்த்துக் கொண்டிருக்கும் நிலையிலேயே (நில நடுக்கம் பேரிடி போன்ற) பயங்கரமான பெரும் சப்தம் அவர்களைப் பிடித்துக் கொண்டது.",
                            "verse 51:45": "ஆகவே, அவர்கள் நிற்கவும் சக்தி பெற்றார்களில்லை (எத்தகைய) உதவியும் பெற்றுக் கொள்ள முடியாதவர்களா(க மடிந்து) போயினர்.",
                            "verse 51:46": "அன்றியும், இவர்களுக்கு முன்னால் நூஹுடைய சமூகத்தாரையும் (நினைவூட்டுவீராக); நிச்சயமாக அவர்கள் பாவம் செய்யும் சமூகத்தாராகவே இருந்தார்கள்.",
                            "verse 51:47": "மேலும், நாம் வானத்தை (நம்) சக்திகளைக் கொண்டு அமைத்தோம்; நிச்சயமாக நாம் விரிவாற்றலுடையவராவோம்.",
                            "verse 51:48": "இன்னும், பூமியை - நாம் அதனை விரித்தோம்; எனவே, இவ்வாறு விரிப்பவர்களில் நாமே மேம்பாடுடையோம்.",
                            "verse 51:49": "நீங்கள் சிந்தித்து நல்லுணர்வு பெறுவதற்காக ஒவ்வொரு பொருளையும் ஜோடி ஜோடியாக நாம் படைத்தோம்.",
                            "verse 51:50": "ஆகவே, அல்லாஹ்வின் பக்கம் விரைந்து செல்லுங்கள்; நிச்சயமாக, நான் அவனிடமிருந்து உங்களுக்குத் தெளிவாக அச்சமூட்டி எச்சரிக்கை செய்பவனாகவே இருக்கின்றேன் (என்று நபியே! நீர் கூறுவீராக).",
                            "verse 51:51": "மேலும், அல்லாஹ்வுடன் வேறு நாயனை (இணையாக) ஆக்காதீர்கள்; நிச்சயமாக, நான் அவனிடமிருந்து உங்களுக்குத் தெளிவாக அச்சமூட்டி எச்சரிக்கை செய்பவனாகவே - இருக்கின்றேன் (என்றும் கூறும்).",
                            "verse 51:52": "இவ்வாறே, இவர்களுக்கு முன்னிருந்தவர்களிடம் (நம்) தூதர்களிலிருந்து ஒருவர் வரும் போதெல்லாம், அவர்கள் (அவரை) சூனியக்காரர், அல்லது பைத்தியக்காரர் என்று கூறாமல் இருந்ததில்லை.",
                            "verse 51:53": "இவ்வாறுதான் அவர்கள் தங்களுக்குள் (நம் தூதர்களைப் பழிக்க வேண்டுமென) ஒருவருக்கொருவர் உபதேசம் செய்து கொண்டனரா? அன்று, அவர்கள் அக்கிரமக்கார சமூகத்தாராகவே இருந்தனர்.",
                            "verse 51:54": "ஆகவே (நபியே!) நீர் அவர்களைப் புறக்கணித்து (விலகி) விடும்; (அப்படி நீர் விலகிவிடுவீராயின் அதற்காக) நீர் பழிக்கப்படமாட்டீர்.",
                            "verse 51:55": "மேலும், நீர் நல்லுபதேசம் செய்வீராக! ஏனெனில், நிச்சயமாக நல்லுபதேசம் முஃமின்களுக்கு நற்பயனளிக்கும்.",
                            "verse 51:56": "இன்னும், ஜின்களையும், மனிதர்களையும் அவர்கள் என்னை வணங்குவதற்காகவேயன்றி நான் படைக்கவில்லை.",
                            "verse 51:57": "அவர்களிடமிருந்து எந்த பொருளையும் நான் விரும்பவில்லை.",
                            "verse 51:58": "நிச்சயமாக அல்லாஹ்தான் உணவு அளித்துக் கொண்டிருப்பவன்; பலம் மிக்கவன்; உறுதியானவன்.",
                            "verse 51:59": "எனவே, அநியாயம் செய்து கொண்டிருப்போருக்கு, அவர்களுடைய தோழர்களுக்கு வேதனையிலிருந்து ஒரு பங்கு இருந்தது போல், ஒரு பங்கு நிச்சயமாக உண்டு ஆகவே, (தண்டனைக்காக) அவர்கள் என்னை அவசரப்படுத்த வேண்டாம்.",
                            "verse 51:60": "ஆகவே, காஃபிர்களுக்கு அவர்களுக்கு வாக்களிக்கப்பட்ட அவர்களுடைய நாளில், கேடுதான்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "ขอสาบานต่อลมที่พัด (ฝุ่นให้) กระจัดกระจายอย่างปลิวว่อน",
                            "verse 51:2": "ขอสาบานต่อเมฆที่พยุง (ฝน) อย่างหนัก",
                            "verse 51:3": "ขอสาบานต่อนาวา ที่แล่นไปอย่างสะดวกสบาย",
                            "verse 51:4": "ขอสาบานต่อมลาอิกะฮ์:ผู้จัดสรรการงาน",
                            "verse 51:5": "แท้จริงสิ่งที่พวกเจ้าถูกสัญญาไว้นั้นเป็นความจริงอย่างแน่นอน",
                            "verse 51:6": "และแท้จริงการตอบแทนจะเกิดขึ้นอย่างแน่นอน",
                            "verse 51:7": "ขอสาบานต่อฟากฟ้าที่มีวิถีทางโคจรอย่างมากมาย",
                            "verse 51:8": "แท้จริงพวกเจ้าอยู่ในคำพูดที่ขัดแย้งกัน",
                            "verse 51:9": "ผู้ที่หันเหออกจากสัจธรรมนั้นเขาจะถูกให้หันเหออกจากการศรัทธา",
                            "verse 51:10": "ผู้ที่กล่าวเท็จแก่ท่านนบี จะถูกสาปแช่ง",
                            "verse 51:11": "คือบรรดาผู้ที่พวกเขาอยู่ในการสับสนหลงลืม (เรื่องของวันอาคิเราะฮ์)",
                            "verse 51:12": "พวกเขาจะถามว่า วันแห่งการตอบแทนจะมีขึ้นเมื่อใด?",
                            "verse 51:13": "วันที่พวกเขาจะถูกทดสอบ ด้วยไฟนรก",
                            "verse 51:14": "พวกเจ้าจงลิ้มรสการทดสอบของพวกเจ้าเถิด นี่คือสิ่งที่พวกเจ้าเร่งเร้ามัน",
                            "verse 51:15": "แท้จริงบรรดาผู้ยำเกรงจะได้อยู่ในสวนสวรรค์มากหลาย และตาน้ำพุ",
                            "verse 51:16": "พวกเขาปิติยินดีในสิ่งที่พระเจ้าของพวกเขาได้ประทานให้แก่พวกเขา แท้จริงพวกเขาก่อนหน้านั้นเป็นผู้กระทำความดี",
                            "verse 51:17": "พวกเขาเคยหลับนอนแต่เพียงส่วนน้อยของเวลากลางคืน",
                            "verse 51:18": "และในยามรุ่งสางพวกเขาขออภัยโทษ (ต่อพระองค์)",
                            "verse 51:19": "และในทรัพย์สมบัติของพวกเขาจัดไว้เป็นส่วนของผู้เอ่ยขอ และผู้ไม่เอ่ยขอ",
                            "verse 51:20": "และในแผ่นดินนี้มีสัญญาณต่าง ๆ สำหรับผู้ศรัทธาเชื่อมั่น",
                            "verse 51:21": "และในตัวของพวกเจ้าเอง พวกเจ้าไม่เห็นดอกหรือ?",
                            "verse 51:22": "และในฟากฟ้ามีปัจจัยยังชีพของพวกเจ้า และสิ่งที่พวกเจ้าถูกสัญญาไว้",
                            "verse 51:23": "ดังนั้น จึงขอสาบานต่อพระเจ้าแห่งชั้นฟ้า และแผ่นดินนี้ว่า แท้จริง (สิ่งที่ถูกสัญญาไว้นั้น) เป็นความจริงอย่างแน่นอน เสมือนกับที่พวกเจ้าสนทนากัน",
                            "verse 51:24": "เรื่องราวของแขกผู้มีเกียรติของอิบรอฮีมได้มาถึงเจ้าบ้างไหม?",
                            "verse 51:25": "เมื่อพวกเขาได้เข้ามาหาเขา (อิบรอฮีม) พวกเขากล่าวว่า ศานติ เขากล่าวว่า (ตอบ) ว่าศานติ (พวกท่านเป็น) หมู่ชนผู้แปลกหน้า",
                            "verse 51:26": "แล้วเขาก็รีบเข้าไปหาครอบครัวของเขา แล้วได้นำลูกวัวอ้วน (ซึ่งย่างเสร็จแล้ว) ออกมา",
                            "verse 51:27": "และได้วางมันไว้ข้างหน้าพวกเขา เขากล่าวว่า พวกท่านไม่กินหรือ?",
                            "verse 51:28": "(เมื่อพวกเขาไม่กินอาหาร) ดังนั้น เขารู้สึกกลัวพวกเขา พวกเขากล่าวว่า อย่ากลัวเลยและได้แจ้งข่าวดีแก่เขาเกี่ยวกับลูกคนหนึ่งที่มีความรู้",
                            "verse 51:29": "แล้วภริยาของเขาก็ได้ออกมาตะโกนพลางตบหน้าของนาง แล้วกล่าวว่า หญิงแก่เป็นหมัน",
                            "verse 51:30": "พวกเขากล่าวว่า เช่นนั้นแหละพระเจ้าของเธอได้ตรัสไว้เช่นนั้น แท้จริงพระองค์เป็นผู้ทรงปรีชาญาณ ผู้ทรงรอบรู้เสมอ",
                            "verse 51:31": "เขากล่าวว่า ดังนั้นความมุ่งหมายของพวกท่านคืออะไรเล่า โอ้บรรดาทูตเอ๋ย?",
                            "verse 51:32": "พวกเขากล่าวว่า แท้จริงเราถูกส่งมายังหมู่ชน ผู้กระทำผิด",
                            "verse 51:33": "เพื่อเราจะได้โยนก้อนหินทำด้วยดินเหนียวแข็งลงบนพวกเขา",
                            "verse 51:34": "ถูกตราเป็นเครื่องหมายไว้แล้ว ณ ที่พระเจ้าของเจ้าสำหรับพวกที่ละเมิดขอบเขต",
                            "verse 51:35": "ดังนั้น เราได้นำผู้ที่อยู่ในเมืองนั้นจากหมู่ ผู้ศรัทธาออกมาให้พ้น",
                            "verse 51:36": "และเราไม่พบผู้ใดในเมืองนั้น นอกจากบ้านหลังหนึ่งของปวงผู้นอบน้อม",
                            "verse 51:37": "และเราได้เหลือสัญญาณหนึ่งไว้ สำหรับบรรดาผู้ที่กลัวต่อการลงโทษอันเจ็บปวด",
                            "verse 51:38": "และในเรื่องของมูซา เมื่อเราส่งเขาไปยังฟิร เอาน:พร้อมด้วยหลักฐานอันชัดแจ้ง",
                            "verse 51:39": "แต่ฟิรเอาน์ได้ผินหลังออกไปพร้อมกับบริวารของเขา แล้วกล่าว (ถึงการทำหน้าที่ของมูซา) ว่า นักเล่นกลหรือคนบ้า",
                            "verse 51:40": "ดังนั้น เราได้เอาเขามา และไพร่พลของเขา แล้วเราได้โยนพวกเขาลงไปในทะเลและตัวเขาก็ถูกประณาม",
                            "verse 51:41": "และในเรื่องของอ๊าด เมื่อเราได้ส่งลมพายุที่ทำลายล้างมายังพวกเขา",
                            "verse 51:42": "มันมิได้เหลืออะไรทิ้งไว้เลย เมื่อมันได้พัดกระหน่ำมา นอกจากนี้จะทำให้สิ่งนั้นพินาศย่อยยับ",
                            "verse 51:43": "และในเรื่องของษะมูด เมื่อมีผู้กล่าวแก่พวกเขาว่า พวกท่านจงสนุกร่าเริงไปชั่วขณะหนึ่งเถิด",
                            "verse 51:44": "แต่พวกเขาได้ท้าทายโอหังต่อพระบัญชาของพระเจ้าของพวกเขา ดังนั้นเสียงกัมปนาทก็ได้คร่าชีวิตพวกเขาขณะที่พวกเขาจ้องมองดูอยู่",
                            "verse 51:45": "แล้วพวกเขาไม่สามารถจะลุกขึ้นยืนได้ และพวกเขาก็ไม่สามารถช่วยเหลือตัวเองได้",
                            "verse 51:46": "และหมู่ชนของนูหก่อนหน้านี้ แท้จริงพวกเขาเป็นหมู่ชนที่ฝ่าฝืน",
                            "verse 51:47": "และชั้นฟ้า เราได้สร้างมันด้วยพระหัตถ์ของเรา และแท้จริงเราได้แผ่ให้กว้างไพศาล",
                            "verse 51:48": "และแผ่นดินนั้น เราได้แผ่ขยายมันออกไป ดังนั้นเราเป็นผู้แผ่ขยายที่ยอดเยี่ยม",
                            "verse 51:49": "และจากทุก ๆ สิ่งนั้น เราได้สร้าง (มัน) ขึ้นเป็นคู่ ๆ เพื่อพวกเจ้าจะได้ใคร่ครวญ",
                            "verse 51:50": "ดังนั้นพวกท่านจงเร่งรีบไปหาอัลลอฮ์แท้จริง ฉันเป็นผู้ตักเตือนอย่างเปิดเผยจากพระองค์แก่พวกท่าน",
                            "verse 51:51": "และพวกท่านอย่าตั้งพระเจ้าอื่นใดเป็นภาคีกับอัลลอฮ์แท้จริง ฉันเป็นผู้ตักเตือนอย่างเปิดเผยจากพระองค์แก่พวกท่าน",
                            "verse 51:52": "เช่นนั้นแหละ ไม่มีร่อซู้ลคนใดมายังบรรดา (หมู่ชน) ก่อนหน้าพวกเขา เว้นแต่พวกเขากล่าวว่าเป็นนักเล่นกลหรือคนบ้า",
                            "verse 51:53": "พวกเขาได้สั่งเสียในเรื่องนี้แก่กันกระนั้นหรือ? เปล่าเลย! แต่ว่าพวกเขาเป็นหมู่ชนผู้ละเมิดเกินขอบเขต",
                            "verse 51:54": "ดังนั้น เจ้าจงผินหลังออกจากพวกเขาเถิด แล้ว เจ้าจะไม่เป็นผู้ถูกตำหนิ",
                            "verse 51:55": "และจงตักเตือนเถิด เพราะแท้จริงการตักเตือนนั้นจะให้ประโยชน์แก่บรรดาผู้ศรัทธา",
                            "verse 51:56": "และข้ามิได้สร้างญิน และมนุษย์เพื่ออื่นใด เว้นแต่เพื่อเคารพภักดีต่อข้า",
                            "verse 51:57": "ข้าไม่ต้องการปัจจัยยังชีพจากพวกเขา และข้าก็ไม่ต้องการให้พวกเขาให้อาหารแก่ข้า",
                            "verse 51:58": "แท้จริงอัลลอฮ์ คือผู้ประทานปัจจัยยังชีพอันมากหลาย ผู้ทรงพลัง ผู้ทรงมั่นคง",
                            "verse 51:59": "ดังนั้นแท้จริง สำหรับบรรดาผู้ประพฤติผิดนั้น เขาจะได้รับส่วนของการลงโทษเยี่ยงส่วนการลงโทษพวกเพื่อน ๆ ของพวกเขา ดังนั้นพวกเขาอย่าได้รีบเร่งให้ข้า (ลงโทษ) เลย",
                            "verse 51:60": "ดังนั้น ความหายนะจะประสบแด่ บรรดาผู้ปฏิเสธศรัทธาในวันของพวกเขาซึ่ง ได้ถูกสัญญาไว้"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "Tozdurup savuranlara,",
                            "verse 51:2": "Yükünü",
                            "verse 51:3": "yüklenenlere,",
                            "verse 51:4": "Kolayca",
                            "verse 51:5": "süzülenlere,",
                            "verse 51:6": "İşleri",
                            "verse 51:7": "ayıranlara andolsun ki,",
                            "verse 51:8": "Size",
                            "verse 51:9": "vâdedilen, kesinlikle doğrudur.",
                            "verse 51:10": "Ve",
                            "verse 51:11": "ceza mutlaka vuku bulacaktır.",
                            "verse 51:12": "İçinde yörüngeleri olan göğe andolsun ki,",
                            "verse 51:13": "Siz",
                            "verse 51:14": "çelişkili sözler söylüyorsunuz.",
                            "verse 51:15": "Ondan",
                            "verse 51:16": "(Kur'an'dan veya imandan) dönen döndürülür (engellenmez).",
                            "verse 51:17": "Kahrolsun o koyu yalancılar!",
                            "verse 51:18": "Onlar koyu bir cehalet içerisinde kalmış gafillerdir.",
                            "verse 51:19": "Ceza gününün ne zaman olduğunu sorarlar.",
                            "verse 51:20": "O gün onlar ateşe sokulacaklardır.",
                            "verse 51:21": "Azabınızı tadın! Acele gelmesini beklediğiniz şey budur işte! (denir.",
                            "verse 51:22": "Şüphesiz ki Allah'a isyandan sakınanlar, cennetlerde ve pınar başlarında bulunacaklar.",
                            "verse 51:23": "Rablerinin kendilerine verdiğini alarak .",
                            "verse 51:24": "Geceleri pek az uyurlardı.",
                            "verse 51:25": "Seher vakitlerinde de istiğfar ederlerdi.",
                            "verse 51:26": "Mallarında, muhtaç ve yoksullar için bir hak vardı.",
                            "verse 51:27": "Kesin olarak inananlar için yeryüzünde âyetler vardır.",
                            "verse 51:28": "Kendi nefislerinizde de öyle.",
                            "verse 51:29": "Semada da rızkınız ve size vâdedilen başka şeyler vardır.",
                            "verse 51:30": "Göğün ve yerin Rabbine andolsun ki bu vaad, sizin konuşmanız gibi kesin ve gerçektir.",
                            "verse 51:31": "İbrahim'in ağırlanan misafirlerinin haberi sana geldi mi? (Bunlar meleklerdi.",
                            "verse 51:32": "Onlar İbrahim'in yanına girmişler, selam vermişlerdi.",
                            "verse 51:33": "Hemen ailesinin yanına giderek semiz bir dana (kebabını) getirmiş,",
                            "verse 51:34": "Onların önüne koyup \"Yemez misiniz?\" demişti.",
                            "verse 51:35": "Derken onlardan korkmaya başladı.",
                            "verse 51:36": "Karısı çığlık atarak geldi.",
                            "verse 51:37": "Onlar: \"Bu böyledir.",
                            "verse 51:38": "(İbrahim:) O halde işiniz nedir, ey elçiler? dedi.",
                            "verse 51:39": "\"Biz, dediler, suçlu bir kavme gönderildik.",
                            "verse 51:40": "\"Üzerlerine çamurdan taş yağdırmaya (geldik).",
                            "verse 51:41": "(Bu taşlar,) aşırı gidenler için Rabbinin katında işaretlenmiş (taşlardır).",
                            "verse 51:42": "Bunun üzerine orada bulunan müminleri çıkardık.",
                            "verse 51:43": "Zaten orada müslümanlardan, bir ev halkından başka kimse bulmadık.",
                            "verse 51:44": "Acı azaptan korkanlar için orada bir işaret bıraktık.",
                            "verse 51:45": "Musa'da da (ibretler vardır).",
                            "verse 51:46": "Firavun ordusuyla birlikte yüz çevirmiş: \"O, bir büyücüdür veya bir delidir\" demişti.",
                            "verse 51:47": "Nihayet onu da ordularını da yakalayıp denize attık, bu sırada kendini kınayıp duruyordu.",
                            "verse 51:48": "Ad kavminde de (ibretler vardır).",
                            "verse 51:49": "Üzerinden geçtiği şeyi canlı bırakmıyor, onu kül edip savuruyordu.",
                            "verse 51:50": "Semûd kavminde de (ibretler vardır).",
                            "verse 51:51": "Rablerinin emrine karşı geldiler.",
                            "verse 51:52": "Ayağa kalkacak güçleri kalmamış, yardım edenleri de olmamıştı.",
                            "verse 51:53": "Bunlardan önce de Nuh kavmini helâk etmiştik.",
                            "verse 51:54": "Göğü kendi ellerimizle biz kurduk ve biz (onu) elbette genişleticiyiz.",
                            "verse 51:55": "Yeri de döşedik.",
                            "verse 51:56": "Her şeyden de çift çift yarattık ki, düşünüp öğüt alasınız.",
                            "verse 51:57": "O halde Allah'a koşun.",
                            "verse 51:58": "Allah ile beraber başka bir tanrı edinmeyin.",
                            "verse 51:59": "İşte böylece, onlardan öncekilere her hangi bir peygamber geldiğinde hemen: O, bir büyücüdür veya delidir, dediler.",
                            "verse 51:60": "Bunu (nesilden nesile) birbirlerine vasiyet mi ettiler? Doğrusu onlar azgın bir topluluktur.",
                            "verse 51:61": "Artık onlara aldırma.",
                            "verse 51:62": "Sen yine de öğüt ver.",
                            "verse 51:63": "Ben cinleri ve insanları, ancak bana kulluk etsinler diye yarattım.",
                            "verse 51:64": "Ben onlardan rızık istemiyorum.",
                            "verse 51:65": "Şüphesiz rızık veren, güç ve kuvvet sahibi olan ancak Allah'tır.",
                            "verse 51:66": "Muhakkak ki bu zulmedenlerin de, geçmişlerinin payı gibi (azaptan) bir payları vardır! O halde acele etmesinler!",
                            "verse 51:67": "Başlarına gelecek (acı) günlerinden dolayı vay o kafirlerin haline! etmesinler!"
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "بکھیرنے والیوں کی قسم جو اُڑا کر بکھیر دیتی ہیں",
                            "verse 51:2": "اُڑا کر بکھير دينے والي ہواؤں کي قَسمo",
                            "verse 51:3": "اور (پاني کا) بارِ گراں اٹھانے والي بدليوں کي قَسمo",
                            "verse 51:4": "پھر (پانی کا) بوجھ اٹھاتی ہیں",
                            "verse 51:5": "پھر آہستہ آہستہ چلتی ہیں",
                            "verse 51:6": "اور خراماں خراماں چلنے والي کشتيوں کي قَسمo",
                            "verse 51:7": "اور کام تقسيم کرنے والے فرشتوں کي قَسمo",
                            "verse 51:8": "پھر چیزیں تقسیم کرتی ہیں",
                            "verse 51:9": "کہ جس چیز کا تم سے وعدہ کیا جاتا ہے وہ سچا ہے",
                            "verse 51:10": "بيشک (آخرت کا) جو وعدہ تم سے کيا جا رہا ہے بالکل سچا ہےo",
                            "verse 51:11": "اور بيشک (اعمال کي) جزا و سزا ضرور واقع ہو کر رہے گيo",
                            "verse 51:12": "اور انصاف (کا دن) ضرور واقع ہوگا",
                            "verse 51:13": "اور آسمان کی قسم جس میں رسے ہیں",
                            "verse 51:14": "اور (ستاروں اور سيّاروں کي) کہکشاؤں اور گزرگاہوں والے آسمان کي قَسمo",
                            "verse 51:15": "بيشک تم مختلف بے جوڑ باتوں ميں (پڑے) ہوo",
                            "verse 51:16": "کہ (اے اہل مکہ) تم ایک متناقض بات میں (پڑے ہوئے) ہو",
                            "verse 51:17": "اس سے وہی پھرتا ہے جو (خدا کی طرف سے) پھیرا جائے",
                            "verse 51:18": "اِس (رسول صلي اللہ عليہ وآلہ وسلم اور قرآن سے) وہي پھرتا ہے جِسے (علمِ ازلي سے) پھير ديا گياo",
                            "verse 51:19": "ظنّ و تخمين سے جھوٹ بولنے والے ہلاک ہو گئےo",
                            "verse 51:20": "اٹکل دوڑانے والے ہلاک ہوں",
                            "verse 51:21": "جو بیخبری میں بھولے ہوئے ہیں",
                            "verse 51:22": "جو جہالت و غفلت ميں (آخرت کو) بھول جانے والے ہيںo",
                            "verse 51:23": "پوچھتے ہيں يومِ جزا کب ہو گا؟o",
                            "verse 51:24": "پوچھتے ہیں کہ جزا کا دن کب ہوگا؟",
                            "verse 51:25": "اُس دن (ہوگا) جب ان کو آگ میں عذاب دیا جائے گا",
                            "verse 51:26": "(فرما ديجئے:) اُس دن (ہوگا جب) وہ آتشِ دوزخ ميں تپائے جائيں گےo",
                            "verse 51:27": "(اُن سے کہا جائے گا:) اپني سزا کا مزہ چکھو، يہي وہ عذاب ہے جسے تم جلدي مانگتے ہوo",
                            "verse 51:28": "اب اپنی شرارت کا مزہ چکھو۔ یہ وہی ہے جس کے لئے تم جلدی مچایا کرتے تھے",
                            "verse 51:29": "بیشک پرہیزگار بہشتوں اور چشموں میں (عیش کر رہے) ہوں گے",
                            "verse 51:30": "بيشک پرہيزگار باغوں اور چشموں ميں (لطف اندوز ہوتے) ہوں گےo",
                            "verse 51:31": "اُن نعمتوں کو (کيف و سرور) سے ليتے ہوں گے جو اُن کا رب انہيں (لطف و کرم سے) ديتا ہوگا، بيشک يہ وہ لوگ ہيں جو اس سے قبل (کي زندگي ميں) صاحبانِ احسان تھےo",
                            "verse 51:32": "اور) جو جو (نعمتیں) ان کا پروردگار انہیں دیتا ہوگا ان کو لے رہے ہوں گے۔ بیشک وہ اس سے پہلے نیکیاں کرتے تھے",
                            "verse 51:33": "رات کے تھوڑے سے حصے میں سوتے تھے",
                            "verse 51:34": "وہ راتوں کو تھوڑي سي دير سويا کرتے تھےo",
                            "verse 51:35": "اور رات کے پچھلے پہروں ميں (اٹھ اٹھ کر) مغفرت طلب کرتے تھےo",
                            "verse 51:36": "اور اوقات سحر میں بخشش مانگا کرتے تھے",
                            "verse 51:37": "اور ان کے مال میں مانگنے والے اور نہ مانگنے والے (دونوں) کا حق ہوتا تھا",
                            "verse 51:38": "اور اُن کے اموال ميں سائل اور محروم (سب حاجت مندوں) کا حق مقرر تھاo",
                            "verse 51:39": "اور زمين ميں صاحبانِ ايقان (يعني کامل يقين والوں) کے لئے بہت سي نشانياں ہيںo",
                            "verse 51:40": "اور یقین کرنے والوں کے لئے زمین میں (بہت سی) نشانیاں ہیں",
                            "verse 51:41": "اور خود تمہارے نفوس میں تو کیا تم دیکھتے نہیں؟",
                            "verse 51:42": "اور خود تمہارے نفوس ميں (بھي ہيں)، سو کيا تم ديکھتے نہيں ہوo",
                            "verse 51:43": "اور آسمان ميں تمہارا رِزق (بھي) ہے اور وہ (سب کچھ بھي) جس کا تم سے وعدہ کيا جاتا ہےo",
                            "verse 51:44": "اور تمہارا رزق اور جس چیز کا تم سے وعدہ کیا جاتا ہے آسمان میں ہے",
                            "verse 51:45": "تو آسمانوں اور زمین کے مالک کی قسم! یہ (اسی طرح) قابل یقین ہے جس طرح تم بات کرتے ہو",
                            "verse 51:46": "پس آسمان اور زمين کے مالک کي قَسم! يہ (ہمارا وعدہ) اسي طرح يقيني ہے جس طرح تمہارا اپنا بولنا (تمہيں اس پر کامل يقين ہوتا ہے کہ منہ سے کيا کہہ رہے ہو)o",
                            "verse 51:47": "کيا آپ کے پاس ابراہيم (عليہ السلام) کے معزّز مہمانوں کي خبر پہنچي ہےo",
                            "verse 51:48": "بھلا تمہارے پاس ابراہیم کے معزز مہمانوں کی خبر پہنچی ہے؟",
                            "verse 51:49": "جب وہ ان کے پاس آئے تو سلام کہا۔ انہوں نے بھی (جواب میں) سلام کہا (دیکھا تو) ایسے لوگ کہ نہ جان نہ پہچان",
                            "verse 51:50": "جب وہ (فرشتے) اُن کے پاس آئے تو انہوں نے سلام پيش کيا، ابراہيم (عليہ السلام) نے بھي (جواباً) سلام کہا، (ساتھ ہي دل ميں سوچنے لگے کہ) يہ اجنبي لوگ ہيںo",
                            "verse 51:51": "پھر جلدي سے اپنے گھر کي طرف گئے اور ايک فربہ بچھڑے کي سجّي لے آئےo",
                            "verse 51:52": "تو اپنے گھر جا کر ایک (بھنا ہوا) موٹا بچھڑا لائے",
                            "verse 51:53": "(اور کھانے کے لئے) ان کے آگے رکھ دیا۔ کہنے لگے کہ آپ تناول کیوں نہیں کرتے؟",
                            "verse 51:54": "پھر اسے ان کے سامنے پيش کر ديا، فرمانے لگے: کيا تم نہيں کھاؤ گےo",
                            "verse 51:55": "پھر اُن (کے نہ کھانے) سے دل ميں ہلکي سي گھبراہٹ محسوس کي? وہ (فرشتے) کہنے لگے: آپ گھبرائيے نہيں، اور اُن کو علم و دانش والے بيٹے (اسحاق عليہ السلام) کي خوشخبري سنا ديo",
                            "verse 51:56": "اور دل میں ان سے خوف معلوم کیا۔ (انہوں نے) کہا کہ خوف نہ کیجیئے۔ اور ان کو ایک دانشمند لڑکے کی بشارت بھی سنائی",
                            "verse 51:57": "تو ابراہیم کی بیوی چلاّتی آئی اور اپنا منہ پیٹ کر کہنے لگی کہ (اے ہے ایک تو) بڑھیا اور (دوسرے) بانجھ",
                            "verse 51:58": "پھر اُن کي بيوي (سارہ) حيرت و حسرت کي آواز نکالتے ہوئے متوجہ ہوئيں اور تعجّب سے اپنے ماتھے پر ہاتھ مارا اور کہنے لگي: (کيا) بوڑھيا بانجھ عورت (بچہ جنے گي؟)o",
                            "verse 51:59": "(فرشتوں نے) کہا: ايسے ہي ہوگا، تمہارے رب نے فرمايا ہے? بيشک وہ بڑي حکمت والا بہت علم والا ہےo",
                            "verse 51:60": "(انہوں نے) کہا (ہاں) تمہارے پروردگار نے یوں ہی فرمایا ہے۔ وہ بیشک صاحبِ حکمت (اور) خبردار ہے",
                            "verse 51:61": "ابراہیم نے کہا کہ فرشتو! تمہارا مدعا کیا ہے؟",
                            "verse 51:62": "(ابراہيم عليہ السلام نے) کہا: اے بھيجے ہوئے فرشتو! (اس بشارت کے علاوہ) تمہارا (آنے کا) بنيادي مقصد کيا ہےo",
                            "verse 51:63": "انہوں نے کہا: ہم مجرِم قوم (يعني قومِ لُوط) کي طرف بھيجے گئے ہيںo",
                            "verse 51:64": "انہوں نے کہا کہ ہم گنہگار لوگوں کی طرف بھیجے گئے ہیں",
                            "verse 51:65": "تاکہ ان پر کھنگر برسائیں",
                            "verse 51:66": "تاکہ ہم اُن پر مٹي کے پتھريلے کنکر برسائيںo",
                            "verse 51:67": "(وہ پتھر جن پر) حد سے گزر جانے والوں کے لئے آپ کے رب کي طرف سے نشان لگا ديا گيا ہےo",
                            "verse 51:68": "جن پر حد سے بڑھ جانے والوں کے لئے تمہارے پروردگار کے ہاں سے نشان کردیئے گئے ہیں",
                            "verse 51:69": "تو وہاں جتنے مومن تھے ان کو ہم نے نکال لیا",
                            "verse 51:70": "پھر ہم نے ہر اُس شخص کو (قومِ لُوط کي بستي سے) باہر نکال ديا جو اس ميں اہلِ ايمان ميں سے تھاo",
                            "verse 51:71": "سو ہم نے اُس بستي ميں مسلمانوں کے ايک گھر کے سوا (اور کوئي گھر) نہيں پايا (اس ميں حضرت لوط عليہ السلام اور ان کي دو صاحبزادياں تھيں)o",
                            "verse 51:72": "اور اس میں ایک گھر کے سوا مسلمانوں کا کوئی گھر نہ پایا",
                            "verse 51:73": "اور جو لوگ عذاب الیم سے ڈرتے ہیں ان کے لئے وہاں نشانی چھوڑ دی",
                            "verse 51:74": "اور ہم نے اُس (بستي) ميں اُن لوگوں کے لئے (عبرت کي) ايک نشاني باقي رکھي جو دردناک عذاب سے ڈرتے ہيںo",
                            "verse 51:75": "اور موس?ي (عليہ السلام کے واقعہ) ميں (بھي نشانياں ہيں) جب ہم نے انہيں فرعون کي طرف واضح دليل دے کر بھيجاo",
                            "verse 51:76": "اور موسیٰ (کے حال) میں (بھی نشانی ہے) جب ہم نے ان کو فرعون کی طرف کھلا ہوا معجزہ دے کر بھیجا",
                            "verse 51:77": "تو اس نے اپنی جماعت (کے گھمنڈ) پر منہ موڑ لیا اور کہنے لگا یہ تو جادوگر ہے یا دیوانہ",
                            "verse 51:78": "تو اُس نے اپنے اراکينِ سلطنت سميت رُوگرداني کي اور کہنے لگا: (يہ) جادوگر يا ديوانہ ہےo",
                            "verse 51:79": "پھر ہم نے اُسے اور اُس کے لشکر کو (عذاب کي) گرفت ميں لے ليا اور اُن (سب) کو دريا ميں غرق کر ديا اور وہ تھا ہي قابلِ ملامت کام کرنے والاo",
                            "verse 51:80": "تو ہم نے اس کو اور اس کے لشکروں کو پکڑ لیا اور ان کو دریا میں پھینک دیا اور وہ کام ہی قابل ملامت کرتا تھا",
                            "verse 51:81": "اور عاد (کی قوم کے حال) میں بھی (نشانی ہے) جب ہم نے ان پر نامبارک ہوا چلائی",
                            "verse 51:82": "اور (قومِ) عاد (کي ہلاکت) ميں بھي (نشاني) ہے جبکہ ہم نے اُن پر بے خير و برکت ہوا بھيجيo",
                            "verse 51:83": "وہ جس چيز پر بھي گزرتي تھي اسے ريزہ ريزہ کئے بغير نہيں چھوڑتي تھيo",
                            "verse 51:84": "وہ جس چیز پر چلتی اس کو ریزہ ریزہ کئے بغیر نہ چھوڑتی",
                            "verse 51:85": "اور (قوم) ثمود (کے حال) میں (نشانی ہے) جب ان سے کہا گیا کہ ایک وقت تک فائدہ اٹھالو",
                            "verse 51:86": "اور (قومِ) ثمود (کي ہلاکت) ميں بھي (عبرت کي نشاني ہے) جبکہ اُن سے کہا گيا کہ تم ايک معيّنہ وقت تک فائدہ اٹھا لوo",
                            "verse 51:87": "تو انہوں نے اپنے رب کے حکم سے سرکشي کي، پس انہيں ہولناک کڑک نے آن ليا اور وہ ديکھتے ہي رہ گئےo",
                            "verse 51:88": "تو انہوں نے اپنے پروردگار کے حکم سے سرکشی کی۔ سو ان کو کڑک نے آ پکڑا اور وہ دیکھ رہے تھے",
                            "verse 51:89": "پھر وہ نہ تو اُٹھنے کی طاقت رکھتے تھے اور نہ مقابلہ ہی کرسکتے تھے",
                            "verse 51:90": "پھر وہ نہ کھڑے رہنے پر قدرت پا سکے اور نہ وہ (ہم سے) بدلہ لے سکنے والے تھےo",
                            "verse 51:91": "اور اس سے پہلے نُوح (عليہ السلام) کي قوم کو (بھي ہلاک کيا)، بيشک وہ سخت نافرمان لوگ تھےo",
                            "verse 51:92": "اور اس سے پہلے (ہم) نوح کی قوم کو (ہلاک کرچکے تھے) بیشک وہ نافرمان لوگ تھے",
                            "verse 51:93": "اور آسمانوں کو ہم ہی نے ہاتھوں سے بنایا اور ہم کو سب مقدور ہے",
                            "verse 51:94": "اور آسماني کائنات کو ہم نے بڑي قوت کے ذريعہ سے بنايا اور يقيناً ہم (اس کائنات کو) وسعت اور پھيلاؤ ديتے جا رہے ہيںo",
                            "verse 51:95": "اور (سطحِ) زمين کو ہم ہي نے (قابلِ رہائش) فرش بنايا سو ہم کيا خوب سنوارنے اور سيدھا کرنے والے ہيںo",
                            "verse 51:96": "اور زمین کو ہم ہی نے بچھایا تو (دیکھو) ہم کیا خوب بچھانے والے ہیں",
                            "verse 51:97": "اور ہر چیز کی ہم نے دو قسمیں بنائیں تاکہ تم نصیحت پکڑو",
                            "verse 51:98": "اور ہم نے ہر چيز سے دو جوڑے پيدا فرمائے تاکہ تم دھيان کرو اور سمجھوo",
                            "verse 51:99": "پس تم ا? کي طرف دوڑ چلو، بيشک ميں اُس کي طرف سے تمہيں کھلا ڈر سنانے والا ہوںo",
                            "verse 51:100": "تو تم لوگ خدا کی طرف بھاگ چلو میں اس کی طرف سے تم کو صریح رستہ بتانے والا ہوں",
                            "verse 51:101": "اور خدا کے ساتھ کسی اَور کو معبود نہ بناؤ۔ میں اس کی طرف سے تم کو صریح رستہ بتانے والا ہوں",
                            "verse 51:102": "اور ا? کے سوا کوئي دوسرا معبود نہ بناؤ، بيشک ميں اس کي جانب سے تمہيں کھلا ڈر سنانے والا ہوںo",
                            "verse 51:103": "اسي طرح اُن سے پہلے لوگوں کے پاس بھي کوئي رسول نہيں آيا مگر انہوں نے يہي کہا کہ (يہ) جادوگر ہے يا ديوانہ ہےo",
                            "verse 51:104": "اسی طرح ان سے پہلے لوگوں کے پاس جو پیغمبر آتا وہ اس کو جادوگر یا دیوانہ کہتے",
                            "verse 51:105": "کیا یہ کہ ایک دوسرے کو اسی بات کی وصیت کرتے آئے ہیں بلکہ یہ شریر لوگ ہیں",
                            "verse 51:106": "کيا وہ لوگ ايک دوسرے کواس بات کي وصيت کرتے رہے؟ بلکہ وہ (سب) سرکش و باغي لوگ تھےo",
                            "verse 51:107": "سو آپ اُن سے نظرِ التفات ہٹا ليں پس آپ پر (اُن کے ايمان نہ لانے کي) کوئي ملامت نہيں ہےo",
                            "verse 51:108": "تو ان سے اعراض کرو۔ تم کو (ہماری) طرف سے ملامت نہ ہوگی",
                            "verse 51:109": "اور نصیحت کرتے رہو کہ نصیحت مومنوں کو نفع دیتی ہے",
                            "verse 51:110": "اور آپ نصيحت کرتے رہيں کہ بيشک نصيحت مومنوں کو فائدہ ديتي ہےo",
                            "verse 51:111": "اور ميں نے جنّات اور انسانوں کو صرف اسي لئے پيدا کيا کہ وہ ميري بندگي اختيار کريںo",
                            "verse 51:112": "اور میں نے جنوں اور انسانوں کو اس لئے پیدا کیا ہے کہ میری عبادت کریں",
                            "verse 51:113": "میں ان سے طالب رزق نہیں اور نہ یہ چاہتا ہوں کہ مجھے (کھانا) کھلائیں",
                            "verse 51:114": "نہ ميں اُن سے رِزق (يعني کمائي) طلب کرتا ہوں اور نہ اس کا طلب گار ہوں کہ وہ مجھے (کھانا) کھلائيںo",
                            "verse 51:115": "بيشک ا? ہي ہر ايک کا روزي رساں ہے، بڑي قوت والا ہے، زبردست مضبوط ہے (اسے کسي کي مدد و تعاون کي حاجت نہيں)o",
                            "verse 51:116": "خدا ہی تو رزق دینے والا زور آور اور مضبوط ہے",
                            "verse 51:117": "کچھ شک نہیں کہ ان ظالموں کے لئے بھی (عذاب کی) نوبت مقرر ہے جس طرح ان کے ساتھیوں کی نوبت تھی تو ان کو مجھ سے (عذاب) جلدی نہیں طلب کرنا چاہیئے",
                            "verse 51:118": "پس ان ظالموں کے لئے (بھي) حص? عذاب مقرّر ہے ان کے (پہلے گزرے ہوئے) ساتھيوں کے حص? عذاب کي طرح، سو وہ مجھ سے جلدي طلب نہ کريںo",
                            "verse 51:119": "سو کافروں کے لئے اُن کے اُس دِن ميں بڑي تباہي ہے جس کا اُن سے وعدہ کيا جا رہا ہےo",
                            "verse 51:120": "جس دن کا ان کافروں سے وعدہ کیا جاتا ہے اس سے ان کے لئے خرابی ہے ہےo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 51:1": "Чанг тўзитувчи(шамол) лар билан қасам.",
                            "verse 51:2": "Юк кўтарувчи(булут)лар билан қасам.",
                            "verse 51:3": "Осон юрувчи(кема)лар билан қасам;",
                            "verse 51:4": "Иш тақсимловчи(фаришта)лар билан қасам.",
                            "verse 51:5": "Албатта, сизга ваъда қилинган нарса ростдир.",
                            "verse 51:6": "Ва, албатта, қиёмат воқеъ бўлгувчидир.",
                            "verse 51:7": "Гўзал, мустаҳкам осмон билан қасам .",
                            "verse 51:8": "Албатта, сиз ихтилофли гапдасиз.",
                            "verse 51:9": "У(Қуръон)дан ким бурилса, (бир йўла) буриб қўйилур.",
                            "verse 51:10": "Ёлғончиларга лаънат бўлсин!",
                            "verse 51:11": "Улар жаҳолатдаги ғофиллардир.",
                            "verse 51:12": "Улар ҳисоб-китоб куни қачон, деб сўрарлар.",
                            "verse 51:13": "Бу кунда улар оловда азобланурлар.",
                            "verse 51:14": "«Азобингизни татиб кўринг», сиз қачон бўлур? деб шошилган нарса-шу» (дейилур).",
                            "verse 51:15": "Албатта, тақводорлар жаннатлар ва булоқлардадир.",
                            "verse 51:16": "Роббилари берган нарсаларни олувчилардир.",
                            "verse 51:17": "Улар кечалари оз ухлар эдилар.",
                            "verse 51:18": "Ва улар саҳарларда истиғфор айтар эдилар.",
                            "verse 51:19": "Ва молу мулкларида, сўровчи ва бечораларнинг ҳақи бордир.",
                            "verse 51:20": "Ва ер юзида чуқур ишонувчилар учун белгилар бордир.",
                            "verse 51:21": "Ва ўзларингизда ҳам.",
                            "verse 51:22": "Ва осмонда ризқингиз ҳамда сизга ваъда қилинаётган нарсалар (бор).",
                            "verse 51:23": "Осмону ернинг Роббиси ила қасамки, албатта, у(гап) мисоли сиз нутқ қилаётганингиздек ҳақиқатдир.",
                            "verse 51:24": "Сенга Иброҳимнинг карамли меҳмонларининг хабари келмадими?",
                            "verse 51:25": "Улар унинг ҳузурига кириб, «Салом» деганларида, у: «Салом, нотаниш қавмлар», деди.",
                            "verse 51:26": "Ва аҳлига бориб, (пиширилган) семиз бузоқни келтирди.",
                            "verse 51:27": "Уни уларга яқинига сурди ва: «Емайсизларми?» деди.",
                            "verse 51:28": "Улардан хавфсиради.",
                            "verse 51:29": "Хотини қичқириб келди ва ўз юзига шапалоқ тушириб: «Туғмас кампир-а?!» деди.",
                            "verse 51:30": "Улар:«Сенинг Роббинг шундай деди.",
                            "verse 51:31": "У:«Эй элчилар! Сизнинг ишингиз надир», деди.",
                            "verse 51:32": "Улар:«Албатта, биз жиноятчи қавмга юборилганмиз.",
                            "verse 51:33": "Уларнинг устидан лойдан (пиширилган) тошларни ташлаш учун.",
                            "verse 51:34": "Роббинг ҳузурида исрофчилар учун белгилаб қўйилган(тош)ларни», дедилар.",
                            "verse 51:35": "Ва Биз у жойдан мўминларни чиқардик.",
                            "verse 51:36": "У ерда бир хонадондан бошқа мусулмонларни топмадик.",
                            "verse 51:37": "Ва у ерда аламли азобдан қўрқадиганлар учун белги қолдирдик.",
                            "verse 51:38": "Ва Мусода ҳам.",
                            "verse 51:39": "У юз ўгириб, ишонгани томон юрди ва: «Бу сеҳргар ёки мажнундир», деди.",
                            "verse 51:40": "Бас, Биз уни ва аскарларини тутиб денгизга ташладик ва у маломатга лойиқ иш қилувчи эди.",
                            "verse 51:41": "Ва Одда ҳам (белги) бор.",
                            "verse 51:42": "У қайси нарсага етиб борса, титиб ташламасдан қўймас.",
                            "verse 51:43": "Ва Самудда ҳам (белги) бор.",
                            "verse 51:44": "Аллоҳнинг амридан бош тортдилар, бас, қараб турган ҳолларида уларни қаттиқ овоз тутди.",
                            "verse 51:45": "Бас, улар ўринларидан туролмадилар ва ёрдам ҳам ололмадилар.",
                            "verse 51:46": "Ва бундан аввал Нуҳ қавмини ҳам (ҳалок этганмиз).",
                            "verse 51:47": "Осмонни Ўз қудратимиз ила бино қилдик.",
                            "verse 51:48": "Ва ерни тўшаб қўйдик.",
                            "verse 51:49": "Ва Биз ҳар бир нарсани жуфт яратдик.",
                            "verse 51:50": "Бас, фақат Аллоҳгагина қочинг.",
                            "verse 51:51": "Ва Аллоҳга бошқа маъбудни шерик қилманглар.",
                            "verse 51:52": "Худди шундай, булардан аввалгиларга ҳам ҳар бир Пайғамбар келган вақт, уни, сеҳргар ёки мажнун, деганлар.",
                            "verse 51:53": "Келишиб олганмилар?! Йўқ, улар туғёнга кетган қавмлардир!",
                            "verse 51:54": "Улардан юз ўгир.",
                            "verse 51:55": "Ва эслатгин.",
                            "verse 51:56": "Жин ва инсонни фақат Менга ибодат қилиш учунгина яратдим.",
                            "verse 51:57": "Мен улардан ризқ хоҳламасман ва Мени тоамлантиришларини ҳам хоҳламасман.",
                            "verse 51:58": "Албатта, Аллоҳ Ўзи ризқ берувчи, қувват эгаси, шиддатлидир.",
                            "verse 51:59": "Албатта, зулм қилганларга ўз биродарлари азобичалик азоб бор, шошилмасинлар.",
                            "verse 51:60": "Кофирларга ваъда қилинаётган кунларида ҳалокат бўлсин."
                        }
                    }
                }
            }
        }
    }
}