{
    "id": 52,
    "name_simple": "At-Tur",
    "revelation_place": "makkah",
    "revelation_order": 76,
    "bismillah_pre": true,
    "verses_count": 49,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "It is derived from the very first cord 'Wat Tur-i.'",
    "text": [
        "\n",
        "It is derived from the very first cord \"Wat Tur-i.\"",
        "\n",
        "Period of Revelation",
        "\n",
        "From the internal evidence of the subject matter it appears that this Surah too was revealed in the same stage of the Holy Prophet's life at Makkah in which the Surah Adh-Dhariyat was revealed. While going through it one can clearly feel that during the period of its revelation the Holy Prophet (peace and blessings of Allah be upon him) was being showered with objections and accusations but there is no evidence yet to show that severe persecution of the Muslims had started.",
        "\n",
        "Subject Matter and Topics",
        "\n",
        "The subject matter of its first section (vv. 1-28) is the Hereafter. As arguments for its possibility, necessity and occurrence had already been given in Surah Adh-Dhariyat, these have not been repeated here. However, swearing an oath by some realities and signs which testify to the Hereafter, it has been stated most emphatically that it will surely come to pass, and none has the power to prevent its occurrence. Then, it has been stated as to what will be the fate of those who deny it when it actually occurs, and how will those who believe in it and adopt the way of piety and righteousness accordingly, be blessed by Allah.",
        "\n",
        "Then, in the second section (vv. 29-49) the Quraish chiefs' attitude towards the message of the Holy Prophet (peace and blessings of Allah he upon him) has been criticized. They called him a sorcerer, a madman, or a poet, and would thus mislead the common people against him so that they should not pay any serious attention to the message he preached. They looked upon him as a calamity that had suddenly descended on them and would openly wish that he met with a disaster so that they were rid of him. They accused him of fabricating the Qur'an by himself and of presenting it in the name of Allah, and this was, God forbid, a fraud that he was practicing. They would often taunt him, saying that God could not have appointed an ordinary man like him to the office of Prophethood. They expressed great disgust at his invitation and message and would avoid him as if he was asking them for a reward for it. They would sit and take counsels together to devise schemes in order to put an end to\r\nhis mission. And while they did all this they never realized what creeds of ignorance they were involved in and how selflessly and sincerely was Muhammad (peace and blessings of Allah be upon him) exerting himself to deliver them from their error. While criticizing them for this attitude and conduct, Allah has put them certain questions, one after the other, each of which is either an answer to some objection of theirs, or a criticism of some error. Then, it has been said that it would absolutely be of no avail to show them a miracle in order to convince them of his Prophethood, for they were such stubborn people as would misinterpret anything they were shown only to avoid affirming the faith.",
        "\n",
        "In the beginning of this section as well as in its end, the Holy Prophet (peace and blessings of Allah be upon him) has been given the instruction that he should persistently continue giving his invitation and preaching his message in spite of the accusations and objections of his opponents and enemies, and should endure their resistance patiently till Allah's judgment comes to pass. Besides, he has been consoled, as if to say \"Your Lord has not left you alone to face your enemies, after raising you as a Prophet, but He is constantly watching over you. Therefore, endure every hardship patiently till the Hour of His judgment comes, and seek through praising and glorifying your Lord the power that is required for exerting in the cause of Allah under such conditions.",
        "\n"
    ],
    "description": "The surah that opens with the oath of the Divine One swearing by The Mount of Sinai, where the Torah was revealed to Moses. It takes its name from “the mount” (ṭūr) mentioned in verse 1. The surah which addresses many of the arguments put to the Prophet by the disbelievers of Mecca (verse 29 .). The bliss that will be enjoyed by the believers is contrasted to the torments of Hell, and the Prophet is urged to bide his time, to continue to deliver his message, and to wait with confidence for God’s judgement. God swears by, among other things, Mount Sinai, that the Day of Judgement is inevitable.The surah is also known as: Mount Tur, The Mountain.",
    "name_complex": "At-Tûr",
    "surah_name_ar": "الطور",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 52:1": "Pasha malin e Turit (Sinajit),",
                            "verse 52:2": "dhe Librin e shkruar në rreshta,",
                            "verse 52:3": "të zhvilluar në lëkurë,",
                            "verse 52:4": "dhe Tempullin plot haxhinj,",
                            "verse 52:5": "dhe kupës së ngritur (të qiellit),",
                            "verse 52:6": "dhe detit të mbushur,",
                            "verse 52:7": "me të vërtetë, dënimi i Zotit tënd, do të ndodhë,",
                            "verse 52:8": "dhe askush nuk mund ta pengojë,",
                            "verse 52:9": "atë Ditë kur qielli do të lëkundet fuqishëm,",
                            "verse 52:10": "e malet të lëkunden me të madhe nga vendi!",
                            "verse 52:11": "Atë Ditë, mjerë për ata që kanë përgënjeshtruar,",
                            "verse 52:12": "që, të zhytur në gënjeshtra, argëtoheshin!",
                            "verse 52:13": "Atë Ditë, kur me forcë do të hidhen në zjarrin e xhehennemit.",
                            "verse 52:14": "(U thuhet atyre): “Ky është zjarri që e keni përgënjeshtruar,",
                            "verse 52:15": "pra, a është kjo magji, apo ju nuk shihni?",
                            "verse 52:16": "Përcëllohuni në të; e, duroni apo mos duroni, njësoj është për ju, - ky është ndëshkimi juaj vetëm për atë që keni bërë”.",
                            "verse 52:17": "Me të vërtetë, ata që kanë besuar do të gjenden në kopshtet e xhennetit dhe lumturi,",
                            "verse 52:18": "duke u kënaqur me atë që u ka dhënë Zoti i tyre, i ka ruajtur ata Zoti i tyre prej dënimit të skëterrës.",
                            "verse 52:19": "(Atyre u thuhet): “Hani e pni me kënaqësi, për atë që keni punuar!”",
                            "verse 52:20": "Të mbështetur në divane (kanape) të renditura, do t’i martojmë ata me hyrie, sysh të bukur.",
                            "verse 52:21": "E, ata që kanë besuar dhe u shkojnë pas pasardhësit e tyre në besim, do t’ju bashkojmë pasardhësit e tyre dhe nuk do t’ju pakësojmë asgjë nga veprat e tyre – çdo njeri është peng (përgjegjës) për atë që ka punuar –",
                            "verse 52:22": "dhe do t’ju zgjërojmë dhuntitë atyre me pemë dhe mish që ju ka ënda;",
                            "verse 52:23": "në të (xhennet) ia zgjasin njëri-tjetrit gotat e mbushura, aty nuk do të ketë biseda të kota, as mëkate, -",
                            "verse 52:24": "e, do të sillen rreth tyre shërbyes (gilmanët) djelmosha të ngjashëm me margaritarin e ruajtur,",
                            "verse 52:25": "dhe njëri-tjetrit i drejtohen duke e pyetur,",
                            "verse 52:26": "e do të thonë: “Ne, më parë – në familjet tona jemi frikësuar (nga dënimi),",
                            "verse 52:27": "e, Perëndia na ka dhuruar mëshirë dhe na ka ruajtur nga dënimi i rëndë (i frumës helmuese).",
                            "verse 52:28": "Ne, më parë (në jetën tokësore) e kemi adhuruar Atë, Ai, me të vërtetë, është bamirës dhe mëshirues”.",
                            "verse 52:29": "Andaj, këshillo ti (o Muhammed), se ti, me dhuntinë (profetninë) e Zotit tënd, nuk je as fallxhi as i çmendur.",
                            "verse 52:30": "Ose të thonë ata: “(Ai – Muhammedi është) vjershtar, të presim derisa ta zhdukë vdekja”.",
                            "verse 52:31": "Thuaju (atyre): “Pritni, se, me të vërtetë, edhe unë jam nga ata që presin!”",
                            "verse 52:32": "A mos u vie atyre kjo nga mendja e tyre, apo ata janë popull kryeneç (që e kanë kaluar kufirin)?",
                            "verse 52:33": "Apo thonë: “Ai e ka trilluar atë (Kur’anin)”.",
                            "verse 52:34": "andaj, le ta sjellin ata një fjalim të ngjashëm me të, nëse thonë të vërtetën!",
                            "verse 52:35": "A mos vallë, ata janë krijuar pa Krijues, apo mos janë ata krijues të vetvetes?!",
                            "verse 52:36": "A mos vallë ata kanë krijuar qiejt dhe Tokën?! Jo, por ata nuk duan të besojnë.",
                            "verse 52:37": "Vallë, a mos në ta është thesari i Zotit tënd, ose, vallë ata sundojnë?",
                            "verse 52:38": "Vallë, a mos kanë shkallë (me të cilat ngjiten lart) e përgjojnë?! E, le të sjell (ai) përgjuesi i tyre argument të qartë!",
                            "verse 52:39": "Apo, për Te janë vajzat, e për ju djemtë?!",
                            "verse 52:40": "Vallë a mos kërkon ti prej tyre shpërblim, e që ata të jenë të ngarkuar me këtë?!",
                            "verse 52:41": "Ose, a mos tek ata është sekreti, e ata e përshkruajnë?!",
                            "verse 52:42": "Apo dëshirojnë ngatërresë, e vetëm mohuesit do të jenë të ngatërruar?",
                            "verse 52:43": "Ose ata kanë zot (tjetër) pos Perëndisë? Perëndia është i Lartësuar mbi atë çka i përshkruajnë Atij!",
                            "verse 52:44": "Dhe, sikur të shihni se po bie një copë nga qielli, do të thoshin: “Retë e grumbulluara!”",
                            "verse 52:45": "E, lëri ata, derisa të mos takohen me Ditën në të cilën do të shkatërrohen.",
                            "verse 52:46": "Ditën në të cilën, dinakëritë e tyre nu do t’u bëjnë dobi asgjë dhe kur ata nuk do t’i ndihmojë askush.",
                            "verse 52:47": "E, me të vërtetë, për zullumqarët ka edhe dënim tjetër pos këtij; por (këtë) shumica e tyre nuk e dijnë.",
                            "verse 52:48": "E, ti duro për Vendimin e Zotit tënd! Me të vërtetë, ti je nën mbrojtjen Tonë; dhe lavdëroje duke e falenderuar Zotin tënd kur të ngritesh,",
                            "verse 52:49": "dhe, madhëroje Ate edhe natën edhe pas perëndimit të yjeve! ngritesh,"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "And olsun (Allahın Musa ilə danışdığı) Tur dağına;",
                            "verse 52:2": "And olsun yazılmış kitaba (Tövrata, Qur'ana, yaxud bütün ilahi kitablara) -",
                            "verse 52:3": "Açıq dəri üzərində (olan kitaba);",
                            "verse 52:4": "And olsun (mələklərin ibadət etdiyi) Beytülmə'mura;",
                            "verse 52:5": "And olsun yüksək tavana (uca göyə)",
                            "verse 52:6": "Və dolub daşan (alovlanan) dənizə ki,",
                            "verse 52:7": "Rəbbinin əzabı (Ya Peyğəmbər!) mütləq vaqe olacaqdır!",
                            "verse 52:8": "Onu heç kəs dəf edə bilməz!",
                            "verse 52:9": "O gün göy hərəkətə gəlib fırlanacaq (çalxalanacaq),",
                            "verse 52:10": "Dağlar yerindən qopub (havada toz kimi) oynayacaqdır.",
                            "verse 52:11": "O gün vay (peyğəmbərləri) yalançı hesab edənlərin halına!",
                            "verse 52:12": "O kəslər ki, (dünyada) yalana qurşanıb qəflət içində oynayarlar.",
                            "verse 52:13": "O gün onlar zorla cəhənnəm oduna sürüklənəcəklər.",
                            "verse 52:14": "(Onlara belə deyiləcəkdir: ) \"Bu sizin (dünyada) yalan hesab etdiyiniz cəhənnəm odudur!",
                            "verse 52:15": "(Vəhyə, Qur'ana sehr dediyiniz kimi) bu da sehrdir, yoxsa (gözünüz qapanıb onun həqiqət olduğunu) görmürsünüz?",
                            "verse 52:16": "Yanın orada! İstər dözün, istər yox; sizin üçün eynidir (həmişəlik Cəhənnəmdə qalacaqsınız).",
                            "verse 52:17": "Müttəqilər isə, şübhəsiz ki, cənnətlər və ne'mətlər içində olacaqlar.",
                            "verse 52:18": "Rəbbinin onlara əta etdiyi ne'mətlərdən zövq (ləzzət) alacaqlar.",
                            "verse 52:19": "(Onlara belə deyiləcəkdir: ) \"(Dünyada) etdiyiniz yaxşı əməllərin müqabilində nuşcanlıqla yeyin-için;",
                            "verse 52:20": "Səf-səf düzülmüş taxtlara söykəndiyiniz halda!\" Biz onları iri (ahu) gözlü hurilərlə evləndirəcəyik.",
                            "verse 52:21": "İman gətirib övladları imanla arxalarınca gedənlərin nəsillərini də (Cənnətdə) özlərinə qoşacağıq.",
                            "verse 52:22": "Onları istədikləri meyvə və ətlə (bol-bol) tə'min edəcəyik.",
                            "verse 52:23": "Onlar orada bir-birinə (şərab dolu) qədəh ötürəcəklər.",
                            "verse 52:24": "Onların ətrafında (xidmət üçün) özlərinə məxsus olan, sədəf içində gizlənmiş inci kimi gözəl oğlanlar dolanacaqlar.",
                            "verse 52:25": "Onlar (dünyada gördükləri işlər barəsində) bir-birindən hal-əhval tutmağa başlayacaqlar.",
                            "verse 52:26": "Və (söhbət əsnasında) belə deyəcəklər: \"Biz bundan əvvəl (dünyada) ailəmiz içində olarkən (Rəbbimizin əzabından) qorxardıq.",
                            "verse 52:27": "Artıq Allah bizə mərhəmət buyurub (minnət qoyub) bizi cəhənnəm (səmum) əzabından qorudu.",
                            "verse 52:28": "Biz bundan əvvəl (dünyada) Ona ibadət edirdik.",
                            "verse 52:29": "Elə isə (ya Peyğəmbər! Sən müşriklərə) öyüd-nəsihət ver.",
                            "verse 52:30": "Yoxsa onlar (sənin barəndə): \"(O) şairdir.",
                            "verse 52:31": "De: \"Gözləyin, mən də sizinlə birlikdə (sizin başınıza gələcək müsibəti) gözlələyənlərdənəm!\"",
                            "verse 52:32": "Yoxsa onların puç ağılları bunu (bu cür batil sözləri deməyi) onlara əmr edir? Xeyr, onlar azğın bir qövmdürlər.",
                            "verse 52:33": "Yoxsa onlar: \"Onu (Qur'anı) özündən uydurdun!\" - deyirlər.",
                            "verse 52:34": "Əgər doğru deyirlərsə, qoy onlar bunun (bu Qur'an) kimi bir kəlam gətirsinlər!",
                            "verse 52:35": "Yoxsa onlar heç bir şeydən (xaliqsiz) yarandılar?! Yaxud onlar (öz-özlərini) yaradanlardır?!",
                            "verse 52:36": "Yoxsa göyləri və yeri yaratdılar?! Xeyr, onlar (Allaha) ürəkdən inanmırlar!",
                            "verse 52:37": "Yoxsa (ya Peyğəmbər) sənin Rəbbinin xəzinələri onlardadır?! Yaxud (hər şeyə) onlar hakimdirlər?!",
                            "verse 52:38": "Yoxsa onların üstünə çıxıb (vəhyi) dinlədikləri bir nərdivanı vardır?! Elə isə qoy onların (vəhyi) dinləyənləri açıq-aşkar bir dəlil gətirsinlər!",
                            "verse 52:39": "Yoxsa qızlar Onun (Allahın), oğlanlar isə sizindir?!",
                            "verse 52:40": "Yoxsa (ya Peyğəmbər! Risaləti təbliğ etdiyinə görə) sən onlardan bir ücrət (mükafat) istəyirsən və onlar ağır borc yükü altındadırlar?!",
                            "verse 52:41": "Yoxsa onlar qeybi bilir və (orada olanı) yazırlar?! (Qiyamətin, axirət həyatının olmadığını oradan öyrənib Muhəmməd əleyhissəlamla mübahisə edirlər?)",
                            "verse 52:42": "Yoxsa (ya Peyğəmbər! Sənə qarşı) bir tələ qurmaq istəyirlər? Amma kafirlər özləri o tələyə düşəcəklər!",
                            "verse 52:43": "Yoxsa onların Allahdan başqa bir tanrısı vardır? Allah bunların Ona qoşduqları şəriklərdən tamamilə uzaqdır!",
                            "verse 52:44": "Əgər onlar göyün bir parçasının (başlarına) düşdüyünü görsələr: \"Bulud topasıdır!\" - deyərlər (özlərinə əzab gəldiyinə inanmazlar).",
                            "verse 52:45": "Elə isə (dəhşətdən) sarsılıb karıxacaqları günə qovuşana qədər sən onları tərk et!",
                            "verse 52:46": "O gün hiylələri onlara heç bir fayda verməyəcəkdir (Allahın əzabını onlardan dəf edə bilməyəcək) və onlara heç bir kömək olunmayacaqdır.",
                            "verse 52:47": "Şübhəsiz ki, zalımları (kafirləri) hələ bundan başqa da (dünyada və qəbir evində) əzab gözləyir.",
                            "verse 52:48": "(Ya Peyğəmbər!) Sən öz Rəbinin hökmünə səbr et! Şübhəsiz ki, sən Bizim gözümüzün qabağındasan (himayəmiz altındasan).",
                            "verse 52:49": "Gecənin bir vaxtında nə ulduzlar batandan sonra (dan yeri söküləndə, yaxud sübh çağı) da Allahı təqdis edib şə'ninə tə'riflər de! (Gün ərzində vacib və əlavə namazları qıl!)"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Tako Mi Gore,",
                            "verse 52:2": "i Knjige u retke napisane,",
                            "verse 52:3": "na koži razvijenoj,",
                            "verse 52:4": "i Hrama poklonika punog,",
                            "verse 52:5": "i svoda uzdignutog,",
                            "verse 52:6": "i mora napunjenog -",
                            "verse 52:7": "kazna Gospodara tvoga sigurno će se dogoditi,",
                            "verse 52:8": "nitko je neće moći otkloniti",
                            "verse 52:9": "na Dan kada se nebo silno uzburka,",
                            "verse 52:10": "a planine s mjesta pomaknu!",
                            "verse 52:11": "Teško na taj Dan onima koji su poricali,",
                            "verse 52:12": "koji su se, ogrezli u laž, zabavljali! -",
                            "verse 52:13": "na Dan kada će grubo u vatru džehennemsku biti gurnuti:",
                            "verse 52:14": "Ovo je vatra koju ste poricali,",
                            "verse 52:15": "pa, je li ovo čarolija, ili vi ne vidite?",
                            "verse 52:16": "Pržite se u njoj, isto vam je trpjeli ili ne trpjeli - to vam je kazna za ono što ste radili.",
                            "verse 52:17": "A čestiti će biti u džennetskim baščama i blaženstvu",
                            "verse 52:18": "i u onom što im je Gospodar njihov dao će uživati - njih će Gospodar njihov patnje u ognju sačuvati.",
                            "verse 52:19": "Jedite i pijte i neka vam je prijatno, to je za ono što ste radili!",
                            "verse 52:20": "Biće naslonjeni na divanima poređanim, a obradovaćemo ih hurijama džennetskim.",
                            "verse 52:21": "Onima koji su vjerovali i za kojima su se djeca njihova u vjerovanju povela priključićemo djecu njihovu, a djela njihova nećemo nimalo umanjiti - svaki čovjek je odgovoran za ono što sam čini -",
                            "verse 52:22": "i još ćemo ih darovati voćem i mesom kakvo budu željeli",
                            "verse 52:23": "jedni drugima će, u njemu, pune čaše dodavati - zbog njih neće biti praznih besjeda i pobuda na grijeh -",
                            "verse 52:24": "a služiće ih posluga njihova nalik na biser skriveni,",
                            "verse 52:25": "i obraćaće se jedni drugima i jedni druge će pitati:",
                            "verse 52:26": "Prije smo među svojima strahovali - govoriće -",
                            "verse 52:27": "pa nam je Allah milost darovao i od patnje u ognju nas sačuvao;",
                            "verse 52:28": "mi smo Mu se prije klanjali, On je, doista, Dobročinitelj i Milostivi.",
                            "verse 52:29": "Zato ti opominji, jer ti, milošću Gospodara svoga, nisi ni prorok ni lud.",
                            "verse 52:30": "Zar oni da govore: \"On je pjesnik, sačekaćemo da vidimo šta će mu suđeno biti.",
                            "verse 52:31": "Pa čekajte - reci ti - \"i ja ću zajedno sa vama čekati!\"",
                            "verse 52:32": "Da li im to dolazi od pameti njihove ili su oni inadžije tvrdoglave?",
                            "verse 52:33": "Zar oni da govore: \"Izmišlja ga!\" - Ne, nego oni neće da vjeruju;",
                            "verse 52:34": "zato neka oni sastave govor sličan Kur’anu, ako istinu govore!",
                            "verse 52:35": "Zar su oni bez Stvoritelja stvoreni ili su oni sami sebe stvorili?!",
                            "verse 52:36": "Zar su oni nebesa i Zemlju stvorili?! Ne, nego oni neće da vjeruju.",
                            "verse 52:37": "Zar je u njih blago Gospodara tvoga, ili, zar oni vladaju?!",
                            "verse 52:38": "Zar oni imaju ljestve, pa na njima prisluškuju? Neka onaj među njima koji tvrdi da je nešto čuo donese potvrdu očitu.",
                            "verse 52:39": "Zar da su za Njega - kćeri, a za vas da su - sinovi?!",
                            "verse 52:40": "Zar ti tražiš od njih nagradu, pa su nametom opterećeni.",
                            "verse 52:41": "Zar je u njih iskonska knjiga, pa oni prepisuju?!",
                            "verse 52:42": "Zar oni zamke da postavljaju?! Ta u zamku će se uhvatiti baš oni koji ne vjeruju!",
                            "verse 52:43": "Zar oni drugog boga osim Allaha da imaju?! Hvaljen neka je Allah, On je iznad onih koje Mu ravnim smatraju!",
                            "verse 52:44": "I kad bi vidjeli da komad neba pada, rekli bi: \"Oblaci nagomilani!\"",
                            "verse 52:45": "Zato ih pusti dok se ne suoče sa Danom u kome će pomrijeti,",
                            "verse 52:46": "Danom kada im lukavstva njihova nimalo neće koristiti i kada im niko neće pomoći.",
                            "verse 52:47": "A za sve nasilnike i druga će kazna prije one biti, ali većina njih ne zna.",
                            "verse 52:48": "A ti strpljivo čekaj presudu Gospodara svoga, Mi tebe i vidimo i štitimo; i veličaj i hvali Gospodara svoga kad ustaješ,",
                            "verse 52:49": "i noću Ga veličaj i kad se zvijezde gube."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "কসম তূরপর্বতের,",
                            "verse 52:2": "এবং লিখিত কিতাবের,",
                            "verse 52:3": "প্রশস্ত পত্রে,",
                            "verse 52:4": "কসম বায়তুল-মামুর তথা আবাদ গৃহের,",
                            "verse 52:5": "এবং সমুন্নত ছাদের,",
                            "verse 52:6": "এবং উত্তাল সমুদ্রের,",
                            "verse 52:7": "আপনার পালনকর্তার শাস্তি অবশ্যম্ভাবী,",
                            "verse 52:8": "তা কেউ প্রতিরোধ করতে পারবে না।",
                            "verse 52:9": "সেদিন আকাশ প্রকম্পিত হবে প্রবলভাবে।",
                            "verse 52:10": "এবং পর্বতমালা হবে চলমান,",
                            "verse 52:11": "সেদিন মিথ্যারোপকারীদের দুর্ভোগ হবে,",
                            "verse 52:12": "যারা ক্রীড়াচ্ছলে মিছেমিছি কথা বানায়।",
                            "verse 52:13": "সেদিন তোমাদেরকে জাহান্নামের অগ্নির দিকে ধাক্কা মেরে মেরে নিয়ে যাওয়া হবে।",
                            "verse 52:14": "এবং বলা হবেঃ এই সেই অগ্নি, যাকে তোমরা মিথ্যা বলতে,",
                            "verse 52:15": "এটা কি জাদু, না তোমরা চোখে দেখছ না?",
                            "verse 52:16": "এতে প্রবেশ কর অতঃপর তোমরা সবর কর অথবা না কর, উভয়ই তোমাদের জন্য সমান। তোমরা যা করতে তোমাদেরকে কেবল তারই প্রতিফল দেয়া হবে।",
                            "verse 52:17": "নিশ্চয় খোদাভীরুরা থাকবে জান্নাতে ও নেয়ামতে।",
                            "verse 52:18": "তারা উপভোগ করবে যা তাদের পালনকর্তা তাদের দেবেন এবং তিনি জাহান্নামের আযাব থেকে তাদেরকে রক্ষা করবেন।",
                            "verse 52:19": "তাদেরকে বলা হবেঃ তোমরা যা করতে তার প্রতিফলস্বরূপ তোমরা তৃপ্ত হয়ে পানাহার কর।",
                            "verse 52:20": "তারা শ্রেণীবদ্ধ সিংহাসনে হেলান দিয়ে বসবে। আমি তাদেরকে আয়তলোচনা হুরদের সাথে বিবাহবন্ধনে আবদ্ধ করে দেব।",
                            "verse 52:21": "যারা ঈমানদার এবং যাদের সন্তানরা ঈমানে তাদের অনুগামী, আমি তাদেরকে তাদের পিতৃপুরুষদের সাথে মিলিত করে দেব এবং তাদের আমল বিন্দুমাত্রও হ্রাস করব না। প্রত্যেক ব্যক্তি নিজ কৃত কর্মের জন্য দায়ী।",
                            "verse 52:22": "আমি তাদেরকে দেব ফল-মূল এবং মাংস যা তারা চাইবে।",
                            "verse 52:23": "সেখানে তারা একে অপরকে পানপাত্র দেবে; যাতে অসার বকাবকি নেই এবং পাপকর্মও নেই।",
                            "verse 52:24": "সুরক্ষিত মোতিসদৃশ কিশোররা তাদের সেবায় ঘুরাফেরা করবে।",
                            "verse 52:25": "তারা একে অপরের দিকে মুখ করে জিজ্ঞাসাবাদ করবে।",
                            "verse 52:26": "তারা বলবেঃ আমরা ইতিপূর্বে নিজেদের বাসগৃহে ভীত-কম্পিত ছিলাম।",
                            "verse 52:27": "অতঃপর আল্লাহ আমাদের প্রতি অনুগ্রহ করেছেন এবং আমাদেরকে আগুনের শাস্তি থেকে রক্ষা করেছেন।",
                            "verse 52:28": "আমরা পূর্বেও আল্লাহকে ডাকতাম। তিনি সৌজন্যশীল, পরম দয়ালু।",
                            "verse 52:29": "অতএব, আপনি উপদেশ দান করুন। আপনার পালনকর্তার কৃপায় আপনি অতীন্দ্রিয়বাদী নন এবং উম্মাদও নন।",
                            "verse 52:30": "তারা কি বলতে চায়ঃ সে একজন কবি আমরা তার মৃত্যু-দুর্ঘটনার প্রতীক্ষা করছি।",
                            "verse 52:31": "বলুনঃ তোমরা প্রতীক্ষা কর, আমিও তোমাদের সাথে প্রতীক্ষারত আছি।",
                            "verse 52:32": "তাদের বুদ্ধি কি এ বিষয়ে তাদেরকে আদেশ করে, না তারা সীমালংঘনকারী সম্প্রদায়?",
                            "verse 52:33": "না তারা বলেঃ এই কোরআন সে নিজে রচনা করেছে? বরং তারা অবিশ্বাসী।",
                            "verse 52:34": "যদি তারা সত্যবাদী হয়ে থাকে, তবেএর অনুরূপ কোন রচনা উপস্থিত করুক।",
                            "verse 52:35": "তারা কি আপনা-আপনিই সৃজিত হয়ে গেছে, না তারা নিজেরাই স্রষ্টা?",
                            "verse 52:36": "না তারা নভোমন্ডল ও ভূমন্ডল সৃষ্টি করেছে? বরং তারা বিশ্বাস করে না।",
                            "verse 52:37": "তাদের কাছে কি আপনার পালনকর্তার ভান্ডার রয়েছে, না তারাই সবকিছুর তত্ত্বাবধায়ক?",
                            "verse 52:38": "না তাদের কোন সিঁড়ি আছে, যাতে আরোহণ করে তারা শ্রবণ করে? থাকলে তাদের শ্রোতা সুস্পষ্ট প্রমাণ উপস্থিত করুক।",
                            "verse 52:39": "না তার কন্যা-সন্তান আছে আর তোমাদের আছে পুত্রসন্তান?",
                            "verse 52:40": "না আপনি তাদের কাছে পারিশ্রমিক চান যে, তাদের উপর জরিমানার বোঝা চেপে বসে?",
                            "verse 52:41": "না তাদের কাছে অদৃশ্য বিষয়ের জ্ঞান আছে যে, তারাই তা লিপিবদ্ধ করে?",
                            "verse 52:42": "না তারা চক্রান্ত করতে চায়? অতএব যারা কাফের, তারই চক্রান্তের শিকার হবে।",
                            "verse 52:43": "না তাদের আল্লাহ তা’আলা ব্যতীত কোন উপাস্য আছে? তারা যাকে শরীক করে, আল্লাহ তা’আলা তা থেকে পবিত্র।",
                            "verse 52:44": "তারা যদি আকাশের কোন খন্ডকে পতিত হতে দেখে, তবে বলে এটা তো পুঞ্জীভুত মেঘ।",
                            "verse 52:45": "তাদেরকে ছেড়ে দিন সেদিন পর্যন্ত, যেদিন তাদের উপর বজ্রাঘাত পতিত হবে।",
                            "verse 52:46": "সেদিন তাদের চক্রান্ত তাদের কোন উপকারে আসবে না এবং তারা সাহায্যপ্রাপ্তও হবে না।",
                            "verse 52:47": "গোনাহগারদের জন্যে এছাড়া আরও শাস্তি রয়েছে, কিন্তু তাদের অধিকাংশই তা জানে না।",
                            "verse 52:48": "আপনি আপনার পালনকর্তার নির্দেশের অপেক্ষায় সবর করুন। আপনি আমার দৃষ্টির সামনে আছেন এবং আপনি আপনার পালনকর্তêার সপ্রশংস পবিত্রতা ঘোষণা করুন যখন আপনি গাত্রোত্থান করেন।",
                            "verse 52:49": "এবং রাত্রির কিছু অংশে এবং তারকা অস্তমিত হওয়ার সময় তাঁর পবিত্রতা ঘোষণা করুন। করেন।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 52:1": "Кълна се в Планината",
                            "verse 52:2": "и в Книгата, написана",
                            "verse 52:3": "на разгънат свитък,",
                            "verse 52:4": "и в посещавания Дом,",
                            "verse 52:5": "и във въздигнатия",
                            "verse 52:6": "свод,",
                            "verse 52:7": "и в препълненото море -",
                            "verse 52:8": "мъчението на твоя Господ ще настъпи!",
                            "verse 52:9": "Никой не ще го отблъсне",
                            "verse 52:10": "в Деня, когато небето бурно се завърти",
                            "verse 52:11": "и планините силно се разместят.",
                            "verse 52:12": "Горко в този Ден за отричащите,",
                            "verse 52:13": "които в празнословие се забавляват!",
                            "verse 52:14": "В Деня, когато ще бъдат подкарани към огъня на Ада:",
                            "verse 52:15": "Това е Огънят, който взимахте за лъжа.",
                            "verse 52:16": "Магия ли е това, или не съзирате?",
                            "verse 52:17": "Горете там и да търпите, и да не търпите, все едно е за вас! Ще ви се въздаде само за вашите дела!",
                            "verse 52:18": "Богобоязливите ще са в градини и в блаженство,",
                            "verse 52:19": "радостни с онова, което им е дарил техният Господ и ги е предпазил техният Господ от мъчението на Ада.",
                            "verse 52:20": "Яжте и пийте със здраве за онова, което сте вършили!",
                            "verse 52:21": "Облегнати на подредени престоли.",
                            "verse 52:22": "Към онези, които вярват и тяхното потомство ги последва с вяра - ще присъединим към тях потомството им и не ще отнемем нищо от делата им.",
                            "verse 52:23": "И ще им дарим в изобилие плодове и месо, каквито пожелаят.",
                            "verse 52:24": "Ще си подават там един на друг чаша, от която не ще има нито празнословие, нито подбуда към грях.",
                            "verse 52:25": "И ще им прислужват юноши, които сякаш са скрити бисери.",
                            "verse 52:26": "И ще се обръщат един към друг, разпитвайки се.",
                            "verse 52:27": "Ще рекат: Бояхме се [от Аллах] и преди, когато бяхме сред своите роднини.",
                            "verse 52:28": "Но Аллах ни облагодетелства и ни опази от изгарящото мъчение.",
                            "verse 52:29": "Ние Го зовяхме и преди.",
                            "verse 52:30": "И поучавай [о, Мухаммад]! Ти не си - по милост от твоя Господ - нито гадател, нито луд.",
                            "verse 52:31": "Или казват: Ти си поет! Изчакваме превратностите на съдбата.",
                            "verse 52:32": "Кажи: Чакайте! И аз чакам с вас.",
                            "verse 52:33": "Нима умовете им повеляват това, или са престъпващи хора?",
                            "verse 52:34": "Или искат да кажат: Сам си го е съчинил! Не, те не вярват.",
                            "verse 52:35": "Нека донесат слово, подобно на него, ако казват истината!",
                            "verse 52:36": "Нима бяха сътворени от нищо, или те са творците?",
                            "verse 52:37": "Или те сътвориха небесата и земята? Не, ала не се убеждават.",
                            "verse 52:38": "Или при тях са съкровищниците на твоя Господ, или те са властващите?",
                            "verse 52:39": "Или имат стълба, от която подслушват? Тогава нека този от тях, който е чул нещо, да донесе явен довод!",
                            "verse 52:40": "Или за Него са дъщерите, а за вас - синовете?",
                            "verse 52:41": "Или искаш отплата от тях [о, Мухаммад], та са обременени от дълг?",
                            "verse 52:42": "Или при тях е неведомото и те записват?",
                            "verse 52:43": "Или кроят хитрина? Ала онези, които не вярват, те ще са надхитрените.",
                            "verse 52:44": "Или имат друг бог освен Аллах? Пречист е Аллах от онова, с което Го съдружават!",
                            "verse 52:45": "И дори да видят отломък, падащ от небето, казват: Скупчени облаци.",
                            "verse 52:46": "Остави ги, докато срещнат своя Ден, когато ще бъдат поразени от мълнията!",
                            "verse 52:47": "Деня, когато нито хитрината им ще ги избави, нито ще им се помогне.",
                            "verse 52:48": "А за угнетителите има и друго мъчение освен това, ала повечето от тях не знаят.",
                            "verse 52:49": "И бъди търпелив пред повелята на своя Господ! Ти наистина си пред Очите Ни.",
                            "verse 52:50": "И нощем Го прославяй, и при скриването на звездите! ставаш!"
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "以山岳盟誓，",
                            "verse 52:2": "以天經之書",
                            "verse 52:3": "寫於展開的皮紙者盟誓，",
                            "verse 52:4": "以眾人朝覲的天房盟誓，",
                            "verse 52:5": "以被升起的蒼穹盟誓，",
                            "verse 52:6": "以汪洋的大海盟誓，",
                            "verse 52:7": "你的主的刑罰，確是要實現的，",
                            "verse 52:8": "是任何人不能抵抗的。",
                            "verse 52:9": "在天體震動，",
                            "verse 52:10": "山岳逝去之日，",
                            "verse 52:11": "在那日，傷哉否認真理的人們，",
                            "verse 52:12": "即以妄言消遣的人們！",
                            "verse 52:13": "他們將被投入火獄。",
                            "verse 52:14": "這就是你們生前所否認的火刑。",
                            "verse 52:15": "這是魔術呢？還是你們看不見呢？",
                            "verse 52:16": "你們進火獄去吧！你們忍受其中的刑罰與否，隨你們的方便，那對於你們是一樣的。你們只受自己行為的報酬。",
                            "verse 52:17": "敬畏的人們，必定在樂園和恩澤中，",
                            "verse 52:18": "他們因主的賞賜而快樂，他們的主使他們得免於烈火的刑罰。",
                            "verse 52:19": "你們因自己的行為而愉快地吃喝吧！",
                            "verse 52:20": "他們靠在分列成行的床上，我將以白皙的、美目的女子做他們的伴侶。",
                            "verse 52:21": "自己信道，子孫也跟著信道者，我將使他們的子孫與他們同級，我不減少他們的善功一絲毫。每人應對自己的行為負責。",
                            "verse 52:22": "我將以他們所嗜好的水果和肉食供給他們，",
                            "verse 52:23": "他們在樂園中互遞（酒）杯，他們不因而出惡言，也不因而犯罪惡。",
                            "verse 52:24": "他們的僮僕輪流著服侍他們，那些僮僕，好象藏在蚌殼裡的珍珠一樣。",
                            "verse 52:25": "於是他們大家走向前來互相談論。",
                            "verse 52:26": "他們將說：「以前我們為自己的家屬確是戰戰兢兢的，",
                            "verse 52:27": "但真主已施恩於我們，並使我們得免於毒風的刑罰。",
                            "verse 52:28": "以前我們的確常常祈禱他，他確是仁愛的，確是至慈的。」",
                            "verse 52:29": "你應當教誨眾人，因為借你的主的恩典，你不是一個占卜者，也不是一個瘋人。",
                            "verse 52:30": "不然，他們說：「他是一個詩人，我們等待他遭逢厄運。」",
                            "verse 52:31": "你說：「你們等待吧！我確是與你們一同等待的。」",
                            "verse 52:32": "難道他們的理智命令他們說這句話嗎？不然，他們是放蕩的民眾。",
                            "verse 52:33": "難道他們說他曾捏造他嗎？不然，其實是他們不歸信。",
                            "verse 52:34": "叫他們作出象這樣的文辭來，如果他們是說實話的！",
                            "verse 52:35": "是他們從無到有被創造出來呢？還是他們自己就是創造者呢？",
                            "verse 52:36": "難道他們曾創造天地嗎？不然，是他們不確信真主。",
                            "verse 52:37": "是你的主的庫藏歸他們掌管呢？還是他們是那些庫藏的監督呢？",
                            "verse 52:38": "難道他們有一架天梯，可以登上去傾聽嗎？叫他們中的傾聽者拿一個明証來吧！",
                            "verse 52:39": "難道真主有女兒，你們有兒子嗎？",
                            "verse 52:40": "難道你向他們索取報酬，故他們為納稅而擔負太重？",
                            "verse 52:41": "難道他們能知幽玄，故能將它記錄下來？",
                            "verse 52:42": "難道他們欲用計謀嗎？不信道者，將自中其計。",
                            "verse 52:43": "難道除真主外，他們還有別的神靈嗎？真主是超乎他們所用以配他的。",
                            "verse 52:44": "如果他們看見天掉下來一塊，他們將說：「這是成堆的雲彩。」",
                            "verse 52:45": "你任隨他們吧！直到他們遭遇自己被震死的日子。",
                            "verse 52:46": "在那日，他們的計謀，對於他們毫無裨益，他們也不受援助。",
                            "verse 52:47": "不義的人們，在那日之前，必定要受一種刑罰，但他們大半不知道。",
                            "verse 52:48": "你應當忍受你的主的判決，因為你確是在我的眷顧之下的。你起來的時候，應當讚頌你的主；",
                            "verse 52:49": "在夜間和在星宿沒落之後，你應當讚頌他。 你應當忍受你的主的判決，因為你確是在我的眷顧之下的。你起來的時候，應當讚頌你的主；"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Při hoře Sinaji,",
                            "verse 52:2": "při Písmu sepsaném",
                            "verse 52:3": "na pergamenu rozprostřeném,",
                            "verse 52:4": "při chrámu navštěvovaném,",
                            "verse 52:5": "při střeše zdvižené,",
                            "verse 52:6": "při moři vzedmutém,",
                            "verse 52:7": "trest Pána tvého nevyhnutelně udeří",
                            "verse 52:8": "a není nikoho, kdo jej zadrží!",
                            "verse 52:9": "V den, kdy kymácení zakymácí nebem",
                            "verse 52:10": "a hory se vydají na cestu pochodem,",
                            "verse 52:11": "běda v ten den těm, kdo za lež to pokládali",
                            "verse 52:12": "a jen v planém tlachání zábavu nalézali!",
                            "verse 52:13": "V ten den budou vrženi do ohně pekelného postrkem!",
                            "verse 52:14": "Toto je oheň ten, jenž nazvali jste výmyslem.",
                            "verse 52:15": "Kouzlo je to, či snad nevidíte?",
                            "verse 52:16": "Hořte v něm a vytrvejte či nevytrvejte - vše pro vás jedno je, vždyť odměnu jen za to, co konali jste, dostáváte!\"",
                            "verse 52:17": "A bohabojní věru budou v zahradách a ve slastech,",
                            "verse 52:18": "radujíce se z toho, co Pán jejich jim uštědřil a že Pán jejich je trestu pekelného ušetřil.",
                            "verse 52:19": "Jezte a pijte ve zdraví v odměnu za to, co jste konali,",
                            "verse 52:20": "a spočívejte na pohovkách v řadách postavených!\" A oženíme je tam s dívkami velkých očí černých.",
                            "verse 52:21": "A těm, kdo uvěřili a jež jejich potomci ve víře následovali, potomky jejich do ráje přivedeme a nic jim z jejich skutků neubereme.",
                            "verse 52:22": "A ovocem a masem je opatříme podle jejich přání",
                            "verse 52:23": "a tam mezi sebou si poháry podávat budou, z nichž nepojde ani prázdné tlachání, ani k hříchům svádění;",
                            "verse 52:24": "a budou je tam chlapci obcházet, kteří perlám střeženým se budou podobat.",
                            "verse 52:25": "A budou se jeden k druhému obracet a vyptávat",
                            "verse 52:26": "řkouce: \"Byli jsme kdysi o rodiny své plni ne klidu úzkostného,",
                            "verse 52:27": "však Bůh nám milost uštědřil a ochránil nás před trestem vichru ohnivého,",
                            "verse 52:28": "zajisté vzývali jsme Ho již předtím, neb On věru dobroditelem je slitovným!\"",
                            "verse 52:29": "Připomínej! A díky dobrodiní Božímu nejsi ani věštec, ani džiny posedlý blázen!",
                            "verse 52:30": "Hovoří snad oni: \"Básník je to! Vyčkejme si tedy, jak osud jeho bude změněn!\"",
                            "verse 52:31": "Rci: \"Jen čekejte, já s vámi jsem také čekající!\"",
                            "verse 52:32": "Anebo jsou to snad sny, jež jim to vnukují, či lidé to jsou vzpurní?",
                            "verse 52:33": "Nebo říkají: \"On si to vymyslil!\" Však sami tomu nevěří.",
                            "verse 52:34": "Nechť tedy přijdou s vyprávěním podobným tomuto, jestliže pravdu hovoří!",
                            "verse 52:35": "Cožpak z ničeho byli stvořeni, či sami jsou stvořiteli,",
                            "verse 52:36": "anebo stvořili nebesa i zemi? Ne, oni nejsou přesvědčeni!",
                            "verse 52:37": "Či pokladnice Pána tvého vlastní, anebo jsou těmi, kdo zapisují,",
                            "verse 52:38": "či mají žebřík, na němž naslouchají? Nechť tedy ti, kdo z nich naslouchají, přinesou zjevné oprávnění!",
                            "verse 52:39": "Bůh že měl by míti dcery, zatímco vy máte syny?",
                            "verse 52:40": "Či žádáš snad nějakou odměnu, a oni jsou dluhy zatíženi?",
                            "verse 52:41": "Či znají nepoznatelné, takže zapisovat je mohou,",
                            "verse 52:42": "anebo o úklady usilují? Však nevěřící sami obelstěni budou.",
                            "verse 52:43": "Či mají božstvo jiné, než Bůh je? Oč slavnější Bůh než to, co se k Němu přidružuje!",
                            "verse 52:44": "A i kdyby viděli kusy nebe padat, určitě by říkali: \"To jsou jen mraky zhuštěné.",
                            "verse 52:45": "Nech je tedy být až do doby, kdy setkají se svým dnem, v němž budou bleskem sraženi,",
                            "verse 52:46": "se dnem, v němž nic nebude jim platna jejich lest a nedostane se jim pomoci.",
                            "verse 52:47": "Těm, kdo křivdili, se věru trestu dostane a ještě něčeho víc, však většina z nich to neví.",
                            "verse 52:48": "Ty však neochvějně na rozsudek svého Pána čekej, vždyť věru jsi Nám na očích! A oslavuj chválu Pána svého, když vstáváš,",
                            "verse 52:49": "a za noci i při hvězd odchodu Jej oslavuj! vstáváš,"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Bij de Berg",
                            "verse 52:2": "En bij het geschreven Boek,",
                            "verse 52:3": "Op uitgebreide perkament.",
                            "verse 52:4": "En bij het veelbezochte huis",
                            "verse 52:5": "En bij het hoogverheven dak",
                            "verse 52:6": "En bij de boordevolle oceaan,",
                            "verse 52:7": "Voorzeker, de straf van uw Heer zal worden voltrokken.",
                            "verse 52:8": "Er is niemand die haar kan afwenden.",
                            "verse 52:9": "De Dag waarop de hemel in beweging zal komen.",
                            "verse 52:10": "En de bergen zullen vergaan.",
                            "verse 52:11": "Dan wee op die Dag de loochenaars,",
                            "verse 52:12": "Die zich in ijdel gesprek vermaken.",
                            "verse 52:13": "De Dag waarop zij in het Vuur der hel zullen worden geslingerd:",
                            "verse 52:14": "(Men zal zeggen:) \"Dit is het Vuur dat gij placht te loochenen.",
                            "verse 52:15": "Is dit dan toverkunst of ziet gij niet?",
                            "verse 52:16": "Brandt daarin; en het zal voor u hetzelfde zijn, of gij geduld of ongeduld toont.",
                            "verse 52:17": "Voorwaar, de godvruchtigen zullen in tuinen en gelukzaligheid zijn,",
                            "verse 52:18": "Genietende van de gaven, die hun Heer hun heeft geschonken en hun Heer heeft hen voor de marteling van het Vuur behoed.",
                            "verse 52:19": "Eet en drinkt met genoegen wegens hetgeen gij placht te doen.",
                            "verse 52:20": "(U) op tronen nedervlijend die in rijen zijn gerangschikt.",
                            "verse 52:21": "En met de gelovigen zullen Wij hun nageslacht, dat hun in het geloof volgt, verenigen.",
                            "verse 52:22": "En Wij zullen hun een overvloed van fruit en vlees schenken, volgens hun wensen.",
                            "verse 52:23": "Daar zullen zij elkander een beker van hand tot hand reiken waarin ijdelheid noch zonde zal zijn.",
                            "verse 52:24": "En er zullen knapen rondgaan alsof zij welbewaakte paarlen zijn.",
                            "verse 52:25": "En zij zullen zich vragend tot elkander wenden.",
                            "verse 52:26": "Zij zullen zeggen: \"Voorheen vreesden wij ter wille van onze families.",
                            "verse 52:27": "Maar God is ons genadig geweest en heeft ons voor de marteling van de brandende wind behoed.",
                            "verse 52:28": "Wij plachten voorheen Hem te aanbidden.",
                            "verse 52:29": "Waarschuw daarom (o, profeet).",
                            "verse 52:30": "Zeggen zij: \"Hij is een dichter en wij wachten of te zijner tijd een ramp over hem komt?\"",
                            "verse 52:31": "Zeg: \"Wacht! Ik wacht ook met u.",
                            "verse 52:32": "Is het hun verstand, dat hun dit oplegt of zijn zij een opstandig volk?",
                            "verse 52:33": "Of zeggen zij: \"Hij heeft het verzonnen\"? - Neen, zij willen niet geloven -",
                            "verse 52:34": "Laat hen dan een woord hieraan gelijk naar voren brengen, als zij waarachtig zijn.",
                            "verse 52:35": "Zijn zij door niets geschapen of zijn zij (hun eigen) schepper?",
                            "verse 52:36": "Schiepen zij de hemelen en de aarde? Neen, zij willen geen zekerheid hebben.",
                            "verse 52:37": "Bezitten zij de schatten van uw Heer of zijn zij de bewaarders hiervan?",
                            "verse 52:38": "Hebben zij een ladder naar de hemel waardoor zij kunnen luisteren? Laat hun luisteraar dan openlijk gezag tonen.",
                            "verse 52:39": "Heeft Hij (God) dochters terwijl gij zonen hebt?",
                            "verse 52:40": "Vraagt gij loon van hen, zodat zij onder schulden gebukt gaan?",
                            "verse 52:41": "Bezitten zij het onzichtbare, zodat zij het kunnen neerschrijven?",
                            "verse 52:42": "Willen zij een plan smeden (tegen u)? Maar de ongelovigen zullen door hun eigen plan worden gevangen.",
                            "verse 52:43": "Hebben zij een andere God buiten God? God is verheven boven hetgeen zij met Hem vereenzelvigen.",
                            "verse 52:44": "En indien zij een stuk van de hemel zien vallen, zullen zij zeggen \"Opgehoopte wolken.",
                            "verse 52:45": "Laat hen daarom, totdat zij hun Dag ontmoeten waarop zij in onmacht zullen neervallen.",
                            "verse 52:46": "De Dag, waarop hun samenzwering hen niets zal baten noch zullen zij worden geholpen.",
                            "verse 52:47": "En voorwaar, voor de onrechtvaardigen is hiervoor een straf.",
                            "verse 52:48": "Wacht daarom geduldig op het oordeel van uw Heer.",
                            "verse 52:49": "En verheerlijk Hem ’s nachts en na het verbleken der sterren."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 52:1": "By the Mount,",
                            "verse 52:2": "And a Scripture inscribed",
                            "verse 52:3": "On fine parchment unrolled,",
                            "verse 52:4": "And the House frequented,",
                            "verse 52:5": "And the roof exalted,",
                            "verse 52:6": "And the sea kept filled,",
                            "verse 52:7": "Lo! the doom of thy Lord will surely come to pass;",
                            "verse 52:8": "There is none that can ward it off.",
                            "verse 52:9": "On the day when the heaven will heave with (awful) heaving,",
                            "verse 52:10": "And the mountains move away with (awful) movement,",
                            "verse 52:11": "Then woe that day unto the deniers",
                            "verse 52:12": "Who play in talk of grave matters;",
                            "verse 52:13": "The day when they are thrust with a (disdainful) thrust, into the fire of hell",
                            "verse 52:14": "(And it is said unto them): This is the Fire which ye were wont to deny.",
                            "verse 52:15": "Is this magic, or do ye not see ?",
                            "verse 52:16": "Endure the heat thereof, and whether ye are patient of it or impatient of it is all one for you.",
                            "verse 52:17": "Lo! those who kept their duty dwell in gardens and delight,",
                            "verse 52:18": "Happy because of what their Lord hath given them, and (because) their Lord hath warded off from them the torment of hell-fire.",
                            "verse 52:19": "(And it is said unto them): Eat and drink in health (as a reward) for what ye used to do,",
                            "verse 52:20": "Reclining on ranged couches.",
                            "verse 52:21": "And they who believe and whose seed follow them in faith, We cause their seed to join them (there), and We deprive them of nought of their (life’s) work.",
                            "verse 52:22": "And We provide them with fruit and meat such as they desire.",
                            "verse 52:23": "There they pass from hand to hand a cup wherein is neither vanity nor cause of sin.",
                            "verse 52:24": "And there go round, waiting on them menservants of their own, as they were hidden pearls.",
                            "verse 52:25": "And some of them draw near unto others, questioning,",
                            "verse 52:26": "Saying: Lo! of old, when we were with our families, we were ever anxious;",
                            "verse 52:27": "But Allah hath been gracious unto us and hath preserved us from the torment of the breath of Fire.",
                            "verse 52:28": "Lo! we used to pray unto Him of old.",
                            "verse 52:29": "Therefor warn (men, O Muhammad).",
                            "verse 52:30": "Or say they: (he is) a poet, (one) for whom we may expect the accident of time ?",
                            "verse 52:31": "Say (unto them): Except (your fill)! Lo! I am with you among the expectant.",
                            "verse 52:32": "Do their minds command them to do this, or are they an outrageous folk ?",
                            "verse 52:33": "Or say they: He hath invented it ? Nay, but they will not believe!",
                            "verse 52:34": "Then let them produce speech the like thereof, if they are truthful.",
                            "verse 52:35": "Or were they created out of naught ? Or are they the creators ?",
                            "verse 52:36": "Or did they create the heavens and the earth ? Nay, but they are sure of nothing!",
                            "verse 52:37": "Or do they own the treasures of thy Lord ? Or have they been given charge (thereof) ?",
                            "verse 52:38": "Or have they any stairway (unto heaven) by means of which they overhear (decrees).",
                            "verse 52:39": "Or hath He daughters whereas ye have sons ?",
                            "verse 52:40": "Or askest thou (Muhammad) a fee from them so that they are plunged in debt ?",
                            "verse 52:41": "Or possess they the Unseen so that they can write (it) down ?",
                            "verse 52:42": "Or seek they to ensnare (the messenger) ? But those who disbelieve, they are the ensnared!",
                            "verse 52:43": "Or have they any god beside Allah ? Glorified be Allah from all that they ascribe as partner (unto Him)!",
                            "verse 52:44": "And if they were to see a fragment of the heaven falling, they would say: A heap of clouds.",
                            "verse 52:45": "Then let them be (O Muhammad), till they meet their day, in which they will be thunder-stricken,",
                            "verse 52:46": "A day in which their guile will naught avail them, nor will they be helped.",
                            "verse 52:47": "And verily, for those who do wrong, there is a punishment beyond that.",
                            "verse 52:48": "So wait patiently (O Muhammad) for thy Lord’s decree, for surely thou art in Our sight; and hymn the praise of thy Lord when thou uprisest,",
                            "verse 52:49": "And in the night-time also hymn His praise, and at the setting of the stars."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 52:1": "By the Mount (of Revelation);",
                            "verse 52:2": "By a Decree inscribed",
                            "verse 52:3": "In a Scroll unfolded;",
                            "verse 52:4": "By the much-frequented Fane;",
                            "verse 52:5": "By the Canopy Raised High;",
                            "verse 52:6": "And by the Ocean filled with Swell;-",
                            "verse 52:7": "Verily, the Doom of thy Lord will indeed come to pass;-",
                            "verse 52:8": "There is none can avert it;-",
                            "verse 52:9": "On the Day when the firmament will be in dreadful commotion.",
                            "verse 52:10": "And the mountains will fly hither and thither.",
                            "verse 52:11": "Then woe that Day to those that treat (Truth) as Falsehood;-",
                            "verse 52:12": "That play (and paddle) in shallow trifles.",
                            "verse 52:13": "That Day shall they be thrust down to the Fire of Hell, irresistibly.",
                            "verse 52:14": "\"This:, it will be said, \"Is the Fire,- which ye were wont to deny!",
                            "verse 52:15": "\"Is this then a fake, or is it ye that do not see?",
                            "verse 52:16": "\"Burn ye therein: the same is it to you whether ye bear it with patience, or not: Ye but receive the recompense of your (own) deeds.",
                            "verse 52:17": "As to the Righteous, they will be in Gardens, and in Happiness,-",
                            "verse 52:18": "Enjoying the (Bliss) which their Lord hath bestowed on them, and their Lord shall deliver them from the Penalty of the Fire.",
                            "verse 52:19": "(To them will be said:) \"Eat and drink ye, with profit and health, because of your (good) deeds.",
                            "verse 52:20": "They will recline (with ease) on Thrones (of dignity) arranged in ranks; and We shall join them to Companions, with beautiful big and lustrous eyes.",
                            "verse 52:21": "And those who believe and whose families follow them in Faith,- to them shall We join their families: Nor shall We deprive them (of the fruit) of aught of their works: (Yet) is each individual in pledge for his deeds.",
                            "verse 52:22": "And We shall bestow on them, of fruit and meat, anything they shall desire.",
                            "verse 52:23": "They shall there exchange, one with another, a (loving) cup free of frivolity, free of all taint of ill.",
                            "verse 52:24": "Round about them will serve, (devoted) to them.",
                            "verse 52:25": "They will advance to each other, engaging in mutual enquiry.",
                            "verse 52:26": "They will say: \"Aforetime, we were not without fear for the sake of our people.",
                            "verse 52:27": "\"But God has been good to us, and has delivered us from the Penalty of the Scorching Wind.",
                            "verse 52:28": "\"Truly, we did call unto Him from of old: truly it is He, the Beneficent, the Merciful!\"",
                            "verse 52:29": "Therefore proclaim thou the praises (of thy Lord): for by the Grace of thy Lord, thou art no (vulgar) soothsayer, nor art thou one possessed.",
                            "verse 52:30": "Or do they say:- \"A Poet! we await for him some calamity (hatched) by Time!\"",
                            "verse 52:31": "Say thou: \"Await ye!- I too will wait along with you!\"",
                            "verse 52:32": "Is it that their faculties of understanding urge them to this, or are they but a people transgressing beyond bounds?",
                            "verse 52:33": "Or do they say, \"He fabricated the (Message)\"? Nay, they have no faith!",
                            "verse 52:34": "Let them then produce a recital like unto it,- If (it be) they speak the truth!",
                            "verse 52:35": "Were they created of nothing, or were they themselves the creators?",
                            "verse 52:36": "Or did they create the heavens and the earth? Nay, they have no firm belief.",
                            "verse 52:37": "Or are the Treasures of thy Lord with them, or are they the managers (of affairs)?",
                            "verse 52:38": "Or have they a ladder, by which they can (climb up to heaven and) listen (to its secrets)? Then let (such a) listener of theirs produce a manifest proof.",
                            "verse 52:39": "Or has He only daughters and ye have sons?",
                            "verse 52:40": "Or is it that thou dost ask for a reward, so that they are burdened with a load of debt?-",
                            "verse 52:41": "Or that the Unseen in it their hands, and they write it down?",
                            "verse 52:42": "Or do they intend a plot (against thee)? But those who defy God are themselves involved in a Plot!",
                            "verse 52:43": "Or have they a god other than God? Exalted is God far above the things they associate with Him!",
                            "verse 52:44": "Were they to see a piece of the sky falling (on them), they would (only) say: \"Clouds gathered in heaps!\"",
                            "verse 52:45": "So leave them alone until they encounter that Day of theirs, wherein they shall (perforce) swoon (with terror),-",
                            "verse 52:46": "The Day when their plotting will avail them nothing and no help shall be given them.",
                            "verse 52:47": "And verily, for those who do wrong, there is another punishment besides this: But most of them understand not.",
                            "verse 52:48": "Now await in patience the command of thy Lord: for verily thou art in Our eyes: and celebrate the praises of thy Lord the while thou standest forth,",
                            "verse 52:49": "And for part of the night also praise thou Him,- and at the retreat of the stars!"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 52:1": "By the Mount",
                            "verse 52:2": "and a Book inscribed",
                            "verse 52:3": "in a parchment unrolled,",
                            "verse 52:4": "by the House inhabited",
                            "verse 52:5": "and the roof uplifted",
                            "verse 52:6": "and the sea swarming,",
                            "verse 52:7": "surely thy Lord’s chastisement is about to fall;",
                            "verse 52:8": "there is none to avert it.",
                            "verse 52:9": "Upon the day when heaven spins dizzily",
                            "verse 52:10": "and the mountains are in motion,",
                            "verse 52:11": "woe that day unto those that cry lies,",
                            "verse 52:12": "such as play at plunging,",
                            "verse 52:13": "the day when they shall be pitched into the fire of Gehenna:",
                            "verse 52:14": "’This is the fire that you cried lies to!",
                            "verse 52:15": "What, is this magic, or is it you that do not see?",
                            "verse 52:16": "Roast in it! And bear you patiently, or bear not patiently, equal it is to you; you are only being recompensed for that you were working.",
                            "verse 52:17": "Surely the godfearing shall be in gardens and bliss,",
                            "verse 52:18": "rejoicing in that their Lord has given them; and their Lord shall guard them against the chastisement of Hell.",
                            "verse 52:19": "’Eat and drink, with wholesome appetite, for that you were working.",
                            "verse 52:20": "Reclining upon couches ranged in rows; and We shall espouse them to wide-eyed houris.",
                            "verse 52:21": "And those who believed, and their seed followed them in belief, We shall join their seed with them, and We shall not defraud them of aught of their work; every man shall be pledged for what he earned.",
                            "verse 52:22": "And We shall succour them with fruits and flesh such as they desire",
                            "verse 52:23": "while they pass therein a cup one to another wherein is no idle talk, no cause of sin,",
                            "verse 52:24": "and there go round them youths, their own, as if they were hidden pearls.",
                            "verse 52:25": "They advance one upon another, asking each other questions.",
                            "verse 52:26": "They say, ’We were before among our people, ever going in fear,",
                            "verse 52:27": "and God was gracious to us, and guarded us against the chastisement of the burning wind;",
                            "verse 52:28": "we were before ever calling upon Him; surely He is the All-benign, the All-compassionate.",
                            "verse 52:29": "Therefore remind! by thy Lord’s blessing thou art not a soothsayer neither possessed.",
                            "verse 52:30": "Or do they say, ’He is a poet for whom we await Fate’s uncertainty’?",
                            "verse 52:31": "Say: ’Await! I shall be awaiting with you.",
                            "verse 52:32": "Or do their intellects bid them do this? Or are they an insolent people?",
                            "verse 52:33": "Or do they say, ’He has invented it?’ Nay, but they do not believe.",
                            "verse 52:34": "Then let them bring a discourse like it, if they speak truly.",
                            "verse 52:35": "Or were they created out of nothing? Or are they the creators?",
                            "verse 52:36": "Or did they create the heavens and earth? Nay, but they have not sure faith.",
                            "verse 52:37": "Or are thy Lord’s treasuries in their keeping? Or are they the registrars?",
                            "verse 52:38": "Or have they a ladder whereon they listen? Then let any of them that has listened bring a clear authority.",
                            "verse 52:39": "Or has He daughters, and they sons?",
                            "verse 52:40": "Or askest thou them for a wage, and so they are weighed down with debt?",
                            "verse 52:41": "Or is the Unseen in their keeping, and so they are writing it down?",
                            "verse 52:42": "Or desire they to outwit? The unbelievers, they are the outwitted.",
                            "verse 52:43": "Or have they a god, other than God? Glory be to God, above that which they associate!",
                            "verse 52:44": "Even if they saw lumps falling from heaven, they would say, ’A massed cloud!’",
                            "verse 52:45": "Then leave them, till they encounter their day wherein they shall be thunderstruck,",
                            "verse 52:46": "the day when their guile shall avail them naught, and they shall not be helped.",
                            "verse 52:47": "And there surely awaits the evildoers a chastisement beyond even that, but most of them know it not.",
                            "verse 52:48": "And be thou patient under the judgment of thy Lord; surely thou art before Our eyes.",
                            "verse 52:49": "and proclaim the praise of thy Lord in the night, and at the declining of the stars."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 52:1": "CONSIDER Mount Sinai!",
                            "verse 52:2": "Consider",
                            "verse 52:3": "revelation, inscribed",
                            "verse 52:4": "on wide-open scrolls.",
                            "verse 52:5": "Consider the long-enduring house [of worship]!",
                            "verse 52:6": "Consider the vault [of heaven] raised high!",
                            "verse 52:7": "Consider the surf-swollen sea!",
                            "verse 52:8": "VERILY, [O man,] the suffering decreed by thy Sustainer [for the sinners] will indeed come to pass:",
                            "verse 52:9": "there is none who could avert it.",
                            "verse 52:10": "[It will come to pass] on the Day when the skies will be convulsed in [a great] convulsion,",
                            "verse 52:11": "and the mountains will move with [an awesome] movement.",
                            "verse 52:12": "Woe, then, on that Day to all who give the lie to the truth –",
                            "verse 52:13": "all those who [throughout their lives] but idly played with things vain –",
                            "verse 52:14": "on the Day when they shall be thrust into the fire with [an irresistible] thrust, [and will be told:]",
                            "verse 52:15": "\"This is the fire which you were wont to call a lie!",
                            "verse 52:16": "Was it, then, a delusion – or is it that you failed to see [its truth]?",
                            "verse 52:17": "Endure it !",
                            "verse 52:18": "But [whether you] bear yourselves with patience or without patience, it will be the same to you: you are but being requited for what you were wont to do.",
                            "verse 52:19": "",
                            "verse 52:20": "verily, the God-conscious will find themselves [on that Day] in gardens and in bliss,",
                            "verse 52:21": "rejoicing in all that their Sustainer will have granted them: for their Sustainer will have warded off from them all suffering through the blazing fire.",
                            "verse 52:22": "[And they will be told:] \"Eat and drink with good cheer as an outcome of what you were wont to do,",
                            "verse 52:23": "reclining on couches [of happiness] ranged in rows!\" And [in that paradise] We shall mate them with companions pure, most beautiful of eye.",
                            "verse 52:24": "And as for those who have attained to faith and whose offspring will have followed them in faith, We shall unite them with their offspring; and We shall not let aught of their deeds go to waste:",
                            "verse 52:25": "every human being will be held in pledge for whatever he has earned.",
                            "verse 52:26": "And We shall bestow on them fruit and meat in abundance – whatever they may desire:",
                            "verse 52:27": "and in that",
                            "verse 52:28": "they shall pass on to one another a cup which will not give rise to empty talk, and neither incite to sin.",
                            "verse 52:29": "And they will be waited upon by",
                            "verse 52:30": "youths, [as if they were children] of their own, [as pure] as if they were pearls hidden in their shells.",
                            "verse 52:31": "And they [who are thus blest] will turn to one another, asking each other [about their past lives].",
                            "verse 52:32": "They will say: \"Behold, aforetime – when we were [still living] in the midst of our kith and kin – we were full of fear [at the thought of God’s displeasure]:",
                            "verse 52:33": "and so God has graced us with His favour, and has warded off from us all suffering through the scorching winds [of frustration].",
                            "verse 52:34": "Verily, we did invoke Him",
                            "verse 52:35": "ere this: [and now He has shown us] that He alone is truly benign, a true dispenser of grace!\"",
                            "verse 52:36": "EXHORT, then, [O Prophet, all men:] for, by thy Sustainer’s grace, thou art neither a soothsayer nor a madman.",
                            "verse 52:37": "Or do they say, \"[He is but] a poet – let us await what time will do unto him\"?",
                            "verse 52:38": "Say thou: \"Wait,",
                            "verse 52:39": "hopefully; behold, I, too, shall hopefully wait with you!\"",
                            "verse 52:40": "Is it their minds that bid them [to take] this",
                            "verse 52:41": "– or are they",
                            "verse 52:42": "people filled with overweening arrogance?",
                            "verse 52:43": "Or do they say, \"He himself has composed this \"?Nay,",
                            "verse 52:44": "but they are not willing to believe!",
                            "verse 52:45": "But then, [if they deem it the work of a mere mortal,] let them produce another discourse like it – if what they say be true!",
                            "verse 52:46": "[Or do they deny the existence of God?] Have they themselves been created without anything [that might have caused their creation]? – or were they, perchance, their own creators?",
                            "verse 52:47": "",
                            "verse 52:48": "have they created the heavens and the earth?Nay, but they have no certainty of anything!",
                            "verse 52:49": "[How could they?] Are thy Sustainer’s treasures with them? Or are they in charge [of destiny]?",
                            "verse 52:50": "Or have they a ladder by which they could [ascend to ultimate truths and] listen [to what is beyond the reach of human perception]? Let, then, any of them who has listened [to it] produce a manifest proof [of his knowledge]!",
                            "verse 52:51": "Or, [if you believe in God, how can you believe that] He has [chosen to have] daughters, whereas you yourselves would have",
                            "verse 52:52": "sons?",
                            "verse 52:53": "Or is it that [they who reject thy message, O Muhammad, fear lest] thou ask of them a reward, so that they would be burdened with debt [if they should listen to thee]?",
                            "verse 52:54": "Or [do they think] that the hidden reality [of all that exists] is almost within their grasp, so that [in time] they can write it down?",
                            "verse 52:55": "Or do they want to entrap [thee in contradictions]? But they who are bent on denying the truth – it is they who are truly entrapped!",
                            "verse 52:56": "Have they, then, any deity other than God?Utterly remote is God, in His limitless glory, from anything to which men may ascribe a share in His divinity!",
                            "verse 52:57": "AND YET, if they [who refuse to see the truth] were to see part of the sky falling down, they would",
                            "verse 52:58": "say, \"[It is but] a mass of clouds!\"",
                            "verse 52:59": "Hence, leave them alone until they face that",
                            "verse 52:60": "Day of theirs, when they will be stricken with terror:",
                            "verse 52:61": "the Day when none of their scheming will be of the least avail to them, and they will receive no succour.",
                            "verse 52:62": "But, verily, for those who are bent on doing evil, there is suffering in store",
                            "verse 52:63": "closer at hand than that [supreme suffering in the hereafter]: but most of them are not aware of it.",
                            "verse 52:64": "And so, await in patience thy Sustainer’s judgment, for thou art well within Our sight.",
                            "verse 52:65": "and extol His glory at night, and at the time when the stars retreat."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 52:1": "…verily thou art beneath Our Eyes.",
                            "verse 52:2": "patiently for the fulfillment of they Lord’s decree, for verily thou art in Our sight; and glorify thy Lord with praise when thou uprisest.",
                            "verse 52:3": "And glorify Him in the night, and at the dimming of the stars.",
                            "verse 52:4": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 52:5": "The Book of Certainty (1952) •",
                            "verse 52:6": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 52:7": "What is Sufism (1975) •",
                            "verse 52:8": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 52:9": "Muhammad (1983) •",
                            "verse 52:10": "Symbol and Archetype (1991) •",
                            "verse 52:11": "Sufi Poems (2004) •",
                            "verse 52:12": "Mecca (2004) •",
                            "verse 52:13": "Return to the Spirit (2005) •",
                            "verse 52:14": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 52:15": "“Proofs of Islam”(1954).",
                            "verse 52:16": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 52:17": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 52:18": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 52:19": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 52:20": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 52:21": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 52:22": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 52:23": "“The Quranic Origins of Sufism” •",
                            "verse 52:24": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 52:25": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 52:26": "“An Introduction to Islam” •",
                            "verse 52:27": "“The Universality of the Quran” •",
                            "verse 52:28": "Private Talks Books",
                            "verse 52:29": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 52:1": "By the mount of Tūr,",
                            "verse 52:2": "and by a book, written",
                            "verse 52:3": "on an unrolled scroll,",
                            "verse 52:4": "and by the Populated House (Al-Bait-ul-Ma‘mūr) ,",
                            "verse 52:5": "and by the roof, raised high,",
                            "verse 52:6": "and by the sea, flared up (with fire),",
                            "verse 52:7": "the punishment of your Lord is sure to fall.",
                            "verse 52:8": "There is nothing to push it back,",
                            "verse 52:9": "the Day when the sky will tremble, a horrible trembling,",
                            "verse 52:10": "and the mountains will move about, a terrible movement.",
                            "verse 52:11": "So, woe to those who reject (the true faith),",
                            "verse 52:12": "who are indulged in vain talk, playing (with truth),",
                            "verse 52:13": "the Day they will be pushed to the Fire forcefully,",
                            "verse 52:14": "(and it will be said to them,) “This is the Fire you used to deny.",
                            "verse 52:15": "Is it then magic, or do you not see?",
                            "verse 52:16": "Enter it.",
                            "verse 52:17": "Of course, the God-fearing will be in gardens and bliss,",
                            "verse 52:18": "enjoying what their Lord will have given to them, and their Lord will have saved them from the punishment of Hell.",
                            "verse 52:19": "(It will be said to them,) “Eat and drink pleasantly because of what you used to do,",
                            "verse 52:20": "relaxing on lined up couches”.",
                            "verse 52:21": "And those who believed and their children followed them in belief, We will join their children with them, and will not curtail (the reward of) any of their deeds at all.",
                            "verse 52:22": "And We will go on giving them whatever they desire of fruits and meat.",
                            "verse 52:23": "They will snatch from one another (in a friendly manner) a glass (of wine) carrying neither absurd talk, nor something leading to sin.",
                            "verse 52:24": "And their own serving boys will rotate around them, (who will be as neat and clean) as if they were hidden pearls.",
                            "verse 52:25": "And they will advance to one another, asking (about each other’s welfare).",
                            "verse 52:26": "They will say, “Indeed we were afraid (of Allah’s punishment) when we were amidst our family,",
                            "verse 52:27": "but Allah did favour to us and saved us from the torment of Fire’s scorching breath.",
                            "verse 52:28": "We used to pray to Him before.",
                            "verse 52:29": "So keep reminding (them), because by the grace of your Lord, you are neither a soothsayer, nor a mad man.",
                            "verse 52:30": "Do they rather say, “He is a poet for whom we are awaiting the accident of death?”",
                            "verse 52:31": "Say, “Wait! I am waiting with you, too.",
                            "verse 52:32": "Is it their intellects that direct them to (say) this, or are they a rebellious people?",
                            "verse 52:33": "Do they rather say, “He has forged it (the Qur’ān.",
                            "verse 52:34": "So, let them bring a discourse like this, if they are truthful.",
                            "verse 52:35": "Is it that they are created by none, or are they themselves the creators?",
                            "verse 52:36": "Or have they created the heavens and the earth? No, but they are sure of nothing.",
                            "verse 52:37": "Or do they have the treasures of your Lord, or have they acquired control (over them)?",
                            "verse 52:38": "Or have they a stairway (to the heavens) by means of which they listen (to the divine decrees)? If so, their listener must bring a clear proof.",
                            "verse 52:39": "Is it that He has daughters and you have sons?",
                            "verse 52:40": "Or is it that you (O prophet) ask them for a fee, and therefore they are burdened with a liability?",
                            "verse 52:41": "Or have they the knowledge of the Unseen, and they are recording it?",
                            "verse 52:42": "Or do they intend to plan to do harm (to the prophet)? Then the disbelievers themselves shall be harmed by the plan.",
                            "verse 52:43": "Or do they have a god other than Allah? Pure is Allah from what they associate with Him.",
                            "verse 52:44": "Even if they see a piece falling down from the sky, they would say, “It is a cumulated cloud.",
                            "verse 52:45": "So, leave them alone until they face their Day, in which they will be turned unconscious,",
                            "verse 52:46": "the Day their planning will not benefit them in the least, nor will they be helped.",
                            "verse 52:47": "And for those who did wrong there is another punishment before that, but most of them do not know.",
                            "verse 52:48": "And (O Prophet) be patient about the decision of your Lord, because you are in front of Our Eyes.",
                            "verse 52:49": "And, in parts of night too, proclaim His purity, and at the time of setting of the stars."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 52:1": "By the Mount,",
                            "verse 52:2": "and an inscribed Book,",
                            "verse 52:3": "on an unrolled parchment.",
                            "verse 52:4": "By the",
                            "verse 52:5": "frequented House,",
                            "verse 52:6": "and the raised roof,",
                            "verse 52:7": "and the swarming sea:",
                            "verse 52:8": "lo! your Lord’s chastisement will assuredly take place;",
                            "verse 52:9": "there is none that can avert it.",
                            "verse 52:10": "On the day when the heaven will heave with a great heaving,",
                            "verse 52:11": "and the mountains move with a great motion.",
                            "verse 52:12": "Woe then on that day to the deniers,",
                            "verse 52:13": "those who play around in vain talk;",
                            "verse 52:14": "the day when they will be thrust with a violent thrust into Hell:",
                            "verse 52:15": "‘This is the Fire which you used to deny!",
                            "verse 52:16": "Is this then sorcery or is it that you do not see?",
                            "verse 52:17": "Burn in it! And whether you endure or do not endure will be the same for you.",
                            "verse 52:18": "Truly the God-fearing will be amid gardens and bliss,",
                            "verse 52:19": "rejoicing in what their Lord has given them, and",
                            "verse 52:20": "their Lord has shielded them from the chastisement of Hell-fire.",
                            "verse 52:21": "‘Eat and drink in full enjoyment [as a reward] for what you used to do’.",
                            "verse 52:22": "[They will be] reclining on ranged couches, and We will wed them to beautiful houris.",
                            "verse 52:23": "And those who believed and whom We made to be followed by their descendants in faith, We will make their descendants join them, and We will not deprive them of anything of their deeds.",
                            "verse 52:24": "And We will supply them with fruits and meat, such as they desire.",
                            "verse 52:25": "They will pass from one to another therein, a cup wherein is neither vain talk nor cause for sin.",
                            "verse 52:26": "And there will circulate from all around them youths of their own, as if they were hidden pearls.",
                            "verse 52:27": "And some among them will turn to one another, questioning each other.",
                            "verse 52:28": "They say: ‘Truly, before, amid our families, we used to be ever anxious;",
                            "verse 52:29": "but God showed us favour and shielded us from the piercing chastisement,",
                            "verse 52:30": "indeed before we used to call on Him.",
                            "verse 52:31": "So remind.",
                            "verse 52:32": "Or do they say: ‘A poet, for whom we may await the accidents of fate?’",
                            "verse 52:33": "Say: ‘Await! For I too will be with you awaiting’.",
                            "verse 52:34": "Or do their faculties of understanding prompt them to",
                            "verse 52:35": "this? Or are they a rebellious lot?",
                            "verse 52:36": "Or do they say, ‘He has improvised it?’ Rather they do not believe.",
                            "verse 52:37": "Then let them bring a discourse like it, if they are truthful.",
                            "verse 52:38": "Or were they created out of nothing? Or are they the creators?",
                            "verse 52:39": "Or did they create the heavens and the earth? Nay, but they are not certain.",
                            "verse 52:40": "Or do they possess the treasuries of your Lord? Or are they the ones in control?",
                            "verse 52:41": "Or do they have a ladder, whereby they eavesdrop? Then let their eavesdropper produce a manifest warrant.",
                            "verse 52:42": "Or does He have daughters, whereas you have sons?",
                            "verse 52:43": "Or are you asking them for a fee so that they are weighed down with debt?",
                            "verse 52:44": "Or do they have [access to] the Unseen so that they can write it down?",
                            "verse 52:45": "Or do they desire to outmanoeuvre? But those who disbelieve, they are the outmanoeuvred ones!",
                            "verse 52:46": "Or do they have a god other than God? Glory be to God [exalted is He] above any partners that they may ascribe!",
                            "verse 52:47": "And if they were to see a fragment of the heaven falling, they would say: ‘A heap of clouds!’",
                            "verse 52:48": "So leave them until they encounter that day of theirs in which they will be thunderstruck,",
                            "verse 52:49": "the day when their guile will avail them nothing and they will not be helped.",
                            "verse 52:50": "And assuredly for those who do wrong, there is a chastisement beyond that, but most of them do not know.",
                            "verse 52:51": "And submit patiently to the judgement of your Lord, for surely you fare before Our eyes.",
                            "verse 52:52": "and glorify Him at night and at the receding of the stars."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 52:1": "By (the Mountain) Tur,",
                            "verse 52:2": "And by the Book inscribed,",
                            "verse 52:3": "(Which is) on an Unfolded Scroll,",
                            "verse 52:4": "And by the House populated (by the angels i.",
                            "verse 52:5": "And by the Lofty Roof (i.",
                            "verse 52:6": "And by the swelling sea!",
                            "verse 52:7": "Surely, the torment of your Lord will do take place.",
                            "verse 52:8": "No one can avert it.",
                            "verse 52:9": "The Day when the heaven will shake with a terrible tremor,",
                            "verse 52:10": "And the mountains (leaving their locations) will fly fast (like clouds) and scatter (like dust particles),",
                            "verse 52:11": "So on that Day, woe to those who belie,",
                            "verse 52:12": "Those who are playing a game of negligence, rapt in falsehood (i.",
                            "verse 52:13": "The Day when they will be forcefully pushed towards the Fire of Hell,",
                            "verse 52:14": "(It will be said to them:) ‘This is the Fire of Hell you used to belie.",
                            "verse 52:15": "So is it magic, or do you not see?",
                            "verse 52:16": "Enter it.",
                            "verse 52:17": "Surely, the Godfearing will be in the Gardens and Bliss.",
                            "verse 52:18": "They will be delighted at (the bestowals) their Lord will have blessed them with.",
                            "verse 52:19": "(It will be said to them:) ‘Relish food and drink as a reward for the (pious) deeds which you used to do.",
                            "verse 52:20": "They will be reclining (sitting) on couches arranged in rows, and We will marry them to maidens with fair colour (and) fascinating eyes.",
                            "verse 52:21": "And those who believe and whose children follow them in faith, We shall also unite their children with them (in the ranks of Paradise even if their actions would not fall in that grade.",
                            "verse 52:22": "And We will keep giving them fruit and meat more and more as they desire.",
                            "verse 52:23": "There, they will take the cups (of holy drink) by grabbing.",
                            "verse 52:24": "And (the serving) youths will go round them as if they were pearls kept hidden in covers.",
                            "verse 52:25": "And they will turn to one another, enquiring well-being.",
                            "verse 52:26": "They will say: ‘Surely before this, we used to live in fear (of Allah’s torment) in our homes.",
                            "verse 52:27": "So Allah has been Gracious to favour us and has saved us from the punishment of the Fire of Hell.",
                            "verse 52:28": "Indeed, we used to worship Him alone beforehand.",
                            "verse 52:29": "So, (O Esteemed Beloved,) continue to admonish (them).",
                            "verse 52:30": "Do the disbelievers say: ‘(He is) a poet for whom we look forward to some temporal disasters’?",
                            "verse 52:31": "Say: ‘Wait on, I am also waiting together with you (for your destruction).",
                            "verse 52:32": "Do their mental faculties suggest them this (foolishness), or are they rioters and rebels?",
                            "verse 52:33": "Or do they say: ‘He (the Messenger) has invented it (the Qur’an) himself’? (No indeed;) rather they simply do not believe (in the truth).",
                            "verse 52:34": "So let them produce a treatise like this (Qur’an) if they are truthful.",
                            "verse 52:35": "Have they been created by nothing, or are they themselves the creators?",
                            "verse 52:36": "Or did they create the heavens and the earth themselves? (No,) in fact, they do not have any faith (in the truth).",
                            "verse 52:37": "Or do they own the treasures of your Lord? Or are they guards and watchmen over them?",
                            "verse 52:38": "Or do they have any ladder (by which they ascend) and listen stealthily (to the heaven)? So let the listener amongst them bring the clear proof.",
                            "verse 52:39": "Are there daughters for Him (the Lord) and sons for you?",
                            "verse 52:40": "Do you ask them for wages that they are weighed down with debt?",
                            "verse 52:41": "Do they have (the knowledge of) the unseen that they write down?",
                            "verse 52:42": "Do they seek to deceive (you) by trickery? Those who disbelieve are being caught in their own trap.",
                            "verse 52:43": "Do they have any god other than Allah? Glory be to Allah, above all what they set up as a partner (with Allah).",
                            "verse 52:44": "And if they see a fragment of the sky falling (on them, even then) they will say: ‘It is a layered (thick) cloud.",
                            "verse 52:45": "So leave them (in their plight) till they meet that Day of theirs when they will be destroyed,",
                            "verse 52:46": "The Day when their plots will be of no use to them, nor will they be helped.",
                            "verse 52:47": "And for those who are committed to doing wrong, there is a torment for them besides this torment as well but most of them do not know.",
                            "verse 52:48": "And, (O Esteemed Beloved, do not grieve over what they say).",
                            "verse 52:49": "And also glorify Him during the hours of the night and (in later part of it) when the stars fade out."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Nimeen Vuoren",
                            "verse 52:2": "ja Pyhän Kirjan,",
                            "verse 52:3": "joka on kirjoitettu levitetylle pergamentille,",
                            "verse 52:4": "ja temppelin, johon pyhiinvaelletaan,",
                            "verse 52:5": "nimeen korkean taivaan laen",
                            "verse 52:6": "ja aavan meren,",
                            "verse 52:7": "totisesti, Herrasi rangaistus on tuleva;",
                            "verse 52:8": "kukaan ei voi sitä välttää.",
                            "verse 52:9": "Päivänä, jolloin taivas vavahtaa paikaltaan",
                            "verse 52:10": "ja vuoret siirtyvät,",
                            "verse 52:11": "voi tuona päivänä niitä, jotka hylkäävät totuuden,",
                            "verse 52:12": "niitä, jotka ilkamoivat pitäen turhia puheita,",
                            "verse 52:13": "päivänä, jona heidät väkisin ajetaan helvetin tuleen!",
                            "verse 52:14": "»Tämä on se tuli, jota te piditte keksintönä.",
                            "verse 52:15": "Onko se noituutta vai ettekö näe?",
                            "verse 52:16": "Käykää sinne ja kestäkää se tai olkaa kestämättä, se on teille yhdentekevää.",
                            "verse 52:17": "Totisesti ovat ne, jotka karttavat pahaa, puutarhoissa ja autuudessa",
                            "verse 52:18": "iloiten Herransa antimista ja siitä, että heidän Herransa pelasti heidät palavan tulen kidutuksesta.",
                            "verse 52:19": "Syökää ja juokaa iloiten palkaksi siitä, mitä teitte.",
                            "verse 52:20": "He saavat levätä riveihin asetetuilla istuimilla, ja Minä yhdistän heidät puhtaisiin, tummasilmäisiin neitoihin,",
                            "verse 52:21": "ja ne, jotka uskovat ja joiden jälkeläiset seuraavat heitä uskossa, Me yhdistämme jälkeläisiiinsä, ja Me emme vähimmässäkään halvenna heidän töitään.",
                            "verse 52:22": "Ja Me varustamme heidät yltäkylläisesti hedelmillä ja lihalla heidän toivomuksiensa mukaan.",
                            "verse 52:23": "He ojentavat siellä toisilleen pikarin ilman turhaa puhetta ja syntiä,",
                            "verse 52:24": "ja heidän ympärillään on nuorukaisia, kauniita kuin helmet kuoressaan.",
                            "verse 52:25": "ja muutamat heistä tekevät toisilleen kysymyksiä,",
                            "verse 52:26": "ja he sanovat: »Totisesti pelkäsimme ennen perheittemme vuoksi,",
                            "verse 52:27": "mutta Jumala on ollut meille armollinen, ja Hän on pelastanut meidät polttavan tuulen kurituksesta.",
                            "verse 52:28": "Totisesti olemme vain Häntä kutsuneet avuksi; Hän on totisesti lempeä, armollinen.",
                            "verse 52:29": "Jatka sentähden kehoituksiasi, sillä Herrasi armosta sinä et ole noita etkä hullu.",
                            "verse 52:30": "Vai sanovatko he: »Runoniekka! Me odotamme mitä aika mukanansa tuo.",
                            "verse 52:31": "Sano: »Odottakaa, sillä totisesti kuulun minäkin niihin, jotka odottavat.",
                            "verse 52:32": "Käskeekö heidän järkensä heitä menettelemään näin? Vai ovatko he väärämielisiä ihmisiä?",
                            "verse 52:33": "Vai sanovatko he: »Hän on itse sepittänyt sen?» Niin, he eivät usko.",
                            "verse 52:34": "Antakoot he sitten itse samanlaisen ilmoituksen, jos rakastavat totuutta.",
                            "verse 52:35": "Onko heidät luotu tyhjästä vai ovatko he luojia?",
                            "verse 52:36": "Tai ovatko he luoneet taivaat ja maan? Ei, heillä ei ole varmuutta.",
                            "verse 52:37": "Tai onko heillä hallussaan Herransa aarteet, tai onko heille annettu ehdoton valta?",
                            "verse 52:38": "Tai onko heillä keinot, joilla voivat kuunnella? Tuokoot sitten kuuntelijat selvän todistuksen.",
                            "verse 52:39": "Tai onko Hänellä tyttäriä ja teillä poikia?",
                            "verse 52:40": "Tai pyydätkö sinä heiltä palkkaa, niin että he kantavat velkojen taakkaa.",
                            "verse 52:41": "Tai hallitsevatko he näkymätöntä, niin että he voivat kirjoittaa sen muistiin?",
                            "verse 52:42": "Tai tahtovatko he sotaa? Mutta juuri ne, jotka eivät usko.",
                            "verse 52:43": "Tai onko heillä joku muu kuin Jumala? Kunnia olkoon Jumalalle, joka on kaukana siitä, mitä he asettavat Hänen rinnalleen.",
                            "verse 52:44": "Ja jos he näkisivät osan taivaasta suistuvan alas, he sanoisivat: »Pilviä päällekkäin!»",
                            "verse 52:45": "Jätä heidät siis oman onnensa nojaan, kunnes heidät kohtaa päivä, jolloin salama iskee heihin.",
                            "verse 52:46": "Päivä, jolloin heidän ponnistelunsa eivät heitä hyödytä eikä heillä ole mitään apua.",
                            "verse 52:47": "Totisesti kuritetaan jumalattomia muullakin tavalla, mutta useimmat heistä ovat tietoa vailla.",
                            "verse 52:48": "Odota kärsivällisesti Herrasi tuomiota, sillä totisesti valvovat silmämme sinua, ja kiitä ja ylistä Herraa aamulla noustessasi.",
                            "verse 52:49": "Myös yöllä anna Hänelle kunnia ja samoin tähtien taivaalta hälvetessä."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 52:1": "Par le Mont !",
                            "verse 52:2": "Par un Livre écrit",
                            "verse 52:3": "sur un parchemin déroulé !",
                            "verse 52:4": "Par la Maison peuplée !",
                            "verse 52:5": "Par la voûte élevée !",
                            "verse 52:6": "Par la mer démontée !",
                            "verse 52:7": "Le châtiment de ton Seigneur est inéluctable ;",
                            "verse 52:8": "rien ne pourra le repousser,",
                            "verse 52:9": "le Jour où le ciel sera agité de remous",
                            "verse 52:10": "et où les montagnes se mettront en marche,",
                            "verse 52:11": "Malheur, ce Jour-là, à ceux qui crient au mensonge,",
                            "verse 52:12": "à ceux qui parlent de choses graves en se jouant.",
                            "verse 52:13": "Ce Jour-là, ils seront précipités dans le feu de la Géhenne :",
                            "verse 52:14": "\" Voici le feu que vous traitiez de mensonge !",
                            "verse 52:15": "Est-ce là de la sorcellerie, ou est-ce vous qui ne voyez rien ?",
                            "verse 52:16": "Brûlez-y ! Supportez-le ou ne le supportez pas, cela revient au même pour vous.",
                            "verse 52:17": "Certes, ceux qui craignent Dieu seront dans des jardins, dans des délices,",
                            "verse 52:18": "jouissant de ce que leur Seigneur leur aura donné.",
                            "verse 52:19": "\" Mangez et buvez avec profit, en récompense de vos actions,",
                            "verse 52:20": "accoudés sur des lits de repos bien alignés \".",
                            "verse 52:21": "Quant aux croyants que leurs descendants ont suivi dans la foi, Nous les réunirons avec leur postérité et Nous ne retrancherons rien de leurs œuvres.",
                            "verse 52:22": "Nous leur procurerons les fruits et les viandes de leurs souhaits.",
                            "verse 52:23": "Ils feront circuler des coupes qui n'inciteront ni à des propos malsonnants ni au péché.",
                            "verse 52:24": "De jeunes éphèbes s'empresseront autour d'eux, semblables à des perles cachées.",
                            "verse 52:25": "Se tournant les uns vers les autres, ils s'interrogeront.",
                            "verse 52:26": "Ils diront : \" Nous nous faisions jadis mille soucis pour notre famille.",
                            "verse 52:27": "Dieu nous a comblés de faveurs, Il nous a épargné le châtiment de la Fournaise.",
                            "verse 52:28": "Jadis déjà, nous L'implorions ; Il est le Compatissant, le Clément ! \"",
                            "verse 52:29": "Invoque-Moi donc ! Tu n'es, par la grâce de ton Seigneur, ni un devin, ni un possédé !",
                            "verse 52:30": "Diront-ils : \" C'est un poète ! Nous attendons avec lui les vicissitudes du destin \" ?",
                            "verse 52:31": "Dis : \" Attendez ! Je serai alors, avec vous, de ceux qui attendent ! \"",
                            "verse 52:32": "Est-ce leurs songes qui leur ordonnent de parler ainsi, ou sont-ils des gens rebelles ?",
                            "verse 52:33": "Ou bien diront-ils : \" Il l'a inventé ! \" Non vraiment, ils ne croient pas.",
                            "verse 52:34": "Qu'ils produisent donc un discours semblable à celui-ci, s'ils sont sincères.",
                            "verse 52:35": "Ont-ils été créés de rien ou sont-ils eux-mêmes les créateurs ?",
                            "verse 52:36": "Est-ce eux qui ont créé les cieux et la terre ? Non vraiment, ils ne sont sûrs de rien !",
                            "verse 52:37": "Possèdent-ils les trésors de ton Seigneur ou en ont-ils la charge ?",
                            "verse 52:38": "Ont-ils une échelle pour aller écouter ?.",
                            "verse 52:39": "Dieu aurait-il des filles comme vous avez des fils ?",
                            "verse 52:40": "Leur demandes-tu un salaire alors qu'eux seraient criblés de dettes ?",
                            "verse 52:41": "Ont-ils accès au Mystère insondable et écrivent-ils [dans un Livre] ?",
                            "verse 52:42": "Veulent-ils tendre un piège ? Mais ce sont les mécréants qui seront piégés !",
                            "verse 52:43": "Ont-ils une divinité autre que Dieu ? Gloire à Dieu au-dessus de ce qu'ils Lui associent !",
                            "verse 52:44": "S'ils voyaient un pan du ciel s'écrouler, ils diraient : \" Ce sont des nuages amoncelés \".",
                            "verse 52:45": "Laisse-les donc jusqu'à ce qu'ils rencontrent leur Jour, celui où ils seront foudroyés ;",
                            "verse 52:46": "le Jour où leur ruse ne leur servira de rien et où ils ne seront pas secourus.",
                            "verse 52:47": "Les iniques subiront certainement un châtiment plus sévère encore, mais la plupart d'entre eux n'en savent rien.",
                            "verse 52:48": "Supporte patiemment le jugement de ton Seigneur, car tu es sous Nos yeux.",
                            "verse 52:49": "Glorifie-le une partie de la nuit et au déclin des étoiles ! lèves."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 52:1": "Par At-Tur !",
                            "verse 52:2": "Et par un Livre écrit",
                            "verse 52:3": "Sur un parchemin déployé !",
                            "verse 52:4": "et par la Maison peuplée !",
                            "verse 52:5": "Et par la Voûte élevée !",
                            "verse 52:6": "Et par la Mer portée à ébullition ! (au Jour dernier)",
                            "verse 52:7": "Le châtiment de ton Seigneur aura lieu inévitablement.",
                            "verse 52:8": "Nul ne pourra le repousser.",
                            "verse 52:9": "Le jour où le ciel sera agité d’un tourbillonnement,",
                            "verse 52:10": "et les montagnes se mettront en marche.",
                            "verse 52:11": "Ce jour-là, malheur à ceux qui traitent (les signes de Dieu) de mensonges,",
                            "verse 52:12": "ceux qui s’ébattent dans des discours frivoles",
                            "verse 52:13": "le jour où ils seront brutalement poussés au feu de l’Enfer :",
                            "verse 52:14": "Voilà le feu que vous traitiez de mensonge.",
                            "verse 52:15": "Est-ce que cela est de la magie ? Ou bien ne voyez-vous pas clair ?",
                            "verse 52:16": "Brûlez dedans ! Supportez ou ne supportez pas, ce sera égal pour vous : vous n’êtes rétribués que selon ce que vous faisiez.",
                            "verse 52:17": "Les pieux seront dans des Jardins et dans des délices,",
                            "verse 52:18": "se réjouissant de ce que leur Seigneur leur aura donné, et leur Seigneur les aura protégés du châtiment de la Fournaise.",
                            "verse 52:19": "«En récompense de ce que vous faisiez, mangez et buvez en toute sérénité,",
                            "verse 52:20": "accoudés sur des lits bien rangés», et Nous leur ferons épouser des houris aux grands yeux noirs,",
                            "verse 52:21": "Ceux qui auront cru et que leurs descendants auront suivis dans la foi, Nous ferons que leurs descendants les rejoignent.",
                            "verse 52:22": "Nous les pourvoirons abondamment des fruits et des viandes qu’ils désireront.",
                            "verse 52:23": "Là, ils se passeront les uns les autres une coupe qui ne provoquera ni vanité ni incrimination.",
                            "verse 52:24": "Et parmi eux circuleront des garçons à leur service, pareils à des perles bien conservées.",
                            "verse 52:25": "et ils se tourneront les uns vers les autres s’interrogeant;",
                            "verse 52:26": "Ils diront : «Nous vivions au milieu des nôtres dans la crainte [de Dieu];",
                            "verse 52:27": "Puis Dieu nous a favorisés et protégés du châtiment du Samum .",
                            "verse 52:28": "Antérieurement, nous L’invoquions.",
                            "verse 52:29": "Rappelle donc et par la grâce de ton Seigneur tu n’es ni un devin ni un possédé;",
                            "verse 52:30": "Ou bien ils disent : «C’est un poète ! Attendons pour lui le coup de la mort».",
                            "verse 52:31": "Dis : «Attendez ! Je suis avec vous parmi ceux qui attendent».",
                            "verse 52:32": "Est-ce leur raison qui leur commande cela ? Ou sont-ils des gens outranciers ?",
                            "verse 52:33": "Ou bien ils disent : «Il l’a inventé lui-même ? » Non.",
                            "verse 52:34": "Eh bien, qu’ils produisent un récit pareil à lui (le Coran), s’ils sont véridiques.",
                            "verse 52:35": "Ont-ils été créés à partir de rien ou sont-ils eux les créateurs ?",
                            "verse 52:36": "Ou ont-ils créé les cieux et la terre ? Mais ils n’ont plutôt aucune conviction.",
                            "verse 52:37": "Possèdent-ils les trésors de ton Seigneur ? Ou sont-ils eux les maîtres souverains ?",
                            "verse 52:38": "Ont-ils une échelle d’où ils écoutent ? Que celui des leurs qui reste à l’écoute apporte une preuve évidente !",
                            "verse 52:39": ":",
                            "verse 52:40": "aurait-Il les filles, tandis que vous, les fils ?",
                            "verse 52:41": "Ou leur demandes-tu un salaire, de sorte qu’ils soient grevés d’une lourde dette ?",
                            "verse 52:42": "Ou bien détiennent-ils l’Inconnaissable pour le mentionner par écrit ?",
                            "verse 52:43": "Ou cherchent-ils un stratagème ? Mais ce sont ceux qui ont mécru qui sont victimes de leur propre stratagème.",
                            "verse 52:44": "Ou ont-ils une autre divinité à part Dieu ? que Dieu soit glorifié et purifié de tout ce qu’ils associent !",
                            "verse 52:45": "Et s’ils voient tomber des fragments du ciel, ils disent : «Ce sont des nuages superposés».",
                            "verse 52:46": "Laisse-les donc, jusqu’à ce qu’ils rencontrent leur jour où ils seront foudroyés,",
                            "verse 52:47": "le jour où leur ruse ne leur servira à rien, où ils ne seront pas secourus.",
                            "verse 52:48": "Les injustes auront un châtiment préalable.",
                            "verse 52:49": "et supporte patiemment la décision de ton Seigneur.",
                            "verse 52:50": "Glorifie-Le une partie de la nuit et au déclin des étoiles."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Bei dem Berge Tür;",
                            "verse 52:2": "Und bei dem Buch, das geschrieben.",
                            "verse 52:3": "Auf feinem, ausgebreitetem Pergament;",
                            "verse 52:4": "Und bei dem viel besuchten Haus;",
                            "verse 52:5": "Und bei (seinem) erhöhten Dach;",
                            "verse 52:6": "Und beim geschwellten Ozean;",
                            "verse 52:7": "Die Strafe deines Herrn trifft sicher ein.",
                            "verse 52:8": "Keinen gibt es, der sie abzuwenden vermöchte",
                            "verse 52:9": "Am Tage, da der Himmel furchtbar schwanken wird",
                            "verse 52:10": "Und die Berge sich vom Platze bewegen werden.",
                            "verse 52:11": "Wehe also an jenem Tage denen, die die Wahrheit verwerfen,",
                            "verse 52:12": "Die sich mit eitler Rede vergnügen.",
                            "verse 52:13": "Am Tage, da sie ins Feuer der Hölle gestoßen werden mit Gewalt:",
                            "verse 52:14": "«Das ist das Feuer, das ihr zu leugnen pflegtet.",
                            "verse 52:15": "Ist dies wohl Zauberwerk, oder seht ihr tatsächlich nicht?",
                            "verse 52:16": "Geht nun dort ein; und ob ihr euch geduldig erweist oder ungeduldig, es wird für euch gleich sein.",
                            "verse 52:17": "Die Gerechten werden in Gärten und in Glückseligkeit sein,",
                            "verse 52:18": "Genießend die Gaben, die ihr Herr ihnen bescheren wird; und ihr Herr wird sie vor der Pein des Feuers bewahren.",
                            "verse 52:19": "«Esset und trinket und wohl bekomm's, um dessentwillen, was ihr zu tun pflegtet.",
                            "verse 52:20": "Gelehnt werden sie sein auf gereihten Ruhekissen.",
                            "verse 52:21": "Und diejenigen, die glauben und deren Nachkommen ihnen im Glauben folgen, mit denen wollen Wir ihre Nachkommen vereinen.",
                            "verse 52:22": "Und Wir werden ihnen eine Fülle von Früchten und Fleisch bescheren, wie sie es nur wünschen mögen.",
                            "verse 52:23": "Dort werden sie einander einen Becher reichen von Hand zu Hand, worin weder Eitelkeit noch Sünde ist.",
                            "verse 52:24": "Und unter ihnen werden ihre Jünglinge aufwartend die Runde machen, gleich wohlbehüteten Perlen.",
                            "verse 52:25": "Und sie werden sich fragend einer an den andern wenden.",
                            "verse 52:26": "Sie werden sprechen: «Wahrlich, früher, unter unseren Angehörigen waren wir besorgt.",
                            "verse 52:27": "Doch Allah ist uns gnädig gewesen und hat uns vor der Pein des sengenden Winds bewahrt.",
                            "verse 52:28": "Wir pflegten vormals zu Ihm zu beten.",
                            "verse 52:29": "Ermahne drum; durch die Gnade deines Herrn bist du weder ein Wahrsager noch ein Besessener.",
                            "verse 52:30": "Sprechen sie etwa: «(Er ist) ein Dichter; wir wollen das Unheil abwarten, das die Zeit über ihn bringen wird»?",
                            "verse 52:31": "Sprich: «Wartet nur! Ich bin mit euch unter den Wartenden.",
                            "verse 52:32": "Ist es ihr Verstand, der ihnen solches anbefiehlt, oder sind sie ein widerspenstiges Volk?",
                            "verse 52:33": "Sprechen sie: «Er hat es erdichtet»? Nein, aber sie wollen nicht glauben.",
                            "verse 52:34": "Laß sie denn eine Rede gleich dieser vorbringen, wenn sie die Wahrheit sprechen!",
                            "verse 52:35": "Sind sie wohl aus nichts erschaffen worden, oder sind sie gar selbst die Schöpfer?",
                            "verse 52:36": "Schufen sie die Himmel und die Erde? Nein, aber sie haben keine Gewißheit.",
                            "verse 52:37": "Haben sie die Schätze deines Herrn zu eigen, oder sind sie die Hüter?",
                            "verse 52:38": "Haben sie eine Leiter, auf der sie lauschen können? Dann möge ihr Lauscher einen deutlichen Beweis beibringen.",
                            "verse 52:39": "Hat Er wohl Töchter, und ihr habt Söhne?",
                            "verse 52:40": "Verlangst du einen Lohn von ihnen, so daß sie mit einer Schuldenlast beladen sind?",
                            "verse 52:41": "Besitzen sie das Ungesehene, so daß sie (es) niederschreiben?",
                            "verse 52:42": "Beabsichtigen sie eine List? Aber wider die Ungläubigen werden Listen geschmiedet.",
                            "verse 52:43": "Haben sie einen Gott statt Allah? Hoch erhaben ist Allah über all das, was sie anbeten!",
                            "verse 52:44": "Und sähen sie ein Stück von der Wolke niederfallen, sie würden sprechen: «Aufgeschichtete Wolken.",
                            "verse 52:45": "So laß sie allein, bis sie ihrem Tag begegnen, an dem sie ohnmächtig werden sollen,",
                            "verse 52:46": "Dem Tag, an dem ihre List ihnen nichts nützen wird - noch wird ihnen Hilfe kommen.",
                            "verse 52:47": "Und für jene, die freveln, ist eine Strafe außer dieser.",
                            "verse 52:48": "So harre geduldig auf den Befehl deines Herrn, denn du bist vor Unseren Augen; und verherrliche deinen Herrn mit Seiner Lobpreisung, wenn du aufstehst,",
                            "verse 52:49": "Und auch in einem Teil der Nacht preise Ihn und beim Erblassen der Sterne."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "¼dksgs½ rwj dh d+le",
                            "verse 52:2": "vkSj mldh fdrkc ¼ykSgs egQwt+½ dh",
                            "verse 52:3": "tks d+q’kknk vkSjkd+ esa fy[kh gq;h gS",
                            "verse 52:4": "vkSj cSrqy ekewj dh ¼tks dkck ds lkeus Qfj’rksa dk fd+Cyk gS½",
                            "verse 52:5": "vkSj Å¡ph Nr ¼vkleku½ dh",
                            "verse 52:6": "vkSj tks’k o [+kjks’k okys leqUnz dh",
                            "verse 52:7": "fd rqEgkjs ijojfnxkj dk vt+kc cs’kd okds+, gksdj jgsxk",
                            "verse 52:8": "¼vkSj½ bldk dksbZ jksdus okyk ugha",
                            "verse 52:9": "ftl fnu vkleku pDdj [kkus yxsxk",
                            "verse 52:10": "vkSj igkM+ mM+us yxssaxs",
                            "verse 52:11": "rks ml fnu >qBykus okyksa dh [+kjkch gS",
                            "verse 52:12": "tks yksx ckfry esa iM+s [ksy jgs gSa",
                            "verse 52:13": "ftl fnu tgUuqe dh vkx dh rjQ mudks <dsy <dsy ys tk,¡xs",
                            "verse 52:14": "¼vkSj muls dgk tk,xk½ ;gh og tgUuqe gS ftls rqe >qByk;k djrs Fks",
                            "verse 52:15": "rks D;k ;s tknw gS ;k rqedks ut+j gh ugha vkrk",
                            "verse 52:16": "blh esa ?kqlks fQj lcz djks ;k cslczh djks ¼nksuksa½ rqEgkjs fy, ;dlk¡ gSa rqEgsa rks cl mUgha dkeksa dk cnyk feysxk tks rqe fd;k djrs Fks",
                            "verse 52:17": "cs’kd ijgst+xkj yksx ckx+ksa vkSj usverksa esa gksaxs",
                            "verse 52:18": "tks ¼tks usversa½ muds ijojfnxkj us mUgsa nh gSa muds et+s ys jgs gSa vkSj mudk ijojfnxkj mUgsa nkst+[+k ds vt+kc ls cpk,xk",
                            "verse 52:19": "tks tks dkjxqt+kfj;k¡ rqe dj pqds gks muds flys esa ¼vkjke ls½ r[+rksa ij tks cjkcj fcNs gq, gSa",
                            "verse 52:20": "rfd, yxkdj [+kwc et+s ls [kkvks fi;ks vkSj ge cM+h cM+h vk¡[kksa okyh gwj ls mudk C;kg jpk,¡xs",
                            "verse 52:21": "vkSj ftu yksxksa us bZeku d++qcwy fd;k vkSj mudh vkSykn us Hkh bZeku esa mudk lkFk fn;k rks ge mudh vkSykn dks Hkh muds ntsZ igq¡pk nsaxs vkSj ge mudh dkjxqt+kfj;ksa esa ls dqN Hkh de u djsaxs gj Ó[+l vius vkeky ds cnys esa fxjoh gS",
                            "verse 52:22": "vkSj ftl fd+Le ds esos vkSj xks’r dks mudk th pkgsxk ge mUgsa c<+kdj vrk djsaxs",
                            "verse 52:23": "ogk¡ ,d nwljs ls Ójkc dk tke ys fy;k djsaxs ftlesa u dksbZ csgwnxh gS vkSj u xqukg",
                            "verse 52:24": "¼vkSj f[+kner ds fy,½ ukStoku yM+ds muds vkl ikl pDdj yxk;k djsaxs og ¼gqLu o teky esa½ xks;k ,gfr;kr ls j[ks gq, eksrh gSa",
                            "verse 52:25": "vkSj ,d nwljs dh rjQ :[+k djds ¼yqRQ dh½ ckrsa djsaxs",
                            "verse 52:26": "¼muesa ls dqN½ dgsaxs fd ge blls igys vius ?kj esa ¼[+kqnk ls cgqr½ Mjk djrs Fks",
                            "verse 52:27": "rks [+kqnk us ge ij cM+k ,glku fd;k vkSj gedks ¼tgUuqe dh½ ykS ds vt+kc ls cpk fy;k",
                            "verse 52:28": "blls d+Cy ge muls nqvk,¡ fd;k djrs Fks cs’kd og ,glku djus okyk esgjcku gS",
                            "verse 52:29": "rks ¼,s jlwy½ rqe ulhgr fd, tkvks rks rqe vius ijojfnxkj ds Qt+y ls u dkfgu gks vkSj u etuwu fd;k",
                            "verse 52:30": "D;k ¼rqedks½ ;s yksx dgrs gSa fd ¼;s½ Ók;j gSa ¼vkSj½ ge rks mlds ckjs esa t+ekus ds gokfnl dk bUrst+kj dj jgs gSa",
                            "verse 52:31": "rqe dg nks fd ¼vPNk½ rqe Hkh bUrst+kj djks eSa Hkh bUrst+kj djrk gw¡",
                            "verse 52:32": "D;k mudh vD+ysa mUgsa ;s ¼ckrsa½ crkrh gSa ;k ;s yksx gSa gh ljd’k",
                            "verse 52:33": "D;k ;s yksx dgrs gSa fd blus d+qjku [+kqn x<+ fy;k gS ckr ;s gS fd ;s yksx bZeku gh ugha j[krs",
                            "verse 52:34": "rks vxj ;s yksx lPps gSa rks ,slk gh dyke cuk rks yk,¡",
                            "verse 52:35": "D;k ;s yksx fdlh ds ¼iSnk fd;s½ cx+Sj gh iSnk gks x, gSa ;k ;gh yksx ¼e[++kywd+kr ds½ iSnk djus okys gSa",
                            "verse 52:36": ";k bUgksus gh us lkjs vkleku o t+ehu iSnk fd, gSa ¼ugha½ cfYd ;s yksx ;d+hu gh ugha j[krs",
                            "verse 52:37": "D;k rqEgkjs ijojfnxkj ds [+kt+kus bUgha ds ikl gSa ;k ;gh yksx gkfde gSa",
                            "verse 52:38": ";k muds ikl dksbZ lh<+h gS ftl ij ¼p<+ dj vkleku ls½ lqu vkrs gSa tks lqu vk;k djrk gks rks og dksbZ ljhgh nyhy is’k djs",
                            "verse 52:39": "D;k [+kqnk ds fy, csfV;k¡ gSa vkSj rqe yksxksa ds fy, csVs",
                            "verse 52:40": ";k rqe muls ¼rcyhx+s fjlkyr dh½ mtjr ek¡xrs gks fd ;s yksx dt+Z ds cks> ls ncs tkrs gSa",
                            "verse 52:41": ";k bu yksxksa ds ikl x+Sc ¼dk bYe½ gS fd og fy[k ysrs gSa",
                            "verse 52:42": ";k ;s yksx dqN nk¡o pykuk pkgrs gSa rks tks yksx dkfQ+j gSa og [+kqn vius nkao esa Q¡ls gSa",
                            "verse 52:43": ";k [+kqnk ds flok budk dksbZ ¼nwljk½ ekcwn gS ftu pht+ksa dks ;s yksx ¼[+kqnk dk½ Ójhd cukrs gSa og mlls ikd vkSj ikd+ht+k gS",
                            "verse 52:44": "vkSj vxj ;s yksx vkleku ls dksbZ vt+kc ¼vt+kc dk½ VqdM+k fxjrs gq, ns[ksa rks cksy mBsaxs ;s rks nynkj ckny gS",
                            "verse 52:45": "rks ¼,s jlwy½ rqe budks budh gkyr ij NksM+ nks ;gk¡ rd fd og ftlesa ;s csgks’k gks tk,¡xs",
                            "verse 52:46": "buds lkeus vk tk, ftl fnu u budh eDdkjh gh dqN dke vk,xh vkSj u budh enn gh dh tk,xh",
                            "verse 52:47": "vkSj blesa Ód ugha fd t+kfyeksa ds fy, blds vykok vkSj Hkh vt+kc gS exj muesa cgqrsjs ugha tkurs gSa",
                            "verse 52:48": "vkSj ¼,s jlwy½ rqe vius ijojfnxkj ds gqDe ls bUrst+kj esa lcz fd, jgks rks rqe fcYdqy gekjh fuxsgnk’r esa gks rks tc rqe mBk djks rks vius ijojfnxkj dh gEn dh rLchg fd;k djks",
                            "verse 52:49": "vkSj dqN jkr dks Hkh vkSj flrkjksa ds x++q:c gksus ds ckn rLchg fd;k djks"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Demi bukit,",
                            "verse 52:2": "dan Kitab yang ditulis,",
                            "verse 52:3": "pada lembaran yang terbuka,",
                            "verse 52:4": "dan demi Baitul Ma’mur.",
                            "verse 52:5": "dan atap yang ditinggikan (langit),",
                            "verse 52:6": "dan laut yang di dalam tanahnya ada api,",
                            "verse 52:7": "sesungguhnya azab Tuhanmu pasti terjadi,",
                            "verse 52:8": "tidak seorang pun yang dapat menolaknya,",
                            "verse 52:9": "pada hari ketika langit benar-benar bergoncang,",
                            "verse 52:10": "dan gunung benar-benar berjalan.",
                            "verse 52:11": "Maka kecelakaan yang besarlah di hari itu bagi orang-orang yang mendustakan,",
                            "verse 52:12": "(yaitu) orang-orang yang bermain-main dalam kebatilan,",
                            "verse 52:13": "pada hari mereka didorong ke neraka Jahanam dengan sekuat-kuatnya.",
                            "verse 52:14": "(Dikatakan kepada mereka): \"Inilah neraka yang dahulu kamu selalu mendustakannya\".",
                            "verse 52:15": "Maka apakah ini sihir? Ataukah kamu tidak melihat?",
                            "verse 52:16": "Masuklah kamu ke dalamnya (rasakanlah panas apinya); maka baik kamu bersabar atau tidak, sama saja bagimu; kamu diberi balasan terhadap apa yang telah kamu kerjakan.",
                            "verse 52:17": "Sesungguhnya orang-orang yang bertakwa berada dalam surga dan kenikmatan,",
                            "verse 52:18": "mereka bersuka ria dengan apa yang diberikan kepada mereka oleh Tuhan mereka; dan Tuhan mereka memelihara mereka dari azab neraka.",
                            "verse 52:19": "(Dikatakan kepada mereka): \"Makan dan minumlah dengan enak sebagai balasan dari apa yang telah kamu kerjakan\",",
                            "verse 52:20": "mereka bertelekan di atas dipan-dipan berderetan dan Kami kawinkan mereka dengan bidadari-bidadari yang cantik bermata jeli.",
                            "verse 52:21": "Dan orang-orang yang beriman, dan yang anak cucu mereka mengikuti mereka dalam keimanan, Kami hubungkan anak cucu mereka dengan mereka, dan Kami tiada mengurangi sedikitpun dari pahala amal mereka.",
                            "verse 52:22": "Dan Kami beri mereka tambahan dengan buah-buahan dan daging dari segala jenis yang mereka ingini.",
                            "verse 52:23": "Di dalam surga mereka saling memperebutkan piala (gelas) yang isinya tidak (menimbulkan) kata-kata yang tidak berfaedah dan tiada pula perbuatan dosa.",
                            "verse 52:24": "Dan berkeliling di sekitar mereka anak-anak muda untuk (melayani) mereka, seakan-akan mereka itu mutiara yang tersimpan.",
                            "verse 52:25": "Dan sebahagian mereka menghadap kepada sebahagian yang lain saling tanya-menanya.",
                            "verse 52:26": "Mereka berkata: \"Sesungguhnya kami dahulu, sewaktu berada di tengah-tengah keluarga kami merasa takut (akan diazab)\".",
                            "verse 52:27": "Maka Allah memberikan karunia kepada kami dan memelihara kami dari azab neraka.",
                            "verse 52:28": "Sesungguhnya kami dahulu menyembah-Nya.",
                            "verse 52:29": "Maka tetaplah memberi peringatan, dan kamu disebabkan nikmat Tuhanmu bukanlah seorang tukang tenung dan bukan pula seorang gila.",
                            "verse 52:30": "Bahkan mereka mengatakan: \"Dia adalah seorang penyair yang kami tunggu-tunggu kecelakaan menimpanya\".",
                            "verse 52:31": "Katakanlah: \"Tunggulah, maka sesungguhnya aku pun termasuk orang yang menunggu (pula) bersama kamu\".",
                            "verse 52:32": "Apakah mereka diperintah oleh pikiran-pikiran mereka untuk mengucapkan tuduhan-tuduhan ini ataukah mereka kaum yang melampaui batas?",
                            "verse 52:33": "Ataukah mereka mengatakan: \"Dia (Muhammad) membuat-buatnya\".",
                            "verse 52:34": "Maka hendaklah mereka mendatangkan kalimat yang semisal Al Qur'an itu jika mereka orang-orang yang benar.",
                            "verse 52:35": "Apakah mereka diciptakan tanpa sesuatu pun ataukah mereka yang menciptakan (diri mereka sendiri)?",
                            "verse 52:36": "Ataukah mereka telah menciptakan langit dan bumi itu?; sebenarnya mereka tidak meyakini (apa yang mereka katakan).",
                            "verse 52:37": "Ataukah di sisi mereka ada perbendaharaan Tuhanmu atau merekakah yang berkuasa?",
                            "verse 52:38": "Ataukah mereka mempunyai tangga (ke langit) untuk mendengarkan pada tangga itu (hal-hal yang gaib)? Maka hendaklah orang yang mendengarkan di antara mereka mendatangkan suatu keterangan yang nyata.",
                            "verse 52:39": "Ataukah untuk Allah anak-anak perempuan dan untuk kamu anak-anak laki-laki?",
                            "verse 52:40": "Ataukah kamu meminta upah kepada mereka sehingga mereka dibebani dengan utang?",
                            "verse 52:41": "Apakah ada pada sisi mereka pengetahuan tentang yang gaib lalu mereka menuliskannya?",
                            "verse 52:42": "Ataukah mereka hendak melakukan tipu daya? Maka orang-orang yang kafir itu merekalah yang kena tipu daya.",
                            "verse 52:43": "Ataukah mereka mempunyai tuhan selain Allah.",
                            "verse 52:44": "Jika mereka melihat sebagian dari langit gugur, mereka akan mengatakan: \"Itu adalah awan yang bertindih-tindih\".",
                            "verse 52:45": "Maka biarkanlah mereka hingga mereka menemui hari (yang dijanjikan kepada) mereka yang pada hari itu mereka dibinasakan,",
                            "verse 52:46": "(yaitu) hari ketika tidak berguna bagi mereka sedikit pun tipu daya mereka dan mereka tidak ditolong.",
                            "verse 52:47": "Dan sesungguhnya untuk orang-orang yang lalim ada azab selain itu.",
                            "verse 52:48": "Dan bersabarlah dalam menunggu ketetapan Tuhanmu, maka sesungguhnya kamu berada dalam penglihatan Kami, dan bertasbihlah dengan memuji Tuhanmu ketika kamu bangun berdiri,",
                            "verse 52:49": "dan bertasbihlah kepada-Nya pada beberapa saat di malam hari dan di waktu terbenam bintang-bintang (di waktu fajar)."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Per il Monte ,",
                            "verse 52:2": "per un Libro scritto",
                            "verse 52:3": "su pergamena distesa,",
                            "verse 52:4": "per la Casa visitata ,",
                            "verse 52:5": "per la volta elevata ,",
                            "verse 52:6": "per il mare ribollente.",
                            "verse 52:7": "Il castigo del tuo Signore avverrà inevitabilmente,",
                            "verse 52:8": "nessuno potrà impedirlo.",
                            "verse 52:9": "Il Giorno in cui il cielo tremante tremerà",
                            "verse 52:10": "e le montagne si metteranno in marcia,",
                            "verse 52:11": "guai in quel Giorno, a coloro che tacciano di menzogna,",
                            "verse 52:12": "a coloro che si dilettano nella vanità!",
                            "verse 52:13": "Il Giorno in cui saranno spinti brutalmente nel fuoco dell'Inferno,",
                            "verse 52:14": "[sarà detto loro]: «Ecco il fuoco che tacciavate di menzogna!",
                            "verse 52:15": "E' magia questa? O siete voi che non vedete?",
                            "verse 52:16": "Entrateci! Che lo sopportiate oppure no, sarà per voi la stessa cosa.",
                            "verse 52:17": "In verità i timorati saranno nei Giardini, nelle delizie,",
                            "verse 52:18": "a godersi quello che il loro Signore avrà dato loro.",
                            "verse 52:19": "[Sarà detto loro]: « Mangiate e bevete in serenità, [ricompensa questa ] per quel che avete fatto! ».",
                            "verse 52:20": "",
                            "verse 52:21": "appoggiati su divani disposti in ranghi e daremo loro in spose le fanciulle dai grandi occhi neri.",
                            "verse 52:22": "Coloro che avranno creduto e che saranno stati seguiti nella fede dalla loro progenie, Noi li riuniremo ai loro figli.",
                            "verse 52:23": "Provvederemo loro i frutti e le carni che desidereranno.",
                            "verse 52:24": "Si scambieranno un calice immune da vanità o peccato.",
                            "verse 52:25": "E per servirli circoleranno tra loro giovanetti simili a perle nascoste.",
                            "verse 52:26": "Si andranno vicendevolmente incontro, interpellandosi.",
                            "verse 52:27": "Diranno: «Vivevamo tra la nostra gente nel timore [di Allah]",
                            "verse 52:28": "ma Allah ci ha favorito e ci ha protetti del castigo del Soffio Infuocato .",
                            "verse 52:29": "Già noi Lo invocavamo.",
                            "verse 52:30": "Ammonisci dunque, poiché per grazia del tuo Signore non sei né un indovino né un folle.",
                            "verse 52:31": "Diranno: «E' un poeta, aspettiamo che subisca qualche vicissitudine mortale» .",
                            "verse 52:32": "Di': « Aspettate, ché anch'io aspetterò con voi ».",
                            "verse 52:33": "E' la loro ragione che li induce a ciò, o sono un popolo di superbi?",
                            "verse 52:34": "Diranno: « Lo ha inventato lui stesso».",
                            "verse 52:35": "Producano dunque un discorso simile a questo, se sono sinceri.",
                            "verse 52:36": "Sono stati forse creati dal nulla oppure sono essi stessi i creatori?",
                            "verse 52:37": "O hanno creato i cieli e la terra? In realtà non sono affatto convinti .",
                            "verse 52:38": "Hanno presso di loro i tesori del tuo Signore o sono loro i dominatori?",
                            "verse 52:39": "Hanno forse una scala per ascoltare ? Chi ascolta per conto loro, lo provi irrefutabilmente.",
                            "verse 52:40": "",
                            "verse 52:41": "avrebbe forse figlie e voi figli ?",
                            "verse 52:42": "Forse chiedi loro un compenso,",
                            "verse 52:43": "che si sentano gravati da un peso insopportabile ?",
                            "verse 52:44": "Possiedono l'invisibile in modo tale da descriverlo?",
                            "verse 52:45": "Vogliono tramare un'insidia? Saranno piuttosto i miscredenti ad essere ingannati.",
                            "verse 52:46": "Oppure hanno un altro dio all'infuori di Allah? Gloria a Lui, Egli è ben al di sopra di quanto",
                            "verse 52:47": "associano.",
                            "verse 52:48": "Se vedessero cadere un pezzo di cielo, direbbero: «E' un cumulo di nuvole».",
                            "verse 52:49": "Lasciali",
                            "verse 52:50": "dunque, finché non incontreranno quel loro Giorno in cui saranno folgorati,",
                            "verse 52:51": "il Giorno in cui la loro astuzia non gioverà loro in alcunché e non saranno aiutati.",
                            "verse 52:52": "In verità gli ingiusti saranno puniti già prima di quello.",
                            "verse 52:53": "Sopporta con pazienza il decreto del tuo Signore , poiché in verità sei sotto i Nostri occhi.",
                            "verse 52:54": "e glorificaLo durante la notte e al declinare delle stelle."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "かの（啓示の）山にかけて（誓う）。",
                            "verse 52:2": "整然と書き記された啓典にかけて，",
                            "verse 52:3": "巻かれていない羊皮紙に，",
                            "verse 52:4": "不断に詣でられる聖殿にかけて，",
                            "verse 52:5": "高く掲げられた天蓋にかけて，",
                            "verse 52:6": "漲り(温?)れる大洋にかけて（誓う）。",
                            "verse 52:7": "本当に主の懲罰は必ず下る。",
                            "verse 52:8": "それは避け得ない。",
                            "verse 52:9": "その日，天は大いにゆらゆらと揺れ，",
                            "verse 52:10": "また山々は揺ぎ動くであろう。",
                            "verse 52:11": "その日，（真理を）虚偽であるとした者に災いあれ。",
                            "verse 52:12": "虚しい事に戯れていた者たちに。",
                            "verse 52:13": "かれらが（もの凄い力で）地獄の火の中に突き落されるその日，",
                            "verse 52:14": "（こう言われよう。）「これこそは，あなたがたが虚偽であるとしていた地獄の業火である。",
                            "verse 52:15": "これでも魔術なのか。それともあなたがたは，見えないのか。",
                            "verse 52:16": "あなたがたはそこで焼かれるがいい。あなたがたがそれを耐え忍んでも，忍ばなくても同じこと。あなたがたが行ったことに，報いられるだけである。」",
                            "verse 52:17": "主を畏れた者たちは必ず楽園の歓びの中に置り，",
                            "verse 52:18": "主がかれらに与えるものに歓喜し，また主が獄火の懲罰からかれらを救われたことを喜ぶ。",
                            "verse 52:19": "（かれらには言われよう。）「楽しんで食べ，且つ飲め。これもあなたがたの（善い）行いのためである」。",
                            "verse 52:20": "かれらは並べられたソファーに寄りかかり，われは美しい目の乙女たちをかれらの配偶者にするであろう。",
                            "verse 52:21": "信仰する者たち，またかれらに従った信心深い子孫の者たち，われは，それらの者を（楽園において）一緒にする。かれらの凡ての行為に対し，少しも（報奨を）軽減しないであろう。誰もがその稼ぎにたいし，報酬を受ける。",
                            "verse 52:22": "またわれは果物，肉，その外かれらの望むものを与えよう。",
                            "verse 52:23": "かれらはそこで互いに杯を交そう。その時にも虚しい話にふけることなく，乱暴も犯さない。",
                            "verse 52:24": "かれらの周には，秘められた真珠のような子供が傅いて巡る。",
                            "verse 52:25": "かれらは互いに近寄って，尋ね合い，",
                            "verse 52:26": "言っていた。「以前，わたしたちは家族の間にいてもいつも気を遺っていた。",
                            "verse 52:27": "だがアッラーは，わたしたちに御恵みを与えられ，熱風の懲罰から御救い下された。",
                            "verse 52:28": "以前からわたしたちは，かれに祈っていたのです。本当にかれは恵み厚く，慈悲深き御方であられる」",
                            "verse 52:29": "さあ，かれらに訓戒しなさい。主の恩恵によって，あなたは占い師でも気違いでもない。",
                            "verse 52:30": "またかれらは，「只の詩人だ。かれの運勢が逆転するのを待とう」と言う。",
                            "verse 52:31": "言ってやるがいい。「待っているがいい。わたしもあなたがたと共に待っていよう。」",
                            "verse 52:32": "一体かれらの貧しい理解力がこう命じたのか，それともかれらは法外な民なのか。",
                            "verse 52:33": "または，「かれ（ムハンマド）がこれを偽作したのである。」と言うのか。いや，かれらは信じてはいないのである。",
                            "verse 52:34": "もしかれらの言葉が真実なら，これと同じ御告げをもってこさせるがよい。",
                            "verse 52:35": "かれらは無から創られたのではないか。それともかれら自身が創造者なのか。",
                            "verse 52:36": "それともかれらが，天と地を創造したのか。いや，かれらにはしっかりした信仰がないのである。",
                            "verse 52:37": "それともかれらは，あなたの主の様々な宝物を持っているのか。または（事物の）管理者なのか。",
                            "verse 52:38": "それともかれらには梯子があって，それで（天に登り，その秘密を）聞くことが出来るのか。それなら聞いたという者に，明確な証拠を持って来させるがよい。",
                            "verse 52:39": "それともあなたがたには息子があって，かれには娘がある（だけ）というのか。",
                            "verse 52:40": "それともあなたが，かれらに報酬を求め，それでかれらは負債の重荷を負っているというのか。",
                            "verse 52:41": "それとも幽玄界のことがすっかり分っていて，それを書き留めているというのか。",
                            "verse 52:42": "それとも（あなたに対して）策を巡らす積もりか。だが背信者たちこそ，策謀にかかるであろう。",
                            "verse 52:43": "それともかれらは，アッラー以外に神があるというのか。アッラーに讃えあれ，かれは配するもの（邪神）の上にいと高くおられる。",
                            "verse 52:44": "仮令天の一角が（かれらの上に）落ちるのを見ても，かれらは，「積み重なった雲です。」と言うであろう。",
                            "verse 52:45": "かれらは，（恐れのために）そこに昏� する（審判の）日に会うまで，放って置け。",
                            "verse 52:46": "その日かれらの策謀は，何の益もなく，結局かれらは助けられないであろう。",
                            "verse 52:47": "本当に不義な行いの者には，この外にも懲罰がある。だが，かれらの多くは気付かない。",
                            "verse 52:48": "それで主の裁きを耐え忍んで待て。本当にわれはあなたがたを見守っている。そしてあなたが立ち上がる時は，主を讃えなさい。",
                            "verse 52:49": "夜中に，また星々が退く時にも，かれを讃えなさい。 それで主の裁きを耐え忍んで待て。本当にわれはあなたがたを見守っている。そしてあなたが立ち上がる時は，主を讃えなさい。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "뚜르 산으로 맹세하사",
                            "verse 52:2": "기록된 성서로 맹세하며",
                            "verse 52:3": "그것은 펼쳐진 양피지에 기록 된 것이라",
                            "verse 52:4": "경배하기 위해 방문이 잦은 카으바 신전으로 맹세하며",
                            "verse 52:5": "높은 하늘로 맹세하며",
                            "verse 52:6": "만조가 된 바다로 맹세하나니",
                            "verse 52:7": "그대 주님의 벌은 반드시 내 릴 것이라",
                            "verse 52:8": "어느 누구도 그것을 피할 수 없노라",
                            "verse 52:9": "하늘이 진동하는 날",
                            "verse 52:10": "그리고 산들이 휘날리는 날",
                            "verse 52:11": "그날을 거역한 자들에게 재 앙이 있을 것이라",
                            "verse 52:12": "그들은 허위에 몰두한 자들로",
                            "verse 52:13": "그날에 소리치며 불지윽으로 끌려가니",
                            "verse 52:14": "이것이 바로 너희가 거역했 던 불지옥이라 말하여 지더라",
                            "verse 52:15": "이것도 마술이뇨 아니면 너 희가 보지를 못하느뇨",
                            "verse 52:16": "그곳으로 들어가 맛보라 너희가 그것을 인내하던 또는 인내 하지 못하던 그것은 너희 행위에 대한 보상이라",
                            "verse 52:17": "그러나 의로운 자들은 은혜 의 천국으로 들어가",
                            "verse 52:18": "주님께서 그들에게 베풀 축 복을 만끽하고 또한 그들의 주님 은 불지옥의 응벌로부터 그들을 보호하여 주시노라",
                            "verse 52:19": "유익하고 즐거이 먹고 마시 라 너희의 행위에 대한 결과라는 말씀이 있으리라",
                            "verse 52:20": "그들이 침상에 줄지어 기대 니 하나님은 그들에게 눈이 큰 아름다운 배우자를 앉게 하시더라",
                            "verse 52:21": "믿음을 가진 자와 그들을 따라 믿음을 가진 후손들이 있나니 하나님은 후손들을 그들과 함께 결합시켜 주리라 또한 하나님은 그들이 행한 것들을 감하지 않을 것이라 모든 인간은 그가 행한 것에 대한 책임이 있노라",
                            "verse 52:22": "하나님은 그들이 원하는 과 실과 육류를 부여하니",
                            "verse 52:23": "그들은 서로가 서로에게 해 악이 없는 잔을 주고 받을 때",
                            "verse 52:24": "진주처럼 잘 보관된 소년이 그들 주위를 돌며 시중들도다",
                            "verse 52:25": "그들은 서로가 서로에게 다 가서며 안부를 물으매",
                            "verse 52:26": "실로 저희는 현세에서 우리 백성들로 인하여 두려워 했나이다라고 대답들 하니라",
                            "verse 52:27": "그러나 하나님은 우리에게 은혜를 베푸사 작열하는 열풍의 벌로부터 우리를 구하여 주셨노라",
                            "verse 52:28": "실로 우리는 이전에 하나님 께 구원하였으매 그분은 은헤와 자비로 충만하시니라",
                            "verse 52:29": "그러므로 훈계하라 그대는 주님의 은혜를 받은 자로 점장이도 아니며 미친자도 아니라",
                            "verse 52:30": "아니면 시인이여 시간이 흐 름에 따라 그에게 어떤 재앙이 내 릴 것이라고 그들이 말하더뇨",
                            "verse 52:31": "일러가로되 너희가 기다리라 나도 역시 너희와 함께 기다리노라",
                            "verse 52:32": "그들의 이성이 이것을 종용한단 말이뇨 아니면 그들이 사악 한 백성들이뇨",
                            "verse 52:33": "아니면 그가 그 메세지를 위조하였다 그들이 말하느뇨 그렇 지 않노라 그들이 믿음을 거역할 뿐이라",
                            "verse 52:34": "그들이 사실이라면 그와 같 은 말씀을 그들로 하여금 이르게 하라",
                            "verse 52:35": "그들은 스스로 창조되었느뇨아니면 그들 스스로가 조물주이더뇨",
                            "verse 52:36": "아니면 그들이 하늘과 대지 를 창조하였다 하더뇨 그렇지 아 니하니 그들에게는 확고한 믿음이 없을 뿐이라",
                            "verse 52:37": "주님의 보물이 그들에게 있 다 하더뇨 아니면 그들애게 절대 적 권능이 있다고 하더뇨",
                            "verse 52:38": "아니면 그들이 하늘에 올라 비밀을 들을 사다리라도 가지고 있느뇨 그렇다면 그 비밀을 들었 던 자로 하여금 명백한 증거를 입증하라",
                            "verse 52:39": "너희는 아들이 있는데 하나 님은 딸들만 있다는 것이뇨",
                            "verse 52:40": "그대가 그들에게 보상을 요구하여 그들이 부채로 무거운 짐 을 지게 되었단 말이뇨",
                            "verse 52:41": "아니면 그들에게 보이지 않 는 것이 있어 그것을 기록하고 있느뇨",
                            "verse 52:42": "아니면 그들이 그대에 대하 여 음모를 꾸미느뇨 하나님께 도 전하는 자 스스로 그 음모에 빠지게 되노라",
                            "verse 52:43": "아니면 그들에게는 하나님 아닌 다른 신이 있다 하더뇨 그들이 숭배하는 모든 것 위에 계시는하나님이여 흘로 영광 받으소서",
                            "verse 52:44": "그들은 그들 위에 떨어지는 하늘의 조각을 보고서도 이것은 구름덩어리라고 그들은 말할 것이라",
                            "verse 52:45": "그러므로 그들이 공포로 쓰 러지는 그날을 맞이할 때까지 그 들을 버려두라",
                            "verse 52:46": "그날이 되매 그들의 음모는 그들을 유용케 하지 못하고 구원 도 받지 못하노라",
                            "verse 52:47": "실로 죄악을 저지른 자들에 게는 그것 외에도 또 다른 벌이 있을 것이라 그러나 그들 대다수 는 알지 못하더라",
                            "verse 52:48": "그러므로 인내하며 그대 주 님의 심판을 기다리라 실로 그대 는 하나님이 그대를 보호하고 있 노라 그리고 네가 일어설 때 그대주님을 찬미하라",
                            "verse 52:49": "밤중에도 그리고 별들이 질 때에도 하나님을 찬미하라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "سوێند به‌کێوی _ طور _ (که‌خوای گه‌وره‌گفتوگۆی له‌گه‌ڵ موسادا له نزیکی ئه‌نجامدا).",
                            "verse 52:2": "سوێند به‌کتێبی نوسراو که (لوح المحفوظه‌).",
                            "verse 52:3": "که‌له‌لاپه‌ڕه‌ی ته‌نگی گرنگدایه‌",
                            "verse 52:4": ": سوێند _ به‌که‌عبه‌_ که‌هه‌میشه ئاوه‌دانه به نوێژكه‌ران، وه (ئه‌وانه‌ی بۆ حه‌ج و عه‌مره‌ده‌چن) هه‌روه‌ها (بیت المعمور) شوێنێکه له‌ئاسمانی حه‌وته‌م که‌دیاریکراوه بۆ خواپه‌رستی فریشته‌کان هه‌روه‌ک چۆن که‌عبه پیرۆزه لای ئیمانداران، (له‌فه‌رموده‌یه‌کی ڕاست و دروستدا ئاماژه‌ی بۆ کراوه‌).",
                            "verse 52:5": "هه‌روه‌ها سوێند به‌سه‌قفی به‌رزو بڵند (که‌ئاسمان ده‌گرێته‌وه‌، خوای گه‌وره‌ده‌یه‌وێت سه‌رنجمان ڕاکێشێت بۆ لای).",
                            "verse 52:6": "سوێند به‌ده‌ریای پڕ له‌ئاو یان ده‌ریای داگیرساو (که‌قیامه‌ت داده‌گرسێت و ده‌ته‌قێته‌وه‌).",
                            "verse 52:7": "(په‌روه‌ردگاری مه‌زن سوێند به‌و هه‌موو شتانه‌ده‌خوات، ئینجا ده‌فه‌رموێت): به‌ڕاستی سزاو ئازاری په‌روه‌ردگاری تۆ ئه‌ی محمد (صلی الله علیه وسلم) هه‌ر پێش دێت.",
                            "verse 52:8": "که‌سیش ناتوانێت به‌ری بگرێت و ده‌ستی پێوه بنێت و نه‌هێڵێت.",
                            "verse 52:9": "ئه‌و ڕۆژه ئه‌ستێره وهه‌سه‌ره‌کانی ئاسمان هه‌موو به‌یه‌کدا ده‌ده‌ن، (خوای گه‌وره‌تێکیان ده‌دات وهه‌ڵیان ده‌وه‌شێنێت)",
                            "verse 52:10": "کێوه‌کانیش له‌جێی خۆیان ده‌جوڵێن و ده‌ڕۆن، (وه‌ک خۆری، وه‌ک هه‌ور، زه‌ویان پێ ته‌خت ده‌کرێت).",
                            "verse 52:11": "که‌واته واوه‌یلا و هاوار بۆ ئه‌وانه‌ی که‌باوه‌ڕیان به‌حه‌ق و ڕاستی نه‌کرد و به‌درۆیان ده‌زانی له‌و ڕۆژه‌دا.",
                            "verse 52:12": "ئه‌وانه‌ی که‌رۆچووه و گاڵته ده‌که‌ن به‌ئیسلام و پێغه‌مبه‌ر و قورئان.",
                            "verse 52:13": "رۆژێک دێت به‌توندی پاڵیان پێوه ده‌نرێت بۆ ناو دۆزه‌خ (ده‌نگ له‌سینه‌وه‌یانه‌وه دێت ئه‌وه‌نده‌پاڵه‌که تونده‌).",
                            "verse 52:14": "پێیان ده‌وترێت ئه‌مه‌ئه‌و ئاگرو دۆزه‌خه‌یه که‌کاتی خۆی بڕواتان پێی نه‌بوو به‌گاڵته‌تان گرتبوو",
                            "verse 52:15": "باشه‌، ئه‌مه‌جادووه‌نیشانتان ده‌درێت یان ئێوه ڕاستی نابینن؟!",
                            "verse 52:16": "ده‌بێت بچنه‌ناوی و سزا بچێژن، جا ئیتر خۆڕاده‌گرن یان خۆڕاناگرن وه‌ک یه‌که بۆتان، بێگومان یان خۆڕاناگرن وه‌ک یه‌که بۆتان، بێگومان تۆڵه‌ی ئه‌و کاروکرده‌وانه‌تان هه‌ر ده‌درێته‌وه که‌ده‌تانکرد.",
                            "verse 52:17": "له‌ولاشه‌وه‌به‌ڕاستی ئه‌وانه‌ی که‌له‌دنیادا خواناس و دینداربوون، له‌باخه‌کانی به‌هه‌شت و ناز و نیعمه‌تدا، ژیانی پڕ له‌به‌ختیاری و کامه‌رانی ده‌به‌نه‌سه‌ر.",
                            "verse 52:18": "زۆر که‌یف خۆش و دڵخۆش و ڕووخۆشن به‌و به‌خششانه‌ی که په‌روه‌ردگاریان پێی به‌خشیون، هه‌ر په‌روه‌ردیگاریشیان له‌سزاو تاڵاوی دۆزه‌خ پاڕاستونی.",
                            "verse 52:19": "پێیان ده‌وترێت بخۆن و بخۆنه‌وه نۆشی گیانتان بێت له‌پاداشتی کرده‌وه‌ی چاک و ڕێک و پێکتاندا",
                            "verse 52:20": "ئه‌و به‌خته‌وه‌رانه‌به‌که‌ماڵی ئیسراحه‌ت) پاڵیان داوه‌ته‌وه‌له‌سه‌ر کورسی و قه‌نه‌فه‌رازاوه‌کان، که‌به‌شێوه‌یه‌کی جوان و ڕێک ڕیز کراون، ئێمه هاوسه‌رانی حۆری چاوگه‌شه‌مان لێ ماره‌کردوون",
                            "verse 52:21": "جا ئه‌وانه‌ی باوه‌ڕیان هێناوه و نه‌وه‌کانیشیان به‌ئیمان و باوه‌ڕه‌وه شوێنیان که‌وتوون، ئه‌وانه‌له‌به‌هه‌شتدا پێک شاد ده‌که‌ینه‌وه (تا کامه‌رانی و خۆشییان زیاتر بێت)، وه‌نه‌بێت ئه‌وانه‌ی که‌پله‌ی به‌رزیان ده‌ستکه‌وتووه‌دایان به‌زێنین بۆ پله‌ی نزمتر، چونکه‌ئێمه پاداشتی کرده‌وه‌ی که‌س که‌م ناکه‌ینه‌وه (ئه‌گه‌ر زیادی نه‌که‌ین) له‌هه‌مان کاتدا هه‌رکه‌سه‌بارمته‌ی کرده‌وه‌ی خۆیه‌تی",
                            "verse 52:22": "به‌رده‌وام حه‌زیان له‌هه‌ر میوه و گۆشتێک بێت پێشکه‌شیان ده‌که‌ین",
                            "verse 52:23": "به‌دڵ خۆشیه‌وه له‌کاسی تایبه‌تیدا شه‌راب ده‌نۆشن، جار جار بۆ خۆشی له‌یه‌کتری ده‌سێنن، دوور له‌ره‌فتاری ناشیرین و گوناهو تاوانبارکردنی یه‌کتر",
                            "verse 52:24": "هه‌روه‌ها منداڵانی جوان و ئێسک سووک به‌ده‌وریاندا دێن و خزمه‌تیان ده‌که‌ن ده‌ڵێی مرواری پاک و بێگه‌ردن",
                            "verse 52:25": "(جا دوای ئه‌و عه‌یش و نۆش و که‌یف و ئاهه‌نگه‌) ڕووده‌که‌نه‌یه‌کترو ده‌سته‌ده‌سته‌له‌یه‌ک نزیک ده‌بنه‌وه‌، پرسیار له‌رابوردوی یه‌کتر ده‌که‌ن (دیاره هه‌رکه‌سه‌له‌و به‌یه‌کگه‌یشتنانه‌دا به‌شێک له‌سه‌رگوزه‌شته‌ی خۆی نیشانی ئیماندارانی هاوه‌ڵ و میوانی ده‌دات، له‌گه‌ڵ ڕوونکردنه‌وه‌ی پێویستدا، که‌به‌ده‌زگای زۆر پێشکه‌وتوو تۆمارکراوه‌)",
                            "verse 52:26": "سه‌ره‌نجام هه‌موو به‌یه‌ک ده‌نگ ده‌ڵێن: به‌ڕاستی (کارێکی چاکمان ده‌کرد سوپاس بۆ خوا) چونکه‌کاتی خۆی که‌له‌ناو ماڵ و خێزانماندا بووین، ترسی لێپرسینه‌وه‌ی ڕۆژی قیامه‌تمان هه‌بوو، هه‌روه‌ها به‌به‌زه‌ییش بووین له‌ناویاندا و مه‌به‌ستمان بوو ئه‌وانیش وه‌ک ئێمه خواناس بن",
                            "verse 52:27": "به‌هۆی ئه‌وه‌وه‌خوای میهره‌بانیش لای ڕه‌حمه‌تی لێ کردینه‌وه و منه‌تباری کردین و له‌سزای دۆزه‌خی پڕئێش پاڕاستینی",
                            "verse 52:28": "به‌ڕاستی ئێمه کاتی خۆی هاناو هاوارمان هه‌ر بۆ ئه‌و ده‌بردو ده‌مانپه‌رست، چونکه‌بێگومان هه‌ر ئه‌و زاته‌خوایه‌کی چاکه‌خوازو میهره‌بان و دلۆڤانه‌",
                            "verse 52:29": "ئه‌ی محمد (صلی الله علیه وسلم) ئامۆژگاری ئه‌وخه‌ڵکه بکه‌، چونکه‌به‌هۆی نازو نیعمه‌تی په‌روه‌ردگارته‌وه‌نه‌فاڵچیت، نه‌شێتی",
                            "verse 52:30": "خوانه‌ناس و دڵڕه‌قه‌کان ده‌ڵێن: ئه‌مه‌شاعیرێکه و چاوه‌ڕوانی مه‌رگی ده‌که‌ین!!",
                            "verse 52:31": "پێیان بڵێ: چاوه‌ڕێ بن منیش له‌گه‌ڵ ئێوه‌دا چاوه‌ڕێم (بزانین سه‌رئه‌نجام کێ سه‌رده‌که‌وێت، کێ سه‌رفرازه‌؟)",
                            "verse 52:32": "ئایا پیاوه ژیره‌کانیان پێیان ده‌ڵێت: ئه‌و قسه‌ناڕه‌وایانه بکه‌ن، نه‌خێر ئه‌مانه‌هه‌ر خۆیان که‌سانێکی سته‌مکارن؟",
                            "verse 52:33": "یان ده‌ڵێن: ئه‌م قورئانه‌خۆی هه‌ڵیبه‌ستووه‌و دایڕشتووه‌، نه‌خێر ئه‌وانه‌، هه‌ر ئیمان و باوه‌ڕیان نیه (ئه‌گینا چۆن وا ده‌ڵێن).",
                            "verse 52:34": "(ده‌ی که‌واته‌خۆ ئه‌وانیش قسه‌زان و لێزانن) ده‌با فه‌رمایشتێکی ئاوا وه‌ک ئه‌م قورئانه‌بهێنن ئه‌گه‌ر ڕاست ده‌که‌ن؟!",
                            "verse 52:35": "ئایا ئه‌وانه‌به‌بێ هیچ شتێک، هیچ هۆیه‌ک، هاتوونه‌ته‌کایه‌وه؟! یان هه‌ر خۆیان دروستکارن؟!",
                            "verse 52:36": "یان ئه‌و بێ باوه‌ڕانه ئاسمانه‌کان و زه‌ویان دروستکردووه‌؟ نه‌خێر ئه‌وانه‌هه‌ر دڵنیا نابن",
                            "verse 52:37": "یان ئه‌وه‌یه گه‌نجینه‌ی ڕزق و ڕۆزیه‌کانی په‌روه‌ردگاری تۆیان به‌ده‌سته‌؟! یان ئه‌وه‌یه ده‌سه‌ڵاتیان بێ سنووره‌؟ (تا ئاوا بوێرن له‌خوا یاخی بن؟)",
                            "verse 52:38": "یان ئه‌وانه‌په‌یژه‌یان هه‌یه‌و پیایدا سه‌رده‌که‌ون، تا گوێ له‌نهێنیه‌کانی ئاسمان بگرن؟! ده‌با گوێگره‌کانیان به‌ڵگه‌یه‌کی ئاشکرا په‌یدا بکه‌ن (ئه‌وسا مله‌جه‌ڕی بکه‌ن).",
                            "verse 52:39": "ئایا ئه‌وه‌ڕاسته‌که‌کچان، نه‌وه‌ی خوابن و کوڕانیش نه‌وه‌ی ئێوه؟! (به‌مه‌رجێک خۆیان له‌کچان بێزاربوون، به‌ڵام بۆ خوا به‌ره‌وایان بینیوه؟!).",
                            "verse 52:40": "یان ئه‌وه‌یه داوای کرێ و پاره‌یان لێ ده‌که‌یت، تا بارێکی گران بده‌ی به‌کۆڵیانداو پێیان هه‌ڵنه‌سوڕێت!!",
                            "verse 52:41": "یان ئه‌وه‌یه که‌نهێنی و شاراوه‌کان لای ئه‌وانه‌و، ئه‌وان یاداشتی خه‌ڵکی ده‌نووسن، (یان ئه‌وان بڕیاری به‌سه‌رهاته‌کان ده‌ده‌ن)؟!",
                            "verse 52:42": "یان ئه‌وانه‌ده‌یانه‌وێت پیلان و ته‌ڵه‌یه‌ک ڕێک بخه‌ن (دژی پێغه‌مبه‌ر و ئیمانداران، به‌ڵام خه‌یاڵیان خاوه‌) ئه‌وانه‌ی که‌کافروخوانه‌ناسن هه‌ر خۆیان که‌وتوونه‌ته‌ناو پیلانه‌وه و بون به‌ته‌ڵه‌ی خۆیانه‌وه‌، پیلانه‌کانیان به‌سه‌ر خۆیاندا شکاوه‌ته‌وه‌.",
                            "verse 52:43": "یان ئه‌وانه‌وابیرده‌که‌نه‌وه که‌خوایه‌کی تریان جگه‌له (الله) هه‌یه؟! پاکی و بێگه‌ردی بۆ خوا (له‌بیروباوه‌ڕی چه‌وتیان)، له‌و شتانه‌ی که‌ئه‌وان ده‌یکه‌نه هاوه‌ڵ بۆ خوا.",
                            "verse 52:44": "خۆ ئه‌گه‌ر (له‌ئه‌نجامی لادان و بیروباوه‌ڕی چه‌وتیان و کاری نادروستیان خوای گه‌وره‌سزایه‌کیان بۆ بنێرێت) و پارچه (ئه‌ستێره‌یه‌کیان) تێ بگرێت و ڕوو به‌زه‌وی دابه‌زێت ئه‌و نه‌فامانه‌ده‌ڵێن: هیچ نیه!! په‌ڵه هه‌وره‌و نیشتۆته سه‌ریه‌ک!!",
                            "verse 52:45": "وازیان لێ بهێنه هه‌تا به‌و ڕۆژه ده‌گه‌ن که‌تایدا تیاده‌چن و لاڵ و پاڵ ده‌که‌ون",
                            "verse 52:46": "ئه‌و ڕۆژه ئیتر فێڵ و ته‌ڵه‌که‌یان به‌هیچ جۆرێک فریایان ناکه‌وێت و سه‌رکه‌وتوو سه‌رفراز نابن",
                            "verse 52:47": "بێگومان بۆ ئه‌وانه‌ی که‌سته‌میان کردووه‌سزای تریش هه‌یه بێجگه له‌وه‌ی که‌جار جار بۆیان پێش دێت پێش تیاچوونی یه‌کجاری، به‌ڵام زۆربه‌یان نافامن و نازانن (هه‌ست به‌ده‌ستی قه‌ده‌ر ناکه‌ن له‌رووداوه‌کاندا)",
                            "verse 52:48": "ئه‌ی پێغه‌مبه‌ر (چلی الله علیه وسلم) خۆگربه له‌به‌رامبه‌ر به‌جێهێنانی فه‌رمانی په‌روه‌ردگارته‌وه‌، دڵنیابه که‌تۆ له‌ژێر چاودێری ئێمه‌دایت، هه‌روه‌ها ته‌سبیحات و ستایش و سوپاسگوزاری په‌روه‌ردگارت بكه‌کاتێک که‌به‌ره‌به‌یان هه‌ڵده‌سێت",
                            "verse 52:49": "له‌شه‌وگاریشدا هه‌ر بیپه‌رسته و ستایشی بکه‌، هه‌روه‌ها کاتێک ئه‌ستێره‌کان ون ده‌بن له‌چاو دیار نامێنن هه‌ڵده‌سێت"
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Demi Gunung Tursina;",
                            "verse 52:2": "Dan demi Kitab yang tertulis dengan rapi -",
                            "verse 52:3": "Pada lembaran surat yang terbuka;",
                            "verse 52:4": "Dan demi \"Al-Baitul Makmur\";",
                            "verse 52:5": "Dan demi bumbung yang tinggi;",
                            "verse 52:6": "Dan demi laut yang penuh tepu (dengan kepanasan); -",
                            "verse 52:7": "Sesungguhnya azab Tuhanmu tetap berlaku; -",
                            "verse 52:8": "Tidak ada sesiapapun yang dapat menolaknya; -",
                            "verse 52:9": "Pada hari langit (dan segala isinya) bergegar dengan sekuat-kuatnya.",
                            "verse 52:10": "Dan gunung-ganang bergerak dari tempatnya dengan cara yang luar biasa.",
                            "verse 52:11": "(Apabila berlaku yang demikian), maka kecelakaan dan kebinasaanlah pada hari itu bagi orang-orang yang mendustakan kebenaran;",
                            "verse 52:12": "Iaitu orang-orang yang leka bermain-main dalam kesesatan.",
                            "verse 52:13": "Pada hari mereka ditolak ke dalam neraka Jahannam dengan penolakan yang sekasar-kasarnya,",
                            "verse 52:14": "(Dan dikatakan kepada mereka): \"Inilah api neraka yang dahulu kamu mendustakannya.",
                            "verse 52:15": "\"Maka adakah ini sihir juga (sebagaimana yang kamu katakan terhadap keterangan Rasul Kami dahulu?), atau kamu tidak nampak (kenyataannya sebagaimana kamu tidak nampak di dunia dahulu akan kebenaran Rasul Kami)?",
                            "verse 52:16": "\"Rasalah bakarannya; kemudian sama ada kamu bersabar (menderita azabnya) atau tidak bersabar, sama sahaja (tidak ada faedahnya) kepada kamu, kerana kamu tidak dibalas melainkan dengan apa yang kamu telah kerjakan\".",
                            "verse 52:17": "Sesungguhnya orang-orang yang bertaqwa, di tempatkan dalam taman-taman Syurga dan nikmat kesenangan (yang tidak ada taranya).",
                            "verse 52:18": "Mereka bersenang lenang dengan apa yang dikurniakan oleh Tuhan mereka, dan mereka dipelihara Tuhan dari azab neraka.",
                            "verse 52:19": "(Dan dikatakan kepada mereka): \"Makan dan minumlah kamu makanan dan minuman yang lazat serta baik kesudahannya, dengan sebab apa yang kamu telah kerjakan\".",
                            "verse 52:20": "Mereka duduk berbaring di atas pelamin-pelamin yang berderet; dan Kami jadikan kawan teman mereka bidadari-bidadari yang putih melepak, lagi luas cantik matanya.",
                            "verse 52:21": "Dan orang-orang yang beriman yang diturut oleh zuriat keturunannya dengan keadaan beriman, Kami hubungkan (himpunkan) zuriat keturunannya itu dengan mereka (di dalam Syurga); dan Kami (dengan itu) tidak mengurangi sedikitpun dari pahala amal-amal mereka; tiap-tiap seorang manusia terikat dengan amal yang dikerjakannya.",
                            "verse 52:22": "Dan (penduduk Syurga itu) Kami tambahi mereka (dari semasa ke semasa), dengan buah-buahan dan daging dari berbagai jenis yang mereka ingini.",
                            "verse 52:23": "Mereka di dalam Syurga itu (kerana melahirkan kemesraan antara satu dengan yang lain): berebut-rebut mengambil piala yang berisi arak yang tidak menyebabkan timbul (dari peminumnya) perkara yang sia-sia dan tidak pula menyebabkan (peminumnya menanggung) dosa.",
                            "verse 52:24": "Dan mereka dilayani oleh anak-anak muda lelaki yang sentiasa beredar di sekitar mereka, (yang cantik parasnya) seolah-olah anak-anak muda itu mutiara yang tersimpan dengan sebaik-baiknya.",
                            "verse 52:25": "Dan (dengan berada dalam nikmat itu) mereka berhadap-hadapan satu sama lain sambil bertanya-tanya.",
                            "verse 52:26": "Mereka berkata: \"Sesungguhnya kami dahulu, semasa berada dalam kalangan keluarga kami - selalu merasa cemas takut (daripada berlaku derhaka kepada Allah),",
                            "verse 52:27": "\"Maka Allah mengurniakan kami (rahmat dan taufiqNya), serta memelihara kami dari azab neraka.",
                            "verse 52:28": "\"Sesungguhnya kami dahulu tetap menyembahNya (dan memohon pertolonganNya).",
                            "verse 52:29": "Maka hendaklah engkau (wahai Muhammad) tetap tekun memberi peringatan (dengan ajaran-ajaran Al-Quran yang diturunkan kepadamu, dan janganlah dihiraukan golongan yang ingkar), kerana engkau dengan nikmat Tuhanmu (yang dilimpahkanNya kepadamu itu) bukanlah seorang pawang dan bukan pula seorang gila.",
                            "verse 52:30": "(Mereka menuduh Nabi Muhammad dengan yang bukan-bukan), bahkan mereka mengatakan: \"(Muhammad) itu seorang penyair yang kami tunggu-tunggu saat kebinasaannya\".",
                            "verse 52:31": "Katakanlah (wahai Muhammad): \"Tunggulah kamu (akan apa yang kamu tuduh itu), maka sesungguhnya aku juga dari orang-orang yang menunggu bersama-sama kamu (akan apa yang dijanjikan oleh Allah Taala)\".",
                            "verse 52:32": "Adakah mereka disuruh oleh akal fikiran mereka melemparkan tuduhan-tuduhan yang sedemikian itu, atau sememangnya mereka suatu kaum yang melampaui batas (dalam keingkaran dan kedegilannya)?",
                            "verse 52:33": "(Bukan sahaja mereka ingkar dan degil) bahkan mereka berkata: \"Dia (Muhammad) telah mereka-reka Al-Quran itu\".",
                            "verse 52:34": "(Kalau tidak) maka hendaklah mereka membuat dan mendatangkan kata-kata (yang fasih dan indah) seperti Al-Quran itu, jika betul mereka orang-orang yang benar dakwaannya.",
                            "verse 52:35": "(Mengapa mereka tidak beriman?) Adakah mereka telah tercipta dengan tiada yang menciptanya, atau adakah mereka yang mencipta diri mereka sendiri?",
                            "verse 52:36": "Adakah mereka yang mencipta langit dan bumi itu? (Sudah tentu tidak!) Bahkan mereka adalah orang-orang yang tidak meyakini (kebenaran apa yang mereka pernah mengakuinya).",
                            "verse 52:37": "Adakah pada tangan mereka perbendaharaan Tuhanmu (sehingga mereka boleh memberi atau menahan sesuatu nikmat atau pangkat), atau merekalah yang berkuasa mentadbirkan segala-galanya?",
                            "verse 52:38": "Adakah mereka mempunyai tangga (untuk naik ke langit), yang dengannya mereka dapat mendengar (apa yang diperintahkan dan ditetapkan oleh Allah? Jika ada) maka biarlah orang mereka yang mendengar itu membawa sesuatu bukti yang menyatakan kebenarannya.",
                            "verse 52:39": "Adilkah (kamu sediakan) bagi Allah - anak-anak perempuan (yang kamu benci), dan untuk kamu - anak-anak lelaki (yang kamu sukai)?",
                            "verse 52:40": "Pernahkah engkau (wahai Muhammad) meminta sebarang bayaran kepada mereka (mengenai ajaran Islam yang engkau sampaikan), lalu mereka merasa berat menanggung bayaran itu (sehingga menjauhkan diri daripada menyahut seruanmu)?",
                            "verse 52:41": "Adakah pada sisi mereka (Lauh Mahfuz yang mengandungi) perkara-perkara yang ghaib, lalu mereka menyalin (daripadanya untuk menentang ajaran dan peringatanmu)?",
                            "verse 52:42": "(Mereka tidak cukup dengan kata-kata dan tuduhan-tuduhan yang buruk sahaja) bahkan mereka hendak melakukan rancangan jahat (terhadapmu wahai Muhammad; tetapi mereka tidak akan berjaya) kerana orang-orang yang kafir itulah yang akan ditimpa balasan rancangan jahatnya.",
                            "verse 52:43": "(Apabila datangnya balasan rancangan jahat itu maka) adakah bagi mereka Tuhan (yang dapat menyelamatkan mereka) selain dari Allah? Maha Suci Allah dari apa yang mereka sekutukan itu.",
                            "verse 52:44": "Dan kiranya mereka melihat sepotong besar dari langit gugur (untuk menimpa mereka), mereka akan berkata: \"(Itu adalah) awan yang bertompok - berlapis-lapis!\"",
                            "verse 52:45": "(Kalau keingkaran dan kedegilan mereka sampai begitu sekali) maka biarkanlah mereka (wahai Muhammad, dan janganlah dihiraukan) sehingga mereka menemui hari yang padanya mereka akan binasa -",
                            "verse 52:46": "(Iaitu) hari segala rancangan jahat dan tipu daya mereka tidak dapat mendatangkan sebarang faedah kepada mereka, dan mereka pula tidak diberikan pertolongan.",
                            "verse 52:47": "Sesungguhnya orang-orang yang zalim itu akan beroleh azab seksa selain dari azab yang tersebut, akan tetapi kebanyakan mereka tidak mengetahui (hakikat yang sebenarnya).",
                            "verse 52:48": "Dan (dengan yang demikian) bersabarlah (wahai Muhammad) menerima hukum Tuhanmu (memberi tempoh kepada mereka), kerana sesungguhnya engkau tetap terselamat dalam pemuliharaan serta pengawasan Kami; dan bertasbihlah dengan memuji Tuhanmu semasa engkau bangun.",
                            "verse 52:49": "Dan juga hendaklah engkau bertasbih kepadaNya pada waktu malam, dan ketika bintang-bintang tenggelam (pada waktu subuh)."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "سوگند به كوه طور،",
                            "verse 52:2": "و كتابى كه نوشته شده،",
                            "verse 52:3": "در صفحه‏اى گسترده،",
                            "verse 52:4": "و سوگند به «بيت المعمور»،",
                            "verse 52:5": "و سقف برافراشته،",
                            "verse 52:6": "و درياى مملو و برافروخته،",
                            "verse 52:7": "كه عذاب پروردگارت واقع مى‏شود،",
                            "verse 52:8": "و چيزى از آن مانع نخواهد بود!",
                            "verse 52:9": "(اين عذاب الهى) در آن روزى است كه آسمان به شدت به حركت درمى‏آيد،",
                            "verse 52:10": "و كوه‏ها از جا كنده و متحرك مى‏شوند!",
                            "verse 52:11": "واى در آن روز بر تكذيب‏كنندگان،",
                            "verse 52:12": "همانها كه در سخنان باطل به بازى مشغولند!",
                            "verse 52:13": "در آن روز كه آنها را بزور به سوى آتش دوزخ مى‏رانند!",
                            "verse 52:14": "(به آنها مى‏گويند:) اين همان آتشى است كه آن را انكار مى‏كرديد",
                            "verse 52:15": "آيا اين سحر است يا شما نمى‏بينيد؟!",
                            "verse 52:16": "در آن وارد شويد و بسوزيد; مى‏خواهيد صبر كنيد يا نكنيد، براى شما يكسان است; چرا كه تنها به اعمالتان جزا داده مى‏شويد!",
                            "verse 52:17": "ولى پرهيزگاران در ميان باغهاى بهشت و نعمتهاى فراوان جاى دارند،",
                            "verse 52:18": "و از آنچه پروردگارشان به آنها داده و آنان را از عذاب دوزخ نگاه داشته است شاد و مسرورند!",
                            "verse 52:19": "(به آنها گفته مى‏شود:) بخوريد و بياشاميد گوارا; اينها در برابر اعمالى است كه انجام مى‏داديد!",
                            "verse 52:20": "اين در حالى كه بر تختهاى صف‏كشيده در كنار هم تكيه مى‏زنند، و «حور العين‏» را به همسرى آنها درمى‏آوريم!",
                            "verse 52:21": "كسانى كه ايمان آوردند و فرزندانشان به پيروى از آنان ايمان اختيار كردند، فرزندانشان را (در بهشت) به آنان ملحق مى‏كنيم; و از (پاداش) عملشان چيزى نمى‏كاهيم; و هر كس در گرو اعمال خويش است!",
                            "verse 52:22": "و همواره از انواع ميوه‏ها و گوشتها -از هر نوع كه بخواهند- در اختيارشان مى‏گذاريم!",
                            "verse 52:23": "آنها در بهشت جامهاى پر از شراب طهور را كه نه بيهوده‏گويى در آن است و نه گناه، از يكديگر مى‏گيرند!",
                            "verse 52:24": "و پيوسته بر گردشان نوجوانانى براى (خدمت) آنان گردش مى‏كنند كه همچون مرواريدهاى درون صدفند!",
                            "verse 52:25": "در اين هنگام رو به يكديگر كرده (از گذشته) سؤال مى‏نمايند;",
                            "verse 52:26": "مى‏گويند: «ما در ميان خانواده خود ترسان بوديم (مبادا گناهان آنها دامن ما را بگيرد)!",
                            "verse 52:27": "اما خداوند بر ما منت نهاد و از عذاب‏كشنده ما را حفظ كرد!",
                            "verse 52:28": "ما از پيش او را مى‏خوانديم (و مى‏پرستيديم)، كه اوست نيكوكار و مهربان!»",
                            "verse 52:29": "پس تذكر ده، كه به لطف پروردگارت تو كاهن و مجنون نيستى!",
                            "verse 52:30": "بلكه آنها مى‏گويند: «او شاعرى است كه ما انتظار مرگش را مى‏كشيم!»",
                            "verse 52:31": "بگو: «انتظار بكشيد كه من هم با (شما انتظار مى‏كشم شما انتظار مرگ مرا، و من انتظار نابودى شما را با عذاب الهى)!»",
                            "verse 52:32": "آيا عقلهايشان آنها را به اين اعمال دستور مى‏دهد، يا قومى طغيانگرند؟",
                            "verse 52:33": "يا مى‏گويند: « را به خدا افترا بسته‏»، ولى آنان ايمان ندارند",
                            "verse 52:34": "اگر راست مى‏گويند سخنى همانند آن بياورند!",
                            "verse 52:35": "يا آنها بى هيچ آفريده شده‏اند، يا خود خالق خويشند؟!",
                            "verse 52:36": "آيا آنها آسمانها و زمين را آفريده‏اند؟! بلكه آنها جوياى يقين نيستند!",
                            "verse 52:37": "آيا خزاين پروردگارت نزد آنهاست؟! يا بر همه چيز عالم سيطره دارند؟!",
                            "verse 52:38": "آيا نردبانى دارند (كه به آسمان بالا مى‏روند) و بوسيله آن اسرار وحى را مى‏شنوند؟! كسى كه از آنها اين ادعا را دارد دليل روشنى بياورد!",
                            "verse 52:39": "آيا سهم خدا دختران است و سهم شما پسران (كه فرشتگان را دختران خدا مى‏ناميد)؟!",
                            "verse 52:40": "آيا تو از آنها پاداشى مى‏طلبى كه در زير بار گران آن قرار دارند؟!",
                            "verse 52:41": "آيا اسرار غيب نزد آنهاست و از روى آن مى‏نويسند؟!",
                            "verse 52:42": "آيا مى‏خواهند نقشه شيطانى براى تو بكشند؟! ولى بدانند خود كافران در دام اين نقشه‏ها گرفتار مى‏شوند!",
                            "verse 52:43": "يا معبودى غير خداوند دارند (كه قول يارى به آنها داده)؟! منزه است خدا از آنچه همتاى او قرارمى‏دهند!",
                            "verse 52:44": "آنها (چنان لجوجند كه) اگر ببينند قطعه سنگى از آسمان (براى عذابشان) سقوط مى‏كند مى‏گويند: «اين ابر متراكمى است!»",
                            "verse 52:45": "حال كه چنين است آنها را رها كن تا روز مرگ خود را ملاقات كنند;",
                            "verse 52:46": "روزى كه نقشه‏هاى آنان سودى به حالشان نخواهد داشت و (از هيچ سو) يارى نمى‏شوند!",
                            "verse 52:47": "و براى ستمگران عذابى قبل از آن است (در همين جهان); ولى بيشترشان نمى‏دانند!",
                            "verse 52:48": "در راه ابلاغ حكم پروردگارت صبر و استقامت كن، چرا كه تو در حفاظت كامل ما قرار دارى! و هنگامى كه برمى‏خيزى پروردگارت را تسبيح و حمد گوى!",
                            "verse 52:49": "(همچنين) به هنگام شب او را تسبيح كن و به هنگام پشت كردن ستارگان (و طلوع صبح)!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Pelo monte (Sinai).",
                            "verse 52:2": "Pelo Livro escrito,",
                            "verse 52:3": "Em um pergaminho desenrolado.",
                            "verse 52:4": "Pelo templo freqüentado.",
                            "verse 52:5": "Pelo céu elevado.",
                            "verse 52:6": "E pelos oceanos transbordantes.",
                            "verse 52:7": "Que o castigo do teu Senhor está iminente.",
                            "verse 52:8": "Ninguém pode evitá-lo.",
                            "verse 52:9": "(Será) o dia em que o firmamento oscilará energicamente.",
                            "verse 52:10": "E as montanhas mover-se-ão rapidamente.",
                            "verse 52:11": "Ai, nesse dia, dos desmentidores.",
                            "verse 52:12": "Que se houverem dado a veleidades.",
                            "verse 52:13": "Será o dia em que se verão violentamente impulsionados para o fogo infernal.",
                            "verse 52:14": "(Ser-lhes-á dito): Eis aqui o fogo, que negastes!",
                            "verse 52:15": "É isto, acaso, magia, ou não vedes ainda?",
                            "verse 52:16": "Entrai aí, porque redundará no mesmo, que o suporteis, quer não.",
                            "verse 52:17": "Quanto aos tementes (a Deus), viverão em jardins e em felicidade.",
                            "verse 52:18": "Gozando daquilo com que o seu Senhor os houver agraciado; e o seu Senhor os preservará do suplício infernal.",
                            "verse 52:19": "(Ser-lhes-á dito): Comei e bebei, com proveito, pelo que (de bom) fizestes!",
                            "verse 52:20": "Estarão recostados sobre leitos enfileirados e os casarmos com huris, de olhos maravilhosos.",
                            "verse 52:21": "E aqueles que creram, bem como as sua proles, que os seguirem na fé, reuni-los-emos às suas famílias, e não os privaremos de nada, quanto à sua recompensa merecida.",
                            "verse 52:22": "E os proveremos de frutas e carnes, bem como do que lhes apetecer.",
                            "verse 52:23": "Aí bridarão de uma taça, cuja bebida não os levará à frivolidade, nem os induzirá ao pecado.",
                            "verse 52:24": "E serão servidos por mancebos, formosos como se fossem pérolas em suas conchas.",
                            "verse 52:25": "E acercar-se-ão em tertúlias.",
                            "verse 52:26": "Dirão: Em verdade, antes estávamos temerosos pelos nossos familiares.",
                            "verse 52:27": "Portanto, Deus nos agraciou e nos preservou do tormento do vento abrasador.",
                            "verse 52:28": "Porque antes O invocávamos, por ser Ele o Beneficente, o Misericordiosíssimo!",
                            "verse 52:29": "Predica-lhes, pois, que, mercê do teu Senhor, não és um adivinho, nem um energúmeno.",
                            "verse 52:30": "Ou dirão: É um poeta.",
                            "verse 52:31": "Dize-lhes: Aguardai, que eu também sou um dos que aguardam convosco!",
                            "verse 52:32": "São, acaso, suas faculdades mentais que os induzem a isso, ou é que são um povo de transgressores?",
                            "verse 52:33": "Dirão ainda: Porventura, ele o tem forjado ( o Alcorão)? Qual! Não crêem!",
                            "verse 52:34": "Que apresentem, pois, uma mensagem semelhante, se estivermos certos.",
                            "verse 52:35": "Porventura, não foram eles criados do nada, ou são eles os criadores?",
                            "verse 52:36": "Ou criaram, acaso, os céus e a terra? Qual! Não se persuadirão!",
                            "verse 52:37": "Possuem, porventura, os tesouros do teu Senhor, ou são eles os dominadores?",
                            "verse 52:38": "Ou possuem alguma escada, para escalar o céu, a fim de detectar ali, os segredos? Que os espreitadores apresentem uma autoridade evidente!",
                            "verse 52:39": "Ou pertencem a Ele as filhas e a vós os filhos?",
                            "verse 52:40": "Ou lhes exiges, porventura, alguma recompensa, e por isso ficam sobrecarregados de dívidas?",
                            "verse 52:41": "Ou pensam estar de posse do incognoscível donde copiam o que dizem?",
                            "verse 52:42": "Ou (nem suma), intentam conspirar (contra ti)? Qual! Saibam os incrédulos que serão envolvidos na conspiração!",
                            "verse 52:43": "Ou, por fim, têm outra divindade, além de Deus? Glorificado seja Deus, de tudo quanto Lhe associam!",
                            "verse 52:44": "E se vissem desabar um fragmento do céu, diriam: São nuvens saturadas!",
                            "verse 52:45": "Deixa-os, pois, até que se deparem com o seu dia, em que serão fulminados!",
                            "verse 52:46": "Dia esse em que de nada lhes servirão as suas conspirações, nem serão socorridos.",
                            "verse 52:47": "Em verdade, os iníquos, além desse, sofrerão outros castigos; porém, a maioria o ignora.",
                            "verse 52:48": "E tu (ó Mensageiro), aguarda até ao Dia do Juízo do teu Senhor, porque estás ante Nossos olhos.",
                            "verse 52:49": "E numa parte da noite, e glorifica-O ao retirarem-se as estrelas."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 52:1": "Pe At-Tur!",
                            "verse 52:2": "Și pe Cartea scrisã",
                            "verse 52:3": "Pe un pergament întins!",
                            "verse 52:4": "Și pe Casa cea locuitã",
                            "verse 52:5": "Și pe bolta cea înaltã!",
                            "verse 52:6": "Și pe marea cea aprinsã!",
                            "verse 52:7": "Osânda Domnului tãu va veni!",
                            "verse 52:8": "Nimeni nu o va putea împiedica,",
                            "verse 52:9": "În Ziua în care cerul se va învolbura într-un vârtej",
                            "verse 52:10": "Și munții se vor urni din loc.",
                            "verse 52:11": "Vai în Ziua aceea pentru cei care învinuiesc de minciunã",
                            "verse 52:12": "Și care se joacã cu vorbe ușoare!",
                            "verse 52:13": "În Ziua aceea vor fi ei împinși în Gheena, cu neîndurare:",
                            "verse 52:14": "\"Acesta este Focul pe care voi l-ați luat drept minciunã.",
                            "verse 52:15": "Oare aceasta este vrãjitorie sau voi nu vedeți?",
                            "verse 52:16": "Ardeți în el și rãbdați sau nu rãbdați, cãci e totuna pentru voi;cãci voi veți fi rãsplãtiți pentru ceea ce faceți!\"",
                            "verse 52:17": "Iar cei cuvioși vor fi în Grãdini și la plãcere,",
                            "verse 52:18": "Bucurându-se de ceea ce le-a dat Domnul lor.",
                            "verse 52:19": "[Și li se va zice]: \"Mâncați și beți în pace pentru ceea ce ați fãcut ,",
                            "verse 52:20": "Întinși pe paturi rânduite!” Și Noi le vom da ca soațe hurii cu ochii mari.",
                            "verse 52:21": "Aceia care cred și pe care scoborâtorii lor îi urmeazã în credințã, pe aceia îi vom face sã fie laolaltã cu scoborâtorii lor și nu le vom micșora întru nimic faptele lor .",
                            "verse 52:22": "Și le vom dãrui lor spre întreținere fructe și carne, dupã cum vor pofti.",
                            "verse 52:23": "Și acolo își vor întinde ei o cupã unul altuia, în care nu este greșealã și nici pãcat.",
                            "verse 52:24": "Și se vor plimba printre ei pentru a-i servi feciori ca niște mãrgãritare bine pãstrate.",
                            "verse 52:25": "Iar ei se vor întoarce unul cãtre altul, întrebându-se.",
                            "verse 52:26": "Și vor zice: \"Înainte, noi am trãit în mijlocul neamului nostru, temãtori,",
                            "verse 52:27": "Însã Allah S-a îndurat de noi și ne-a apãrat de chinul vântului fierbinte ,",
                            "verse 52:28": "Pentru cã noi L-am chemat și mai înainte, cãci El este CelMilostiv, Îndurãtor [Al-Barr, Ar-Rahim]\".",
                            "verse 52:29": "Deci îndeamnã , cãci, prin îndurarea Domnului tãu, tu nu ești un ghicitor și nici un nebun!",
                            "verse 52:30": "Sau spun ei: \"[Acesta este] un poet! Noi așteptãm [sã-l loveascã]pe el soarta amenințãtoare\".",
                            "verse 52:31": "Spune: \"Așteptați, dar voi fi și eu împreunã cu voi printre cei care așteaptã!\"",
                            "verse 52:32": "Oare, le poruncesc mințile lor aceasta? Ba ei sunt un neam de îndãrãtnici!",
                            "verse 52:33": "Sau zic ei: \"El l-a nãscocit!\" Ba nu, dar ei nu vor sã creadã.",
                            "verse 52:34": "Sã aducã ei o poveste asemenea lui dacã grãiesc ei adevãr!",
                            "verse 52:35": "Oare au fost ei creați de nimeni sau ei sunt creatorii?",
                            "verse 52:36": "Sau au creat ei cerurile și pãmântul? Nu, ei nu cred cu convingere!",
                            "verse 52:37": "Sau sunt ei comorile Domnului tãu? Sau sunt ei stãpâni?",
                            "verse 52:38": "Sau au ei o scarã de pe care ascultã? Sã vinã cei care ascultã dintre ei cu o dovadã limpede!",
                            "verse 52:39": "Sau are El copile , iar voi aveți fii?",
                            "verse 52:40": "Sau le ceri tu o rãsplatã , încât ei sunt împovãrați de grea datorie?",
                            "verse 52:41": "Sau știu ei Necunoscutul pentru ca sã-l pomeneascã în scris?",
                            "verse 52:42": "Sau cautã ei un vicleșug? Însã cei care nu cred sunt victime ale propriului lor vicleșug.",
                            "verse 52:43": "Sau au ei un alt dumnezeu decât Allah? Allah Preaslãvitul este mai presus de ceea ce Îi asociazã Lui!",
                            "verse 52:44": "Și dacã vãd ei bucãți de cer cãzând, atunci zic: \"[Aceștia sunt] nori îngrãmãdiți\" .",
                            "verse 52:45": "Lasã-i pe ei, pânã ce vor întâlni Ziua lor, când ei vor fi trãsniți,",
                            "verse 52:46": "Ziua în care vicleșugul lor nu le va fi de nici un folos și în care nu vor fi ei ajutați!",
                            "verse 52:47": "Cei care au fost nedrepți vor avea parte de un chin, pe lângã aceasta , dar cei mai mulți dintre ei nu știu.",
                            "verse 52:48": "Așteaptã cu rãbdare judecata Domnului tãu, cãci tu ești sub ochiiNoștri! Și laudã mãrirea Domnului tãu, când te scoli ,",
                            "verse 52:49": "Și laudã-L pe El și o vreme din noapte, ca și la asfințitul stelelor! ,"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 52:1": "Pe Munte!",
                            "verse 52:2": "Pe Cartea scrisă",
                            "verse 52:3": "pe un pergament desfăşurat!",
                            "verse 52:4": "Pe Casa vizitată!",
                            "verse 52:5": "Pe bolta înălţată!",
                            "verse 52:6": "Pe marea umflată!",
                            "verse 52:7": "Osânda Domnului tău va cădea fără tăgadă",
                            "verse 52:8": "şi nimeni nu-i va putea sta în cale!",
                            "verse 52:9": "În Ziua când cerul va fi învârtejit,",
                            "verse 52:10": "şi munţii se vor pune în mişcare,",
                            "verse 52:11": "în Ziua aceea, vai celor care hulesc",
                            "verse 52:12": "şi celor care cu vorbe deşarte se joacă!",
                            "verse 52:13": "În Ziua aceea, vor fi îmbrânciţi în Focul Gheenei:",
                            "verse 52:14": "“Acesta este Focul pe care l-aţi socotit minciună!",
                            "verse 52:15": "Este o vrajă ori nu vedeţi nimic?",
                            "verse 52:16": "Ardeţi în el! De-l răbdaţi ori nu-l răbdaţi, totuna-i pentru voi.",
                            "verse 52:17": "Cei care se tem de Dumnezeu vor trăi în Grădini, în desfătare,",
                            "verse 52:18": "bucurându-se de ceea ce Domnul lor le-a dăruit.",
                            "verse 52:19": "“Mâncaţi şi beţi în tihnă pentru ceea ce aţi făptuit,",
                            "verse 52:20": "întinşi pe paturi rânduite!” Noi le vom da de soţii hurii cu ochii mari.",
                            "verse 52:21": "Pe cei care cred şi a căror seminţie i-a urmat în credinţă, Noi îi vom aduna la un loc cu seminţia lor şi cu nimic nu le vom micşora faptele lor.",
                            "verse 52:22": "Noi le vom rostui fructele şi carnea ce poftesc.",
                            "verse 52:23": "Ei îşi vor trece unii altora pocale ce nu duc la vorbe deşarte, nici la învinuire de păcate.",
                            "verse 52:24": "Flăcăiandrii, ce vor umbla printre ei, în slujba lor, vor fi asemenea mărgăritarelor ascunse.",
                            "verse 52:25": "Ei se vor întoarce unii către alţii întrebându-se.",
                            "verse 52:26": "Vor spune: “Ne temeam mai înainte pentru ai noştri,",
                            "verse 52:27": "însă Dumnezeu ne-a oblăduit şi ne-a ferit de osânda vântului arzător.",
                            "verse 52:28": "Noi L-am chemat şi mai înainte, căci El este Blândul, Milostivul”",
                            "verse 52:29": "Aminteşte-ţi! Tu nu eşti, har Domnului tău, nici prezicător şi nici îndrăcit!",
                            "verse 52:30": "Ei vor spune: “Este un poet! Şi pentru el aşteptăm necazurile vremii!”",
                            "verse 52:31": "Spune: “Aşteptaţi! Eu sunt cu voi printre cei care aşteaptă!”",
                            "verse 52:32": "Oare visele lor le poruncesc aceasta ori sunt un popor de ticăloşi?",
                            "verse 52:33": "Vor spune: “El l-a născocit!” Nu!.",
                            "verse 52:34": "Să aducă o spusă asemenea lui, dacă spun adevărul!",
                            "verse 52:35": "Au fost creaţi din nimic ori sunt ei creatorii?",
                            "verse 52:36": "Au creat ei cerurile şi pământul? Nu!.",
                            "verse 52:37": "Au ei comorile Domnului tău ori le pot stăpâni?",
                            "verse 52:38": "Au ei vreo scară de pe care să asculte? Să vină cel care a ascultat dintre ei cu o împuternicire desluşită!",
                            "verse 52:39": "Dumnezeu o fi având fiice, iar voi fii?",
                            "verse 52:40": "Le ceri tu vreo răsplată? Atunci ar fi împovăraţi de datorii!",
                            "verse 52:41": "Au ei Taina, aşa încât să o scrie?",
                            "verse 52:42": "Vor vreun vicleşug? Cei care au tăgăduit vor fi cei vicleniţi!",
                            "verse 52:43": "Au ei un dumnezeu afară de Dumnezeu? Mărire lui Dumnezeu.",
                            "verse 52:44": "Dacă văd o bucată de cer năruindu-se, ei vor spune: “Sunt numai nori vălătuciţi.",
                            "verse 52:45": "Lasă-i până când vor întâlni Ziua în care vor fi trăsniţi,",
                            "verse 52:46": "Ziua în care vicleşugul lor nu le va mai sluji la nimic, Ziua în care nu vor mai fi ajutaţi.",
                            "verse 52:47": "Ticăloşii vor avea parte de o osândă înaintea acesteia, însă cei mai mulţi dintre ei nu vor şti nimic.",
                            "verse 52:48": "Rabdă pentru Judecata Domnului tău, căci tu eşti sub ochii Noştri.",
                            "verse 52:49": "Preamăreşte-L noaptea şi la pălitul stelelor! scoli!"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Клянусь Горою (Откровений)2180,",
                            "verse 52:2": "Начертанным Законом (Божьим)2181,",
                            "verse 52:3": "Развернутым на свитке,",
                            "verse 52:4": "И часто посещаемой молельней2182,",
                            "verse 52:5": "И вознесенным пологом(небесным)2183,",
                            "verse 52:6": "И океаном, вздутым (до предела)2184, —",
                            "verse 52:7": "Поистине, падет на вас Господненаказанье,",
                            "verse 52:8": "Никто не отвратит Его.",
                            "verse 52:9": "В тот День,Когда в волнение придет небесный свод",
                            "verse 52:10": "И разлетятся горы,",
                            "verse 52:11": "Проклятием предстанет этот Деньдля тех,Кто ложью нарекал (ГосподнеСлово), —",
                            "verse 52:12": "Для тех, кто тешился в ничтожныхмелочах.",
                            "verse 52:13": "В тот День(Одним толчком) неодолимымОни повергнуты во пламя Ада будут.",
                            "verse 52:14": "И скажут им: «Вот тот Огонь,Который вы упрямо отвергали!",
                            "verse 52:15": "Ужель все это (лишь) дурманИль не (способны) видеть вы?",
                            "verse 52:16": "Горите в нем — не все ль равно,Вы вытерпите или нет сей Огнь!Ведь такова награда за поступки ваши».",
                            "verse 52:17": "А праведникам пребывать в Садахуслады,",
                            "verse 52:18": "Вкушая то, что даровал им Бог,Избавив их от наказанья Адом.",
                            "verse 52:19": "«Извольте есть и пить во здравиеи пользу,В награду за (хорошие) дела».",
                            "verse 52:20": "Там они будут возлежать на ложах,что стоят рядами.",
                            "verse 52:21": "И те, кто (в Господа) уверовалИ чьи потомства веру прадедовизбрали,Приведены в едины семьи будут.",
                            "verse 52:22": "Мы одарим их из плодов и мяса тем2185,К чему лежат их устремленья.",
                            "verse 52:23": "Там чашами (любви) обмениватьсябудутБез пустословья лишнего и всякихпобуждений ко греху.",
                            "verse 52:24": "Со всех сторон благоприятствоватьим будутПрекрасны юноши, что чистотойсвоейПодобны бережно хранимымжемчугам.",
                            "verse 52:25": "Они приблизятся с расспросамидруг к другу",
                            "verse 52:26": "И молвят: «В себе несли мы преждестрахОб участи своих родных и близких,",
                            "verse 52:27": "Но наш Господь был добр к нам,Избавив нас от наказания самумом2186.",
                            "verse 52:28": "Взывали мы к Нему и раньше,(А здесь душой уверилися в том),Что Он, поистине, всемилостив и благ!»",
                            "verse 52:29": "А потому Аллаху вознеси хвалу, —Ведь лишь по милости ЕгоНеодержим и не провидец ты.",
                            "verse 52:30": "Иль возгласят они:«Поэт! Мы подождем, пока ход времениОбрушит на него свой(приговор) недобрый».",
                            "verse 52:31": "Скажи (им):«Ждите.",
                            "verse 52:32": "Быть может, неспособностьк разуменьюИх побуждает ко сему?Иль, может быть, они те люди,Которые дозволенного граниперешли?",
                            "verse 52:33": "Иль говорят они:«Он это (Откровение) измыслил».",
                            "verse 52:34": "А если правду говорят они,Пусть принесут подобный сказ.",
                            "verse 52:35": "Из ничего ль они сотворены,Иль сами сотворили все,",
                            "verse 52:36": "Иль небеса и землю сотворили сами?Поистине, в них твердой веры нет.",
                            "verse 52:37": "Иль в их руках сокровища (познания)Аллаха?Иль они сами правят (ход событийна земле)?",
                            "verse 52:38": "Быть может, лестница имеется у них,Поднявшись по которойОни подслушать могут(все секреты неба)?Тогда пускай один из нихПредъявит ясное свидетельство сему.",
                            "verse 52:39": "Иль только дочери у Бога2187,У вас же — сыновья?",
                            "verse 52:40": "Иль ты, (о Мухаммад!), награды ждешь(от них),Они ж — отягчены долгами?",
                            "verse 52:41": "Иль в их руках Незримое2188,О коем они записи ведут?",
                            "verse 52:42": "Или они тебе, (о Мухаммад!),ловушки ставят?Но те, кто Господа отверг,Сам попадет в такую же (ловушку).",
                            "verse 52:43": "Или у них другое божество, кромеАллаха —Хвала Аллаху от всего,Что в сотоварищи ЕмуОни (так дерзко) прочат!",
                            "verse 52:44": "И если бы кусочек неба обрушилсяна их глазах2189,То и тогда б они сказали:«Все это — лишь скопленье облаков».",
                            "verse 52:45": "А потому оставь их(до того мгновенья),Пока они свой День не встретят,Когда они от страха онемеют, —",
                            "verse 52:46": "Тот День,Когда их хитрости им не помогутИ никакой защиты им не ждать.",
                            "verse 52:47": "Поистине, для тех, кто зло творит,Есть кара и помимо этой2190,Но большинство из них не понимает.",
                            "verse 52:48": "А потому ты терпеливо жди указасвоего Владыки, —Ведь ты всегда в Деснице Нашей.",
                            "verse 52:49": "И ночью возноси Ему хвалу,И в час ухода (на покой) всех звезд."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "¡Por el Monte!",
                            "verse 52:2": "¡Por una Escritura, puesta por escrito",
                            "verse 52:3": "en un pergamino desenrollado!",
                            "verse 52:4": "¡Por la Casa frecuentada!",
                            "verse 52:5": "¡Por la bóveda elevada!",
                            "verse 52:6": "¡Por el mar hinchado!",
                            "verse 52:7": "¡Sí, el castigo de tu Señor tendrá lugar,",
                            "verse 52:8": "nadie podrá rechazarlo!",
                            "verse 52:9": "El día que el cielo gire vertiginosamente",
                            "verse 52:10": "y se pongan las montañas en marcha.",
                            "verse 52:11": "Ese día ¡ay de los desmentidores,",
                            "verse 52:12": "que parloteaban por pasar el rato!",
                            "verse 52:13": "El día que se les empuje, violentamente, al fuego de la gehena:",
                            "verse 52:14": "«¡Éste es el fuego que desmentíais!",
                            "verse 52:15": "¿Es, pues, esto magia? ¿O es que no veis claro?",
                            "verse 52:16": "¡Arded en él! Debe daros lo mismo que lo aguantéis o no.",
                            "verse 52:17": "Quienes temieron a Alá, en cambio, estarán en jardines y delicia,",
                            "verse 52:18": "disfrutando de lo que su Señor les dé.",
                            "verse 52:19": "«¡Comed y bebed en paz! ¡Por lo que habéis hecho!»",
                            "verse 52:20": "Reclinados en lechos alineados.",
                            "verse 52:21": "Reuniremos con los creyentes a los descendientes que les siguieron en la fe.",
                            "verse 52:22": "Les proveeremos de la fruta y de la carne que apetezcan.",
                            "verse 52:23": "Allí se pasarán unos a otros una copa cuyo contenido no incitará a vaniloquio ni a pecado.",
                            "verse 52:24": "Para servirles, circularán a su alrededor muchachos como perlas ocultas.",
                            "verse 52:25": "Y se volverán unos a otros para preguntarse.",
                            "verse 52:26": "Dirán: «Antes vivíamos angustiados en medio de nuestra familia.",
                            "verse 52:27": "Alá nos agració y preservó del castigo del viento abrasador.",
                            "verse 52:28": "Ya Le invocábamos antes.",
                            "verse 52:29": "¡Amonesta, pues, porque, por la gracia de tu Señor, no eres adivino ni poseso!",
                            "verse 52:30": "O dicen: «¡Un poeta.",
                            "verse 52:31": "Di: «¡Esperad! Yo espero con vosotros».",
                            "verse 52:32": "¿Se les ordena en sueños que hablen así o es que son gente rebelde?",
                            "verse 52:33": "O dicen: «¡Él se lo ha inventado!» ¡No, no creen!",
                            "verse 52:34": "Si es verdad lo que dicen, ¡que traigan un relato semejante!",
                            "verse 52:35": "¿Han sido creados de la nada? ¿O son ellos los creadores?",
                            "verse 52:36": "¿O han creado los cielos y la tierra? No, no están convencidos.",
                            "verse 52:37": "¿O tienen los tesoros de tu Señor? ¿O se creen unos potentados?",
                            "verse 52:38": "¿O tienen una escala que les permita escuchar? El que de ellos lo consiga ¡que aporte una autoridad manifesta!",
                            "verse 52:39": "¿O tendrá Él hijas, como vosotros tenéis hijos?",
                            "verse 52:40": "¿O es que les reclamas un salario tal que se vean abrumados de deudas?",
                            "verse 52:41": "¿O es que conocen lo oculto y toman nota?",
                            "verse 52:42": "¿O quieren urdir una estratagema? Los infieles serían sus víctimas.",
                            "verse 52:43": "¿O tienen un dios diferente de Alá? ¡Gloria a Alá, Que está por encima de lo que Le asocian!",
                            "verse 52:44": "Si vieran caer parte del cielo, dirían: «Son nubes que se han amontonado».",
                            "verse 52:45": "Déjales hasta que les llegue su día, cuando sean fulminados,",
                            "verse 52:46": "el día de su estratagema no les sirva de nada y nadie les auxilie.",
                            "verse 52:47": "Los impíos sufrirán, además, otro castigo, pero la mayoría no saben.",
                            "verse 52:48": "¡Espera paciente la decisión de tu, Señor, pues te vemos! Y ¡celebra las alabanzas de tu Señor cuando estás de pie!",
                            "verse 52:49": "¡Glorifícale durante la noche y al declinar las estrellas!"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "தூர் (மலை) மீது சத்தியமாக!",
                            "verse 52:2": "ஏட்டில் எழுதப்பட்ட வேதத்தின் மீது சத்தியமாக!",
                            "verse 52:3": "விரித்து வைக்கப்பட்ட,",
                            "verse 52:4": "பைத்துல் மஃமூர் மீது சத்தியமாக!",
                            "verse 52:5": "உயர்த்தப்பட்ட முகட்டின் மீது சத்தியமாக!",
                            "verse 52:6": "பொங்கும் கடலின் மீது சத்தியமாக!",
                            "verse 52:7": "நிச்சயமாக உம்முடைய இறைவன் (விதித்திருக்கும்) வேதனை சம்பவிக்கும்.",
                            "verse 52:8": "அதனைத் தடுப்பவர் எவருமில்லை.",
                            "verse 52:9": "வானம் துடித்துச் சுற்றிக் குமுறும் நாளில்,",
                            "verse 52:10": "இன்னும், மலைகள் தூள் துளாகி விடும் போது,",
                            "verse 52:11": "(சன்மார்க்கத்தை எதிர்த்து அதைப்) பொய்யாக்கிக் கொண்டிருந்தோருக்கு அந்நாளில் கேடுதான்.",
                            "verse 52:12": "எவர்கள் (பொய்யானவற்றில்) மூழ்கி விளையாடிக் கொண்டிருக்கின்றனரோ,",
                            "verse 52:13": "அந்நாளில் அவர்கள் நரக நெருப்பின் பால் இழுக்கப்படுவோராக இழுக்கப்படுவர்.",
                            "verse 52:14": "அந்நாளில்; (அவர்களுக்குக் கூறப்படும்:) \"நீங்கள் பொய்யாக்கிக் கொண்டிருந்த (நரக) நெருப்பு இதுதான்.",
                            "verse 52:15": "\"இது சூனியம் தானா? அல்லது பார்க்க முடியாது (குருடர்களாக) ஆகிவிட்டீர்களா?",
                            "verse 52:16": "\"நீங்கள் அதில் நுழையுங்கள், பிறகு நீங்கள் (அதன் வேதனையைச்) சகித்துக் கொள்ளுங்கள்; அல்லது சகித்துக் கொள்ளாதிருங்கள், (இரண்டும்) உங்களுக்குச் சமமே, நிச்சயமாக நீங்கள் செய்து கொண்டிருந்த வற்றிற்காகத்தான் நீங்கள் கூலி கொடுக்கப்படுகிறீர்கள்.",
                            "verse 52:17": "நிச்சயமாக, பயபக்தியுடையவர்கள் சுவர்க்கச் சோலைகளிலும், (இறையருளில்) இன்புற்றும் இருப்பார்கள்.",
                            "verse 52:18": "அவர்களுடைய இறைவன் அவர்களுக்கு அளித்ததை அனுபவித்தவர்களாகயிருப்பார்கள் - அன்றியும், அவர்களுடைய இறைவன் நரக வேதனையிலிருந்து அவர்களைப் பாதுகாத்துக் கொண்டான்.",
                            "verse 52:19": "(அவர்களுக்குக் கூறப்படும்:) \"நீங்கள் (நன்மைகளைச்) செய்து கொண்டிருந்ததற்காக, (சுவர்க்கத்தில்) தாராளமாகப் புசியுங்கள், பருகுங்கள்.",
                            "verse 52:20": "அணி அணியாகப் போடப்பட்ட மஞ்சங்களின் மீது சாய்ந்தவர்களாக அவர்கள் இருப்பார்கள்; மேலும், நாம் அவர்களுக்கு, நீண்ட கண்களையுடைய (ஹூருல் ஈன்களை) மணம் முடித்து வைப்போம்.",
                            "verse 52:21": "எவர்கள் ஈமான் கொண்டு, அவர்களுடைய சந்ததியாரும் ஈமானில் அவர்களைப் பின் தொடர்கிறார்களோ, அவர்களுடைய அந்த சந்ததியனரை அவர்களுடன் (சுவனத்தில் ஒன்று) சேர்த்து விடுவோம்.",
                            "verse 52:22": "இன்னும் அவர்கள் விரும்பும் கனிவகைகளையும் இறைச்சியையும், நாம் அவர்களுக்குக் கொடுத்துக் கொண்டிருப்போம்.",
                            "verse 52:23": "(அமுதம் நிறைந்த) ஒருவர் கோப்பையை மற்றொருவர் பறித்துக் கொள்வர், ஆனால் அதில் வீணுமில்லை, குற்றமிழைப்பதும் இல்லை.",
                            "verse 52:24": "அவர்களுக்கு(ப் பணி விடைக்கு) உள்ள சிறுவர்கள், அவர்களைச் சுற்றிக் கொண்டே இருப்பார்கள், அவர்கள் பதித்த ஆணி முத்துகளைப் போல் (இருப்பார்கள்).",
                            "verse 52:25": "அவர்களில் சிலர் சிலரை முன்னோக்கி விசாரித்துக் கொள்வார்கள்.",
                            "verse 52:26": "\"இதற்கு முன் (உலகில்) நாம் நம் குடும்பத்தாரிடையே இருந்த போது (வேதனை பற்றி) நிச்சயமாக அஞ்சியவர்களாகவே இருந்தோம்.",
                            "verse 52:27": "\"ஆனால் அல்லாஹ் நம்மீது உபகாரம் செய்து கொடிய வேதனையிலிருந்து நம்மை காப்பாற்றினான்.",
                            "verse 52:28": "\"நிச்சயமாக நாம் முன்னே (உலகில்) அவனைப் பிரார்த்தித்துக் கொண்டிருந்தோம், நிச்சயமாக அவனே மிக்க நன்மை செய்பவன், பெருங்கிருபையுடையவன்.",
                            "verse 52:29": "எனவே, (நபியே! நீர் மக்களுக்கு நல்லுபதேசத்தால்) நினைவுறுத்திக் கொண்டிருப்பீராக! உம்முடைய இறைவனின் அருளால், நீர் குறிகாரரும் அல்லர், பைத்தியக்காரருமல்லர்.",
                            "verse 52:30": "அல்லது: அவர்கள் (உம்மைப் பற்றி, \"அவர்) புலவர், அவருக்குக் காலத்தின் துன்பத்தைக் கொண்டு நாங்கள் வழி பார்த்து இருக்கிறோம்\" என்று கூறுகிறார்களா?",
                            "verse 52:31": "\"நீங்களும் வழி பார்த்திருங்கள் - நிச்சயமாக நானும் உங்களுடன் வழி பார்க்கிறேன்\" என்று (நபியே!) நீர் கூறும்.",
                            "verse 52:32": "அல்லது, அவர்களுடைய புத்திகள் தாம் அவர்களை இவ்வா(றெல்லாம் பேசுமா)று ஏவுகின்றனவா? அல்லது அவர்கள் வரம்பு மீறிய சமூகத்தாரா?",
                            "verse 52:33": "அல்லது, இ(வ்வேதத்)தை நீர் இட்டுக் கட்டினீர் என்று அவர்கள் கூறுகின்றனரா? அல்ல.",
                            "verse 52:34": "ஆகவே, (இவ்வாறெல்லாம் கூறும்) அவர்கள் உண்மையாளர்களாக இருந்தால், இ(வ்வேதத்)தைப் போன்ற ஒரு செய்தியை அவர்கள் கொண்டு வரட்டும்.",
                            "verse 52:35": "அல்லது, அவர்கள் எந்தப் பொருளின்றியும் (தாமாகவே) படைக்கப்பட்டனரா? அல்லது அவர்கள் (எதையும்) படைக்கிற (சக்தியுடைய)வர்களா?",
                            "verse 52:36": "அல்லது, வானங்களையும் பூமியையும் அவர்கள் படைத்தார்களா? அல்ல.",
                            "verse 52:37": "அல்லது, அவர்களிடம் உம்முடைய இறைவனின் பொக்கிஷங்கள் இருக்கின்றனவா? அல்லது இவர்கள் தாம் (எல்லாவற்றையும்) அடக்கியாள்பவர்களா?",
                            "verse 52:38": "அல்லது, அவர்களுக்கு ஏணி இருந்து அதன் மூலம் (வானத்தின் இரகசியங்களை) கேட்டு வருகின்றார்களா? அவ்வாறாயின், அவர்களில் கேட்டு வந்தவர் செவியேற்றதைத் தெளிவான ஆதாரத்துடன் கொண்டு வரட்டும்.",
                            "verse 52:39": "அல்லது, அவனுக்குப் பெண் மக்களும் உங்களுக்கு ஆண் மக்களுமா?",
                            "verse 52:40": "அல்லது, நீர் அவர்களிடம் ஏதாவது கூலி கேட்டு, (அதைக் கொடுத்ததினால்) அவர்கள் கடன் பட்டு சுமையேற்றப்பட்டிருக்கின்றார்களா,",
                            "verse 52:41": "அல்லது, அவர்களிடம் மறைவான செய்திகளிலிருந்து, அவற்றை அவர்கள் எழுதுகின்றார்களா,",
                            "verse 52:42": "அல்லது, அவர்கள் (உமக்கு எதிராக) ஏதாவது சூழ்ச்சி செய்ய நாடுகிறார்களா, அப்படியானால், அந்த காஃபிர்கள் தாம் சூழச்சிக்குள்ளாவார்கள்.",
                            "verse 52:43": "அல்லது, அவர்களுக்கு அல்லாஹ் அல்லாமல் (வேறு) நாயன் இருக்கின்றானா, அவர்கள் இணை வைப்பதை விட்டும் அல்லாஹ் மிகத் தூயவன்.",
                            "verse 52:44": "வானத்திலிருந்து ஒரு துண்டு விழுவதை அவர்கள் கண்டார்களானால், அதை அடர்த்தியான மேகம் என்று அவர்கள் கூறிவிடுவார்கள்.",
                            "verse 52:45": "ஆகவே அச்சத்தால் அவர்கள் உணர்விழக்கும் நாளைச் சந்திக்கும்வரை, அவர்களை விட்டு விடுவீர்களாக.",
                            "verse 52:46": "அந்நாளில், அவர்களுடைய சூழ்ச்சிகள் எதுவும் அவர்களுக்குப் பயன் அளிக்காது, அன்றியும் (எவராலும்) அவர்கள் உதவி செய்யப்படவும் மாட்டார்கள்.",
                            "verse 52:47": "அன்றியும், அநியாயம் செய்து கொண்டு இருந்தவர்களுக்கு நிச்சயமாக மற்றொரு வேதனையும் (இம்மையில்) உண்டு எனினும் அவர்களில் பெரும்பாலோர் இதை அறிய மாட்டார்கள்.",
                            "verse 52:48": "எனவே (நபியே!) உம்முடைய இறைவனின் தீர்ப்புக்காகப் பொறுத்திறுப்பீராக, நிச்சயமாக நீர் நம் கண்காணிப்பில் இருக்கின்றீர்; மேலும் நீங்கள் எழுந்திருக்கும் சமயத்தில் உம் இறைவனின் புகழைக் கூறித் தஸ்பீஹு செய்வீராக,",
                            "verse 52:49": "இன்னும், இரவின் ஒரு பாகத்திலும், நட்சத்திரங்கள் அடையும் நேரத்திலும் அவனைத்(துதி செய்து) தஸ்பீஹு செய்வீராக! செய்வீராக,"
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "ขอสาบานต่อภูเขาอัฏฏูร",
                            "verse 52:2": "ขอสาบานต่อคัมภีร์ที่ถูกจารึกไว้",
                            "verse 52:3": "ในม้วนกระดาษหรือหนังที่กางแผ่",
                            "verse 52:4": "ขอสาบานต่ออาคารที่ถูกเยือนอย่างสม่ำเสมอ",
                            "verse 52:5": "ขอสาบานต่อท้องฟ้าที่อยู่เบื้องสูง",
                            "verse 52:6": "ขอสาบานต่อทะเลที่ลุกโชติช่วง (ในวันกิยามะฮ์)",
                            "verse 52:7": "แท้จริงการลงโทษของพระเจ้าของเจ้าจะเกิดขึ้นอย่างแน่นอน",
                            "verse 52:8": "ไม่มีผู้ใดจะเบี่ยงบ่ายมันได้",
                            "verse 52:9": "วันที่ชั้นฟ้าจะสั่นสะเทือนอย่างชุลมุนวุ่นวาย",
                            "verse 52:10": "และเทือกเขาจะปลิวว่อนกระจัดกระจาย",
                            "verse 52:11": "ดังนั้น ความหายนะในวันนั้นจงประสบแก่บรรดาผู้ปฏิเสธ",
                            "verse 52:12": "บรรดาที่พวกเขาอยู่ในการมั่วสุม การละเล่นอย่างไร้สาระ",
                            "verse 52:13": "วันที่พวกเขาจะถูกผลักลงนรกญะฮันนัมอย่างผลักไสไล่ส่ง",
                            "verse 52:14": "นี่คือไฟนรก ซึ่งพวกเจ้าเคยปฏิเสธมัน",
                            "verse 52:15": "นี่คือเล่ห์กลหรือ หรือว่าพวกเจ้ายังมองไม่เห็น?",
                            "verse 52:16": "จงเข้าไปเผาไหม้ในนั้น พวกเจ้าจะทนได้หรือทนไม่ได้ก็เท่าเทียมกันสำหรับพวกเจ้า แท้จริงพวกเจ้านั้นจะถูกตอบแทนตามที่พวกเจ้าได้กระทำไว้เท่านั้น",
                            "verse 52:17": "แท้จริงบรรดาผู้ยำเกรงนั้นจะได้อยู่ในสวนสวรรค์ และความสุขสำราญ",
                            "verse 52:18": "ได้รับความสุขอันล้นพ้นตามที่พวกเขาและพระเจ้าของพวกเขาจะคุ้มครองพวกเขาให้พ้นจากการลงโทษของเปลวไฟ",
                            "verse 52:19": "พวกเจ้าจงกิน จงดื่มอย่างสบายใจตามที่พวกเจ้าได้กระทำไว้",
                            "verse 52:20": "นอนเอกเขนกอยู่บนเตียงเรียงชิดติดกัน และเราให้พวกเขามีคู่ครองเป็นหญิงสาวสวยดวงตาโตคม",
                            "verse 52:21": "และบรรดาผู้ศรัทธา บรรดาลูกหลานของพวกเขาจะดำเนินตามพวกเขาด้วยการศรัทธา เราจะให้ลูกหลานของพวกเขาอยู่ร่วมกับพวกเขา และเราจะไม่ให้การงานของพวกเขาลดหย่อนลงจากพวกเขาแต่อย่างใด แต่ละคนย่อมได้รับการค้ำประกันในสิ่งที่เขาขวนขวายไว้",
                            "verse 52:22": "และเราจะเพิ่มพูนให้แก่พวกเขา ซึ่งผลไม้และเนื้อตามที่พวกเขาต้องการ",
                            "verse 52:23": "พวกเขาจะแลกเปลี่ยนถ้วยแก้วกันในสวรรค์ จะไม่มีการพูดจาตลกคะนอง และไม่มีการทำบาป",
                            "verse 52:24": "มีเด็กวัยรุ่นของพวกเขาวนเวียนรับใช้พวกเขา เสมือนว่าพวกเขาเช่นไข่มุกถูกปกปิดไว้",
                            "verse 52:25": "และบางคนในหมู่พวกเขาจะหันหน้าเข้าหากัน สอบถามซึ่งกันและกัน",
                            "verse 52:26": "พวกเขากล่าวว่า แท้จริง แต่ก่อนนี้ (ในโลกดุนยา) พวกเราอยู่กับครอบครัวของเราเป็นผู้มีความวิตกกังวล",
                            "verse 52:27": "ดังนั้น อัลลอฮ์ได้ทรงโปรดปรานแก่เรา และได้ทรงปกป้องเราให้พ้นจากการลงโทษแห่งลมร้อน",
                            "verse 52:28": "แท้จริง ก่อนหน้านี้เราได้วิงวอนต่อพระองค์ แท้จริงพระองค์นั้นเป็นผู้ทรงเอื้อเฟื้อเผื่อแผ่ ผู้ทรงเมตตาเสมอ",
                            "verse 52:29": "ดังนั้น จงกล่าวเตือน (พวกเขาเถิด) เนื่องเพราะความโปรดปรานแห่งพระเจ้าของเจ้ามิได้เป็นโหร และมิได้เป็นบ้า",
                            "verse 52:30": "หรือพวกเขากล่าวว่า มุฮัมมัดเป็นกวี เราคอยภัยพิบัติที่จะเกิดขึ้นแก่เขา",
                            "verse 52:31": "จงกล่าวเถิดมุฮัมมัด พวกท่านจงคอยเถิด แท้จริงฉันก็จะอยู่ในหมู่ผู้คอยร่วมกับพวกท่าน",
                            "verse 52:32": "หรือว่าสติปัญญาของพวกเขาใช้พวกเขาให้เชื่อเช่นนั้น หรือว่าพวกเขาเป็นหมู่ชนผู้ฝ่าฝืน",
                            "verse 52:33": "หรือพวกเขากล่าวว่า เขาได้เสกสรรปั้นแต่งอัลกุรอานขึ้นเอง เปล่าดอก พวกเขาไม่ศรัทธาต่างหาก",
                            "verse 52:34": "ดังนั้น พวกเขาจงนำคำกล่าวเช่นเดียวกันนี้มา หากพวกเขาเป็นผู้สัตย์จริง",
                            "verse 52:35": "หรือว่าพวกเขาถูกบังเกิดมาโดยไม่มีผู้ให้บังเกิด หรือว่าพวกเขาเป็นผู้ให้บังเกิดตนเอง",
                            "verse 52:36": "หรือว่าพวกเขาเป็นผู้สร้างชั้นฟ้าทั้งหลายและแผ่นดินนี้ เปล่าเลย เพราะพวกเขาไม่เชื่อมั่นต่างหาก",
                            "verse 52:37": "หรือว่าพวกเขามีขุมทรัพย์แห่งพระเจ้าของเจ้า หรือว่าพวกเขาเป็นผู้มีอำนาจจัดการ",
                            "verse 52:38": "หรือว่าพวกเขามีบันไดเพื่อพวกเขาจะได้ฟังเรื่องราวต่าง ๆ ในชั้นฟ้า ดังนั้น ก็จงให้คนที่ฟังในหมู่พวกเขานำหลักฐานอันชัดแจ้งมา",
                            "verse 52:39": "หรือว่าพระองค์ทรงมีบุตรหญิงหลายคน และพวกเจ้ามีบุตรชายหลายคน",
                            "verse 52:40": "หรือว่าเจ้าขอค่าจ้างจากพวกเขา ดังนั้น พวกเขาจึงมีภาระหนี้อันหนัก",
                            "verse 52:41": "หรือว่าที่พวกเขามีสิ่งเร้นลับ แล้วพวกเขาก็บันทึกไว้",
                            "verse 52:42": "หรือว่าพวกเขาต้องการที่จะวางแผนร้าย แต่ว่าบรรดาผู้ปฏิเสธศรัทธานั้น พวกเขาต่างหากที่จะถูกวางแผนร้าย",
                            "verse 52:43": "หรือว่าพวกเขามีพระเจ้าอื่นจากอัลลอฮ์ มหาบริสุทธิ์ยิ่งแด่อัลลอฮ์จากสิ่งที่พวกเขาตั้งภาคี",
                            "verse 52:44": "ครั้นเมื่อพวกเขาเห็นเศษชิ้นหนึ่งร่วงหล่นลงมาจากฟากฟ้า พวกเขาจะกล่าวว่า มันเป็นเพียงก้อนเมฆรวมตัว",
                            "verse 52:45": "ดังนั้น จงปล่อยพวกเขาเถิด จนกว่าพวกเขาจะพบกับวันของพวกเขา ซึ่งในวันนั้นพวกเขาจะถูกทำให้เป็นลมหมดสติ",
                            "verse 52:46": "วันซึ่งแผนการณ์ร้ายของพวกเขาจะไม่อำนวยประโยชน์อันใดแก่พวกเขา และพวกเขาก็จะไม่ได้รับการช่วยเหลือ",
                            "verse 52:47": "และแท้จริงสำหรับบรรดาผู้อธรรมนั้นจะได้รับการลงโทษอื่นจากนั้นอีก แต่ว่าส่วนมากของพวกเขาไม่รู้",
                            "verse 52:48": "ดังนั้น จงอดทนต่อพระบัญชาของพระเจ้าของเจ้า เพราะแท้จริง เจ้านั้นอยู่ในเบื้องสายตาของเรา และจงแซ่ซ้องสดุดีด้วยการสรรเสริญพระเจ้าของเจ้าขณะเมื่อเจ้าลุกขึ้นยืน",
                            "verse 52:49": "และส่วนหนึ่งของกลางคืน ก็จงแซ่ซ้องสดุดีพระองค์ และเมื่อยามคล้อยลับของหมู่ดวงดาว"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Tûr'a,",
                            "verse 52:2": "andolsun ki,",
                            "verse 52:3": "Satır",
                            "verse 52:4": "satır yazılmış Kitab'a,",
                            "verse 52:5": "Yayılmış",
                            "verse 52:6": "ince deri üzerine, 4 Beyt-i Ma'mûr'a,",
                            "verse 52:7": "Yükseltilmiş",
                            "verse 52:8": "tavana(göğe),",
                            "verse 52:9": "Kaynatılmış",
                            "verse 52:10": "denize (bunlara andolsun ki),",
                            "verse 52:11": "Rabbinin",
                            "verse 52:12": "azabı mutlaka vuku bulacaktır.",
                            "verse 52:13": "Ona",
                            "verse 52:14": "engel olacak hiçbir şey yoktur.",
                            "verse 52:15": "O",
                            "verse 52:16": "gün gök sallanıp çalkalanır.",
                            "verse 52:17": "Dağlar",
                            "verse 52:18": "yürüdükçe yürür.",
                            "verse 52:19": "Yalanlayanların",
                            "verse 52:20": "vay haline o gün!",
                            "verse 52:21": "Ki",
                            "verse 52:22": "onlar daldıkları bâtıl içinde oyalanıp duranlardır.",
                            "verse 52:23": "O",
                            "verse 52:24": "gün cehennem ateşine itilip atılırlar :",
                            "verse 52:25": "\"İşte yalanlayıp durduğunuz ateş budur!\" denilir.",
                            "verse 52:26": "Bir büyü müdür bu, yoksa görmüyor musunuz?",
                            "verse 52:27": "Girin oraya, sabretseniz de sabretmeseniz de artık sizin için birdir.",
                            "verse 52:28": "Şüphesiz (kötülüklerden) korunanlar cennetlerde ve nimet içindedirler.",
                            "verse 52:29": "Rablerinin kendilerine verdikleriyle sefâ sürerler, (Zira) Rableri onları, cehennem azabından korumuştur.",
                            "verse 52:30": "Onlara: Yaptıklarınıza karşılık âfiyetle yeyin,için (denilir).",
                            "verse 52:31": "\"",
                            "verse 52:32": "Sıra sıra dizilmiş koltuklara yaslanarak\"Onları,ceylan gözlü hûrilerle evlendirmişizdir:",
                            "verse 52:33": "İman eden ve soylarından gelenlerde, imanda kendilerine tâbi olanlar (var ya)! İşte biz, onların nesillerini de kendilerine kattık.",
                            "verse 52:34": "Onlara canlarının istediği meyve ve etten bol bol verdik.",
                            "verse 52:35": "Orada karşılıklı kadeh tokuştururlar, ama burada (içki yüzünden) ne saçmalama vardır ne de günaha girme.",
                            "verse 52:36": "Hizmetlerine verilmiş, (kabuğunda) saklı inci gibi gençler etraflarında dönüp dolaşırlar.",
                            "verse 52:37": "Cennettekiler birbirlerine dönüp sorarlar:",
                            "verse 52:38": "Derler ki: \"Daha önce biz, aile çevremiz içinde bile (ilâhî azaptan) korkardık.",
                            "verse 52:39": "\"Allah bize lütfetti de bizi vücudun içine işleyen azaptan korudu.",
                            "verse 52:40": "\"Gerçekten biz bundan önce O'na yalvarıyorduk.",
                            "verse 52:41": "(Resûlüm!) Sen öğüt ver.",
                            "verse 52:42": "Yoksa onlar: (O,) bir şairdir; onun, zamanın felâketlerine uğramasını bekliyoruz mu diyorlar?",
                            "verse 52:43": "De ki: Bekleyin.",
                            "verse 52:44": "Onlara akılları mı bunu emreder, yoksa onlar, azgın bir topluluk mudur?",
                            "verse 52:45": "Yahut \"Onu kendisi uydurdu!\" mu diyorlar? Hayır, onlar iman etmezler.",
                            "verse 52:46": "Eğer doğru iseler onun benzeri bir söz getirsinler.",
                            "verse 52:47": "Acaba onlar herhangi bir yaratıcı olmadan mı yaratıldılar? Yoksa kendileri mi yaratıcıdırlar?",
                            "verse 52:48": "Yoksa gökleri ve yeri onlar mı yarattılar? Hayır! Onlar bir türlü anlayıp inanmazlar.",
                            "verse 52:49": "Yahut Rabbinin hazineleri onların yanında mıdır? Ya da her şeye hakim olan kendileri midir?",
                            "verse 52:50": "Yoksa onların, üzerine çıkıp gizli sırları dinledikleri bir merdivenleri mi var? Öyleyse dinleyenleri, açık bir delil getirsinler.",
                            "verse 52:51": "Yoksa kızlar O'nun, oğullar da sizin mi?",
                            "verse 52:52": "Yoksa sen kendilerinden bir ücret istiyorsun da, bu yüzden onlar ağır bir borç altında eziliyorlar mı? 41.",
                            "verse 52:53": "Yahut bir tuzak mı kurmak istiyorlar? Asıl tuzağa düşecek olanlar, inkâr edenlerdir.",
                            "verse 52:54": "Veya onların Allah'tan başka bir tanrısı mı var? Allah, onların ortak koştukları şeylerden uzaktır.",
                            "verse 52:55": "Gökten düşen bir kütle görseler \"Üst üste yığılmış bulutlardır\" derler.",
                            "verse 52:56": "Artık çarpılacakları günlerine kavuşuncaya kadar onları kendi hallerine bırak.",
                            "verse 52:57": "O gün planları kendilerine hiçbir fayda vermez ve yardım da görmezler.",
                            "verse 52:58": "Şüphesiz zulmedenlere, ondan başka da azap vardır.",
                            "verse 52:59": "Rabbinin hükmüne sabret.",
                            "verse 52:60": "Gecenin bir kısmında ve yıldızların batışından sonra da O'nu tesbih et."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "(کوہ) طور کی قسم",
                            "verse 52:2": "(کوہِ) طُور کي قَسمo",
                            "verse 52:3": "اور لکھي ہوئي کتاب کي قَسمo",
                            "verse 52:4": "اور کتاب کی جو لکھی ہوئی ہے",
                            "verse 52:5": "کشادہ اوراق میں",
                            "verse 52:6": "(جو) کھلے صحيفہ ميں (ہے)o",
                            "verse 52:7": "اور (فرشتوں سے) آباد گھر (يعني آسماني کعبہ) کي قَسمo",
                            "verse 52:8": "اور آباد گھر کی",
                            "verse 52:9": "اور اونچی چھت کی",
                            "verse 52:10": "اور اونچي چھت (يعني بلند آسمان يا عرشِ معل?ي) کي قَسمo",
                            "verse 52:11": "اور اُبلتے ہوئے سمندر کي قَسمo",
                            "verse 52:12": "اور ابلتے ہوئے دریا کی",
                            "verse 52:13": "کہ تمہارے پروردگار کا عذاب واقع ہو کر رہے گا",
                            "verse 52:14": "بيشک آپ کے رب کا عذاب ضرور واقع ہو کر رہے گاo",
                            "verse 52:15": "اسے کوئي دفع کرنے والا نہيںo",
                            "verse 52:16": "(اور) اس کو کوئی روک نہیں سکے گا",
                            "verse 52:17": "جس دن آسمان لرزنے لگا کپکپا کر",
                            "verse 52:18": "جس دن آسمان سخت تھر تھراہٹ کے ساتھ لرزے گاo",
                            "verse 52:19": "اور پہاڑ (اپني جگہ چھوڑ کر بادلوں کي طرح) تيزي سے اڑنے اور (ذرّات کي طرح) بکھرنے لگيں گےo",
                            "verse 52:20": "اور پہاڑ اُڑنے لگے اون ہو کر",
                            "verse 52:21": "اس دن جھٹلانے والوں کے لئے خرابی ہے",
                            "verse 52:22": "سو اُس دن جھٹلانے والوں کے لئے بڑي تباہي ہےo",
                            "verse 52:23": "جو باطل (بے ہودگي) ميں پڑے غفلت کا کھيل کھيل رہے ہيںo",
                            "verse 52:24": "جو خوض (باطل) میں پڑے کھیل رہے ہیں",
                            "verse 52:25": "جس دن ان کو آتش جہنم کی طرف دھکیل دھکیل کر لے جائیں گے",
                            "verse 52:26": "جس دن کو وہ دھکيل دھکيل کر آتشِ دوزخ کي طرف لائے جائيں گےo",
                            "verse 52:27": "(اُن سے کہا جائے گا:) يہ ہے وہ جہنّم کي آگ جسے تم جھٹلايا کرتے تھےo",
                            "verse 52:28": "یہی وہ جہنم ہے جس کو تم جھوٹ سمجھتے تھے",
                            "verse 52:29": "تو کیا یہ جادو ہے یا تم کو نظر ہی نہیں آتا",
                            "verse 52:30": "سو کيا يہ جادو ہے يا تمہيں دکھائي نہيں ديتاo",
                            "verse 52:31": "اس ميں داخل ہو جاؤ، پھر تم صبر کرو يا صبر نہ کرو، تم پر برابر ہے، تمہيں صرف انہي کاموں کا بدلہ ديا جائے گا جو تم کرتے رہے تھےo",
                            "verse 52:32": "اس میں داخل ہوجاؤ اور صبر کرو یا نہ کرو تمہارے لئے یکساں ہے۔ جو کام تم کیا کرتے تھے (یہ) انہی کا تم کو بدلہ مل رہا ہے",
                            "verse 52:33": "جو پرہیزگار ہیں وہ باغوں اور نعتموں میں ہوں گے",
                            "verse 52:34": "بيشک متّقي لوگ بہشتوں اور نعمتوں ميں ہوں گےo",
                            "verse 52:35": "خوش اور لطف اندوز ہوں گے اُن (عطاؤں) سے جن سے اُن کے رب نے انہيں نوازا ہوگا، اور اُن کا رب انہيں دوزخ کے عذاب سے محفوظ رکھے گاo",
                            "verse 52:36": "جو کچھ ان کے پروردگار نے ان کو بخشا اس (کی وجہ) سے خوشحال۔ اور ان کے پروردگار نے ان کو دوزخ کے عذاب سے بچا لیا",
                            "verse 52:37": "اپنے اعمال کے صلے میں مزے سے کھاؤ اور پیو",
                            "verse 52:38": "(اُن سے کہا جائے گا:) تم اُن (نيک) اعمال کے صلہ ميں جو تم کرتے رہے تھے خوب مزے سے کھاؤ اور پيوo",
                            "verse 52:39": "وہ صف در صف بچھے ہوئے تختوں پر تکيے لگائے (بيٹھے) ہوں گے، اور ہم گوري رنگت (اور) دلکش آنکھوں والي حوروں کو اُن کي زوجيت ميں دے ديں گےo",
                            "verse 52:40": "تختوں پر جو برابر برابر بچھے ہوئے ہیں تکیہ لگائے ہوئے اور بڑی بڑی آنکھوں والی حوروں سے ہم ان کا عقد کر دیں گے",
                            "verse 52:41": "اور جو لوگ ایمان لائے اور ان کی اولاد بھی (راہ) ایمان میں ان کے پیچھے چلی۔ ہم ان کی اولاد کو بھی ان (کے درجے) تک پہنچا دیں گے اور ان کے اعمال میں سے کچھ کم نہ کریں گے۔ ہر شخص اپنے اعمال میں پھنسا ہوا ہے",
                            "verse 52:42": "اور جو لوگ ايمان لائے اور اُن کي اولاد نے ايمان ميں اُن کي پيروي کي، ہم اُن کي اولاد کو (بھي) (درجاتِ جنت ميں) اُن کے ساتھ ملا ديں گے (خواہ اُن کے اپنے عمل اس درجہ کے نہ بھي ہوں يہ صرف اُن کے صالح آباء کے اکرام ميں ہوگا) اور ہم اُن (صالح آباء) کے ثوابِ اعمال سے بھي کوئي کمي نہيں کريں گے، (علاوہ اِس کے) ہر شخص اپنے ہي عمل (کي جزا و سزا) ميں گرفتار ہوگاo",
                            "verse 52:43": "اور ہم انہيں پھل (ميوے) اور گوشت، جو وہ چاہيں گے زيادہ سے زيادہ ديتے رہيں گےo",
                            "verse 52:44": "اور جس طرح کے میوے اور گوشت کو ان کا جی چاہے گا ہم ان کو عطا کریں گے",
                            "verse 52:45": "وہاں وہ ایک دوسرے سے جام شراب جھپٹ لیا کریں گے جس (کے پینے) سے نہ ہذیان سرائی ہوگی نہ کوئی گناہ کی بات",
                            "verse 52:46": "وہاں يہ لوگ جھپٹ جھپٹ کر (شرابِ طہور کے) جام ليں گے، اس (شرابِ جنت) ميں نہ کوئي بے ہودہ گوئي ہوگي اور نہ گناہ گاري ہوگيo",
                            "verse 52:47": "اور نوجوان (خدمت گزار) اُن کے اِردگرد گھومتے ہوں گے، گويا وہ غلاف ميں چھپائے ہوئے موتي ہيںo",
                            "verse 52:48": "اور نوجوان خدمت گار (جو ایسے ہوں گے) جیسے چھپائے ہوئے موتی ان کے آس پاس پھریں گے",
                            "verse 52:49": "اور ایک دوسرے کی طرف رخ کرکے آپس میں گفتگو کریں گے",
                            "verse 52:50": "اور وہ ايک دوسرے کي طرف متوجہ ہو کر باہم پرسشِ احوال کريں گےo",
                            "verse 52:51": "وہ کہيں گے: بيشک ہم اس سے پہلے اپنے گھروں ميں (عذابِ ال?ہي سے) ڈرتے رہتے تھےo",
                            "verse 52:52": "کہیں گے کہ اس سے پہلے ہم اپنے گھر میں (خدا سے) ڈرتے رہتے تھے",
                            "verse 52:53": "تو خدا نے ہم پر احسان فرمایا اور ہمیں لو کے عذاب سے بچا لیا",
                            "verse 52:54": "پس ا? نے ہم پر احسان فرما ديا اور ہميں نارِ جہنّم کے عذاب سے بچا لياo",
                            "verse 52:55": "بيشک ہم پہلے سے ہي اُسي کي عبادت کيا کرتے تھے، بيشک وہ احسان فرمانے والا بڑا رحم فرمانے والا ہےo",
                            "verse 52:56": "اس سے پہلے ہم اس سے دعائیں کیا کرتے تھے۔ بیشک وہ احسان کرنے والا مہربان ہے",
                            "verse 52:57": "تو (اے پیغمبر) تم نصیحت کرتے رہو تم اپنے پروردگار کے فضل سے نہ تو کاہن ہو اور نہ دیوانے",
                            "verse 52:58": "سو (اے حبيبِ مکرّم!) آپ نصيحت فرماتے رہيں پس آپ اپنے رب کے فضل و کرم سے نہ تو کاہن (يعني جنّات کے ذريعے خبريں دينے والے) ہيں اور نہ ديوانےo",
                            "verse 52:59": "کيا (کفّار) کہتے ہيں: (يہ) شاعر ہيں؟ ہم اِن کے حق ميں حوادثِ زمانہ کا انتظار کر رہے ہيں؟o",
                            "verse 52:60": "کیا کافر کہتے ہیں کہ یہ شاعر ہے (اور) ہم اس کے حق میں زمانے کے حوادث کا انتظار کر رہے ہیں",
                            "verse 52:61": "کہہ دو کہ انتظار کئے جاؤ میں بھی تمہارے ساتھ انتظار کرتا ہوں",
                            "verse 52:62": "فرما ديجئے: تم (بھي) منتظر رہو اور ميں بھي تمہارے ساتھ (تمہاري ہلاکت کا) انتظار کرنے والوں ميں ہوںo",
                            "verse 52:63": "کيا اُن کي عقليں انہيں يہ (بے عقلي کي باتيں) سُجھاتي ہيں يا وہ سرکش و باغي لوگ ہيںo",
                            "verse 52:64": "کیا ان کی عقلیں ان کو یہی سکھاتی ہیں۔ بلکہ یہ لوگ ہیں ہی شریر",
                            "verse 52:65": "کیا (کفار) کہتے ہیں کہ ان پیغمبر نے قرآن از خود بنا لیا ہے بات یہ ہے کہ یہ (خدا پر) ایمان نہیں رکھتے",
                            "verse 52:66": "يا وہ کہتے ہيں کہ اس (رسول) نے اس (قرآن) کو اَزخود گھڑ ليا ہے، (ايسا نہيں) بلکہ وہ (حق کو) مانتے ہي نہيں ہيںo",
                            "verse 52:67": "پس انہيں چاہئے کہ اِس (قرآن) جيسا کوئي کلام لے آئيں اگر وہ سچے ہيںo",
                            "verse 52:68": "اگر یہ سچے ہیں تو ایسا کلام بنا تو لائیں",
                            "verse 52:69": "کیا یہ کسی کے پیدا کئے بغیر ہی پیدا ہوگئے ہیں۔ یا یہ خود (اپنے تئیں) پیدا کرنے والے ہیں",
                            "verse 52:70": "کيا وہ کسي شے کے بغير ہي پيدا کر ديئے گئے ہيں يا وہ خود ہي خالق ہيںo",
                            "verse 52:71": "يا انہوں نے ہي آسمانوں اور زمين کو پيدا کيا ہے، (ايسا نہيں) بلکہ وہ (حق بات پر) يقين ہي نہيں رکھتےo",
                            "verse 52:72": "یا انہوں نے آسمانوں اور زمین کو پیدا کیا ہے؟ (نہیں) بلکہ یہ یقین ہی نہیں رکھتے",
                            "verse 52:73": "کیا ان کے پاس تمہارے پروردگار کے خزانے ہیں۔ یا یہ (کہیں کے) داروغہ ہیں؟",
                            "verse 52:74": "يا اُن کے پاس آپ کے رب کے خزانے ہيں يا وہ اُن پر نگران (اور) داروغے ہيںo",
                            "verse 52:75": "يا اُن کے پاس کوئي سيڑھي ہے (جس پر چڑھ کر) وہ اُس (آسمان) ميں کان لگا کر باتيں سن ليتے ہيں؟ سو جو اُن ميں سے سننے والا ہے اُسے چاہئے کہ روشن دليل لائےo",
                            "verse 52:76": "یا ان کے پاس کوئی سیڑھی ہے جس پر (چڑھ کر آسمان سے باتیں) سن آتے ہیں۔ تو جو سن آتا ہے وہ صریح سند دکھائے",
                            "verse 52:77": "کیا خدا کی تو بیٹیاں اور تمہارے بیٹے",
                            "verse 52:78": "کيا اس (خدا) کے لئے بيٹياں ہيں اور تمہارے لئے بيٹے ہيںo",
                            "verse 52:79": "کيا آپ اُن سے کوئي اُجرت طلب فرماتے ہيں کہ وہ تاوان کے بوجھ سے دبے جا رہے ہيںo",
                            "verse 52:80": "(اے پیغمبر) کیا تم ان سے صلہ مانگتے ہو کہ ان پر تاوان کا بوجھ پڑ رہا ہے",
                            "verse 52:81": "یا ان کے پاس غیب (کا علم) ہے کہ وہ اسے لکھ لیتے ہیں",
                            "verse 52:82": "کيا اُن کے پاس غيب (کا علم) ہے کہ وہ لکھ ليتے ہيںo",
                            "verse 52:83": "کيا وہ (آپ سے) کوئي چال چلنا چاہتے ہيں، تو جن لوگوں نے کفر کيا ہے وہ خود ہي اپنے دامِ فريب ميں پھنسے جا رہے ہيںo",
                            "verse 52:84": "کیا یہ کوئی داؤں کرنا چاہتے ہیں تو کافر تو خود داؤں میں آنے والے ہیں",
                            "verse 52:85": "کیا خدا کے سوا ان کا کوئی اور معبود ہے؟ خدا ان کے شریک بنانے سے پاک ہے",
                            "verse 52:86": "کيا ا? کے سوا اُن کا کوئي معبود ہے، ا? ہر اُس چيز سے پاک ہے جسے وہ (ا? کا) شريک ٹھہراتے ہيںo",
                            "verse 52:87": "اور اگر وہ آسمان سے کوئي ٹکڑا (اپنے اوپر) گرتا ہوا ديکھ ليں تو (تب بھي يہ) کہيں گے کہ تہ بہ تہ (گہرا) بادل ہےo",
                            "verse 52:88": "اور اگر یہ آسمان سے (عذاب) کا کوئی ٹکڑا گرتا ہوا دیکھیں تو کہیں کہ یہ گاڑھا بادل ہے",
                            "verse 52:89": "پس ان کو چھوڑ دو یہاں تک کہ وہ روز جس میں وہ بیہوش کردیئے جائیں گے، سامنے آجائے",
                            "verse 52:90": "سو آپ اُن کو (اُن کے حال پر) چھوڑ ديجئے يہاں تک کہ وہ اپنے اس دن سے آمليں جس ميں وہ ہلاک کر ديئے جائيں گےo",
                            "verse 52:91": "جس دِن نہ اُن کا مکر و فريب ان کے کچھ کام آئے گا اور نہ ہي اُن کي مدد کي جائے گےo",
                            "verse 52:92": "جس دن ان کا کوئی داؤں کچھ بھی کام نہ آئے اور نہ ان کو (کہیں سے) مدد ہی ملے",
                            "verse 52:93": "اور ظالموں کے لئے اس کے سوا اور عذاب بھی ہے لیکن ان میں کے اکثر نہیں جانتے",
                            "verse 52:94": "اور بيشک جو لوگ ظلم کر رہے ہيں اُن کے لئے اس عذاب کے علاوہ بھي عذاب ہے، ليکن اُن ميں سے اکثر لوگ جانتے نہيں ہيںo",
                            "verse 52:95": "اور (اے حبيبِ مکرّم! اِن کي باتوں سے غم زدہ نہ ہوں) آپ اپنے رب کے حکم کي خاطر صبر جاري رکھئے بيشک آپ (ہر وقت) ہماري آنکھوں کے سامنے (رہتے) ہيں? اور آپ اپنے رب کي حمد کے ساتھ تسبيح کيجئے جب بھي آپ کھڑے ہوںo? اگر ان ظالموں نے نگاہيں پھير لي ہيں تو کيا ہوا، ہم تو آپ کي طرف سے نگاہيں ہٹاتے ہي نہيں ہيں اور ہم ہر وقت آپ کو ہي تکتے رہتے ہيں?",
                            "verse 52:96": "اور تم اپنے پروردگار کے حکم کے انتظار میں صبر کئے رہو۔ تم تو ہماری آنکھوں کے سامنے ہو اور جب اُٹھا کرو تو اپنے پروردگار کی تعریف کے ساتھ تسبیح کیا کرو",
                            "verse 52:97": "اور رات کے بعض اوقات میں بھی اور ستاروں کے غروب ہونے کے بعد بھی اس کی تنزیہ کیا کرو",
                            "verse 52:98": "اور رات کے اوقات ميں بھي اس کي تسبيح کيجئے اور (پچھلي رات بھي) جب ستارے چھپتے ہيںo کرو"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 52:1": "Тур билан қасам.",
                            "verse 52:2": "Сатрланган китоб билан қасам.",
                            "verse 52:3": "Ёйилган терига.",
                            "verse 52:4": "Ва обод уй билан қасам.",
                            "verse 52:5": "Ва кўтарилган билан шифт қасам.",
                            "verse 52:6": "Ва тўлган денгиз билан қасам.",
                            "verse 52:7": "Албатта, Роббинг азоби рўй беражак.",
                            "verse 52:8": "Уни ҳеч бир қайтарувчи йўқдир.",
                            "verse 52:9": "У кунда осмон ларзага келиб чайқалур.",
                            "verse 52:10": "Ва тоғлар сайр этиб юрур.",
                            "verse 52:11": "Бас, ўша кунда ёлғонга чиқарувчиларга вайл бўлсин!",
                            "verse 52:12": "(Ботилга) шўнғиб ўйнайдиганларга! («вайл» сўзи гоҳида «ҳалокат», гоҳида «дўзах» маъносида ишлатилади ва иккаласи ҳам бу оятга мосдир.",
                            "verse 52:13": "У кунда жаҳаннам ўтига (куч билан) итарилурлар.",
                            "verse 52:14": "Мана бу, сизлар ёлғонга чиқарган ўт бўладир!",
                            "verse 52:15": "Бу сеҳрми?! Ёки сизлар кўрмаяпсизларми?!",
                            "verse 52:16": "Киринглар унга! Чидайсизларми, чидамайсизларми - барибир.",
                            "verse 52:17": "Албатта, тақводорлар жаннатлар ва нозу неъматлар ичидадирлар.",
                            "verse 52:18": "Роббилари уларга берган нарсалардан лаззатдадирлар.",
                            "verse 52:19": "Енглар, ичинглар, ош бўлсин.",
                            "verse 52:20": "Улар қатор тизилган сўриларга ёнбошлаган ҳолдалар.",
                            "verse 52:21": "Ўзлари иймон келтириб, зурриётлари уларга иймон билан эргашганларнинг зурриётини уларга қўшдик ва уларнинг амалларидан ҳеч нарсани камайтирмадик.",
                            "verse 52:22": "Ва Биз уларга хоҳлаган мевалари ва гўштларини муҳайё қилиб қўйдик.",
                            "verse 52:23": "Улар унда қадаҳларни бир-бирларига узатурлар.",
                            "verse 52:24": "Ва атрофларида худди садафдаги дурдек ғуломлари айланиб, хизматда юришадир.",
                            "verse 52:25": "Баъзилари бошқаларидан ўгрилиб сўраша бошладилар.",
                            "verse 52:26": "Албатта, биз илгари ўз аҳлимиз даврасида У зотдан қўрқувчилардан эдик.",
                            "verse 52:27": "Бас, Аллоҳ бизга марҳамат қилди ва бизни дўзах азобидан сақлади.",
                            "verse 52:28": "Албатта, биз илгари Унга дуо қилардик.",
                            "verse 52:29": "Бас, эслатгин: сен Роббинг неъмати ила фолбин ҳам эмассан, мажнун ҳам эмассан.",
                            "verse 52:30": "Балки улар:«У шоир, биз унга ўлим етишини кутамиз», дерлар?",
                            "verse 52:31": "Сен: «Кутинглар, албатта, мен ҳам сизлар билан бирга кутувчидирман», деб айт.",
                            "verse 52:32": "Ё ақллари шунга буюрарми ёки улар туғёнга кетган қавмларми?",
                            "verse 52:33": "Балки, у(Қуръон)ни ўзи тўқиди, дерлар? Йўқ, улар иймон келтирмаслар.",
                            "verse 52:34": "Агар уларнинг гапи рост бўлса, у(Қуръон)га ўхшаш сўзни келтирсинлар.",
                            "verse 52:35": "Балки, улар ҳеч нарсадан ҳеч нарса йўқ ўзлари яралгандирлар?! Ёки улар яратувчиларми?",
                            "verse 52:36": "Балки, улар осмонлару ерни яратгандирлар?! Йўқ, улар ишонмаслар.",
                            "verse 52:37": "Балки уларнинг ҳузурида Роббингнинг хазиналари бордир?! Ёки улар бошқарувчиларми?",
                            "verse 52:38": "Балки уларнинг (хабар) эшитадиган нарвонлари бордир?! Ундоқ бўлса, эшитувчилари равшан ҳужжат келтирсинлар.",
                            "verse 52:39": "Ёки У зотга қизлару сизларга ўғилларми?!",
                            "verse 52:40": "Ёки сен улардан ҳақ сўраяпсан-у, улар тўловдан қийналаяптиларми?!",
                            "verse 52:41": "Балки уларнинг ихтиёрида ғайб (илми) бўлиб, улар ёзиб олаётгандирлар?!",
                            "verse 52:42": "Балки ҳийла кўрсатишни хоҳларлар?! Бас, кофирлар ҳийлаларининг жазосини тортурлар.",
                            "verse 52:43": "Балки, уларнинг Аллоҳдан бошқа худолари бордир?! Аллоҳ улар келтираётган ширкдан пок бўлди.",
                            "verse 52:44": "Агар улар бошларига тушаётган парчани кўрсалар ҳам, тўпланган булут, дерлар.",
                            "verse 52:45": "Уларни ҳалокатга учрайдиган кунларига йўлиққунларигача тек қўй.",
                            "verse 52:46": "У кунда ҳийлалари уларга ҳеч қандай фойда бермас ва уларга ёрдам ҳам берилмас.",
                            "verse 52:47": "Ва, албатта, зулм қилганларга ундан ўзга азоб ҳам бор, лекин кўплари билмаслар.",
                            "verse 52:48": "Бас, Роббинг ҳукмига сабр қил.",
                            "verse 52:49": "Ва кечаси ҳам."
                        }
                    }
                }
            }
        }
    }
}