{
    "surah_name": "An-Najm",
    "surah_name_ar": "النجم",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 53:1": "Pasha yllin kur perëndon,",
                            "verse 53:2": "shoku juaj (Muhammedi) as nuk e ka humbë as nuk e ka shmangë rrugën e drejtë!",
                            "verse 53:3": "Ai nuk flet sipas qejfit të vet –",
                            "verse 53:4": "Ajo (që flet ai) është vetëm Shpallja, që i ka ardhur atij,",
                            "verse 53:5": "e mësoi atë një (engjëll) me fuqi të madhe,",
                            "verse 53:6": "me inteligjencë të lartë, e u paraqit (në formën e vet),",
                            "verse 53:7": "duek qenë në sferat e larta (qiellore),",
                            "verse 53:8": "pastaj u afrua, e u lëshua, -",
                            "verse 53:9": "afër (sa) dy harqe ose edhe më afër,",
                            "verse 53:10": "e ia shpalli robit të Tij (Pejgamberit) atë që ia shpalli.",
                            "verse 53:11": "Zemra e tij nuk e përgënjeshtroi atë që e pa,",
                            "verse 53:12": "vallë, a po polemizoni me te për atë që e ka parë?",
                            "verse 53:13": "Ai (Muhammedi), me të vërtetë, e ka parë atë (Xhebrailin) edhe një herë tjetër,",
                            "verse 53:14": "te Sidretul muntehaja,",
                            "verse 53:15": "tek ajo (Sidrea) është xhenneti – strehim,",
                            "verse 53:16": "kur Sidrën e mbuloi ajo që e mbulonte, (një mbulesë e madhe),",
                            "verse 53:17": "shikimi i tij (Muhammedit) nuku shmang, as që e kaloi (kufirin e caktuar).",
                            "verse 53:18": "Ai, me të vërtetë, i pa argumentet më madhështore të Zotit të tij.",
                            "verse 53:19": "A e keni pa Latin dhe Uzzan (si janë)?",
                            "verse 53:20": "Dhe Menatin, të tretin, të mbramin (sipas shkallës)? –",
                            "verse 53:21": "Vallë, a për ju janë djemtë, e për Ate (Perëndinë) vajzat?!",
                            "verse 53:22": "Kjo ndarje është e padrejtë.",
                            "verse 53:23": "Ata (idhujt) janë vetëm emra që ua keni ngjitur ju dhe të parët tuaj, e Perëndia nuk ju ka dërguar për ta – kurrfarë argumenti.",
                            "verse 53:24": "Ose, a për njeriun janë (të gjitha) çka dëshiron,",
                            "verse 53:25": "vetëm Perëndisë i përkasin (të gjitha), ajo dhe kjo botë!",
                            "verse 53:26": "E, sa engjëj ka në qiej – ndërmjetësimi i të cilëve nuk bën dobi asgjë, përveç pasi të japë leje Perëndia, për kë të dojë Ai dhe kush është i denjë për te.",
                            "verse 53:27": "Me të vërtetë, ata që nuk besojnë në jetën tjetër, i emërojnë engjëjt me emra femërorë (i konsiderojnë femra)",
                            "verse 53:28": "e, për këtë, ata nuk kanë kurrfarë dijenie, ndjekin vetëm hamendjen (supozimin), e hamendja nuk sjell dobi asgjë për të vërtetën.",
                            "verse 53:29": "Andaj, ti (o Muhammed) largohu prej atij që i ikën Kur’anit dhe që dëshiron vetëm jetën e kësaj bote, -",
                            "verse 53:30": "kjo është arritja e tyre në dijeni, me të vërtetë, Zoti yt i njeh më së miri ata që janë shmangur nga rruga e Tij, dhe Ai i di më së miri ata që ndjekin rrugën e drejtë.",
                            "verse 53:31": "Perëndisë i përkasin të gjitha (çka ka) në qiej dhe në Tokë – e, sipas asaj që kanë punuar, për t’i dënuar ata që bëjnë keq, e për t’i shpërblyer ata që bëjnë mirë me shpërblim shumë të mirë, të madh,",
                            "verse 53:32": "ata që ruhen prej mëkateve të mëdha dhe veprave të këqia (imorale), pos mëkateve të vogla.",
                            "verse 53:33": "A e ke parë ti atë që është shmangur (nga e vërteta),",
                            "verse 53:34": "pak ka dhënë, e pastaj e pengoi tjetrën,",
                            "verse 53:35": "a i di ai gjërat sekrete, dhe a i sheh ato?",
                            "verse 53:36": "Vallë, a nuk është i lajmëruar ai – për atë që gjendet në fletët e Musait (në Teurat)",
                            "verse 53:37": "dhe të Ibrahimit: - “i cili i plotësoi (obligimet) –",
                            "verse 53:38": "që askush nuk do t’i bartë mëkatet e personit tjetër,",
                            "verse 53:39": "dhe që njeriu do të ketë vetëm atë që është marrë me te (punuar atë)",
                            "verse 53:40": "dhe që përpjekjet e tij do të shihen së shpejti, padyshim",
                            "verse 53:41": "(dhe se) do të shpërblehet me shpërblim të plotë,",
                            "verse 53:42": "dhe, se, te Zoti yt do të jetë kthimi,",
                            "verse 53:43": "Ai jep gazin dhe vajin (gëzimin dhe hidhërimin),",
                            "verse 53:44": "Ai jep vdekjen dhe gjallesën,",
                            "verse 53:45": "Ai krijon çiftet, mashkull e femër,",
                            "verse 53:46": "prej pikës së farës (spermës) kur të hedhet (injektohet),",
                            "verse 53:47": "dhe, me të vërtetë, tek Ai është krijimi i dytë (rindjallja),",
                            "verse 53:48": "dhe Ai jep pasuri dhe kënaqësi të mjaftueshme,",
                            "verse 53:49": "dhe Ai është Zot’i Siriusit,",
                            "verse 53:50": "dhe Ai e ka shkatërruar popullin e lashtë të Adit,",
                            "verse 53:51": "dhe Themudin, dhe s’ka lënë askë prej tyre,",
                            "verse 53:52": "e madje, para tyre – popullin e Nuhut, i cili ka qenë (edhe) më zullumqarë dhe i zhytur edhe më shumë (në të këqia),",
                            "verse 53:53": "dhe Ai i përmbysi vendbanimet (e popullit të Lutit),",
                            "verse 53:54": "dhe i mbuloi ata çka i mbuloi (goditje e madhe),",
                            "verse 53:55": "e, në çfarë dhuntie të Zotit tënd dyshon ti (polemizon)?",
                            "verse 53:56": "Ky paralajmërues (pejgamber) është si ata të mëparshmit.",
                            "verse 53:57": "U afrua ajo që është afër (Dita e Kijametit),",
                            "verse 53:58": "nuk mund ta zbulojë (atë) askush, pos Perëndisë!",
                            "verse 53:59": "E, vallë prej këtyre fjalëve (Kur’anit) po çuditeni,",
                            "verse 53:60": "dhe po qeshni, e nuk po qani? –",
                            "verse 53:61": "e, adje, jeni edhe të pakujdesshëm!",
                            "verse 53:62": "Bëni sexhde për Perëndinë dhe adhuronie (Ate)! pakujdesshëm!"
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Batmaqda olan ulduza (Sürəyya ulduzuna) and olsun ki,",
                            "verse 53:2": "Sizin yoldaşınız (Muhəmməd əleyhissəlam) nə haqq yoldan sapmış, nə də azmışdır!",
                            "verse 53:3": "O, kefi istəyəni (havadan) danışmır.",
                            "verse 53:4": "Bu, ancaq (Allah dərgahından) nazil olan bir vəhydir.",
                            "verse 53:5": "Onu (Muhəmməd əleyhissəlama) çox qüvvətli olan (Cəbrail) öyrətdi.",
                            "verse 53:6": "O qüvvət (ağıl və gözəllik) sahibi (Peyğəmbər əleyhissəlama öz həqiqi şəklində) göründü.",
                            "verse 53:7": "O (Cəbrail) ən uca üfüqdə (günəşin çıxdığı yerdə) idi.",
                            "verse 53:8": "Sonra (Cəbrail Muhəmməd əleyhissəlama) yaxınlaşdı və aşağı endi.",
                            "verse 53:9": "(Onların arasındakı məsafə) iki yay uzunluğunda, bəlkə, ondan da yaxın oldu.",
                            "verse 53:10": "Sonra (Cəbrail Allahın ?z) bəndəsinə (Mühəmmədə) vəhy buyurduğunu vəhy etdi.",
                            "verse 53:11": "Qəlb (Peyğəmbərin qəlbi) gördüyünü yalan saymadı.",
                            "verse 53:12": "Siz onunla gördüyü barəsində mübahisəmi edirsiniz?",
                            "verse 53:13": "And olsun ki, (Muhəmməd əleyhiissəlam Cəbraili öz həqiqi surətində) başqa bir dəfə də (me'rac vaxtı) görmüşdü;",
                            "verse 53:14": "(Yeddinci göydəki) Sidrətül-müntəhanın yanında.",
                            "verse 53:15": "(Mələklər, şəhidlər və müttəqilər məskəni olan) Mə'va cənnəti onun yanındadır.",
                            "verse 53:16": "O zaman Sidrəni nələr bürümüşdü, nələr!",
                            "verse 53:17": "Göz nə (sağa-sola) yayındı, nə də uzağa getdi (hər şeyi olduğu kimi gördü).",
                            "verse 53:18": "And olsun ki, (Peyğəmbər) öz Rəbbininən böyük qüdrət nişanələrindən (mö'cüzələrindən) bir qismini (Beytül-mə'muru, Sidrətül-müntəhanı, Cənnəti, Cəhənnəmi, Rəfrəfi, altı yüz qanadı olan Cəbrailin həqiqi surətini və i.",
                            "verse 53:19": "(Ey müşriklər!) Bir deyin görək (sizin ibadət etdiyiniz) Lat və Uzza nəyə qadirdilər?!",
                            "verse 53:20": "Digər üçüncü (büt) olan Mənat da həmçinin?!",
                            "verse 53:21": "Məgər oğlanlar sizin, (bəyənmədiyiniz) qızlar Onundurmu?! (Allahındırmı)?!",
                            "verse 53:22": "Elə isə bu ədalətsiz bölgüdür!",
                            "verse 53:23": "Onlar (bütlər) sizin atalarınızın (özlərindən uydurub) qoyduqları adlardan başqa heç bir şey deyildir! (Onların yalnız quru adı var, heç bir şeyə qadir deyillər).",
                            "verse 53:24": "Yoxsa insan istədiyi hər şeyə nail ola bilər?! (Xeyr, bu mümkün deyildir.",
                            "verse 53:25": "Axirətdə, dünya da ancaq Allahındır!",
                            "verse 53:26": "Göylərdə neçə-neçə mələklər vardır ki, onların şəfaəti heç bir fayda verməz.",
                            "verse 53:27": "Həqiqətən, axirətə inanmayanlar mələklərə (onların Allahın qızları olduğunu iddia edərək) qadın adları verirlər.",
                            "verse 53:28": "Onlar buna dair heç bir şey bilmir, yalnız zənnə qapılırlar.",
                            "verse 53:29": "Artıq (ya Peyğəmbər!) Bizim Qur'anımızdan üz çevirib dünya həyatından başqa bir şey istəməyənlərdən üz döndər!",
                            "verse 53:30": "Onların bildiyi elə bu qədərdir.",
                            "verse 53:31": "Göylərdə və yerdə nə varsa, (hamısı) Allahındır.",
                            "verse 53:32": "(O yaxşılıq edənlər ki) kiçik günahlar (xətalar) istisna olmaqla, böyük günahlardan və rəzil işlərdən (zinadan) çəkinərlər.",
                            "verse 53:33": "(Ya Peyğəmbər!) İndi gördünmü (imandan) dönəni,",
                            "verse 53:34": "Bir az (pul, mal) verib (qalanına) xəsislik göstərəni?",
                            "verse 53:35": "Məgər o, qeybi bilirmi ki, (öz dostunun əzabına yüklənə biləcəyini) görsün?! (Müşriklərdən Vəlid ibn Müğirə islama meyl göstərmişdi.",
                            "verse 53:36": "Yoxsa ona Musanın səhifələrindən olanlar xəbər verilmədi?!",
                            "verse 53:37": "Və (əhdə) çox vəfalı olan (Allahın qarşısındakı borcunu layiqincə ödəyən) İbrahimin (sühüfündəkilər bildirilmədi?!)",
                            "verse 53:38": "(Tövratda və İbrahimin səhifələrində deyilənlər bunlardır: ) \"Heç bir günahkar başqasının günahına yüklənməz!",
                            "verse 53:39": "İnsana ancaq öz zəhməti (sə'yi, çalışması, əməli) qalar!",
                            "verse 53:40": "Şübhəsiz ki, (qiyamət günü) onun zəhməti (sə'yi, əməli) görünəcəkdir!",
                            "verse 53:41": "Sonra da ona (zəhmətinin, əməlinin) tam əvəzi veriləcəkdir!\"",
                            "verse 53:42": "Həqiqətən, axır dönüş sənin Rəbbinədir!",
                            "verse 53:43": "Güldürən də, ağladan da Odur!",
                            "verse 53:44": "?ldürən də, dirildən də Odur!",
                            "verse 53:45": "(İnsanlardan və heyvanlardan ibarət) iki cifti (hər bir cütü) erkək və dişi olaraq yaradan Odur -",
                            "verse 53:46": "(Bir qərtə) nütfədən (o, ata belindən analığa) axıb tökülərkən.",
                            "verse 53:47": "(?lüləri) yenidən diriltmək də Ona aiddir!",
                            "verse 53:48": "(İstədiyini) dövlətli də edən, kasıb da edən Odur!",
                            "verse 53:49": "Şi'ranın (Şi'ra ulduzunun) da Rəbbi Odur!",
                            "verse 53:50": "Əvvəlki (ilkin) Adı (Ad qövmünü) O məhv etdi.",
                            "verse 53:51": "Səmudu da həmçinin! Və (onlardan heç kəsi sağ) buraxmadı.",
                            "verse 53:52": "Daha əvvəl Nuh qövmünü (məhv etdi), çünki onlar daha zalım, daha azğın kimsələr idi.",
                            "verse 53:53": "(Lut qövmünün yurdu) Mö'təfikənin də altını üstünə O çevirdi (qaldırıb yerə vurdu).",
                            "verse 53:54": "Onları nələr sardı, nələr! (Başlarına nə müsibətlər gəldi!)",
                            "verse 53:55": "(Ey insan!) Sən öz Rəbbinin hansı ne'mətlərinə şəkk edirsən?!",
                            "verse 53:56": "Bu (Muhəmməd əleyhissəlam) da əvvəlki peyğəmbərlər kimi (insanları Allahın əzabı ilə) qorxudan bir peyğəmbərdir!",
                            "verse 53:57": "(Ey insanlar!) Yaxınlaşam (qiyamət) yaxınlaşdı.",
                            "verse 53:58": "Onu Allahdan başqa heç kəs dəf edə bilməz! (Və ya: onun dəqiq vaxtını Allahdan başqa heç kəs bilməz!)",
                            "verse 53:59": "İndi siz bu kəlama (Qur'ana) təəccübmü edirsiniz?",
                            "verse 53:60": "Həm də gülürsünüz, heç ağlamırsınız!",
                            "verse 53:61": "Siz (qəflət içində) oynayır-əylənirsiniz (ona e'tina etmirsiniz).",
                            "verse 53:62": "(Ey insanlar!) Gəlin Allaha səcdə edin, (Allaha) ibadət edin! (Ondan başqasına itaət etməyin!)"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Tako Mi zvijezde kad zalazi,",
                            "verse 53:2": "vaš drug",
                            "verse 53:3": "On ne govori po hiru svome -",
                            "verse 53:4": "to je samo Objava koja mu se obznanjuje,",
                            "verse 53:5": "uči ga Jedan ogromne snage,",
                            "verse 53:6": "razboriti, koji se pojavio u liku svome",
                            "verse 53:7": "na obzorju najvišem,",
                            "verse 53:8": "zatim se približio, pa nadnio -",
                            "verse 53:9": "blizu koliko dva luka ili bliže -",
                            "verse 53:10": "i objavio robu Njegovu ono što je objavio,",
                            "verse 53:11": "srce nije poreklo ono što je vidio,",
                            "verse 53:12": "pa zašto se prepirete s njim o onom što je vidio?",
                            "verse 53:13": "On Ga je i drugi put vidio,",
                            "verse 53:14": "kod Sidretu-l-muntehaa,",
                            "verse 53:15": "kod kojeg je džennetsko prebivalište,",
                            "verse 53:16": "kad je Sidru pokrivalo ono što je pokrivalo -",
                            "verse 53:17": "pogled mu nije skrenuo, nije prekoračio,",
                            "verse 53:18": "vidio je najveličanstvenija znamenja svoga Gospodara.",
                            "verse 53:19": "Šta kažete o Latu i Uzzau",
                            "verse 53:20": "i Menatu, trećoj, najmanje cijenjenoj? -",
                            "verse 53:21": "Zar su za vas sinovi, a za Njega kćeri?!",
                            "verse 53:22": "To bi tada bila podjela nepravedna.",
                            "verse 53:23": "To su samo imena koja ste im vi i preci vaši nadjenuli, Allah o njima nikakav dokaz nije poslao; oni se povode samo za pretpostavkama i onim za čim duše žude, a već im dolazi od Gospodara njihova prava uputa.",
                            "verse 53:24": "Ne može čovjek ostvariti sve što poželi,",
                            "verse 53:25": "Allahu pripada i ovaj i onaj svijet!",
                            "verse 53:26": "A koliko na nebesima ima meleka čije posredovanje nikome neće biti od koristi, sve dok Allah to ne dozvoli onome kome On hoće i u korist onoga kojim je zadovoljan.",
                            "verse 53:27": "Oni koji ne vjeruju u onaj svijet nazivaju meleke imenima ženskim,",
                            "verse 53:28": "a o tome ništa ne znaju, slijede samo pretpostavke, a pretpostavka istini baš nimalo ne koristi.",
                            "verse 53:29": "Zato se ti okani onoga koji Kur’an izbjegava i koji samo život na ovome svijetu želi -",
                            "verse 53:30": "to je vrhunac njihova znanja - Gospodar tvoj dobro zna one koji su skrenuli s Njegova puta i On dobro zna one koji su na pravome putu.",
                            "verse 53:31": "Allahovo je sve što je na nebesima i što je na Zemlji - da bi, prema onome kako su radili, kaznio one koji rade zlo, a najljepšom nagradom nagradio one koji čine dobro,",
                            "verse 53:32": "one koji se klone velikih grijehova i naročito razvrata, a grijehove bezazlene On će oprostiti jer Gospodar tvoj, zaista, mnogo prašta - On dobro zna sve o vama, otkad vas je stvorio od zemlje i otkad ste bili zameci u utrobama majki va#",
                            "verse 53:33": "Reci ti Meni o onome koji istinu izbjegava",
                            "verse 53:34": "i malo udjeljuje, i posve prestane udjeljivati,",
                            "verse 53:35": "zna li on ono što je skriveno, pa vidi?",
                            "verse 53:36": "Zar on nije obaviješten o onome šta se nalazi u listovima Musaovim",
                            "verse 53:37": "i Ibrahimovim - koji je obaveze potpuno ispunjavao -",
                            "verse 53:38": "da nijedan grješnik tuđe grijehe neće nositi,",
                            "verse 53:39": "i da je čovjekovo samo ono što sam uradi,",
                            "verse 53:40": "i da će se trud njegov, sigurno, iskazati,",
                            "verse 53:41": "i da će prema njemu u potpunosti nagrađen ili kažnjen biti,",
                            "verse 53:42": "i da će se Gospodaru tvome ponovo vratiti,",
                            "verse 53:43": "i da On na smijeh i na plač navodi,",
                            "verse 53:44": "i da On usmrćuje i oživljava",
                            "verse 53:45": "i da On par, muško i žensko, stvara",
                            "verse 53:46": "od kapi sjemena kad se izbaci;",
                            "verse 53:47": "i da će ih On ponovo oživiti,",
                            "verse 53:48": "i da On daje bogatstvo i moć da stječu,",
                            "verse 53:49": "i da je On Sirijusa",
                            "verse 53:50": "i da je On drevni narod Ad uništio,",
                            "verse 53:51": "i Semud, i da nikog nije poštedio,",
                            "verse 53:52": "i još prije Nuhov narod, koji je najokrutniji i najobjesniji bio;",
                            "verse 53:53": "i prevrnuta naselja On je prevrnuo,",
                            "verse 53:54": "i snašlo ih je ono što ih je snašlo",
                            "verse 53:55": "pa, u koju blagodat Gospodara svoga ti još sumnjaš?",
                            "verse 53:56": "Ovaj Kur’an je opomena kao i prijašnje opomene:",
                            "verse 53:57": "Smak svijeta se približava,",
                            "verse 53:58": "Allah će ga jedini otkriti!",
                            "verse 53:59": "Pa zar se ovom govoru iščuđavate -",
                            "verse 53:60": "i smijete se, a ne plačete -",
                            "verse 53:61": "gordo dignutih glava?",
                            "verse 53:62": "Bolje padajte licem na tle pred Allahom i klanjajte se! glava?"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "নক্ষত্রের কসম, যখন অস্তমিত হয়।",
                            "verse 53:2": "তোমাদের সংগী পথভ্রষ্ট হননি এবং বিপথগামীও হননি।",
                            "verse 53:3": "এবং প্রবৃত্তির তাড়নায় কথা বলেন না।",
                            "verse 53:4": "কোরআন ওহী, যা প্রত্যাদেশ হয়।",
                            "verse 53:5": "তাঁকে শিক্ষা দান করে এক শক্তিশালী ফেরেশতা,",
                            "verse 53:6": "সহজাত শক্তিসম্পন্ন, সে নিজ আকৃতিতে প্রকাশ পেল।",
                            "verse 53:7": "উর্ধ্ব দিগন্তে,",
                            "verse 53:8": "অতঃপর নিকটবর্তী হল ও ঝুলে গেল।",
                            "verse 53:9": "তখন দুই ধনুকের ব্যবধান ছিল অথবা আরও কম।",
                            "verse 53:10": "তখন আল্লাহ তাঁর দাসের প্রতি যা প্রত্যাদেশ করবার, তা প্রত্যাদেশ করলেন।",
                            "verse 53:11": "রসূলের অন্তর মিথ্যা বলেনি যা সে দেখেছে।",
                            "verse 53:12": "তোমরা কি বিষয়ে বিতর্ক করবে যা সে দেখেছে?",
                            "verse 53:13": "নিশ্চয় সে তাকে আরেকবার দেখেছিল,",
                            "verse 53:14": "সিদরাতুলমুন্তাহার নিকটে,",
                            "verse 53:15": "যার কাছে অবস্থিত বসবাসের জান্নাত।",
                            "verse 53:16": "যখন বৃক্ষটি দ্বারা আচ্ছন্ন হওয়ার, তদ্দ্বারা আচ্ছন্ন ছিল।",
                            "verse 53:17": "তাঁর দৃষ্টিবিভ্রম হয় নি এবং সীমালংঘনও করেনি।",
                            "verse 53:18": "নিশ্চয় সে তার পালনকর্তার মহান নিদর্শনাবলী অবলোকন করেছে।",
                            "verse 53:19": "তোমরা কি ভেবে দেখেছ লাত ও ওযযা সম্পর্কে।",
                            "verse 53:20": "এবং তৃতীয় আরেকটি মানাত সম্পর্কে?",
                            "verse 53:21": "পুত্র-সন্তান কি তোমাদের জন্যে এবং কন্যা-সন্তান আল্লাহর জন্য?",
                            "verse 53:22": "এমতাবস্থায় এটা তো হবে খুবই অসংগত বন্টন।",
                            "verse 53:23": "এগুলো কতগুলো নাম বৈ নয়, যা তোমরা এবং তোমাদের পূর্ব-পুরুষদের রেখেছ। এর সমর্থনে আল্লাহ কোন দলীল নাযিল করেননি। তারা অনুমান এবং প্রবৃত্তিরই অনুসরণ করে। অথচ তাদের কাছে তাদের পালনকর্তার পক্ষ থেকে পথ নির্দেশ এসেছে।",
                            "verse 53:24": "মানুষ যা চায়, তাই কি পায়?",
                            "verse 53:25": "অতএব, পরবর্তী ও পূর্ববর্তী সব মঙ্গলই আল্লাহর হাতে।",
                            "verse 53:26": "আকাশে অনেক ফেরেশতা রয়েছে। তাদের কোন সুপারিশ ফলপ্রসূ হয় না যতক্ষণ আল্লাহ যার জন্যে ইচ্ছা ও যাকে পছন্দ করেন, অনুমতি না দেন।",
                            "verse 53:27": "যারা পরকালে বিশ্বাস করে না, তারাই ফেরেশতাকে নারীবাচক নাম দিয়ে থাকে।",
                            "verse 53:28": "অথচ এ বিষয়ে তাদের কোন জ্ঞান নেই। তারা কেবল অনুমানের উপর চলে। অথচ সত্যের ব্যাপারে অনুমান মোটেই ফলপ্রসূ নয়।",
                            "verse 53:29": "অতএব যে আমার স্মরণে বিমুখ এবং কেবল পার্থিব জীবনই কামনা করে তার তরফ থেকে আপনি মুখ ফিরিয়ে নিন।",
                            "verse 53:30": "তাদের জ্ঞানের পরিধি এ পর্যন্তই। নিশ্চয় আপনার পালনকর্তা ভাল জানেন, কে তাঁর পথ থেকে বিচ্যুত হয়েছে এবং তিনিই ভাল জানেন কে সুপথপ্রাপ্ত হয়েছে।",
                            "verse 53:31": "নভোমন্ডল ও ভূমন্ডলে যা কিছু আছে, সবই আল্লাহর, যাতে তিনি মন্দকর্মীদেরকে তাদের কর্মের প্রতিফল দেন এবং সৎকর্মীদেরকে দেন ভাল ফল।",
                            "verse 53:32": "যারা বড় বড় গোনাহ ও অশ্লীলকার্য থেকে বেঁচে থাকে ছোটখাট অপরাধ করলেও নিশ্চয় আপনার পালনকর্তার ক্ষমা সুদূর বিস্তৃত। তিনি তোমাদের সম্পর্কে ভাল জানেন, যখন তিনি তোমাদেরকে সৃষ্টি করেছেন মৃত্তিকা থেকে এবং যখন তোমরা মাতৃগর্ভে কচি শিশু ছিলে। অতএব তোমরা আত্নপ্রশংসা করো না। তিনি ভাল জানেন কে সংযমী।",
                            "verse 53:33": "আপনি কি তাকে দেখেছেন, যে মুখ ফিরিয়ে নেয়।",
                            "verse 53:34": "এবং দেয় সামান্যই ও পাষাণ হয়ে যায়।",
                            "verse 53:35": "তার কাছে কি অদৃশ্যের জ্ঞান আছে যে, সে দেখে?",
                            "verse 53:36": "তাকে কি জানানো হয়নি যা আছে মূসার কিতাবে,",
                            "verse 53:37": "এবং ইব্রাহীমের কিতাবে, যে তার দায়িত্ব পালন করেছিল?",
                            "verse 53:38": "কিতাবে এই আছে যে, কোন ব্যক্তি কারও গোনাহ নিজে বহন করবে না।",
                            "verse 53:39": "এবং মানুষ তাই পায়, যা সে করে,",
                            "verse 53:40": "তার কর্ম শীঘ্রই দেখা হবে।",
                            "verse 53:41": "অতঃপর তাকে পূর্ণ প্রতিদান দেয়া হবে।",
                            "verse 53:42": "তোমার পালনকর্তার কাছে সবকিছুর সমাপ্তি,",
                            "verse 53:43": "এবং তিনিই হাসান ও কাঁদান",
                            "verse 53:44": "এবং তিনিই মারেন ও বাঁচান,",
                            "verse 53:45": "এবং তিনিই সৃষ্টি করেন যুগল-পুরুষ ও নারী।",
                            "verse 53:46": "একবিন্দু বীর্য থেকে যখন স্খলিত করা হয়।",
                            "verse 53:47": "পুনরুত্থানের দায়িত্ব তাঁরই,",
                            "verse 53:48": "এবং তিনিই ধনবান করেন ও সম্পদ দান করেন।",
                            "verse 53:49": "তিনি শিরা নক্ষত্রের মালিক।",
                            "verse 53:50": "তিনিই প্রথম আদ সম্প্রদায়কে ধ্বংস করেছেন,",
                            "verse 53:51": "এবং সামুদকেও; অতঃপর কাউকে অব্যহতি দেননি।",
                            "verse 53:52": "এবং তাদের পূর্বে নূহের সম্প্রদায়কে, তারা ছিল আরও জালেম ও অবাধ্য।",
                            "verse 53:53": "তিনিই জনপদকে শুন্যে উত্তোলন করে নিক্ষেপ করেছেন।",
                            "verse 53:54": "অতঃপর তাকে আচ্ছন্ন করে নেয় যা আচ্ছন্ন করার।",
                            "verse 53:55": "অতঃপর তুমি তোমার পালনকর্তার কোন অনুগ্রহকে মিথ্যা বলবে?",
                            "verse 53:56": "অতীতের সতর্ককারীদের মধ্যে সে-ও একজন সতর্ককারী।",
                            "verse 53:57": "কেয়ামত নিকটে এসে গেছে।",
                            "verse 53:58": "আল্লাহ ব্যতীত কেউ একে প্রকাশ করতে সক্ষম নয়।",
                            "verse 53:59": "তোমরা কি এই বিষয়ে আশ্চর্যবোধ করছ?",
                            "verse 53:60": "এবং হাসছ-ক্রন্দন করছ না?",
                            "verse 53:61": "তোমরা ক্রীড়া-কৌতুক করছ,",
                            "verse 53:62": "অতএব আল্লাহকে সেজদা কর এবং তাঁর এবাদত কর। [ Sajdah ] করছ,"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 53:1": "Кълна се в звездата, когато залязва,",
                            "verse 53:2": "не се е заблудил вашият спътник",
                            "verse 53:3": "и не се е отклонил,",
                            "verse 53:4": "и не говори той от себе си.",
                            "verse 53:5": "Това е само откровение, което",
                            "verse 53:6": "се разкрива.",
                            "verse 53:7": "Научи го [на него] многосилният ,",
                            "verse 53:8": "който има мощ.",
                            "verse 53:9": "когато бе на най-високия хоризонт,",
                            "verse 53:10": "после се приближи и се спусна,",
                            "verse 53:11": "и бе на разстояние два лъка или по-близо.",
                            "verse 53:12": "Тогава [Аллах посредством Джибрил] разкри на Своя раб ,",
                            "verse 53:13": "каквото разкри.",
                            "verse 53:14": "Сърцето му не го излъга за онова, което видя.",
                            "verse 53:15": "Нима ще го оспорвате за онова, което видя?",
                            "verse 53:16": "И отново го видя при друго спускане",
                            "verse 53:17": "до лотосовото дърво на крайния предел,",
                            "verse 53:18": "където е Градината на обителта.",
                            "verse 53:19": "Когато дървото бе покрито с онова, което го покрива.",
                            "verse 53:20": "И не се отклони погледът [на Мухаммад], и не се откъсна.",
                            "verse 53:21": "Той видя някои от най-големите знамения на своя Господ.",
                            "verse 53:22": "А нима не виждате какво са ал-Лат и ал-Узза,",
                            "verse 53:23": "и също - третото",
                            "verse 53:24": "Манат?",
                            "verse 53:25": "Нима за вас е мъжкото, а пък за Него - женското?",
                            "verse 53:26": "Това тогава е несправедлив дележ.",
                            "verse 53:27": "Те са само имена, които назовахте вие и предците ви.",
                            "verse 53:28": "следват само догадката и онова, което душите обичат, въпреки че при тях дойде напътствието от техния Господ.",
                            "verse 53:29": "Или човек притежава всичко, което пожелае?",
                            "verse 53:30": "На Аллах принадлежи и отвъдното, и настоящето.",
                            "verse 53:31": "И колко ангели има на небесата, чието застъпничество не избавя от нищо, освен след като Аллах позволи комуто пожелае, и благоволи.",
                            "verse 53:32": "Онези, които не вярват в отвъдното, назовават ангелите с женски имена,",
                            "verse 53:33": "без да имат знание за това.",
                            "verse 53:34": "И се отдръпни от онзи, който се отвръща от Нашето напомняне, и пожелава само земния живот!",
                            "verse 53:35": "Толкова са достигнали те от знанието.",
                            "verse 53:36": "На Аллах е всичко на небесата и всичко на земята, за да въздаде на злосторниците за деянията им и за да въздаде на благодетелните с Най-прекрасното -",
                            "verse 53:37": "на онези, които се предпазват от големите грехове и скверностите, освен малките провинения.",
                            "verse 53:38": "Виждаш ли онзи, който се отвръща",
                            "verse 53:39": "и дава малко, и му се свиди?",
                            "verse 53:40": "Нима той има знание за неведомото и го вижда?",
                            "verse 53:41": "Или не бе известен за онова, което е в свитъците на Муса",
                            "verse 53:42": "и Ибрахим, който изпълни",
                            "verse 53:43": "-",
                            "verse 53:44": "че никой прегрешил не ще носи греха на друг",
                            "verse 53:45": "и човек ще има само онова, за което се е постарал,",
                            "verse 53:46": "и старанието му ще бъде видяно,",
                            "verse 53:47": "после напълно ще му се въздаде,",
                            "verse 53:48": "и че при твоя Господ е завършекът,",
                            "verse 53:49": "и Той поражда смеха и плача,",
                            "verse 53:50": "и Той съживява и умъртвява,",
                            "verse 53:51": "и Той създава двойките - мъжко и женско, -",
                            "verse 53:52": "от капка сперма, когато се изхвърля [в утробата],",
                            "verse 53:53": "и от Него е повторното сътворяване,",
                            "verse 53:54": "и Той дарява богатство и удовлетворение,",
                            "verse 53:55": "и Той е Господът на Сириус,",
                            "verse 53:56": "и Той погуби древните адити,",
                            "verse 53:57": "и самудяните, и не остави никого от тях,",
                            "verse 53:58": "и също - народа на Нух преди, те бяха още по-угнетяващи и престъпващи,",
                            "verse 53:59": "и Той опустоши сринатите [селища на Лут],",
                            "verse 53:60": "и ги покри, каквото ги покри.",
                            "verse 53:61": "Тогава в кои благодеяния на твоя Господ се съмняваш [о, човече]?",
                            "verse 53:62": "И този",
                            "verse 53:63": "е предупредител, подобен на първите предупредители.",
                            "verse 53:64": "Близкият Час наближава.",
                            "verse 53:65": "Никой освен Аллах не ще го разкрие.",
                            "verse 53:66": "Нима на тази вест се чудите",
                            "verse 53:67": "и се смеете, а не плачете,",
                            "verse 53:68": "и нехайно се забавлявате?",
                            "verse 53:69": "Сведете чела до земята в суджуд пред Аллах и на Него служете! забавлявате?"
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "以沒落時的星宿盟誓，",
                            "verse 53:2": "你們的朋友，既不迷誤，又未迷信，",
                            "verse 53:3": "也未隨私欲而言。",
                            "verse 53:4": "這只是他所受的啟示，",
                            "verse 53:5": "教授他的，是那強健的、",
                            "verse 53:6": "有力的，故他達到全美。",
                            "verse 53:7": "他在東方的最高處，",
                            "verse 53:8": "然後他漸漸接近而降低，",
                            "verse 53:9": "他相距兩張弓的長度，或更近一些。",
                            "verse 53:10": "他把他所應啟示的啟示他的僕人，",
                            "verse 53:11": "他的心沒有否認他所見的。",
                            "verse 53:12": "道你們要為他所見的而與他爭論嗎？",
                            "verse 53:13": "他確已見他二次下降，",
                            "verse 53:14": "在極境的酸棗樹旁，",
                            "verse 53:15": "那裡有歸宿的樂園。",
                            "verse 53:16": "當酸棗樹蒙上一層東西的時候，",
                            "verse 53:17": "眼未邪視，也未過分；",
                            "verse 53:18": "他確已看見他的主的一部分最大的跡象。",
                            "verse 53:19": "他們告訴我吧！拉特和歐薩，",
                            "verse 53:20": "以及排行第三，也是最次的默那，怎麼是真主的女兒呢？",
                            "verse 53:21": "難道男孩歸你們，女孩卻歸真主嗎？",
                            "verse 53:22": "然而，這是不公平的分配。",
                            "verse 53:23": "這些偶像只是你們和你們的祖先所定的名稱，真主並未加以証實，他們只是憑猜想和私欲。正道確已從他們的主降臨他們。",
                            "verse 53:24": "難道人希望什麼就有什麼？",
                            "verse 53:25": "後世和今世，都是真主的。",
                            "verse 53:26": "天上的許多天神，他們的說情，毫無裨益，除非在真主許可他們為他所意欲和所喜悅者說情之後，",
                            "verse 53:27": "不信後世的人們，的確以女性的名稱稱呼天神們。",
                            "verse 53:28": "他們對於那種稱呼，絕無任何知識，他們只憑猜想；而猜想對於真理，確是毫無裨益的。",
                            "verse 53:29": "你應當避開那違背我的教誨，且只欲享今世生活者；",
                            "verse 53:30": "那是他們的知識程度。你的主，確是全知背離正道者的，也是全知遵循正道者的。",
                            "verse 53:31": "天地萬物，都是真主的。他創造萬物，以便他依作惡者的行為而報酬他們，並以至善的品級報酬行善者。",
                            "verse 53:32": "遠離大罪和醜事，但犯小罪者，你的主確是寬宥的。當他從大地創造你們的時候，當你們是在母腹中的胎兒的時候，他是全知你們的；所以你們不要自稱清白，他是全知敬畏者的。",
                            "verse 53:33": "你告訴我吧！違背正道，",
                            "verse 53:34": "稍稍施捨就慳吝的人，",
                            "verse 53:35": "難道他知道幽玄，故認自己的行為為真理嗎？",
                            "verse 53:36": "難道沒有人告訴過他穆薩的經典，",
                            "verse 53:37": "和履行誡命的易卜拉欣的經典中所記載的事情嗎？",
                            "verse 53:38": "一個負罪者，不負別人的罪。",
                            "verse 53:39": "各人只得享受自己的勞績；",
                            "verse 53:40": "他的勞績，將被看見，",
                            "verse 53:41": "然後他將受最完全的報酬。",
                            "verse 53:42": "你的主，是眾生的歸宿。",
                            "verse 53:43": "他能使人笑，能使人哭；",
                            "verse 53:44": "他能使人死，能使人生；",
                            "verse 53:45": "他曾創造配偶──男性的與女性的──",
                            "verse 53:46": "是以射出的精液；",
                            "verse 53:47": "他以再造為自己的責任；",
                            "verse 53:48": "他能使人富足，能使人滿意；",
                            "verse 53:49": "他是天狼星的主。",
                            "verse 53:50": "他毀滅了古時的阿德人，",
                            "verse 53:51": "和賽莫德人，而未曾有所遺留；",
                            "verse 53:52": "以前，他毀滅了努哈的宗族。他們確是更不義的，確是更放蕩的。",
                            "verse 53:53": "他使那被顛覆的城市覆亡，",
                            "verse 53:54": "故覆蓋的東西曾覆蓋了那城市。",
                            "verse 53:55": "你懷疑你的主的哪一件恩典呢？",
                            "verse 53:56": "這是古時的那些警告者之中的一個警告者。",
                            "verse 53:57": "臨近的事件，已經臨近了；",
                            "verse 53:58": "除真主外，沒有能揭示它的。",
                            "verse 53:59": "難道你們為這訓辭而詫異嗎？",
                            "verse 53:60": "你們怎麼嘲笑而不痛哭呢？",
                            "verse 53:61": "你們是疏忽的。",
                            "verse 53:62": "你們應當為真主而叩頭，應當崇拜他。 你們是疏忽的。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Při hvězdě padající!",
                            "verse 53:2": "Váš druh nebloudí, ani nebyl sveden,",
                            "verse 53:3": "ani nehovoří z vlastního popudu svého.",
                            "verse 53:4": "Je to vnuknutí pouze, jež bylo mu vnuknuto,",
                            "verse 53:5": "jemuž naučil jej silný mocí,",
                            "verse 53:6": "silou vládnoucí; a vzpřímeně se tyčil,",
                            "verse 53:7": "zatímco na nejvyšším obzoru byl.",
                            "verse 53:8": "Potom se přiblížil a dolů se spustil,",
                            "verse 53:9": "až na vzdálenost dvou luků či ještě blíže byl,",
                            "verse 53:10": "a vnukl svému služebníkovi to, co mu vnukl.",
                            "verse 53:11": "A srdce jeho mu v tom, co viděl, nelhalo.",
                            "verse 53:12": "Chcete snad pochybnost vyslovit o tom, co zřel?",
                            "verse 53:13": "A věru jej viděl již u příležitosti sestoupení jiného",
                            "verse 53:14": "poblíže lotosového stromu u okraje nejzazšího,",
                            "verse 53:15": "u něhož je zahrada příbytku věčného.",
                            "verse 53:16": "A když přikrylo lotosový strom to, co jej krylo,",
                            "verse 53:17": "oko se neodvrátilo ani nebloudilo,",
                            "verse 53:18": "a věru spatřil on největší ze znamení Pána svého!",
                            "verse 53:19": "Uvažovali jste o al-Lát a al-´Uzzá",
                            "verse 53:20": "a Manát, té třetí, jiné?",
                            "verse 53:21": "Vy syny byste měli mít a On pouze dcery?",
                            "verse 53:22": "To vskutku rozdělení by bylo nerovné!",
                            "verse 53:23": "Ony nejsou nic než jména, kterými jste je vy a vaši otcové nazvali a o nichž neseslal Bůh žádné zplnomocnění.",
                            "verse 53:24": "Což člověk má mít vše, po čem touží?",
                            "verse 53:25": "Však Bohu poslední i první život patří.",
                            "verse 53:26": "A vůbec nic nepomůže přímluva andělů, ať sebevíc jich je na nebi, leda tehdy, když k tomu Bůh svolí, a pro toho, koho chtít bude a jehož si oblíbí.",
                            "verse 53:27": "A vskutku ti, kdož nevěří v život budoucí, anděly ženskými jmény nazývají,",
                            "verse 53:28": "byť o tom žádné vědění nemají a jen dohady své následují.",
                            "verse 53:29": "Odvrať se tedy od těch, kdo zády k Našemu připomenutí se obracejí a pouze k tomuto pozemskému životu tíhnou.",
                            "verse 53:30": "Takový je rozsah jejich vědění! A Pán tvůj ví dobře o tom, kdo z cesty Jeho zbloudil, a zná nejlépe i toho, kdo po ní kráčí.",
                            "verse 53:31": "Bohu náleží vše na nebesích a na zemi, aby mohl odměnit ty, kdož špatné páchali, a aby odměnil ty, kdož dobré konali, odměnou nejkrásnější,",
                            "verse 53:32": "ty, kdož těžkých hříchů a nepravostí se varovali a jen drobných prohřešků se dopouštěli.",
                            "verse 53:33": "Co soudíš o tom, jenž zády se obrací",
                            "verse 53:34": "a málo jen rozdává a lakotí?",
                            "verse 53:35": "Má snad vědomost o nepoznatelném, takže je vidí?",
                            "verse 53:36": "Či nebylo mu sděleno, co obsahují svitky Mojžíše",
                            "verse 53:37": "a Abrahama, jenž byl věrný?",
                            "verse 53:38": "Že totiž žádná duše obtížená břímě jiné duše neponese,",
                            "verse 53:39": "že člověku se jen toho, oč usiloval, dostane,",
                            "verse 53:40": "že výsledek jeho úsilí bude viděn",
                            "verse 53:41": "a potom plnou odměnou bude odměněn,",
                            "verse 53:42": "že u Pána tvého je konečný cíl jen,",
                            "verse 53:43": "že On rozesmává i rozplakává,",
                            "verse 53:44": "že On smrt i život dává,",
                            "verse 53:45": "že On stvořil pohlaví mužské a ženské",
                            "verse 53:46": "z kapky semene vystříknuté,",
                            "verse 53:47": "že Jemu přísluší stvoření druhé,",
                            "verse 53:48": "že On obohacuje a uspokojuje,",
                            "verse 53:49": "že On je ten, kdo Siria pánem je,",
                            "verse 53:50": "že On dávným ´Ádovcům zahynout dal",
                            "verse 53:51": "i Thamúdovcům, a žádného nenechal,",
                            "verse 53:52": "a před nimi lidu Noemovu, neb to lid velmi nespravedlivý a vzpurný byl,",
                            "verse 53:53": "a také Vyvrácené město zahubil,",
                            "verse 53:54": "a pokrylo je to, co je pokrylo.",
                            "verse 53:55": "A které z dobrodiní Pána svého chceš popírat?",
                            "verse 53:56": "A toto je varování podobné varováním dřívějších.",
                            "verse 53:57": "Přiblížila se blížící",
                            "verse 53:58": "a není kromě Boha nikoho, kdo by ji vyjevil.",
                            "verse 53:59": "Tento příběh vás snad údivem naplnil,",
                            "verse 53:60": "že místo abyste plakali, se smějete",
                            "verse 53:61": "a jen v zábavách dlíte?",
                            "verse 53:62": "Před Bohem na zem padejte a Jeho uctívejte! dlíte?"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Bij de ster wanneer zij valt,",
                            "verse 53:2": "Uw metgezel is noch afgedwaald noch afgeweken,",
                            "verse 53:3": "Noch spreekt hij naar eigen begeerte.",
                            "verse 53:4": "Het is slechts de Openbaring die wordt nedergezonden.",
                            "verse 53:5": "Hij, die grote macht heeft, onderwees hem,",
                            "verse 53:6": "Die kracht bezit.",
                            "verse 53:7": "En hij staat aan de hoogste horizon.",
                            "verse 53:8": "Hij naderde en kwam steeds nader.",
                            "verse 53:9": "En werd als de spanning van twee bogen, Ja, nog dichter bij,",
                            "verse 53:10": "En Hij (God) openbaarde aan Zijn dienaar hetgeen Hij wilde openbaren.",
                            "verse 53:11": "Het hart loog niet over wat het zag.",
                            "verse 53:12": "Wilt gij dan met hem redetwisten over hetgeen hij heeft gezien?",
                            "verse 53:13": "En voorzeker, hij zag hem ook bij een andere nederdaling.",
                            "verse 53:14": "Bij de Lotusboom waar niemand voorbij mag gaan,",
                            "verse 53:15": "Waarnaast de Tuin van Verblijf is.",
                            "verse 53:16": "Toen het goddelijke Licht de Lotusboom overstraalde",
                            "verse 53:17": "Wendde zijn oog zich niet af, noch ging het de grens te buiten.",
                            "verse 53:18": "Voorwaar, hij zag de grote tekenen van zijn Heer.",
                            "verse 53:19": "Ziet, de Laat en de Ozza,",
                            "verse 53:20": "En een ander, de derde, Manaat?",
                            "verse 53:21": "\"Zijn voor u de mannelijke wezens en voor Hem de vrouwelijke?\"",
                            "verse 53:22": "Dat is dan een onrechtvaardige verdeling;",
                            "verse 53:23": "Dit zijn slechts namen die gij uitgedacht hebt - gij en uw vaderen - waarvoor God geen gezag heeft nedergezonden.",
                            "verse 53:24": "Krijgt de mens alles waarnaar hij verlangt?",
                            "verse 53:25": "Neen, aan God behoren het Hiernamaals en deze wereld.",
                            "verse 53:26": "En hoevele engelen zijn er niet in de hemelen wier voorspraak van geen nut zal zijn, behalve nadat God verlof heeft gegeven aan wie Hij wil en wie Hem behaagt.",
                            "verse 53:27": "Zij, die niet in het Hiernamaals geloven geven de engelen vrouwelijke namen,",
                            "verse 53:28": "Maar zij hebben daar geen kennis van.",
                            "verse 53:29": "Wend u daarom van hem af die zich van de gedachtenis aan Ons afwendt, en die niets wenst dan het leven dezer wereld.",
                            "verse 53:30": "Zo ver reikt hun kennis.",
                            "verse 53:31": "En aan God behoort hetgeen in de hemelen en hetgeen op aarde is, opdat Hij degenen die slecht deden moge vergelden voor hetgeen zij hebben gewrocht en opdat Hji degenen die goed doen, met het beste moge belonen.",
                            "verse 53:32": "Zij, die behalve kleine feilen, de ergste zonden en slechtheden vermijden - voorwaar, uw Heer is de Heer der Alomvattende Vergiffenis.",
                            "verse 53:33": "Ziet gij hem die zich afwendt (van het rechte pad)",
                            "verse 53:34": "En die weinig geeft en vrekkig is?",
                            "verse 53:35": "Bezit hij de kennis van het onzichtbare, zodat hij kan zien?",
                            "verse 53:36": "Is hem niet verteld over hetgeen in de geschriften van Mozes staat,",
                            "verse 53:37": "En van Abraham, die de geboden hield?",
                            "verse 53:38": "Dat geen drager van last de last van een ander zal dragen;",
                            "verse 53:39": "En dat de mens niet meer kan krijgen dan hetgeen waarnaar hij streeft.",
                            "verse 53:40": "En dat zijn streven spoedig zal worden opgemerkt;",
                            "verse 53:41": "Dan zal hij er volledig voor worden beloond.",
                            "verse 53:42": "En dat alles uiteindelijk tot uw Heer komt,",
                            "verse 53:43": "En dat Hij het is, Die doet lachen en wenen",
                            "verse 53:44": "En dat Hij het is, Die de dood veroorzaakt en het leven geeft.",
                            "verse 53:45": "En dat Hij de twee echtgenoten schept, de vrouwelijke en de mannelijke",
                            "verse 53:46": "Uit een levenskiem wanneer deze uitgegoten wordt:",
                            "verse 53:47": "En dat de volgende opwekking (tot leven) op Hem rust:",
                            "verse 53:48": "En dat Hij het is Die voldoening en rijkdom geeft",
                            "verse 53:49": "En dat Hij de Heer van Sirius is.",
                            "verse 53:50": "En dat Hij de oude (stam van Aad) vernietigde",
                            "verse 53:51": "En Samoed, en Hij spaarde (hen) niet,",
                            "verse 53:52": "Evenals het volk van Noach vóórdien; waarlijk zij waren uiterst onrechtvaardig en opstandig",
                            "verse 53:53": "En Hij bracht de verwoeste steden ten val,",
                            "verse 53:54": "Zodat hetgeen bedekken kon, hen bedekte.",
                            "verse 53:55": "Over welke gaven van uw Heer wilt gij dan redetwisten?",
                            "verse 53:56": "Deze waarschuwer is gelijk aan de vroegere waarschuwers.",
                            "verse 53:57": "Het Uur nadert,",
                            "verse 53:58": "Niemand behalve God kan het ontsluieren.",
                            "verse 53:59": "Verwondert gij u dan over deze aankondiging?",
                            "verse 53:60": "En lacht gij in plaats van te wenen,",
                            "verse 53:61": "Terwijl gij achteloos zijt?",
                            "verse 53:62": "Werpt u voor God neder en aanbidt (Hem)."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 53:1": "By the Star when it setteth,",
                            "verse 53:2": "Your comrade erreth not, nor is deceived;",
                            "verse 53:3": "Nor doth he speak of (his own) desire.",
                            "verse 53:4": "It is naught save an inspiration that is inspired,",
                            "verse 53:5": "Which one of mighty powers hath taught him,",
                            "verse 53:6": "One vigorous; and he grew clear to view",
                            "verse 53:7": "When he was on the uppermost horizon.",
                            "verse 53:8": "Then he drew nigh and came down",
                            "verse 53:9": "Till he was (distant) two bows’ length or even nearer,",
                            "verse 53:10": "And He revealed unto His slave that which He revealed.",
                            "verse 53:11": "The heart lied not (in seeing) what it saw.",
                            "verse 53:12": "Will ye then dispute with him concerning what he seeth ?",
                            "verse 53:13": "And verily he saw him yet another time",
                            "verse 53:14": "By the lote-tree of the utmost boundary,",
                            "verse 53:15": "Nigh unto which is the Garden of Abode.",
                            "verse 53:16": "When that which shroudeth did enshroud the lote-tree,",
                            "verse 53:17": "The eye turned not aside nor yet was overbold.",
                            "verse 53:18": "Verily he saw one of the greater revelations of his Lord.",
                            "verse 53:19": "Have ye thought upon Al-Lat and Al-’Uzza",
                            "verse 53:20": "And Manat, the third, the other ?",
                            "verse 53:21": "Are yours the males and His the females ?",
                            "verse 53:22": "That indeed were an unfair division!",
                            "verse 53:23": "They are but names which ye have named, ye and your fathers, for which Allah hath revealed no warrant.",
                            "verse 53:24": "Or shall man have what he coveteth ?",
                            "verse 53:25": "But unto Allah belongeth the after (life), and the former.",
                            "verse 53:26": "And how many angels are in the heavens whose intercession availeth naught save after Allah giveth leave to whom He chooseth and accepteth.",
                            "verse 53:27": "Lo! it is those who disbelieve in the Hereafter who name the angels with the names of females.",
                            "verse 53:28": "And they have no knowledge thereof.",
                            "verse 53:29": "Then withdraw (O Muhammad) from him who fleeth from Our remembrance and desireth but the life of the world.",
                            "verse 53:30": "Such is their sum of knowledge.",
                            "verse 53:31": "And unto Allah belongeth whatsoever is in the heavens and whatsoever is in the earth, that He may reward those who do evil with that which they have done, and reward those who do good with goodness.",
                            "verse 53:32": "Those who avoid enormities of sin and abominations, save the unwilled offences - (for them) lo! thy Lord is of vast mercy.",
                            "verse 53:33": "Didst thou (O Muhammad) observe him who turned away,",
                            "verse 53:34": "And gave a little, then was grudging ?",
                            "verse 53:35": "Hath he knowledge of the Unseen so that he seeth ?",
                            "verse 53:36": "Or hath he not had news of what is in the books of Moses",
                            "verse 53:37": "And Abraham who paid his debt:",
                            "verse 53:38": "That no laden one shall bear another’s load,",
                            "verse 53:39": "And that man hath only that for which he maketh effort,",
                            "verse 53:40": "And that his effort will be seen.",
                            "verse 53:41": "And afterward he will be repaid for it with fullest payment;",
                            "verse 53:42": "And that thy Lord, He is the goal;",
                            "verse 53:43": "And that He it is who maketh laugh, and maketh weep,",
                            "verse 53:44": "And that He it is Who giveth death and giveth life;",
                            "verse 53:45": "And that He createth the two spouses, the male and the female,",
                            "verse 53:46": "From a drop (of seed) when it is poured forth;",
                            "verse 53:47": "And that He hath ordained the second bringing forth;",
                            "verse 53:48": "And that He it is Who enricheth and contenteth;",
                            "verse 53:49": "And that He it is Who is the Lord of Sirius;",
                            "verse 53:50": "And that He destroyed the former (tribe of) A’ad,",
                            "verse 53:51": "And (the tribe of) Thamud He spared not;",
                            "verse 53:52": "And the folk of Noah aforetime, Lo! they were more unjust and more rebellious;",
                            "verse 53:53": "And Al-Mu’tafikah He destroyed",
                            "verse 53:54": "So that there covered them that which did cover.",
                            "verse 53:55": "Concerning which then, of the bounties of thy Lord, canst thou dispute ?",
                            "verse 53:56": "This is a warner of the warners of old.",
                            "verse 53:57": "The threatened Hour is nigh.",
                            "verse 53:58": "None beside Allah can disclose it.",
                            "verse 53:59": "Marvel ye then at this statement,",
                            "verse 53:60": "And laugh and not weep,",
                            "verse 53:61": "While ye amuse yourselves ?",
                            "verse 53:62": "Rather prostrate yourselves before Allah and serve Him."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 53:1": "By the Star when it goes down,-",
                            "verse 53:2": "Your Companion is neither astray nor being misled.",
                            "verse 53:3": "Nor does he say (aught) of (his own) Desire.",
                            "verse 53:4": "It is no less than inspiration sent down to him:",
                            "verse 53:5": "He was taught by one Mighty in Power,",
                            "verse 53:6": "Endued with Wisdom: for he appeared (in stately form);",
                            "verse 53:7": "While he was in the highest part of the horizon:",
                            "verse 53:8": "Then he approached and came closer,",
                            "verse 53:9": "And was at a distance of but two bow-lengths or (even) nearer;",
                            "verse 53:10": "So did (God) convey the inspiration to His Servant- (conveyed) what He (meant) to convey.",
                            "verse 53:11": "The (Prophet’s) (mind and) heart in no way falsified that which he saw.",
                            "verse 53:12": "Will ye then dispute with him concerning what he saw?",
                            "verse 53:13": "For indeed he saw him at a second descent,",
                            "verse 53:14": "Near the Lote-tree beyond which none may pass:",
                            "verse 53:15": "Near it is the Garden of Abode.",
                            "verse 53:16": "Behold, the Lote-tree was shrouded (in mystery unspeakable!)",
                            "verse 53:17": "(His) sight never swerved, nor did it go wrong!",
                            "verse 53:18": "For truly did he see, of the Signs of his Lord, the Greatest!",
                            "verse 53:19": "Have ye seen Lat.",
                            "verse 53:20": "And another, the third (goddess), Manat?",
                            "verse 53:21": "What! for you the male sex, and for Him, the female?",
                            "verse 53:22": "Behold, such would be indeed a division most unfair!",
                            "verse 53:23": "These are nothing but names which ye have devised,- ye and your fathers,- for which God has sent down no authority (whatever).",
                            "verse 53:24": "Nay, shall man have (just) anything he hankers after?",
                            "verse 53:25": "But it is to God that the End and the Beginning (of all things) belong.",
                            "verse 53:26": "How many-so-ever be the angels in the heavens, their intercession will avail nothing except after God has given leave for whom He pleases and that he is acceptable to Him.",
                            "verse 53:27": "Those who believe not in the Hereafter, name the angels with female names.",
                            "verse 53:28": "But they have no knowledge therein.",
                            "verse 53:29": "Therefore shun those who turn away from Our Message and desire nothing but the life of this world.",
                            "verse 53:30": "That is as far as knowledge will reach them.",
                            "verse 53:31": "Yea, to God belongs all that is in the heavens and on earth: so that He rewards those who do evil, according to their deeds, and He rewards those who do good, with what is best.",
                            "verse 53:32": "Those who avoid great sins and shameful deeds, only (falling into) small faults,- verily thy Lord is ample in forgiveness.",
                            "verse 53:33": "Seest thou one who turns back,",
                            "verse 53:34": "Gives a little, then hardens (his heart)?",
                            "verse 53:35": "What! Has he knowledge of the Unseen so that he can see?",
                            "verse 53:36": "Nay, is he not acquainted with what is in the Books of Moses-",
                            "verse 53:37": "And of Abraham who fulfilled his engagements?-",
                            "verse 53:38": "Namely, that no bearer of burdens can bear the burden of another;",
                            "verse 53:39": "That man can have nothing but what he strives for;",
                            "verse 53:40": "That (the fruit of) his striving will soon come in sight:",
                            "verse 53:41": "Then will he be rewarded with a reward complete;",
                            "verse 53:42": "That to thy Lord is the final Goal;",
                            "verse 53:43": "That it is He Who granteth Laughter and Tears;",
                            "verse 53:44": "That it is He Who granteth Death and Life;",
                            "verse 53:45": "That He did create in pairs,- male and female,",
                            "verse 53:46": "From a seed when lodged (in its place);",
                            "verse 53:47": "That He hath promised a Second Creation (Raising of the Dead);",
                            "verse 53:48": "That it is He Who giveth wealth and satisfaction;",
                            "verse 53:49": "That He is the Lord of Sirius (the Mighty Star);",
                            "verse 53:50": "And that it is He Who destroyed the (powerful) ancient ’Ad (people),",
                            "verse 53:51": "And the Thamud nor gave them a lease of perpetual life.",
                            "verse 53:52": "And before them, the people of Noah, for that they were (all) most unjust and most insolent transgressors,",
                            "verse 53:53": "And He destroyed the Overthrown Cities (of Sodom and Gomorrah).",
                            "verse 53:54": "So that (ruins unknown) have covered them up.",
                            "verse 53:55": "Then which of the gifts of thy Lord, (O man,) wilt thou dispute about?",
                            "verse 53:56": "This is a Warner, of the (series of) Warners of old!",
                            "verse 53:57": "The (Judgment) ever approaching draws nigh:",
                            "verse 53:58": "No (soul) but God can lay it bare.",
                            "verse 53:59": "Do ye then wonder at this recital?",
                            "verse 53:60": "And will ye laugh and not weep,-",
                            "verse 53:61": "Wasting your time in vanities?",
                            "verse 53:62": "But fall ye down in prostration to God, and adore (Him)!"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 53:1": "By the Star when it plunges,",
                            "verse 53:2": "your comrade is not astray, neither errs,",
                            "verse 53:3": "nor speaks he out of caprice.",
                            "verse 53:4": "This is naught but a revelation revealed,",
                            "verse 53:5": "taught him by one terrible in power,",
                            "verse 53:6": "very strong; he stood poised,",
                            "verse 53:7": "being on the higher horizon,",
                            "verse 53:8": "then drew near and suspended hung,",
                            "verse 53:9": "two bows’ length away, or nearer,",
                            "verse 53:10": "then revealed to his servant that he revealed.",
                            "verse 53:11": "His heart lies not of what he saw;",
                            "verse 53:12": "what, will you dispute with him what he sees?",
                            "verse 53:13": "Indeed, he saw him another time",
                            "verse 53:14": "by the Lote-Tree of the Boundary",
                            "verse 53:15": "nigh which is the Garden of the Refuge,",
                            "verse 53:16": "when there covered the Lote-Tree that which covered;",
                            "verse 53:17": "his eye swerved not; nor swept astray.",
                            "verse 53:18": "Indeed, he saw one of the greatest signs of his Lord.",
                            "verse 53:19": "Have you considered El-Lat and El-’Uzza",
                            "verse 53:20": "and Manat the third, the other?",
                            "verse 53:21": "What, have you males, and He females?",
                            "verse 53:22": "That were indeed an unjust division.",
                            "verse 53:23": "They are naught but names yourselves have named, and your fathers; God has sent down no authority touching them.",
                            "verse 53:24": "Or shall man have whatever he fancies?",
                            "verse 53:25": "And to God belongs the First and the Last.",
                            "verse 53:26": "How many an angel there is in the heavens whose intercession avails not anything, save after that God gives leave to whomsoever He wills and is well-pleased.",
                            "verse 53:27": "Those who do not believe in the world to come name the angels with the names of females.",
                            "verse 53:28": "They have not any knowledge thereof; they follow only surmise, and surmise avails naught against truth.",
                            "verse 53:29": "So turn thou from him who turns away from Our Remembrance, and desires only the present life.",
                            "verse 53:30": "That is their attainment of knowledge.",
                            "verse 53:31": "To God belongs whatsoever is in the heavens and whatsoever is in the earth, that He may recompense those who do evil for what they have done, and recompense those who have done good with the reward most fair.",
                            "verse 53:32": "Those who avoid the heinous sins and indecencies, save lesser offences surely thy Lord is wide in His forgiveness.",
                            "verse 53:33": "Hast thou considered him who turns his back",
                            "verse 53:34": "and gives a little, and then grudgingly?",
                            "verse 53:35": "Does he possess the knowledge of the Unseen, and therefore he sees?",
                            "verse 53:36": "Or has he not been told of what is in the scrolls of Moses,",
                            "verse 53:37": "and Abraham, he who paid his debt in full?",
                            "verse 53:38": "That no soul laden bears the load of another,",
                            "verse 53:39": "and that a man shall have to his account only as he has laboured,",
                            "verse 53:40": "and that his labouring shall surely be seen,",
                            "verse 53:41": "then he shall be recompensed for it with the fullest recompense,",
                            "verse 53:42": "and that the final end is unto thy Lord,",
                            "verse 53:43": "and that it is He who makes to laugh, and that makes to weep,",
                            "verse 53:44": "and that it is He who makes to die, and that makes to live,",
                            "verse 53:45": "and that He Himself created the two kinds, male and female,",
                            "verse 53:46": "of a sperm-drop, when it was cast forth,",
                            "verse 53:47": "and that upon Him rests the second growth,",
                            "verse 53:48": "and that it is He who gives wealth and riches,",
                            "verse 53:49": "and that it is He who is the Lord of Sirius,",
                            "verse 53:50": "and that He destroyed Ad, the ancient,",
                            "verse 53:51": "and Thamood, and He did not spare them,",
                            "verse 53:52": "and the people of Noah before -- certainly they did exceeding evil, and were insolent",
                            "verse 53:53": "and the Subverted City He also overthrew,",
                            "verse 53:54": "so that there covered it that which covered.",
                            "verse 53:55": "Then which of thy Lord’s bounties disputest thou?",
                            "verse 53:56": "This is a warner, of the warners of old.",
                            "verse 53:57": "The Imminent is imminent;",
                            "verse 53:58": "apart from God none can disclose it.",
                            "verse 53:59": "Do you then marvel at this discourse,",
                            "verse 53:60": "and do you laugh, and do you not weep,",
                            "verse 53:61": "while you make merry?",
                            "verse 53:62": "So bow yourselves before God, and serve Him! merry?"
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 53:1": "CONSIDER this unfolding [of God’s message], as it comes down from on high!",
                            "verse 53:2": "This fellow-man of yours has not gone astray, nor is he deluded,",
                            "verse 53:3": "and neither does he speak out of his own desire:",
                            "verse 53:4": "that [which he conveys to you] is but [a divine] inspiration with which he is being inspired –",
                            "verse 53:5": "something that a very mighty one has imparted to him:",
                            "verse 53:6": "[an angel] endowed with surpassing power, who in time manifested himself in his true shape and nature,",
                            "verse 53:7": "appearing in the horizon’s loftiest part,",
                            "verse 53:8": "and then drew near, and came close,",
                            "verse 53:9": "until he was but two bow-lengths away, or even nearer.",
                            "verse 53:10": "And thus did",
                            "verse 53:11": "reveal unto His servant whatever He deemed right to reveal.",
                            "verse 53:12": "The",
                            "verse 53:13": "heart did not give the lie to what he saw:",
                            "verse 53:14": "will you, then, contend with him as to what he saw?",
                            "verse 53:15": "And, indeed, he saw it descend a second time",
                            "verse 53:16": "by the lote-tree of the farthest limit,",
                            "verse 53:17": "near unto the garden of promise,",
                            "verse 53:18": "with the lote-tree veiled in a veil of nameless splendour.",
                            "verse 53:19": "[And withal,] the eye did not waver, nor yet did it stray:",
                            "verse 53:20": "truly did he see some of the most profound of his Sustainer’s symbols.",
                            "verse 53:21": "HAVE YOU, then, ever considered [what you are worshipping in] Al-Lāt and Al-’Uzzā,",
                            "verse 53:22": "as well as",
                            "verse 53:23": "Manāt, the third and last [of this triad]?",
                            "verse 53:24": "Why – for yourselves [you would choose only] male offspring, whereas to Him [you assign] female:",
                            "verse 53:25": "that, lo and behold, is an unfair division!",
                            "verse 53:26": "These [allegedly divine beings] are nothing but empty names which you have invented – you and your forefathers –",
                            "verse 53:27": "for which God has bestowed no warrant from on high.",
                            "verse 53:28": "Does man imagine that it is his due to have all that he might wish for,",
                            "verse 53:29": "despite the fact that",
                            "verse 53:30": "the life to come and this present",
                            "verse 53:31": "belong to God ?",
                            "verse 53:32": "For, however many angels there be in the heavens, their intercession can be of no least avail [to anyone] – except after God has given leave [to intercede] for whomever He wills and with whom He is well-pleased.",
                            "verse 53:33": "Behold, it is",
                            "verse 53:34": "such as do not",
                            "verse 53:35": "believe in the life to come that regard the angels as female beings;",
                            "verse 53:36": "and",
                            "verse 53:37": "they have no knowledge whatever thereof, they follow nothing but surmise: yet, behold, never can surmise take the place of truth.",
                            "verse 53:38": "Avoid thou, therefore, those who turn away from all remembrance of Us and care for no more than the life of this world,",
                            "verse 53:39": "which, to them, is the only thing worth knowing.",
                            "verse 53:40": "Indeed, unto God belongs all that is in the heavens and all that is on earth: and so He will reward those who do evil in accordance with what they did, and will reward those who do good with ultimate good.",
                            "verse 53:41": "As for those who avoid the",
                            "verse 53:42": "grave sins and shameful deeds – even though they may sometimes stumble – behold, thy Sustainer is abounding in forgiveness.",
                            "verse 53:43": "He knows best as to who is conscious of Him.",
                            "verse 53:44": "HAST THOU, then, ever considered him who turns away [from remembering Us, and cares for no more than the life of this world],",
                            "verse 53:45": "and gives so little [of himself for the good of his soul], and so grudgingly?",
                            "verse 53:46": "Does he [claim to] have knowledge of something that is beyond the reach of human perception, so that he can see [it clearly]?",
                            "verse 53:47": "Or has he never yet been told of what was",
                            "verse 53:48": "in the revelations of Moses,",
                            "verse 53:49": "and of Abraham, who to his trust was true:",
                            "verse 53:50": "that no bearer of burdens shall be made to bear another’s burden;",
                            "verse 53:51": "and that nought shall be accounted unto man but what he is striving for;",
                            "verse 53:52": "and that in time [the nature of] all his striving will be shown [to him in its true light],",
                            "verse 53:53": "whereupon he shall be requited for it with the fullest requital;",
                            "verse 53:54": "and that with thy Sustainer is the beginning and the end [of all that exits];",
                            "verse 53:55": "and that it is He alone who causes",
                            "verse 53:56": "to laugh and to weep;",
                            "verse 53:57": "and that it is He alone who deals death and grants life;",
                            "verse 53:58": "and that it is He who creates the two kinds – the male and the female –",
                            "verse 53:59": "out of a",
                            "verse 53:60": "drop of sperm as it is poured forth,",
                            "verse 53:61": "and that",
                            "verse 53:62": "it is within His power to bring about a second life;",
                            "verse 53:63": "and that it is He alone who frees from want and causes to possess;",
                            "verse 53:64": "and that it is He alone who sustains the brightest star;",
                            "verse 53:65": "and that it is He who destroyed the ancient [tribes of] ’ād",
                            "verse 53:66": "and Thamūd, leaving no trace [of them],",
                            "verse 53:67": "as well as the people of Noah before them –",
                            "verse 53:68": "verily, they all had been most willful in their evildoing and most overweening –",
                            "verse 53:69": "just as He thrust into perdition those cities that were overthrown",
                            "verse 53:70": "and then covered them from sight forever.",
                            "verse 53:71": "About which, then, of thy Sustainer’s powers canst thou",
                            "verse 53:72": "remain in doubt?",
                            "verse 53:73": "HIS IS a warning like those warnings of old:",
                            "verse 53:74": "that [Last Hour] which is so near draws ever nearer,",
                            "verse 53:75": "",
                            "verse 53:76": "none but God can unveil it.",
                            "verse 53:77": "Do you, perchance, find this tiding strange?",
                            "verse 53:78": "And do you laugh instead of weeping,",
                            "verse 53:79": "and divert yourselves all the while?",
                            "verse 53:80": "",
                            "verse 53:81": "but prostrate yourselves before God, and worship [Him alone]!",
                            "verse 53:82": "a phrase deliberately vague (mubham), indicative of the inconceivable majesty and splendour attaching to this symbol of paradise “which no description can picture and no definition can embrace” (Zamakhsharī).",
                            "verse 53:83": "of the greatest of his Sustainer’s symbols (āyāt)” For this specific rendering of the term āyah, see note 2 on 17:1, which refers to the same mystic experience, namely, the Ascension.",
                            "verse 53:84": "a phrase which may be taken to mean “an occasional stumbling into sin” – i.",
                            "verse 53:85": "only according to the conscious intentions [which prompted them]; and unto everyone will be accounted only what he consciously intended,” i.",
                            "verse 53:86": "understand all that you were doing [in life]."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 53:1": "And verily he saw him at another revelation.",
                            "verse 53:2": "",
                            "verse 53:3": "Beside the lote-tree of the uttermost boundary.",
                            "verse 53:4": "the Lote Tree of the Uttermost End.",
                            "verse 53:5": "Whereby is the Garden of Refuge.",
                            "verse 53:6": "here is the Garden of Ultimate Refuge.",
                            "verse 53:7": "When there enshrouded the lote-tree That Which enshroudeth.",
                            "verse 53:8": "",
                            "verse 53:9": "",
                            "verse 53:10": "The sight wavered not, nor did it transgress.",
                            "verse 53:11": "eye wavered not nor did it transgress.",
                            "verse 53:12": "",
                            "verse 53:13": "Verily he saw, of the Signs of his Lord, the Greatest.",
                            "verse 53:14": "he beheld, of all the signs of his Lord, the Greatest.",
                            "verse 53:15": "Thy Lord is the Uttermost end.",
                            "verse 53:16": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 53:17": "The Book of Certainty (1952) •",
                            "verse 53:18": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 53:19": "What is Sufism (1975) •",
                            "verse 53:20": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 53:21": "Muhammad (1983) •",
                            "verse 53:22": "Symbol and Archetype (1991) •",
                            "verse 53:23": "Sufi Poems (2004) •",
                            "verse 53:24": "Mecca (2004) •",
                            "verse 53:25": "Return to the Spirit (2005) •",
                            "verse 53:26": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 53:27": "“Proofs of Islam”(1954).",
                            "verse 53:28": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 53:29": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 53:30": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 53:31": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 53:32": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 53:33": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 53:34": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 53:35": "“The Quranic Origins of Sufism” •",
                            "verse 53:36": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 53:37": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 53:38": "“An Introduction to Islam” •",
                            "verse 53:39": "“The Universality of the Quran” •",
                            "verse 53:40": "Private Talks Books",
                            "verse 53:41": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 53:1": "By the star when it goes down to set,",
                            "verse 53:2": "your fellow (the Holy Prophet) has neither missed the way, nor did he deviate.",
                            "verse 53:3": "He does not speak out of (his own) desire.",
                            "verse 53:4": "It is but revelation revealed (to him).",
                            "verse 53:5": "It is taught to him by one (angel) of strong faculties,",
                            "verse 53:6": "the one of vigour.",
                            "verse 53:7": "while he was on the upper horizon.",
                            "verse 53:8": "Then he drew near, and came down,",
                            "verse 53:9": "so as he was at a distance like that of two bows (joined together), rather even nearer.",
                            "verse 53:10": "Thus He (Allah) revealed to His slave what He revealed.",
                            "verse 53:11": "The heart did not err in what he saw.",
                            "verse 53:12": "Do you quarrel with him in what he sees?",
                            "verse 53:13": "Indeed he saw him another time",
                            "verse 53:14": "by Sidrat-ul-Muntahā (the lote-tree in the upper realm),",
                            "verse 53:15": "near which there is Jannat-ul-Ma’wā (the Paradise of Abode),",
                            "verse 53:16": "when the lote-tree was covered by that which covered it.",
                            "verse 53:17": "The eye neither went wrong, nor did exceed the limit.",
                            "verse 53:18": "He has indeed seen a part of the biggest signs of your Lord.",
                            "verse 53:19": "Have you ever considered about the (idols of) Lāt and ‘Uzzā,",
                            "verse 53:20": "and about the other, the third (idol), namely, Manāt,?",
                            "verse 53:21": "Is it that you have males and He (Allah) has females?",
                            "verse 53:22": "If so, it is a bizarre division.",
                            "verse 53:23": "These are nothing but names you and your fathers have invented; Allah has sent down no authority attached to them.",
                            "verse 53:24": "Is it that man can get whatever he wishes?",
                            "verse 53:25": "(No,) because to Allah alone belongs the (good of) the Hereafter and the former life (of this world).",
                            "verse 53:26": "How many angels there are in the heavens whose intercession cannot benefit (any one) at all, but after Allah allows (it) for whomsoever He wills and pleases.",
                            "verse 53:27": "Those who do not believe in the Hereafter call the angels by names of females.",
                            "verse 53:28": "They do not have knowledge about it.",
                            "verse 53:29": "So, turn away from him who turns away from Our advice, and seeks nothing but (pleasure of) the worldly life.",
                            "verse 53:30": "That is the limit of their access to knowledge.",
                            "verse 53:31": "To Allah belongs whatever there is in the heavens and whatever there is in the earth, so that He gives punishment to evildoers for what they did, and gives good reward to those who did good",
                            "verse 53:32": "-those who abstain from the major sins and from shameful acts, except minor involvements.",
                            "verse 53:33": "Did you see the one who turned away,",
                            "verse 53:34": "and gave a little, and stopped?",
                            "verse 53:35": "Does he have knowledge of the Unseen whereby he sees (what he believes)?",
                            "verse 53:36": "Has he not been told of what was (revealed) in the scriptures of Mūsā",
                            "verse 53:37": "and of Ibrāhīm who fulfilled (his duties)?",
                            "verse 53:38": "(It was) that no bearer of burden shall bear the burden of the other,",
                            "verse 53:39": "and that a man shall not deserve but (the reward of) his own effort,",
                            "verse 53:40": "and that his effort will soon be seen,",
                            "verse 53:41": "then he will be recompensed for it in full,",
                            "verse 53:42": "and that to your Lord is the end (of every one),",
                            "verse 53:43": "and that He is the One who makes (one) laugh and makes (him) weep,",
                            "verse 53:44": "and that He is the One who gives death and gives life,",
                            "verse 53:45": "and that He creates the pairs, male and female,",
                            "verse 53:46": "from a sperm-drop when it is poured (into a womb),",
                            "verse 53:47": "and that the second creation is undertaken by Him,",
                            "verse 53:48": "and that He is the One who gives wealth and preserves (it),",
                            "verse 53:49": "and that He is the One who is the Lord of Sirius (the star worshipped by pagans),",
                            "verse 53:50": "and that He has destroyed the earlier ‘Ād,",
                            "verse 53:51": "and Thamūd, so spared none,",
                            "verse 53:52": "and (destroyed) the people of NūH even earlier.",
                            "verse 53:53": "And He destroyed the overturned towns (of the people of LūT) also,",
                            "verse 53:54": "so enveloped they were by that which enveloped.",
                            "verse 53:55": "Then concerning which of your Lord’s bounties would you remain in doubt?",
                            "verse 53:56": "This (Prophet) is a warner from the (genus of the) previous warners.",
                            "verse 53:57": "The Imminent (Hour of Judgment) has approached.",
                            "verse 53:58": "There is no one, beside Allah, to remove it.",
                            "verse 53:59": "Do you then wonder at this discourse,",
                            "verse 53:60": "and laugh (at it), and not weep,",
                            "verse 53:61": "while you are engaged in vain play?",
                            "verse 53:62": "Now, fall down in prostration and worship (Allah)."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 53:1": "By the Star when it sets,",
                            "verse 53:2": "your companion has neither gone astray, nor has he erred;",
                            "verse 53:3": "nor does he speak out of [his own] desire.",
                            "verse 53:4": "It is but a revelation that is revealed,",
                            "verse 53:5": "taught to him by one of awesome power,",
                            "verse 53:6": "possessed of vigour; and he stood upright,",
                            "verse 53:7": "when he was on the highest horizon.",
                            "verse 53:8": "Then he drew near and drew closer still,",
                            "verse 53:9": "until he was within the length of two bows away or",
                            "verse 53:10": "nearer,",
                            "verse 53:11": "whereat He revealed to His servant what he revealed.",
                            "verse 53:12": "The heart did not deny what he saw.",
                            "verse 53:13": "Will you then dispute with him concerning what he saw?",
                            "verse 53:14": "And verily he saw him another time,",
                            "verse 53:15": "by the Lote-tree of the Ultimate Boundary,",
                            "verse 53:16": "near which is the Garden of the Retreat,",
                            "verse 53:17": "when there shrouded the Lote-tree that which shrouded ,",
                            "verse 53:18": "The eye did not swerve, nor did it go beyond [the bounds].",
                            "verse 53:19": "Verily he saw some of the greatest signs of his Lord.",
                            "verse 53:20": "Have you considered al-Lāt and al-’Uzzā,",
                            "verse 53:21": "and Manāt, the third, the other?",
                            "verse 53:22": "Are you to have males, and He females?",
                            "verse 53:23": "That, then, would indeed be an unfair division!",
                            "verse 53:24": "These are nothing but names which you have named, you and your fathers.",
                            "verse 53:25": "souls desire, even though guidance has already come to them from their Lord.",
                            "verse 53:26": "Or shall man have whatever he wishes for?",
                            "verse 53:27": "Yet to God belong the Hereafter and the former .",
                            "verse 53:28": "And how many an angel there is in the heavens whose intercession cannot avail in any way except after God gives permission for whomever He wills, and He is satisfied.",
                            "verse 53:29": "Truly those who do not believe in the Hereafter give the angels the names of females.",
                            "verse 53:30": "But they do not have any knowledge thereof.",
                            "verse 53:31": "So shun him who turns away from Our Remembrance, and desires nothing but the life of this world.",
                            "verse 53:32": "That is the full extent of their knowledge.",
                            "verse 53:33": "guided.",
                            "verse 53:34": "And to God belongs whatever is in the heavens and whatever is in the earth that He may requite those who do evil for what they have done, and reward those who are virtuous with the best .",
                            "verse 53:35": "Those who avoid grave sins and abominations, excepting lesser offences.",
                            "verse 53:36": "in the bellies of your mothers.",
                            "verse 53:37": "Did you see him who turned away,",
                            "verse 53:38": "and gave a little, and was then grudging?",
                            "verse 53:39": "Does he possess knowledge of the Unseen so that he sees?",
                            "verse 53:40": "Or has he not been informed of what is in the scrolls of Moses,",
                            "verse 53:41": "and Abraham who fulfilled [his summons]",
                            "verse 53:42": "that no burdened soul shall bear the burden of another,",
                            "verse 53:43": "and that man shall have only what he",
                            "verse 53:44": "strives for,",
                            "verse 53:45": "and that his endeavour will be seen,",
                            "verse 53:46": "then he will be rewarded for it with the fullest reward,",
                            "verse 53:47": "and that the ultimate end is toward your Lord,",
                            "verse 53:48": "and that it is He Who makes to laugh and makes to weep,",
                            "verse 53:49": "and that it is He Who brings death and gives life,",
                            "verse 53:50": "and that He",
                            "verse 53:51": "creates the two spouses, the male and the female,",
                            "verse 53:52": "from a drop [of semen] once it is emitted,",
                            "verse 53:53": "and that with Him rests the second genesis,",
                            "verse 53:54": "and that it is He Who enriches and grants possessions,",
                            "verse 53:55": "and that it is He Who is the Lord of Sirius,",
                            "verse 53:56": "and that He destroyed former ‘ād",
                            "verse 53:57": "and Thamūd sparing not;",
                            "verse 53:58": "and the people of Noah before that; indeed they were more unjust and more insolent;",
                            "verse 53:59": "and the Deviant",
                            "verse 53:60": "He overturned",
                            "verse 53:61": "so that there covered them that which covered .",
                            "verse 53:62": "Then which of the bounties of your Lord do you dispute?",
                            "verse 53:63": "This is a warner [in the tradition] of the warners of old.",
                            "verse 53:64": "The Impending",
                            "verse 53:65": "is imminent.",
                            "verse 53:66": "None besides God can disclose it.",
                            "verse 53:67": "Do you then marvel at this discourse,",
                            "verse 53:68": "and laugh and not weep,",
                            "verse 53:69": "while you remain oblivious?",
                            "verse 53:70": "So prostrate to God and worship Him oblivious?"
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 53:1": "By the bright star (Muhammad [blessings and peace be upon him]) when (he ascended during the Ascension Night in the twinkling of an eye and) descended.",
                            "verse 53:2": "He who bestowed on you his companionship (i.",
                            "verse 53:3": "And he does not speak out of his (own) desire.",
                            "verse 53:4": "His speech is nothing but Revelation, which is sent to him.",
                            "verse 53:5": "(The Lord) of Mighty Powers (directly) conferred on him (perfect) knowledge,",
                            "verse 53:6": "He Who is absolute beauty.",
                            "verse 53:7": "And he (Muhammad [blessings and peace be upon him]) was on the uppermost horizon (of the realm of creation during the Ascension Night i.",
                            "verse 53:8": "Then He (the Lord of Honour) drew closer (to His Beloved Muhammad [blessings and peace be upon him]) and then drew even closer.",
                            "verse 53:9": "Then a distance measuring only two bow-lengths was left (between Allah Unveiled and His Esteemed Beloved), or even less than that (in extreme nearness).",
                            "verse 53:10": "So (on that station of nearness) He (Allah) revealed to His (Beloved) servant whatever He revealed.",
                            "verse 53:11": "(His) heart did not take it contrary to what (his) eyes beheld.",
                            "verse 53:12": "Do you argue with him about what he saw?",
                            "verse 53:13": "And assuredly, he saw Him (Allah Unveiled) the second time (again and you argue only about seeing Him once).",
                            "verse 53:14": "At the farthest Lote-Tree—Sidra al-Muntaha,",
                            "verse 53:15": "Adjacent to that is the Eternal Paradise—Janna al-Ma’wa,",
                            "verse 53:16": "When theophanies (i.",
                            "verse 53:17": "His eye neither inclined aside nor overstepped the limit; (it gazed in ecstasy at Whom it was to gaze).",
                            "verse 53:18": "Surely, he saw the greatest signs of His Lord (during the Ascension Night).",
                            "verse 53:19": "Have you taken a look at (the goddesses) Lat and ‘Uzza?",
                            "verse 53:20": "And (have you) also (seen thoughtfully) another, that third one (goddess) Manat? (Have you declared them daughters of Allah?)",
                            "verse 53:21": "(O idolaters!) Are sons for you and daughters for Him (Allah)?",
                            "verse 53:22": "(If your concept is correct,) then that division is serious injustice.",
                            "verse 53:23": "But (the truth is that) these (idols) are nothing but mere names which you and your fathers have given.",
                            "verse 53:24": "Is (all) that available for man what he longs for?",
                            "verse 53:25": "So Allah alone is the Master of the Hereafter and the world.",
                            "verse 53:26": "And how many angels there are in the heavens (whom the disbelievers and the idolaters worship and expect from them intercession but) whose intercession will be of no use at all, except after Allah (awards) permission for whom He wills and likes!",
                            "verse 53:27": "Surely, those who do not believe in the Hereafter give the angels female names.",
                            "verse 53:28": "And they know nothing about it.",
                            "verse 53:29": "So divert your attention from him who turns away from Our remembrance and desires nothing but the life of this world.",
                            "verse 53:30": "That is but the limit of the working of their knowledge.",
                            "verse 53:31": "And to Allah belongs whatever is in the heavens and whatever is in the earth so that He recompenses the acts of those who have committed vices and gives good reward to those who have performed virtues.",
                            "verse 53:32": "Those who guard against grave sins and indecencies excepting small sins (and omissions), surely your Lord has vast prospects of forgiveness (for them).",
                            "verse 53:33": "Have you seen him who has turned away (from the truth)?",
                            "verse 53:34": "And he gave away a little (wealth in the way of Allah) and (then) held back (his hand)?",
                            "verse 53:35": "Does he have the knowledge of the unseen that he can see?",
                            "verse 53:36": "Has he not been given the knowledge of (matters) mentioned in the scriptures of Musa (Moses),",
                            "verse 53:37": "And in the (scriptures) of Ibrahim (Abraham), who accomplished (all the commands of Allah) with perfection?",
                            "verse 53:38": "That no bearer of a burden will carry the burden of (the sins) of another;",
                            "verse 53:39": "And that man (according to justice) will get only that for which he strives.",
                            "verse 53:40": "And that all his endeavours will soon be shown (i.",
                            "verse 53:41": "Then he will be given full reward (for all his endeavours);",
                            "verse 53:42": "And that (ultimately all) have to return to your Lord;",
                            "verse 53:43": "And that He is the One Who makes one laugh (granting delight) and makes one weep (granting grief);",
                            "verse 53:44": "And that He is the One Who causes death and gives life;",
                            "verse 53:45": "And that He is the One Who has created the two genders, male and female,",
                            "verse 53:46": "Out of a (sperm) drop when it is ejaculated (into the mother’s womb);",
                            "verse 53:47": "And that it is upon Him alone to raise up alive (also after death);",
                            "verse 53:48": "And that He is the One Who makes self-sufficient (by providing according to needs), and He is the One Who enriches treasures (by giving surplus to the needs);",
                            "verse 53:49": "And that He alone is the Lord of Sirius (a star that was worshipped in the days of ignorance);",
                            "verse 53:50": "And that He is the One Who destroyed the first (people of) ‘Ad,",
                            "verse 53:51": "And (the people of) Thamud (as well).",
                            "verse 53:52": "And before that, He destroyed the people of Nuh (",
                            "verse 53:53": "as well).",
                            "verse 53:54": "And He is the One Who (raised up) the overturned towns (of the people of Lut )",
                            "verse 53:55": "and smashed them down.",
                            "verse 53:56": "Then covered them that which did cover (i.",
                            "verse 53:57": "So, (O man,) which of the favours of your Lord will you doubt?",
                            "verse 53:58": "This (Holy Prophet [blessings and peace be upon him]) is also a Warner of the Warners of old.",
                            "verse 53:59": "The imminent (Hour of Judgment) has drawn near.",
                            "verse 53:60": "No one except Allah can bring it forth (and establish).",
                            "verse 53:61": "So do you wonder at this Revelation?",
                            "verse 53:62": "And do you laugh and not weep,",
                            "verse 53:63": "Whilst you are busy playing a game (of negligence)?",
                            "verse 53:64": "So prostrate yourselves before Allah and worship (Him)."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Kautta tähden, joka kalpenee taivaalla,",
                            "verse 53:2": "suojelijanne ei erehdy eikä joudu harhaan;",
                            "verse 53:3": "ei hän myöskään puhu omasta tahdostaan.",
                            "verse 53:4": "Tämä on totisesti Jumalan ilmoitus, joka on hänelle ilmaistu.",
                            "verse 53:5": "Herra, jolla on valtava voima, on opettanut häntä.",
                            "verse 53:6": "Hänen asemansa säilyi horjumattomana.",
                            "verse 53:7": "Hän (Muhammed) oli taivaan korkeuksissa,",
                            "verse 53:8": "ja sitten hän lähestyi Herraa ja painui alas,",
                            "verse 53:9": "niin että hän oli kahden jousenkantaman etäisyydellä tai vielä lähempänäkin",
                            "verse 53:10": "ja ilmaisi palvelijalleen sen, mitä ilmaisi.",
                            "verse 53:11": "Ei hänen sydämensä keksinyt sitä, mitä hän näki.",
                            "verse 53:12": "Miksi siis haluatte kiistellä hänen kanssaan siitä, mitä hän on nähnyt?",
                            "verse 53:13": "Totisesti hän on nähnyt Hänet toisessakin ilmestyksessä,",
                            "verse 53:14": "lähellä etäisintä lootuspuuta,",
                            "verse 53:15": "jonka vieressä on ikiasumusten puutarha,",
                            "verse 53:16": "kun lootuspuun verhosi se, mikä kykenee verhoamaan;",
                            "verse 53:17": "katse ei harhaillut eikä pettänyt;",
                            "verse 53:18": "totisesti hän näki suurimman Herransa tunnusmerkeistä.",
                            "verse 53:19": "Oletteko sitten ajatelleet al-Latia ja al~Uzzaa",
                            "verse 53:20": "ja Manatia, kolmatta ja viimeistä?",
                            "verse 53:21": "Kuuluvatko pojat teille ja Hänelle tyttäret?",
                            "verse 53:22": "Mikä nurja jako!",
                            "verse 53:23": "Nämä eivät ole muuta kuin nimiä, joita te olette antaneet heille, te ja esi~isänne, eikä Jumala ole lähettänyt heille mitään valtuutta.",
                            "verse 53:24": "Vai tuleeko ihmisen saada kaikki, mitä hän haluaa?",
                            "verse 53:25": "Jumalan on kuitenkin kaikki mennyt ja tuleva.",
                            "verse 53:26": "Kuinka monta sanansaattajahenkeä (enkeliä) onkaan taivaissa, joiden apu ei hyödytä ketään, ellei Jumala anna siihen lupaa sille, joka Häntä miellyttää ja johon Hän on tyytyväinen.",
                            "verse 53:27": "Totisesti vain ne, jotka eivät usko tulevaan elämään, kutsuvat näitä enkeleitä naisten nimillä.",
                            "verse 53:28": "Mutta heillä ei ole siitä mitään tietoa; he seuraavat vain arveluja, mutta arvelu ei totisesti kestä totuuteen verraten.",
                            "verse 53:29": "Käänny siis pois siitä, joka kääntää selkänsä Meidän kehoituksellemme eikä tavoittele muuta kuin tämän maailman elämää!",
                            "verse 53:30": "Tähän kaikki heidän tietonsa tähtää.",
                            "verse 53:31": "Jumalan on kaikki, mitä on taivaassa ja maan päällä, jotta Hän saisi tuomita pahantekijät heidän tekojensa mukaan ja palkita hyvyydellä niitä, jotka tekevät hyvää.",
                            "verse 53:32": "Niille, jotka karttavat suuria syntejä ja rikkomuksia, joskaan eivät pienempiä hairauksia, niille on totisesti Herrasi anteeksianto avara.",
                            "verse 53:33": "Oletko ajatellut ihmistä, joka kääntyy pois,",
                            "verse 53:34": "antaa vähän ja on kovasydäminen?",
                            "verse 53:35": "Onko hänellä tietoa salatusta, niin että hän voi nähdä?",
                            "verse 53:36": "Tai eikö hänelle ole ilmoitettu, mitä on Mooseksen kirjoissa,",
                            "verse 53:37": "ja kuinka Aabraham täytti käskyt?",
                            "verse 53:38": "Tiedä, ettei kukaan kuormaa kantava kanna toisen taakkaa",
                            "verse 53:39": "ja että ihmisen osalle ei tule muuta kuin se, mitä hän on tavoitellut,",
                            "verse 53:40": "että hänen pyrkimyksensä saatetaan päivänvaloon,",
                            "verse 53:41": "että hänet sitten palkitaan täysin mitoin,",
                            "verse 53:42": "että Herrassasi, on kaiken loppu,",
                            "verse 53:43": "että Hän antaa ihmiselle hymyn ja itkun,",
                            "verse 53:44": "että Hän antaa elämän ja kuoleman,",
                            "verse 53:45": "että Hän on luonut molemmat sukupuolet - miehen ja naisen -",
                            "verse 53:46": "istutetusta siemenestä,",
                            "verse 53:47": "että Hänen huostassaan on tuleva kehitys,",
                            "verse 53:48": "että Hän antaa rikkauden ja omaisuuden,",
                            "verse 53:49": "että Hän on Siriuksen Herra,",
                            "verse 53:50": "että Hän tuhosi muinaisen Aadin",
                            "verse 53:51": "ja Tamuudin, jota Hän ei armahtanut",
                            "verse 53:52": "ja Nooan kansan sitä ennen.",
                            "verse 53:53": "Hän hajoitti kukistetut kaupungit",
                            "verse 53:54": "ja peitti ne sillä, mikä peittää voi.",
                            "verse 53:55": "Mitä Herrasi armolahjoja tahdot siis epäillä?",
                            "verse 53:56": "Tämä (Muhammed) on entisten varoittajain kaltainen varoittaja.",
                            "verse 53:57": "Tuleva loppu lähenee;",
                            "verse 53:58": "kukaan paitsi Jumala ei voi sitä siirtää.",
                            "verse 53:59": "Ihmettelettekö sitten näitä sanomia,",
                            "verse 53:60": "nauratteko sensijaan että itkisitte,",
                            "verse 53:61": "houkkioita kun olette?",
                            "verse 53:62": "Kumartukaa sentähden Jumalan edessä ja palvelkaa Häntä!"
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 53:1": "Par l'étoile lorsqu'elle disparaît !",
                            "verse 53:2": "Votre compagnon n'est pas égaré et il n'est pas dans l'erreur ;",
                            "verse 53:3": "il ne parle pas par caprice.",
                            "verse 53:4": "Il s'agit uniquement d'une révélation reçue",
                            "verse 53:5": "que lui a fait connaître Celui dont la force est puissante,",
                            "verse 53:6": "qui possède la clairvoyance.",
                            "verse 53:7": "se tenant à l'horizon suprême.",
                            "verse 53:8": "Puis Il s'approcha et demeura suspendu.",
                            "verse 53:9": "Il se trouvait alors à la distance de deux arcs, ou plus près encore,",
                            "verse 53:10": "et Il révéla alors à Son serviteur ce qu'Il lui révéla.",
                            "verse 53:11": "Le cœur n'a pas menti sur ce qu'il a vu.",
                            "verse 53:12": "Mettrez-vous donc en doute ce qu'il voit ?",
                            "verse 53:13": "Il l'a vu, en vérité, lors d'une autre révélation,",
                            "verse 53:14": "près du jujubier de la limite,",
                            "verse 53:15": "là où se trouve le Jardin de la Demeure,",
                            "verse 53:16": "au moment où le jujubier est enveloppé par ce qui le couvre.",
                            "verse 53:17": "Son regard ne s'est pas détourné et n'a pas été abusé.",
                            "verse 53:18": "Il a vu, en vérité, le plus grand des signes de son Seigneur.",
                            "verse 53:19": "Avez-vous considéré al-Lât et al-'Uzzâ,",
                            "verse 53:20": "et l'autre, Manât, la troisième ?",
                            "verse 53:21": "Le mâle serait-il pour vous, et pour Lui, la femelle ?",
                            "verse 53:22": "Ce serait là un partage inique !",
                            "verse 53:23": "Ce ne sont vraiment là que des noms que vous et vos pères leur avez attribués, sans que Dieu leur ait accordé un pouvoir quelconque.",
                            "verse 53:24": "L'homme obtiendra-t-il ce qu'il désire ?",
                            "verse 53:25": "La vie dernière, comme la première, appartient à Dieu.",
                            "verse 53:26": "Que d'anges dans les cieux dont l'intercession sera inutile, sinon après que Dieu l'aura permis, en faveur de qui Il voudra et de celui dont Il sera satisfait.",
                            "verse 53:27": "Ceux qui ne croient pas en la vie future donnent aux anges des noms de femmes,",
                            "verse 53:28": "alors qu'ils n'en savent rien.",
                            "verse 53:29": "Ecarte-toi donc de celui qui tourne le dos à Notre rappel et qui ne désire rien d'autre que la vie de ce monde.",
                            "verse 53:30": "C'est là toute la portée de leur science ! Certes, ton Seigneur sait parfaitement qui s'égare hors de Son chemin et Il sait parfaitement qui est bien dirigé.",
                            "verse 53:31": "A Dieu appartient tout ce qui existe dans les cieux et sur la terre afin qu'Il rétribue selon leurs oeuvres ceux qui agissent mal et qu'Il rétribue par une belle récompense ceux qui font le bien.",
                            "verse 53:32": "A ceux qui évitent les péchés majeurs et les turpitudes, et qui ne commettent que des fautes légères ton Seigneur accorde largement Son pardon.",
                            "verse 53:33": "As-tu vu celui qui a tourné le dos,",
                            "verse 53:34": "qui a peu donné et s'est durci ?",
                            "verse 53:35": "Possède-t-il la science du mystère jusqu'à être voyant ?",
                            "verse 53:36": "N'a-t-il pas été informé de ce que contiennent les pages de Moïse",
                            "verse 53:37": "et celles d'Abraham le très fidèle ?",
                            "verse 53:38": "A savoir ceci : que nul porteur de charge n'aura à porter le fardeau d'un autre,",
                            "verse 53:39": "et que l'homme n'aura que le fruit de ses efforts ;",
                            "verse 53:40": "que son effort sera reconnu à la longue",
                            "verse 53:41": "et qu'il recevra ensuite la plus équitable des récompenses ;",
                            "verse 53:42": "qu'à ton Seigneur revient le terme final ;",
                            "verse 53:43": "que c'est Lui qui fait rire et fait pleurer ;",
                            "verse 53:44": "que c'est Lui qui fait mourir et qui fait vivre ;",
                            "verse 53:45": "que c'est Lui qui crée le couple, mâle et femelle,",
                            "verse 53:46": "d'une goutte de semence lorsqu'elle est émise ;",
                            "verse 53:47": "que c'est à Lui qu'incombe la seconde création ;",
                            "verse 53:48": "que c'est Lui, en vérité, qui accorde richesse et bien-être ;",
                            "verse 53:49": "qu'Il est le Seigneur de Sirius ;",
                            "verse 53:50": "qu'Il a détruit les anciens 'Ad",
                            "verse 53:51": "et anéanti les Thamoud,",
                            "verse 53:52": "de même qu'avant eux, le peuple de Noé qui comptait parmi les plus iniques et les plus rebelles.",
                            "verse 53:53": "La cité renversée, c'est Lui qui l'a détruite,",
                            "verse 53:54": "qui l'a recouverte de ce qui la recouvre.",
                            "verse 53:55": "Lequel des bienfaits de ton Seigneur voudrais-tu contester ?",
                            "verse 53:56": "Voici un avertisseur de la lignée de ceux d'autrefois.",
                            "verse 53:57": "Celle (l'Heure) qui doit approcher s'approche.",
                            "verse 53:58": "Nul, en dehors de Dieu, ne peut en dévoiler la venue.",
                            "verse 53:59": "Vous étonnez-vous de ces paroles,",
                            "verse 53:60": "vous font-elles rire et non pas pleurer,",
                            "verse 53:61": "et vous laissent-elles insensibles ?",
                            "verse 53:62": "Prosternez-vous donc devant Dieu et adorez-Le."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 53:1": "Par l’étoile à son déclin !",
                            "verse 53:2": "Votre compagnon ne s’est pas égaré et n’a pas été induit en erreur",
                            "verse 53:3": "et il ne prononce rien sous l’effet de la passion;",
                            "verse 53:4": "ce n’est rien d’autre qu’une révélation inspirée.",
                            "verse 53:5": "que lui a enseigné [L’Ange Gabriel] à la force prodigieuse,",
                            "verse 53:6": "doué de sagacité; c’est alors qu’il se montra sous sa forme réelle ,",
                            "verse 53:7": "alors qu’ils se trouvait à l’horizon supérieur.",
                            "verse 53:8": "Puis il se rapprocha et descendit encore plus bas,",
                            "verse 53:9": "et fut à deux portées d’arc, ou plus près encore.",
                            "verse 53:10": "Il révéla à Son serviteur ce qu’Il révéla.",
                            "verse 53:11": "Le coeur n’a pas menti en ce qu’il a vu.",
                            "verse 53:12": "Lui contestez-vous donc ce qu’il voit ?",
                            "verse 53:13": "Il l’a pourtant vu, lors d’une autre descente,",
                            "verse 53:14": "près de la Sidrat-ul-Muntaha ,",
                            "verse 53:15": "près d’elle se trouve le jardin de Maawa :",
                            "verse 53:16": "au moment où le lotus était couvert de ce qui le couvrait.",
                            "verse 53:17": "La vue n’a nullement dévié ni outrepassé la mesure.",
                            "verse 53:18": "Il a bien vu certaines des grandes merveilles de son Seigneur.",
                            "verse 53:19": "Que vous en semble [des divinités] Lat et Uzza,",
                            "verse 53:20": "ainsi que Manat, cette troisième autre ?",
                            "verse 53:21": "Sera-ce à vous le garçon et à Lui la fille ?",
                            "verse 53:22": "Que voilà donc un partage injuste !",
                            "verse 53:23": "Ce ne sont que des noms que vous avez inventés, vous et vos ancêtres.",
                            "verse 53:24": "âmes, alors que la guidée leur est venue de leur Seigneur.",
                            "verse 53:25": "Ou bien l’homme aura-t-il tout ce qu’il désire ?",
                            "verse 53:26": "A Dieu appartiennent la vie future et la vie d’ici-bas.",
                            "verse 53:27": "Et que d’Anges dans les cieux dont l’intercession ne sert à rien, sinon qu’après que Dieu l’aura permis, en faveur de qui Il veut et qu’Il agrée.",
                            "verse 53:28": "Ceux qui ne croient pas en l’au-delà donnent aux Anges des noms de femmes,",
                            "verse 53:29": "alors qu’ils n’en ont aucune science : ils ne suivent que la conjecture, alors que la conjecture ne sert à rien contre la vérité.",
                            "verse 53:30": "écarte-toi donc, de celui qui tourne le dos à Notre rappel et qui ne désire que la vie présente.",
                            "verse 53:31": "Voilà toute la portée de leur savoir.",
                            "verse 53:32": "A Dieu appartient ce qui est dans les cieux et sur la terre afin qu’Il rétribue ceux qui font le mal selon ce qu’ils oeuvrent, et récompense ceux qui font le bien par la meilleure ,",
                            "verse 53:33": "ceux qui évitent les plus grands péchés ainsi que les turpitudes et [qui ne commettent] que des fautes légères.",
                            "verse 53:34": "craignent.",
                            "verse 53:35": "Vois-tu celui qui s’est détourné,",
                            "verse 53:36": "donné peu et a",
                            "verse 53:37": "cessé de donner ?",
                            "verse 53:38": "Détient-il la science de l’Inconnaissable en sorte qu’il voit ?",
                            "verse 53:39": "Ne lui a-t-on pas annoncé ce qu’il y avait dans les feuilles de Moïse",
                            "verse 53:40": "et celles d’Abraham qui a tenu parfaitement [sa promesse de transmettre]",
                            "verse 53:41": "qu’aucune",
                            "verse 53:42": "ne portera le fardeau (le péché) d’autrui,",
                            "verse 53:43": "et qu’en vérité, l’homme n’obtient que [le fruit] de ses efforts;",
                            "verse 53:44": "et que son effort, en vérité, lui sera présenté (le jour du Jugement).",
                            "verse 53:45": "Ensuite il en sera récompensé pleinement,",
                            "verse 53:46": "et que tout aboutit, en vérité, vers ton Seigneur,",
                            "verse 53:47": "et que c’est Lui qui a fait rire et qui a fait pleurer,",
                            "verse 53:48": "et que c’est Lui qui a fait mourir et qui a ramené à la vie,",
                            "verse 53:49": "et que c’est Lui qui a créé les deux éléments de couple, le mâle et la femelle,",
                            "verse 53:50": "d’une goutte de sperme quand elle est éjaculée",
                            "verse 53:51": "et que la seconde création Lui incombe,",
                            "verse 53:52": "et c’est Lui qui a enrichi et qui a fait acquérir.",
                            "verse 53:53": "Et c’est Lui qui est le Seigneur de Sirius ,",
                            "verse 53:54": "et c’est Lui qui a fait périr les anciens Aad,",
                            "verse 53:55": "ainsi que les Tamud, et Il fit que rien n’en subsistât,",
                            "verse 53:56": "ainsi que le peuple de Noé antérieurement, car ils étaient encore plus injustes et plus violents,",
                            "verse 53:57": "de même qu’Il anéantit les villes renversées .",
                            "verse 53:58": "Et les recouvrit de ce dont Il les recouvrit.",
                            "verse 53:59": "Lequel donc des bienfaits de ton Seigneur mets-tu en doute ?",
                            "verse 53:60": "Voici un avertisseur analogue aux avertisseurs anciens :",
                            "verse 53:61": "l’Imminente (L’heure du Jugement) s’approche.",
                            "verse 53:62": "Rien d’autre en dehors de Dieu ne peut la dévoiler.",
                            "verse 53:63": "Quoi ! Vous étonnez-vous de ce discours (le Coran) ?",
                            "verse 53:64": "Et vous :",
                            "verse 53:65": "riez et n’",
                            "verse 53:66": "pleurez point ?",
                            "verse 53:67": "absorbés [que vous êtes] par votre distraction.",
                            "verse 53:68": "Prosternez-vous donc à Dieu et adorez-Le ."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Beim Siebengestirn, wenn es sinkt,",
                            "verse 53:2": "Euer Gefährte (Mohammed) ist weder verirrt, noch ist er im Unrecht,",
                            "verse 53:3": "Noch spricht er aus Begierde.",
                            "verse 53:4": "Es ist eine Offenbarung nur, die offenbart wird.",
                            "verse 53:5": "Der mit mächtigen Kräften Begabte (Gabriel) hat ihn belehrt,",
                            "verse 53:6": "Dessen Macht sich wiederholt offenbart; er sitzt nun fest (auf einem Thron);",
                            "verse 53:7": "Und er ist am obersten Horizont.",
                            "verse 53:8": "Dann näherte er sich (Mohammed); dann stieg er herab (zu dem Propheten),",
                            "verse 53:9": "So daß er bis auf zwei Bogensehnen heraufkam oder noch näher.",
                            "verse 53:10": "Und Er offenbarte Seinem Diener, was Er offenbarte.",
                            "verse 53:11": "Das Herz (des Propheten) hielt Wahrheit dem, was er sah.",
                            "verse 53:12": "Wollt ihr da mit ihm streiten über das, was er sah?",
                            "verse 53:13": "Und er sah es (auch) bei einem andern Herabsteigen,",
                            "verse 53:14": "Beim fernsten Lotusbaum,",
                            "verse 53:15": "Neben dem der Garten der Wohnstatt ist.",
                            "verse 53:16": "Als den Lotusbaum überflutete, was (ihn) überflutete,",
                            "verse 53:17": "Da wankte der Blick nicht, noch schweifte er ab.",
                            "verse 53:18": "Wahrlich, er hatte eines der größten Zeichen seines Herrn gesehen.",
                            "verse 53:19": "«Ihr aber, habt ihr Lát und Uzzá betrachtet,",
                            "verse 53:20": "Und Manát, die dritte, die eine andere ist?",
                            "verse 53:21": "Wie! sollten euch die Knaben sein und Ihm die Mädchen?",
                            "verse 53:22": "Das wäre wahrhaftig eine unbillige Verteilung.",
                            "verse 53:23": "Es sind nur Namen, die ihr euch ausgedacht habt - ihr und eure Väter -, für die Allah keinerlei Ermächtigung hinabgesandt hat.",
                            "verse 53:24": "Kann der Mensch denn haben, was er nur wünscht?",
                            "verse 53:25": "Aber Allahs ist die künftige und diese Welt.",
                            "verse 53:26": "Und so mancher Engel ist in den Himmeln, dessen Fürbitte nichts nützen wird, es sei denn, nachdem Allah Erlaubnis gegeben hat, wem Er will und wer Ihm beliebt.",
                            "verse 53:27": "Solche, die nicht ans Jenseits glauben, die benennen die Engel mit weiblichen Namen;",
                            "verse 53:28": "Jedoch sie haben kein Wissen hiervon.",
                            "verse 53:29": "Drum wende dich ab von dem, der Unserer Ermahnung den Rücken kehrt und nichts begehrt als das Leben in dieser Welt.",
                            "verse 53:30": "Das ist die Summe ihres Wissens.",
                            "verse 53:31": "Und Allahs ist, was in den Himmeln und was auf Erden ist, auf daß Er denen, die Böses tun, ihren Lohn gebe für das, was sie gewirkt, und daß Er die, die Gutes tun, mit dem Allerbesten belohne,",
                            "verse 53:32": "Jene, die die schlimmsten Sünden und Schändlichkeiten meiden, bis auf leichte Vergehen - wahrlich, deines Herrn Verzeihung ist weitumfassend.",
                            "verse 53:33": "Siehst du den, der sich abkehrt",
                            "verse 53:34": "Und wenig gibt und kargt?",
                            "verse 53:35": "Hat er wohl Kenntnis des Verborgenen, daß er es sehen könnte?",
                            "verse 53:36": "Oder ist ihm nicht erzählt worden, was in den Büchern Moses' steht,",
                            "verse 53:37": "Und Abrahams, der (die Gebote) hielt?",
                            "verse 53:38": "Daß keine Lasttragende die Last einer andern tragen soll,",
                            "verse 53:39": "Und daß der Mensch nichts empfangen soll, als was er erstrebt,",
                            "verse 53:40": "Und daß sein Streben bald gesehn werden wird.",
                            "verse 53:41": "Dann wird er dafür belohnt werden mit dem vollsten Lohn.",
                            "verse 53:42": "Und daß zu deinem Herrn die endgültige Heimkehr ist,",
                            "verse 53:43": "Und daß Er es ist, Der lachen macht und weinen,",
                            "verse 53:44": "Und daß Er es ist, Der Tod und Leben gibt,",
                            "verse 53:45": "Und daß Er die zwei Geschlechter schafft, männlich und weiblich,",
                            "verse 53:46": "Aus einem Samentropfen, da er vergossen wird,",
                            "verse 53:47": "Und daß Ihm eine zweite Schöpfung obliegt,",
                            "verse 53:48": "Und daß Er allein reich macht und arm macht,",
                            "verse 53:49": "Und daß Er der Herr des Sirius ist,",
                            "verse 53:50": "Und daß Er die einstigen Àd vernichtete",
                            "verse 53:51": "Und die Thamüd, und keinen verschonte;",
                            "verse 53:52": "Und vordem das Volk Noahs - fürwahr, sie waren höchst ungerecht und widerspenstig -,",
                            "verse 53:53": "Und Er stürzte die verderbten Städte (des Volkes von Lot) um,",
                            "verse 53:54": "Daß sie bedeckte, was (sie) bedeckte.",
                            "verse 53:55": "Welche von deines Herrn Wohltaten willst du denn bestreiten?",
                            "verse 53:56": "Dies ist ein Warner von der gleichen Art wie die früheren Warner.",
                            "verse 53:57": "Die «Stunde» naht.",
                            "verse 53:58": "Keiner außer Allah kann sie abwenden.",
                            "verse 53:59": "Wundert ihr euch gar über diese Ankündigung?",
                            "verse 53:60": "Und lacht ihr und weint nicht?",
                            "verse 53:61": "Und wollt ihr achtlos bleiben?",
                            "verse 53:62": "Fallt lieber nieder vor Allah und verehret (Ihn)."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "rkjs dh d+le tc VwVk",
                            "verse 53:2": "fd rqEgkjs jQ+hd+ ¼eksgEen½ u xqejkg gq, vkSj u cgds",
                            "verse 53:3": "vkSj og rks viuh uQ+fl;kuh [+okfg’k ls dqN Hkh ugha dgrs",
                            "verse 53:4": ";s rks cl ogh gS tks Hksth tkrh gS",
                            "verse 53:5": "budks fugk;r rkd+roj ¼Q+fj’rs ftcjhy½ us rkyhe nh gS",
                            "verse 53:6": "tks cM+k t+cjnLr gS vkSj tc ;s ¼vkleku ds½ Å¡ps ¼eq’kjd+ks½ fdukjs ij Fkk rks og viuh ¼vlyh lwjr esa½ lh/kk [kM+k gqvk",
                            "verse 53:7": "fQj djhc gks ¼vkSj vkxs½ c<+k",
                            "verse 53:8": "¼fQj ftcjhy o eksgEen esa½ nks deku dk Q+klyk jg x;k",
                            "verse 53:9": "cfYd blls Hkh d+jhc Fkk",
                            "verse 53:10": "[+kqnk us vius cUns dh rjQ tks ^ogh",
                            "verse 53:11": "rks tks dqN mUgksus ns[kk muds fny us >wB u tkuk",
                            "verse 53:12": "rks D;k og ¼jlwy½ tks dqN ns[krk gS rqe yksx mlesa >xM+rs gks",
                            "verse 53:13": "vkSj mUgksus rks ml ¼ftcjhy½ dks ,d ckj ¼Ócs esjkt½ vkSj ns[kk gS",
                            "verse 53:14": "flnjrqy equrgk ds ut+nhd",
                            "verse 53:15": "mlh ds ikl rks jgus dh csfg’r gS",
                            "verse 53:16": "tc Nk jgk Fkk flnjk ij tks Nk jgk Fkk",
                            "verse 53:17": "¼ml oD+r Hkh½ mudh vk¡[k u rks vkSj rjQ+ ek,y gq;h vkSj u gn ls vkxs c<+h",
                            "verse 53:18": "vkSj mUgksus ;d+huu vius ijojfnxkj ¼dh d+qnjr½ dh cM+h cM+h fu’kkfu;k¡ ns[kha",
                            "verse 53:19": "rks Hkyk rqe yksxksa us ykr o mT+t+k vkSj rhljs fiNys eukr dks ns[kk",
                            "verse 53:20": "¼Hkyk ;s [+kqnk gks ldrs gSa½",
                            "verse 53:21": "D;k rqEgkjs rks csVs gSa vkSj mlds fy, csfV;k¡",
                            "verse 53:22": ";s rks cgqr csbUlkQ+h dh rd+lhe gS",
                            "verse 53:23": ";s rks cl flQZ uke gh uke gS tks rqeus vkSj rqEgkjs cki nknkvksa us x<+ fy, gSa] [+kqnk us rks bldh dksbZ lun ukft+y ugha dh ;s yksx rks cl vVdy vkSj viuh uQ+lkuh [+okfg’k ds ihNs py jgs gSa gkykWfd muds ikl muds ijojfnxkj dh rjQ ls fgnk;r Hkh vk pqdh gS",
                            "verse 53:24": "D;k ftl pht+ dh bUlku reUuk djs og mls t+:j feyrh gS",
                            "verse 53:25": "vk[+ksjr vkSj nqfu;k rks [+kkl [+kqnk gh ds ,[+rs;kj esa gSa",
                            "verse 53:26": "vkSj vklekuksa esa cgqr ls Qfj’rs gSa ftudh flQ+kfj’k dqN Hkh dke u vkrh] exj [+kqnk ftlds fy, pkgs btkt+r ns ns vkSj ilUn djs mlds ckn ¼flQ+kfj’k dj ldrs gSa½",
                            "verse 53:27": "tks yksx vk[+ksjr ij bZeku ugha j[krs og Q+fj’rksa ds uke j[krs gSa vkSjrksa ds ls uke gkykWfd mUgsa bldh dqN [+kcj ugha",
                            "verse 53:28": "og yksx rks cl xqeku ¼[+;ky½ ds ihNs py jgs gSa] gkykWfd xqeku ;d+hu ds cnys esa dqN Hkh dke ugha vk;k djrk]",
                            "verse 53:29": "rks tks gekjh ;kn ls jnfxjnkuh djs vksj flQZ nqfu;k dh ft+Unxh gh dk rkfyc gks rqe Hkh mlls eq¡g Qsj yks",
                            "verse 53:30": "muds bYe dh ;gh bfUrgk gS rqEgkjk ijojfnxkj] tks mlds jkLrs ls HkVd x;k mldks Hkh [+kwc tkurk gS] vkSj tks jkgs jkLr ij gS muls Hkh [+kwc okfd+Q gS",
                            "verse 53:31": "vkSj tks dqN vklekuksa esa gS vkSj tks dqN t+ehu esa gS ¼x+jt+ lc dqN½ [+kqnk gh dk gS] rkfd ftu yksxksa us cqjkbZ dh gks mudks mudh dkjLrkfu;ksa dh lt+k ns vkSj ftu yksxksa us usdh dh gS ¼mudh usdh dh tt+k ns½",
                            "verse 53:32": "tks lx+hjk xqukgksa ds flok dchjk xqukgksa ls vkSj csg;kbZ dh ckrksa ls cps jgrs gSa cs’kd rqEgkjk ijojfnxkj cM+h cf[Ó’k okyk gS ogh rqedks [+kwc tkurk gS tc mlus rqedks feVVh ls iSnk fd;k vkSj tc rqe viuh ek¡ ds isV esa cPps Fks rks ¼rdCcqj½ ls vius u¶+l dh ikdht+xh u trk;k djks tks ijgst+xkj gS mldks og [+kwc tkurk gS",
                            "verse 53:33": "Hkyk ¼,s jlwy½ rqeus ml Ó[+l dks Hkh ns[kk ftlus jnfxjnkuh dh",
                            "verse 53:34": "vkSj FkksM+k lk ¼[+kqnk dh jkg esa½ fn;k vkSj fQj cUn dj fn;k",
                            "verse 53:35": "D;k mlds ikl bYes x+Sc gS fd og ns[k jgk gS",
                            "verse 53:36": "D;k mldks mu ckrksa dh [+kcj ugha igq¡ph tks ewlk ds lghQ+ksa esa gS",
                            "verse 53:37": "vkSj bcjkghe ds ¼lghQ+ksa esa½",
                            "verse 53:38": "ftUgksus ¼viuk gd+½ ¼iwjk vnk½ fd;k bu lghQ+ksa esa ;s gS] fd dksbZ Ó[+l nwljs ¼ds xqukg½ dk cks> ugha mBk,xk",
                            "verse 53:39": "vkSj ;s fd bUlku dks ogh feyrk gS ftldh og dksf’k’k djrk gS",
                            "verse 53:40": "vkSj ;s fd mudh dksf’k’k vud+jhsc gh ¼d+;ker esa½ ns[kh tk,xh",
                            "verse 53:41": "fQj mldk iwjk iwjk cnyk fn;k tk,xk",
                            "verse 53:42": "vkSj ;s fd ¼lcdks vkf[+kj½ rqEgkjs ijojfnxkj gh ds ikl igq¡puk gS",
                            "verse 53:43": "vkSj ;s fd ogh g¡lkrk vkSj :ykrk gS",
                            "verse 53:44": "vkSj ;s fd ogh ekjrk vkSj ftykrk gS",
                            "verse 53:45": "vkSj ;s fd ogh uj vkSj eknk nks fdLe ¼ds gSoku½ uqRQs ls tc ¼jge esa½ Mkyk tkrk gS",
                            "verse 53:46": "iSnk djrk gS",
                            "verse 53:47": "vkSj ;s fd mlh ij ¼d;ker esa½ nksckjk mBkuk ykft+e gS",
                            "verse 53:48": "vkSj ;s fd ogh ekynkj cukrk gS vkSj ljek;k vrk djrk gS]",
                            "verse 53:49": "vkSj ;s fd ogh Óksvjk, dk ekfyd gS",
                            "verse 53:50": "vkSj ;s fd mlh us igys ¼d+kSes½ vkn dks gykd fd;k",
                            "verse 53:51": "vkSj lewn dks Hkh x+jt+ fdlh dks ckd+h u NksM+k",
                            "verse 53:52": "vkSj ¼mlds½ igys uwg dh d+kSe dks cs’kd ;s yksx cM+s gh t+kfye vkSj cM+s gh ljd’k Fks",
                            "verse 53:53": "vkSj mlh us ¼d+kSes ywr dh½ myVh gq;h cfLr;ksa dks ns iVdk",
                            "verse 53:54": "¼fQj mu ij½ tks Nk;k lks Nk;k",
                            "verse 53:55": "rks rw ¼,s bUlku vkf[+kj½ vius ijojfnxkj dh dkSu lh usver ij Ód fd;k djsxk",
                            "verse 53:56": ";s ¼eksgEen Hkh vxys Mjkus okys iSx+Ecjksa esa ls ,d Mjus okyk½ iSx+Ecj gS",
                            "verse 53:57": "d;ker d+jhc vk x;h",
                            "verse 53:58": "[+kqnk ds flok mls dksbZ Vky ugha ldrk",
                            "verse 53:59": "rks D;k rqe yksx bl ckr ls rkTtqc djrs gks vkSj g¡lrs gks",
                            "verse 53:60": "vkSj jksrs ugha gks",
                            "verse 53:61": "vkSj rqe bl d+nj x+kfQ+y gks rks [+kqnk ds vkxs ltns fd;k djks",
                            "verse 53:62": "vkSj ¼mlh dh½ bcknr fd;k djks ltnk"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Demi bintang ketika terbenam,",
                            "verse 53:2": "kawanmu (Muhammad) tidak sesat dan tidak pula keliru,",
                            "verse 53:3": "dan tiadalah yang diucapkannya itu (Al Qur'an) menurut kemauan hawa nafsunya.",
                            "verse 53:4": "Ucapannya itu tiada lain hanyalah wahyu yang diwahyukan (kepadanya),",
                            "verse 53:5": "yang diajarkan kepadanya oleh (Jibril) yang sangat kuat,",
                            "verse 53:6": "Yang mempunyai akal yang cerdas; dan (Jibril itu) menampakkan diri dengan rupa yang asli.",
                            "verse 53:7": "sedang dia berada di ufuk yang tinggi.",
                            "verse 53:8": "Kemudian dia mendekat, lalu bertambah dekat lagi,",
                            "verse 53:9": "maka jadilah dia dekat (pada Muhammad sejarak) dua ujung busur panah atau lebih dekat (lagi).",
                            "verse 53:10": "Lalu dia menyampaikan kepada hamba-Nya (Muhammad) apa yang telah Allah wahyukan.",
                            "verse 53:11": "Hatinya tidak mendustakan apa yang telah dilihatnya.",
                            "verse 53:12": "Maka apakah kamu (musyrikin Mekah) hendak membantahnya tentang apa yang telah dilihatnya?",
                            "verse 53:13": "Dan sesungguhnya Muhammad telah melihat Jibril itu (dalam rupanya yang asli) pada waktu yang lain,",
                            "verse 53:14": "(yaitu) di Sidratil Muntaha.",
                            "verse 53:15": "Di dekatnya ada surga tempat tinggal,",
                            "verse 53:16": "(Muhammad melihat Jibril) ketika Sidratilmuntaha diliputi oleh sesuatu yang meliputinya.",
                            "verse 53:17": "Penglihatannya (Muhammad) tidak berpaling dari yang dilihatnya itu dan tidak (pula) melampauinya.",
                            "verse 53:18": "Sesungguhnya dia telah melihat sebahagian tanda-tanda (kekuasaan) Tuhannya yang paling besar.",
                            "verse 53:19": "Maka apakah patut kamu (hai orang-orang musyrik) menganggap Al Lata dan Al Uzza,",
                            "verse 53:20": "dan Manah yang ketiga, yang paling terkemudian (sebagai anak perempuan Allah)?",
                            "verse 53:21": "Apakah (patut) untuk kamu (anak) laki-laki dan untuk Allah (anak) perempuan?",
                            "verse 53:22": "Yang demikian itu tentulah suatu pembagian yang tidak adil.",
                            "verse 53:23": "Itu tidak lain hanyalah nama-nama yang kamu dan bapak-bapak kamu mengada-adakannya; Allah tidak menurunkan suatu keteranganpun untuk (menyembah) nya.",
                            "verse 53:24": "Atau apakah manusia akan mendapat segala yang dicita-citakannya?",
                            "verse 53:25": "(Tidak), maka hanya bagi Allah kehidupan akhirat dan kehidupan dunia.",
                            "verse 53:26": "Dan berapa banyaknya malaikat di langit, syafa’at mereka sedikitpun tidak berguna kecuali sesudah Allah mengizinkan bagi orang yang dikehendaki dan diridhai (Nya).",
                            "verse 53:27": "Sesungguhnya orang-orang yang tiada beriman kepada kehidupan akhirat, mereka benar-benar menamakan malaikat itu dengan nama perempuan.",
                            "verse 53:28": "Dan mereka tidak mempunyai sesuatu pengetahuan pun tentang itu.",
                            "verse 53:29": "Maka berpalinglah (hai Muhammad) dari orang yang berpaling dari peringatan Kami, dan tidak mengingini kecuali kehidupan duniawi.",
                            "verse 53:30": "Itulah sejauh-jauh pengetahuan mereka.",
                            "verse 53:31": "Dan hanya kepunyaan Allah-lah apa yang ada di langit dan apa yang ada di bumi supaya Dia memberi balasan kepada orang-orang yang berbuat jahat terhadap apa yang telah mereka kerjakan dan memberi balasan kepada orang-orang yang berbuat baik dengan pahala yang lebih baik (surga).",
                            "verse 53:32": "(Yaitu) orang yang menjauhi dosa-dosa besar dan perbuatan keji yang selain dari kesalahan-kesalahan kecil.",
                            "verse 53:33": "Maka apakah kamu melihat orang yang berpaling (dari Al Qur'an)?,",
                            "verse 53:34": "serta memberi sedikit dan tidak mau memberi lagi?",
                            "verse 53:35": "Apakah dia mempunyai pengetahuan tentang yang gaib sehingga dia mengetahui (apa yang dikatakan)?",
                            "verse 53:36": "Ataukah belum diberitakan kepadanya apa yang ada dalam lembaran-lembaran Musa?,",
                            "verse 53:37": "dan lembaran-lembaran Ibrahim yang selalu menyempurnakan janji?,",
                            "verse 53:38": "(yaitu) bahwasanya seorang yang berdosa tidak akan memikul dosa orang lain,",
                            "verse 53:39": "dan bahwasanya seorang manusia tiada memperoleh selain apa yang telah diusahakannya.",
                            "verse 53:40": "Dan bahwasanya usahanya itu kelak akan diperlihatkan (kepadanya).",
                            "verse 53:41": "Kemudian akan diberi balasan kepadanya dengan balasan yang paling sempurna,",
                            "verse 53:42": "dan bahwasanya kepada Tuhanmulah kesudahan (segala sesuatu),",
                            "verse 53:43": "dan bahwasanya Dialah yang menjadikan orang tertawa dan menangis,",
                            "verse 53:44": "dan bahwasanya Dialah yang mematikan dan menghidupkan,",
                            "verse 53:45": "dan bahwasanya Dialah yang menciptakan berpasang-pasangan laki-laki dan perempuan,",
                            "verse 53:46": "dari air mani, apabila dipancarkan.",
                            "verse 53:47": "Dan bahwasanya Dia-lah yang menetapkan kejadian yang lain (kebangkitan sesudah mati),",
                            "verse 53:48": "dan bahwasanya Dia yang memberikan kekayaan dan memberikan kecukupan.",
                            "verse 53:49": "dan bahwasanya Dia-lah Tuhan (yang memiliki) bintang syi`ra,",
                            "verse 53:50": "dan bahwasanya Dia telah membinasakan kaum ’Aad yang pertama,",
                            "verse 53:51": "dan kaum Tsamud.",
                            "verse 53:52": "Dan kaum Nuh sebelum itu.",
                            "verse 53:53": "dan negeri-negeri kaum Lut yang telah dihancurkan Allah,",
                            "verse 53:54": "lalu Allah menimpakan atas negeri itu azab besar yang menimpanya.",
                            "verse 53:55": "Maka terhadap nikmat Tuhanmu yang manakah kamu ragu-ragu?",
                            "verse 53:56": "Ini (Muhammad) adalah seorang pemberi peringatan di antara pemberi-pemberi peringatan yang telah terdahulu.",
                            "verse 53:57": "Telah dekat terjadinya hari kiamat.",
                            "verse 53:58": "Tidak ada yang akan menyatakan terjadinya hari itu selain Allah.",
                            "verse 53:59": "Maka apakah kamu merasa heran terhadap pemberitaan ini?",
                            "verse 53:60": "Dan kamu mentertawakan dan tidak menangis?",
                            "verse 53:61": "Sedang kamu melengahkan (nya)?",
                            "verse 53:62": "Maka bersujudlah kepada Allah dan sembahlah (Dia)."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Per la stella quando tramonta.",
                            "verse 53:2": "Il vostro compagno non è traviato, non è in errore;",
                            "verse 53:3": "e neppure parla d'impulso:",
                            "verse 53:4": "non è che una Rivelazione ispirata.",
                            "verse 53:5": "Gliel'ha insegnata un fortissimo ,",
                            "verse 53:6": "di saggezza dotato, che compostamente comparve:",
                            "verse 53:7": "[si trovava] all'orizzonte più elevato ,",
                            "verse 53:8": "poi s'avvicinò scendendo ancora più in basso ,",
                            "verse 53:9": "",
                            "verse 53:10": "fu alla distanza di due archi o meno.",
                            "verse 53:11": "Rivelò al Suo servo quello che rivelò.",
                            "verse 53:12": "Il cuore non mentì su quel che vide.",
                            "verse 53:13": "Vorreste dunque polemizzare su quel che vide?",
                            "verse 53:14": "E invero lo vide in un'altra discesa ,",
                            "verse 53:15": "vicino al Loto del limite ,",
                            "verse 53:16": "presso il quale c'è il Giardino di Ma'wa ,",
                            "verse 53:17": "nel momento in cui il Loto era coperto da quel che lo copriva .",
                            "verse 53:18": "Non distolse lo sguardo e non andò oltre.",
                            "verse 53:19": "Vide davvero i segni più grandi del suo Signore.",
                            "verse 53:20": "Cosa ne dite di al-Lât e al-'Uzzâ ,",
                            "verse 53:21": "e di Manât, la terza ?",
                            "verse 53:22": "Avrete voi il maschio e Lui la femmina ?",
                            "verse 53:23": "Che ingiusta spartizione!",
                            "verse 53:24": "Non sono altro che nomi menzionati da voi e dai vostri antenati, a proposito dei quali Allah non fece scendere nessuna autorità.",
                            "verse 53:25": "L'uomo otterrà forse tutto quel che desidera?",
                            "verse 53:26": "Appartengono ad Allah l'altra vita e questa vita.",
                            "verse 53:27": "Quanti angeli nel cielo, la cui intercessione sarà vana finché Allah non l'abbia permessa, e in favore di chi Egli voglia e di chi Gli aggrada.",
                            "verse 53:28": "Invero quelli che non credono nell'altra vita danno agli angeli nomi femminili,",
                            "verse 53:29": "mentre non posseggono alcuna scienza: si abbandonano alle congetture, ma la congettura non può nulla contro la verità .",
                            "verse 53:30": "Dunque non ti curare di chi volge le spalle al Nostro monito e non brama che la vita terrena.",
                            "verse 53:31": "Ecco tutta la portata della loro scienza: in verità il tuo Signore ben conosce chi si allontana dalla Sua via e conosce chi è ben diretto.",
                            "verse 53:32": "Appartiene ad Allah tutto quello che c'è nei cieli e tutto quello che c'è sulla terra, sì che compensi coloro che agiscono male per ciò che avranno fatto e compensi coloro che agiscono bene con quanto ci sia di più bello.",
                            "verse 53:33": "Essi sono coloro che evitano i peccati più gravi e le perversità e non commettono che le colpe più lievi.",
                            "verse 53:34": "temono.",
                            "verse 53:35": "Hai visto colui che ti volge le spalle,",
                            "verse 53:36": "che dà poco e poi smette [di dare]?",
                            "verse 53:37": "Possiede conoscenza dell'invisibile e riesce a vederlo?",
                            "verse 53:38": "Non è stato informato di quello che contengono i fogli di Mosè",
                            "verse 53:39": "e quelli di Abramo, uomo fedele ?",
                            "verse 53:40": "Che nessuno porterà il fardello di un altro,",
                            "verse 53:41": "e che invero, l'uomo non ottiene che il [frutto dei] suoi sforzi ;",
                            "verse 53:42": "e che il suo sforzo gli sarà presentato [nel Giorno del Giudizio]",
                            "verse 53:43": "e gli sarà dato pieno compenso,",
                            "verse 53:44": "e che in verità tutto conduce verso il tuo Signore,",
                            "verse 53:45": "e che Egli è Colui che fa ridere e fa piangere,",
                            "verse 53:46": "e che Egli è Colui che dà la vita e dà la morte,",
                            "verse 53:47": "e che Egli è Colui che ha creato i due generi, il maschio e la femmina,",
                            "verse 53:48": "da una goccia di sperma quand'è eiaculata,",
                            "verse 53:49": "e che a Lui incombe l'altra creazione ,",
                            "verse 53:50": "e che invero è Lui che arricchisce e provvede,",
                            "verse 53:51": "e che è Lui il Signore di Sirio ,",
                            "verse 53:52": "e che Lui annientò gli antichi 'Âd,",
                            "verse 53:53": "e i Thamûd, sì che non ne rimase nessuno,",
                            "verse 53:54": "come già",
                            "verse 53:55": "alla gente di Noè, che era ancora più ingiusta e più ribelle,",
                            "verse 53:56": "e come già annientò le",
                            "verse 53:57": "sovvertite :",
                            "verse 53:58": "e fece sì che le ricoprisse quel che le ricoprì!",
                            "verse 53:59": "Quale dunque dei favori del tuo Signore vorrai mettere in dubbio?",
                            "verse 53:60": "Questo è un Monito tra gli antichi moniti .",
                            "verse 53:61": "L'Imminente s'avvicina ,",
                            "verse 53:62": "nessuno, all'infuori di Allah, può svelarla !",
                            "verse 53:63": "Ma come, vi stupite di questo discorso?",
                            "verse 53:64": "Ne riderete invece che piangerne o",
                            "verse 53:65": "rimarrete indifferenti?",
                            "verse 53:66": "Dunque prosternatevi davanti ad Allah e adorate !"
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "沈みゆく星にかけて（誓う）。",
                            "verse 53:2": "あなたがたの同僚は，迷っているのではなく，また間違っているのでもない。",
                            "verse 53:3": "また（自分の）望むことを言っているのでもない。",
                            "verse 53:4": "それはかれに啓示された，御告げに外ならない。",
                            "verse 53:5": "ならびない偉力の持主が，かれに教えたのは，",
                            "verse 53:6": "優れた知力の持主である。真っ直ぐに立って，",
                            "verse 53:7": "かれは地平の最も高い所に現われた。",
                            "verse 53:8": "それから降りて来て，近付いた。",
                            "verse 53:9": "凡そ� 2つ，いやそれよりも近い距離であったか。た。",
                            "verse 53:10": "そしてしもべ（ムハンマド）に，かれの啓示を告げた。",
                            "verse 53:11": "心は自分が見たことを偽らない。",
                            "verse 53:12": "かれの見たことに就いて，あなたがたはかれと論争するのか。",
                            "verse 53:13": "本当にかれ（ムハンマド）は，再度の降下においても，かれ（ジブリール）を見たのである。",
                            "verse 53:14": "（誰も越せない）涯にある，スィドラ木の傍で。",
                            "verse 53:15": "そのそばに終の住まいの楽園がある。",
                            "verse 53:16": "覆うものがスィドラ木をこんもりと覆う時。",
                            "verse 53:17": "（かれの）視線は吸い寄せられ，また（不躾に）度を過ごすこともない。",
                            "verse 53:18": "かれは確かに，主の最大の印を見たのである。",
                            "verse 53:19": "あなたがたは，アッラートとウッザーを（何であると）考えるか。",
                            "verse 53:20": "それから第3番目のマナートを。",
                            "verse 53:21": "あなたがたには男子があり，かれには女子があるというのか。",
                            "verse 53:22": "それでは，本当に不当な分け方であろう。",
                            "verse 53:23": "それらは，あなたがたや祖先たちが名付けた（只の）名前に過ぎない。アッラーは（どんな）権威をも，それらに下されなかった。かれら（不信心者）は，虚しい臆測や私� に従っているに過ぎない。既に主からの導きが，かれらに来ているのに。",
                            "verse 53:24": "凡そ人間には，欲しいものは何でも手にはいるのか。",
                            "verse 53:25": "いや，来世も現世も，アッラーの有である。",
                            "verse 53:26": "天に如何に天使がいても，アッラーが望まれ，その御喜びにあずかる者にたいする御許しがでた後でなければ，かれら（天使）の執り成しは何の役にも立たない。",
                            "verse 53:27": "本当に来世を信じない者は，天使に女性の名を付けたりする。",
                            "verse 53:28": "かれらは（何の）知識もなく，臆測に従うだけである。だが真理に対しては，臆測など何も役立つ訳はない。",
                            "verse 53:29": "それであなたはわれの訓戒に背を向ける者，またこの世の生活しか望まない者から遠ざかれ。",
                            "verse 53:30": "この程度（現世の生活）が，かれらの知識の届く限界である。本当に主は，道から迷っている者を最もよく知っておられる。またかれは，導きを受ける者を最もよく知っておられる。",
                            "verse 53:31": "本当に天にあり地にある凡てのものは，アッラーの有である。だから悪行の徒には相応しい報いを与えられ，また善行の徒には最善のもので報われる。",
                            "verse 53:32": "小さい誤ちは別として，大罪や破廉恥な行為を避ける者には，主の容赦は本当に広大である。かれは大地から創り出された時のあなたがたに就いて，また，あなたがたが母の胎内に潜んでいた時のあなたがたに就いて，最もよく知っておられる。だから，あなたがたは自分で清浄ぶってはならない。かれは主を畏れる者を最もよく知っておられる。",
                            "verse 53:33": "あなたは（真理から）背き去る者を見たか。",
                            "verse 53:34": "僅かに施しをしては，（物借みして）止める。",
                            "verse 53:35": "そういう者に幽玄界の知識があって，それで何でも見えるというのか。",
                            "verse 53:36": "それとも，ムーサーの書にあることが，告げられたことはないのか。",
                            "verse 53:37": "また（約束を）完全に果たしたイブラーヒームのことも。",
                            "verse 53:38": "重荷を負う者は，他人の重荷を負うことは出来ない。",
                            "verse 53:39": "人間は，その努力したもの以外，何も得ることは出来ない。",
                            "verse 53:40": "その努力（の成果）は，やがて認められるであろう。",
                            "verse 53:41": "やがて報奨は，十分に報いられる。",
                            "verse 53:42": "本当にあなたの主にこそ，帰着所はある。",
                            "verse 53:43": "かれこそは，笑わせ泣かせる御方。",
                            "verse 53:44": "また死なせ，生かす御方である。",
                            "verse 53:45": "本当にかれは，男と女の組み合わせを創られた。",
                            "verse 53:46": "それも精液を吹き込むことで。",
                            "verse 53:47": "また2度目の創造（の復活）も，かれの御心のままである。",
                            "verse 53:48": "かれこそは富ませ，また満ち足りさせる御方。",
                            "verse 53:49": "また狼星（シリウス）の主もこの御方。",
                            "verse 53:50": "かれは昔アード（の民）を滅ぼし。",
                            "verse 53:51": "またサムードも一人残さず滅ぼされた。",
                            "verse 53:52": "それ以前にヌーフの民も。本当にかれらは，酷い不義，不正の輩であった。",
                            "verse 53:53": "また（ソドムとゴモラのように）転覆された諸都市。",
                            "verse 53:54": "そしてかれはそれを覆い去られた。",
                            "verse 53:55": "（人びとよ，）一体主のどの御恵みに，あなたがたは異論を抱くのか。",
                            "verse 53:56": "これは，昔の警告者たちと同じ一人の警告者である。",
                            "verse 53:57": "（審判の時は）近くに迫って来ている。",
                            "verse 53:58": "それはアッラーの外何者も明らかにし得えない。",
                            "verse 53:59": "あなたがたはこの話を聞いて驚いているのか。",
                            "verse 53:60": "嘲笑はしても，泣かないのか。",
                            "verse 53:61": "あなたがたは，自惚の中で時を過ごすのか。",
                            "verse 53:62": "一途にアッラーにサジダし，（かれに）仕えなさい。〔サシダ〕 あなたがたは，自惚の中で時を過ごすのか。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "지는 별을 두고 맹세하사",
                            "verse 53:2": "너희의 동료는 방황하지도않고 유혹되지도 아니 했으며",
                            "verse 53:3": "그의 욕망을 말하고 있는 것도 아니라",
                            "verse 53:4": "그것은 그에게 내려진 계시라",
                            "verse 53:5": "그는 능력이 있으신 분으로부터 배웠노라",
                            "verse 53:6": "그는 지혜를 가지고 나타났으니",
                            "verse 53:7": "그는 지평선 가장 높은 곳에 있었노라",
                            "verse 53:8": "그런 후 그는 가까이 다가왔 으니",
                            "verse 53:9": "그 거리는 활 양쪽 끝 사이의길이 흑은 그보다 더 가까웠더라",
                            "verse 53:10": "그렇게 하여 하나님은 그의 종에게 전하고자 한 계시를 내렸 으매",
                            "verse 53:11": "그의 마음은 그가 본 것에대하여 거짓함이 없더라",
                            "verse 53:12": "그래도 너희는 그가 본 것헤 관하여 논쟁하고 있느뇨",
                            "verse 53:13": "실로 그는 다시 한번 그를 보았으니",
                            "verse 53:14": "마지막 시드라 나무옆에 있 었더라",
                            "verse 53:15": "그곳 가까이에는 영주할 천 국이 있으니",
                            "verse 53:16": "보라 시드라 나무가 가리워 지매",
                            "verse 53:17": "그의 시선은 흩어지지 아니 하고 한계를 넘지도 않더라",
                            "verse 53:18": "실로 그는 가장 위대한 하나님의 예증들을 보았노라",
                            "verse 53:19": "실로 너희는 라트와 웃자를 보았으며",
                            "verse 53:20": "세번째의 우상 마나트를 보 았느뇨",
                            "verse 53:21": "너희에게는 남자가 있고 하 나님에게는 여자가 있단 말이뇨",
                            "verse 53:22": "실로 이것은 가장 공평치 못한 분배라",
                            "verse 53:23": "실로 이것들은 너희와 너희 선조들이 고안했던 이름들에 불과하며 하나님은 그것들에게 아무 런 능력도 부여하지 아니 했나니 그들은 이미 주님으로부터 복음 의 소식을 들었음에도 불구하고 억측과 자신들의 저속한 욕망을 따를 뿐이라",
                            "verse 53:24": "인간은 그가 원하는 것만을 가지려 하느뇨",
                            "verse 53:25": "그러나 만물의 종말과 시작 은 하나님 안에 있노라",
                            "verse 53:26": "하늘에는 많은 천사들이 있 으되 그들의 중재는 하나님이 선 택한 자에게 그분의 허락이 있는 이후가 아니고는 유용하지 못하노라",
                            "verse 53:27": "내세를 믿지 아니한 자들은 천사들을 여성이라 부르니",
                            "verse 53:28": "그들은 알지 못함이라 그들 은 억측만을 따를 뿐이라 실로 억측은 진리에 대하여 아무것도 유 효하지 않노라",
                            "verse 53:29": "하나님의 메세지를 외면하는자 그대도 그들을 외면하라 그들 은 현세만을 추구할 뿐이라",
                            "verse 53:30": "그것은 그들이 알고 있는 것이라 실로 주님은 그분의 길에서 벗어난 자들을 아시고 계시며 또 한 복음을 받은 그들도 알고 계시니라",
                            "verse 53:31": "하늘과 대지에 있는 모든 것이 하나님 안에 있어 사악함을 퍼뜨리는 자 그의 행위에 따라 벌을내릴 것이요 선을 실천하는 자 가장 좋은 것으로 보상할 것이라",
                            "verse 53:32": "큰 죄악과 수치스러운 행위 를 피하려 하는 자가 작은 실수 를 하였을 때 실로 주님은 충분 히 관용을 베푸시니라 하나님은 흙에서 창조한 너희를 아시며 또 한 너희 어머니 태내에 있을 때의너희도 아시나니 너희 스스로가 완전한 것이라 정당화 하지 말라 그분은 사악으로부터 경외하는 자를 알고 계시니라",
                            "verse 53:33": "외면하는 자를 그대는 보았 느뇨",
                            "verse 53:34": "조금 주면서 아까워 하는 자라",
                            "verse 53:35": "보이지 않는 것에 대한 지식이라도 갖고 있어 그가 볼 수 있 단 말이뇨",
                            "verse 53:36": "아니면 그가 모세의 성서속 에 있는 것들을 알지 못하고",
                            "verse 53:37": "명령을 이행한 아브라함 에 관한 이야기도 알지 못하였단 말이뇨",
                            "verse 53:38": "짐진자가 다른 사람의 짐을 질 수 없으며",
                            "verse 53:39": "그가 노력하여 얻은 것 외에는 아무 것도 없노라",
                            "verse 53:40": "그의 노력의 결과는 곧 밝혀지고",
                            "verse 53:41": "그는 완전한 보상을 받게 되니",
                            "verse 53:42": "최후의 목적지가 그대 주님 이라",
                            "verse 53:43": "하나님은 인간으로 하여금 웃게도 하시고 울게도 하시며",
                            "verse 53:44": "생명을 앗아가기도 하고 생 명을 주시기도 하니라",
                            "verse 53:45": "자웅으로 남성과 여성을 창 조하사",
                            "verse 53:46": "보존된 정액으로 부터라",
                            "verse 53:47": "하나님은 제이의 창조를 약 속하사",
                            "verse 53:48": "부와 기쁨을 주시는 분이시 며",
                            "verse 53:49": "하나님은 시리우스 별의 주 님이시라",
                            "verse 53:50": "하나님은 힘센 옛 아드의 백성을 멸망케 하고",
                            "verse 53:51": "사무드 백성도 그렇게 하여 아무것도 남지 않게 하였으며",
                            "verse 53:52": "그들 이전의 사악하고 오만 했던 노아의 백성도 그렇게 하였 노라",
                            "verse 53:53": "하나님은 롯의 고을들도 전 복시켜",
                            "verse 53:54": "응벌로서 그들을 감싸 버렸 으되",
                            "verse 53:55": "그래도 너희는 주님의 은헤 에 관하여 논쟁하느뇨",
                            "verse 53:56": "이는 옛 경고자들에 뒤이어 온 경고자라",
                            "verse 53:57": "때가 다가오고 있으되",
                            "verse 53:58": "하나님 외에는 어느 누구도 그것을 제지하지 못하리라",
                            "verse 53:59": "그래도 너희는 이것 에 대하여 조롱하고 있느뇨",
                            "verse 53:60": "웃되 울지 아니하고",
                            "verse 53:61": "시간을 헛되이 보내려 하느 뇨",
                            "verse 53:62": "하나님께 부복하고 그분 만 을 경배하라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "سوێند به‌ئه‌ستێره کاتێک له‌شوێنی خۆی ده‌ترازێت و به‌خێرایی به‌رده‌بێته‌وه و ئاوا دبێت",
                            "verse 53:2": "هاوه‌ڵ وهاوڕێی ئێوه محمد (صلی الله علیه وسلم) گومڕاو سه‌رلێشێواو نه‌بووه‌، له‌رێگه‌ی ڕاست و ڕه‌وان نه‌ترازاوه‌",
                            "verse 53:3": "قسه‌و گوفتاریشی (ئه‌وه‌ی که‌قورئانه‌) له‌ئاره‌زوو بازی و هه‌واو هه‌وه‌سه‌وه‌نیه‌",
                            "verse 53:4": "ئه‌مه‌ی که‌رای ده‌گه‌یه‌نێت ته‌نها نیگاو وه‌حی خوای یه‌",
                            "verse 53:5": "جوبره‌ئیلی فریشته خاوه‌نی هێزو توانای زۆر، قورئانی فێر کردووه‌",
                            "verse 53:6": "ئه‌و جوبره‌ئیله‌ی که‌خاوه‌نی بیرو هۆشێکی زۆر به‌هێزو دیمه‌نێکی جوان بوو، ئینجا له‌سه‌ر شێوه ڕاسته‌قینه‌که‌ی خۆی وه‌ستا",
                            "verse 53:7": "له‌کاتێکدا له‌ئاسۆی هه‌ره‌به‌رزو بڵنده‌وه سه‌ری هه‌ڵدابوو، ئاسۆی پڕکردبوو",
                            "verse 53:8": "له‌وه‌ودوا تا ده‌هات نزیک ده‌بۆوه و سه‌ره‌نجام هاته‌خواره‌وه‌بۆ لای پێغه‌مبه‌ر (صلی الله علیه وسلم)",
                            "verse 53:9": "ئه‌وه‌نده‌لێی نزیک بۆوه نێوانیان به‌قه‌ده‌ر دووکه‌وان یان که‌متریش بوو",
                            "verse 53:10": "ئینجا خوا له‌ڕێگه‌ی ئه‌وه‌وه‌، نیگای کرد بۆ به‌نده‌ی خۆی، ئای چ نیگایه‌ک بوو!",
                            "verse 53:11": "ئه‌وسا ئه‌وه‌ی که‌به‌چاوی سه‌ری بینی، له‌ناخ و ده‌رونیه‌وه بڕوای پێی هه‌بوو، ناخ و ده‌روونی ڕاستیه‌کانی به‌درۆنه‌دانی",
                            "verse 53:12": "جا ئایا ڕاسته‌؟ ئێوه موجاده‌له‌ی له‌گه‌ڵدا ده‌که‌ن له‌سه‌ر شتێک که‌ئه‌و دڵنیایه له‌دیتنی؟",
                            "verse 53:13": "سوێند به‌خوا بێگومان جارێکی تریش له‌دابه‌زینێکی تردا جوبره‌ئیلی بینیووه (کاتێک هاتووه‌بیبات بۆ شه‌وڕه‌وی)",
                            "verse 53:14": "له‌کاتێکدا له (سدر‌ه‌المنتهی) دا بوو",
                            "verse 53:15": "که‌له‌وێدا به‌هه‌شتی (مَڕْوَى) هه‌یه به‌واتای لانه‌و جێگه‌ی حه‌وانه‌وه‌",
                            "verse 53:16": "کاتێک ئه‌وه‌ی _ سدره‌_ ی داپۆشی مه‌گه‌ر هه‌ر خوا خۆی بزانێت کێن و چین و کاریان چیه.",
                            "verse 53:17": "جا بینینی ئه‌و به‌دیهێنراوانه له‌و شه‌وه‌دا وه‌نه‌بێت چاوبه‌ست له‌پێغه‌مبه‌ر کرابێت و چاوی لێ لادا بێت",
                            "verse 53:18": "بێگومان پێغه‌مبه‌ر (چلی الله علیه وسلم) له‌و شه‌وه‌دا له‌به‌ڵگه و نیشانه و موعجیزه گه‌وره‌کانی په‌روه‌ردگاری بینیووه‌، به‌چاوی سه‌ری، به‌هه‌موو هه‌ستی.",
                            "verse 53:19": "جا هه‌واڵم بده‌نێ ده‌رباره‌ی لات و عوززا و (دوودانه‌بتی ناشرین و ئێسک تاڵی دروستکراو)!",
                            "verse 53:20": "مه‌ناتی سێهه‌میش!! (ئه‌ویش بتێکی تره‌، ئایا ده‌سه‌ڵاتیان هه‌یه‌).",
                            "verse 53:21": "ئایا ڕه‌وایه کوڕان بۆ خۆتان و کچان بۆ خوا به‌چاک بزانن (خوای گه‌وره‌ده‌یه‌وێت به‌عه‌قڵی چه‌وتیان ڕه‌خنه‌یان لێبگرێت، ئه‌گینا کوڕو کچ هه‌ردووک دروستکراوی خوان و پێوه‌ی ڕێز ته‌نها خواناسی و پارێزکاریه‌)",
                            "verse 53:22": "ئه‌گه‌ر وابێت ئه‌و کاته‌ئه‌و دابه‌شکردن و بڕیاره‌تان زۆر دووره‌له‌دادپه‌روه‌ریه‌وه و له‌سنوور ترازانه‌",
                            "verse 53:23": "ئه‌م بت و په‌یکه‌رانه ته‌نها شتێکه که‌خۆتان و باوو باپیرانتان ناوتان لێ ناون و هیچی تر نین، خوا به‌ڵگه‌یه‌کی نه‌ناردووه‌له‌سه‌ر ڕه‌وا بوونیان، سه‌یره‌، ئه‌وانه‌ته‌نها شوێنی گومان و ئاره‌زوی ده‌روونه‌نه‌خۆشیه‌کانیان ده‌که‌ون، له‌کاتێکدا که‌به‌ڕاستی له‌لایه‌ن په‌روه‌ردگاریانه‌وه هیدایه‌ت و ڕێنمووییان پێ گه‌یشتووه!",
                            "verse 53:24": "نه‌خێر بۆ ئاده‌میزاد نی یه ئه‌وه‌ی داوای ده‌کات، (چونکه‌ئاواته‌کانی نایه‌ته دی له‌دنیادا)؟!",
                            "verse 53:25": "که‌واته‌هه‌ر خوایه خاوه‌نی دنیا وقیامه‌ت.",
                            "verse 53:26": "زۆر فریشته‌ش له‌ئاسمانه‌کاندا هه‌ن که‌تکاو پاڕانه‌وه‌یان ناکام و بێ سووده‌، مه‌گه‌ر خوا مۆڵه‌ت بدات بۆ هه‌رکه‌سێک که‌شایسته‌یه و ڕازی بێت که‌تا بکات، یان تکای بۆ بکرێت",
                            "verse 53:27": "بێگومان ئه‌وانه‌ی که‌باوه‌ڕ به‌قیامه‌ت و لێپرسینه‌وه ناهێنن ناوی ئافره‌ت ده‌نێن له‌فریشته‌کان، (له‌حاڵێکدا فریشته‌کان دروستکراوانێکی تایبه‌تن)",
                            "verse 53:28": "ئه‌وانه‌له‌و باره‌یه‌وه هیچ جۆره زانستی و زانیاریه‌کیان نیه‌، به‌ڵکو هه‌ر شوێنی گومانی بێ سه‌رو بن ده‌که‌ون، له‌کاتێکدا که‌گومان به‌هیچ شێوه‌یه‌ک جێگه‌ی حه‌ق و ڕاستی ناگرێته‌وه‌",
                            "verse 53:29": "گوێ مه‌ده‌به‌و که‌سه‌ی که‌یاخی بووه‌له‌یادو به‌رنامه‌ی ئێمه مه‌به‌ستیشی نه‌بووه‌ته‌نها ژیانی دنیایه نه‌بێت",
                            "verse 53:30": "ئه‌وانه‌، هه‌ر ئه‌وه‌نده‌ی لێ ده‌زانن و عه‌قلیان هه‌ر ئه‌وه‌نده‌ده‌بڕێت، به‌ڕاستی هه‌ر په‌روه‌ردگاری تۆیه که‌چاک ده‌زانێت کێ له‌رێبازه‌که‌ی لایداوه و گومڕایه کێیش ڕێبازی ئیمان و هیدایه‌تی گرتۆته‌به‌ر و شایسته‌ی ڕێزه‌",
                            "verse 53:31": "هه‌رچی له‌ئاسمانه‌کان و زه‌ویدا هه‌یه هه‌ر خوا خاوه‌نیه‌تی، (تاقیتان ده‌کاته‌وه‌) بۆ ئه‌وه‌ی تۆڵه‌بسێنێت له‌وانه‌ی که‌خراپه‌یان کردووه‌به‌گوێره‌ی کرده‌وه‌کانیان، پاداشتی ئه‌وانه‌ش که‌چاکه‌یان کردووه‌به‌چاکترین شێوه بداته‌وه‌",
                            "verse 53:32": "ئه‌وانه‌ی که‌خۆیان ده‌پارێزن له‌گوناهو تاوانه‌گه‌وره‌کان له‌گوفتارو کرداری به‌د جگه‌له‌ورده‌گوناهان، به‌ڕاستی په‌روه‌ردگاری تۆ ئه‌ی پێغنمبه‌ر (چلی الله علیه وسلم) ئه‌ی ئیماندار چاوپۆشی زۆر فراوانه‌، چاک ده‌تانناسێت، له‌کاتێکدا ئێوه‌ی له‌زه‌ویدا به‌رپاکردووه‌، له‌و کاته‌شدا ئێوه کۆرپه‌له‌ی بچووک بوون له‌سکی دایکتاندا (ئاگای لێتان بوو)، که‌واته‌خۆتان به‌چاک مه‌زانن و خۆتان به‌پاڵفته دامه‌نێن، هه‌ر خوا ده‌زانێت کێ ته‌قای هه‌یه و پارێزکاره‌",
                            "verse 53:33": "جا هه‌واڵم بده‌رێ ئایا ئه‌وه‌ی پشتی له‌باوه‌ڕ هه‌لکرد.",
                            "verse 53:34": "که‌مێکیشی به‌خشی و خێرا ده‌ستی گرته‌وه‌.",
                            "verse 53:35": "ئایا ئه‌و جۆره که‌سانه‌زانستی و نهێنی ده‌زانن و ئاگاداری شاراوه‌کانن و ده‌یبینن؟!",
                            "verse 53:36": "ئایا ئاگادار نه‌کرابوو به‌وه‌ی له‌په‌ڕاوه‌کانی موسادا بوو؟!",
                            "verse 53:37": "یان ئه‌و ئیبراهیمه‌ی که‌هه‌موو په‌یمانه‌کانی به‌جێ هێنا به‌ته‌واوی؟!",
                            "verse 53:38": "(له‌و په‌ڕاوو کتێبه پیرۆزانه‌دا هاتووه‌): که‌هیچ گوناهبارێک گوناهی تاوانبارێکی تر هه‌ڵناگرێت",
                            "verse 53:39": "به‌ڕاستی ئاده‌میزاد خاوه‌نی هیچ شتێک نی یه ئه‌وه‌ته‌نها ئه‌وه‌نه‌بێت که‌خۆی کردوویه‌تی",
                            "verse 53:40": "بێگومان هه‌وڵ و کۆششه‌که‌ی ده‌بینرێته‌وه له‌قیامه‌تدا",
                            "verse 53:41": "پاشان پاداشت ده‌درێته‌وه به‌تێرو ته‌سه‌لی",
                            "verse 53:42": "به‌ڕاستی و دڵنیاییه‌وه ده‌ڵێین: که‌کۆتایی ئه‌م ڕێگوزه‌ره له‌لای په‌روه‌ردگارته‌وه‌سه‌رهه‌ڵ ده‌دات",
                            "verse 53:43": "بێگومان هه‌ر ئه‌و زاته‌ش دیارده‌ی پێکه‌نین و گریانی له‌ئاده‌میزادا به‌دیهێناوه‌",
                            "verse 53:44": "هه‌روه‌ها هه‌ر خۆی دیارده‌ی مردن و ژیانی دروست کردووه‌",
                            "verse 53:45": "هه‌ر ئه‌و زاته‌ش دوو جۆری دروست کردووه‌که‌نێرو مێیه.",
                            "verse 53:46": "له‌نوتفه‌یه‌ک (له‌خاڵێکی زۆر بچووک ئه‌ویش ئه‌گه‌ر ویستی خوای له‌سه‌ربێت) کاتێک له‌جێی خۆیدا داده‌نرێت",
                            "verse 53:47": "بێگومان له‌سه‌ر خوایشه دروست کردنه‌وه‌ی تریش",
                            "verse 53:48": "ده‌وڵه‌مه‌ندی و ئه‌وه‌ی پێویست بێت ده‌یبه‌خشێت",
                            "verse 53:49": "هه‌ر خوایش په‌روه‌ردگاری شیعرایه‌: (ئه‌ستێره‌یه‌که هه‌ندێ له‌عه‌ره‌به‌کان په‌رستویانه‌، قه‌باره‌که‌ی ده‌، ئه‌وه‌نده‌ی خۆره‌، یه‌ک ملیۆن ئه‌وه‌نده‌ی نێوان زه‌وی و خۆر لێمانه‌ووه دووره‌.",
                            "verse 53:50": "هه‌ر ئه‌و زاته‌ش قه‌ومی عادی یه‌که‌می له‌ناو برد",
                            "verse 53:51": "سمودیشی له‌ناو برد و هیچی نه‌هێشتن",
                            "verse 53:52": "زووتریش قه‌ومی نوحی له‌ناو برد که‌بێگومان ئه‌وانیش سته‌مکارو سه‌رکه‌شتر بوون",
                            "verse 53:53": "هه‌ر ئه‌و زاته‌تاوانباران و شه‌رواڵ پیسانیشی ژێره‌و ژوورکرد.",
                            "verse 53:54": "ئینجا ئه‌و دێهاتانه‌ی داپۆشی ئه‌وه‌ی که‌دای پۆشی.",
                            "verse 53:55": "جا ئیتر ئه‌ی بێ ئیمان تۆ له‌کام یه‌ک له‌نازو نیعمه‌ته‌کانی خوا دوودڵیت.",
                            "verse 53:56": "ئه‌م پێغه‌مبه‌ره‌ش هۆشیارکه‌ره‌وه‌یه له‌هۆشیارکه‌ره‌وانی پێشوو",
                            "verse 53:57": "(ئه‌وه‌چاک بزانن) قیامه‌ت و لێپرسینه‌وه نزیک بووته‌وه (نزیکه به‌نیسبه‌ت هه‌ر ئاده‌میزادێکه‌وه هه‌ر که‌مردن ئه‌وه‌قیامه‌ت له‌و به‌رپا بووه‌، قیامه‌تی گه‌وره‌ش کاتێک به‌رپا ده‌بێت هه‌مووان واهه‌ست ده‌که‌ن که‌چه‌ند سه‌عات له‌وه‌وپێش دنیا بوو وا ئێسته‌ش قیامه‌ته‌)!!",
                            "verse 53:58": "که‌سیش ناتونێت ئه‌و ڕۆژه ده‌ربخات و به‌رپای بکات جگه‌له‌خوای باڵاده‌ست",
                            "verse 53:59": "جا ئایا ئێوه له‌م قسه‌یه که‌قورئانه‌سه‌رسام ده‌بن؟!",
                            "verse 53:60": "پێ ده‌که‌نن و گریانتان نایه‌ت (بۆ ئه‌و چاره‌نووسه‌ره‌شه‌ی که‌چاوه‌ڕێتانه‌)",
                            "verse 53:61": "ئێوه به‌رده‌وام سه‌رگه‌رمی ڕابوردنن و بێ هۆشن؟!",
                            "verse 53:62": "(ده‌ی که‌واته‌بێداربنه‌وه و داچڵه‌کێن) که‌واته‌سوژده‌بۆ خوای به‌دیهێنه‌ر ببه‌ن، هه‌ر ئه‌ویش بپه‌رستن هۆشن؟!"
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Demi bintang semasa ia menjunam,",
                            "verse 53:2": "Rakan kamu (Nabi Muhammad yang kamu tuduh dengan berbagai tuduhan itu), tidaklah dia menyeleweng (dari jalan yang benar) dan dia pula tidak sesat (dengan kepercayaan yang salah).",
                            "verse 53:3": "Dan dia tidak memperkatakan (sesuatu yang berhubung dengan agama Islam) menurut kemahuan dan pendapatnya sendiri.",
                            "verse 53:4": "Segala yang diperkatakannya itu (samada Al-Quran atau hadis) tidak lain hanyalah wahyu yang diwahyukan kepadanya.",
                            "verse 53:5": "Wahyu itu (disampaikan dan) diajarkan kepadanya oleh (malaikat jibril) yang amat kuat gagah,",
                            "verse 53:6": "Lagi yang mempunyai kebijaksanaan; kemudian dia memperlihatkan dirinya (kepada Nabi Muhammad) dengan rupanya asal,",
                            "verse 53:7": "Sedang dia berada di arah yang tinggi (di langit);",
                            "verse 53:8": "Kemudian dia mendekatkan dirinya (kepada Nabi Muhammad), lalu dia berjuntai sedikit demi sedikit,",
                            "verse 53:9": "Sehingga menjadilah jarak (di antaranya dengan Nabi Muhammad) sekadar dua hujung busaran panah atau lebih dekat lagi;",
                            "verse 53:10": "Lalu Allah wahyukan kepada hambaNya (Muhammad, dengan perantaraan malaikat Jibril) apa yang telah diwahyukanNya.",
                            "verse 53:11": "Hati (Nabi Muhammad) tidak mendustakan apa yang dilihatnya.",
                            "verse 53:12": "Jika demikian, patutkah kamu hendak membantahnya mengenai apa yang telah dilihatnya itu?",
                            "verse 53:13": "Dan demi sesungguhnya! (Nabi Muhammad) telah melihat (malaikat Jibril, dalam bentuk rupanya yang asal) sekali lagi,",
                            "verse 53:14": "Di sisi \"Sidratul-Muntaha\";",
                            "verse 53:15": "Yang di sisinya terletak Syurga \"Jannatul-Makwa\".",
                            "verse 53:16": "(Nabi Muhammad melihat jibril dalam bentuk rupanya yang asal pada kali ini ialah) semasa \"Sidratul Muntaha\" itu diliputi oleh makhluk-makhluk dari alam-alam ghaib, yang tidak terhingga.",
                            "verse 53:17": "Penglihatan (Nabi Muhammad) tidak berkisar daripada menyaksikan dengan tepat (akan pemandangan yang indah di situ yang diizinkan melihatnya) dan tidak pula melampaui batas.",
                            "verse 53:18": "Demi sesungguhnya, dia telah melihat sebahagian dari sebesar-besar tanda-tanda (yang membuktikan luasnya pemerintahan dan kekuasaan) Tuhannya.",
                            "verse 53:19": "(Setelah kamu wahai kaum musyrik Mekah mendengar keterangan yang membuktikan kekuasaan dan keagungan Allah) maka adakah kamu nampak bahawa \"Al-Laat\" dan \"Al-Uzza\";",
                            "verse 53:20": "Serta \"Manaat\" yang ketiga, yang bertaraf rendah lagi hina itu (layak disembah dan dianggap sebagai anak-anak perempuan Allah)?",
                            "verse 53:21": "Patutkah kamu membahagi untuk diri kamu sendiri anak lelaki (yang kamu sukai), dan untuk Allah anak perempuan (yang kamu benci)?",
                            "verse 53:22": "Pembahagian yang demikian, sudah tentu suatu pembahagian yang tidak adil.",
                            "verse 53:23": "Benda-benda yang kamu sembah itu tidak lain hanyalah nama-nama yang kamu dan datuk nenek kamu menamakannya.",
                            "verse 53:24": "Adakah manusia tetap akan dapat mencapai segala yang dicita-citakannya? (Tidak!).",
                            "verse 53:25": "Kerana Allah jualah yang menguasai segala urusan akhirat dan urusan dunia.",
                            "verse 53:26": "(Golongan yang musyrik mengharapkan pertolongan benda-benda yang mereka sembah itu) padahal berapa banyak malaikat di langit, syafaat mereka tidak dapat mendatangkan sebarang faedah, kecuali sesudah Allah mengizinkan bagi sesiapa yang dikehendakiNya dan diredhaiNya.",
                            "verse 53:27": "Sesungguhnya orang-orang yang tidak beriman kepada hari akhirat sahajalah, yang tergamak menamakan malaikat itu dengan nama perempuan,",
                            "verse 53:28": "Sedang mereka tidak mempunyai sebarang pengetahuan mengenainya.",
                            "verse 53:29": "Oleh itu, janganlah engkau (wahai Muhammad) hiraukan orang yang berpaling dari pengajaran Kami dan tidak mahu melainkan kehidupan dunia semata-mata.",
                            "verse 53:30": "(Kepentingan dunia) itulah sahaja tujuan terakhir dari pengetahuan yang dicapai oleh mereka.",
                            "verse 53:31": "Dan Allah jualah yang memiliki segala yang ada di langit dan yang ada di bumi; (diciptakan semuanya itu) untuk membalas orang-orang yang berbuat jahat menurut apa yang mereka lakukan dan membalas orang-orang yang berbuat baik dengan balasan yang sebaik-baiknya.",
                            "verse 53:32": "(Iaitu) orang-orang yang menjauhi dosa-dosa besar serta perbuatan-perbuatan yang keji, kecuali salah silap yang kecil-kecil (yang mereka terlanjur melakukannya, maka itu dimaafkan).",
                            "verse 53:33": "Adakah engkau mengetahui (keburukan) orang yang berpaling (dari menurut kebenaran kerana dia dihasut)?",
                            "verse 53:34": "Dan setelah dia memberi sedikit pemberiannya, dia memutuskannya (kerana menurut hawa nafsunya)?",
                            "verse 53:35": "Adakah dia mempunyai pengetahuan mengenai perkara yang ghaib sehingga dia dapat mengetahui (bahawa orang lain boleh menghalang gantinya dari apa yang akan menimpanya pada hari akhirat)?",
                            "verse 53:36": "Atau belumkah dia diberitahu akan apa yang terkandung dalam Kitab-kitab Nabi Musa;",
                            "verse 53:37": "Dan juga (dalam Kitab-kitab) Nabi Ibrahim yang memenuhi dengan sempurnanya (segala yang diperintahkan kepadanya)?",
                            "verse 53:38": "(Dalam Kitab-kitab itu ditegaskan): Bahawa sesungguhnya seseorang yang boleh memikul tidak akan memikul dosa perbuatan orang lain (bahkan dosa usahanya sahaja);",
                            "verse 53:39": "Dan bahawa sesungguhnya tidak ada (balasan) bagi seseorang melainkan (balasan) apa yang diusahakannya;",
                            "verse 53:40": "Dan bahawa sesungguhnya usahanya itu akan diperlihatkan (kepadanya, pada hari kiamat kelak);",
                            "verse 53:41": "Kemudian usahanya itu akan dibalas dengan balasan yang amat sempurna;",
                            "verse 53:42": "Dan bahawa sesungguhnya kepada hukum Tuhanmu lah kesudahan (segala perkara);",
                            "verse 53:43": "Dan bahawa sesungguhnya, Dialah yang menyebabkan (seseorang itu bergembira) tertawa dan menyebabkan (seseorang itu berdukacita) menangis;",
                            "verse 53:44": "Dan bahawa sesungguhnya, Dialah yang mematikan dan menghidupkan;",
                            "verse 53:45": "Dan bahawa sesungguhnya, Dialah yang menciptakan pasangan lelaki dan perempuan, -",
                            "verse 53:46": "Dari (setitis) air mani ketika dipancarkan (ke dalam rahim);",
                            "verse 53:47": "Dan bahawa sesungguhnya, Dialah yang tetap menghidupkan semula (makhluk-makhluk yang mati);",
                            "verse 53:48": "Dan bahawa sesungguhnya, Dialah yang memberikan (sesiapa yang dikehendakiNya) apa yang diperlukannya dan memberikannya tambahan yang boleh disimpan;",
                            "verse 53:49": "Dan bahawa sesungguhnya, Dialah Tuhan (Pencipta) Bintang Syikra;",
                            "verse 53:50": "Dan bahawa sesungguhnya, Dialah yang membinasakan kaum \"Aad\" yang pertama (kaum Nabi Hud), -",
                            "verse 53:51": "Dan kaum \"Thamud\" (kaum Nabi Soleh).",
                            "verse 53:52": "Dan kaum Nabi Nuh sebelum itu (telah juga dibinasakan).",
                            "verse 53:53": "Dan bandar-bandar yang ditunggang balikkan itu, Dialah yang (mengangkatnya ke angkasa dan) menghempaskannya ke bumi;",
                            "verse 53:54": "Lalu (penduduk) bandar-bandar itu diliputi azab seksa yang meliputinya.",
                            "verse 53:55": "Maka yang mana satu di antara nikmat-nikmat Tuhanmu (yang tidak terhingga itu) engkau ragu-ragukan (wahai manusia)?",
                            "verse 53:56": "(Al-Quran) ini adalah pemberi amaran di antara jenis-jenis amaran yang telah lalu!",
                            "verse 53:57": "Telah hampir masa datangnya saat yang dekat itu (hari kiamat);",
                            "verse 53:58": "Tidak ada sesiapapun selain Allah yang dapat menahan atau menghapuskan huru-hara hari kiamat itu.",
                            "verse 53:59": "Maka patutkah kamu merasa hairan terhadap keterangan-keterangan Al-Quran ini (sehingga kamu mengingkarinya)?",
                            "verse 53:60": "Serta kamu tertawa (mengejek-ejeknya) dan kamu tidak mahu menangis (menyesali kesalahan kamu serta takutkan balasan buruk yang akan menimpa kamu)?",
                            "verse 53:61": "Sedang kamu adalah orang-orang yang sombong angkuh, lagi yang melalaikan kewajipan?",
                            "verse 53:62": "Oleh yang demikian, hendaklah kamu sujud kepada Allah (yang telah menurunkan Al-Quran itu) dan beribadatlah kamu kepadaNya (dengan sepenuh-penuh tauhid)."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "سوگند به ستاره هنگامى كه افول مى‏كند،",
                            "verse 53:2": "كه هرگز دوست شما ( محمد «ص‏») منحرف نشده و مقصد را گم نكرده است،",
                            "verse 53:3": "و هرگز از روى هواى نفس سخن نمى‏گويد!",
                            "verse 53:4": "آنچه مى‏گويد چيزى جز وحى كه بر او نازل شده نيست!",
                            "verse 53:5": "آن كس كه قدرت عظيمى دارد ( جبرئيل امين) او را تعليم داده است;",
                            "verse 53:6": "همان كس كه توانايى فوق العاده دارد; او سلطه يافت",
                            "verse 53:7": "در حالى كه در افق اعلى قرار داشت!",
                            "verse 53:8": "سپس نزديكتر و نزديكتر شد",
                            "verse 53:9": "تا آنكه فاصله او (با پيامبر) به اندازه فاصله دو كمان يا كمتر بود;",
                            "verse 53:10": "در اينجا خداوند آنچه را وحى كردنى بود به بنده‏اش وحى نمود",
                            "verse 53:11": "قلب (پاك او) در آنچه ديد هرگز دروغ نگفت",
                            "verse 53:12": "آيا با او درباره آنچه (با چشم خود) ديده مجادله مى‏كنيد؟!",
                            "verse 53:13": "و بار ديگر نيز او را مشاهده كرد،",
                            "verse 53:14": "نزد «سدرة المنتهى‏»،",
                            "verse 53:15": "كه «جنت الماوى‏» در آنجاست!",
                            "verse 53:16": "در آن هنگام كه چيزى ( نور خيره‏كننده‏اى) سدرة المنتهى را پوشانده بود،",
                            "verse 53:17": "",
                            "verse 53:18": "او پاره‏اى از آيات و نشانه‏هاى بزرگ پروردگارش را ديد!",
                            "verse 53:19": "به من خبر دهيد آيا بتهاى «لات‏» و «عزى‏»",
                            "verse 53:20": "و «منات‏» كه سومين آنهاست (دختران خدا هستند)؟!",
                            "verse 53:21": "آيا سهم شما پسر است و سهم او دختر؟! (در حالى كه بزعم شما دختران كم ارزش‏ترند!)",
                            "verse 53:22": "در اين صورت اين تقسيمى ناعادلانه است!",
                            "verse 53:23": "اينها فقط نامهايى است كه شما و پدرانتان بر آنها گذاشته‏ايد (نامهايى بى‏محتوا و اسمهايى بى مسما)، و هرگز خداوند دليل و حجتى بر آن نازل نكرده; آنان فقط از گمانهاى بى‏اساس و هواى نفس پيروى مى‏كنند در حالى كه هدايت از سوى پروردگارشان براى آنها آمده است!",
                            "verse 53:24": "يا آنچه انسان تمنا دارد به آن مى‏رسد؟!",
                            "verse 53:25": "در حالى كه آخرت و دنيا از آن خداست!",
                            "verse 53:26": "و چه بسيار فرشتگان آسمانها كه شفاعت آنها سودى نمى‏بخشد مگر پس از آنكه خدا براى هر كس بخواهد و راضى باشد اجازه (شفاعت) دهد!",
                            "verse 53:27": "كسانى كه به آخرت ايمان ندارند، فرشتگان را دختر (خدا) نامگذارى مى‏كنند!",
                            "verse 53:28": "آنها هرگز به اين سخن دانشى ندارند، تنها از گمان بى‏پايه پيروى مى‏كنند با اينكه «گمان‏» هرگز انسان را از حق بى‏نياز نمى‏كند!",
                            "verse 53:29": "حال كه چنين است از كسى كه از ياد ما روى مى‏گرداند و جز زندگى مادى دنيا را نمى‏طلبد، اعراض كن!",
                            "verse 53:30": "اين آخرين حد آگاهى آنهاست; پروردگار تو كسانى را كه از راه او گمراه شده‏اند بهتر مى‏شناسد، و (همچنين) هدايت‏يافتگان را از همه بهتر مى‏شناسد!",
                            "verse 53:31": "و براى خداست آنچه در آسمانها و آنچه در زمين است تا بدكاران را به كيفر كارهاى بدشان برساند و نيكوكاران را در برابر اعمال نيكشان پاداش دهد!",
                            "verse 53:32": "همانها كه از گناهان بزرگ و اعمال زشت دورى مى‏كنند، جز گناهان صغيره (كه گاه آلوده آن مى‏شوند); آمرزش پروردگار تو گسترده است; او نسبت به شما از همه آگاهتر است از آن هنگام كه شما را از زمين آفريد و در آن موقع كه بصورت جنينهايى در شكم مادرانتان بوديد; پس خودستايى نكنيد، او پرهيزگاران را بهتر مى‏شناسد!",
                            "verse 53:33": "آيا ديدى آن كس را كه (از اسلام -يا انفاق-) روى گردان شد؟!",
                            "verse 53:34": "و كمى عطا كرد، و از بيشتر امساك نمود!",
                            "verse 53:35": "آيا نزد او علم غيب است و مى‏بيند (كه ديگران مى‏توانند گناهان او را بر دوش گيرند)؟!",
                            "verse 53:36": "يا از آنچه در كتب موسى نازل گرديده با خبر نشده است؟!",
                            "verse 53:37": "و در كتب ابراهيم، همان كسى كه وظيفه خود را بطور كامل ادا كرد،",
                            "verse 53:38": "كه هيچ كس بار گناه ديگرى را بر دوش نمى‏گيرد،",
                            "verse 53:39": "و اينكه براى انسان بهره‏اى جز سعى و كوشش او نيست،",
                            "verse 53:40": "و اينكه تلاش او بزودى ديده مى‏شود،",
                            "verse 53:41": "سپس به او جزاى كافى داده خواهد شد!",
                            "verse 53:42": "(و آيا از كتب پيشين انبيا به او نرسيده است) كه همه امور به پروردگارت منتهى مى‏گردد؟!",
                            "verse 53:43": "و اينكه اوست كه خنداند و گرياند،",
                            "verse 53:44": "و اوست كه ميراند و زنده كرد،",
                            "verse 53:45": "و اوست كه دو زوج نر و ماده را آفريد",
                            "verse 53:46": "از نطفه‏اى هنگامى كه خارج مى‏شود (و در رحم مى‏ريزد)،",
                            "verse 53:47": "و اينكه بر خداست ايجاد عالم ديگر (تا عدالت اجرا گردد)،",
                            "verse 53:48": "و اينكه اوست كه بى‏نياز كرد و سرمايه باقى بخشيد،",
                            "verse 53:49": "و اينكه اوست پروردگار ستاره «شعرا»!",
                            "verse 53:50": "(و آيا به انسان نرسيده است كه در كتب انبياى پيشين آمده) كه خداوند قوم «عاد نخستين س‏ذللّه را هلاك كرد؟!",
                            "verse 53:51": "و همچنين قوم «ثمود» را، و كسى از آنان را باقى نگذارد!",
                            "verse 53:52": "و نيز قوم نوح را پيش از آنها، چرا كه آنان از همه ظالمتر و طغيانگرتر بودند!",
                            "verse 53:53": "و نيز شهرهاى زير و رو شده (قوم لوط) را فرو كوبيد،",
                            "verse 53:54": "سپس آنها را با عذاب سنگين پوشانيد!",
                            "verse 53:55": "(بگو:) در كدام يك از نعمتهاى پروردگارت ترديد دارى؟!",
                            "verse 53:56": "اين (پيامبر) بيم‏دهنده‏اى از بيم‏دهندگان پيشين است!",
                            "verse 53:57": "آنچه بايد نزديك شود، نزديك شده است (و قيامت فرامى‏رسد)،",
                            "verse 53:58": "و هيچ كس جز خدا نمى‏تواند سختيهاى آن را برطرف سازد!",
                            "verse 53:59": "آيا از اين سخن تعجب مى‏كنيد،",
                            "verse 53:60": "و مى‏خنديد و نمى‏گرييد،",
                            "verse 53:61": "و پيوسته در غفلت و هوسرانى به سر مى‏بريد؟!",
                            "verse 53:62": "حال كه چنين است همه براى خدا سجده كنيد و او را بپرستيد!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Pela estrela, quando cai,",
                            "verse 53:2": "Que vosso camarada jamais se extravia, nem erra,",
                            "verse 53:3": "Nem fala por capricho.",
                            "verse 53:4": "Isso não é senão a inspiração que lhe foi revelada,",
                            "verse 53:5": "Que lhe transmitiu o fortíssimo,",
                            "verse 53:6": "O sensato, o qual lhe apareceu (em sua majestosa forma).",
                            "verse 53:7": "Quando estava na parte mais alta do horizonte.",
                            "verse 53:8": "Então, aproximou-se dele estreitamente,",
                            "verse 53:9": "Até a uma distância de dois arcos (de atirar setas), ou menos ainda.",
                            "verse 53:10": "E revelou ao Seu servo o que Ele havia revelado.",
                            "verse 53:11": "O coração (do Mensageiro) não mentiu, acerca do que viu.",
                            "verse 53:12": "Disputareis, acaso, sobre o que ele viu?",
                            "verse 53:13": "Realmente o viu, numa Segunda descida,",
                            "verse 53:14": "Junto ao limite da árvore de lótus.",
                            "verse 53:15": "Junto à qual está o jardim da morada (eterna).",
                            "verse 53:16": "Quando aquela coisa envolvente cobriu a árvore de lótus,",
                            "verse 53:17": "Não desviou o olhar, nem transgrediu.",
                            "verse 53:18": "Em verdade, presenciou os maiores sinais do seu Senhor.",
                            "verse 53:19": "Considerai Al-Lát e Al-Uzza.",
                            "verse 53:20": "E a outra, a terceira (deusa), Manata.",
                            "verse 53:21": "Porventura, pertence-vos o sexo masculino e a Ele o feminino?",
                            "verse 53:22": "Tal, então, seria uma partilha injusta.",
                            "verse 53:23": "Tais (divindades) não são mais do que nomes, com que as denominastes, vós e vossos antepassados, acerca do que Deus não vos conferiu autoridade alguma.",
                            "verse 53:24": "Porventura, obterá o homem tudo quanto ambiciona?",
                            "verse 53:25": "Sabei que só a Deus pertence a outra vida e a presente.",
                            "verse 53:26": "E quantos anjos há nos céus, cujas intercessões de nada valerão, salvo a daqueles que a Deus aprouver e comprazer!",
                            "verse 53:27": "Sabei que aqueles que não crêem na outra vida denominam os anjos com nomes femininos,",
                            "verse 53:28": "Embora careçam de todo o conhecimento a esse respeito.",
                            "verse 53:29": "Afasta-te pois, de quem desdenha a Nossa Mensagem, e não ambiciona senão a vida terrena.",
                            "verse 53:30": "Tal é o alcance do seu conhecimento.",
                            "verse 53:31": "A Deus pertence tudo quanto existe nos céus e na terra, para castigar os malévolos, segundo o que tenham cometido, e recompensar os benfeitores com o melhor.",
                            "verse 53:32": "Estes são os que se abstêm dos pecados graves e das obscenidades, conquanto cometam faltas leves.",
                            "verse 53:33": "Que opinas, pois, de quem desdenha,",
                            "verse 53:34": "Que pouco dá, e, depois, endurece (o coração)?",
                            "verse 53:35": "Porventura, está de posse do incognoscível e prognostica (o futuro)?",
                            "verse 53:36": "Qual, não foi inteirado de tudo quanto contêm os livros de Moisés,",
                            "verse 53:37": "E os de Abraão , que cumpriu (as suas obrigações),",
                            "verse 53:38": "De que nenhum pecador arcará com culpa alheia?",
                            "verse 53:39": "De que o homem não obtém senão o fruto do seu proceder?",
                            "verse 53:40": "De que o seu proceder será examinado?",
                            "verse 53:41": "Depois, ser-lhe-á retribuído, com a mais eqüitativa recompensa?",
                            "verse 53:42": "E que pertence ao teu Senhor o limite.",
                            "verse 53:43": "E que Ele faz rir e chorar.",
                            "verse 53:44": "E que Ele dá a vida e a morte.",
                            "verse 53:45": "E que Ele criou (tudo) em pares: o masculino e o feminino,",
                            "verse 53:46": "De uma gosta de esperma, quando alojada (em seu lugar).",
                            "verse 53:47": "E que a Ele compete a Segunda criação.",
                            "verse 53:48": "E que Ele enriquece e dá satisfação.",
                            "verse 53:49": "E que Ele é o Senhor do (astro) Sírio.",
                            "verse 53:50": "E que Ele exterminou o primitivo povo de Ad .",
                            "verse 53:51": "E o povo de Tamud, sem deixar (membro) algum?",
                            "verse 53:52": "E, antes, o povo de Noé, porque era ainda mais iníquo e transgressor?",
                            "verse 53:53": "E destruiu as cidades nefastas (Sodoma e Gomorra)?",
                            "verse 53:54": "E as cobriu com um véu envolvente?",
                            "verse 53:55": "De qual das mercês do teu Senhor duvidas, pois, (ó humano)?",
                            "verse 53:56": "Eis aqui uma admoestação dos primeiros admoestadores.",
                            "verse 53:57": "Aproxima-se a Hora iminente!",
                            "verse 53:58": "Ninguém, além de Deus, poderá revelá-la.",
                            "verse 53:59": "Por que vos assombrais, então, com esta Mensagem?",
                            "verse 53:60": "E rides ao invés de chorardes,",
                            "verse 53:61": "Em vossos lazeres?",
                            "verse 53:62": "Prostrai-vos, outrossim, perante Deus, e adorai-O."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 53:1": "Pe steaua care apune!",
                            "verse 53:2": "Tovarãșul vostru nu este rãtãcit, nici nu este pe un drum greșit!",
                            "verse 53:3": "Nu rostește nimic dupã pofta lui!",
                            "verse 53:4": "El",
                            "verse 53:5": "nu este decât o revelație trimisã .",
                            "verse 53:6": "L-a învãțat pe el cel cu puteri deosebite ,",
                            "verse 53:7": "Stãpânul înțelepciunii care i s-a arãtat cu înfãțișarea sa adevãratã ,",
                            "verse 53:8": "Când se afla în zarea cea mai înaltã .",
                            "verse 53:9": "Apoi s-a apropiat și a coborât mai jos ,",
                            "verse 53:10": "Încât s-a aflat la douã bãtãi de arc sau chiar mai aproape.",
                            "verse 53:11": "Și i-a revelat Robului Sãu ceea ce i-a fost revelat .",
                            "verse 53:12": "Inima nu a mințit în ceea ce a vãzut.",
                            "verse 53:13": "Oare vã îndoiți de ceea ce a vãzut?",
                            "verse 53:14": "L-a mai vãzut el la o altã coborâre ,",
                            "verse 53:15": "La Sidrat al-Muntaha ,",
                            "verse 53:16": "Lângã care se aflã grãdina Adãpostului ,",
                            "verse 53:17": "Când îi vine lotusului ce-i vine .",
                            "verse 53:18": "Privirea nu s-a abãtut și nici nu a trecut mai departe.",
                            "verse 53:19": "El a vãzut unele din semnele cele mai mari ale Domnului sãu .",
                            "verse 53:20": "Ați vãzut voi pe Al-Lat și pe Al-'Uzza",
                            "verse 53:21": "Și pe alta, pe Manat , cea de a treia?",
                            "verse 53:22": "Oare voi aveți bãiat și El are copilã?",
                            "verse 53:23": "Aceasta este, așadar, o împãrțire nedreaptã!",
                            "verse 53:24": "Ele nu sunt decât niște nume pe care le-ați dat voi și pãrinții voștri.",
                            "verse 53:25": "Oare are omul ceea ce poftește?",
                            "verse 53:26": "Dar ale lui Allah sunt Viața de Apoi și viața cea dintâi.",
                            "verse 53:27": "Și câți îngeri sunt în ceruri și mijlocirea lor nu folosește întru nimic, decât dupã ce Allah îngãduie cui voiește El și cui Îi place!",
                            "verse 53:28": "Cei care nu cred în Viața de Apoi îi cheamã pe îngeri cu nume de muieri.",
                            "verse 53:29": "Însã ei nu au științã despre aceasta.",
                            "verse 53:30": "Așadar, îndepãrteazã-te de acela care se întoarce de la în- demnarea Noastrã și care nu voiește decât viața pãmânteascã!",
                            "verse 53:31": "Aceasta este știința la care ajung ei .",
                            "verse 53:32": "Ale lui Allah sunt cele din ceruri și cele de pre pãmânt, pentru ca sã-i rãsplãteascã pe cei care au sãvârșit rãu dupã ceea ce au fãcut și sã-i rãsplãteasc",
                            "verse 53:33": "Aceia care se feresc de pãcatele mari și de faptele cele rușinoase, afarã de micile greșeli, [sã știe cã] Domnul tãu este darnic laiertare.",
                            "verse 53:34": "Îl vezi pe acela care se întoarce",
                            "verse 53:35": "Și dã cu zgârcenie, iar apoi nu mai dã deloc?",
                            "verse 53:36": "Oare are el știința Necunoscutului și poate el vedea?",
                            "verse 53:37": "Sau oare i s-a vestit lui ce se aflã în foile lui Moise",
                            "verse 53:38": "Și ale lui Avraam, care și-a ținut cu credințã [fãgãduința lui de a transmite]",
                            "verse 53:39": "Cã nici un suflet nu va purta povara altuia",
                            "verse 53:40": "Și cã omul nu va dobândi decât",
                            "verse 53:41": "celor pe care le-a agonisit",
                            "verse 53:42": "Și cã agoniseala lui se va vedea ,",
                            "verse 53:43": "Iar apoi va primi pentru ea rãsplata cuvenitã?",
                            "verse 53:44": "Și cã la Domnul tãu este întoarcerea ,",
                            "verse 53:45": "Și cã El face sã râdã și face sã plângã ,",
                            "verse 53:46": "Și cã El dã moartea și El dã viața",
                            "verse 53:47": "Și cã El i-a creat pe cei doi soți - bãrbãtușul și femeiușa -,",
                            "verse 53:48": "Dintr-o picãturã, când ea este vãrsatã?",
                            "verse 53:49": "Și cã a Lui este și cealaltã creație",
                            "verse 53:50": "Și cã El îmbogãțește și îndestuleazã?",
                            "verse 53:51": "Și cã El este stãpânul stelei aș-Și'ra",
                            "verse 53:52": "Și cã El a fãcut sã piarã ’Ad cel vechi",
                            "verse 53:53": "Și Thamud și nu a lãsat sã rãmânã nimic,",
                            "verse 53:54": "Ca și neamul lui Noe, mai înainte, fiindcã ei erau mai nelegiuiți și mai crânceni,",
                            "verse 53:55": "Și cetãțile",
                            "verse 53:56": "le-a nimicit",
                            "verse 53:57": "Și le-a acoperit cu ceea ce le-a acoperit?",
                            "verse 53:58": "Și de care dintre binefacerile Domnului tãu te îndoiești?",
                            "verse 53:59": "Acesta este un prevenitor dintre prevenitorii cei vechi.",
                            "verse 53:60": "Se apropie cea care este aproape,",
                            "verse 53:61": "Nimeni, afarã de Allah, nu o poate da la ivealã .",
                            "verse 53:62": "Oare vã mirați voi de aceastã recitare",
                            "verse 53:63": "Și râdeți și nu plângeți?",
                            "verse 53:64": "Și stați voi nepãsãtori și semeți?",
                            "verse 53:65": "Prosternați-vã înaintea lui Allah și adorați-L! semeți?"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 53:1": "Pe stelele ce asfinţesc!",
                            "verse 53:2": "Prietenul vostru nu se rătăceşte şi nici nu cade în greşeală:",
                            "verse 53:3": "el nu vorbeşte din patimă.",
                            "verse 53:4": "Aceasta este o Dezvăluire ce i-a fost dezvăluită.",
                            "verse 53:5": "I-a făcut-o cunoscută cel tare la putere,",
                            "verse 53:6": "cel cu iscusinţă, ce s-a aşezat.",
                            "verse 53:7": "pe orizontul cel mai înalt,",
                            "verse 53:8": "apoi s-a apropiat stând aninat.",
                            "verse 53:9": "El era la o depărtare de două aruncături de suliţă",
                            "verse 53:10": "şi atunci i-a dezvăluit robului Său ceea ce i-a dezvăluit.",
                            "verse 53:11": "Inima nu a socotit amăgire ceea ce el a văzut.",
                            "verse 53:12": "Vă îndoiţi de ceea ce el a văzut?",
                            "verse 53:13": "El l-a văzut încă o dată,",
                            "verse 53:14": "lângă Lotusul de la capăt",
                            "verse 53:15": "unde se află Grădina Lăcaşului,",
                            "verse 53:16": "atunci când Lotusul era învăluit de ceea ce era învăluit.",
                            "verse 53:17": "Privirea sa nu s-a abătut şi nici nu a fost stingherită.",
                            "verse 53:18": "El a văzut semnele cele mari ale Domnului său.",
                            "verse 53:19": "Ce socotiţi despre Al-Lat şi Al-Uzza,",
                            "verse 53:20": "şi cealaltă, Manat, a treia?",
                            "verse 53:21": "Veţi avea voi băieţi şi El fete?",
                            "verse 53:22": "Ce împărţire samavolnică!",
                            "verse 53:23": "Nu sunt decât nişte nume pe care voi şi taţii voştri li le-aţi dat, fără ca Dumnezeu să vă fi pogorât vouă vreo împuternicire pentru aceasta.",
                            "verse 53:24": "Va avea omul ceea ce-şi doreşte?",
                            "verse 53:25": "Ale lui Dumnezeu sunt Viaţa de Apoi şi Viaţa Dintâi.",
                            "verse 53:26": "Câţi îngeri sunt în cer? Mijlocirea lor nu va sluji la nimic decât după ce Dumnezeu îngăduie aceasta pentru cine voieşte El şi pentru cel de care El este mulţumit.",
                            "verse 53:27": "Cei care nu cred în Viaţa de Apoi dau îngerilor nume de femei.",
                            "verse 53:28": "Ei nu au nici o ştiinţă, ci urmează o închipuire.",
                            "verse 53:29": "Îndepărtează-te de cel care întoarce spatele amintirii şi care nu doreşte decât Viaţa de Acum.",
                            "verse 53:30": "Aceasta este toată întinderea ştiinţei lor! Domnul tău îl ştie prea bine pe cel care se rătăceşte de la calea Sa, precum îl ştie prea bine şi pe cel drept călăuzit.",
                            "verse 53:31": "Ale lui Dumnezeu sunt cele din ceruri şi de pe pământ.",
                            "verse 53:32": "Domnul tău este darnic la iertare cu cei care se feresc de păcatele grele şi de desfrâu, precum şi cu cei care săvârşesc greşeli uşoare.",
                            "verse 53:33": "L-ai văzut pe cel care a întors spatele,",
                            "verse 53:34": "Are el ştiinţa Tainei ca s-o poată vedea?",
                            "verse 53:35": "Nu i s-a dat de ştire oare de ceea ce era în sulurile lui Moise",
                            "verse 53:36": "şi în cele ale lui Abraham cel atât de credincios?",
                            "verse 53:37": "Nimănui nu i se va pune în cârcă povara altuia.",
                            "verse 53:38": "Omul nu va avea decât ceea ce trudeşte.",
                            "verse 53:39": "Truda sa va fi recunoscută",
                            "verse 53:40": "şi va fi din plin răsplătit.",
                            "verse 53:41": "La Domnul tău este capătul!",
                            "verse 53:42": "El este Cel ce dăruieşte râsul şi Cel ce dăruieşte plânsul.",
                            "verse 53:43": "El este Cel ce dăruieşte moartea şi Cel ce dăruieşte viaţa.",
                            "verse 53:44": "El a creat perechea, bărbat şi femeie,",
                            "verse 53:45": "dintr-o picătură de sămânţă după ce a fost vărsată.",
                            "verse 53:46": "A Lui este Facerea cea de apoi.",
                            "verse 53:47": "El îmbogăţeşte şi îndestulează.",
                            "verse 53:48": "El este Domnul lui Sirius.",
                            "verse 53:49": "El i-a nimicit pe adiţii de odinioară,",
                            "verse 53:50": "precum şi pe tamudiţi — pe nimeni n-a lăsat dintre ei —",
                            "verse 53:51": "şi mai înainte pe poporul lui Noe — oameni nedrepţi şi ticăloşi.",
                            "verse 53:52": "El a dărâmat cetatea cea de-a-ndoaselea,",
                            "verse 53:53": "acoperind-o cu ceea ce trebuia s-o acopere.",
                            "verse 53:54": "Care sunt binefacerile Domnului tău pe care tu le tăgădui?",
                            "verse 53:55": "Aceasta este o mustrare dintre mustrările dintâi.",
                            "verse 53:56": "Cea care trebuie să se apropie, se va apropia!",
                            "verse 53:57": "Nimeni, afară de Dumnezeu, nu o poate dezvălui.",
                            "verse 53:58": "Sunteţi miraţi de această spusă?",
                            "verse 53:59": "Râdeţi în loc să plângeţi?",
                            "verse 53:60": "Voi sunteţi nepăsători!",
                            "verse 53:61": "Prosternaţi-vă înaintea lui Dumnezeu şi Lui închinaţi-vă! nepăsători!"
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "В знак той звезды,Что падает (и исчезает)с небосклона.",
                            "verse 53:2": "Ваш соплеменник со стези не сбился,(С пути прямого) не сошел,",
                            "verse 53:3": "И речь ведет он не с пристрастьем,",
                            "verse 53:4": "А лишь по откровению, котороениспослано ему.",
                            "verse 53:5": "И наставляет его Тот,Кто мощи необъятной преисполнен.",
                            "verse 53:6": "Во всем величии явился он2191",
                            "verse 53:7": "На высшей точке горизонта.",
                            "verse 53:8": "Потом приблизился и опустился",
                            "verse 53:9": "И был на расстоянии не боле двухпролетов лука.",
                            "verse 53:10": "Так Своему рабу (Он) передал то(откровенье),Которое назначил для него.",
                            "verse 53:11": "То, что узрели ум и сердце, они(пророку) не солгали, —",
                            "verse 53:12": "Ужель вы станете оспаривать все то,что он узрел?",
                            "verse 53:13": "Ведь при втором явлении его(Пророк), поистине, его уж видел2192",
                            "verse 53:14": "Близ лотоса2193,За коим недоступно никому пройти",
                            "verse 53:15": "И за которым Райская обитель2194;",
                            "verse 53:16": "И был тот лотос скрыт (неведомым)покровом.",
                            "verse 53:17": "(Свой) взгляд (пророк)ни на мгновенье не отвелИ за пределы (зримого) не вышел, —",
                            "verse 53:18": "Ведь, истинно, он зрил великоезнамение Аллаха!",
                            "verse 53:19": "Так кто ж для вас ал-Лат и ал-Узза",
                            "verse 53:20": "И вот еще одна, третья (богиня) —ал-Манат?2195",
                            "verse 53:21": "Ужель для вашего потомства —сыновья,Для Господа — лишь женское(потомство)?",
                            "verse 53:22": "Поистине, несправедливым было бытакое разделенье.",
                            "verse 53:23": "Ведь это только имена,Которые измыслили и вы, и вашипредки;И никакого разрешения на тоГосподь вам не послал.",
                            "verse 53:24": "Ужель и впрямь владеет человекВсем тем, что только пожелает?",
                            "verse 53:25": "О нет! Владеет лишь АллахИ будущей, и настоящей жизнью!",
                            "verse 53:26": "Заступничество многих ангелов небес(Ни от чего вас) не избавит,(И прощены Аллахом будут те),Кого Он изберет Своей угодой,А также те, к кому благоволит Он.",
                            "verse 53:27": "Те, кто не верит в жизнь после смерти,Даруют ангелов названиями женщин.",
                            "verse 53:28": "Но в этом нет у них познаньяникакого —Здесь следуют они своимпредположеньям.",
                            "verse 53:29": "Поэтому отвергни тех,Кто отвращается от НашихнаставленийИ тешит себя жизнью ближней.",
                            "verse 53:30": "Лишь в этом их предел познаний,И лишь Аллах способен лучшеразличатьТех, кто сошел с Его пути,И тех, кто следует Его заветам.",
                            "verse 53:31": "И лишь Аллах владеет всем,Что в небесах и на земле пребудет.",
                            "verse 53:32": "Для тех же, кто постыдные делане совершаетИ избегает смертного греха,Впадая лишь в моментные ошибки, —Господь, поистине, исполненвсепрощенья.",
                            "verse 53:33": "Видал ли ты того, кто спину повернул,",
                            "verse 53:34": "Дал мало и облекся в скупость?2196",
                            "verse 53:35": "Что ведает он о Незримом,Чтоб мог он верно видеть?",
                            "verse 53:36": "Иль не знаком он с тем,что на скрижалях Мусы",
                            "verse 53:37": "И что (на свитках) Ибрахима,которым он был верен?",
                            "verse 53:38": "Душа, несущая свой груз,Не понесет чужую ношу.",
                            "verse 53:39": "И возымеет человек лишь то,Что приобрел своим стараньем.",
                            "verse 53:40": "Усердие его (на жизненной стезе)Получит верную оценку (у Владыки),",
                            "verse 53:41": "И за него найвысшую награду онполучит.",
                            "verse 53:42": "Ведь лишь у Господа — пределконечный,",
                            "verse 53:43": "Лишь Он дарует смех и заставляетплакать,",
                            "verse 53:44": "И только Он дарует жизньи назначает смерть.",
                            "verse 53:45": "И только Он творит все в парах —Мужской и женский пол —",
                            "verse 53:46": "Из капли (крохотной),Что изольется (в место израстанья).",
                            "verse 53:47": "И лишь на Нем лежит вторичноеТворенье2197,",
                            "verse 53:48": "И только Он воздержанно иль щедробогатства и наделы раздает.",
                            "verse 53:49": "И только Он — Властитель Сириуса(мощи)2198.",
                            "verse 53:50": "Лишь Он послал погибель первомународу А–д",
                            "verse 53:51": "И Саму –д, не пощадивни одного из них.",
                            "verse 53:52": "Еще до них — народу Ну –хаЗа то, что были всех невернейи вероломнее из всех.",
                            "verse 53:53": "Он снес (с лица земли) поверженныегорода2198а",
                            "verse 53:54": "Так, что покрыло их (неведомым)покровом.",
                            "verse 53:55": "(О человек)! Какой же дар из всехдаров ГосподнихТебя в сомненье повергает?!",
                            "verse 53:56": "Посланник это,Кто стоит (в одном ряду)С мессиями времен ушедших.",
                            "verse 53:57": "Уж близок (Час назначенного) Дня,",
                            "verse 53:58": "И никому не отвратить его,Кроме Аллаха.",
                            "verse 53:59": "Так что ж дивитесь вы сиим словам",
                            "verse 53:60": "И слез не льете, а смеетесь,",
                            "verse 53:61": "В земных утехах распевая?",
                            "verse 53:62": "Падите ж ниц пред Господом своим,Пред Ним колени преклоняя! распевая?"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "¡Por la estrella, cuando declina!",
                            "verse 53:2": "Vuestro paisano no se extravía, ni se descarría.",
                            "verse 53:3": "No habla por propio impulso.",
                            "verse 53:4": "No es sino una revelación que se ha hecho.",
                            "verse 53:5": "Se la ha enseñado el muy poderoso,",
                            "verse 53:6": "fuerte, majestuoso,",
                            "verse 53:7": "mientras él estaba en lo más alto del horizonte.",
                            "verse 53:8": "Luego, se acercó y quedó suspendido en el aire,",
                            "verse 53:9": "estaba a dos medidas de arco o menos.",
                            "verse 53:10": "Reveló a Su siervo lo que reveló.",
                            "verse 53:11": "No ha mentido el corazón en lo que vio.",
                            "verse 53:12": "¿Disputaréis, pues, con él sobre lo que ve?",
                            "verse 53:13": "Ya le había visto descender en otra ocasión,",
                            "verse 53:14": "junto al azufaifo del confín,",
                            "verse 53:15": "junto al cual se encuentra el jardín de la Morada,",
                            "verse 53:16": "cuando el azufaifo estaba cubierto por aquello.",
                            "verse 53:17": "No se desvió la mirada.",
                            "verse 53:18": "Vio, ciertamente, parte de los signos tan grandes de su Señor.",
                            "verse 53:19": "Y ¿qué os parecen al-Lat, al-Uzza",
                            "verse 53:20": "y la otra, Manat, la tercera?",
                            "verse 53:21": "¿Para vosotros los varones y para Él las hembras?",
                            "verse 53:22": "Sería un reparto injusto.",
                            "verse 53:23": "No son sino nombres que habéis puesto, vosotros y vuestros padres, a los que Alá no ha conferido ninguna autoridad.",
                            "verse 53:24": "¿Obtendrá el hombre lo que desea?",
                            "verse 53:25": "Pero la otra vida y esta vida pertenecen a Alá.",
                            "verse 53:26": "¡Cuántos ángeles hay en los cielos, cuya intercesión no servirá de nada, a menos que antes dé Alá permiso a quien Él quiera, a quien Le plazca!",
                            "verse 53:27": "Quienes no creen en la otra vida ponen, sí, a los ángeles nombres femeninos.",
                            "verse 53:28": "No tienen ningún conocimiento de ello.",
                            "verse 53:29": "Apártate de quien vuelve la espalda a Nuestra Amonestación y no desea sino la vida de acá.",
                            "verse 53:30": "Ésa es toda la ciencia que pueden alcanzar.",
                            "verse 53:31": "De Alá es lo que está en los cielos y en la tierra, para retribuir a los que obren mal por lo que hagan y retribuir a los que obren bien dándoles lo mejor.",
                            "verse 53:32": "Quienes evitan los pecados graves y las deshonestidades y sólo cometen pecados leves.",
                            "verse 53:33": "Y, ¿qué te parece el que vuelve la espalda?",
                            "verse 53:34": "Da poco, es mezquino.",
                            "verse 53:35": "¿Tiene la ciencia de lo oculto, que le permita ver?",
                            "verse 53:36": "¿No se le ha informado del contenido de las Hojas de Moisés",
                            "verse 53:37": "y de Abraham, que cumplió:",
                            "verse 53:38": "que nadie cargará con la carga ajena,",
                            "verse 53:39": "que el hombre sólo será sancionado con arreglo a su propio esfuerzo,",
                            "verse 53:40": "que se verá el resultado de su esfuerzo,",
                            "verse 53:41": "que será, luego, retribuido generosamente,",
                            "verse 53:42": "que el fin de todo es tu Señor,",
                            "verse 53:43": "que es Él Quien hace reír y hace llorar,",
                            "verse 53:44": "que es Él Quien da la muerte y da la vida,",
                            "verse 53:45": "que Él crea la pareja, varón y hembra,",
                            "verse 53:46": "de una gota cuando es eyaculada,",
                            "verse 53:47": "que a Él incumbe la otra creación,",
                            "verse 53:48": "que es Él Quien da riquezas y posesiones,",
                            "verse 53:49": "que es Él el Señor de Sirio,",
                            "verse 53:50": "que Él hizo perecer a los antiguos aditas",
                            "verse 53:51": "y a los tamudeos, sin dejar uno solo con vida,",
                            "verse 53:52": "y, antes, al pueblo de Noé, que fue tan impío y rebelde,",
                            "verse 53:53": "y aniquiló a la vuelta de arriba abajo.",
                            "verse 53:54": "cubriéndola como la cubrió?",
                            "verse 53:55": "¿Cuál, pues, de los beneficios de tu Señor pondrás en duda?",
                            "verse 53:56": "Ésta es una advertencia al estilo de las advertencias antiguas.",
                            "verse 53:57": "Amenaza la Inminente.",
                            "verse 53:58": "Nadie, fuera de Alá, puede quitarla.",
                            "verse 53:59": "¿Os asombráis, pues, de este discurso?",
                            "verse 53:60": "¿Y reís, en lugar de llorar,",
                            "verse 53:61": "permaneciendo indiferentes?",
                            "verse 53:62": "¡Prosternaos, pues, ante Alá y servidle!"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "விழுகின்ற நட்சத்திரத்தின் மீது சத்தியமாக!",
                            "verse 53:2": "உங்கள் தோழர் வழி கெட்டுவிடவுமில்லை, அவர் தவறான வழியில் செல்லவுமில்லை.",
                            "verse 53:3": "அவர் தம் இச்சைப்படி (எதையும்) பேசுவதில்லை.",
                            "verse 53:4": "அது அவருக்கு வஹீ மூலம் அறிவிக்கப்பட்டதேயன்றி வேறில்லை.",
                            "verse 53:5": "மிக்க வல்லமையுடைவர் (ஜிப்ரயீல்) அவருக்குக் கற்றுக் கொடுத்தார்.",
                            "verse 53:6": "(அவர்) மிக்க உறுதியானவர், பின்னர் அவர் (தம் இயற்கை உருவில்) நம் தூதர் முன் தோன்றினார்.",
                            "verse 53:7": "அவர் உன்னதமான அடி வானத்தில் இருக்கும் நிலையில்-",
                            "verse 53:8": "பின்னர், அவர் நெருங்கி, இன்னும், அருகே வந்தார்.",
                            "verse 53:9": "(வளைந்த) வில்லின் இரு முனைகளைப் போல், அல்லது அதினும் நெருக்கமாக வந்தார்.",
                            "verse 53:10": "அப்பால், (அல்லாஹ்) அவருக்கு (வஹீ) அறிவித்ததையெல்லாம் அவர், அவனுடைய அடியாருக்கு (வஹீ) அறிவித்தார்.",
                            "verse 53:11": "(நபியுடைய) இதயம் அவர் கண்டதைப் பற்றி, பொய்யுரைக்க வில்லை.",
                            "verse 53:12": "ஆயினும், அவர் கண்டவற்றின் மீது அவருடன் நீங்கள் தர்க்கிக்கின்றீர்களா?",
                            "verse 53:13": "அன்றியும், நிச்சயமாக அவர் மற்றொரு முறையும் (ஜிப்ரயீல்) இறங்கக் கண்டார்.",
                            "verse 53:14": "ஸித்ரத்துல் முன்தஹா என்னும் (வானெல்லையிலுள்ள) இலந்தை மரத்தருகே.",
                            "verse 53:15": "அதன் சமீபத்தில் தான் ஜன்னத்துல் மஃவா என்னும் சுவர்க்கம் இருக்கிறது.",
                            "verse 53:16": "ஸித்ரத்துல் முன்தஹா என்னும் அம்மரத்தை சூழ்ந்து கொண்டிருந்த வேளையில்,",
                            "verse 53:17": "(அவருடைய) பார்வை விலகவுமில்லை, அதைக் கடந்து (மாறி) விடவுமில்லை.",
                            "verse 53:18": "திடமாக, அவர் தம்முடைய இறைவனின் அத்தாட்சிகளில் மிகப் பெரியதைக் கண்டார்.",
                            "verse 53:19": "நீங்கள் (ஆராதிக்கும்) லாத்தையும், உஸ்ஸாவையும் கண்டீர்களா?",
                            "verse 53:20": "மற்றும் மூன்றாவதான \"மனாத்\"தையும் (கண்டீர்களா?)",
                            "verse 53:21": "உங்களுக்கு ஆண் சந்ததியும், அவனுக்குப் பெண் சந்ததியுமா?",
                            "verse 53:22": "அப்படியானால், அது மிக்க அநீதமான பங்கீடாகும்.",
                            "verse 53:23": "இவையெல்லாம் வெறும் பெயர்களன்றி வேறில்லை, நீங்களும் உங்கள் மூதாதையர்களும் வைத்துக் கொண்ட வெறும் பெயர்கள்! இதற்கு அல்லாஹ் எந்த அத்தாட்சியும் இறக்கவில்லை, நிச்சயமாக அவர்கள் வீணான எண்ணத்தையும், தம் மனங்கள் விரும்புபவற்றையுமே பின் பற்றுகிறார்கள், எனினும் நிச்சயமாக அவர்களுடைய இறைவனிடமிருந்து, அவர்களுக்கு நேரான வழி வந்தே இருக்கிறது.",
                            "verse 53:24": "அல்லது, மனிதனுக்கு அவன் விரும்பியதெல்லாம் கிடைத்து விடுமா?",
                            "verse 53:25": "ஏனெனில், மறுமையும், இம்மையும் அல்லாஹ்வுக்கே சொந்தம்.",
                            "verse 53:26": "அன்றியும் வானங்களில் எத்தனை மலக்குகள் இருக்கின்றனர்? எனினும், அல்லாஹ் விரும்பி, எவரைப்பற்றித் திருப்தியடைந்து, அவன் அனுமதி கொடுக்கின்றானோ அவரைத் தவிர வேறெவரின் பரிந்துரையும் எந்தப் பயனுமளிக்காது.",
                            "verse 53:27": "நிச்சயமாக, மறுமையின் மீது நம்பிக்கை கொள்ளாதவர்கள் பெண்களுக்குப் பெயரிடுவது போல் மலக்குகளுக்குப் பெயரிடுகின்றனர்.",
                            "verse 53:28": "எனினும் அவர்களுக்கு இதைப் பற்றி எத்தகைய அறிவும் இல்லை, அவர்கள் வீணான எண்ணத்தைத் தவிர வேறெதையும் பின்பற்றவில்லை, நிச்சயமாக வீண் எண்ணம் (எதுவும்) சத்தியம் நிலைப்பதைத் தடுக்க முடியாது.",
                            "verse 53:29": "ஆகவே, எவன் நம்மை தியானிப்தை விட்டும் பின் வாங்கிக் கொண்டானோ - இவ்வுலக வாழ்வையன்றி வேறெதையும் நாடவில்லையோ அவனை (நபியே!) நீர் புறக்கணித்து விடும்.",
                            "verse 53:30": "ஏனெனில் அவர்களுடைய மொத்தக் கல்வி ஞானம் (செல்வது) அந்த எல்லை வரைதான், நிச்சயமாக, உம்முடைய இறைவன், தன் வழியிலிருந்து தவறியவன் யார் என்பதை நன்கறிகிறான், நேரான வழி பெற்றவன் யார் என்பதையும் அவன் நன்கறிகிறான்.",
                            "verse 53:31": "மேலும், வானங்களிலுள்ளவையும், பூமியிலுள்ளவையும் அல்லாஹ்வுக்கே சொந்தம், தீமை செய்தவர்களுக்கு அவர்கள் வினைக்குத் தக்கவாறு கூலி கொடுக்கவும், நன்மை செய்தவர்களுக்கு நன்மையைக் கூலியாகக் கொடுக்கவும் (வழி தவறியவர்களையும், வழி பெற்றவர்களையும் பகுத்து வைத்திருக்கின்றான்).",
                            "verse 53:32": "(நன்மை செய்வோர் யார் எனின்) எவர்கள் (அறியாமல் ஏற்பட்டுவிடும்) சிறு பிழைகளைத் தவிர பெரும் பாவங்களையும் மானக்கேடானவற்றையும் தவிர்த்துக் கொள்கிறார்களோ அவர்கள், நிச்சயமாக உம்முடைய இறைவன் மன்னிப்பதில் தாராளமானவன், அவன் உங்களைப் பூமியிலிருந்து உண்டாக்கிய போது, நீங்கள் உங்கள் அன்னையரின் வயிறுகளில் சிசுக்களாக இருந்த போதும், உங்களை நன்கு அறிந்தவன் - எனவே, நீங்களே உங்களைப் பரிசுத்தவான்கள் என்று புகழ்ந்து கொள்ளாதீர்கள் - யார் பயபக்தியுள்ளவர் என்பதை அவன் நன்கறிவான்.",
                            "verse 53:33": "(நபியே! உறுதியின்றி உம்மை விட்டும் முகம்) திரும்பிக் கொண்டனர் பார்த்தீரா?",
                            "verse 53:34": "அவன் ஒரு சிறிதே கொடுத்தான், பின்னர் (கொடுக்க வேண்டியதைக் கொடாது) நிறுத்திக் கொண்டான்.",
                            "verse 53:35": "அவனிடம் மறைவானவை பற்றிய அறிவு இருந்து, அவன் பார்க்கிறானா?",
                            "verse 53:36": "அல்லது, மூஸாவின் ஸுஹுஃபில் - வேதத்தில் இருப்பது அவனுக்கு அறிவிக்கப்படவில்லையா?",
                            "verse 53:37": "(அல்லாஹ்வின் ஆணையைப் பூரணமாக) நிறைவேற்றிய இப்றாஹீமுடைய (ஆகமங்களிலிருந்து அவனுக்கு அறிவிக்கப்படவில்லையா?)",
                            "verse 53:38": "(அதாவது:) சுமக்கிறவன் பிறிதொருவனின் சுமையைச் சுமக்க மாட்டான்,",
                            "verse 53:39": "இன்னும், மனிதனுக்கு அவன் முயல்வதல்லாமல் வேறில்லை.",
                            "verse 53:40": "அன்றியும், நிச்சயமாக அவன் முயற்சி(யின் பலன்) பின் அவனுக்குக் காண்பிக்கப்படும்.",
                            "verse 53:41": "பின்னர், அதற்கு நிறப்பமான கூலியாக, அவன் கூலி வழங்கப்படுவான்.",
                            "verse 53:42": "மேலும் உம் இறைவனில் பால்தான் இறுதி (மீளுதல்) இருக்கிறது.",
                            "verse 53:43": "அன்றியும், நிச்சயமாக அவனே சிரிக்க வைக்கிறான், அழச் செய்கிறான்.",
                            "verse 53:44": "இன்னும் நிச்சயமாக அவனே மரிக்கச் செய்கிறான், இன்னும் உயிர்ப்பிக்கிறான்.",
                            "verse 53:45": "இன்னும், நிச்சயமாக அவனே ஆண், பெண் என்று ஜோடியாகப் படைத்தான் -",
                            "verse 53:46": "(கர்ப்பக் கோளறையில்) செலுத்தப் படும் போதுள்ள இந்திரியத் துளியைக் கொண்டு.",
                            "verse 53:47": "நிச்சயமாக, மறுமுறை உயிர் கொடுத்து எழுப்புவதும், அவன் மீதே இருக்கிறது.",
                            "verse 53:48": "நிச்சயமாக அவனே தேவையறச் செய்து சீமானாக்குகிறான்.",
                            "verse 53:49": "நிச்சயமாக அவன் தான் (இவர்கள் வணங்கும்) ஷிஃரா (எனும் கோளத்திற்கும்) இறைவன்.",
                            "verse 53:50": "நிச்சயமாக முந்திய ஆ(து கூட்டத்)தை அழித்தவனும் அவன்தான்.",
                            "verse 53:51": "'ஸமூது' (சமூகத்தாரையும் அழித்தவன் அவனே); எனவே, (அவர்களில் எவரையும் மிஞ்சுமாறு) விடவில்லை.",
                            "verse 53:52": "இவர்களுக்கு முன்னர் இருந்த நூஹுவுடைய சமூகத்தாரையும் (அவன் தான் அழித்தான்,) நிச்சயமாக அவர்கள் பெரும் அநியாயக் காரர்களாகவும், அட்டூழியம் செய்தவர்களாகவும் இருந்தனர்.",
                            "verse 53:53": "அன்றியும், அவனே (லூத் சமூகத்தார் வாழ்ந்திருந்த) ஊர்களான முஃதஃபிகாவையும் அழித்தான்.",
                            "verse 53:54": "அவ்வூர்களைச் சூழ வேண்டிய (தண்டனை) சூழ்ந்து கொண்டது.",
                            "verse 53:55": "எனவே, (மனிதனே!) உன்னுடைய இறைவனின் அருட் கொடைகளில் எதை நீ சந்தேகிக்கிறாய்?",
                            "verse 53:56": "இவர் முந்திய எச்சரிக்கையாளர்களி(ன் வரிசையி)லுள்ள எச்சரிக்கையாளர் தாம்.",
                            "verse 53:57": "நெருங்கி வர வேண்டியது (அடுத்து) நெருங்கி விட்டது.",
                            "verse 53:58": "(அதற்குரிய நேரத்தில்) அல்லாஹ்வைத் தவிர அதை வெளியாக்குபவர் எவரும் இல்லை.",
                            "verse 53:59": "இச் செய்தியிலிருந்து நீங்கள் ஆச்சரியப்படுகிறீர்களா?",
                            "verse 53:60": "(இதனைப் பற்றி) நீங்கள் சிரிக்கின்றீர்களா? நீங்கள் அழாமலும் இருக்கின்றீர்களா?",
                            "verse 53:61": "அலட்சியமாகவும் நீங்கள் இருக்கின்றீர்கள்.",
                            "verse 53:62": "ஆகவே நீங்கள் அல்லாஹ்வுக்கு ஸுஜூது செய்யுங்கள், அவனையே வணங்குங்கள்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "ขอสาบานด้วยดวงดาวเมื่อมันคล้อยตกลงมา",
                            "verse 53:2": "สหาย (มุฮัมมัด) ของพวกเจ้ามิได้หลงผิดและเชื่อมั่นในทางที่ผิด",
                            "verse 53:3": "และเขามิได้พูดตามอารมณ์",
                            "verse 53:4": "อัลกุรอานมใช่อื่นใดนอกจากเป็นวะฮีย์ที่ถูกประทานลงมา",
                            "verse 53:5": "ผู้ทรงพลังอำนาจอันมากมาย (ญิบรีล) ได้สอนเขา",
                            "verse 53:6": "ผู้ทรงพลังอันแข็งแรง ดังนั้นเขาจึงปรากฏในสภาพที่แท้จริง",
                            "verse 53:7": "ขณะที่เขาอยู่บนขอบฟ้าอันสูงส่ง",
                            "verse 53:8": "แล้วเขาได้เข้ามาใกล้ และเข้ามาใกล้จนชิด",
                            "verse 53:9": "เขาเข้ามาใกล้ (จนอยู่) ในระยะของปลายคันธนูทั้งสอง หรือใกล้กว่านั้นอีก",
                            "verse 53:10": "ดังนั้น เขา (ญิบรีล) จึงนำวะฮีย์มาให้แก่บ่าวของพระองค์ (มุฮัมมัด) สิ่งที่เขาจะนำวะฮีย์มา",
                            "verse 53:11": "จิตใจ (ของมุฮัมมัด) มิได้ปฏิเสธสิ่งที่เขาได้เห็น",
                            "verse 53:12": "แล้วพวกเจ้าจะโต้เถียงกับเขาเกี่ยวกับสิ่งที่เขาได้เห็นอีกหรือ",
                            "verse 53:13": "และโดยแน่นอน เขาได้เห็นญิบรีลในการลงมาอีกครั้งหนึ่ง",
                            "verse 53:14": "ณ ที่ต้นพุทราอันไกลโพ้น",
                            "verse 53:15": "ณ ที่นั้น คือสวนสวรรค์อันเป็นที่พำนัก",
                            "verse 53:16": "(ขณะนั้น) สิ่งที่ปกคลุม (แสงประกาย) ได้ปกคลุมต้นพุทรา",
                            "verse 53:17": "สายตา (ของมุฮัมมัด) มิได้เหลือบแลไปทางอื่น และมิได้ล่วงเกินไป",
                            "verse 53:18": "โดยแน่นอนเขาได้เห็นสัญญาณอันยิ่งใหญ่ของพระเจ้าของเขา",
                            "verse 53:19": "แล้วพวกเจ้ามิได้เห็นอัลลาตและอัลอุซซา",
                            "verse 53:20": "และตัวอื่นคือตัวที่สาม,มะนาต ดอกหรือ?",
                            "verse 53:21": "สำหรับพวกเจ้ามีเพศชาย และสำหรับพระองค์เพศหญิงกระนั้นหรือ?",
                            "verse 53:22": "ดูซิ นั่นเป็นการแบ่งส่วนที่ไม่ยุติธรรม",
                            "verse 53:23": "เหล่านี้มิใช่อื่นใดนอกจากเป็นชื่อที่พวกเจ้าและบรรพบุรุษของพวกเจ้าตั้งมันขึ้นมาเอง อัลลอฮ์มิได้ทรงประทานหลักฐานอันใดลงมาเกี่ยวกับเรื่องนั้นเลย พวกเขามิได้ปฏิบัติตามสิ่งใดนอกจากการคาดคะเน และทางที่ถูกต้อง (ฮิดะยะฮ์) จากพระเจ้าของพวกเขาได้มีมายังพวกเขาแล้ว",
                            "verse 53:24": "หรือว่าสำหรับมนุษย์นั้นจะได้ทุกสิ่งที่เขาปรารถนา",
                            "verse 53:25": "(อำนาจนั้น) เป็นกรรมสิทธิ์ของอัลลอฮ์ทั้งในปรโลกและโลกนี้",
                            "verse 53:26": "และมะลักกี่มากน้อยในชั้นฟ้าทั้งหลายนั้น การชะฟาอะฮ์ของพวกเขาจะไม่อำนวยประโยชน์อันใด (แก่พวกเขา) เว้นแต่หลังจากอัลลอฮ์จะทรงอนุมัติแก่ผู้ที่พระองค์ทรงประสงค์ และทรงพอพระทัย",
                            "verse 53:27": "แท้จริง บรรดาผู้ที่ไม่ศรัทธาต่อวันปรโลกนั้น แน่นอนพวกเขาจะตั้งชื่อมลาอิกะฮ์เป็นเพศหญิง",
                            "verse 53:28": "และพวกเขาไม่มีความรู้ในเรื่องนั้นเลย พวกเขามิได้ปฏิบัตตามสิ่งใดนอจากการคาดคะเน และแท้จริงการคาดคะเนนั้นจะไม่อำนวยประโยชน์อันใดแก่ความจริงได้",
                            "verse 53:29": "ดังนั้น เจ้าจงหลบหลีกให้ห่างจากผู้ที่ผินหลังจากการรำลึกนึกถึงเรา (อัลลอฮ์) และเขามิได้ปรารถนาอื่นใดนอกจากการมีชีวิตอยู่ในโลกนี้เท่านั้น",
                            "verse 53:30": "นั่นคือสุดยอดแห่งความรู้ของพวกเขาแล้ว แท้จริงพระเจ้าของเจ้านั้น พระองค์ทรงรู้ดียิ่งถึงผู้ที่หลงออกจากทางของพระองค์ และพระองค์ทรงรู้ดียิ่งถึงผู้ที่อยู่ในแนวทางที่ถูกต้อง (ฮิดายะห์)",
                            "verse 53:31": "และสิ่งที่อยู่ในชั้นฟ้าทั้งหลายและสิ่งที่อยู่ในแผ่นดินนั้น เป็นกรรมสิทธิ์ของอัลลอฮ์ เพื่อพระองค์จะทรงตอบแทนบรรดาผู้กระทำความชั่วตามที่พวกเขาประพฤติ และจะทรงตอบแทนบรรดาผู้กระทำความดีด้วยความดี",
                            "verse 53:32": "แก่บรรดาผู้หลีกเลี่ยงห่างจากการทำบาปใหญ่ และทำสิ่งลามกทั้งหลาย เว้นแต่ความผิดพลาดเล็กน้อย แท้จริงพระเจ้าของเจ้านั้นทรงเป็นผู้กว้างขวางในการอภัย พระองค์ทรงรู้จักพวกเจ้าดียิ่ง เมื่อครั้งบังเกิดพวกเจ้าจากแผ่นดิน และเมื่อครั้งพวกเจ้าเป็นทารกอยู่ในครรภ์ของมารดาของพวกเจ้า ดังนั้น พวกเจ้าอย่าแสดงความบริสุทธิ์แก่ตัวของพวกเจ้าเอง เพราะพระองค์ทรงรู้ดียิ่งถึงผู้ที่มีความยำเกรง",
                            "verse 53:33": "เจ้าได้เห็นผู้ที่ผินหลังให้บ้างไหม?",
                            "verse 53:34": "และเขาให้เพียงเล็กน้อย และเขาได้ตระหนี่ (ส่วนที่เหลือ)",
                            "verse 53:35": "เขามีความรู้ในสิ่งเร้นลับกระนั้นหรือ เขาจึงได้เห็น?",
                            "verse 53:36": "หรือว่าเขามิไรับข่าวคราวที่มีอยู่ในคัมภีร์ของมูซา",
                            "verse 53:37": "และ (ในคัมภีร์ของ) อิบรอฮีม ผู้ซึ่งปฏิบัติตามสัญญาอย่างครบครัน",
                            "verse 53:38": "ว่าไม่มีผู้แบกภาระคนใดที่จะแบกภาระของผู้อื่นได้",
                            "verse 53:39": "และมนุษย์จะไม่ได้อะไรเลย นอกจากสิ่งที่เขาได้ขวนขวายเอาไว้",
                            "verse 53:40": "และแท้จริงการขวนขวายของเขาก็จะได้เห็นในไม่ช้า",
                            "verse 53:41": "แล้วเขาก็จะได้รับการตอบแทนด้วยการตอบแทนที่ครบถ้วนสมบูรณ์",
                            "verse 53:42": "และแท้จริงจุดหมายปลายทาง (ของเขา) ย่อมไปสู่พระเจ้าของเจ้า",
                            "verse 53:43": "และแท้จริงพระองค์คือผู้ทรงทำให้หัวเราะ และทรงทำให้ร้องไห้",
                            "verse 53:44": "และแท้จริงพระองค์คือผู้ทรงทำให้ตายและทรงทำให้เป็น",
                            "verse 53:45": "และแท้จริงพระองค์ทรงสร้างสามีภรรยาคู่หนึ่ง เป็นเพศชายและเพศหญิง",
                            "verse 53:46": "จากเชื้ออสุจิเมื่อมันหลั่งออกมา",
                            "verse 53:47": "และแท้จริง เป็นหน้าที่ของพระองค์ที่จะให้บังเกิดอีกครั้งหนึ่ง",
                            "verse 53:48": "และแท้จริง พระองค์ทรงทำให้เขาร่ำรวยและทรงทำให้เขายากจน",
                            "verse 53:49": "และแท้จริง พระองค์ทรงเป็นพระเจ้าแห่งดาวสิริอุส (อัชเชียะอ์รอ)",
                            "verse 53:50": "และแท้จริง พระองค์ทรงทำลายพวกอ๊าดรุ่นก่อน ๆ",
                            "verse 53:51": "และพวกษะมูดก็ไม่ได้ให้มีเหลืออยู่อีกเลย",
                            "verse 53:52": "และหมู่ชนของนูห์ก่อนหน้านี้ แท้จริงพวกเขาเป็นผู้อธรรมยิ่ง และเป็นผู้ละเมิดยิ่ง",
                            "verse 53:53": "และเมืองที่พลิกคว่ำลง (อัลมุอ์ตะฟิกะฮ์) พระองค์ทรงให้มันถล่มลง",
                            "verse 53:54": "ฉะนั้น สิ่งที่ครอบคลุมมันก็ (คือการลงโทษ) ได้ครอบคลุมมัน",
                            "verse 53:55": "ดังนั้น ความโปรดปรานของพระเจ้าของเจ้าอันใดเล่าที่เจ้ายังสงสัยอยู่",
                            "verse 53:56": "นี่คือผู้ตักเตือนที่มาจากปวงผู้ตักเตือนรุ่นก่อน ๆ",
                            "verse 53:57": "เวลาที่ใกล้เข้ามา (วันกิยามะฮ์) ได้ใกล้เข้ามาแล้ว",
                            "verse 53:58": "ไม่มีผู้ใดที่จะปัดเป่าให้พ้นไปได้ นอกจากอัลลอฮ์",
                            "verse 53:59": "พวกเจ้ายังคงแปลกใจต่อคำกล่าวนี้อีกหรือ?",
                            "verse 53:60": "และพวกเจ้ายังคงหัวเราะ และยังไม่ร้องไห้!",
                            "verse 53:61": "และพวกเจ้ายังคงหลงระเริงลืมตัว!",
                            "verse 53:62": "ดังนั้น พวกเจ้าจงสุญูดต่ออัลลอฮ์เถิด และจงเคารพภักดีต่อพระองค์เถิด"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Battığı zaman yıldıza andolsun ki;",
                            "verse 53:2": "Arkadaşınız",
                            "verse 53:3": "(Muhammed) sapmadı ve bâtıla inanmadı.",
                            "verse 53:4": "O,arzusuna",
                            "verse 53:5": "göre de konuşmaz.",
                            "verse 53:6": "O (bildirdikleri) vahyedilenden başkası değildir.",
                            "verse 53:7": "Çünkü onu güçlü kuvvetli biri (Cebrail) öğretti.",
                            "verse 53:8": "Ve üstün yaratılışlı(melek), doğruldu:",
                            "verse 53:9": "Kendisi en yüksek ufukta iken.",
                            "verse 53:10": "Sonra (Muhammed'e) yaklaştı,(yere doğru)sarktı.",
                            "verse 53:11": "O kadar ki (birleştirilmiş) iki yay arası kadar, hatta daha da yakın oldu.",
                            "verse 53:12": "Bunun",
                            "verse 53:13": "üzerine Allah, kuluna vahyini bildirdi.",
                            "verse 53:14": "(Gözleriyle)",
                            "verse 53:15": "gördüğünü kalbi yalanlamadı.",
                            "verse 53:16": "Onun gördükleri hakkında şimdi kendisi ile tartışacak mısınız?",
                            "verse 53:17": "Andolsun onu, önceden bir defa daha görmüştü,",
                            "verse 53:18": "Sidretü'l-Müntehâ'nın",
                            "verse 53:19": "yanında .",
                            "verse 53:20": "Cennetü'l-Me'vâ da onun yanındadır.",
                            "verse 53:21": "Sidre'yi kaplayan kaplamıştı.",
                            "verse 53:22": "Gözü kaymadı ve sınırı aşmadı.",
                            "verse 53:23": "Andolsun o, Rabbinin en büyük âyetlerinden bir kısmını gördü.",
                            "verse 53:24": "Gördünüz mü o Lât ve Uzzâ'yı?",
                            "verse 53:25": "Ve üçüncüleri olan ötekini, Menât'ı.",
                            "verse 53:26": "Demek erkek size, dişi O'na öyle mi?",
                            "verse 53:27": "O zaman bu, insafsızca bir taksim!",
                            "verse 53:28": "Bunlar (putlar), sizin ve atalarınızın taktığı isimlerden başka bir şey değildir.",
                            "verse 53:29": "Yoksa insan, her arzu ettiği şeye sahip mi olacaktır?",
                            "verse 53:30": "Ahiret de dünya da Allah'ındır.",
                            "verse 53:31": "Göklerde nice melek var ki onların şefaatleri, dilediği ve hoşnut olduğu kimse için Allah'ın izin vermesi dışında, bir işe yaramaz.",
                            "verse 53:32": "Ahirete inanmayanlar, meleklere dişilerin adlarını takıyorlar.",
                            "verse 53:33": "Halbuki onların bu hususta hiç bilgileri yoktur.",
                            "verse 53:34": "Onun için sen bizi anmaktan yüz çeviren ve dünya hayatından başka bir şey istemeyen kimselere yüz verme.",
                            "verse 53:35": "İşte onların erişebilecekleri bilgi budur.",
                            "verse 53:36": "Göklerde ve yerde bulunanlar hep Allah'ındır.",
                            "verse 53:37": "Ufak tefek kusurları dışında, büyük günahlardan ve edepsizliklerden kaçınanlara gelince, bil ki Rabbin, affı bol olandır.",
                            "verse 53:38": "Gördün mü arkasını döneni?",
                            "verse 53:39": "Azıcık verip sonra vermemekte direneni?",
                            "verse 53:40": "Acaba gaybın bilgisi kendi yanındadır da o görüyor mu? 36.",
                            "verse 53:41": "Ve",
                            "verse 53:42": "ahdine vefa gösteren İbrahim'in( sahifelerinde bulunan şu gerçekler):",
                            "verse 53:43": "Gerçekten hiçbir günahkâr, başkasının günah yükünü yüklenemez.",
                            "verse 53:44": "Bilsin ki insan için kendi çalışmasından başka bir şey yoktur.",
                            "verse 53:45": "Ve çalışması da ileride görülecektir.",
                            "verse 53:46": "Sonra ona karşılığı tastamam verilecektir.",
                            "verse 53:47": "Ve şüphesiz en son varış Rabbinedir.",
                            "verse 53:48": "Doğrusu güldüren de ağlatan da O'dur.",
                            "verse 53:49": "Öldüren de dirilten de O'dur.",
                            "verse 53:50": "Şurası muhakkak ki erkek ve dişiden ibaret olan iki çifti O yarattı.",
                            "verse 53:51": "(Rahime)",
                            "verse 53:52": "atıldığı zaman nutfeden.",
                            "verse 53:53": "Şüphesiz tekrar diriltmek de O'na aittir.",
                            "verse 53:54": "Zengin eden de yoksul kılan da O'dur.",
                            "verse 53:55": "Doğrusu Şi'râ yıldızının Rabbi de O'dur.",
                            "verse 53:56": "Ve şüphesiz ki önceki Âd kavmini O helâk etti.",
                            "verse 53:57": "Semûd'u da (O helâk etti) ve geriye hiçbir şey bırakmadı.",
                            "verse 53:58": "Daha önce de çok zalim ve pek azgın, olan Nuh kavmini (helâk etmişti).",
                            "verse 53:59": "Altüst olan şehirleri de o böyle yaptı.",
                            "verse 53:60": "Onların başına getireceğini getirdi!",
                            "verse 53:61": "Şimdi Rabbinin nimetlerinin hangisinde şüpheye düşersin.",
                            "verse 53:62": "İşte bu ilk uyarıcılardan bir uyarıcıdır.",
                            "verse 53:63": "Yaklaşan yaklaştı.",
                            "verse 53:64": "Onu (vaktini) Allah'tan başka açığa çıkaracak yoktur.",
                            "verse 53:65": "Şimdi siz bu söze (Kur'an'a) mı şaşıyorsunuz?",
                            "verse 53:66": "Gülüyorsunuz da ağlamıyorsunuz!",
                            "verse 53:67": "Ve siz gaflet içinde oyalanmaktasınız!",
                            "verse 53:68": "Haydi Allah'a secde edip O'na kulluk edin! oyalanmaktasınız!"
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "تارے کی قسم جب غائب ہونے لگے",
                            "verse 53:2": "قَسم ہے روشن ستارے (محمد صلي اللہ عليہ وآلہ وسلم) کي جب وہ (چشمِ زدن ميں شبِ معراج اوپر جا کر) نيچے اترےo",
                            "verse 53:3": "تمہيں (اپني) صحبت سے نوازنے والے (يعني تمہيں اپنے فيضِ صحبت سے صحابي بنانے والے رسول صلي اللہ عليہ وآلہ وسلم) نہ (کبھي) راہ بھولے اور نہ (کبھي) راہ سے بھٹکےo",
                            "verse 53:4": "کہ تمہارے رفیق (محمد) نہ رستہ بھولے ہیں نہ بھٹکے ہیں",
                            "verse 53:5": "اور نہ خواہش نفس سے منہ سے بات نکالتے ہیں",
                            "verse 53:6": "اور وہ (اپني) خواہش سے کلام نہيں کرتےo",
                            "verse 53:7": "اُن کا ارشاد سَراسَر وحي ہوتا ہے جو انہيں کي جاتي ہےo",
                            "verse 53:8": "یہ (قرآن) تو حکم خدا ہے جو (ان کی طرف) بھیجا جاتا ہے",
                            "verse 53:9": "ان کو نہایت قوت والے نے سکھایا",
                            "verse 53:10": "ان کو بڑي قوّتوں و الے (رب) نے (براہِ راست) علمِ (کامل) سے نوازاo",
                            "verse 53:11": "جو حسنِ مُطلَق ہے، پھر اُس (جلو? حُسن) نے (اپنے) ظہور کا ارادہ فرماياo",
                            "verse 53:12": "(یعنی جبرائیل) طاقتور نے پھر وہ پورے نظر آئے",
                            "verse 53:13": "اور وہ (آسمان کے) اونچے کنارے میں تھے",
                            "verse 53:14": "اور وہ (محمد صلي اللہ عليہ وآلہ وسلم شبِ معراج عالمِ مکاں کے) سب سے اونچے کنارے پر تھے (يعني عالَمِ خلق کي انتہاء پر تھے)o",
                            "verse 53:15": "پھر وہ (ربّ العزّت اپنے حبيب محمد صلي اللہ عليہ وآلہ وسلم سے) قريب ہوا پھر اور زيادہ قريب ہوگيا?o? يہ معني امام بخاري نے حضرت انس رضي اللہ عنہ سے الجامع الصحيح ميں روايت کيا ہے، مزيد حضرت عبد ا? بن عباس، امام حسن بصري، امام جعفر الصادق، محمد بن کعب القرظي التابعي، ضحّاک رضي اللہ عنہم اور ديگر کئي ائمہِ تفسير کا قول بھي يہي ہے?",
                            "verse 53:16": "پھر قریب ہوئے اوراَور آگے بڑھے",
                            "verse 53:17": "تو دو کمان کے فاصلے پر یا اس سے بھی کم",
                            "verse 53:18": "پھر (جلو? حق اور حبيبِ مکرّم صلي اللہ عليہ وآلہ وسلم ميں صرف) دو کمانوں کي مقدار فاصلہ رہ گيا يا (انتہائے قرب ميں) اس سے بھي کم (ہو گيا)o",
                            "verse 53:19": "پس (اُس خاص مقامِ قُرب و وصال پر) اُس (ا?) نے اپنے عبدِ (محبوب) کي طرف وحي فرمائي جو (بھي) وحي فرمائيo",
                            "verse 53:20": "پھر خدا نے اپنے بندے کی طرف جو بھیجا سو بھیجا",
                            "verse 53:21": "جو کچھ انہوں نے دیکھا ان کے دل نے اس کو جھوٹ نہ مانا",
                            "verse 53:22": "(اُن کے) دل نے اُس کے خلاف نہيں جانا جو (اُن کي) آنکھوں نے ديکھاo",
                            "verse 53:23": "کيا تم ان سے اِس پر جھگڑتے ہو کہ جو انہوں نے ديکھاo",
                            "verse 53:24": "کیا جو کچھ وہ دیکھتے ہیں تم اس میں ان سے جھگڑتے ہو؟",
                            "verse 53:25": "اور انہوں نے اس کو ایک بار بھی دیکھا ہے",
                            "verse 53:26": "اور بيشک انہوں نے تو اُس (جلو? حق) کو دوسري مرتبہ (پھر) ديکھا (اور تم ايک بار ديکھنے پر ہي جھگڑ رہے ہو)?o? يہ معني ابن عباس، ابوذر غفاري، عکرمہ التابعي، حسن البصري التابعي، محمد بن کعب القرظي التابعي، ابوالعاليہ الرياحي التابعي، عطا بن ابي رباح التابعي، کعب الاحبار التابعي، امام احمد بن حنبل اور امام ابوالحسن اشعري رضي اللہ عنہم اور ديگر ائمہ کے اَقوال پر ہے?",
                            "verse 53:27": "سِدر? المنتہ?ي کے قريبo",
                            "verse 53:28": "پرلی حد کی بیری کے پاس",
                            "verse 53:29": "اسی کے پاس رہنے کی جنت ہے",
                            "verse 53:30": "اسي کے پاس جنت الْمَاْو?ى ہےo",
                            "verse 53:31": "جب نورِ حق کي تجليّات سِدرَ? (المنتہ?ي) کو (بھي) ڈھانپ رہي تھيں جو کہ (اس پر) سايہ فگن تھيں?o? يہ معني بھي امام حسن بصري رضي اللہ عنہ و ديگر ائمہ کے اقوال پر ہے?",
                            "verse 53:32": "جب کہ اس بیری پر چھا رہا تھا جو چھا رہا تھا",
                            "verse 53:33": "ان کی آنکھ نہ تو اور طرف مائل ہوئی اور نہ (حد سے) آگے بڑھی",
                            "verse 53:34": "اُن کي آنکھ نہ کسي اور طرف مائل ہوئي اور نہ حد سے بڑھي (جس کو تکنا تھا اسي پر جمي رہي)o",
                            "verse 53:35": "بيشک انہوں نے (معراج کي شب) اپنے رب کي بڑي نشانياں ديکھيںo",
                            "verse 53:36": "انہوں نے اپنے پروردگار (کی قدرت) کی کتنی ہی بڑی بڑی نشانیاں دیکھیں",
                            "verse 53:37": "بھلا تم لوگوں نے لات اور عزیٰ کو دیکھا",
                            "verse 53:38": "کيا تم نے لات اور عز?ي (ديويوں) پر غور کيا ہےo",
                            "verse 53:39": "اور اُس تيسري ايک اور (ديوي) منات کو بھي (غور سے ديکھا ہے؟ تم نے انہيں ا? کي بيٹياں بنا رکھا ہے؟)o",
                            "verse 53:40": "اور تیسرے منات کو (کہ یہ بت کہیں خدا ہوسکتے ہیں)",
                            "verse 53:41": "(مشرکو!) کیا تمہارے لئے تو بیٹے اور خدا کے لئے بیٹیاں",
                            "verse 53:42": "(اے مشرکو!) کيا تمہارے لئے بيٹے ہيں اور اس (ا?) کے لئے بيٹياں ہيںo",
                            "verse 53:43": "(اگر تمہارا تصور درست ہے) تب تو يہ تقسيم بڑي ناانصافي ہےo",
                            "verse 53:44": "یہ تقسیم تو بہت بیانصافی کی ہے",
                            "verse 53:45": "وہ تو صرف نام ہی نام ہیں جو تم نے اور تمہارے باپ دادا نے گھڑ لئے ہیں۔ خدا نے تو ان کی کوئی سند نازل نہیں کی۔ یہ لوگ محض ظن (فاسد) اور خواہشات نفس کے پیچھے چل رہے ہیں۔ حالانکہ ان کے پروردگار کی طرف سے ان کے پاس ہدایت آچکی ہے",
                            "verse 53:46": "مگر (حقيقت يہ ہے کہ) وہ (بت) محض نام ہي نام ہيں جو تم نے اور تمہارے باپ دادا نے رکھ لئے ہيں? ا? نے ان کي نسبت کوئي دليل نہيں اتاري، وہ لوگ محض وہم و گمان کي اور نفساني خواہشات کي پيروي کر رہے ہيں حالانکہ اُن کے پاس اُن کے رب کي طرف سے ہدايت آچکي ہےo",
                            "verse 53:47": "کيا انسان کے لئے وہ (سب کچھ) ميسّر ہے جس کي وہ تمنا کرتا ہےo",
                            "verse 53:48": "کیا جس چیز کی انسان آرزو کرتا ہے وہ اسے ضرور ملتی ہے",
                            "verse 53:49": "آخرت اور دنیا تو الله ہی کے ہاتھ میں ہے",
                            "verse 53:50": "پس آخرت اور دنيا کا مالک تو ا? ہي ہےo",
                            "verse 53:51": "اور آسمانوں ميں کتنے ہي فرشتے ہيں (کہ کفّار و مشرکين اُن کي عبادت کرتے اور ان سے شفاعت کي اميد رکھتے ہيں) جِن کي شفاعت کچھ کام نہيں آئے گي مگر اس کے بعد کہ ا? جسے چاہتا ہے اور پسند فرماتا ہے اُس کے لئے اِذن (جاري) فرما ديتا ہےo",
                            "verse 53:52": "اور آسمانوں میں بہت سے فرشتے ہیں جن کی سفارش کچھ بھی فائدہ نہیں دیتی مگر اس وقت کہ خدا جس کے لئے چاہے اجازت بخشے اور (سفارش) پسند کرے",
                            "verse 53:53": "جو لوگ آخرت پر ایمان نہیں لاتے وہ فرشتوں کو (خدا کی) لڑکیوں کے نام سے موسوم کرتے ہیں",
                            "verse 53:54": "بيشک جو لوگ آخرت پر ايمان نہيں رکھتے وہ فرشتوں کو عورتوں کے نام سے موسوم کر ديتے ہيںo",
                            "verse 53:55": "اور انہيں اِس کا کچھ بھي علم نہيں ہے، وہ صرف گمان کے پيچھے چلتے ہيں، اور بيشک گمان يقين کے مقابلے ميں کسي کام نہيں آتاo",
                            "verse 53:56": "حالانکہ ان کو اس کی کچھ خبر نہیں۔ وہ صرف ظن پر چلتے ہیں۔ اور ظن یقین کے مقابلے میں کچھ کام نہیں آتا",
                            "verse 53:57": "تو جو ہماری یاد سے روگردانی اور صرف دنیا ہی کی زندگی کا خواہاں ہو اس سے تم بھی منہ پھیر لو",
                            "verse 53:58": "سو آپ اپني توجّہ اس سے ہٹا ليں جو ہماري ياد سے رُوگرداني کرتا ہے اور سوائے دنيوي زندگي کے اور کوئي مقصد نہيں رکھتاo",
                            "verse 53:59": "اُن لوگوں کے علم کي رسائي کي يہي حد ہے، بيشک آپ کا رب اس شخص کو (بھي) خوب جانتا ہے جو اُس کي راہ سے بھٹک گيا ہے اور اس شخص کو (بھي) خوب جانتا ہے جِس نے ہدايت پا لي ہےo",
                            "verse 53:60": "ان کے علم کی انتہا یہی ہے۔ تمہارا پروردگار اس کو بھی خوب جانتا ہے جو اس کے رستے سے بھٹک گیا اور اس سے بھی خوب واقف ہے جو رستے پر چلا",
                            "verse 53:61": "اور جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے سب خدا ہی کا ہے (اور اس نے خلقت کو) اس لئے (پیدا کیا ہے) کہ جن لوگوں نے برے کام کئے ان کو ان کے اعمال کا (برا) بدلا دے اور جنہوں نے نیکیاں کیں ان کو نیک بدلہ دے",
                            "verse 53:62": "اور ا? ہي کے لئے ہے جو کچھ آسمانوں اور جو کچھ زمين ميں ہے تاکہ جن لوگوں نے برائياں کيں انہيں اُن کے اعمال کا بدلہ دے اور جن لوگوں نے نيکياں کيں انہيں اچھا اجر عطا فرمائےo",
                            "verse 53:63": "جو لوگ چھوٹے گناہوں (اور لغزشوں) کے سوا بڑے گناہوں اور بے حيائي کے کاموں سے پرہيز کرتے ہيں، بيشک آپ کا رب بخشش کي بڑي گنجائش رکھنے والا ہے، وہ تمہيں خوب جانتا ہے جب اس نے تمہاري زندگي کي ابتداء اور نشو و نما زمين (يعني مٹي) سے کي تھي اور جبکہ تم اپني ماؤں کے پيٹ ميں جَنيِن (يعني حمل) کي صورت ميں تھے، پس تم اپنے آپ کو بڑا پاک و صاف مَت جتايا کرو، وہ خوب جانتا ہے کہ (اصل) پرہيزگار کون ہےo",
                            "verse 53:64": "جو صغیرہ گناہوں کے سوا بڑے بڑے گناہوں اور بیحیائی کی باتوں سے اجتناب کرتے ہیں۔ بیشک تمہارا پروردگار بڑی بخشش والا ہے۔ وہ تم کو خوب جانتا ہے۔ جب اس نے تم کو مٹی سے پیدا کیا اور جب تم اپنی ماؤں کے پیٹ میں بچّے تھے۔ تو اپنے آپ کو پاک صاف نہ جتاؤ۔ جو پرہیزگار ہے وہ اس سے خوب واقف ہے",
                            "verse 53:65": "بھلا تم نے اس شخص کو دیکھا جس نے منہ پھیر لیا",
                            "verse 53:66": "کيا آپ نے اس شخص کو ديکھا جس نے (حق سے) منہ پھير لياo",
                            "verse 53:67": "اور اس نے (راہِ حق ميں) تھوڑا سا (مال) ديا اور (پھر ہاتھ) روک لياo",
                            "verse 53:68": "اور تھوڑا سا دیا (پھر) ہاتھ روک لیا",
                            "verse 53:69": "کیا اس کے پاس غیب کا علم ہے کہ وہ اس کو دیکھ رہا ہے",
                            "verse 53:70": "کيا اس کے پاس غيب کا علم ہے کہ وہ ديکھ رہا ہےo",
                            "verse 53:71": "کيا اُسے اُن (باتوں) کي خبر نہيں دي گئي جو موس?ي (عليہ السلام) کے صحيفوں ميں (مذکور) تھيںo",
                            "verse 53:72": "کیا جو باتیں موسیٰ کے صحیفوں میں ہیں ان کی اس کو خبر نہیں پہنچی",
                            "verse 53:73": "اور ابراہیم کی جنہوں نے (حق طاعت ورسالت) پورا کیا",
                            "verse 53:74": "اور ابراہيم (عليہ السلام) کے (صحيفوں ميں تھيں) جنہوں نے (ا? کے ہر امر کو) بتمام و کمال پورا کياo",
                            "verse 53:75": "کہ کوئي بوجھ اٹھانے والا کسي دوسرے (کے گناہوں) کا بوجھ نہيں اٹھائے گاo",
                            "verse 53:76": "یہ کہ کوئی شخص دوسرے (کے گناہ) کا بوجھ نہیں اٹھائے گا",
                            "verse 53:77": "اور یہ کہ انسان کو وہی ملتا ہے جس کی وہ کوشش کرتا ہے",
                            "verse 53:78": "اور يہ کہ انسان کو (عدل ميں) وہي کچھ ملے گا جس کي اُس نے کوشش کي ہوگي (رہا فضل اس پر کسي کا حق نہيں وہ محض ا? کي عطاء و رضا ہے جس پر جتنا چاہے کر دے)o",
                            "verse 53:79": "اور يہ کہ اُس کي ہر کوشش عنقريب دکھا دي جائے گي (يعني ظاہر کر دي جائے گي)o",
                            "verse 53:80": "اور یہ کہ اس کی کوشش دیکھی جائے گی",
                            "verse 53:81": "پھر اس کو اس کا پورا پورا بدلا دیا جائے گا",
                            "verse 53:82": "پھر اُسے (اُس کي ہر کوشش کا) پورا پورا بدلہ ديا جائے گاo",
                            "verse 53:83": "اور يہ کہ (بالآخر سب کو) آپ کے رب ہي کي طرف پہنچنا ہےo",
                            "verse 53:84": "اور یہ کہ تمہارے پروردگار ہی کے پاس پہنچنا ہے",
                            "verse 53:85": "اور یہ کہ وہ ہنساتا اور رلاتا ہے",
                            "verse 53:86": "اور يہ کہ وہي (خوشي دے کر) ہنساتا ہے اور (غم دے کر) رُلاتا ہےo",
                            "verse 53:87": "اور يہ کہ وہي مارتا ہے اور جِلاتا ہےo",
                            "verse 53:88": "اور یہ کہ وہی مارتا اور جلاتا ہے",
                            "verse 53:89": "اور یہ کہ وہی نر اور مادہ دو قسم (کے حیوان) پیدا کرتا ہے",
                            "verse 53:90": "اور يہ کہ اُسي نے نَر اور مادہ دو قِسموں کو پيدا کياo",
                            "verse 53:91": "نطفہ (ايک توليدي قطرہ) سے جبکہ وہ (رَحمِ مادہ ميں) ٹپکايا جاتا ہےo",
                            "verse 53:92": "(یعنی) نطفے سے جو (رحم میں) ڈالا جاتا ہے",
                            "verse 53:93": "اور یہ کہ (قیامت کو) اسی پر دوبارہ اٹھانا لازم ہے",
                            "verse 53:94": "اور يہ کہ (مرنے کے بعد) دوبارہ زندہ کرنا (بھي) اسي پر ہےo",
                            "verse 53:95": "اور يہ کہ وہي (بقدرِ ضرورت دے کر) غني کر ديتا ہے اور وہي (ضرورت سے زائد دے کر) خزانے بھر ديتا ہےo",
                            "verse 53:96": "اور یہ کہ وہی دولت مند بناتا اور مفلس کرتا ہے",
                            "verse 53:97": "اور یہ کہ وہی شعریٰ کا مالک ہے",
                            "verse 53:98": "اور يہ کہ وہي شِعر?ي (ستارے) کا رب ہے (جس کي دورِ جاہليت ميں پوجا کي جاتي تھي)o",
                            "verse 53:99": "اور يہ کہ اسي نے پہلي (قومِ) عاد کو ہلاک کياo",
                            "verse 53:100": "اور یہ کہ اسی نے عاد اول کو ہلاک کر ڈالا",
                            "verse 53:101": "اور ثمود کو بھی۔ غرض کسی کو باقی نہ چھوڑا",
                            "verse 53:102": "اور (قومِ) ثمود کو (بھي)، پھر (ان ميں سے کسي کو) باقي نہ چھوڑاo",
                            "verse 53:103": "اور اس سے پہلے قومِ نوح کو (بھي ہلاک کيا)، بيشک وہ بڑے ہي ظالم اور بڑے ہي سرکش تھےo",
                            "verse 53:104": "اور ان سے پہلے قوم نوح کو بھی۔ کچھ شک نہیں کہ وہ لوگ بڑے ہی ظالم اور بڑے ہی سرکش تھے",
                            "verse 53:105": "اور اسی نے الٹی ہوئی بستیوں کو دے پٹکا",
                            "verse 53:106": "اور (قومِ لُوط کي) الٹي ہوئي بستيوں کو (اوپر اٹھا کر) اُسي نے نيچے دے پٹکاo",
                            "verse 53:107": "پس اُن کو ڈھانپ ليا جس نے ڈھانپ ليا (يعني پھر اُن پر پتھروں کي بارش کر دي گئي)o",
                            "verse 53:108": "پھر ان پر چھایا جو چھایا",
                            "verse 53:109": "تو (اے انسان) تو اپنے پروردگار کی کون سی نعمت پر جھگڑے گا",
                            "verse 53:110": "سو (اے انسان!) تو اپنے پروردگار کي کن کن نعمتوں ميں شک کرے گاo",
                            "verse 53:111": "يہ (رسولِ اکرم صلي اللہ عليہ وآلہ وسلم بھي) اگلے ڈر سنانے والوں ميں سے ايک ڈر سنانے والے ہيںo",
                            "verse 53:112": "یہ (محمد) بھی اگلے ڈر سنانے والوں میں سے ایک ڈر سنانے والے ہیں",
                            "verse 53:113": "آنے والی (یعنی قیامت) قریب آ پہنچی",
                            "verse 53:114": "آنے والي (قيامت کي گھڑي) قريب آپہنچيo",
                            "verse 53:115": "ا? کے سوا اِسے کوئي ظاہر (اور قائم) کرنے والا نہيں ہےo",
                            "verse 53:116": "اس (دن کی تکلیفوں) کو خدا کے سوا کوئی دور نہیں کرسکے گا",
                            "verse 53:117": "اے منکرین خدا) کیا تم اس کلام سے تعجب کرتے ہو؟",
                            "verse 53:118": "پس کيا تم اس کلام سے تعجب کرتے ہوo",
                            "verse 53:119": "اور تم ہنستے ہو اور روتے نہيں ہوo",
                            "verse 53:120": "اور ہنستے ہو اور روتے نہیں؟",
                            "verse 53:121": "اور تم غفلت میں پڑ رہے ہو",
                            "verse 53:122": "اور تم (غفلت کي) کھيل ميں پڑے ہوo",
                            "verse 53:123": "سو ا? کے لئے سجدہ کرو اور (اُس کي) عبادت کروo",
                            "verse 53:124": "تو خدا کے آگے سجدہ کرو اور (اسی کی) عبادت کرو کروo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 53:1": "Ботаётган юлдуз билан қасам.",
                            "verse 53:2": "Сизнинг биродарингиз адашгани ҳам, йўлдан озгани ҳам йўқ.",
                            "verse 53:3": "У ҳаводан нутқ қилмас.",
                            "verse 53:4": "У (Қуръон) ваҳийдан ўзга нарса эмас.",
                            "verse 53:5": "Унга шиддатли қувват эгаси ўргатди.",
                            "verse 53:6": "Миррат эгаси.",
                            "verse 53:7": "Ва у олий уфқда эди.",
                            "verse 53:8": "Сўнгра яқинлашди ва жуда ҳам яқин бўлди.",
                            "verse 53:9": "Бас, икки камон миқдоридай жойгда бўлди.",
                            "verse 53:10": "Ва У зот бандасига нимани ваҳий қилган бўлса, етказди.",
                            "verse 53:11": "Қалб (кўз) кўрганини ёлғонга чиқармади.",
                            "verse 53:12": "У билан ўзи кўрган нарса устида тортишасизларми?!",
                            "verse 53:13": "Ва дарҳақиқат, уни бошқа сафар кўрди.",
                            "verse 53:14": "Тугаш дарахти олдида.",
                            "verse 53:15": "У(дарахт)нинг ҳузурида маъво жаннати бор.",
                            "verse 53:16": "Ўшанда, дарахтни ўрайдиган нарса ўраб турибди.",
                            "verse 53:17": "Нигоҳ бурилмади ҳам, ҳаддидан ошмади ҳам.",
                            "verse 53:18": "Дарҳақиқат, Ўз Роббисининг улкан белгиларидан кўрди.",
                            "verse 53:19": "Лот ва Уззони ўйлаб кўрдингизми?",
                            "verse 53:20": "Ва бошқаси-учинчиси Манотни ҳам?",
                            "verse 53:21": "Сизларга эркаг-у, У зотга аёлми?",
                            "verse 53:22": "Ундоқ бўлса, бу нотўғри тақсим-ку!",
                            "verse 53:23": "У(бут)лар сиз ва ота-боболарингиз қўйган номлардан ўзга ҳеч нарса эмас.",
                            "verse 53:24": "Ёки ҳар инсон нимани хоҳласа, шу бўлурми?",
                            "verse 53:25": "Зеро, охират ҳам, дунё ҳам Аллоҳникидир.",
                            "verse 53:26": "Осмонларда қанчадан-қанча фаришталар мавжуд, уларнинг шафоати ҳеч фойда бермас.",
                            "verse 53:27": "Албатта, охиратга иймон келтирмаганлар фаришталарни аёл номи билан номларлар.",
                            "verse 53:28": "Уларда бу ҳақда ҳеч қандай илм йўқ.",
                            "verse 53:29": "Бизнинг зикримизга орқа ўгирган, ҳаёти дунёдан бошқани хоҳламайдиганлардан юз ўгир.",
                            "verse 53:30": "Уларнинг эришган илмлари мана шу.",
                            "verse 53:31": "Осмонлару ердаги барча нарсалар Аллоҳникидир.",
                            "verse 53:32": "Улар кичик гуноҳлардан бошқа катта гуноҳлар ва фаҳш ишлардан четда бўладиганлардир.",
                            "verse 53:33": "Юз ўгириб кетганни кўрмадингми?!",
                            "verse 53:34": "У озгина берди ва тўхтатди.",
                            "verse 53:35": "Унинг ҳузурида ғайб илми бору, у кўриб турибдими?! (Ғайбни фақат Аллоҳ билиб, бошқа ҳеч ким билмаслиги аниқ.",
                            "verse 53:36": "Ёки Мусонинг саҳифаларидаги сўзлар хабари унга берилмадими?",
                            "verse 53:37": "Ва вафо қилган Иброҳимнинг?",
                            "verse 53:38": "«Ҳеч бир гуноҳкор жон бошқанинг гуноҳини кўтармас.",
                            "verse 53:39": "Ҳар бир инсонга ўз қилганидан бошқа нарса йўқ.",
                            "verse 53:40": "Ва, албатта, унинг қилмиши тезда кўринар.",
                            "verse 53:41": "Сўнгра жазо ёки мукофоти тўлиқ берилар», деб.",
                            "verse 53:42": "Ва, албатта,интиҳо Роббинг ҳузуридадир.",
                            "verse 53:43": "Ва, албатта, кулдирган ҳам Ўзи, йиғлатган ҳам Ўзи.",
                            "verse 53:44": "Албатта, ўлдирган ҳам Ўзи, тирилтирган ҳам Ўзи.",
                            "verse 53:45": "Албатта, икки жуфтни; эркак ва аёлни яратган ҳам Ўзи.",
                            "verse 53:46": "Нутфадан, оқиб тушганда.",
                            "verse 53:47": "Ва, албатта, кейинги пайдо қилиш зиммасидаги зот ҳам Ўзи.",
                            "verse 53:48": "Ва, албатта, беҳожат қилган ҳам Ўзи, бадавлат қилган ҳам Ўзи.",
                            "verse 53:49": "Ва, албатта Шеъронинг Роббиси ҳам Унинг Ўзи.",
                            "verse 53:50": "Ва, албатта, биринчи Одни ҳалок қилган ҳам Ўзи.",
                            "verse 53:51": "Ва Самудни боқий қолдирмаган ҳам Ўзи.",
                            "verse 53:52": "Ва бундан олдин Нуҳ қавмини (ҳалок қилган ҳам Ўзи).",
                            "verse 53:53": "Ва тўнтарилганни қулатган (ҳам Ўзи).",
                            "verse 53:54": "Бас, уларни ўраган нарса ўраб олди.",
                            "verse 53:55": "Шундай экан, Роббингнинг қайси неъматларига шак келтирасан?",
                            "verse 53:56": "Бу аввалги огоҳлантирувчилар каби бир огоҳлантирувчидир.",
                            "verse 53:57": "Яқинлашувчи яқинлашди.",
                            "verse 53:58": "Уни Аллоҳдан бошқа кашф қилувчи йўқ.",
                            "verse 53:59": "Бу сўздан сизлар ажабланасизларми?",
                            "verse 53:60": "Ва куласизлар-у, йиғламайсизларми?",
                            "verse 53:61": "Ва ҳолбуки, сизлар бепарвосизлар.",
                            "verse 53:62": "Бас, ллоҳга сажда ва ибодат қилинглар."
                        }
                    }
                }
            }
        }
    }
}