{
    "id": 58,
    "name_simple": "Al-Mujadila",
    "revelation_place": "madinah",
    "revelation_order": 105,
    "bismillah_pre": true,
    "verses_count": 22,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "This Surah is entitled Al Mujadalah as well as Al Mujadilah, the title being derived from the word tujadiluka of the very first verse. As at the outset mention has been made of the woman who pleaded with the Holy Prophet (upon whom be Allah's peace) the case of zihar pronounced by her husband and urged him to suggest a way out of the difficult situation in order to save her and, her children's life from ruin, and Allah has described her pleading by the word 'mujadalah', the Surah came to be known by this very title. If it is read as 'mujadalah', it would mean 'pleading and arguing', and if it is read as 'mujadilah', it would mean 'the woman who pleaded and argued.'",
    "text": [
        "\n",
        "This Surah is entitled Al Mujadalah as well as Al Mujadilah, the title being derived from the word tujadiluka of the very first verse. As at the outset mention has been made of the woman who pleaded with the Holy Prophet (upon whom be Allah's peace) the case of zihar pronounced by her husband and urged him to suggest a way out of the difficult situation in order to save her and, her children's life from ruin, and Allah has described her pleading by the word \"mujadalah \", the Surah came to be known by this very title. If it is read as \"mujadalah \",it would mean \"pleading and arguing\", and if it is read as \"mujadilah \", it would mean \"the woman who pleaded and argued.\"",
        "\n",
        "Period of Revelation",
        "\n",
        "There is no tradition to tell as to when this incident of pleading and arguing took place, but there is a hint in the subject matter of the Surah on the basis of which it can be said with certainty that it happened some time after the battle of the Trench (Shawwal, 5 A. H.). In Surah Al-Ahzab, Allah while negating that an adopted son could be one's real son, had just said this and no more; \"And Allah has not made those of your wives whom you divorce by zihar your mothers.\" But in that Surah there was nothing to the effect that to divorce a wife by zihar was a sin or a crime, nor anything about the legal injunction concerning it. Contrary to it, in this Surah the whole law relating to zihar has been laid down, which shows that these detailed injunctions were sent down some time after the brief reference to it in Surah Al- Ahzab.",
        "\n",
        "Subject Matter and Topics",
        "\n",
        "In this Surah instructions have been given to the Muslims about the different problems that confronted them at that time.",
        "\n",
        "From the beginning of the Surah to verse 6 legal injunctions about zihar have been given, along with which the Muslims have been strictly warned that it is contrary to their profession of the Faith that they should still persist in the practices of ignorance after they have accepted Islam, that they should break the bounds set by Allah, or refuse to abide by them, or that they should make their own rules and regulations contradictory to them. For this there is not only the punishment of disgrace and humiliation in the world but in the Hereafter too there will be strict accountability for it.",
        "\n",
        "In vv. 7-10 the hypocrites have been taken to task for their secret whisperings and consultations by which they conspired and intrigued against the \"Holy Prophet (upon whom be Allah's peace and blessings), and because of their hidden malice and grudge greeted him, like the Jews, in a manner as to wish him ill instead of well. In this connection, the Muslims have been consoled, as if to say: \"These whisperings of the hypocrites can do no harm to you; therefore, you should go on doing your duty with full trust in Allah\". Besides, they have also been taught this moral lesson:\"The true believers, when they talk secretly together, do not talk of sin and transgression and disobedience to the Messenger if they have to talk secretly together they should talk of goodness and piety.\"",
        "\n",
        "In vv. 11-13 the Muslims have been taught certain manners of social behavior and given instructions to eradicate certain social evils which were prevalent among the people then as they are today. If some people are sitting in an assembly, and more people arrive, they do not show even the courtesy as to squeeze in so as to make room for others, with the result that the new-comers have to keep standing, or to sit in the door-way, or to go back, or seeing that there is enough room yet start jumping over the people's heads to find room for themselves. This often used to be experienced in the Holy Prophet's assemblies. Therefore, Allah gave the instruction, as if to say:\"Do not behave selfishly and narrow mindedly in your assemblies but do accommodate the new-comers also with an open heart.\"",
        "\n",
        "Likewise, another vice found among the people is that when they go on a visit to somebody (an important person, in particular), they prolong their sitting and do not at all mind that encroaching upon his time unduly would cause him hardship. Then, if he tells them to leave, they mind it; if he himself rises up from their assembly, they complain of his lack of manners; if he tells them indirectly that he has some other business also to attend to, for which he needs time, they turn a deaf ear to his request. The Holy Prophet (upon whom be Allah's peace) himself also had to experience such misconduct of the people, who in their earnestness to benefit by his teaching did not at all see that they were wasting his precious time so badly needed for other important works. At last, Allah in order to eradicate this bad manner, enjoined that when the people are asked to rise up from an assembly, they should rise up and disperse.",
        "\n",
        "Another vice prevalent among the people was that each person wished to have secret counsel individually with the Holy Prophet (upon whom be Allah's peace) without any real need, or would like that he should approach him during an assembly and whisper something to him. This was not only embarrassing for the Holy Prophet but also annoying for the people who sat in the assembly. That is why Allah imposed the restriction that anyone who wanted to consult him in private, should first give away something in charity. The object was that the people should be warned of this bad manner and made to give it up. Thus, the restriction was kept in force for a short while, and when the people had corrected their behavior, it was withdrawn.",
        "\n",
        "From verse 14 to the end of the Surah members of the Muslim society, which was a mixture of the sincere Muslims and the hypocrites and the waverers, have been told plainly as to what is the criterion of sincerity in Islam. One kind of Muslims are those who are friends with the enemies of Islam: they do not hesitate for the sake of their interests to be treacherous to the religion which they profess to believe in; they spread all sorts of doubts and suspicions against Islam and prevent the people from adopting the Way of Allah. But since they are part of the Muslim community their false profession of Faith serves them as a cover and shield. The second kind of Muslims are those who, in the matter of Allah's Religion, do not care even for their own father, brother, children, and family, to say nothing of others. They do not cherish any feeling of love for the person who is an enemy of God and His Messenger and His Religion. Allah in these verses has explicitly stated that the\r\npeople of the first kind, in fact, belong to Satan's party however hard they may try to convince others of their Islam by swearing oaths. And the honor of belonging to Allah's party is possessed only by the Muslims of the second kind. They alone are the true Muslims: they alone will attain to true success, and with them alone is Allah well pleased.",
        "\n"
    ],
    "description": "The surah that mentions the complaint of Khawlah bint Thaʿlabah to the Prophet as The Pleader for dignity of women against the abominable practice whereby husbands estranged their wives from intimacy on false pretext. It takes its name from the phrase “pleads with you” (tujādiluka) mentioned in verse 1. The surah disallows a specific pagan divorce practice. It goes on to state that those who oppose God and His messenger, who secretly ally themselves with Satan, who lie in their oaths and make intrigues against the Prophet, will be defeated and suer humiliation both in this world and in the next (verse 5 and verse 20), while those on God’s side will triumph (verse 22).The surah is also known as: She Who Argued, She Who Pleaded, The Disputant, The Dispute, The Disputer, The Disputing Woman, The Pleading Woman, The Woman Who Pleads.",
    "name_translation": "THE PLEADER",
    "name_complex": "Al-Mujâdilah",
    "surah_name_ar": "المجادلة",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 58:1": "Perëndia i ka dëgjuar fjalët e asaj që u ankua në burrin e vet dhe i rrënkohej Perëndisë.",
                            "verse 58:2": "Ka të tillë midis jush që i lëshojnë gratë e veta duke ju thënë se i konsiderojnë si nënat e veta; ato nuk janë nënat e tyre, nënat e tyre janë vetëm ato që i kanë lindur ata.",
                            "verse 58:3": "Ata, të cilët, gratë e tyre i lëshojnë në atë mënyrë, e pastaj donë t’i kthejnë në gjendjen e mëparshme, duhet ta lirojnë një skllav apo skllave, para se bashkëshortët të takohen përsëri (si burrë e grua).",
                            "verse 58:4": "Ai që nuk ka, (prandaj) nuk mund ta lirojë, është i obliguar që të agjërojë dy muaj rresht para takimit të tyre bashkëshortorë.",
                            "verse 58:5": "Me të vërtetë, ata që sillen në mënyrë kundërshtuese ndaj Perëndisë dhe të dërguarit të Tij, do të shkatërrohen, sikundër që janë shkatërruar ata para tyre.",
                            "verse 58:6": "në Ditën kur Perëndia i ngjallë të gjithë e i lajmëron Ai për veprat që kanë punuar.",
                            "verse 58:7": "A nuk e di ti se Perëndia di çdo gjë që është në qiej dhe në Tokë? Nuk ka bisedë sekrete midis treve (personave), e që Ai (Perëndia), të mos jetë i katërti, as midis të pestëve, e që Ai të mos jetë i gjashti, as kur janë më pak as kur janë më shumë, e që Ai të mos jetë me ata (i dëgjon), kudo që të jenë; Ai në Ditën e gjykimit do t’i informojë ata se çka kanë punuar, se, me të vërtetë, Perëndia di çdo gjë!",
                            "verse 58:8": "A nuk i sheh ata të cilëve u është ndaluar biseda e fshehtë, e megjithatë, kthehen në atë çka u është ndaluar dhe bisedojnë mes tyre mbi mëkatet, armiqësinë dhe padëgjueshmërinë ndaj Profetit.",
                            "verse 58:9": "O besimtarë! Kur bisedoni mes jush, mos bisedoni për mëkate, armiqësi dhe padëgjueshmëri ndaj Profetit; por bisedoni për mirësi dhe ndershmëri.",
                            "verse 58:10": "Bisedat e fshehta vijnë nga djalli, për t’i dëshpëruar besimtarët; por ai nuk mund t’ju shkaktojë kurrfarë të keqe, përveç nëse Perëndia e lejon atë (dëm).",
                            "verse 58:11": "O besimtarë! Kur ju thuhet: “Bëni vend të tjerëve në ndejat tuaja!” – ju bëni vend, e madje Perëndia ju zgjëron juve.",
                            "verse 58:12": "O besimtarë, kur të doni të këshilloheni me Profetin, para këshillimit jepni lëmoshë, ajo është më mire dhe më pastër për ju.",
                            "verse 58:13": "A mos po frikoheni që para këshillimit tuaj të jepni lëmoshë?! E nëse nuk jepni, e Perëndia ju ka falur, atëherë kryeni namazin dhe jepini zeqatin dhe dëgjoni Perëndinë e Profetin e Tij.",
                            "verse 58:14": "A nuk i sheh ata, të cilët shoqërohen me njerëzit, ndaj të cilëve Perëndia është i zemruar? Ata nuk janë as nga ju as nga ata, e madje, betohen rrejshëm duke qenë të vetëdijshëm (për të)",
                            "verse 58:15": "Perëndia atyre u ka përgatitur denim të rëndë, sepse, me të vërtetë, janë të shëmtuara ato që punojnë:",
                            "verse 58:16": "betimet e tyre i kanë bërë perde, andaj i pengojnë nga rruga e Perëndisë; ata i prêt dënimi i poshtëruar.",
                            "verse 58:17": "As pasuria, as fëmijët e tyre, nuk do t’u ndihmojnë aspak te Perëndia, ata do të jenë banorë të zjarrit, ku do të qëndrojnë përgjithmonë.",
                            "verse 58:18": "Në Ditën kur Perëndia do t’i ngjallë të gjithë, ata do t’i betohen Atij, sikundër që ju kanë betuar juve, duke menduar se do të kenë fare dobie prej saj.",
                            "verse 58:19": "Ata i ka mbizotëruar djalli dhe i ka bërë që ta harrojnë Perëndinë.",
                            "verse 58:20": "Ata që kundërshtojnë Perëndinë dhe Profetin e Tij, do të jenë në shkallën më të poshtëruar.",
                            "verse 58:21": "Perëndia ka shkruar (në Librin e shenjtë “Levhi Mahfudh”): “Unë dhe profetët e Mi do të fitojmë me siguri!” – Perëndia, me të vërtetë, është i fortë dhe i Plotëfuqishëm.",
                            "verse 58:22": "Nuk gjen njerëz që besojnë në Perëndinë dhe në Ditën e Kijametit, e të ushqejnë dashuri ndaj atyre të cilët kundërshtojnë Perëndinë dhe Profetin e Tij, madje qofshin ata edhe etërit e tyre, ose bijtë e tyre, ose vëllezërit e tyre, ose farefisi i tyre."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "(Ya Peyğəmbər!) Əri barəsində səninlə mübahisə edən və Allaha şikayət edən qadının sözünü Allah eşitdi.",
                            "verse 58:2": "Sizdən öz qadınları ilə zihar edən kimsələrin zövcələri (əslində) onların anaları deyillər.",
                            "verse 58:3": "Qadınları ilə zihar (qanuni nikahlarını özlərinə haram) edib, sonra sözlərindən dönənlər onlarla yaxınlıq etməzdən əvvəl (kəffarə vermək üçün) bir kölə azad etməlidirlər.",
                            "verse 58:4": "Kim (azad etməyə bir kölə) tapmasa, qadını ilə yaxınlıq etməzdən əvvəl iki ay sərasər oruc tutmalı, buna da gücü çatmasa, altmış yoxsulu yedirdib doydurmalıdır.",
                            "verse 58:5": "Allah və Onun Peyğəmbəri əleyhinə çıxanlar, özlərindən əvvəlkilər nə cür rüsvay olmuşlarsa, o cür rüsvay olacaqlar.",
                            "verse 58:6": "Allah onların hamısını dirildəcəyi gün etdikləri əməlləri onlara xəbər verəcəkdir.",
                            "verse 58:7": "(Ya Peyğəmbər!) Məgər görmürsənmi ki, Allah göylərdə və yerdə nə varsa, (hamısını) bilir.",
                            "verse 58:8": "(Ya Peyğəmbər!) Məgər məxfi danışmaq qadağan edildikdən sonra yenə də qadağan olunduqları əmələ qayıdıb günah, ədavət və Peyğəmbərin əleyhinə çıxmaq barədə öz aralarında pıçıldaşanları (münafiqlərlə yəhudiləri) görmədinmi? Onlar yanına gəldikləri zaman səni Allahın salamladığı kimi salamlamır (\"əssəlamu əleykə\" əvəzinə \"əsammu əleykə - sənə ölüm olsun!\" - deyərək guya salam verir) və ürəklərində: \"(Əgər Məhəmməd həqiqi peyğəmbərdirsə) bəs niyə Allah bizi dediklərimizə görə əzaba düçar etmir?\" - deyirlər.",
                            "verse 58:9": "Ey iman gətirənlər! Bir-birinizlə xəlvət danışdığınız zaman günah, düşmənçilik və Peyğəmbərin əleyhinə çıxmaq barədə danışmayın; yaxşı işlər, Allahdan qorxmaq barədə danışın və (qiyamət günü) hüzuruna toplanacağınız Allahdan qorxun!",
                            "verse 58:10": "Şübhəsiz ki, (bir yerə yığışıb günaha, düşmənçiliyə bais olan) məxfi danışma (pıçıldaşma) iman gətirənləri mə'yus edib kədərləndirmək üçün olan Şeytan əməlindəndir.",
                            "verse 58:11": "Ey iman gətirənlər! Sizə: \"Məclislərdə (mö'min qardaşlarınıza) yer verin!\" - deyildiyi zaman (onlara) yer verin ki, Allah da sizə (Cənnətdə) geniş yer versin.",
                            "verse 58:12": "Ey iman gətirənlər! Peyğəmbərlə (hər hansı bir iş barəsində) məxfi danışacağınız zaman bu danışıqdan əvvəl (ona hörmət əlaməti olaraq yoxsullara) sədəqə verin.",
                            "verse 58:13": "Məgər siz (Peyğəmbərlə) məxfi danışmazdan əvvəl sədəqə verməkdən qorxdunuzmu? Madam ki, siz (bunu) etmədiniz (sədəqə vermədiniz) və Allah da tövbənizi qəbul buyurdu, onda namaz qılıb zəkat verin, Allaha və Onun Peyğəmbərinə itaət edin.",
                            "verse 58:14": "(Ya Peyğəmbər!) Məgər onların (münafiqlərin) Allahın qəzəbləndiyi bir tayfanı (yəhudiləri) özlərinə dost tutduqlarını (mö'min müsəlmanların sirlərini onlara verdiklərini) görmədinmi? Onlar nə sizdəndirlər, nə də onlardan.",
                            "verse 58:15": "Allah onlar üçün şiddətli bir əzab hazırlamışdır.",
                            "verse 58:16": "Onlar andlarını özlərinə sipər etdilər və (xalqı) Allah yolundan döndərdilər.",
                            "verse 58:17": "Onları nə malları, nə də övladları heç bir vəchlə Allahdan (Allahın əzabından) qurtara bilməz.",
                            "verse 58:18": "Allah onların hamısını dirildəcəyi gün onlar sizə (yalandan) and içdikləri kimi, Allaha da and içəcək və (bununla axirətdə) bir şey qazanacaqlarını zənn edəcəklər.",
                            "verse 58:19": "Şeytan onlara hakim olmuş və Allahı zikr etməyi onlara unutdurmuşdur.",
                            "verse 58:20": "Allahın və Onun Peyğəmbərinin əleyhinə çıxanlar (Cəhənnəmdəki) ən zəlil kimsələr içərisində olacaqlar!",
                            "verse 58:21": "Allah (lövhi-məhfuzda): \"And olsun ki, Mən və peyğəmbərlərim qalib gələcəyik!\" - deyə yazmışdır.",
                            "verse 58:22": "(Ya Peyğəmbər!) Allaha və axirət gününə inanan heç bir tayfanın Allah və Onun Peyğəmbəri əleyhinə çıxanlarla - öz ataları, oğulları, qardaşları, yaxın qohumları olsalar belə - dostluq etdiyini görməzsən."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Allah je čuo riječi one koja se s tobom o mužu svome raspravljala i Allahu se jadala - a Allah čuje razgovor vaš međusobni, jer Allah, uistinu, sve čuje i sve vidi.",
                            "verse 58:2": "Oni od vas koji ženama svojim reknu da im nisu više dopuštene, kao što im nisu dopuštene majke njihove - a one nisu majke njihove, majke njihove su samo one koje su ih rodile - oni, zaista, govore ružne riječi i neistinu",
                            "verse 58:3": "Oni koji ženama svojim reknu da im nisu dopuštene, kao što im nisu dopuštene majke njihove, a onda odluče da s njima nastave živjeti, dužni su, prije nego što jedni drugo dodirnu, da jednog roba ropstva oslobode.",
                            "verse 58:4": "Onaj koji ne nađe, dužan je da dva mjeseca posti uzastopce prije nego jedno drugo dodirne.",
                            "verse 58:5": "Oni koji su neposlušni Allahu i Poslaniku Njegovu biće osramoćeni, kao što su bili osramoćeni i oni prije njih.",
                            "verse 58:6": "na Dan kada ih Allah sve oživi, pa ih obavijesti o onome šta su radili; Allah je o tome račun sveo, a oni su to zaboravili - Allah je svemu svjedok.",
                            "verse 58:7": "Zar ne znaš da Allah zna što je na nebesima i što je na Zemlji? Nema tajnih razgovora među trojicom, a da On nije četvrti, niti među petericom a da On nije šesti, ni kad ih je manje ni kad ih je više, a da On nije s",
                            "verse 58:8": "Zar ne vidiš one kojima je zabranjeno da se sašaptavaju kako se vraćaju onome što im je zabranjeno i sašaptavaju se o grijehu i neprijateljstvu i neposlušnosti prema Poslaniku.",
                            "verse 58:9": "O vjernici, kada među sobom tajno razgovarate, ne razgovarajte o grijehu i neprijateljstvu i neposlušnosti prema Poslaniku, već razgovarajte o dobročinstvu i čestitosti, i bojte se Allaha pred kojim ćete sakupljeni biti.",
                            "verse 58:10": "Sašaptavanje je posao šejtanski, da bi u brigu bacio vjernike, mada to ne može njima nimalo nauditi, osim ako to Allah dopusti.",
                            "verse 58:11": "O vjernici, kad vam se kaže: \"Načinite mjesta drugima tamo gdje se sjedi\" - vi načinite, pa i vama će Allah mjesto načiniti; a kad vam se rekne: \"Dignite se\" - vi se dignite - Allah će na visoke stepene uzdignuti one međ",
                            "verse 58:12": "O vjernici, kada hoćete da se s Poslanikom posavjetujete, prije savjetovanja milostinju udijelite.",
                            "verse 58:13": "Zar vas je strah da prije savjetovanja svoga milostinju udijelite? A ako ne udijelite i Allah vam oprosti, onda molitvu obavljajte i zekat dajite i Allaha i Poslanika Njegova slušajte! Allah dobro zna ono što vi radite.",
                            "verse 58:14": "Zar ne vidiš one koji prijateljuju s ljudima na koje se Allah rasrdio? Oni nisu ni vaši ni njihovi, a još se svjesno krivo zaklinju.",
                            "verse 58:15": "Allah je njima pripremio tešku patnju, jer je, zaista, ružno ono što rade:",
                            "verse 58:16": "zaklanjaju se iza zakletvi svojih, pa odvraćaju od Allahova puta; njih čeka sramna kazna.",
                            "verse 58:17": "Ni bogatstva njihova ni djeca njihova im nimalo neće pomoći kod Allaha, oni će biti stanovnici u vatri, u njoj će vječno boraviti.",
                            "verse 58:18": "Na Dan u koji ih Allah sve oživi oni će se Njemu zaklinjati, kao što se vama zaklinju, misleći da će im to nešto koristiti.",
                            "verse 58:19": "Njima je ovladao šejtan i učinio da zaborave na Allaha.",
                            "verse 58:20": "Oni koji se suprotstavljaju Allahu i Poslaniku Njegovu biće, sigurno, najgore poniženi.",
                            "verse 58:21": "Allah je zapisao: \"Ja i poslanici Moji sigurno ćemo pobijediti!\" - Allah je, zaista, moćan i silan.",
                            "verse 58:22": "Ne treba da ljudi koji u Allaha i u onaj svijet vjeruju budu u ljubavi sa onima koji se Allahu i Poslaniku Njegovu suprotstavljaju, makar im oni bili očevi njihovi, ili braća njihova, ili rođaci njihovi."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "যে নারী তার স্বামীর বিষয়ে আপনার সাথে বাদানুবাদ করছে এবং অভিযোগ পেশ করছে আল্লাহর দরবারে, আল্লাহ তার কথা শুনেছেন। আল্লাহ আপনাদের উভয়ের কথাবার্তা শুনেন। নিশ্চয় আল্লাহ সবকিছু শুনেন, সবকিছু দেখেন।",
                            "verse 58:2": "তোমাদের মধ্যে যারা তাদের স্ত্রীগণকে মাতা বলে ফেলে, তাদের স্ত্রীগণ তাদের মাতা নয়। তাদের মাতা কেবল তারাই, যারা তাদেরকে জন্মদান করেছে। তারা তো অসমীচীন ও ভিত্তিহীন কথাই বলে। নিশ্চয় আল্লাহ মার্জনাকারী, ক্ষমাশীল।",
                            "verse 58:3": "যারা তাদের স্ত্রীগণকে মাতা বলে ফেলে, অতঃপর নিজেদের উক্তি প্রত্যাহার করে, তাদের কাফফারা এই একে অপরকে স্পর্শ করার পূর্বে একটি দাসকে মুক্তি দিবে। এটা তোমাদের জন্যে উপদেশ হবে। আল্লাহ খবর রাখেন তোমরা যা কর।",
                            "verse 58:4": "যার এ সামর্থ্য নেই, সে একে অপরকে স্পর্শ করার পূর্বে একাদিক্রমে দুই মাস রোযা রাখবে। যে এতেও অক্ষম হয় সে ষাট জন মিসকীনকে আহার করাবে। এটা এজন্যে, যাতে তোমরা আল্লাহ ও তাঁর রসূলের প্রতি বিশ্বাস স্থাপন কর। এগুলো আল্লাহর নির্ধারিত শাস্তি। আর কাফেরদের জন্যে রয়েছে যন্ত্রণা দায়ক আযাব।",
                            "verse 58:5": "যারা আল্লাহর তাঁর রসূলের বিরুদ্ধাচরণ করে, তারা অপদস্থ হয়েছে, যেমন অপদস্থ হয়েছে তাদের পূর্ববর্তীরা। আমি সুস্পষ্ট আয়াতসমূহ নাযিল করেছি। আর কাফেরদের জন্যে রয়েছে অপমানজনক শাস্তি।",
                            "verse 58:6": "সেদিন স্মরণীয়; যেদিন আল্লাহ তাদের সকলকে পুনরুত্থিত করবেন, অতঃপর তাদেরকে জানিয়ে দিবেন যা তারা করত। আল্লাহ তার হিসাব রেখেছেন, আর তারা তা ভুলে গেছে। আল্লাহর সামনে উপস্থিত আছে সব বস্তুই।",
                            "verse 58:7": "আপনি কি ভেবে দেখেননি যে, নভোমন্ডল ও ভূমন্ডলে যা কিছু আছে, আল্লাহ তা জানেন। তিন ব্যক্তির এমন কোন পরামর্শ হয় না যাতে তিনি চতুর্থ না থাকেন এবং পাঁচ জনেরও হয় না, যাতে তিনি ষষ্ঠ না থাকেন তারা এতদপেক্ষা কম হোক বা বেশী হোক তারা যেখানেই থাকুক না কেন তিনি তাদের সাথে আছেন, তারা যা করে, তিনি কেয়ামতের দিন তা তাদেরকে জানিয়ে দিবেন। নিশ্চয় আল্লাহ সর্ববিষয়ে সম্যক জ্ঞাত।",
                            "verse 58:8": "আপনি কি ভেবে দেখেননি, যাদেরকে কানাঘুষা করতে নিষেধ করা হয়েছিল অতঃপর তারা নিষিদ্ধ কাজেরই পুনরাবৃত্তি করে এবং পাপাচার, সীমালংঘন এবং রসূলের অবাধ্যতার বিষয়েই কানাঘুষা করে। তারা যখন আপনার কাছে আসে, তখন আপনাকে এমন ভাষায় সালাম করে, যদ্দ্বারা আল্লাহ আপনাকে সালাম করেননি। তারা মনে মনে বলেঃ আমরা যা বলি, তজ্জন্যে আল্লাহ আমাদেরকে শাস্তি দেন না কেন? জাহান্নামই তাদের জন্যে যথেষ্ট। তারা তাতে প্রবেশ করবে। কতই না নিকৃষ্ট সেই জায়গা।",
                            "verse 58:9": "মুমিনগণ, তোমরা যখন কানাকানি কর, তখন পাপাচার, সীমালংঘন ও রসূলের অবাধ্যতার বিষয়ে কানাকানি করো না বরং অনুগ্রহ ও খোদাভীতির ব্যাপারে কানাকানি করো। আল্লাহকে ভয় কর, যাঁর কাছে তোমরা একত্রিত হবে।",
                            "verse 58:10": "এই কানাঘুষা তো শয়তানের কাজ; মুমিনদেরকে দুঃখ দেয়ার দেয়ার জন্যে। তবে আল্লাহর অনুমতি ব্যতীত সে তাদের কোন ক্ষতি করতে পারবে না। মুমিনদের উচিত আল্লাহর উপর ভরসা করা।",
                            "verse 58:11": "মুমিনগণ, যখন তোমাদেরকে বলা হয়ঃ মজলিসে স্থান প্রশস্ত করে দাও, তখন তোমরা স্থান প্রশস্ত করে দিও। আল্লাহর জন্যে তোমাদের জন্য প্রশস্ত করে দিবেন। যখন বলা হয়ঃ উঠে যাও, তখন উঠে যেয়ো। তোমাদের মধ্যে যারা ঈমানদার এবং যারা জ্ঞানপ্রাপ্ত, আল্লাহ তাদের মর্যাদা উচ্চ করে দিবেন। আল্লাহ খবর রাখেন যা কিছু তোমরা কর।",
                            "verse 58:12": "মুমিনগণ, তোমরা রসূলের কাছে কানকথা বলতে চাইলে তৎপূর্বে সদকা প্রদান করবে। এটা তোমাদের জন্যে শ্রেয়ঃ ও পবিত্র হওয়ার ভাল উপায়। যদি তাতে সক্ষম না হও, তবে আল্লাহ ক্ষমাশীল, পরম দয়ালু।",
                            "verse 58:13": "তোমরা কি কানকথা বলার পূর্বে সদকা প্রদান করতে ভীত হয়ে গেলে? অতঃপর তোমরা যখন সদকা দিতে পারলে না এবং আল্লাহ তোমাদেরকে মাফ করে দিলেন তখন তোমরা নামায কায়েম কর, যাকাত প্রদান কর এবং আল্লাহ ও রসূলের আনুগত্য কর। আল্লাহ খবর রাখেন তোমরা যা কর।",
                            "verse 58:14": "আপনি কি তাদের প্রতি লক্ষ্য করেননি, যারা আল্লাহর গযবে নিপতিত সম্প্রদায়ের সাথে বন্ধুত্ব করে? তারা মুসলমানদের দলভুক্ত নয় এবং তাদেরও দলভূক্ত নয়। তারা জেনেশুনে মিথ্যা বিষয়ে শপথ করে।",
                            "verse 58:15": "আল্লাহ তাদের জন্যে কঠোর শাস্তি প্রস্তুত রেখেছেন। নিশ্চয় তারা যা করে, খুবই মন্দ।",
                            "verse 58:16": "তারা তাদের শপথকে ঢাল করে রেখেছেন, অতঃপর তারা আল্লাহর পথ থেকে মানুষকে বাধা প্রদান করে। অতএব, তাদের জন্য রয়েছে অপমানজনক শাস্তি।",
                            "verse 58:17": "আল্লাহর কবল থেকে তাদের ধন-সম্পদ ও সন্তান-সন্ততি তাদেরকে মোটেই বাঁচাতে পারবেনা। তারাই জাহান্নামের অধিবাসী তথায় তারা চিরকাল থাকবে।",
                            "verse 58:18": "যেদিন আল্লাহ তাদের সকলকে পুনরুত্থিত করবেন। অতঃপর তারা আল্লাহর সামনে শপথ করবে, যেমন তোমাদের সামনে শপথ করে। তারা মনে করবে যে, তারা কিছু সৎপথে আছে। সাবধান, তারাই তো আসল মিথ্যাবাদী।",
                            "verse 58:19": "শয়তান তাদেরকে বশীভূত করে নিয়েছে, অতঃপর আল্লাহর স্মরণ ভূলিয়ে দিয়েছে। তারা শয়তানের দল। সাবধান, শয়তানের দলই ক্ষতিগ্রস্ত।",
                            "verse 58:20": "নিশ্চয় যারা আল্লাহ ও তাঁর রসূলের বিরুদ্ধাচারণ করে, তারাই লাঞ্ছিতদের দলভূক্ত।",
                            "verse 58:21": "আল্লাহ লিখে দিয়েছেনঃ আমি এবং আমার রসূলগণ অবশ্যই বিজয়ী হব। নিশ্চয় আল্লাহ শক্তিধর, পরাক্রমশালী।",
                            "verse 58:22": "যারা আল্লাহ ও পরকালে বিশ্বাস করে, তাদেরকে আপনি আল্লাহ ও তাঁর রসূলের বিরুদ্ধাচরণকারীদের সাথে বন্ধুত্ব করতে দেখবেন না, যদিও তারা তাদের পিতা, পুত্র, ভ্রাতা অথবা জ্ঞাতি-গোষ্ঠী হয়। তাদের অন্তরে আল্লাহ ঈমান লিখে দিয়েছেন এবং তাদেরকে শক্তিশালী করেছেন তাঁর অদৃশ্য শক্তি দ্বারা। তিনি তাদেরকে জান্নাতে দাখিল করবেন, যার তলদেশে নদী প্রবাহিত। তারা তথায় চিরকাল থাকবে। আল্লাহ তাদের প্রতি সন্তুষ্ট এবং তারা আল্লাহর প্রতি সন্তুষ্ট। তারাই আল্লাহর দল। জেনে রাখ, আল্লাহর দলই সফলকাম হবে। পরাক্রমশালী।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 58:1": "Чу Аллах думите на онази, която спореше с теб за своя съпруг и се оплака на Аллах.",
                            "verse 58:2": "На онези от вас, които изоставят жените си с думите: Ти за мен си като майчиния ми гръб! - те не са им майки.",
                            "verse 58:3": "Онези, които",
                            "verse 58:4": "изоставят жените си, но после си върнат думите - да освободят роб, преди да са ги докоснали.",
                            "verse 58:5": "А който не може - да говее два поредни месеца, преди да се докоснат.",
                            "verse 58:6": "Които се противят на Аллах и на Неговия Пратеник, ще бъдат сломени, както бяха сломени и онези преди тях.",
                            "verse 58:7": "Един Ден Аллах ще ги възкреси всички и ще ги извести за техните дела.",
                            "verse 58:8": "Не виждаш ли, че Аллах знае всичко на небесата и всичко на земята? И няма таен разговор на трима, без Той да е четвъртият, нито на петима, без Той да е шестият, и нито по-малко от това, и нито повече, без Той да е с тях, където и да са.",
                            "verse 58:9": "Не виждаш ли онези, на които бе забранен тайният разговор? После се връщат към онова, което им бе забранено, и тайно разговарят за грях и вражда, и неподчинение на Пратеника.",
                            "verse 58:10": "О, вярващи, ако разговаряте тайно, не разговаряйте за грях и вражда, и неподчинение на Пратеника, а разговаряйте за праведност и богобоязливост, и се бойте от Аллах, при Когото ще бъдете събрани!",
                            "verse 58:11": "Тайният",
                            "verse 58:12": "разговор е само от сатаната, за да наскърбява вярващите.",
                            "verse 58:13": "О, вярващи, когато ви се каже: Направете място при събиранията!, направете! И Аллах ще ви направи място.",
                            "verse 58:14": "О, вярващи, ако ще разговаряте насаме с Пратеника, раздайте преди вашия разговор милостиня! Това е най-доброто за вас и най-чистото.",
                            "verse 58:15": "Нима ви е страх да раздавате милостиня преди разговора си насаме? Ако не го извършите, а Аллах вече ви позволи това, отслужвайте молитвата и давайте милостинята закат, и се покорявайте на Аллах и на Неговия Пратеник! Сведущ е Аллах за вашите дела.",
                            "verse 58:16": "Не виждаш ли сближилите се с народ, комуто Аллах се е разгневил? Те не са нито от вас, нито от тях и се кълнат в лъжата, знаейки.",
                            "verse 58:17": "Аллах е приготвил за тях сурово мъчение.",
                            "verse 58:18": "Те сторват от своите клетви прикритие и възпират от пътя на Аллах.",
                            "verse 58:19": "С нищо не ще ги избавят от Аллах нито имотите, нито децата им.",
                            "verse 58:20": "Един Ден Аллах ще ги възкреси всички и ще Му се кълнат, както се кълнат и на вас, и ще мислят, че имат полза.",
                            "verse 58:21": "Завладя ги сатаната и ги накара да забравят споменаването на Аллах.",
                            "verse 58:22": "Онези, които се противят на Аллах и на Неговия Пратеник, те са сред най-унизените.",
                            "verse 58:23": "Аллах предписа: Аз ще надвия, и Моите пратеници.",
                            "verse 58:24": "Не ще намериш хора, които вярват в Аллах и в Сетния ден, да обичат противящите се на Аллах и на Неговия Пратеник, дори да са бащите или синовете им, или братята, или роднините им."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "真主確已聽取為丈夫而向你辯訴，並向真主訴苦者的陳述了。真主聽著你們倆的辯論；真主確是全聰的，確是全明的。",
                            "verse 58:2": "你們中把妻室當母親的人們，她們不是他們的母親；除他們的生身之母外，沒有任何人，可以稱為他們的母親；他們的確說出惡言和謊話；真主確是至宥的，確是至赦的。",
                            "verse 58:3": "把妻子當做母親然后悔其所言者，在交接之前，應該釋放一個奴隸。那是用來勸告你們的，真主是徹知你們的行為的。",
                            "verse 58:4": "沒有奴隸者，在交接之前，應該連續齋戒兩月。不能齋戒者，應該供給六十個貧民一日的口糧。這因為要你們表示信仰真主和使者。這些是真主的法度。不信的人們，將受痛苦的刑罰。",
                            "verse 58:5": "違抗真主和使者的人，必遭折磨，猶如他們以前的人曾遭折磨一樣。我確已降示許多明証，不信者，將受凌辱的刑罰。",
                            "verse 58:6": "在那日，真主將使他們統統都復活，而將他們生前的行為告訴他們。真主曾記錄那些行為，他們卻忘了它。真主是見証萬物的。",
                            "verse 58:7": "難道你不知道真主是全知天地萬物的嗎？凡有三個人密談，他就是第四個參與者；凡有五個人密談，他就是第六個參與者；凡有比那更少或更多的人密談，無論他們在那裡，他總是與他們同在的；然後在復活日，他要把他們的行為告訴他們。真主確是全知萬物的。",
                            "verse 58:8": "難道你沒有看見不許密談而違禁密談的人嗎？他們密談的，是關於罪惡、侵害和違抗使者的事。他們來見你的時侯，用真主所未用的祝辭祝賀你，他們自言自語地說：「真主何不因我們所說的話而懲罰我們呢！」火獄是能使他們滿足的！他們將入其中，那歸宿真惡劣！",
                            "verse 58:9": "信道的人們啊！當你們密談的時侯，不要密談關於罪惡、侵害和違抗使者的事，你們應當密談關於正義和敬畏的事，你們應當敬畏真主，你們將被集合到他那裡。",
                            "verse 58:10": "關於罪惡的密談，只是由於惡魔的誘惑，他欲使信道者憂愁，不得真主的野i，他絕不能傷害他們一絲毫；教信士們只信托真主吧。",
                            "verse 58:11": "信道的人們啊！有人在會場中對你們說：「請你們退讓一點吧！」你們就應當退讓些，真主將使你們寬裕。有人對你們說：「你們起來吧！」你們就應當起來，真主將你們中的信道者升級，並將你們中有學問的人們提升若干級。真主是徹知你們的行為的。",
                            "verse 58:12": "信道的人們啊！你們應當先有所施捨，然後才與使者密談，這對於你們是更高尚的，是更純潔的。如果你們無物可施，那麼，不施捨也無罪，因為真主確是至赦的，確是至慈的。",
                            "verse 58:13": "道你們怕在密談之前有所施捨嗎？你們沒有施捨，而真主已赦宥你們，故你們應當謹守拜功、完納天課、服從真主和使者。真主是全知你們的行為的。",
                            "verse 58:14": "道你沒有看見與真主所遣怒的民眾結交的人們嗎？他們不屬於你們，也不屬於那些民眾；他們明知故犯地以謊言盟誓。",
                            "verse 58:15": "真主已為他們準備嚴厲的刑罰。他們的行為真惡劣。",
                            "verse 58:16": "他們以自己的盟誓為護符，因而妨礙主道，故他們將受凌辱的刑罰。",
                            "verse 58:17": "他們的財產和子嗣，對真主的刑罰，絕不能裨益他們一絲毫。這等人，是火獄的居民，他們將永居其中。",
                            "verse 58:18": "在那日，真主將使他們統統復活。他們對他盟誓，猶如現在對你們盟誓一樣；他們以為自己是獲得效果的。真的，他們確是說謊的。",
                            "verse 58:19": "惡魔已經制服了他們，因而使他們忘卻真主的教訓；這等人，是惡魔的黨羽。真的，惡魔的黨羽確是虧折的。",
                            "verse 58:20": "違抗真主和使者的人，必居於最卑賤的民眾之列。",
                            "verse 58:21": "真主已經制定：我和我的眾使者，必定勝利。真主確是至剛的，確是萬能的。",
                            "verse 58:22": "你不會發現確信真主和末日的民眾，會與違抗真主和使者的人相親相愛，即使那等人是他們的父親，或兒子，或兄弟，或親戚。這等人，真主曾將正信銘刻在他們的心上，並且以從他降下的精神援助他們。他將使他們入下臨諸河的樂園，而永居其中。真主喜悅他們，他們也喜悅他。這等人是真主的黨羽，真的，真主的黨羽確是成功的。 真主已經制定：我和我的眾使者，必定勝利。真主確是至剛的，確是萬能的。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Bůh již slyšel řeč oné, která se s tebou hádala ohledně manžela svého a stěžovala si u Boha.",
                            "verse 58:2": "Ti z vás, kteří nazývají manželky své zádami svých matek, vědí, že ony nejsou jejich matkami; matkami jejich jsou jedině ty, které je porodily.",
                            "verse 58:3": "Ti, kdož říkají ženám svým \"Jsi pro mne jak záda mé matky\" a potom chtějí odvolat to, co řekli, mohou se vykoupit propuštěním otroka, dříve než se opět vzájemně dotknou.",
                            "verse 58:4": "A nechť se ten, kdo nenalezne k tomu možnost, postí dva měsíce po sobě následující, dříve než se opět vzájemně dotknou.",
                            "verse 58:5": "Ti, kdož se protiví Bohu a poslu Jeho, budou povaleni, tak jako byli povaleni ti, kdož byli před nimi.",
                            "verse 58:6": "v den, kdy Bůh je všechny vzkřísí a oznámí jim, co vlastně dělali.",
                            "verse 58:7": "Což jsi neviděl, že Bůh zná vše, co na nebesích je i na zemi? A není rozmluvy tajné ve třech, aby tam nebyl čtvrtý, a v pěti, aby tam nebyl šestý, nebo v menším či větším počtu, aby On nebyl s nimi, ať již jsou kdekoliv.",
                            "verse 58:8": "Což jsi neviděl ty, jimž zakázány byly tajné rozmluvy, jak se potom vrací k tomu, co bylo jim zakázáno, a domlouvají se tajně v hříchu, nepřátelství a neposlušnosti vůči poslu? A když k tobě přijdou, zdraví tě tak, jak tě nezdraví Bůh, a říkají si v duchu: \"Pročpak nás Bůh nepotrestá za to, co říkáme?\" Však stačit jim bude peklo, v němž hořet budou - a jak hnusný je to cíl konečný!",
                            "verse 58:9": "Vy, kteří věříte! Když spolu tajně hovoříte, nedomlouvejte se o hříchu, nepřátelství a neposlušnosti vůči poslu, ale domlouvejte se o zbožnosti a bohabojnosti! Bojte se Boha, k němuž budete shromážděni!",
                            "verse 58:10": "Tajné rozmluvy pocházejí jen od satana, aby způsobil zármutek těm, kdož uvěřili.",
                            "verse 58:11": "Vy, kteří věříte! Když je vám řečeno \"Uvolněte místo ve shromáždění!\", tedy je uvolněte! A Bůh pro vás také uvolní místo (v ráji).",
                            "verse 58:12": "Vy, kteří věříte! Jestliže chcete mluvit soukromě s poslem, dejte napřed dobrovolný dar! Toto bude pro vás lepší a čistší.",
                            "verse 58:13": "Stydíte se snad dát dobrovolný dar před soukromým rozhovorem? Jestliže tak neučiníte a Bůh se nad vámi smiluje - pak vykonejte modlitbu, dejte almužnu a poslouchejte Boha a posla Jeho! A Bůh dobře je zpraven o všem, co děláte.",
                            "verse 58:14": "Což jsi neviděl ty, kteří se sdružují s lidmi, na něž se Bůh rozhněval? Ti nepatří ani k vám, ani k nim a přísahají křivě, ačkoliv dobře jsou si toho vědomi.",
                            "verse 58:15": "Bůh pro ně připravil trest strašný - a věru jak hnusné je to, co dělají.",
                            "verse 58:16": "Zaštítili se přísahami svými a odvracejí od cesty Boží - a pro ně připraven je trest zahanbující.",
                            "verse 58:17": "A nijak jim proti Bohu neprospějí majetky jejich ani děti jejich; jsou obyvateli ohně pekelného a budou v něm nesmrtelní.",
                            "verse 58:18": "V onen den je Bůh všechny vzkřísí a budou Mu přísahat tak, jako přisahali vám, a budou se domnívat, že jednají správně.",
                            "verse 58:19": "Satan je ovládl a dal jim zapomenout na připomenutí Boží; a oni patří ke straně satanově.",
                            "verse 58:20": "Ti, kdož se protiví Bohu a poslu Jeho, ti budou věru patřit k nejopovrhovanějším!",
                            "verse 58:21": "A Bůh napsal: \"Věru že zvítězím Já i poslové Moji!\", vždyť Bůh vskutku je silný a mocný.",
                            "verse 58:22": "Nenalezneš žádné lidi, věřící v Boha a v den poslední, přátelit se s těmi, kdož se protiví Bohu a poslu Jeho, byť to byli otcové jejich či synové jejich anebo bratři jejich či rod jejich."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "God heeft het woord gehoord van degene die met u aangaande haar man twistte en tot God klaagde.",
                            "verse 58:2": "Degenen onder u, die hun vrouwen moeders noemen - dezen zijn hun moeders niet; hun moeders zijn alleen degenen die hen baarden, - en voorzeker zij zeggen iets onbetamelijks en een leugen; doch God is Verdraagzaam, Vergevensgezind.",
                            "verse 58:3": "Degenen, die hun vrouwen moeders noemen en willen terugnemen wat zij zeiden, moeten hiervoor een slaaf bevrijden voordat zij elkander aanraken.",
                            "verse 58:4": "Maar wie geen slaaf vindt, laat hem twee achtereenvolgende maanden vasten, voordat zij elkander aanraken.",
                            "verse 58:5": "Degenen, die tegen God en Zijn boodschapper ingaan, zullen zeker vernederd worden zoals degenen die hen vooraf gingen vernederd werden; want Wij hebben reeds duidelijke tekenen nedergezonden.",
                            "verse 58:6": "De Dag, waarop God hen allen tezamen zal opwekken, zal Hij hun over alles wat zij deden, inlichten.",
                            "verse 58:7": "Ziet gij niet, dat God alles weet wat in de hemelen en op aarde is? Er is geen geheim gesprek van drie (personen) zonder dat Hij de vierde is, noch van vijf, zonder dat Hij de zesde is, noch van minder noch van meer, zonder dat Hij met hen is, waar zij ook mogen zijn.",
                            "verse 58:8": "Hebt gij degenen niet waargenomen, wie de geheime samenzwering was verboden maar die daarna terugkeerden naar hetgeen hun verboden was en heimelijk beraadslagen in zonde, overtreding en ongehoorzaamheid jegens de boodschapper? En als zij tot u komen, groeten zij u met een groet, waar God u niet mee begroet; maar onder elkander zeggen zij: \"Waarom straft God ons niet voor hetgeen uw (tegen de profeet) zeggen?\" Genoegzaam voor hen is de hel waarin zij zullen branden; en deze is een slechte bestemming!",
                            "verse 58:9": "O.",
                            "verse 58:10": "Geheime samenzwering gaat alleen uit van Satan, opdat hij verdriet moge veroorzaken aan de gelovigen maar het kan hun niet schaden dan met God’s toelating.",
                            "verse 58:11": "O, gij die gelooft, als er u gezegd wordt: \"Maakt plaats in vergaderingen, maakt dan plaats; God zal rijkelijk plaats voor u maken.",
                            "verse 58:12": "O, gij die gelooft, indien gij de boodschapper (in het bijzonder) wiltraadplegen, geeft dan een liefdegift vóór uw raadpleging.",
                            "verse 58:13": "Zijt gij bezorgd inzake het geven van liefdegiften voor uw bijzondere raadpleging? Indien gij dat niet doet en God heeft zich met barmhartigheid tot u gewend, houdt dan het Gebed en betaalt de Zakaat en gehoorzaamt God en Zijn boodschapper.",
                            "verse 58:14": "Hebt gij degenen niet gezien, die zich bevrienden met een volk, waarop God vertoornd was? Zij zijn noch de uwen noch de hunnen, zij zweren bij de leugen tegen beter weten in.",
                            "verse 58:15": "God heeft voor hen een zware straf bereid.",
                            "verse 58:16": "Zij hebben van hun eden een schild gemaakt en zij leiden anderen van het pad van God af; voor hen zal er een vernederende straf zijn.",
                            "verse 58:17": "Noch hun bezittingen, noch hun kinderen zullen hen tegen God iets baten, dit zijn de bewoners van het Vuur en zij zullen daarin vertoeven.",
                            "verse 58:18": "De Dag waarop God hen allen zal opwekken, zullen zij tot Hem zweren zoals zij dit tot u deden en zij zullen denken dat zij iets bereiken.",
                            "verse 58:19": "Satan heeft hen volledig in zijn macht, en heeft hen de gedachtenis aan God doen vergeten.",
                            "verse 58:20": "Waarlijk, degenen die God en Zijn Boodschapper tegenwerken zullen worden vernederd.",
                            "verse 58:21": "God heeft verordend: \"Voorwaar Ik en Mijn boodschappers zullen zegevieren.",
                            "verse 58:22": "Gij zult geen mensen vinden die in God en de Laatste Dag geloven, terwijl zij iemand liefhebben die God en Zijn boodschapper tegenwerkt, zelfs al waren dezen hun vader of hun kinderen, of hun broeders, of hun verwanten."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 58:1": "Allah hath heard the saying of her that disputeth with thee (Muhammad) concerning her husband, and complaineth unto Allah.",
                            "verse 58:2": "Such of you as put away your wives (by saying they are as their mothers) - They are not their mothers; none are their mothers except those who gave them birth - they indeed utter an ill word and a lie.",
                            "verse 58:3": "Those who put away their wives (by saying they are as their mothers) and afterward would go back on that which they have said, (the penalty) in that case (is) the freeing of a slave before they touch one another.",
                            "verse 58:4": "And he who findeth not (the wherewithal), let him fast for two successive months before they touch one another; and for him who is unable to do so (the penance is) the feeding of sixty needy ones.",
                            "verse 58:5": "Lo! those who oppose Allah and His messenger will be abased even as those before them were abased; and We have sent down clear tokens, and for disbelievers is a shameful doom",
                            "verse 58:6": "On the day when Allah will raise them all together and inform them of what they did.",
                            "verse 58:7": "Hast thou not seen that Allah knoweth all that is in the heavens and all that is in the earth ? There is no secret conference of three but He is their fourth, nor of five but He is their sixth, nor of less than that or more but He is with them wheresoever they may be; and afterward, on the Day of Resurrection, He will inform them of what they did.",
                            "verse 58:8": "Hast thou not observed those who were forbidden conspiracy and afterward returned to that which they had been forbidden, and (now) conspire together for crime and wrongdoing and disobedience toward the messenger ? And when they come unto thee they greet thee with a greeting wherewith Allah greeteth thee not, and say within themselves: Why should Allah punish us for what we say ? Hell will suffice them; they will feel the heat thereof - a hapless journey’s end!",
                            "verse 58:9": "O ye who believe! When ye conspire together, conspire not together for crime and wrongdoing and disobedience toward the messenger, but conspire together for righteousness and piety, and keep your duty toward Allah, unto whom ye will be gathered.",
                            "verse 58:10": "Lo! Conspiracy is only of the devil, that he may vex those who believe; but he can harm them not at all unless by Allah’s leave.",
                            "verse 58:11": "O ye who believe! when it is said unto you, Make room! in assemblies, then make room; Allah will make way for you (hereafter).",
                            "verse 58:12": "O ye who believe! When ye hold conference with the messenger, offer an alms before your conference.",
                            "verse 58:13": "Fear ye to offer alms before your conference ? Then, when ye do it not and Allah hath forgiven you, establish worship and pay the poor-due and obey Allah and His messenger.",
                            "verse 58:14": "Hast thou not seen those who take for friends a folk with whom Allah is wroth ? They are neither of you nor of them, and they swear a false oath knowingly.",
                            "verse 58:15": "Allah hath prepared for them a dreadful doom.",
                            "verse 58:16": "They make a shelter of their oaths and turn (men) from the way of Allah; so theirs will be a shameful doom.",
                            "verse 58:17": "Their wealth and their children will avail them naught against Allah.",
                            "verse 58:18": "On the day when Allah will raise them all together, then will they swear unto Him as they (now) swear unto you, and they will fancy that they have some standing.",
                            "verse 58:19": "The devil hath engrossed them and so hath caused them to forget remembrance of Allah.",
                            "verse 58:20": "Lo! those who oppose Allah and His messenger, they will be among the lowest.",
                            "verse 58:21": "Allah hath decreed: Lo! I verily shall conquer, I and My messengers.",
                            "verse 58:22": "Thou wilt not find folk who believe in Allah and the Last Day loving those who oppose Allah and His messenger, even though they be their fathers or their sons or their brethren or their clan."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 58:1": "God has indeed heard (and accepted) the statement of the woman who pleads with thee concerning her husband and carries her complaint (in prayer) to God: and God (always) hears the arguments between both sides among you: for God hears and sees (all things).",
                            "verse 58:2": "If any men among you divorce their wives by Zihar (calling them mothers), they cannot be their mothers: None can be their mothers except those who gave them birth.",
                            "verse 58:3": "But those who divorce their wives by Zihar, then wish to go back on the words they uttered,- (It is ordained that such a one) should free a slave before they touch each other: Thus are ye admonished to perform: and God is well-acquainted with (all) that ye do.",
                            "verse 58:4": "And if any has not (the wherewithal), he should fast for two months consecutively before they touch each other.",
                            "verse 58:5": "Those who resist God and His Apostle will be humbled to dust, as were those before them: for We have already sent down Clear Signs.",
                            "verse 58:6": "On the Day that God will raise them all up (again) and show them the Truth (and meaning) of their conduct.",
                            "verse 58:7": "Seest thou not that God doth know (all) that is in the heavens and on earth? There is not a secret consultation between three, but He makes the fourth among them, - Nor between five but He makes the sixth,- nor between fewer nor more, but He is in their midst, wheresoever they be: In the end will He tell them the truth of their conduct, on the Day of Judgment.",
                            "verse 58:8": "Turnest thou not thy sight towards those who were forbidden secret counsels yet revert to that which they were forbidden (to do)? And they hold secret counsels among themselves for iniquity and hostility, and disobedience to the Apostle.",
                            "verse 58:9": "O ye who believe! When ye hold secret counsel, do it not for iniquity and hostility, and disobedience to the Prophet; but do it for righteousness and self-restraint; and fear God, to Whom ye shall be brought back.",
                            "verse 58:10": "Secret counsels are only (inspired) by the Evil One, in order that he may cause grief to the Believers; but he cannot harm them in the least, except as God permits; and on God let the Believers put their trust.",
                            "verse 58:11": "O ye who believe! When ye are told to make room in the assemblies, (spread out and) make room: (ample) room will God provide for you.",
                            "verse 58:12": "O ye who believe! When ye consult the Apostle in private, spend something in charity before your private consultation.",
                            "verse 58:13": "Is it that ye are afraid of spending sums in charity before your private consultation (with him)? If, then, ye do not so, and God forgives you, then (at least) establish regular prayer; practise regular charity; and obey God and His Apostle.",
                            "verse 58:14": "Turnest thou not thy attention to those who turn (in friendship) to such as have the Wrath of God upon them? They are neither of you nor of them, and they swear to falsehood knowingly.",
                            "verse 58:15": "God has prepared for them a severe Penalty: evil indeed are their deeds.",
                            "verse 58:16": "They have made their oaths a screen (for their misdeeds): thus they obstruct (men) from the Path of God: therefore shall they have a humiliating Penalty.",
                            "verse 58:17": "Of no profit whatever to them, against God, will be their riches nor their sons: they will be Companions of the Fire, to dwell therein (for aye)!",
                            "verse 58:18": "One day will God raise them all up (for Judgment): then will they swear to Him as they swear to you: And they think that they have something (to stand upon).",
                            "verse 58:19": "The Evil One has got the better of them: so he has made them lose the remembrance of God.",
                            "verse 58:20": "Those who resist God and His Apostle will be among those most humiliated.",
                            "verse 58:21": "God has decreed: \"It is I and My apostles who must prevail\": For God is One full of strength, able to enforce His Will.",
                            "verse 58:22": "Thou wilt not find any people who believe in God and the Last Day, loving those who resist God and His Apostle, even though they were their fathers or their sons, or their brothers, or their kindred."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 58:1": "God has heard the words of her that disputes with thee concerning her husband, and makes complaint unto God.",
                            "verse 58:2": "Those of you who say, regarding their wives, ’Be as my mother’s back,’ they are not truly their mothers; their mothers are only those who gave them birth, and they are surely saying a dishonourable saying, and a falsehood.",
                            "verse 58:3": "And those who say, regarding their wives, ’Be as my mother’s back,’ and then retract what they have said, they shall set free a slave, before the two of them touch one another.",
                            "verse 58:4": "But whosoever finds not the means, then let him fast two successive months, before the two of them touch one another.",
                            "verse 58:5": "Surely those who oppose God and His Messenger shall be frustrated as those before them were frustrated.",
                            "verse 58:6": "Upon the day when God shall raise them up all together, then He shall tell them what they did.",
                            "verse 58:7": "Hast thou not seen that God knows whatsoever is in the heavens, and whatsoever is in the earth? Three men conspire not secretly together, but He is the fourth of them, neither five men, but He is the sixth of them, neither fewer than that, neither more, but He is with them, wherever they may be; then He shall tell them what they have done, on the Day of Resurrection.",
                            "verse 58:8": "Hast thou not regarded those who were forbidden to converse secretly together, then they return to that they were forbidden, and they converse secretly together in sin and enmity, and in disobedience to the Messenger? Then, when they come to thee, they greet thee with a greeting God never greeted thee withal; and they say within themselves, ’Why does God not chastise us for what we say?’ Sufficient for them shall be Gehenna, at which they, shall be roasted -- an evil homecoming!",
                            "verse 58:9": "O believers, when you conspire secretly, then conspire not together in sin and enmity and disobedience to the Messenger, but conspire in piety and godfearing.",
                            "verse 58:10": "Conspiring secretly together is of Satan, that the believers may sorrow; but he will not hurt them anything, except by the leave of God.",
                            "verse 58:11": "O believers, when it is said to you ’Make room in the assemblies’, then make room, and God will make room for you; and when it is said, ’Move up’, move up, and God will raise up in rank those of you who believe and have been given knowledge.",
                            "verse 58:12": "O believers, when you conspire with the Messenger, before your conspiring advance a freewill offering; that is better for you and purer.",
                            "verse 58:13": "Are you afraid, before your conspiring, to advance freewill offerings? If you do not so, and God turns again unto you, then perform the prayer, and pay the alms, and obey God and His Messenger.",
                            "verse 58:14": "Hast thou not regarded those who have taken for friends a people against whom God is wrathful? They belong neither to you nor to them; and they swear upon falsehood, and that wittingly.",
                            "verse 58:15": "God has made ready for them a chastisement terrible; surely they -- evil are the things they have been doing.",
                            "verse 58:16": "They have taken their oaths as a covering, and barred from God’s way; so there awaits them a humbling chastisement.",
                            "verse 58:17": "Neither their riches nor their children shall avail them anything against God; those -- they are the inhabitants of the Fire, therein dwelling forever.",
                            "verse 58:18": "Upon the day when God shall raise them up all together, and they will swear to Him, as they swear to you, and think they are on something.",
                            "verse 58:19": "Satan has gained the mastery over them, and caused them to forget God’s Remembrance.",
                            "verse 58:20": "Surely those who oppose God and His Messenger, those are among the most abject.",
                            "verse 58:21": "God has written, ’I shall assuredly be the victor, I and My Messengers.",
                            "verse 58:22": "Thou shalt not find any people who believe in God and the Last Day who are loving to anyone who opposes."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 58:1": "God has indeed heard the words of her who pleads with thee concerning her husband, and complains unto God.",
                            "verse 58:2": "As for those of you who",
                            "verse 58:3": "separate themselves from their wives by saying, \"Thou art as unlawful to me as my mother,\" [let them bear in mind that] they can never be",
                            "verse 58:4": "their mothers: none are their mothers save those who gave them birth: and so, behold, they but utter a saying that runs counter to reason, and is",
                            "verse 58:5": "false.",
                            "verse 58:6": "hence, as for those who would separate themselves from their wives by saying, \"Thou art as unlawful to me as my mother,\" and thereafter would go back on what they have said, [their atonement] shall be the freeing of a human being from bondage before the couple may touch one another again: this you are",
                            "verse 58:7": "exhorted to do - for God is fully aware of all that you do.",
                            "verse 58:8": "However, he who does not have the wherewithal shall fast",
                            "verse 58:9": "for two consecutive months before the couple may touch one another again; and he who is unable to do it shall feed sixty needy ones: this, so that you might prove your faith in God and His Apostle.",
                            "verse 58:10": "Verily, those who contend against God and His Apostle shall be brought low even as those",
                            "verse 58:11": "who lived before them were brought low after We had bestowed [on them] clear messages from on high.",
                            "verse 58:12": "for those who deny the truth there will be shameful suffering in store",
                            "verse 58:13": "on the Day when God will raise them all from the dead and will make them truly understand all that they did [in life]: God will have taken [all of] it into account, even though they",
                            "verse 58:14": "may have forgotten it – for God is witness unto everything.",
                            "verse 58:15": "ART THOU NOT aware that God knows all that is in the heavens and all that is on earth? Never can there be a secret confabulation between three persons without His being the fourth of them, nor between five without His being the sixth of them; and neither between less than that, or more, without His being with them wherever they may be.",
                            "verse 58:16": "Art thou not aware of such as have been forbidden [to intrigue through] secret confabulations, and yet",
                            "verse 58:17": "revert to that which they have been forbidden, and conspire with one another with a view to sinful doings, and aggressive conduct, and disobedience to the Apostle? Now whenever such",
                            "verse 58:18": "approach thee, [O Muhammad,] they salute thee with a greeting which God has never countenanced; and they say to themselves, \"Why does not God chastise us for what we are saying?\" Hell shall be their allotted portion: they shall",
                            "verse 58:19": "enter it – and how vile a journey’s end!",
                            "verse 58:20": "",
                            "verse 58:21": "O you who have attained to faith, when you do hold secret confabulations, do not conspire with one another with a view to sinful doings, and aggressive conduct, and disobedience to the Apostle, but",
                            "verse 58:22": "hold counsel in the cause of virtue and God-consciousness: and",
                            "verse 58:23": "remain conscious of God, unto whom you all shall be gathered.",
                            "verse 58:24": "[All other kinds of] secret confabulations are but of Satan’s doing, so that he might cause grief to those who have attained to faith; yet he cannot harm them in the least, unless it be by God’s leave: in God, then, let the believers place their trust!",
                            "verse 58:25": "O YOU who have attained to faith! When you are told, \"Make room for one another in your collective life,\" do make room: [and in return,] God will make room for you [in His grace].",
                            "verse 58:26": "God will exalt by",
                            "verse 58:27": "degrees those of you who have attained to faith and, [above all,] such as have been vouchsafed",
                            "verse 58:28": "knowledge: for God is fully aware of all that you do.",
                            "verse 58:29": "O YOU who have attained to faith! Whenever you [intend to] consult the Apostle, offer up something in charity on the occasion of your consultation: this will be for your own good, and more conducive to your",
                            "verse 58:30": "purity.",
                            "verse 58:31": "Do you, perchance, fear lest [you may be sinning if] you cannot offer up anything in charity on the occasion of your consultation [with the Apostle]? But if you fail to do it [for lack of opportunity], and God turns unto you in His mercy, remain but constant in prayer and render [no more than] the purifying dues, and",
                            "verse 58:32": "pay heed unto God and His Apostle: for God is fully aware of all that you do.",
                            "verse 58:33": "ART THOU NOT aware of those who would be friends with people whom God has condemned? They are neither of you [O believers] nor of those [who utterly reject the truth]: and so they swear to a falsehood the while they know [it to be false].",
                            "verse 58:34": "God has readied for them suffering severe [in the life to come].",
                            "verse 58:35": "they have made their oaths a cover [for their falseness], and thus they turn others away from the path of God: hence, shameful suffering awaits them.",
                            "verse 58:36": "Neither their worldly possessions nor their offspring will be of the least avail to them against God: it is they who are destined for the fire, therein to abide!",
                            "verse 58:37": "On the Day when God will raise them all from the dead, they will swear before Him as they",
                            "verse 58:38": "swear before you, thinking that they are on firm ground [in their assumptions].",
                            "verse 58:39": "liars!",
                            "verse 58:40": "Satan has gained mastery over them, and has caused them to remain oblivious of the remembrance of God.",
                            "verse 58:41": "Verily, those who contend against God and His Apostle – it is they who [on Judgment Day] shall find themselves among the most abject.",
                            "verse 58:42": "",
                            "verse 58:43": "God has thus ordained: \"I shall most certainly prevail, I and My apostles!\" Verily, God is powerful, almighty!",
                            "verse 58:44": "Thou canst not find people who",
                            "verse 58:45": "believe in God and the Last Day and [at the same time] love anyone who contends against God and His Apostle – even though they be their fathers, or their sons, or their brothers, or [others of] their kindred.",
                            "verse 58:46": "for what your hearts have conceived [in earnest].",
                            "verse 58:47": "assembly.",
                            "verse 58:48": "worshipper (‘ābid) is like the superiority of the moon on the night when it is full over all other stars” (Ibn Hanbal, Abū Dā’ūd, Tirmidhī, Nasā’ī, Ibn Mājah, and Dārimī).",
                            "verse 58:49": "therefrom."
                        }
                    },
                    "5": {
                        "Martin Lings": {}
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 58:1": "Allah has heard the talk of the woman who was debating with you about her husband, and was complaining to Allah.",
                            "verse 58:2": "Those of you who declare Zihār against their wives, they are not their mothers.",
                            "verse 58:3": "Those who declare Zihār against their wives, then retract what they said, obligated on them is to free the neck (of a slave) before the two (spouses) touch one another.",
                            "verse 58:4": "But whoever does not find (a slave) has to fast for two consecutive months before the two (spouses) touch one another.",
                            "verse 58:5": "Surely those who oppose Allah and His Messenger shall be disgraced, just as those before them were disgraced.",
                            "verse 58:6": "on the Day when Allah will resurrect them all together, and will tell them what they did; Allah has its full account, while they have forgotten it.",
                            "verse 58:7": "Have you not observed that Allah knows everything in the heavens and everything in the earth? No secret consulta-tion takes place between three, but He is fourth of them, nor between five, but He is sixth of them, nor between fewer than that or more, but He is with them wherever they may be.",
                            "verse 58:8": "Did you not see those who were forbidden from holding secret talks; then they do again what they were forbidden to do? They whisper for sinful act and wrongdoing and disobedience of the prophet, and when they come to you, they greet you the way Allah does not greet you, and say to themselves, “Why does Allah not punish us for what we say?” Enough for them is Jahannam (Hell); they will enter it, and it is an evil end.",
                            "verse 58:9": "O you who believe, when you hold secret counsel, do not whisper for sinful act and wrongdoing and disobedience of the prophet, and do whisper for righteousness and taqwā (piety).",
                            "verse 58:10": "Whispering (for sinful acts) comes from the ShaiTān (Satan), so that he may grieve those who believe, while it is not harmful to them in the least, except with Allah’s permission.",
                            "verse 58:11": "O you who believe, when it is said to you, “Make room (for others) in the sittings”, then make room, and Allah will make room for you (in the Hereafter).",
                            "verse 58:12": "O you who believe, when you consult the Messenger in private, then offer something in charity before your consultation.",
                            "verse 58:13": "Have you become afraid of offering charities before your consultation? So when you did not do so, and Allah has forgiven you, then establish Salāh, and pay Zakāh, and obey Allah and His Messenger.",
                            "verse 58:14": "Have you not seen those who have friendship with a people with whom Allah is angry.",
                            "verse 58:15": "Allah has prepared a severe punishment for them.",
                            "verse 58:16": "They have taken their oaths as a shield, and then have prevented (people) from the way of Allah.",
                            "verse 58:17": "Their riches and their children will never benefit them against Allah.",
                            "verse 58:18": "the Day Allah will raise all of them, and they will swear before Him as they swear before you, and will think that they have something to stand upon.",
                            "verse 58:19": "The ShaiTān (Satan) has prevailed upon them; so he has made them neglect to remember Allah.",
                            "verse 58:20": "Indeed, those who oppose Allah and His Messenger, they are among the lowest.",
                            "verse 58:21": "Allah has written (in His pre-destined decree), “I will certainly prevail, both I and My messengers.",
                            "verse 58:22": "You will not find those who believe in Allah and in the Hereafter having friendship with those who oppose Allah and His Messenger, even though they may be their fathers or their sons or their brothers or their clan."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 58:1": "God has certainly heard the words of her who disputes with you concerning her husband and complains to God.",
                            "verse 58:2": "Those of you who repudiate their wives by zihār, they are not their mothers; their mothers are only those who gave birth to them, and indeed they utter indecent words and a calumny.",
                            "verse 58:3": "And those who repudiate their wives by zihār and then go back on what they have said, then [the penalty for them is] the setting free of a slave before they touch one another.",
                            "verse 58:4": "And he who cannot find [the wherewithal], then [his redemption shall be] the fasting of two successive months before they touch one another.",
                            "verse 58:5": "Indeed those who oppose God and His Messenger will be abased, just as those before them were abased.",
                            "verse 58:6": "The day when God will raise them all together, He will then inform them of what they did.",
                            "verse 58:7": "Have you not seen that God knows all that is in the heavens and all that is in the earth? Not secret conversation of three takes place but He is their fourth ,",
                            "verse 58:8": "nor of five but He is their sixth, nor of fewer than that or more but He is with them wherever they may be.",
                            "verse 58:9": "Have you not seen those who were forbidden from conversing in secret",
                            "verse 58:10": "then returned to that they had been forbidden, and [all the while] hold secret conversations",
                            "verse 58:11": "with sin and [plans for] enmity and disobedience to the Messenger? And",
                            "verse 58:12": "when they come to you, they greet you with that with which God never greeted you and they say within themselves, ‘Why does God not chastise us for what we say?’ Hell will suffice them! In it they will be made to burn — and",
                            "verse 58:13": "an evil journey’s end!",
                            "verse 58:14": "O you who believe, if you do talk in secret, then do not talk in secret sinfully and in enmity and disobedience to the Messenger, but talk secretly in piety and fear of God.",
                            "verse 58:15": "Secret conversations are of [the work of] Satan that those who believe may end up grieving; but he cannot harm them in any way, except God’s leave.",
                            "verse 58:16": "their trust.",
                            "verse 58:17": "O you who believe, when it is said to you, ‘Make room’ during the assembly, then make room; God will make room for you.",
                            "verse 58:18": "O you who believe, when you converse in secret with the Messenger, offer some voluntary alms before your secret talk.",
                            "verse 58:19": "Do you fear to offer",
                            "verse 58:20": "alms before your secret talks.",
                            "verse 58:21": "Have you not regarded those who fraternise with a folk at whom God is wrathful? They neither belong with you, nor with them, and they swear falsely, while they know.",
                            "verse 58:22": "God has prepared for them a severe chastisement.",
                            "verse 58:23": "They have taken their oaths as a shield, and so they bar from the way of God.",
                            "verse 58:24": "Neither their possessions nor their children will avail them in any way against God.",
                            "verse 58:25": "The day when God will raise them all together, whereupon they will swear to Him, just as they swear to you ,",
                            "verse 58:26": "and suppose that they are",
                            "verse 58:27": "on something.",
                            "verse 58:28": "Satan has prevailed upon them, and so he has caused them to forget the remembrance of God.",
                            "verse 58:29": "Indeed those who oppose God and His Messenger — they will be among the most abased.",
                            "verse 58:30": "God has inscribed: ‘I shall assuredly prevail, I and My messengers’.",
                            "verse 58:31": "You will not find a people who believe in God and the Last Day loving those who oppose God and His Messenger, even though they were their fathers or their sons or their brothers or their clan.",
                            "verse 58:32": "those He has inscribed faith upon their hearts and reinforced them with a spirit from Him, and He will admit them into gardens underneath which rivers flow, wherein they will abide, God being pleased with them, and they being pleased with Him.",
                            "verse 58:33": "are God’s confederates."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 58:1": "Indeed, Allah has heard the words of the woman who was arguing with you about her husband and was pleading with Allah.",
                            "verse 58:2": "Those of you who separate their wives by zihar (i.",
                            "verse 58:3": "And those who separate their wives by zihar, but then seek to go back on what they have said, setting free a neck (a slave) is obligatory before they touch each other.",
                            "verse 58:4": "But the one who does not find (a slave) must fast for two consecutive months (as an obligation) before they touch each other.",
                            "verse 58:5": "Indeed, those who maintain rivalry against Allah and His Messenger (blessings and peace be upon him) will be humiliated as those before them were humiliated.",
                            "verse 58:6": "On the Day when Allah will raise them up (giving life again), He will then inform them of their actions.",
                            "verse 58:7": "(O man!) Do you not know that Allah knows all those things which are in the heavens and in the earth? There is no whisper of three (men) anywhere but He is their fourth (with His all-encompassing knowledge and awareness).",
                            "verse 58:8": "Have you not seen those who were forbidden to whisper? Then they started doing the same that they were forbidden to do.",
                            "verse 58:9": "O believers! When you whisper amongst yourselves, whisper not sin, injustice, revolt and disobedience to the Holy Prophet (blessings and peace be upon him); but whisper piety and Godwariness and keep fearing Allah before Whom you all will be gathered.",
                            "verse 58:10": "(Negative and destructive) whispering is (employed) by Satan alone so that he may cause anguish to the believers.",
                            "verse 58:11": "O believers! When it is said to you: ‘Open up and make room in your gatherings,’ then open up and make room.",
                            "verse 58:12": "O believers! When you seek to submit some secret to the Messenger (blessings and peace be upon him) in private, give something in charity before you submit your secret.",
                            "verse 58:13": "Are you worried about donating in charity before your submission to the Messenger (blessings and peace be upon him) in secret? So when you did not do (that) and Allah lifted from you probe (i.",
                            "verse 58:14": "Have you not seen those who make friends with such a party upon whom Allah sent wrath? They are neither of you nor of them and they take false oaths whilst they know.",
                            "verse 58:15": "Allah has prepared for them severe punishment.",
                            "verse 58:16": "They have made their (false) oaths a shield.",
                            "verse 58:17": "Neither their wealth nor their children will ever be able to save them from (the punishment of) Allah.",
                            "verse 58:18": "The Day when Allah will raise up all of them (giving life a second time), they will swear to Him (as well) as they swear to you.",
                            "verse 58:19": "Satan has gained mastery over them.",
                            "verse 58:20": "Surely, those who maintain enmity against Allah and His Messenger (blessings and peace be upon him), it is they who are of the lowest of mankind.",
                            "verse 58:21": "Allah has destined: ‘Most certainly, I and My Messengers will dominate.",
                            "verse 58:22": "You will never find those who believe in Allah and the Day of Rising making friends with anyone who is hostile to Allah and His Messenger (blessings and peace be upon him), even though they are their fathers (and forefathers), or their sons (and grandsons), or their brothers, or their near relatives."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Jumala on jo kuullut hänen vetoomuksensa, joka valitti puolisoansa vastaan, etsien oikeutta Jumalalta, Jumala on kuullut teidän keskustelunne; Jumala on totisesti kuuleva, näkevä.",
                            "verse 58:2": "Jos jotkut teistä hylkäävät vaimonsa sillä verukkeella, että nämä takaapäin ovat kuin äitinsä, niin eiväthän he ole heidän äitejään.",
                            "verse 58:3": "Niiden, jotka syrjäyttävät vaimonsa verraten heitä äiteihinsä ja sitten haluavat peruuttaa mitä ovat sanoneet, on vapautettava orja, ennenkuin he koskevat toinen toiseensa.",
                            "verse 58:4": "Mutta jos jollakulla ei ole varaa tähän, paastotkoon hän sen asemesta kaksi kuukautta peräkkäin, ennenkuin he koskevat toinen toiseensa.",
                            "verse 58:5": "Totisesti ne, jotka vastustavat Jumalaa ja Hänen sananjulistajaansa, lyödään maahan niinkuin ne, jotka elivät ennen heitä, ja Me olemme jo lähettänyt siitä selvät todisteet; ja epäuskoisia odottaa häpeällinen kuritus.",
                            "verse 58:6": "Päivänä, jolloin Jumala on herättävä heidät kaikki kuolleista, on Hän ilmoittava heille, mitä he ovat tehneet.",
                            "verse 58:7": "Etkö huomaa, että Jumala tietää kaiken, mitä on taivaassa ja maan päällä? Kolmella ei ole salaista keskustelua Hänen olemattaan siinä neljäntenä, eikä viidellä neuvottelua Hänen olemattaan kuudentena; olipa heitä vähemmän tai enemmän, Hän on läsnä missä tahansa he kokoontuvatkin.",
                            "verse 58:8": "Etkö ole nähnyt niitä, joita on kielletty pitämästä salaisia neuvotteluja, mutta jotka taas ryhtyvät siihen, mikä heiltä kiellettiin, ja salaa yllyttävät toisiaan kapinaan ja tottelemattomuuteen sananjulistajaa vastaan.",
                            "verse 58:9": "Te uskovaiset, kun pidätte yksityistä neuvottelua, älkää antako synnin yllyttää itseänne kapinaan ja tottelemattomuuteen sananjulistajaa vastaan, vaan pitäkää neuvottelunne hurskaudessa ja Jumalan pelossa ja täyttäkää velvollisuutenne Jumalaa kohtaan, jonka luokse kerran kokoonnutte.",
                            "verse 58:10": "Salaiset neuvottelut ovat lähtöisin saatanasta, joka niillä pyrkii tuottamaan murhetta uskoville, mutta hän ei voi vahingoittaa heitä hituistakaan Jumalan sallimatta, ja Jumalaan uskovaiset luottakoot.",
                            "verse 58:11": "Te uskovaiset, kun teitä pyydetään varaamaan tilaa kokouksissanne, varatkaa sitä runsaasti, Jumala on vuorostaan valmistava tilaa teille.",
                            "verse 58:12": "Te uskovaiset, kun pidätte neuvoa sananjulistajan kanssa, antakaa uhrilahja ennen neuvotteluanne.",
                            "verse 58:13": "Pelkäättekö, ettei teillä ole varaa almuihin ennen neuvotteluanne? Jos siis jätätte sen tekemättä, mutta Jumala kääntyy auttaen puoleenne, niin suorittakaa rukoukset ja antakaa säädetyt almut sekä totelkaa Jumalaa ja Hänen sanansaattajaansa, sillä Jumala tietää, mitä te teette.",
                            "verse 58:14": "Oletko ajatellut niitä, jotka turvautuvat kansaan, jolle Jumala on vihastunut? He eivät kuulu teihin ettekä te heihin, vaan he vannovat väärin vastoin parempaa tietoaan.",
                            "verse 58:15": "Jumala on heille varannut ankaran rangaistuksen, kauheaa on totisesti se, mitä he tekevät.",
                            "verse 58:16": "Valojensa varjolla he vieroittavat muita Jumalan tieltä.",
                            "verse 58:17": "Heidän omaisuutensa ja lapsensa eivät hyödytä heitä vähääkään Jumalan edessä; he joutuvat tuleen ja pysyvät siinä ikuisesti.",
                            "verse 58:18": "Sinä päivänä, jona Jumala herättää heidät kaikki kuolleista, he vannovat Hänelle niinkuin ovat vannoneet teille ja luulevat sillä jotakin voittavansa.",
                            "verse 58:19": "Saatana on ottanut vallan heissä ja saanut heidät unohtamaan Jumalan kunnioittamisen; he ovat saatanan omia.",
                            "verse 58:20": "Totisesti ne, jotka vastustavat Jumalaa ja Hänen sananjulistajaansa, kuuluvat viheliäisimpien joukkoon.",
                            "verse 58:21": "Jumala on sanonut: »Totisesti olen Minä voittava, Minä ja sananjulistajani.",
                            "verse 58:22": "Sellaisten joukosta, jotka uskovat Jumalaan ja viimeiseen päivään, et löydä ihmisiä, jotka rakastavat Jumalan ja Hänen sananjulistajansa vastustajia, vaikkapa nämä olisivat heidän isiään tai poikiaan tai veljiään tai sukulaisiaan."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 58:1": "Dieu a entendu les propos de celle qui discutait avec toi au sujet de son époux, et qui se plaignait à Dieu.",
                            "verse 58:2": "Certains d'entre vous répudient leurs femmes en disant : \" Sois pour moi comme le dos de ma mère ! \" ; pourtant, elles ne sont pas leurs mères ! Ne sont leurs mères que celles qui les ont enfantés ; ils prononcent donc des paroles détestables et mensongères.",
                            "verse 58:3": "Ceux qui répudient leurs femmes en disant qu'elles sont devenues pour eux comme leur mère et qui voudraient ensuite revenir sur leurs paroles devront affranchir un esclave avant de pouvoir reprendre la cohabitation.",
                            "verse 58:4": "Pour celui qui ne trouve pas [à s'acquitter de cette façon], qu'il jeûne durant deux mois consécutifs avant de reprendre la cohabitation.",
                            "verse 58:5": "Nul doute que ceux qui s'opposent à Dieu et à Son Envoyé seront abaissés comme l'ont été ceux qui les ont précédés.",
                            "verse 58:6": "Un jour, Dieu les ressuscitera tous et les instruira de ce qu'ils ont fait.",
                            "verse 58:7": "Ne vois-tu pas que Dieu sait ce qu'il y a dans les cieux et ce qu'il y a sur la terre ? Jamais trois individus ne s'entretiennent sans qu'Il soit le quatrième ; s'ils sont cinq, Il est le sixième.",
                            "verse 58:8": "N'as-tu pas vu ceux auxquels on avait interdit les palabres secrètes ? Ils sont revenus à ce qui leur avait été interdit et ils tiennent des conciliabules pour s'exhorter mutuellement au péché, aux transgressions et à la désobéissance envers l'Envoyé.",
                            "verse 58:9": "O vous qui croyez ! Lorsque vous participez à des palabres, ne vous exhortez pas au péché, aux transgressions et à la désobéissance envers l'Envoyé ! Entretenez-vous de bonté et de piété.",
                            "verse 58:10": "La palabre n'est qu'un moyen employé par le Démon pour affliger les croyants.",
                            "verse 58:11": "O vous qui croyez ! Quand on vous dit : \" Faites de la place ! \", dans les assemblées, faites-le ! ; Dieu fera une place pour vous ! Et quand on vous dit : \" Levez-vous ! \", faites-le ! ; Dieu élèvera de plusieurs degrés ceux d'entre vous qui croient et ceux qui ont reçu la science.",
                            "verse 58:12": "O vous qui croyez ! Lorsque vous allez vous entretenir avec le Prophète, faites précéder cet entretien d'une aumône ; vous vous en trouverez meilleurs et plus purs.",
                            "verse 58:13": "Est-ce une crainte qui vous retient de faire l'aumône avant votre entretien ? Alors, si vous ne la faites pas et que Dieu accueille votre repentir, accomplissez la prière, acquittez-vous de l'aumône légale et obéissez à Dieu et à Son Envoyé.",
                            "verse 58:14": "N'as-tu pas vu ceux qui ont pris pour protecteurs des gens contre lesquels Dieu est courroucé, et qui ne sont ni des vôtres, ni des leurs ? Ils prononcent de faux serments, et ils le savent.",
                            "verse 58:15": "Dieu leur a préparé un terrible châtiment parce que leurs agissements sont détestables.",
                            "verse 58:16": "Ils prennent leurs serments comme manteau et détournent les hommes du chemin de Dieu.",
                            "verse 58:17": "Ni leurs richesses, ni leurs enfants ne leur seront de quelque utilité contre Dieu.",
                            "verse 58:18": "Le Jour où Dieu les ressuscitera tous, ils Lui feront des serments comme ils vous en ont fait, pensant s'être assurés d'un appui solide.",
                            "verse 58:19": "Le Démon les a subjugués et leur a fait oublier le Rappel de Dieu.",
                            "verse 58:20": "Certes, ceux qui s'opposent à Dieu et à Son Envoyé, ceux-là seront parmi les plus avilis.",
                            "verse 58:21": "Dieu a décrété : \" Moi et Mes envoyés, nous ne pouvons que vaincre ! \" Dieu est fort, puissant !",
                            "verse 58:22": "Tu ne trouveras personne, parmi les gens qui croient en Dieu et au Jour dernier, qui témoigne de l'affection à ceux qui s'opposent à Dieu et à Son Envoyé, même s'il s'agit de leurs pères, de leurs fils, de leurs frères ou de membres de leur clan."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 58:1": "Dieu a bien entendu la parole de celle qui discutait avec toi à propos de son époux et se plaignait à Dieu.",
                            "verse 58:2": "Ceux d’entre vous qui répudient leurs femme, en déclarant qu’elles sont pour eux comme le dos de leur mères.",
                            "verse 58:3": "Ceux qui comparent leurs femmes au dos de leurs mères, puis reviennent sur ce qu’ils ont dit, doivent affranchir un esclave avant d’avoir aucun contact",
                            "verse 58:4": "avec leur femme.",
                            "verse 58:5": "Mais celui qui n’en trouve pas les moyens doit jeûner alors deux mois consécutifs avant d’avoir aucun contact",
                            "verse 58:6": "avec sa femme.",
                            "verse 58:7": "Ceux qui s’opposent à Dieu et à Son messager seront culbutés comme furent culbutés leurs devanciers.",
                            "verse 58:8": "le jour où Dieu les ressuscitera tous, puis les informera de ce qu’ils ont fait.",
                            "verse 58:9": "Ne vois-tu pas que Dieu sait ce qui est dans les cieux et sur la terre ? Pas de conversation secrète entre trois sans qu’Il ne soit leur quatrième, ni entre cinq sans qu’Il n’y ne soit leur sixième, ni moins ni plus que cela sans qu’Il ne soit avec eux, là où ils se trouvent.",
                            "verse 58:10": "Ne vois-tu pas ceux à qui les conversations secrètes ont été interdites ? Puis, ils retournent à ce qui leur a été interdit, et se concertent pour pécher, transgresser et désobéir au Messager.",
                            "verse 58:11": "ô vous qui avez cru ! Quand vous tenez des conversations secrètes, ne vous concertez pas pour pécher, transgresser et désobéir au Messager, mais concertez-vous dans la bonté et la piété.",
                            "verse 58:12": "La conversation secrète n’est que",
                            "verse 58:13": "du Diable pour attrister ceux qui ont cru.",
                            "verse 58:14": "ô vous qui avez cru ! Quand on vous dit : «Faites place [aux autres] dans les assemblées», alors faites place.",
                            "verse 58:15": "ô vous qui avez cru ! Quand vous avez un entretien confidentiel avec le Messager, faites précéder d’une aumône votre entretien : cela est meilleur pour vous et plus pur.",
                            "verse 58:16": "Appréhendez-vous de faire précéder d’aumônes votre entretien ? Mais, si vous ne l’avez pas fait et que Dieu a accueilli votre repentir, alors accomplissez la Salat, acquittez la Zakat, et obéissez à Dieu et à Son messager.",
                            "verse 58:17": "N’as-tu pas vu ceux qui ont pris pour alliées des gens contre qui Dieu S’est courroucé ? Ils ne sont ni des vôtres, ni des leurs; et ils jurent mensongèrement, alors qu’ils savent .",
                            "verse 58:18": "Dieu leur a préparé un dur châtiment.",
                            "verse 58:19": "Prenant leurs serments comme boucliers, ils obstruent le chemin de Dieu.",
                            "verse 58:20": "Ni leurs bien, ni leurs enfants ne leur seront d’aucune utilité contre la",
                            "verse 58:21": "de Dieu.",
                            "verse 58:22": "Le jour où Dieu les ressuscitera tous, ils Lui jureront alors comme ils vous jurent à vous-mêmes, pensant s’appuyer sur quelque chose de solide.",
                            "verse 58:23": "Le Diable les a dominés et leur a fait oublier le rappel de Dieu.",
                            "verse 58:24": "Ceux qui s’opposent à Dieu et à Son messager seront parmi les plus humiliés.",
                            "verse 58:25": "Dieu a prescrit : «Assurément, Je triompherai, moi ainsi que Mes Messagers».",
                            "verse 58:26": "Tu n’en trouveras pas, parmi les gens qui croient en Dieu et au Jour dernier, qui prennent pour amis ceux qui s’opposent à Dieu et à Son Messager, fussent-ils leur pères, leur fils, leurs frères ou les gens de leur tribu."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Allah hat das Wort jener gehört, die bei dir wegen ihres Mannes vorstellig wurde und sich vor Allah beklagte.",
                            "verse 58:2": "Die unter euch, die ihre Frauen Mütter nennen - sie werden nicht ihre Mütter; ihre Mütter sind einzig jene, die sie geboren haben; und sie äußern da nur Worte, die unziemlich und unwahr sind; doch wahrlich, Allah ist Tilger der Sünden, allverzeihend.",
                            "verse 58:3": "Jene nun, die ihre Frauen Mütter nennen und dann zurücknehmen möchten, was sie gesagt - (die Buße dafür) ist die Befreiung eines Sklaven, bevor sie einander berühren.",
                            "verse 58:4": "Wer aber keinen findet, dann: zwei Monate hintereinander fasten, bevor sie einander berühren.",
                            "verse 58:5": "Diejenigen, die sich Allah und Seinem Gesandten widersetzen, die werden gewiß erniedrigt werden, eben wie die vor ihnen erniedrigt wurden; denn Wir haben bereits deutliche Zeichen herniedergesandt.",
                            "verse 58:6": "Am Tage, da Allah sie alle zusammen auferweckt, da wird Er ihnen verkünden, was sie getan.",
                            "verse 58:7": "Siehst du denn nicht, daß Allah alles weiß, was in den Himmeln ist, und alles, was auf Erden ist? Keine geheime Unterredung zwischen dreien gibt es, bei der Er nicht vierter wäre, noch eine zwischen fünfen, bei der Er nicht sechster wäre, noch zwischen weniger oder mehr als diesen, ohne daß Er mit ihnen wäre, wo immer sie sein mögen.",
                            "verse 58:8": "Hast du nicht die beobachtet, denen geheime Verschwörung verboten ward und die doch zurückkehren zu dem, was ihnen verboten ward, und sich insgeheim verschwören zu Sünde und Übertretung und Ungehorsam gegen den Gesandten? Und wenn sie zu dir kommen, so begrüßen sie dich mit dem, womit dich nicht Allah begrüßt hat; bei sich aber sprechen sie: «Warum straft uns Allah nicht für das, was wir (wider ihn) sprechen?» Genügend für sie ist die Hölle, worin sie eingehen werden; und übel ist die Bestimmung!",
                            "verse 58:9": "O die ihr glaubt, wenn ihr euch heimlich miteinander beredet, beredet euch nicht zu Sünde und Übertretung und Ungehorsam gegen den Gesandten, sondern beredet euch zu Tugend und Rechtschaffenheit, und fürchtet Allah, zu Dem ihr versammelt werdet.",
                            "verse 58:10": "Geheime Verschwörung ist allein von Satan, auf daß er die betrübe, die gläubig sind; doch er kann ihnen nicht den geringsten Schaden zufügen, es sei denn mit Allahs Erlaubnis.",
                            "verse 58:11": "O die ihr glaubt, wenn in Versammlungen zu euch gesprochen wird: «Macht Platz!»- dann macht Platz; Allah wird ausgiebigen Platz für euch machen.",
                            "verse 58:12": "O die ihr glaubt, wenn ihr euch mit dem Gesandten vertraulich beraten wollt, so schickt Almosen eurer vertraulichen Beratung voraus.",
                            "verse 58:13": "Seid ihr unruhig in bezug auf das Geben von Almosen vor eurer vertraulichen Beratung? Nun denn, wenn ihr es nicht tut und Allah euch in Seine Barmherzigkeit aufnimmt, dann verrichtet das Gebet und zahlet die Zakat und gehorchet Allah und Seinem Gesandten Und Allah ist wohl kundig dessen, was ihr tut.",
                            "verse 58:14": "Hast du nicht die gesehen, die sich ein Volk zu Freunden nehmen, dem Allah zürnt? Sie gehören weder zu euch noch zu ihnen, und Sie beschwören wissentlich eine Lüge.",
                            "verse 58:15": "Allah hat für sie eine strenge Strafe bereitet.",
                            "verse 58:16": "Sie haben ihre Eide zu einem Schild (für ihre Missetaten) gemacht, und sie machen abwendig vom Pfade Allahs; für sie wird darum eine erniedrigende Strafe sein.",
                            "verse 58:17": "Weder ihre Reichtümer noch ihre Kinder werden ihnen im geringsten nützen gegen Allah.",
                            "verse 58:18": "Am Tage, da Allah sie versammeln wird allzumal, da werden sie Ihm schwören, wie sie euch schwören, und sie werden wähnen, sie stünden auf etwas.",
                            "verse 58:19": "Satan hat völlige Macht über sie gewonnen und hat sie die Ermahnung Allahs vergessen lassen.",
                            "verse 58:20": "Fürwahr jene, die sich Allah und Seinem Gesandten widersetzen, werden unter den Niedrigsten sein.",
                            "verse 58:21": "Allah hat verordnet: Sicherlich werde Ich obsiegen, Ich und Meine Gesandten.",
                            "verse 58:22": "Du wirst kein Volke finden, das an Allah und an den Jüngsten Tag glaubt, und dabei die liebt, die sich Allah und Seinem Gesandten widersetzen, selbst wenn es ihre Väter wären oder ihre Söhne oder ihre Brüder oder ihre Verwandten."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": ",s jlwy tks vkSjr ¼[+kqyk½ rqels vius ÓkSgj ¼ml½ ds ckjs esa rqels >xM+rh vkSj [+kqnk ls fxys f’kdos djrh gS [+kqnk us mldh ckr lqu yh vkSj [+kqnk rqe nksuksa dh x+q¶rxw lqu jgk gS cs’kd [+kqnk cM+k lquus okyk ns[kus okyk gS",
                            "verse 58:2": "rqe esa ls tks yksx viuh chfo;ksa ds lkFk t+gkj djrs gSa viuh choh dks ek¡ dgrs gSa og dqN mudh ek,¡ ugha ¼gks tkrha½ mudh ek,¡ rks cl ogh gSa tks mudks turh gSa vkSj og cs’kd ,d ukekd+wy vkSj >wBh ckr dgrs gSa vkSj [+kqnk cs’kd ekQ djus okyk vkSj cM+k c[+’kus okyk gS",
                            "verse 58:3": "vkSj tks yksx viuh chfo;ksa ls t+gkj dj cSBs fQj viuh ckr okil ysa rks nksuksa ds gefcLrj gksus ls igys ¼d¶+Q+kjs esa½ ,d x+qyke dk vkt+kn djuk ¼t+:jh½ gS mldh rqedks ulhgr dh tkrh gS vkSj rqe tks dqN Hkh djrs gks ¼[+kqnk½ mlls vkxkg gS",
                            "verse 58:4": "fQj ftldks x+qyke u feys rks nksuksa dh eqd+kjcr ds d+Cy nks eghus ds iS nj iS jkst+s j[ksa vkSj ftldks bldh Hkh d+qnjr u gks lkB eksgrktksa dks [kkuk f[kykuk Qt+Z gS ;s ¼gqD+e blfy, gS½ rkfd rqe [+kqnk vkSj mlds jlwy dh ¼iSjoh½ rlnhd+ djks vkSj ;s [+kqnk dh eqd+jZj gnsa gSa vkSj dkfQ+jksa ds fy, nnZukd vt+kc gS",
                            "verse 58:5": "cs’kd tks yksx [+kqnk dh vkSj mlds jlwy dh eq[+kkYksQ+r djrs gSa og ¼mlh rjg½ t+yhy fd, tk,¡xs ftl rjg muds igys yksx fd, tk pqds gSa vkSj ge rks viuh lkQ+ vkSj ljhgh vk;rasa ukft+y dj pqds vkSj dkfQjksa ds fy, t+yhy djus okyk vt+kc gS",
                            "verse 58:6": "ftl fnu [+kqnk mu lcdks nksckjk mBk,xk rks muds vkeky ls mudks vkxkg dj nsxk ;s yksx ¼vxjps½ mudks Hkwy x;s gSa exj [+kqnk us mudks ;kn j[kk gS vkSj [+kqnk rks gj pht+ dk xokg gS",
                            "verse 58:7": "D;k rqedks ekywe ugha fd tks dqN vklekuksa esa gS vkSj tks dqN t+ehu esa gS ¼x+jt+ lc dqN½ [+kqnk tkurk gS tc rhu ¼vknfe;ksa½ dk [+kqfQ;k e’kosjk gksrk gS rks og ¼[+kqn½ mudk t+:j pkSFkk gS vkSj tc ik¡p dk e’kosjk gksrk gS rks og mudk NBk gS vkSj mlls de gks ;k T+;knk vkSj pkgs tgk¡ dgha gks og muds lkFk t+:j gksrk gS fQj tks dqN og ¼nqfu;k esa½ djrs jgs d+;ker ds fnu mudks mlls vkxkg dj nsxk cs’kd [+kqnk gj pht+ ls [+kwc okfd+Q+ gS",
                            "verse 58:8": "D;k rqeus mu yksxksa dks ugha ns[kk ftudks ljxksf’k;k¡ djus ls euk fd;k x;k x+jt+ ftl dke dh mudks eqekfuvr dh x;h Fkh mlh dks fQj djrs gSa vkSj ¼yqRQ+ rks ;s gS fd½ xqukg vkSj ¼cstk½ T+;knrh vkSj jlwy dh ukQjekuh dh ljxksf’k;k¡ djrs gSa vkSj tc rqEgkjs ikl vkrs gSa rks ftu y¶+t+ksa ls [+kqnk us Hkh rqe dks lyke ugha fd;k mu y¶+t+ksa ls lyke djrs gSa vkSj vius th esa dgrs gSa fd ¼vxj ;s okd+bZ iSx+Ecj gSa rks½ tks dqN ge dgrs gSa [+kqnk gesa mldh lt+k D;ksa ugha nsrk ¼,s jlwy½ mudks nkst+[+k gh ¼dh lt+k½ dkQh gS ftlesa ;s nkf[+ky gksaxs rks og ¼D;k½ cqjh txg gS",
                            "verse 58:9": ",s bZekunkjksa tc rqe vkil esa ljxks’kh djks rks xqukg vkSj T+;knrh vkSj jlwy dh ukQjekuh dh ljxks’kh u djks cfYd usdhdkjh vkSj ijgst+xkjh dh ljxks’kh djks vkSj [+kqnk ls Mjrs jgks ftlds lkeus ¼,d fnu½ tek fd, tkvksxs",
                            "verse 58:10": "¼cjh ckrksa dh½ ljxks’kh rks cl ,d ÓSrkuh dke gS ¼vkSj blfy, djrs gSa½ rkfd bZekunkjksa dks mlls jat igq¡ps gkykWfd [+kqnk dh rjQ ls vkt+knh fn, cx+Sj ljxks’kh mudk dqN fcxkM+ ugha ldrh vkSj eksfeuhu dks rks [+kqnk gh ij Hkjkslk j[kuk pkfg,",
                            "verse 58:11": ",s bZekunkjksa tc rqels dgk tk, fd etfyl esa txg dq’kknk djks og rks dq’kknk dj fn;k djks [+kqnk rqedks dq’kknxh vrk djsxk vkSj tc rqels dgk tk, fd mB [kM+s gks rks mB [kM+s gqvk djks tks yksx rqels bZekunkj gSa vkSj ftudks bYe vrk gqvk gS [+kqnk muds ntsZ cqyUn djsxk vkSj [+kqnk rqEgkjs lc dkeksa ls cs[+kcj gS",
                            "verse 58:12": ",s bZekunkjksa tc iSx+Ecj ls dksbZ ckr dku esa dguh pkgks rks dqN [+kSjkr viuh ljxks’kh ls igys ns fn;k djks ;gh rqEgkjs okLrs csgrj vkSj ikdht+k ckr gS il vxj rqedks bldk eqd+nwj u gks rks cs’kd [+kqnk cM+k c[+’kus okyk esgjcku gS",
                            "verse 58:13": "¼eqlyekuksa½ D;k rqe bl ckr ls Mj x, fd ¼jlwy ds½ dku esa ckr dgus ls igys [+kSjkr dj yks rks tc rqe yksx ¼bruk lk dke½ u dj lds vkSj [+kqnk us rqEgsa ekQ+ dj fn;k rks ikcUnh ls uekt+ i<+ks vkSj t+dkr nsrs jgks vkSj [+kqnk mlds jlwy dh brkvr djks vkSj tks dqN rqe djrs gks [+kqnk mlls ck[+kcj gS",
                            "verse 58:14": "D;k rqeus mu yksxksa dh gkyr ij x+kSj ugha fd;k tks mu yksxksa ls nksLrh djrs gSa ftu ij [+kqnk us x+t+c <k;k gS rks vc og u rqe es gSa vkSj u muesa ;s yksx tkucw> dj >wBh ckrks ij d+lesa [kkrs gSa vkSj og tkurs gSa",
                            "verse 58:15": "[+kqnk us muds fy, l[+r vt+kc rS;kj dj j[kk gS blesa Ód ugha fd ;s yksx tks dqN djrs gSa cgqr gh cqjk gS",
                            "verse 58:16": "mu yksxksa us viuh d+leksa dks flij cuk fy;k gS vkSj ¼yksxksa dks½ [+kqnk dh jkg ls jksd fn;k rks muds fy, :lok djus okyk vt+kc gS",
                            "verse 58:17": "[+kqnk lkeus gjfxt+ u muds eky gh dqN dke vk,¡xs vkSj u mudh vkSykn gh dke vk,xh ;gh yksx tgUuqeh gSa fd ges’kk mlesa jgsaxs",
                            "verse 58:18": "ftl fnu [+kqnk mu lcdks nksckj mBk [kM+k djsxk rks ;s yksx ftl rjg rqEgkjs lkeus d+lesa [kkrs gSa mlh rjg mlds lkeus Hkh d+lesa [kk,¡xs vkSj [+;ky djrs gSa fd og jkgs lokc ij gSa vkxkg jgks ;s yksx ;d+huu >wBs gSa",
                            "verse 58:19": "ÓSrku us bu ij d+kcw ik fy;k gS vkSj [+kqnk dh ;kn muls Hkqyk nh gS ;s yksx ÓSrku ds fxjksg gS lqu j[kks fd ÓSrku dk fxjksg ?kkVk mBkus okyk gS",
                            "verse 58:20": "tks yksx [+kqnk vkSj mlds jlwy ls eq[+kkysQ+r djrs gSa og lc t+yhy yksxksa esa gSa",
                            "verse 58:21": "[+kqnk us gqD+e ukfrd ns fn;k gS fd eSa vkSj esjs iSx+Ecj t+:j x+kfyc jgsaxs cs’kd [+kqnk cM+k t+cjnLr x+kfyc gS",
                            "verse 58:22": "tks yksx [+kqnk vkSj jkst+s vk[+skjr ij bZeku j[krs gSa rqe mudks [+kqnk vkSj mlds jlwy ds nq’euksa ls nksLrh djrs gq, u ns[kksxs vxjps og muds cki ;k csVs ;k HkkbZ ;k [+kkunku gh ds yksx ¼D;ksa u gksa½ ;gh og yksx gSa ftuds fnyksa esa [+kqnk us beku dks lkfcr dj fn;k gS vkSj [+kkl vius uwj ls mudh rkbZn dh gS vkSj mudks ¼csfg’r esa½ mu ¼gjs Hkjs½ ckx+ksa esa nkf[ky djsxk ftuds uhps ugjs tkjh gS ¼vkSj og½ ges’k mlesa jgsaxs [+kqnk muls jkt+h vkSj og [+kqnk ls [+kq’k ;gh [+kqnk dk fxjksg gS lqu j[kks fd [+kqnk ds fxjksx ds yksx fnyh eqjknsa ik,¡xs"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Sesungguhnya Allah telah mendengar perkataan wanita yang memajukan gugatan kepada kamu tentang suaminya, dan mengadukan (halnya) kepada Allah.",
                            "verse 58:2": "Orang-orang yang menzhihar isterinya di antara kamu, (menganggap isterinya sebagai ibunya, padahal) tiadalah isteri mereka itu ibu mereka.",
                            "verse 58:3": "Orang-orang yang menzhihar isteri mereka, kemudian mereka hendak menarik kembali apa yang mereka ucapkan, maka (wajib atasnya) memerdekakan seorang budak sebelum kedua suami isteri itu bercampur.",
                            "verse 58:4": "Barangsiapa yang tidak mendapatkan (budak), maka (wajib atasnya) berpuasa dua bulan berturut-turut sebelum keduanya bercampur.",
                            "verse 58:5": "Sesungguhnya orang-orang yang menentang Allah dan Rasul-Nya pasti mendapat kehinaan sebagaimana orang-orang yang sebelum mereka telah mendapat kehinaan.",
                            "verse 58:6": "Pada hari ketika mereka dibangkitkan Allah semuanya, lalu diberitakan-Nya kepada mereka apa yang telah mereka kerjakan.",
                            "verse 58:7": "Tidakkah kamu perhatikan, bahwa sesungguhnya Allah mengetahui apa yang ada di langit dan apa yang ada di bumi? Tiada pembicaraan rahasia antara tiga orang, melainkan Dia-lah yang keempatnya.",
                            "verse 58:8": "Apakah tiada kamu perhatikan orang-orang yang telah dilarang mengadakan pembicaraan rahasia, kemudian mereka kembali (mengerjakan) larangan itu dan mereka mengadakan pembicaraan rahasia untuk berbuat dosa, permusuhan dan durhaka kepada Rasul.",
                            "verse 58:9": "Hai orang-orang yang beriman, apabila kamu mengadakan pembicaraan rahasia, janganlah kamu membicarakan tentang membuat dosa, permusuhan dan durhaka kepada Rasul.",
                            "verse 58:10": "Sesungguhnya pembicaraan rahasia itu adalah dari syaitan, supaya orang-orang yang beriman itu berduka cita, sedang pembicaraan itu tiadalah memberi mudharat sedikitpun kepada mereka, kecuali dengan izin Allah dan kepada Allah-lah hendaknya orang-orang yang beriman bertawakkal.",
                            "verse 58:11": "Hai orang-orang yang beriman, apabila dikatakan kepadamu: \"Berlapang-lapanglah dalam majlis\", maka lapangkanlah, niscaya Allah akan memberi kelapangan untukmu.",
                            "verse 58:12": "Hai orang-orang yang beriman, apabila kamu mengadakan pembicaraan khusus dengan Rasul hendaklah kamu mengeluarkan sedekah (kepada orang miskin) sebelum pembicaraan itu.",
                            "verse 58:13": "Apakah kamu takut akan (menjadi miskin) karena kamu memberikan sedekah sebelum pembicaraan dengan Rasul? Maka jika kamu tiada memperbuatnya dan Allah telah memberi taubat kepadamu maka dirikanlah sembahyang, tunaikanlah zakat dan ta’atlah kepada Allah dan Rasul-Nya; dan Allah Maha Mengetahui apa yang kamu kerjakan.",
                            "verse 58:14": "Tidakkah kamu perhatikan orang-orang yang menjadikan suatu kaum yang dimurkai Allah sebagai teman? Orang-orang itu bukan dari golongan kamu dan bukan (pula) dari golongan mereka.",
                            "verse 58:15": "Allah telah menyediakan bagi mereka azab yang sangat keras, sesungguhnya amat buruklah apa yang telah mereka kerjakan.",
                            "verse 58:16": "Mereka menjadikan sumpah-sumpah mereka sebagai perisai, lalu mereka halangi (manusia) dari jalan Allah; karena itu mereka mendapat azab yang menghinakan.",
                            "verse 58:17": "Harta benda dan anak-anak mereka tiada berguna sedikitpun (untuk menolong) mereka dari azab Allah.",
                            "verse 58:18": "(Ingatlah) hari (ketika) mereka semua dibangkitkan Allah, lalu mereka bersumpah kepada-Nya (bahwa mereka bukan orang musyrik) sebagaimana mereka bersumpah kepadamu; dan mereka menyangka bahwa sesungguhnya mereka akan memperoleh suatu (manfa’at).",
                            "verse 58:19": "Syaitan telah menguasai mereka lalu menjadikan mereka lupa mengingat Allah; mereka itulah golongan syaitan.",
                            "verse 58:20": "Sesungguhnya orang-orang yang menentang Allah dan Rasul-Nya, mereka termasuk orang-orang yang sangat hina.",
                            "verse 58:21": "Allah telah menetapkan: \"Aku dan rasul-rasul-Ku pasti menang\".",
                            "verse 58:22": "Kamu tidak akan mendapati sesuatu kaum yang beriman kepada Allah dan hari akhirat, saling berkasih sayang dengan orang-orang yang menentang Allah dan Rasul-Nya, sekalipun orang-orang itu bapak-bapak, atau anak-anak atau saudara-saudara ataupun keluarga mereka."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Allah ha udito il discorso di colei che discuteva con te a proposito del suo sposo e si lamentava",
                            "verse 58:2": "ad Allah.",
                            "verse 58:3": "Quanti fra voi che ripudiano le loro mogli dicendo: «Sii per me come la schiena di mia madre » [sappiano che] esse non sono affatto le loro madri.",
                            "verse 58:4": "Coloro che paragonano le loro mogli alla schiena delle loro madri e poi si pentono di quello che hanno detto, liberino uno schiavo prima di riprendere i rapporti coniugali.",
                            "verse 58:5": "E colui che non ne abbia i mezzi, digiuni",
                            "verse 58:6": "per due mesi consecutivi prima di riprendere i rapporti coniugali.",
                            "verse 58:7": "In verità coloro che si oppongono ad Allah e al Suo Inviato, saranno sgominati come lo furono coloro che li precedettero.",
                            "verse 58:8": "nel Giorno in cui Allah tutti li resusciterà e li informerà delle loro opere.",
                            "verse 58:9": "Non vedi che Allah conosce quel che è nei cieli e sulla terra ? Non c'è conciliabolo a tre in cui Egli non sia il quarto, né a cinque in cui non sia il sesto; siano in più o in meno, Egli è con loro ovunque si trovino.",
                            "verse 58:10": "Non hai visto coloro ai quali sono stati vietati i conciliaboli? Hanno ricominciato [a fare] quel che era stato loro vietato e tengono conciliaboli peccaminosi, ostili e di disobbedienza nei confronti dell'Inviato .",
                            "verse 58:11": "O credenti, non siano peccaminosi ostili e di disobbedienza nei confronti dell'Inviato i vostri colloqui privati, ma nel bene e nel timor di Allah.",
                            "verse 58:12": "Il conciliabolo non è altro che opera di Satana, per affliggere i credenti ; ma in nulla può nuocer loro senza il permesso di Allah.",
                            "verse 58:13": "O credenti, quando vi si dice: « Fate spazio [agli altri] nelle assemblee», allora fatelo: Allah vi farà spazio [in Paradiso].",
                            "verse 58:14": "O credenti! Quando desiderate un incontro privato con il Messaggero, fate precedere il vostro incontro da un elemosina: è meglio per voi e più puro .",
                            "verse 58:15": "Forse temete [di cadere in miseria] se farete precedere un elemosina ai vostri incontri privati [con l'Inviato]? Se non lo avrete fatto - e che Allah accolga il vostro pentimento - eseguite l'orazione, versate la decima e obbedite ad Allah e al Suo Inviato.",
                            "verse 58:16": "Non hai visto coloro che si sono alleati con quelli con i quali Allah è adirato? Non sono né dei vostri né dei loro, e giurano il falso sapendo di farlo .",
                            "verse 58:17": "Allah ha preparato per loro un severo castigo.",
                            "verse 58:18": "facendosi scudo dei loro giuramenti, frappongono ostacoli sulla via di Allah.",
                            "verse 58:19": "I loro beni e la loro progenie non gioveranno loro in alcun modo contro Allah.",
                            "verse 58:20": "Il Giorno in cui Allah li resusciterà tutti, giureranno",
                            "verse 58:21": "a Lui come giuravano",
                            "verse 58:22": "a voi, credendo di basarsi su qualcosa [di vero].",
                            "verse 58:23": "Satana si è impadronito di loro, al punto di far sì che dimenticassero il Ricordo di Allah.",
                            "verse 58:24": "In verità, coloro che si oppongono ad Allah e al Suo Inviato saranno fra i più umiliati.",
                            "verse 58:25": "Allah ha scritto: « Invero vincerò, Io e i Miei messaggeri».",
                            "verse 58:26": "Non troverai alcuno, tra la gente che crede in Allah e nell'Ultimo Giorno, che sia amico di coloro che si oppongono ad Allah e al Suo Inviato, fossero anche i loro padri, i loro figli, i loro fratelli o appartenessero al loro clan ."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "アッラーは，自分の夫に就いてあなたに抗弁し，なおアッラーに不平を申し立（て祈）る女の言葉を御聞きになられた。アッラーは，あなたがた両人の議論を御聞きになられた。本当にアッラーは全聴にして全視であられる。",
                            "verse 58:2": "あなたがたの中で，ズィハールによって，その妻を遠ざける者がある。しかしかの女らはかれらの母ではない。母はかれらを生んだ者以外にはないのである。実にかれらの言うことは不法な，虚偽の言葉である。本当にアッラーは寛容にしてよく罪を赦される。",
                            "verse 58:3": "ズィハールを宣言してその妻を遠ざけた者が，後にその言ったことを撤回しようとする時は，両人が互に触れる前に，一人の奴隷を解放しなければならない。これは，あなたがたに戒告されたことである。アッラーは，あなたがたの行うことを熟知なされる。",
                            "verse 58:4": "しかし（解放する奴隷を）持たない者は，両人が互に触れる前に，2ヶ月続けて斎戒しなさい。それをなし得ない者は，60人の貧者に食を与えなさい。これは，あなたがたにアッラーと使徒を信じさせるためである。これらがアッラーの� である。不信者に対しては痛ましい懲罰があろう。",
                            "verse 58:5": "本当にアッラーと使徒を拒否する者は，かれら以前の者たちが，卑しめられたように卑しめられるであろう。われは明白な印を下している。不信者に対しては，恥ずべき懲罰があろう。",
                            "verse 58:6": "その日アッラーはかれらを一斉に甦らせ，かれらの行ったことを告げられる。かれらはその事を忘れているが，アッラーはそれを計算に入れられる。本当にアッラーは凡てのことを実証される御方である。",
                            "verse 58:7": "あなたは，天地にある凡てのものをアッラーが知っておられることを知らないのか。3人で秘密の相談をしてもかれは4人目に常におり，5人の時もかれらの6人目に常におられる。それより少くてもまた多くても，かれらが何処にいようとも，かれはかれらと共におられる。それで審判の日には，かれはかれらの行ったことを，かれらに告げられる。本当にアッラーは凡てのことを熟知なされる。",
                            "verse 58:8": "あなたは，秘密の相談を禁じられた者たちが，その後禁じられたことに返っているのを見なかったのか。かれらは罪悪と敵意と使徒への犯意とで，密議したではないか。またかれらがあなたのもとに来た時，アッラーがあなたに対して決して挨拶されなかった言葉（死を意味する呪いの言葉など）で，あなたに挨拶しておいて（罵って）からかれらは仲間うちで，「何故アッラーは，わたしたちの言ったことを罰さないのだろうか。」と言う。かれらには地獄で十分である。かれらはその中で焼かれよう。何と悪い帰り所であることよ。",
                            "verse 58:9": "あなたがた信仰する者よ，あなたがたが秘密の相談をする時は，罪と敵意と，使徒への犯意とで密議してはならない。善意と敬神の念をもって相談しなさい。アッラーの御許に，あなたがたは集められるのである。かれを畏れなさい。",
                            "verse 58:10": "秘密の相談は，悪魔による（示唆）だけで，信仰する者たちを悲嘆させるためのもの。だがアッラーの御許しがない限り，少しもかれらを害することは出来ない。それで信者たちに，アッラーを信じさせなさい。",
                            "verse 58:11": "あなたがた信仰する者よ，集会のおりに（広く）席をあけなさいと言われた時は，直ぐ席を譲れ。アッラーはあなたがたのために（十分な）席を与えられる。また立ち上るよう言われた時は，直ぐ立て。アッラーはあなたがたの中信仰する者や，知識を授けられた者の位階を上げられる。本当にアッラーは，あなたがたの行う一切を熟知なされる。",
                            "verse 58:12": "信仰する者よ，あなたがたが使徒に私的な相談をする時は，相談を始める前にまず施し〔サダカ〕をしなさい。それはあなたがたのために最も良く，また最も清廉なことである。もし（それが）出来なくても，本当にアッラーは寛容にして慈悲深くおわします。",
                            "verse 58:13": "あなたがたは，私的な相談を始める前に施しをすることを尻込みするのか。仮にそれを行わず，アッラーがあなたがたに悔悟を赦された場合は，礼拝の務めを守り，定めの喜捨をし，アッラーと使徒に従いなさい。アッラーはあなたがたの行う一切を熟知なされる。",
                            "verse 58:14": "あなたは，アッラーの怒りを被った人びとを友とする者に，気付かないのか。かれら（偽信者）はあなたがた（の仲間）でもなく，またかれら（の仲間）でもない。かれらは知っていながら，偽りの誓いをたてる。",
                            "verse 58:15": "アッラーはかれらのため，厳しい懲罰を備えられる。本当にかれらの行うことは大悪である。",
                            "verse 58:16": "かれらは誓いを（かれらの悪行の）隠れ場とし，アッラーの道から（人びとを）阻む。かれらは恥ずべき懲罰を受けるであろう。",
                            "verse 58:17": "かれらの富も子女も，アッラーに対しては，少しも役立たない。かれらは業火の仲間である。永遠にその中に住むであろう。",
                            "verse 58:18": "アッラーが，一斉にかれらを復活させる日，かれらは（現世で）あなたがた（ムスリム）に誓ったようにかれに（ぬけぬけと信者であると）誓い，かれらは（これによって）来世でも何とかなると思っている。いやとんでもない。かれらは本当に虚言の徒である。",
                            "verse 58:19": "悪魔がかれらを支配し，アッラーを念うことを忘れさせた。かれらは悪魔の仲間である。本当に悪魔の仲間は損失者である。",
                            "verse 58:20": "アッラーと使徒に反抗する者は，最も卑しい者の仲間である。",
                            "verse 58:21": "アッラーは，「われとわが使徒たちは必ず勝つ。」と規定なされた。本当にアッラーは，強大にして偉力ならびなき御方であられる。",
                            "verse 58:22": "あなたは，アッラーと終末の日を信じる民が，アッラーと使徒に反抗するような者と親交を結ぶところを見ないであろう。仮令かれらがかれらの父や，子，兄弟や親族であっても。かれはこれらの者の心の中に信仰を書き留められ，親しく聖霊によって強められる。また川が下を流れる楽園に入らせ，永遠にその中に住ませられるのである。アッラーはかれらを愛でられ，かれらもかれに満悦すろ。これらは，アッラーの一党（信者）の者である。本当に，アッラーの一党の者こそ，非常な幸福を成就する者である。 アッラーは，「われとわが使徒たちは必ず勝つ。」と規定なされた。本当にアッラーは，強大にして偉力ならびなき御方であられる。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "하나님은 그녀의 남편에 관하여 그대에게 변론하고 하나님께 호소한 그녀의 진술을 수락하사 너희 쌍방간의 진술을 듣고 계시 나니 실로 하나님은 들으심과 지 켜보심으로 충만하심이라",
                            "verse 58:2": "너희 가운데 지하르 형태로 아내와 이혼하려는 자 있으나 그 녀들은 그들의 어머니들이 될 수 없으며 낳아 준 분 외에는 어느 누구도 어머니들이 결코 될 수 없 나니 실로 그들은 혐오스럽고 거 짓된 말을 하도다 그러나 하나님 은 용서하심과 관용으로 충만하시 니라",
                            "verse 58:3": "그러나 지하르 형태로 아내와 이혼한 자가 그들이 말한 것을 취 소할 때 그들은 그녀와 동침하기 전에 한명의 노예를 해방시키라 너희가 충고를 들었거늘 실로 하 나님은 너희가 행하는 모든 것을 지켜보고 계시니라",
                            "verse 58:4": "그러나 노예가 없는 자는 동 침하기 전에 계속하여 두 달을 단식하게 하고 그렇게도 할 수 없는자는 굶주린 자 육십명을 배불리 먹이게 하라 이것은 너희로 하여 금 하나님과 그분의 선지자를 믿 도록 함에 있으며 또한 이것들이 하나님의 규범이라 그러나 불신자들에게는 고통스러운 응벌이 있을뿐이라",
                            "verse 58:5": "그들 이전의 선조들이 그랬듯이 실로 하나님과 그분의 선지자 께 거역했던 자들은 멸망하게 되 매 이는 하나님께서 이미 분명한 예증들을 보냈나니 불신자들은 굴욕적인 응벌을 받게 될 것이라",
                            "verse 58:6": "그날이 되면 하나님께서 그들을 부활시켜 그들이 행한 모든 것을 그들에게 알려주사 하나님은 이미 그것을 기록하여 두셨거늘 그들이 그것을 망각했노라 실로 하나님은 모든 것을 증인하시는 것으로 충만하심이라",
                            "verse 58:7": "하늘과 대지에 있는 모든 것 을 하나님께서 알고 계신다는 것 을 너희는 알지 못하느뇨 셋 사이에 비밀 이야기가 있을 수 없나니하나님께서 그들 가운데 네번째로계시며 넷 사이에는 다섯번째로 계시며 그보다 적지 아니하고 많 지도 아니하고 그들이 어디에 있 던 항상 그분께서 그들과 함께 하 시어 심판의 날 그들 행위에 대한 사실을 그들에게 말씀하시기 때문 이라 실로 하나님은 모든 일에 전 지전능하시노라",
                            "verse 58:8": "비밀의 모임이 금기된 그들을보지 아니했느뇨 그러나 그들은 금기된 것으로 돌아가 선지자에 대한 죄악과 음모와 거역을 위한 비밀의 모임을 가진 후 그들이 그 대에게 다가와 하나님께서 그대를 맞이하지 않는 인사로써 그대를 맞이하더라 그리고 스스로들 말 하길 우리의 얘기에 대하여 하나 님은 왜 우리를 벌하지 않느뇨 라 고 하였으나 지옥만으로 그들에게 는 충분하나니 그 안에서 그들은 불타게 되매 얼마나 비참한 운명 이뇨",
                            "verse 58:9": "믿는 사람들이여 너희가 모일 을 가질 때 선지자에 대하여 죄악 과 음모와 거역을 위한 비밀의 대 화를 하지 말며 진리와 의로움의 모임을 가지되 하나님을 두려워 하라 너희 모두는 그분께로 귀의 하노라",
                            "verse 58:10": "비밀의 음모는 오직 사탄의 행위로 믿는 사람들을 슬프게는 할 수 있으되 하나님의 허락없이 는 그들을 해칠 수는 없노라 그러 므로 믿는 자들로 하여금 하나님 께만 의탁하도록 하라",
                            "verse 58:11": "믿는 사람들이여 너희 회중 에 공간을 두라 얘기를 들을 때면 공간을 두라 하나님께서 너희에 게더 큰 것을 주시리라 그리고 일 어서라 말을 들을 때면 일어서라 하나님께서 더 높이 일으켜 주시 리라 하나님은 믿음을 가진 자와 지식을 가진 자에게 더 높은 곳 을 주시나니 실로 하나님은 너희 가 행하는 모든 것을 지켜보고 계 시니라",
                            "verse 58:12": "믿는 사람들이여 너희가 선 지자와 의논을 할 때 의논하기 전 에 자선으로 무엇인가를 베풀지 니 그것이 너희를 위한 은혜요 더 깨끗한 것이라 그러나 너희가 할 수 없다 해도 하나님은 관용과 자 비로 충만하시니라",
                            "verse 58:13": "너희는 그분과 의논하기 전 에 자선을 베풀 수 없으리라 두려 워 하느뇨 너희가 그렇게 할 수 없다 하더라도 하나님은 너희를 용서하시나니 예배를 드리고 이슬 람세를 바치며 하나님과 그분의 선지자에게 순종하라 하나님은 너 희가 행하는 모든 것을 지켜보고 계시니라",
                            "verse 58:14": "그대는 하나님께서 노하시는자들과 함께 한 그들을 보지 아니 했느뇨 그들은 너희편도 아니며 그들편도 아니며 그들은 알면서도 거짓 맹세하고 있을 뿐이라",
                            "verse 58:15": "하나님은 그들을 위하여 무 서운 응벌을 준비하셨나니 실로 그들이 행한 모든 것에 저주가 있 으리라",
                            "verse 58:16": "그들은 거짓된 믿음으로 스 스로를 숨기어 하나님의 길에서 벗어나려 하니 그들에게는 굴욕적 인 응벌이 있을 뿐이라",
                            "verse 58:17": "그들의 재물도 그들의 자손 도 하나넘에 대항하여 그들에게 유용하지 못하나니 그들은 불지옥 의 동료가 되어 그곳에서 영주하 리라",
                            "verse 58:18": "하나님께서 그들을 부활시키는 어느날 그들은 너희에게 맹세 한 것과 같이 하나님께도 맹세하 여 무엇인가 얻으리라 생각하더라 그러나 그렇지 못하매 그들은 거 짓하는 자들에 불과하니라",
                            "verse 58:19": "사탄은 그들을 유혹하여 그들로 하여금 하나님의 교훈을 망 각케 하더라 고들은 사탄의 무리 들로 사탄의 무리는 멸망하게 되 니라",
                            "verse 58:20": "실로 하나님과 그분의 선지 자에 대적하는 자들이 가장 사악 한 자들이라",
                            "verse 58:21": "하나님께서 기록하셨나니 나와 그분은 선지자들이 승리하니라말씀이 있었노라 실로 하나님은 강하심과 권능으로 충만하심이라",
                            "verse 58:22": "그대는 하나님과 내세를 믿 는 자들이 자신의 아버지이던 아 들이던 또는 형제들이나 천척 들이던 그들이 하나님과 그분의 선지자에게 거역하는 것을 발견치 못하리라 그들을 위해 하나님께 서는 이미 그들의 마음속에 믿음 을 기록하셨고 그분의 영혼으로 보호하셨기 때문이라 그분께서는 그들로 하여금 천국에 들게하니 그 밑에는 물이 흐르며 그들은 그곳에서 영생하노라 이에 하나님은그들로 기뻐하시고 그들은 그분과기뻐하니 실로 그들은 하나님의 사회에 있노라 실로 하나님의 당 안에 있는 그들이야말로 번성할 자들이라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "ئه‌ی محمد (صلی الله علیه وسلم) بێگومان خوا بیستی و وه‌ریگرت وتووێژی ئه‌و ئافره‌ته‌ی که گفتوگۆت له‌گه‌لدا ده‌کات ده‌رباره‌ی هاوسه‌ره‌که‌ی، سکاڵای خۆیشی بۆلای خوا ده‌بات، خوایش گوێی له گفتوگۆکه‌تان بوو، به‌ڕاستی خوا بیسه‌رو بینایه‌.",
                            "verse 58:2": "ئه‌وانه‌تان به‌هاوسه‌رانیان ده‌ڵێن: تۆ له جێگه‌ی ده‌یکمدایت، هاوسه‌ره‌که‌یان به‌و `قسه‌یه نابنه دایکیان، چونکه دایکیان ته‌نها ئه‌وانه‌ن که ئه‌وانیان لێ بووه‌، ئه‌وانه قسه‌یه‌کی نابه‌جێ ده‌که‌ن وبوختانێکی ناپه‌سه‌ند ده‌ڵێن، بێگومان خوا چاوپۆشی ده‌کات و لێخۆش ده‌بێت (ئه‌گه‌ر ئه‌وانه په‌شیمان ببنه‌وه و داوای لێخۆشبوون بکه‌ن).",
                            "verse 58:3": "ئه‌وانه‌ی وا به هاوسه‌ره‌کانیان ده‌ڵێن و دوایی په‌شیمان ده‌بنه‌وه له‌وه‌ی که وتویانه‌، ئه‌وه ده‌بێت کۆیله‌یه‌ک ئازاد بکه‌ن پێش ئه‌وه‌ی ئه‌و ژن و مێرده به‌یه‌ک بگه‌ن، ئه‌و بڕیاره ئێوه‌ی پێ ئامۆژگاری ده‌کرێت، خوایش ئاگاداره به‌و کارو‌کرده‌وانه‌ی ئه‌نجامی ده‌ده‌ن.",
                            "verse 58:4": "ئینجا ئه‌وه‌ی کۆیله‌ی ده‌ست نه‌که‌وت، ئه‌وه ده‌بێت دوو مانگ له‌سه‌ر یه‌ک به‌ڕۆژوو بێت پێش به‌یه‌کگه‌یشتنیان، جا ئه‌وه‌ی ناتوانێت به ڕۆژوو بێت، با شه‌ست هه‌ژار تێر بکات له ژه‌مێک خواردن، ئه‌وه‌ی که باسکرا بۆ ئه‌وه‌یه باوه‌ڕتان پته‌و بێت به‌خواو پێغه‌مبه‌ره‌که‌ی (چونکه خوا چاره‌سه‌ر داده‌نێت بۆ گیروگرفته‌کان)، ئه‌و بڕیارانه‌ش سنووری خوان، بۆ ئه‌وانه‌ش که کافرن (ملکه‌چی فه‌رمانی خوا نابن) سزای به ئێش و ئازار بۆیان ئاماده‌یه‌.",
                            "verse 58:5": "به‌ڕاستی ئه‌وانه‌ی دژایه‌تی و دوژمنایه‌تی خواو پێغه‌مبه‌ره‌که‌ی ده‌که‌ن، سه‌رشۆڕ و خه‌جاڵه‌ت و شکست خورده‌ن، هه‌روه‌ک ئه‌وانه‌ی پێش ئه‌مان که سه‌رشۆر و خه‌جاڵه‌ت کران و تێکشکان، بێگومان ئێمه به‌ڵگه و نیشانه‌ی ڕوون و ئاشکرامان ناردۆته خواره‌وه له‌سه‌ر ئه‌م ڕاستیانه‌، جا بۆ ئه‌وانه‌ی که کافرو بێ باوه‌ڕن سزای ڕیسواکه‌ر ئاماده‌یه‌.",
                            "verse 58:6": "له ڕۆژێکدا که خوا هه‌موویان زیندوو ده‌کاته‌وه پێکه‌وه‌، ئه‌وسا هه‌واڵی هه‌موو کاروکرده‌وه‌کانیان پێ ڕاده‌گه‌یه‌نێت، خوا ئاماری کردووه ئه‌وان فه‌رامۆشیان کردووه‌، خوایش شایه‌ت و ئاگایه به‌سه‌ر هه‌موو شتێکدا.",
                            "verse 58:7": "ئایه سه‌رنجت نه‌داوه که به‌ڕاستی خوا به هه‌رچی له ئاسمانه‌کان و زه‌ریدا هه‌یه زانا و ئاگایه‌، سێ که‌س نیه چپه بکه‌ن به‌یه‌که‌وه خوا جوار‌هه‌میان نه‌بێت، پێنج که‌س نیه ئه‌و زاته شه‌شه‌میان نه‌بێت، له‌و ژمارانه که‌متر یان زیاتریش نیه که ئه‌و لایان نه‌بێت و ئاگادار نه‌بێت به سرته و چپه‌یان، له‌هه‌ر شوێنێک و له‌هه‌ر کوێدا بن، پاشان له ڕۆژی قیامه‌تدا ئاگاداریان ده‌کاته‌وه به هه‌موو ئه‌و کارو کرده‌وانه‌ی که ئه‌نجامیانداوه‌، چونکه به‌ڕاستی خوا به هه‌موو شتێک زانایه‌.",
                            "verse 58:8": "ئایا سه‌رنجت نه‌داوه له‌وانه‌ی قه‌ده‌غه‌ی چپه‌یان لێ کراوه‌، که‌چی له‌وه‌ودوا هه‌ر ده‌گه‌ڕێنه‌وه سه‌ر ئه‌و ڕه‌فتاره‌ی که لێیان قه‌ده‌غه‌کراوه‌، به‌رده‌وام خه‌ریکی چپه‌یه‌کن که هه‌مووی گوناهو دوژمنایه‌تی و نافه‌رمانی پێغه‌مبه‌ره‌، کاتێکیش دێن بۆ لات جۆرێک سڵاوت لێ ده‌که‌ن، که خوا به‌و شێوه‌یه سڵاوی لێ نه‌کردویت!! به‌گاڵته‌وه ده‌ڵێن: ئه‌وه بۆچی خوا سزامان نادات به‌هۆی ئه‌و قسانه‌وه که ده‌یڵێین!! ئه‌وانه دۆزه‌خیان به‌سه که بچنه ناوی و ببرژێنرێن تیایدا، ئای که سه‌رنجامێکی خراپه‌.",
                            "verse 58:9": "ئه‌ی ئه‌و که‌سانه‌ی باوه‌ڕتان هێناوه کاتێک چپه ده‌که‌ن به‌یه‌که‌وه‌، چپه‌یه‌ک مه‌که‌ن که گوناهو دوژمنایه‌تی و نافه‌رمانی پێغه‌مبه‌ر بێت، با چپه‌کانتان هه‌مووی ده‌رباره‌ی چاکه و خواناسی و پارێزکاری بێت، له‌و خوایه بترسن که هه‌ر بۆ لای ئه‌و کۆده‌کرێنه‌وه (بۆ لێپرسینه‌وه‌).",
                            "verse 58:10": "به‌ڕاستی چپه‌ی خراپ و نابه‌جێ هه‌ر له شه‌یتانه‌وه‌یه‌، تا ئه‌وانه غه‌مبار بکات که باوه‌ڕیان هێناوه‌، وه نه‌بێت ئه‌و چپه‌یه هیچ زیانێکیان پێ بگه‌یه‌نێت مه‌گه‌ر ویستی خوای له‌سه‌ر بێت، ده‌با ئیمانداران هه‌ر پشت به خوا ببه‌ستن تا له زیان به دوور بن.",
                            "verse 58:11": "ئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه کاتێک له دانیشتن و کۆبونه‌وه‌کاندا پێتان ده‌وترێت: ڕێ بده‌ن به‌که‌سانی ترو ئه‌ڵقه‌ی دانیشتنه‌که فراوان بکه‌ن، ئه‌وه ئێوه‌ش فراوانی بکه‌ن، ئه‌گه‌ر ئێوه واتان کرد خوا پاداشتی فراوانتان پێ ده‌به‌خشێت، کاتێکیش پێتان ده‌وترێت هه‌ستن و جێگه چۆڵ بکه‌ن، (بۆ پیاوماقووڵ و ڕیش سپی و گه‌وره‌کانتان) جێگه چۆڵ بکه‌ن، جا ئه‌گه‌ر واتان کرد خوای گه‌وره ئه‌وانه‌ی ئیمانیان هێناوه له ئێوه و ئه‌وانه‌شتان زانست و زانیاریان پێدراوه چه‌نده‌ها پله‌و پایه به‌رزیان ده‌کاته‌وه‌، خوایش ئاگایه به‌و کارو کرده‌وانه‌ی که ئه‌نجامی ده‌ده‌ن.",
                            "verse 58:12": "ئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه کاتێک ویستتان چپه‌یه‌ک یان قسه‌یه‌کی نهێنی له‌گه‌ڵ پێغه‌مبه‌ردا (صلی الله علیه وسلم) بکه‌ن، پێش ئه‌و کاره خێرێک بکه‌ن (به‌گوێره‌ی توانا شتێک ببه‌خشن به‌هه‌ژاران)، ئه‌وه چاکتره بۆتان و خاوێنتره‌، خۆ ئه‌گه‌ر نه‌تان بوو، ئه‌وه چاک بزانن که خوا لێ خۆشبوو میهره‌بانه‌.",
                            "verse 58:13": "ئایا ده‌ترسان له هه‌ژاری پێش ئه‌وه‌ی که به نهێنی قسه بکه‌ن، خێرو چاکه‌یه‌ک ئه‌نجام بده‌ن؟! جا کاتێکیش که نه‌تانکرد خوا هه‌ر لێتان خۆش بوو، ده ئیتر ئێوه نوێژه‌کانتان به‌چاکی ئه‌نجام بده‌ن و زه‌کات بده‌ن و فه‌رمانبه‌رداریی خواو پێغه‌مبه‌ره‌که‌ی بکه‌ن، خوایش زۆر ئاگایه به‌و کاروکرده‌وانه‌ی که ئه‌نجامی ده‌ده‌ن.",
                            "verse 58:14": "ئایا سه‌رنجی ئه‌وانه‌ت نه‌داوه پشتگیریان له هۆزێك کرد، که خوا خه‌شمی لێ گرتوون و ڕقی لێیانه، ئه‌و دووڕووانه نه سه‌ر به ئێوه‌ن، نه سه‌ر به‌وانیشن، سوێند له‌سه‌ر درۆ ده‌خۆن له کاتێکدا که خۆشیان ده‌زانن.",
                            "verse 58:15": "خوا سزایه‌کی سه‌خت و به‌تینی بۆ ئاماده کردوون، به‌ڕاستی ئه‌وه‌ی ئه‌وان ده‌یانکرد ڕه‌فتارێکی ناشیرین و کارێکی نابه‌جێ بوو.",
                            "verse 58:16": "ئه‌وانه سوێنده‌کانیان کردووه به‌قه‌ڵغان بۆ خۆیان تا سه‌روماڵیان سه‌لامه‌ت بێت، به‌و هۆیه‌شه‌وه به‌ربه‌ستیان داناوه له‌به‌رده‌م به‌ره‌و پێش چوونی ڕێبازی خوادا، هه‌ر بۆیه‌ش سزاو ئازارێکی سه‌رشۆرکه‌ر بۆیان ئاماده‌یه‌.",
                            "verse 58:17": "نه ماڵ و سامانیان نه ڕۆڵه‌کانیان هه‌رگیز نابنه هۆی ئه‌وه‌ی که له ده‌ست تۆڵه‌ی خوا ڕزگاریان بکات، ئه‌وانه نیشته‌جێی ناو دۆزه‌خن و تیایدا بۆ هه‌میشه به‌زیندوویی ده‌مێننه‌وه.",
                            "verse 58:18": "له‌و ڕۆژه‌دا که خوا هه‌موویان زیندوو ده‌کاته‌وه‌، ده‌ست ده‌که‌نه‌وه به سوێند خواردن هه‌روه‌ك بۆ ئێوه سوێندیان ده‌خوارد، له کاتێکدا واده‌زانن که ڕزگاریان ده‌بێت و شتێکیان ده‌ست ده‌که‌وێت!! (خوای گه‌وره له ناو خه‌ڵکیدا ڕیسوایان ده‌کات و ده‌فه‌رموێت): ئاگاداربن که به‌ڕاستی هه‌ر ئه‌وانن درۆزنن.",
                            "verse 58:19": "ئه‌وانه شه‌یتان زاڵ بووه به‌سه‌ریانداو داگیری کردوون، به‌و هۆیه‌وه یادی خوای له‌بیر بردوون، ئا ئه‌وانه ده‌سته و تاقم و حزبی شه‌یتانن، ئاگاداربن که بێگومان ده‌سته و تاقم و حزبی شه‌یتان خه‌ساره‌تمه‌ند و زه‌ره‌رمه‌ندن.",
                            "verse 58:20": "به‌ڕاستی ئه‌وانه‌ی دژایه‌تی خواو پێغه‌مبه‌ره‌که‌ی ده‌که‌ن ئا ئه‌وانه له نزمترینترینی خه‌ڵکین له دنیاو قیامه‌تدا.",
                            "verse 58:21": "خوا بڕیاریداوه که‌: بێگومان هه‌ر خۆم و پێغه‌مبه‌ره‌کانم سه‌رکه‌وتوو ده‌بین، چونکه به‌ڕاستی هه‌ر خوا خۆی به‌هێزو باڵاده‌سته‌.",
                            "verse 58:22": "که‌سانێکت ده‌ست ناکه‌وێت باوه‌ڕ بهێنن به خواو به ڕۆژی دوایی، له‌کاتێکدا که‌سانێکیان خۆش بوێت که دژایه‌تی خواو پێغه‌مبه‌ره‌که‌یان کردبێت، ئه‌گه‌رچی ئه‌و دوژمنانه باوو باپیریان بن یان نه‌وه‌یان بن یان برایان بن یان عه‌شیره‌تیان بن، ئه‌وانه‌ی که به‌و شێوه‌یه‌‌ن (ئیمان و باوه‌ڕیان له هه‌موو که‌سێک لا به نرخترو پیرۆزتره‌)، خوا ئیمان و باوه‌ڕی له‌دڵیاندا چه‌سپاندووه‌و جێگیری کردووه‌و له به‌هره‌و میهره‌بانی تایبه‌تی خۆی، وه به هێزو گیانێکی تایبه‌تی له‌لایه‌ن خۆیه‌وه (مه‌به‌ست قورئان و ئیمانه‌) پشتگیری کردوون و یارمه‌تی داون، سه‌رنجامیش ده‌یانخاته باخه‌کانی به‌هه‌شته‌وه که چه‌نده‌ها ڕوبار به‌ژێر دره‌خت و کۆشکه‌کانیدا تێ ده‌په‌ڕێت، هاوڕێ له‌گه‌ڵ ژیانی به‌بڕاوه‌دا، ئه‌وانه خوا لێیان ڕازیه و ئه‌وانیش له خوا ڕازین، ئا ئه‌وانه ده‌سته‌و تاقم و حزب و لایه‌نی خوای گه‌وره‌ن، ئاگاداربن که به‌ڕاستی هه‌ر لایه‌ن و حزب و ده‌سته و تاقمی خوا سه‌رکه‌وتوو و سه‌رفرازن."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Sesungguhnya Allah telah mendengar (dan memperkenan) aduan perempuan yang bersoal jawab denganmu (wahai Muhammad) mengenai suaminya, sambil dia berdoa merayu kepada Allah (mengenai perkara yang menyusahkannya), sedang Allah sedia mendengar perbincangan kamu berdua.",
                            "verse 58:2": "Orang-orang yang \"ziharkan\" isterinya dari kalangan kamu (adalah orang-orang yang bersalah, kerana) isteri-isteri mereka bukanlah ibu-ibu mereka.",
                            "verse 58:3": "Dan orang-orang yang \"ziharkan\" isterinya, kemudian mereka berbalik dari apa yang mereka ucapkan (bahawa isterinya itu haram kepadanya), maka hendaklah (suami itu) memerdekakan seorang hamba sebelum mereka berdua (suami isteri) bercampur.",
                            "verse 58:4": "Kemudian, sesiapa yang tidak dapat (memerdekakan hamba), maka hendaklah dia berpuasa dua bulan berturut-turut sebelum mereka (suami isteri) itu bercampur.",
                            "verse 58:5": "Sesungguhnya orang-orang yang menentang (perintah) Allah dan RasulNya, mereka tetap ditimpa kehinaan sebagaimana orang-orang yang terdahulu dari mereka ditimpa kehinaan; kerana sesungguhnya Kami telah menurunkan keterangan-keterangan yang jelas nyata dan bagi orang-orang yang kafir disediakan azab seksa yang menghina,",
                            "verse 58:6": "Semasa mereka semuanya dibangkitkan hidup semula oleh Allah (pada hari kiamat), lalu diterangkan kepada mereka segala yang mereka telah kerjakan.",
                            "verse 58:7": "Tidakkah engkau memikirkan, bahawa sesungguhnya Allah mengetahui segala yang ada di langit dan yang ada di bumi? Tiada berlaku bisikan antara tiga orang melainkan Dialah yang keempatnya dan tiada (berlaku antara) lima orang melainkan Dialah yang keenamnya dan tiada yang kurang dari bilangan itu dan tiada yang lebih ramai, melainkan Dia ada bersama-sama mereka di mana sahaja mereka berada.",
                            "verse 58:8": "Tidakkah engkau memerhatikan (wahai Muhammad) akan orang-orang (Yahudi) yang telah dilarang daripada perbuatan berbisik-bisik, kemudian mereka berbalik melakukan perbuatan yang telah dilarang itu serta mereka berbisik-bisik berkenaan dengan melakukan dosa dan pencerobohan serta kederhakaan kepada Rasulullah? Dan lagi apabila mereka datang kepadamu, mereka memberi salam hormat bukan dengan lafaz salam hormat yang diberikan Allah kepadamu dan mereka berkata sesama sendiri: (Kalau benar Muhammad utusan Tuhan, maka) sepatutnya kami diseksa oleh Allah disebabkan (kata-kata buruk) yang kami ucapkan itu? Cukuplah untuk mereka Neraka Jahannam, yang mereka akan dibakar di dalamnya; maka itulah seburuk-buruk tempat kembali.",
                            "verse 58:9": "Wahai orang-orang yang beriman! Apabila kamu berbisik-bisik sesama sendiri, maka janganlah kamu berbisik-bisik untuk melakukan dosa dan pencerobohan serta perbuatan derhaka kepada Rasulullah dan (sebaliknya) berbisiklah untuk berbuat kebajikan dan bertakwa dan hendaklah kamu tetap bertakwa kepada Allah yang kepadaNya kamu semua akan dihimpunkan (pada hari kiamat untuk dihitung amal kamu dan menerima balasan).",
                            "verse 58:10": "Sesungguhnya perbuatan berbisik (dengan kejahatan) itu adalah dari (hasutan) Syaitan, untuk menjadikan orang-orang yang beriman berdukacita; sedang bisikan itu tidak akan dapat membahayakan mereka sedikitpun melainkan dengan izin Allah; dan kepada Allah jualah hendaknya orang-orang yang beriman berserah diri.",
                            "verse 58:11": "Wahai orang-orang yang beriman! Apabila diminta kepada kamu memberi lapang dari tempat duduk kamu (untuk orang lain) maka lapangkanlah seboleh-bolehnya supaya Allah melapangkan (segala halnya) untuk kamu dan apabila diminta kamu bangun maka bangunlah, supaya Allah meninggikan darjat orang-orang yang beriman di antara kamu dan orang-orang yang diberi ilmu pengetahuan agama (dari kalangan kamu) beberapa darjat dan (ingatlah), Allah Maha Mendalam PengetahuanNya tentang apa yang kamu lakukan.",
                            "verse 58:12": "Wahai orang-orang yang beriman! Apabila kamu hendak mengadap dan bertanyakan sesuatu kepada Rasulullah, maka hendaklah kamu bersedekah (kepada fakir miskin) sebelum kamu mengadapnya; (pemberian sedekah) itu adalah lebih baik bagi kamu dan lebih bersih.",
                            "verse 58:13": "Adakah kamu takut (akan kemiskinan) kerana kerap kali kamu memberi sedekah sebelum kamu mengadap? Kalau kamu tidak melakukan (perintah) itu dan Allah pun memaafkan kamu (kerana kamu tidak mampu), maka dirikanlah sembahyang dan berikanlah zakat (sebagaimana yang sewajibnya), serta taatlah kamu kepada Allah dan RasulNya.",
                            "verse 58:14": "Tidakkah engkau melihat (bagaimana jahatnya) orang-orang yang bersahabat karib dengan kaum yang telah dimurkai Allah (dengan sebab kekufuran dan khianatnya)? Mereka itu bukanlah dari golongan kamu dan bukan pula dari golongan kaum yang tersebut itu (kerana mereka ialah golongan munafik) dan lagi mereka selalu bersumpah dengan dusta, sedang mereka mengetahui (bahawa mereka adalah berdusta).",
                            "verse 58:15": "Allah telah menyediakan bagi mereka azab seksa yang berat; sesungguhnya amatlah buruk apa yang mereka telah lakukan.",
                            "verse 58:16": "Mereka menjadikan sumpahnya sebagai perisai (untuk menyelamatkan diri dan harta bendanya daripada dirampas atau dibunuh), maka dengan yang demikian dapatlah mereka menghalang (dirinya dan orang lain) dari jalan Allah; oleh itu mereka beroleh azab seksa yang menghina.",
                            "verse 58:17": "harta benda mereka dan anak pinak mereka tidak sekali-kali akan dapat memberikan sebarang pertolongan kepada mereka dari azab Allah.",
                            "verse 58:18": "(Setelah nyata kepada orang-orang munafik itu bahawa harta benda dan anak pinaknya tidak dapat memberikan pertolongan), ketika mereka semuanya dibangkitkan oleh Allah (pada hari kiamat), maka mereka bersumpah kepadaNya (bahawa mereka adalah orang-orang mukmin) sebagaimana biasanya mereka bersumpah kepada kamu dan mereka menyangka bahawa (dengan berbuat demikian) mereka akan mendapat sesuatu (yang berfaedah kepada mereka).",
                            "verse 58:19": "Syaitan telah menguasai dan mempengaruhi mereka, sehingga menyebabkan mereka lupa mengingati (ajaran dan amaran) Allah; mereka itulah puak Syaitan.",
                            "verse 58:20": "Sesungguhnya orang-orang yang menentang (perintah) Allah dan RasulNya, mereka termasuk dalam golongan yang amat hina.",
                            "verse 58:21": "Allah telah menetapkan: Sesungguhnya Aku dan Rasul-rasulKu tetap mengalahkan (golongan yang menentang).",
                            "verse 58:22": "Engkau tidak akan dapati sesuatu kaum yang beriman kepada Allah dan hari akhirat, tergamak berkasih-mesra dengan orang-orang yang menentang (perintah) Allah dan RasulNya, sekalipun orang-orang yang menentang itu ialah bapa-bapa mereka, atau anak-anak mereka atau saudara-saudara mereka ataupun keluarga mereka."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "خداوند سخن زنى را كه درباره شوهرش به تو مراجعه كرده بود و به خداوند شكايت مى‏كرد شنيد (و تقاضاى او را اجابت كرد); خداوند گفتگوى شما را با هم (و اصرار آن زن را درباره حل مشكلش) مى‏شنيد; و خداوند شنوا و بيناست",
                            "verse 58:2": "كسانى كه از شما نسبت به همسرانشان «ظهار» مى‏كنند (و مى‏گويند: «انت على كظهر امى تو نسبت به من بمنزله مادرم هستى‏»)، آنان هرگز مادرانشان نيستند; مادرانشان تنها كسانى‏اند كه آنها را به دنيا آورده‏اند! آنها سخنى زشت و باطل مى‏گويند; و خداوند بخشنده و آمرزنده است!",
                            "verse 58:3": "كسانى كه همسران خود را «ظهار» مى‏كنند، سپس از گفته خود بازمى‏گردند، بايد پيش از آميزش جنسى با هم، برده‏اى را آزاد كنند; اين دستورى است كه به آن اندرز داده مى‏شويد; و خداوند به آنچه انجام مى‏دهيد آگاه است!",
                            "verse 58:4": "و كسى كه توانايى (آزاد كردن برده‏اى) نداشته باشد، دو ماه پياپى قبل از آميزش روزه بگيرد; و كسى كه اين را هم نتواند، شصت مسكين را اطعام كند; اين براى آن است كه به خدا و رسولش ايمان بياوريد; اينها مرزهاى الهى است; و كسانى كه با آن مخالفت كنند، عذاب دردناكى دارند!",
                            "verse 58:5": "« كسانى كه با خدا و رسولش دشمنى مى‏كنند خوار و ذليل شدند آن‏گونه كه پيشينيان خوار و ذليل شدند; ما آيات روشنى نازل كرديم، و براى كافران عذاب خواركننده‏اى است",
                            "verse 58:6": "در آن روز كه خداوند همه آنها را برمى‏انگيزد و از اعمالى كه انجام دادند با خبر مى‏سازد، اعمالى كه خداوند حساب آن را نگه داشته و آنها فراموشش كردند; و خداوند بر هر چيز شاهد و ناظر است!",
                            "verse 58:7": "آيا نمى‏دانى كه خداوند آنچه را در آسمانها و آنچه را در زمين است مى‏داند; هيچ گاه سه نفر با هم نجوا نمى‏كنند مگر اينكه خداوند چهارمين آنهاست، و هيچ گاه پنج نفر با هم نجوا نمى‏كنند مگر اينكه خداوند ششمين آنهاست، و نه تعدادى كمتر و نه بيشتر از آن مگر اينكه او همراه آنهاست هر جا كه باشند، سپس روز قيامت آنها را از اعمالشان آگاه مى‏سازد، چرا كه خداوند به هر چيزى داناست!",
                            "verse 58:8": "آيا نديدى كسانى را كه از نجوا ( سخنان درگوشى) نهى شدند، سپس به كارى كه از آن نهى شده بودند بازمى‏گردند و براى انجام گناه و تعدى و نافرمانى رسول خدا به نجوا مى‏پردازند و هنگامى كه نزد تو مى‏آيند تو را تحيتى (و خوشامدى) مى‏گويند كه خدا به تو نگفته است، و در دل مى‏گويند: «چرا خ است، وارد آن مى‏شوند، و چه بد فرجامى است!",
                            "verse 58:9": "اى كسانى كه ايمان آورده‏ايد! هنگامى كه نجوا مى‏كنيد، و به گناه و تعدى و نافرمانى رسول (خدا) نجوا نكنيد، و به كار نيك و تقوا نجوا كنيد، و از خدايى كه همگى نزد او جمع مى‏شويد بپرهيزيد!",
                            "verse 58:10": "نجوا تنها از سوى شيطان است; مى‏خواهد با آن مؤمنان غمگين شوند; ولى نمى تواند هيچ گونه ضررى به آنها برساند جز بفرمان خدا; پس مؤمنان تنها بر خدا توكل كنند!",
                            "verse 58:11": "اى كسانى كه ايمان آورده‏ايد! هنگامى كه به شما گفته شود: «مجلس را وسعت بخشيد (و به تازه‏واردها جا دهيد)»، وسعت بخشيد، خداوند (بهشت را) براى شما وسعت مى‏بخشد; و هنگامى كه گفته شود: «برخيزيد»، برخيزيد; اگر چنين كنيد، خداوند كسانى را كه ايمان آورده‏اند و كسانى را كه علم به آنان داده شده درجات عظيمى مى‏بخشد; و خداوند به آنچه انجام مى‏دهيد آگاه است!",
                            "verse 58:12": "اى كسانى كه ايمان آورده‏ايد! هنگامى كه مى‏خواهيد با رسول خدا نجوا كنيد (و سخنان درگوشى بگوييد)، قبل از آن صدقه‏اى (در راه خدا) بدهيد; اين براى شما بهتر و پاكيزه‏تر است و اگر توانايى نداشته باشيد، خداوند غفور و رحيم است!",
                            "verse 58:13": "آيا ترسيديد فقير شويد كه از دادن صدقات قبل از نجوا خوددارى كرديد؟! اكنون كه اين كار را نكرديد و خداوند توبه شما را پذيرفت، نماز را برپا داريد و زكات را ادا كنيد و خدا و پيامبرش را اطاعت نماييد و (بدانيد) خداوند از آنچه انجام مى‏دهيد با خبر است!",
                            "verse 58:14": "آيا نديدى كسانى را كه طرح دوستى با گروهى كه مورد غضب خدا بودند ريختند؟! آنها نه از شما هستند و نه از آنان! سوگند دروغ ياد مى‏كنند (كه از شما هستند) در حالى كه خودشان مى‏دانند (دروغ نمى‏گويند)!",
                            "verse 58:15": "خداوند عذاب شديدى براى آنان فراهم ساخته، چرا كه اعمال بدى انجام مى‏دادند!",
                            "verse 58:16": "آنها سوگندهاى خود را سپرى قرار دادند و مردم را از راه خدا بازداشتند; از اين‏رو براى آنان عذاب خواركننده‏اى است!",
                            "verse 58:17": "هرگز اموال و اولادشان آنها را از عذاب الهى حفظ نمى‏كند; آنها اهل آتشند و جاودانه در آن مى‏مانند!",
                            "verse 58:18": "(به خاطر بياوريد) روزى را كه خداوند همه آنها را برمى‏انگيزد، آنها براى خدا نيز سوگند (دروغ) ياد مى‏كنند همان‏گونه كه (امروز) براى شما ياد مى‏كنند; و گمان مى‏كنند كارى مى‏توانند انجام دهند; بدانيد آنها دروغگويانند!",
                            "verse 58:19": "شيطان بر آنان مسلط شده و ياد خدا را از خاطر آنها برده; آنان حزب شيطانند! بدانيد حزب شيطان زيانكارانند!",
                            "verse 58:20": "كسانى كه با خدا و رسولش دشمنى مى‏كنند، آنها در زمره ذليل‏ترين افرادند!",
                            "verse 58:21": "خداوند چنين مقرر داشته كه من و رسولانم پيروز مى‏شويم; چرا كه خداوند قوى و شكست‏ناپذير است!",
                            "verse 58:22": "هيچ قومى را كه ايمان به خدا و روز رستاخيز دارند نمى‏يابى كه با دشمنان خدا و رسولش دوستى كنند، هر چند پدران يا فرزندان يا برادران يا خويشاوندانشان باشند; آنان كسانى هستند كه خدا ايمان را بر صفحه دلهايشان نوشته و با روحى از ناحيه خودش آنها را تقويت فرموده، و آنها را در باغهايى از بهشت وارد مى‏كند كه نهرها از زير (درختانش) جارى است، جاودانه در آن مى‏مانند; خدا از آنها خشنود است، و آنان نيز از خدا خشنودند; آنها «حزب الله س‏ذللّهاند; بدانيد «حزب الله‏» پيروزان و رستگارانند"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Em verdade, Deus escutou a declaração daquela que discutia contigo, acerca do marido, e se queixava (em oração) a Deus.",
                            "verse 58:2": "Aqueles, dentre vós, que repudiam as suas mulheres através do zihar, saibam que elas não são suas mães.",
                            "verse 58:3": "Quanto àqueles que repudiarem as suas mulheres pelo zihar e logo se retratarem disso, deverão manumitir um escravo, antes de as tocarem.",
                            "verse 58:4": "Mas, quem não o encontrar (escravo), deverá jejuará dois meses consecutivos antes de a tocar.",
                            "verse 58:5": "Sabei que aqueles que contrariam Deus e Seu Mensageiro serão exterminados, como o foram os seus antepassados; por isso Nós lhes enviamos lúcidos versículos e, aqueles que os negarem, sofrerão um afrontoso castigo.",
                            "verse 58:6": "Será o dia em que Deus os ressuscitará a todos e os inteirará de tudo quanto tiverem feito.",
                            "verse 58:7": "Não reparas em que Deus conhece tudo quanto existe nos céus e na terra? Não há confidência entre três pessoas, sem que Ele seja a Quarta delas; nem entre cinco, sem que Ele seja a sexta; nem que haja menos ou mais do que isso, sem que Ele esteja com elas, onde quer que se achem.",
                            "verse 58:8": "Acaso, não reparaste naqueles a quem foi proibida a confidência? Não obstante, reincidem no que lhes foi vedado e falam clandestinamente de iniqüidades, de hostilidades e de desobediências ao Mensageiro! E quando se apresentam a ti, saúdam-te, em termos com os quais Deus jamais te saudaram, e dizem para si: Por que Deus não nos castiga pelo que fazemos? Bastar-lhes-á o inferno, no qual entrarão! E que funesto destino!",
                            "verse 58:9": "Ó fiéis, quando falardes na intimidade, não discorrais sobre iniqüidades, sobre hostilidades, nem sobre a desobediência ao Mensageiro; antes, falai da virtude e da piedade, e temei a Deus, ante Quem sereis congregados.",
                            "verse 58:10": "Sabei que a confabulação emana de Satã, para atribular os fiéis.",
                            "verse 58:11": "Ó fiéis, quando vos for dito para que vos aperteis, (dando) nas assembléias (lugar aos demais), fazei-o; e sabei que Deus vos dará lugar no Paraíso! E quando vos for dito que vos levanteis, fazei-o, pois Deus dignificará os fiéis, dentre vós, assim como os sábios, porque está inteirado de tudo quanto fazeis.",
                            "verse 58:12": "Ó fiéis, quando fordes consultar privativamente o Mensageiro, fazei antes uma caridade; isso será melhor para vós; e será mais puro; porém, se carecerdes de meios, sabei que Deus é Indulgente, Misericordiosíssimo.",
                            "verse 58:13": "Temeis, acaso, fazer caridade, antes da vossa consulta privativa (a ele)? Mas, se não o fizerdes - e que Deus vos perdoe -, observai, a oração, pagai o zakat e obedecei a Deus e ao Seu Mensageiro, porque Deus está inteirado de tudo quanto fazeis.",
                            "verse 58:14": "Acaso, não reparaste naqueles que entraram (em privacidade) com um povo, o qual Deus abominou? Não são dos vossos, nem tampouco sois dos deles, e perjuram conscientemente!",
                            "verse 58:15": "Deus lhes tem preparado um severo castigo.",
                            "verse 58:16": "Fizeram dos seus juramentos uma coberta (para as suas más ações), e desencaminharam-se da senda de Deus; porém, sofrerão um castigo afrontoso.",
                            "verse 58:17": "Perante Deus, de nada lhes valerão os seus bens, nem os seus filhos e serão os condenados ao inferno, no qual permanecerão eternamente.",
                            "verse 58:18": "No dia em que Deus os ressuscitar a todos, jurar-Lhe-ão, então, como juraram a vós, e crerão que possuem algo.",
                            "verse 58:19": "Satanás os conquistou e os fez esquecer da recordação de Deus.",
                            "verse 58:20": "Sabei que aqueles que contrariam Deus e o Seu Mensageiro contar-se-ão entre os mais humilhados.",
                            "verse 58:21": "Deus decretou: Venceremos, Eu e os Meus mensageiros! Em verdade, Deus é Poderoso, Fortíssimo.",
                            "verse 58:22": "Não encontrarás povo algum que creia em Deus e no Dia do Juízo final, que tenha relações com aqueles que contrariam Deus e o Seu Mensageiro, ainda que sejam seus pais ou seus filhos, seus irmãos ou parentes."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 58:1": "Allah a auzit vorbele aceleia care discutã cu tine în privințabãrbatului ei și se plânge lui Allah.",
                            "verse 58:2": "Vede Totul",
                            "verse 58:3": "Aceia dintre voi care se despart de muierile lor zicând cã ele suntpentru ei ca și spatele mamelor lor [sã știe cã], ele nu sunt mamelelor! Mamele lor nu sunt decât acelea care i-au adus pe lume.",
                            "verse 58:4": "Aceia care se despart de muierile lor cu aceste vorbe, iar apoi vor sã revinã asupra celor pe care le-au spus,",
                            "verse 58:5": "sã slobozeascã unrob înainte de a se mai atinge unul de altul.",
                            "verse 58:6": "Acela care nu aflã [un rob] trebuie sã posteascã douã luni, una dupã alta, înainte de a se atinge.",
                            "verse 58:7": "Aceia care se împotrivesc lui Allah și Trimisului Sãu vor fi doborâți așa cum au fost doborâți și cei de dinainte de ei .",
                            "verse 58:8": "În Ziua când Allah îi va readuce pe ei toți la viațã și le va vesti lor ceea ce au fãcut.",
                            "verse 58:9": "Oare tu nu vezi cã Allah știe tot ceea ce se aflã în ceruri și ceea ce se aflã pre pãmânt? Nu existã discuție în tainã între trei fãrã ca El sãfie al patrulea, nici între",
                            "verse 58:10": "Oare tu nu-i vezi pe aceia cãrora le-a fost oprit sã vorbeascã în tainã cum se întorc la ceea ce le-a fost oprit și se sfãtuiesc în șoaptã, cu pãcat, dușmãnie și nes",
                            "verse 58:11": "O, voi cei care credeți! Dacã vorbiți în tainã, nu vã sfãtuiți cupãcat, dușmãnie și nesupunere fațã de Trimis, ci sfãtuiți-vã cu",
                            "verse 58:12": "Vorba în tainã este de la Șeitan , pentru ca cei care au crezut sã se întristeze, însã el nu le poate pricinui nici o pagubã fãrã de voia lui Allah.",
                            "verse 58:13": "O, voi cei care credeți! Când vi se spune vouã: \"Faceți loc înadunãri!\", atunci faceți voi loc și vã va face și Allah vouã loc !",
                            "verse 58:14": "Iar când se spune \"Ridicați",
                            "verse 58:15": "O, voi cei care credeți! Dacã voiți sã stați de vorbã în tainã cu Trimisul, înainte de vorba voastrã faceți o milostenie, cãci aceasta este mai bine pentru voi și mai curat! Dar dac&",
                            "verse 58:16": "Oare vã temeți sã dați milostenie înainte de vorba voastrã? Fiindcã nu ați dat și pentru cã Allah v-a iertat, împliniți voi Rugãciunea,",
                            "verse 58:17": "plãtiți Dania",
                            "verse 58:18": "Oare nu i-ai vãzut pe aceia care și-au luat ca ajutor un neampe care Allah este mâniat? Ei nu sunt nici dintre voi, nici dintre ai lor și ei jurã cu minciunã și ei știu",
                            "verse 58:19": ".",
                            "verse 58:20": "Allah le-a pregãtit lor chin aspru.",
                            "verse 58:21": "Și-au luat jurãmintele lor drept pavãzã și astfel ei au împiedicat de la calea lui Allah, dar vor avea ei parte de osândã umilitoare.",
                            "verse 58:22": "Nu le vor fi de nici un folos averile lor și copiii lor împotriva",
                            "verse 58:23": "lui Allah .",
                            "verse 58:24": "Într-o Zi, când Allah îi va învia pe toți, vor jura ei fațã de El , așa cum au jurat fațã de voi și vor socoti cã ei se sprijinã pe ceva, însãei sunt mincinoși!",
                            "verse 58:25": "Șeitan a pus stãpânire peste ei și i-a fãcut pe ei sã uite pomenirea lui Allah.",
                            "verse 58:26": "Aceia care se împotrivesc lui Allah și Trimisului Sãu, aceia sunt dintre cei mai umiliți.",
                            "verse 58:27": "Allah a scris : \"Eu voi birui negreșit; Eu și trimișii Mei!\" Allah este cu adevãrat Tare",
                            "verse 58:28": "Puternic [Qawiyy, 'Aziz].",
                            "verse 58:29": "Nu vei afla nici un neam [de oameni] care cred în Allah și în Ziua de Apoi și care sã-i ia ca prieteni pe cei ce se împotrivesc lui Allah și Trimisului Sãu, chiar dacã ar fi pãrinții lor, fiii lor, fra&tho 'Aziz]."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 58:1": "Dumnezeu a auzit vorbele celei care se certa cu tine despre soţul ei şi se plângea lui Dumnezeu.",
                            "verse 58:2": "Aceia dintre voi care îşi compară femeile cu spatele mamelor, să ştie că ele nu le sunt mame, căci mame le sunt doar acelea care i-au născut.",
                            "verse 58:3": "Cei care îşi compară femeile cu spatele mamelor lor şi repetă ceea ce au spus, va trebui să sloboade un rob înainte de a se atinge din nou de ele.",
                            "verse 58:4": "Cel care nu află aşa ceva, atunci să postească două luni necurmat înainte de a se atinge unul de celălalt.",
                            "verse 58:5": "Cei care se împotrivesc lui Dumnezeu şi trimisului Său vor fi răsturnaţi precum au fost şi cei dinaintea lor.",
                            "verse 58:6": "în Ziua când Dumnezeu îi va scula şi le va da ştire de ceea ce-au săvârşit.",
                            "verse 58:7": "Nu vezi oare că Dumnezeu ştie ceea ce este în ceruri, precum şi pe pământ? Nu stau de vorbă trei, unde El să nu fie al patrulea, ori cinci şi El să nu fie al şaselea.",
                            "verse 58:8": "Nu i-ai văzut pe cei cărora li s-a oprit sfatul în taină.",
                            "verse 58:9": "O, voi cei ce credeţi! Atunci când luaţi parte la sfaturi în taină, feriţi-vă de păcat, de vrăjmăşie, de neascultarea Trimisului.",
                            "verse 58:10": "Sfaturile în taină vin de la Satan pentru a-i mâhni pe credincioşi.",
                            "verse 58:11": "O, voi cei ce credeţi, când vi se spune: “Faceţi loc şi altora la sfaturile voastre!” Atunci, faceţi loc, căci şi Dumnezeu vă va face loc.",
                            "verse 58:12": "O, voi cei ce credeţi! Când aveţi un sfat de taină cu trimisul, daţi milostenie înainte! Aşa este mai bine pentru voi şi mai curat.",
                            "verse 58:13": "Vă temeţi ca înainte de vorba voastră să daţi milostenie? Când nu o faceţi, iar Dumnezeu se întoarce către voi, atunci faceţi rugăciunea, daţi milostenie, daţi-i ascultare lui Dumnezeu şi trimisului Său.",
                            "verse 58:14": "Nu i-ai văzut pe cei care stau în spatele unor oameni asupra cărora Dumnezeu s-a mâniat şi care nu sunt nici de-ai voştri şi nici de-ai lor? Ei jură strâmb, chiar dacă ştiu!",
                            "verse 58:15": "Dumnezeu le-a pregătit o osândă aprigă, căci rău este ceea ce fac.",
                            "verse 58:16": "Ei îşi iau jurămintele ca pavăză şi-i împiedică pe oameni de la calea lui Dumnezeu.",
                            "verse 58:17": "Nici averile şi nici copiii nu le vor fi de vreun folos în faţa lui Dumnezeu.",
                            "verse 58:18": "În Ziua când Dumnezeu îi va scula pe toţi, ei I se vor jura precum vi se jură şi vouă socotind că se sprijină pe ceva.",
                            "verse 58:19": "Satan a pus stăpânire pe ei şi i-a făcut să uite amintirea lui Dumnezeu.",
                            "verse 58:20": "Cei care se împotrivesc lui Dumnezeu şi trimisului Său vor fi cei mai umiliţi.",
                            "verse 58:21": "Dumnezeu a scris: “Eu şi trimişii Mei vom birui întotdeauna.",
                            "verse 58:22": "Nu vei afla oameni ce cred în Dumnezeu şi în Ziua de Apoi care să le arate prietenie celor care se împotrivesc lui Dumnezeu şi trimisului Său, chiar de sunt taţii lor, fiii lor, fraţii lor ori obştea lor."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Аллах услышал обращенье той,Которая к тебе, (о Мухаммад!), взывалао своем супругеИ жалобу свою несла Аллаху.",
                            "verse 58:2": "А те из вас,Кто отвергает жен своих зихар(ом)2220,(Назвав их матери своей хребтом),Позорные и ложные слова глаголют.",
                            "verse 58:3": "И те, кто отвергает жен своихзихар(ом),Потом же — взять свои слова назадхотят2221,Не могут прикоснуться вновьк (покинутой) супруге,Пока рабу свободу не дадут, —Таков для вас наказ (Аллаха), —Ведь ведает Он все, что делаете вы.",
                            "verse 58:4": "А коль у них такой возможностине будет,То прежде, чем к супругеприкоснуться,Поститься им два месяца подряд,А кто и этого не сможет сделать,То накормить им шесть десятковнищих надлежит;И это для того,Чтобы в Аллаха и посланника Егоони уверовали (всей душой), —Ведь таковы Его пределы,А для неверных — тягостная кара.",
                            "verse 58:5": "Те ж, кто противится Аллахуи посланнику Его,Будут погублены, как те, кто былдо них, —Ведь Мы уже (им) Ясные Знаменияпослали, —И ждет неверных унизительная кара",
                            "verse 58:6": "В тот День,Когда Господь их воскреситИ сообщит им все, что делали они, —Аллах наперечет все знает,Хотя они об этом и забыли.",
                            "verse 58:7": "Ужель не видишь ты, что ведает АллахВсе то, что в небесах и на землепребудет?И меж тремя не может бытьсекретных разговоров,Чтобы четвертым не был Он;Или пятью, чтоб не был Он шестым;Иль меньше или больше (этогочисла), —Где б ни были они — средь нихвсегда Он.",
                            "verse 58:8": "Неужто ты не видел тех,Кому запрещены секретные беседы?Однако ж возвращаются ониК тому, что им запрещено,И говорят друг другу то,Что возбуждает грех, вражду,непослушание посланнику Его.",
                            "verse 58:9": "О вы, кто верует!Ведя секретную беседу,Не говорите о таком,Что возбуждает грех, вражду,непослушание посланнику Его.",
                            "verse 58:10": "Беседы тайные идут от Сатаны,Чтобы внести разлад средь верных.",
                            "verse 58:11": "О вы, кто верует!Когда в собраниях вам говорят:«Продвиньтесь, чтобы дать простор»,То дайте вы простор.",
                            "verse 58:12": "О вы, кто верует!Наедине беседуя с посланником(Аллаха),Вы до беседы этой милостынюсотворить должны, —Для вас так будет благовиднееи лучше.",
                            "verse 58:13": "А может быть, вы до беседы с нимДать милостыню побоялись?Коль этого не совершили вы,Аллах же благосклонно вас простил,То по часам молитесь выИ правьте очистительную подать;Аллаху и посланнику Его послушныбудьте, —Он знает все, что делаете вы.",
                            "verse 58:14": "Неужто ты, (о Мухаммад!), не виделтех,Которые сдружилися с народом2222,Навлекшим на себя Господень гнев?Они ни к вам, ни к нимне примыкаютИ клятвы ложные дают,Заведомо об этом зная.",
                            "verse 58:15": "Аллах им уготовил самую суровуюрасплату, —Поистине, деяния их злостны.",
                            "verse 58:16": "Их клятвы ложные, как щит,Прикрыли (все их злодеянья),Сводя людей с пути Аллаха, —За то им будет унизительная кара.",
                            "verse 58:17": "Ни их имущество, ни детиНе облегчат (их участи) передАллахом, —Им всем быть обитателями АдаИ находиться там навечно!",
                            "verse 58:18": "В тот День,Когда Аллах их воскресит (на Суд),Они пред Ним будут давать всё те жеклятвы,Которые дают (сейчас) пред вами,Считая, что имеют то, что им поможет.",
                            "verse 58:19": "Их дьявол одолел,Заставив их забыть о Боге.",
                            "verse 58:20": "Те, кто противится Аллахуи посланнику Его,Окажутся среди презренных.",
                            "verse 58:21": "Аллах постановил:«Поистине, лишь Я и те, кто посланМною,(Царить) победно будут (вечно)!»Аллах, поистине, всесилен и могуч!",
                            "verse 58:22": "Ты не найдешь средь тех,Кто (стойко) верует в Аллаха и ДеньПоследнего (Суда),Привязанности к тем,Которые противятся Аллахуи посланнику Его,Будь то отцы их, сыновья, иль братья,Или другие этого же рода."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Alá ha oído lo que decía la que discutía contigo a propósito de su esposo y que se quejaba a Alá.",
                            "verse 58:2": "Aquéllos de vosotros que repudian a sus mujeres mediante la fórmula: «¡Eres para mí como la espalda de mi madre!».",
                            "verse 58:3": "Quienes repudian a sus mujeres mediante la fórmula: «¡Eres para mí como la espalda de mi madre!» y la repiten, deben, antes de cohabitar de nuevo, manumitir a un esclavo.",
                            "verse 58:4": "Quien no pueda hacerlo, deberá ayunar durante dos meses consecutivos antes de cohabitar de nuevo.",
                            "verse 58:5": "Quienes se oponen a Alá y a su Enviado serán derribados como lo fueron quienes les precedieron.",
                            "verse 58:6": "El día que Alá les resucite a todos, ya les informará de lo que hicieron.",
                            "verse 58:7": "¿No ves que Alá conoce lo que está en los cielos y en la tierra? No hay conciliábulo de tres personas en que no sea Él el cuarto, ni de cinco personas en que no sea Él el sexto.",
                            "verse 58:8": "¿No ves a aquéllos a quienes se ha prohibido celebrar conciliábulos, que se obstinan en lo prohibido y los celebran, haciéndose culpables de pecado, de violación de la ley y de desobediencia al Enviado? Cuando vienen a ti, te saludan de manera distinta a como Alá te saluda y dicen para sí: «¿Cómo es que Alá no nos castiga por lo que decimos?» Les bastará con la gehena, en la que arderán.",
                            "verse 58:9": "¡Creyentes! Cuando celebréis un conciliábulo, no lo hagáis con ánimo de pecar, de violar la ley y de desobedecer al Enviado, sino con el ánimo de ser buenos y temerosos de Alá.",
                            "verse 58:10": "El conciliábulo es sólo cosa del Demonio, para entristecer a los que creen, pero que no puede hacerles ningún daño, a menos que Alá lo permita.",
                            "verse 58:11": "¡Creyentes! Cuando se os dice: «¡Haced sitio en las asambleas!» hacedlo así para que Alá os haga también sitio.",
                            "verse 58:12": "¡Creyentes! Cuando queráis tener una conversación a solas con el Enviado, hacedla preceder de una limosna.",
                            "verse 58:13": "¿Os arredra hacer preceder vuestra conversación a solas de limosnas? Si no lo hacéis y Alá se aplaca con vosotros, ¡haced la azalá, dad el azaque y obedeced a Alá y a su Enviado! Alá está bien informado de lo que hacéis.",
                            "verse 58:14": "¿No has visto a quienes han tomado como protectores a gente que ha incurrido en la ira de Alá? No son ni de los vuestros ni de los suyos y juran en falso deliberadamente.",
                            "verse 58:15": "Alá ha preparado para ellos un castigo severo.",
                            "verse 58:16": "Se han escudado en sus juramentos y han desviado a otros del camino de Alá.",
                            "verse 58:17": "Ni su hacienda ni sus hijos le servirán de nada frente a Alá.",
                            "verse 58:18": "El día que Alá les resucite a todos, Le jurarán a Él como os juran a vosotros, creyendo apoyarse en algo sólido.",
                            "verse 58:19": "El Demonio se ha apoderado de ellos y les ha hecho olvidarse del recuerdo de Alá.",
                            "verse 58:20": "Los que se oponen a Alá y a Su Enviado estarán entre los más viles.",
                            "verse 58:21": "Alá ha escrito: «¡Venceré, en verdad! ¡Yo y Mis enviados!» Alá es fuerte, poderoso.",
                            "verse 58:22": "No encontrarás a gente que crea en Alá y en el último Día y que tenga cariño a quienes se oponen a Alá y a Su Enviado, aunque éstos sean sus padres, sus hijos varones, sus hermanos o los miembros de su misma tribu."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "நபியே!) எவள் தன் கணவனைப் பற்றி உம்மிடம் தர்க்தித்து, அல்லாஹ்விடமும் முறையிட்டுக் கொண்டாளோ, அவளுடைய வார்த்தையை நிச்சயமாக அல்லாஹ் செவியேற்றுக் கொண்டான் - மேலும், அல்லாஹ் உங்களிருவரின் வாக்கு வாதத்தையும் செவியேற்றான்.",
                            "verse 58:2": "\"உங்களில் சிலர் தம் மனைவியரைத் \"தாய்கள்\" எனக் கூறிவிடுகின்றனர், அதனால் அவர்கள் இவர்களுடைடைய தாய்கள்\" (ஆகிவிடுவது) இல்லை இவர்களைப் பெற்றெடுத்தவர்கள் தாம் இவர்களுடைய தாய்கள் ஆவார்கள் - எனினும், நிச்சயமாக இவர்கள் சொல்லில் வெறுக்கத்தக்கதையும், பொய்யானதையுமே கூறுகிறார்கள் - ஆனால் நிச்சயமாக அல்லாஹ் மிகவும் பொறுப்பவன், மிகவும் மன்னிப்பவன்.",
                            "verse 58:3": "மேலும் எவர் தம் மனைவியரைத் தாய்களெனக் கூறிய பின் (வருந்தித்) தாம் கூறியதை விட்டும் திரும்பி (மீண்டும் தாம்பத்திய வாழ்வை நாடி)னால், அவ்விருவரும் ஒருவரை ஒருவர் தீண்டுவதற்கு முன்னர் ஓர் அடிமையை விடுவிக்க வேண்டும்.",
                            "verse 58:4": "ஆனால் (அடிமையை விடுதலை செய்ய வசதி) எவர் பெறவில்லையோ, அவர், அவ்விருவரும் ஒருவரை ஒருவர் தீண்டுவதற்கு முன் இரண்டு மாதங்கள் தொடர்ச்சியாக நோன்பு நோற்க வேண்டும்; எவர் இதற்கும் சக்தி பெறவில்லையோ, அவர் அறுபது ஏழைகளுக்கு உணவு அளித்தல் - வேண்டும், நீங்கள் அல்லாஹ்வின் மீதும் அவனுடைய தூதர் மீதும் விசுவாசம் கொள்வதற்காக (இவ்வாறு கட்டளையிடப்பட்டுள்ளது).",
                            "verse 58:5": "எவர்கள் அல்லாஹ்வையும், அவனுடைய தூதரையும் எதிர்க்கின்றார்களோ, நிச்சயமாக அவர்கள், அவர்களுக்கு முன்னிருந்தவர்கள் இழிவாக்கப் பட்டதைப் போல் இழிவாக்கப்ப படுவார்கள் - திடமாக நாம் தெளிவான வசனங்களை இறக்கியுள்ளோம்.",
                            "verse 58:6": "அல்லாஹ் அவர்கள் அனைவரையும்உயிர் கொடுத்து எழுப்பி, பின்னர் அவர்கள் செய்தவற்றை அவர்களுக்கு அறிவிக்கும் நாளில், அவர்கள் அவற்றை மறந்து விட்ட போதிலும், அல்லாஹ் கணக்கெடுத்து வைத்திருக்கிறான்.",
                            "verse 58:7": "நிச்சயமாக அல்லாஹ் வானங்களிலுள்ளவற்றையும் பூமியிலுள்ளவற்றையும் அறிகிறான் என்பதை நீர் பார்க்கவில்லையா? மூன்று பேர்களின் இரகசியத்தில் அவன் அவர்களில் நான்காவதாக இல்லாமலில்லை, இன்னும் ஐந்து பேர்களி(ன் இரகசியத்தி)ல் அவன் ஆறாவதாக இல்லாமலில்லை, இன்னும் அதைவிட மிகக் குறைந்தோ, அதைவிட மிக அதிகமாகவோ, அவர்கள் எங்கிருந்தாலும் அவன் அவர்களுடன் இல்லாமலில்லை - அப்பால் கியாம நாளில் அவர்கள் செய்தவற்றைப் பற்றி அவர்களுக்கு அவன் அறிவிப்பான், நிச்சயமாக அல்லாஹ் எல்லாப் பொருட்களைப் பற்றியும் நன்கறிந்தவன்.",
                            "verse 58:8": "இரகசியம் பேசுவதை விட்டுத்தடுக்கப்பட்டிருந்தும், எதை விட்டும் தடுக்கப்பட்டார்களோ அதன் பால் மீண்டு பாவத்தையும் வரம்பு மீறுதலையும், ரஸூலுக்கு மாறு செய்வதையும் கொண்டு இரகசியமாக ஆலோசனை செய்கிறார்களே அவர்களை (நபியே!) நீர் கவனிக்கவில்லையா? பின்னர் அவர்கள் உம்மிடம் வரும்போது அல்லாஹ் உம்மை எ(வ்வாசகத்)தைக் கொண்டு ஸலாம் (முகமன்) கூறிவில்லையோ அதைக் கொண்டு (முகமன்) கூறுகிறார்கள்.",
                            "verse 58:9": "ஈமான் கொண்டவர்களே! நீங்கள் இரகசியம் பேசிக் கொண்டால், பாவத்தையும் வரம்பு மீறுதலையும், (நம்) தூதருக்கு மாறு செய்வதையும் கொண்டு இரகசியம் பேசாதீர்கள், ஆனால் நன்மை செய்வதற்காகவும் பயபக்தியுடன் இருப்பதற்காகவும் இரகசியம் பேசிக் கொள்ளுங்கள்; மேலும், அல்லாஹ்வுக்கு - எவன்பால் நீங்கள் ஒன்று சேர்க்கப்படுவீர்களோ - அவனுக்கே அஞ்சி நடந்து கொள்ளுங்கள்.",
                            "verse 58:10": "ஈமான் கொண்டவர்களைக் கவலைப்படச் செய்வதற்காக ஷைத்தானிடமிருந்துள்ளதே (இந்த) இரகசிய(ப் பேச்சாகு)ம், ஆனால், அல்லாஹ்வுடையை அனுமதியின்றி (அவர்களுக்கு) அவனால் எந்தத் தீங்கும் செய்ய முடியாது, எனவே முஃமின்கள் அல்லாஹ்வையே முற்றிலும் நம்பியிருக்க வேண்டும்.",
                            "verse 58:11": "ஈமான் கொண்டவர்களே! சபைகளில் \"நகர்ந்து இடங்கொடுங்கள்\" என்று உங்களுக்குச் சொல்லப்பட்டால், நகர்ந்து இடம் கொடுங்கள், அல்லாஹ் உங்களுக்கு இடங்கொடுப்பான்; தவிர, 'எழுந்திருங்கள்\" என்று கூறப்பட்டால், உடனே எழுந்திருங்கள், அன்றியும், உங்களில் ஈமான் கொண்டவர்களுக்கும், கல்வி ஞானம் அளிக்கப்பட்டவர்களுக்கும் அல்லாஹ் பதவிகளை உயர்த்துவான் - அல்லாஹ்வோ நீங்கள் செய்பவற்றை நன்கு அறிந்தவனாக இருக்கின்றான்.",
                            "verse 58:12": "ஈமான் கொண்டவர்களே! நீங்கள் (நம்) தூதருடன் இரகசியம் பேச நேரிட்டால் உங்கள் இரகசியத்திற்கு முன்னர் ஏதேனும் தான தர்மத்தை முற்படுத்துங்கள்.",
                            "verse 58:13": "நீங்கள் உங்கள் இரகசியப் பேச்சுக்கு முன்னால் தான தர்மங்கள் முற்படுத்திவைக்க வேண்டுமே என்று அஞ்சுகிறீர்களா? அப்படி நீங்கள் செய்ய (இயல)வில்லையெனின் (அதற்காக தவ்பா செய்யும்) உங்களை அல்லாஹ் மன்னிக்கிறான், ஆகவே, தொழுகையை முறைப்படி நிலைநிறுத்துங்கள், இன்னும், ஜகாத்தும் கொடுத்து வாருங்கள், மேலும் அல்லாஹ்வுக்கும், அவன் தூதருக்கும் வழிப்படுங்கள், அன்றியும் நீங்கள் செய்பவற்றையெல்லாம் அல்லாஹ் நன்கு அறிகிறான்.",
                            "verse 58:14": "எந்த சமூகத்தார் மீது அல்லாஹ் கோபம் கொண்டானோ, அவர்களுடன் சிநேகிக்கிறவர்களை (நபியே!) நீர் கவனித்தீரா? அவர்கள் உங்களில் உள்ளவர்களும் அல்லர், அவர்களில் உள்ளவர்களும் அல்லர்.",
                            "verse 58:15": "அவர்களுக்காக அல்லாஹ் கடினமான வேதனையைச் சித்தம் செய்திருக்கின்றான்.",
                            "verse 58:16": "அவர்கள் தங்கள் சத்தியங்களைக் கேடயமாக ஆக்கிக்கொண்டு, (மக்களை) அல்லாஹ்வின் பாதையை விட்டும் தடுக்கிறார்கள், ஆகவே அவர்களுக்கு இழிவுபடுத்தும் வேதனை உண்டு.",
                            "verse 58:17": "அவர்களுடைய சொத்துக்களும், அவர்களுடைய மக்களும், அல்லாஹ் வி(திக்கும் வேதனையி)லிருந்து (காப்பாற்ற) உதவாது, அவர்கள் நரகவாதிகள், அவர்கள் அதில் என்றென்றும் இருப்பார்கள்.",
                            "verse 58:18": "அவர்கள் அனைவரையும் அல்லாஹ் எழுப்பும் நாளில் அவர்கள் உங்களிடம் சத்தியம் செய்தது போல், அவனிடமும் சத்தியம் செய்வார்கள், அன்றியும், அவர்கள் (அதன் மூலம் தப்பித்துக் கொள்வதற்கு) ஏதோ ஒன்றின் மீது நிச்சயமாகத் தாங்கள் இருப்பதாக எண்ணிக்கொள்வார்கள், அறிந்து கொள்க: நிச்சயமாக அவர்கள் பொய்யர்களே!",
                            "verse 58:19": "அவர்களை ஷைத்தான் மிகைத்து அல்லாஹ்வின் நினைப்பையும் அவர்கள் மறந்து விடுமாறு செய்து விட்டான் - அவர்களே ஷைத்தானின் கூட்டத்தினர், அறிந்து கொள்க: ஷைத்தானின் கூட்டத்தினர் தாம் நிச்சயமாக நஷ்டமடைந்தவர்கள்!",
                            "verse 58:20": "நிச்சமயாக எவர்கள் அல்லாஹ்வையும் அவனுடைய தூதரையும் எதிர்க்கிறார்களோ, நிச்சயமாக அவர்களே மிகவும் தாழ்ந்தவர்கள்.",
                            "verse 58:21": "\"நானும் என்னுடைய தூதர்களும் நிச்சயமாக மிகைத்து விடுவோம்\" என்று அல்லாஹ் விதித்துள்ளான்; நிச்சயமாக அல்லாஹ் மிக்க சக்தியுடையவன், யாவரையும் மிகைத்தவன்.",
                            "verse 58:22": "அல்லாஹ்வையும் இறுதி நாளையும் நம்பும் சமூகத்தினர், அல்லாஹ்வையும் அவனது தூதரையும் பகைத்துக் கொண்டவர்களை நேசிப்பவர்களாக (நபியே!) நீர் காணமாட்டீர்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "โดยแน่นอน อัลลอฮ์ทรงได้ยินถ้อยคำของสตรีที่กำลังโต้แย้งกับเจ้าในเรื่องสามีของนางและนางได้ร้องทุกข์ต่ออัลลอฮ์ และอัลลอฮ์นั้นทรงได้ยินการตอบโต้ของเจ้าทั้งสอง แท้จริงอัลลอฮ์เป็นผู้ทรงได้ยิน ผู้ทรงรู้เห็นเสมอ",
                            "verse 58:2": "บรรดาผู้เปรียบเทียบภรรยาของพวกเขาในหมู่พวกเจ้าว่าเสมือนแม่ของพวกเขานั้น พวกนางมิได้เป็นแม่ของพวกเขา บรรดาแม่ของพวกเขามิได้เป็นอื่นใดนอกจากเป็นผู้ให้กำเนิดพวกเขาเท่านั้น และแท้จริงพวกเขานั้นกล่าวคำพูดที่น่าเกลียดและกล่าวเท็จ และแท้จริงอัลลอฮ์นั้นเป็นผู้ทรงอภัยโทษ ทรงยกโทษให้เสมอ",
                            "verse 58:3": "และบรรดาผู้เปรียบเทียบภรรยาของพวกเขาว่าเสมือนแม่ของพวกเขานั้น แล้วพวกเขาจะคืนสู่ถ้อยคำที่พวกเขาได้กล่าวไว้ ดังนั้น (สิ่งที่จำเป็นแก่เขาต้องปฏิบัติคือ) การปล่อยทาสหนึ่งคนก่อนที่เขาทั้งสองแตะต้องต่อกัน (ร่วมหลับนอน) นั่นคือสิ่งที่พวกเจ้าถูกเตือนเอาไว้ใช้ให้ปฏิบัติ และอัลลอฮ์ทรงรอบรู้ยิ่งในสิ่งที่พวกเจ้ากระทำ",
                            "verse 58:4": "ส่วนผู้ที่ไม่สามารถหา (ทาส) ได้ ก็ต้องถือศีลอดสองเดือนติดต่อกัน ก่อนที่เขาทั้งสองจะแตะต้องต่อกัน (ร่วมหลับนอน) สำหรับผู้ที่ไม่สามารถจะถือศีลอดได้ ก็ต้องให้อาหารแก่คนยากจนจำนวนหกสิบคน ทั้งนี้เพื่อจะให้พวกเจ้าศรัทธาต่ออัลลอฮ์และร่อซู้ลของพระองค์ นั่นคือขอบเขตของอัลลอฮ์ และสำหรับพวกปฏิเสธศรัทธานั้นจะได้รับการลงโทษอย่างเจ็บปวด",
                            "verse 58:5": "แท้จริงบรรดาผู้ต่อต้านอัลลอฮ์และร่อซู้ลของพระองค์ พวกเขาจะถูกทำให้อัปยศเช่นเดียวกับบรรดาก่อนหน้าพวกเขาได้ถูกทำให้อัปยศมาก่อนแล้ว และแน่นอนเราได้ประทานอายาตทั้งหลายอันชัดแจ้ง และสำหรับพวกปฏิเสธศรัทธาจะได้รับการลงโทษอย่างน่าอดสู",
                            "verse 58:6": "วันที่อัลลอฮ์จะทรงให้พวกเขาทั้งหมดฟื้นคืนชีพขึ้นมา แล้วพระองค์จะทรงแจ้งให้พวกเขาทราบถึงสิ่งที่พวกเขาปฏิบัติไว้ อัลลอฮ์ทรงประเมินมันไว้อย่างครบถ้วน แต่พวกเขาลืมมัน และอัลลอฮ์ทรงเป็นพยานต่อทุกสิ่งทุกอย่าง",
                            "verse 58:7": "เจ้าไม่เห็นดอกหรือว่า อัลลอฮ์ทรงรอบรู้สิ่งที่อยู่ในชั้นฟ้าทั้งหลายและสิ่งที่อยู่ในแผ่นดิน การซุบซิบกันในสามคนจะไม่เกิดขึ้นเว้นแต่พระองค์จะทรงเป็นที่สี่ของพวกเขา และมันจะไม่เกิดขึ้นในห้าคนเว้นแต่พระองค์ทรงเป็นที่หกของพวกเขา และมันจะไม่เกิดขึ้นน้อยกว่านั้น และจะไม่เกิดขึ้นมากกว่านั้น เว้นแต่พระองค์จะทรงอยู่ร่วมกับพวกเขา ไม่ว่าพวกเขาจะอยู่ในแห่งหนใด แล้วพระองค์ก็จะทรงแจ้งพวกเขาให้ทราบในวันกิยามะฮ์ถึงสิ่งที่พวกเขาได้ปฏิบัติไว้ (ในโลกดุนยา) แท้จริงอัลลอฮ์เป็นผู้ทรงรอบรู้ทุกสิ่ง",
                            "verse 58:8": "เจ้าไม่เห็นดอกหรือว่า บรรดาผู้ที่ถูกห้ามจากการซุบซิบกัน แล้วพวกเขาก็กลับไปกระทำในสิ่งที่พวกเขาได้ถูกห้ามเอาไว้ และพวกเขาซุบซิบนินทากันในการทำบาปและการเป็นศัตรูและการฝ่าฝืนท่านร่อซู้ล และเมื่อพวกเขามาหาเจ้า พวกเขาจะกล่าวทักทายไม่เหมือนกับที่อัลลอฮ์ทรงกล่าวทักทายด้วยคำพูดนั้น และพวกเขากล่าวในหมู่พวกเขาว่า ทำไมอัลลอฮ์จึงไม่ทรงลงโทษเราตามที่เราได้กล่าวทักทาย (มุฮัมมัด) นรกก็เป็นการพอเพียงแก่พวกเขาแล้ว พวกเขาจะถูกเผาไหม้ในนั้น มันเป็นทางกลับที่ชั่วร้ายยิ่ง",
                            "verse 58:9": "โอ้บรรดาผู้ศรัทธาเอ๋ย เมื่อพวกเจ้าซุบซิบต่อกัน ก็อย่าได้ซุบซิบกันด้วยการทำบาปและการเป็นศัตรูและการฝ่าฝืนท่านร่อซู้ล แต่จงซุบซิบกันเพื่อการทำความดีและการยำเกรง พวกเจ้าจงยำเกรงอัลลอฮ์ ผู้ซึ่งพวกเจ้าจะถูกรวบรวมให้กลับไปหาพระองค์",
                            "verse 58:10": "แท้จริงการซุบซิบนินทากันนั้นเป็นการงานของชัยฏอน เพื่อมันจะก่อความเสียใจให้แก่บรรดามุอฺมิน แต่มันจะไม่ให้ร้ายแต่อย่างใดแก่พวกเขา เว้นแต่ด้วยอนุมัติของอัลลอฮ์ และเฉพาะอัลลอฮ์เท่านั้นบรรดามุอฺมินต้องมอบความไว้วางใจ",
                            "verse 58:11": "โอ้บรรดาผู้ศรัทธาเอ๋ย เมื่อได้มีเสียงกล่าวแก่พวกเจ้าว่า จงหลีกที่ให้ในที่ชุมนุม พวกเจ้าก็จงหลีกที่ให้เขา เพราะอัลลอฮ์จะทรงให้ที่กว้างขวางแก่พวกเจ้า (ในวันกิยามะฮ์) และเมื่อมีเสียงกล่าวว่าจงลุกขึ้นยืนจากที่ชุมนุมนั้น พวกเจ้าก็จงลุกขึ้นยืน เพราะอัลลอฮ์จะทรงยกย่องเทอดเกียรติแก่บรรดาผู้ศรัทธาในหมู่พวกเจ้า และบรรดาผู้ได้รับความรู้หลายชั้น และอัลลอฮ์ทรงรอบรู้ยิ่งในสิ่งที่พวกเจ้ากระทำ",
                            "verse 58:12": "โอ้บรรดาผู้ศรัทธาเอ๋ย เมื่อพวกเจ้าจะปรึกษาหารือท่านร่อซู้ลเป็นการส่วนตัว (เป็นการลับ) พวกเจ้าจงบริจาคานก่อนการปรึกษาหารือของพวกเจ้า นั่นเป็นการกระทำที่ดีสำหรับพวกเจ้า และเป็นการทำจิตใจให้ผ่องแผ้ว หากพวกเจ้าไม่สามารถหามาได้ แท้จริงอัลลอฮ์เป็นผู้ทรงอภัย ผู้ทรงเมตตาเสมอ",
                            "verse 58:13": "พวกเจ้ากลัวต่อากรบริจาคทานก่อนหน้าการปรึกษาหารือเป็นการส่วนตัวของพวกเจ้ากระนั้นหรือ? หากพวกเจ้ามิได้กระทำเช่นนั้น อัลลอฮ์ก็ได้ทรงอภัยโทษให้แก่พวกเจ้าแล้ว ดังนั้นพวกเจ้าจงดำรงไว้ซึ่งการละหมาดและบริจาคซะกาต และจงเชื่อฟังภักดีต่ออัลลอฮ์และร่อซู้ลของพระองค์ และอัลลอฮ์ทรงรอบรู้ยิ่งในสิ่งที่พวกเจ้ากระทำ",
                            "verse 58:14": "เจ้ามิเห็นดอกหรือบรรดาผู้ที่เป็นมิตรกับชนกลุ่มหนึ่งซึ่งอัลลอฮ์ทรงกริ้วพวกเขา? พวกเขา (มุนาฟิกีน) มิได้เป็นพวกของพวกเจ้า และมิได้เป็นพวกของพวกเขา (ยะฮูด) และพวกเขาสาบานในเรื่องโกหกทั้งนั้น ทั้ง ๆ ที่พวกเรารู้ดีอยู่แล้ว",
                            "verse 58:15": "อัลลอฮ์ทรงเตรียมการลงโทษอย่างสาหัสไว้ให้แก่พวกเขาแล้ว แท้จริงพวกเขานั้น สิ่งที่พวกเขากระทำไปมันชั่วช้าจริง ๆ",
                            "verse 58:16": "พวกเขาได้ยึดถือเอาการสาบานของพวกเขาเป็นโล่ป้องกัน แล้วพวกเขาก็ขัดขวางผู้คนให้ออกจากทางของอัลลอฮ์ ดังนั้น สำหรับพวกเขาจะได้รับการลงโทษอย่างน่าอดสู",
                            "verse 58:17": "ทรัพย์สมบัติของพวกเขาและลูกหลานของพวกเขา จะไม่ช่วยพวกเขาให้รอดพ้นจากการลงโทษของอัลลอฮ์ไปได้แต่อย่างใด ชนเหล่านั้นเป็นชาวนรก พวกเขาจะพำนักอยู่ในนั้นตลอดกาล",
                            "verse 58:18": "วันที่อัลลอฮ์จะทรงให้พวกเขาฟื้นคืนชีพขึ้นมาทั้งหมด แล้วพวกเขาก็จะสาบานต่อพระองค์ดังเช่นที่พวกเขาสาบานต่อพวกเจ้า และพวกเขาคิดว่า แท้จริงพวกเขาอยู่บนสิ่งหนึ่งแห่งความจริงแล้ว พึงทราบเถิด แท้จริงพวกเขาเป็นผู้โกหก",
                            "verse 58:19": "ชัยฏอนมารร้ายได้เข้าไปครอบงำพวกเขาเสียแล้ว มันจึงทำให้พวกเขาลืมการรำลึกถึงอัลลอฮ์ ชนเหล่านั้นคือบรรดาพรรคพวกของชัยฏอน พึงทราบเถิดว่า แท้จริงพรรคพวกของชัยฏอนนั้นพวกเขาเป็นผู้ขาดทุน",
                            "verse 58:20": "แท้จริงบรรดาผู้ฝ่าฝืนอัลลอฮ์และร่อซู้ลของพระองค์ ชนเหล่านั้นอยู่ในหมู่ผู้อัปยศอดสู",
                            "verse 58:21": "อัลลอฮ์ทรงกำหนดไว้ว่า แน่นอนข้าและร่อซู้ลของข้าจะมีชัยชนะเหนือกว่า แท้จริงอัลลอฮ์นั้นเป็นผู้ทรงพลัง ผู้ทรงอำนาจเหนือ",
                            "verse 58:22": "เจ้าจะไม่พบหมู่ชนใดที่พวกเขาศรัทธาต่ออัลลอฮ์และวันปรโลก รักใคร่ชอบพอผู้ที่ต่อต้านอัลลอฮ์และร่อซู้ลของพระองค์ ถึงแม้ว่าพวกเขาจะเป็นพ่อของพวกเขาหรือลูกหลานของพวกเขา หรือพี่น้องของพวกเขา หรือเครือญาติของพวกเขาก็ตาม ชนเหล่านั้นอัลลอฮ์ได้ทรงบันทึกการศรัทธาไว้ในจิตใจของพวกเขา และได้ทรงเสริมพวกเขาให้มีพลังมากขึ้นด้วยการสนับสนุนของพระองค์ และจะทรงให้พวกเขาได้เข้าสวนสวรรค์หลากหลาย มีแม่น้ำหลายสายไหลผ่าน ณ เบื้องล่างของสวนสวรรค์ โดยเป็นผู้พำนักอยู่ในนั้นตลอดกาล อัลลอฮ์ทรงโปรดปรานต่อพวกเขาและพวกเขาก็ยินดีปรีดาต่อพระองค์ ชนเหล่านั้นคือพรรคของอัลลอฮ์ พึงรู้เถิดว่า แท้จริงพรรคของอัลลอฮ์นั้น พวกเขาเป็นผู้สบความสำเร็จ"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Kocası hakkında seninle tartışan ve Allah'a şikâyette bulunan kadının sözünü Allah işitmiştir.",
                            "verse 58:2": "İçinizden zıhâr yapanların kadınları, onların anaları değildir.",
                            "verse 58:3": "Kadınlardan zıhâr ile ayrılmak isteyip de sonra söylediklerinden dönenlerin karılarıyla temas etmeden önce bir köleyi hürriyete kavuşturmaları gerekir.",
                            "verse 58:4": "(Buna imkân) bulamayan kimse, hanımıyla temas etmeden önce ardarda iki ay oruç tutar.",
                            "verse 58:5": "Allah'a ve Resûlüne karşı gelenler, kendilerinden öncekilerin alçaltıldığı gibi alçaltılacaklardır.",
                            "verse 58:6": "O gün Allah onların hepsini diriltecek ve yaptıklarını kendilerine haber verecektir.",
                            "verse 58:7": "Göklerde ve yerde olanları Allah'ın bildiğini görmüyor musun? Üç kişinin gizli konuştuğu yerde dördüncüsü mutlaka O'dur.",
                            "verse 58:8": "Gizli konuşmaktan menedildikten sonra yine o yasaklananı yapmaya kalkışarak günah, düşmanlık ve Peygamber'e karşı gelmek hususunda gizlice konuşanları görmedin mi? Onlar sana geldikleri zaman seni, Allah'ın selamlamadığı bir şekilde selamlıyorlar.",
                            "verse 58:9": "Ey iman edenler! Aranızda gizli konuşacağınız zaman günahı, düşmanlığı ve Peygamber'e karşı gelmeyi fısıldamayın.",
                            "verse 58:10": "Gizli konuşmalar şeytandandır.",
                            "verse 58:11": "Ey iman edenler! Size \"Meclislerde yer açın\" denilince yer açın ki Allah da size genişlik versin.",
                            "verse 58:12": "Ey iman edenler! Peygamber ile gizli bir şey konuşacağınız zaman bu konuşmanızdan önce bir sadaka veriniz.",
                            "verse 58:13": "Gizli bir şey konuşmanızdan önce sadakalar vermekten çekindiniz mi? Bunu yapmadığınıza ve Allah da sizi affettiğine göre artık namazı kılın, zekâtı verin Allah'a ve Resûlüne itaat edin.",
                            "verse 58:14": "Allah'ın kendilerine gazap ettiği bir topluluğu dost edinenleri görmedin mi? Onlar ne sizdendirler ne de onlardan.",
                            "verse 58:15": "Allah onlara çetin bir azap hazırlamıştır.",
                            "verse 58:16": "Onlar yeminlerini kalkan yapıp Allah'ın yolundan alıkoydular.",
                            "verse 58:17": "Onların malları da oğulları da Allah'a karşı kendilerine bir fayda vermez.",
                            "verse 58:18": "O gün Allah onların hepsini yeniden diriltecek, onlar da dünyada size yemin ettikleri gibi, O'na yemin edeceklerdir.",
                            "verse 58:19": "Şeytan onları etkisi altına aldı da kendilerine Allah'ı anmayı unutturdu.",
                            "verse 58:20": "Allah'a ve Peygamberine düşman olanlar, işte onlar en aşağıların arasındadırlar.",
                            "verse 58:21": "Allah: Elbette ben ve elçilerim galip geleceğiz, diye yazmıştır.",
                            "verse 58:22": "Allah'a ve ahiret gününe inanan bir toplumun -babaları, oğulları, kardeşleri, yahut akrabaları da olsa- Allah'a ve Resûlüne düşman olanlarla dostluk ettiğini göremezsin."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "(اے پیغمبر) جو عورت تم سے اپنے شوہر کے بارے میں بحث جدال کرتی اور خدا سے شکایت (رنج وملال) کرتی تھی۔ خدا نے اس کی التجا سن لی اور خدا تم دونوں کی گفتگو سن رہا تھا۔ کچھ شک نہیں کہ خدا سنتا دیکھتا ہے",
                            "verse 58:2": "بيشک اللہ نے اس عورت کي بات سن لي ہے جو آپ سے اپنے شوہر کے بارے ميں تکرار کر رہي تھي اور اللہ سے فرياد کر رہي تھي، اور اللہ آپ دونوں کے باہمي سوال و جواب سن رہا تھا، بيشک اللہ خوب سننے والا خوب ديکھنے والا ہےo",
                            "verse 58:3": "تم ميں سے جو لوگ اپني بيويوں سے ظِہار کر بيٹھتے ہيں (يعني يہ کہہ بيٹھتے ہيں کہ تم مجھ پر ميري ماں کي پشت کي طرح ہو)، تو (يہ کہنے سے) وہ اُن کي مائيں نہيں (ہوجاتيں)، اُن کي مائيں تو صرف وہي ہيں جنہوں نے اُن کو جَنا ہے، اور بيشک وہ لوگ بري اور جھوٹي بات کہتے ہيں، اور بيشک ا? ضرور درگزر فرمانے والا بڑا بخشنے والا ہےo",
                            "verse 58:4": "جو لوگ تم میں سے اپنی عورتوں کو ماں کہہ دیتے ہیں وہ ان کی مائیں نہیں (ہوجاتیں)۔ ان کی مائیں تو وہی ہیں جن کے بطن سے وہ پیدا ہوئے۔ بیشک وہ نامعقول اور جھوٹی بات کہتے ہیں اور خدا بڑا معاف کرنے والا (اور) بخشنے والا ہے",
                            "verse 58:5": "اور جو لوگ اپنی بیویوں کو ماں کہہ بیٹھیں پھر اپنے قول سے رجوع کرلیں تو (ان کو) ہم بستر ہونے سے پہلے ایک غلام آزاد کرنا (ضروری) ہے۔ (مومنو) اس (حکم) سے تم کو نصیحت کی جاتی ہے۔ اور جو کچھ تم کرتے ہو خدا اس سے خبردار ہے",
                            "verse 58:6": "اور جو لوگ اپني بيويوں سے ظہار کر بيٹھيں پھر جو کہا ہے اس سے پلٹنا چاہيں تو ايک گردن (غلام يا باندي) کا آزاد کرنا لازم ہے قبل اِس کے کہ وہ ايک دوسرے کو مَس کريں، تمہيں اس بات کي نصيحت کي جاتي ہے، اور اللہ اُن کاموں سے خوب آگاہ ہے جو تم کرتے ہوo",
                            "verse 58:7": "پھر جسے (غلام يا باندي) ميسّر نہ ہو تو دو ماہ متواتر روزے رکھنا (لازم ہے) قبل اِس کے کہ وہ ايک دوسرے کو مَس کريں، پھر جو شخص اِس کي (بھي) طاقت نہ رکھے تو ساٹھ مسکينوں کو کھانا کھلانا (لازم ہے)، يہ اِس لئے کہ تم اللہ اور اُس کے رسول (صلي اللہ عليہ وآلہ وسلم) پر ايمان رکھو? اور يہ اللہ کي (مقرر کردہ) حدود ہيں، اور کافروں کے لئے دردناک عذاب ہےo",
                            "verse 58:8": "جس کو غلام نہ ملے وہ مجامعت سے پہلے متواتر دو مہینے کے روزے (رکھے) جس کو اس کا بھی مقدور نہ ہوا (اسے) ساٹھ مسکینوں کو کھانا کھلانا (چاہیئے)۔ یہ (حکم) اس لئے (ہے) کہ تم خدا اور اسکے رسول کے فرمانبردار ہوجاؤ۔ اور یہ خدا کی حدیں ہیں۔ اور نہ ماننے والوں کے لئے درد دینے والا عذاب ہے",
                            "verse 58:9": "جو لوگ خدا اور اس کے رسول کی مخالفت کرتے ہیں وہ (اسی طرح) ذلیل کئے جائیں گے جس طرح ان سے پہلے لوگ ذلیل کئے گئے تھے اور ہم نے صاف اور صریح آیتیں نازل کردی ہیں۔ جو نہیں مانتے ان کو ذلت کا عذاب ہوگا",
                            "verse 58:10": "بيشک جو لوگ اللہ اور اس کے رسول (صلي اللہ عليہ وآلہ وسلم) سے عداوت رکھتے ہيں وہ اسي طرح ذليل کئے جائيں گے جس طرح اُن سے پہلے لوگ ذليل کئے جاچکے ہيں اور بيشک ہم نے واضح آيتيں نازل فرما دي ہيں، اور کافروں کے لئے ذِلت انگيز عذاب ہےo",
                            "verse 58:11": "جس دن اللہ ان سب لوگوں کو (دوبارہ زندہ کر کے) اٹھائے گا پھر انہيں اُن کے اعمال سے آگاہ فرمائے گا، اللہ نے (ان کے) ہر عمل کو شمار کر رکھا ہے حالانکہ وہ اسے بھول (بھي) چکے ہيں، اور اللہ ہر چيز پر مطّلع (اور آگاہ) ہےo",
                            "verse 58:12": "جس دن خدا ان سب کو جلا اٹھائے گا تو جو کام وہ کرتے رہے ان کو جتائے گا۔ خدا کو وہ سب (کام) یاد ہیں اور یہ ان کو بھول گئے ہیں اور خدا ہر چیز سے واقف ہے",
                            "verse 58:13": "کیا تم کو معلوم نہیں کہ جو کچھ آسمانوں میں ہے اور جو کچھ زمین میں ہے خدا کو سب معلوم ہے۔ (کسی جگہ) تین (شخصوں) کا (مجمع اور) کانوں میں صلاح ومشورہ نہیں ہوتا مگر وہ ان میں چوتھا ہوتا ہے اور نہ کہیں پانچ کا مگر وہ ان میں چھٹا ہوتا ہے اور نہ اس سے کم یا زیادہ مگر وہ ان کے ساتھ ہوتا ہے خواہ وہ کہیں ہوں۔ پھر جو جو کام یہ کرتے رہے ہیں قیامت کے دن وہ (ایک ایک) ان کو بتائے گا۔ بیشک خدا ہر چیز سے واقف ہے",
                            "verse 58:14": "(اے انسان!) کيا تجھے معلوم نہيں کہ اللہ اُن سب چيزوں کو جانتا ہے جو آسمانوں ميں ہيں اور جو زمين ميں ہيں، کہيں بھي تين (آدميوں) کي کوئي سرگوشي نہيں ہوتي مگر يہ کہ وہ (اللہ اپنے محيط علم و آگہي کے ساتھ) اُن کا چوتھا ہوتا ہے اور نہ ہي کوئي پانچ (آدميوں) کي سرگوشي ہوتي ہے مگر وہ (اپنے علمِ محيط کے ساتھ) اُن کا چھٹا ہوتا ہے، اور نہ اس سے کم (لوگوں) کي اور نہ زيادہ کي مگر وہ (ہميشہ) اُن کے ساتھ ہوتا ہے جہاں کہيں بھي وہ ہوتے ہيں، پھر وہ قيامت کے دن انہيں اُن کاموں سے خبردار کر دے گا جو وہ کرتے رہے تھے، بيشک اللہ ہر چيز کو خوب جاننے والا ہےo",
                            "verse 58:15": "کيا آپ نے اُن لوگوں کو نہيں ديکھا جنہيں سرگوشيوں سے منع کيا گيا تھا پھر وہ لوگ وہي کام کرنے لگے جس سے روکے گئے تھے اور وہ گناہ اور سرکشي اور نافرمانئ رسول (صلي اللہ عليہ وآلہ وسلم) سے متعلق سرگوشياں کرتے ہيں اور جب آپ کے پاس حاضر ہوتے ہيں تو آپ کو اُن (نازيبا) کلمات کے ساتھ سلام کرتے ہيں جن سے اللہ نے آپ کو سلام نہيں فرمايا اور اپنے دلوں ميں کہتے ہيں کہ (اگر يہ رسول سچے ہيں تو) اللہ ہميں اِن (باتوں) پر عذاب کيوں نہيں ديتا جو ہم کہتے ہيں؟ انہيں دوزخ (کا عذاب) ہي کافي ہے، وہ اسي ميں داخل ہوں گے، اور وہ بہت ہي برا ٹھکانا ہےo",
                            "verse 58:16": "کیا تم نے ان لوگوں کو نہیں دیکھا جن کو سرگوشیاں کرنے سے منع کیا گیا تھا۔ پھر جس (کام) سے منع کیا گیا تھا وہی پھر کرنے لگے اور یہ تو گناہ اور ظلم اور رسول (خدا) کی نافرمانی کی سرگوشیاں کرتے ہیں۔ اور جب تمہارے پاس آتے ہیں تو جس (کلمے) سے خدا نے تم کو دعا نہیں دی اس سے تمہیں دعا دیتے ہیں۔ اور اپنے دل میں کہتے ہیں کہ (اگر یہ واقعی پیغمبر ہیں تو) جو کچھ ہم کہتے ہیں خدا ہمیں اس کی سزا کیوں نہیں دیتا؟ (اے پیغمبر) ان کو دوزخ (ہی کی سزا) کافی ہے۔ یہ اسی میں داخل ہوں گے۔ اور وہ بری جگہ ہے",
                            "verse 58:17": "مومنو! جب تم آپس میں سرگوشیاں کرنے لگو تو گناہ اور زیادتی اور پیغمبر کی نافرمانی کی باتیں نہ کرنا بلکہ نیکوکاری اور پرہیزگاری کی باتیں کرنا۔ اور خدا سے جس کے سامنے جمع کئے جاؤ گے ڈرتے رہنا",
                            "verse 58:18": "اے ايمان والو! جب تم آپس ميں سرگوشي کرو تو گناہ اور ظلم و سرکشي اور نافرمانئ رسالت مآب (صلي اللہ عليہ وآلہ وسلم) کي سرگوشي نہ کيا کرو اور نيکي اور پرہيزگاري کي بات ايک دوسرے کے کان ميں کہہ ليا کرو، اور اللہ سے ڈرتے رہو جس کي طرف تم سب جمع کئے جاؤ گےo",
                            "verse 58:19": "(منفي اور تخريبي) سرگوشي محض شيطان ہي کي طرف سے ہوتي ہے تاکہ وہ ايمان والوں کو پريشان کرے حالانکہ وہ (شيطان) اُن (مومنوں) کا کچھ بگاڑ نہيں سکتا مگر اللہ کے حکم سے، اور اللہ ہي پر مومنوں کو بھروسہ رکھنا چاہيےo",
                            "verse 58:20": "کافروں کی) سرگوشیاں تو شیطان (کی حرکات) سے ہیں (جو) اس لئے (کی جاتی ہیں) کہ مومن (ان سے) غمناک ہوں مگر خدا کے حکم کے سوا ان سے انہیں کچھ نقصان نہیں پہنچ سکتا۔ تو مومنو کو چاہیئے کہ خدا ہی پر بھروسہ رکھیں",
                            "verse 58:21": "مومنو! جب تم سے کہا جائے کہ مجلس میں کھل کر بیٹھو تو کھل بیٹھا کرو۔ خدا تم کو کشادگی بخشے گا۔ اور جب کہا جائے کہ اُٹھ کھڑے ہو تو اُٹھ کھڑے ہوا کرو۔ جو لوگ تم میں سے ایمان لائے ہیں اور جن کو علم عطا کیا گیا ہے خدا ان کے درجے بلند کرے گا۔ اور خدا تمہارے سب کاموں سے واقف ہے",
                            "verse 58:22": "اے ايمان والو! جب تم سے کہا جائے کہ (اپني) مجلسوں ميں کشادگي پيدا کرو تو کشادہ ہو جايا کرو اللہ تمہيں کشادگي عطا فرمائے گا اور جب کہا جائے کھڑے ہو جاؤ تو تم کھڑے ہوجايا کرو، اللہ اُن لوگوں کے درجات بلند فرما دے گا جو تم ميں سے ايمان لائے اور جنہيں علم سے نوازا گيا، اور اللہ اُن کاموں سے جو تم کرتے ہو خوب آگاہ ہےo",
                            "verse 58:23": "اے ايمان والو! جب تم رسول (صلي اللہ عليہ وآلہ وسلم) سے کوئي راز کي بات تنہائي ميں عرض کرنا چاہو تو اپني رازدارانہ بات کہنے سے پہلے کچھ صدقہ و خيرات کر ليا کرو، يہ (عمل) تمہارے لئے بہتر اور پاکيزہ تر ہے، پھر اگر (خيرات کے لئے) کچھ نہ پاؤ تو بيشک اللہ بہت بخشنے والا بہت رحم فرمانے والا ہےo",
                            "verse 58:24": "مومنو! جب تم پیغمبر کے کان میں کوئی بات کہو تو بات کہنے سے پہلے (مساکین کو) کچھ خیرات دے دیا کرو۔ یہ تمہارے لئے بہت بہتر اور پاکیزگی کی بات ہے۔ اور اگر خیرات تم کو میسر نہ آئے تو خدا بخشنے والا مہربان ہے",
                            "verse 58:25": "کیا تم اس سیکہ پیغمبر کے کان میں کوئی بات کہنے سے پہلے خیرات دیا کرو ڈر گئے؟ پھر جب تم نے (ایسا) نہ کیا اور خدا نے تمہیں معاف کردیا تو نماز پڑھتے اور زکوٰة دیتے رہو اور خدا اور اس کے رسول کی فرمانبرداری کرتے رہو۔ اور جو کچھ تم کرتے ہو خدا اس سے خبردار ہے",
                            "verse 58:26": "کيا (بارگاہِ رسالت صلي اللہ عليہ وآلہ وسلم ميں) تنہائي و رازداري کے ساتھ بات کرنے سے قبل صدقات و خيرات دينے سے تم گھبرا گئے؟ پھر جب تم نے (ايسا) نہ کيا اور اللہ نے تم سے باز پرس اٹھا لي (يعني يہ پابندي اٹھا دي) تو (اب) نماز قائم رکھو اور زکو?? ادا کرتے رہو اور اللہ اور اُس کے رسول (صلي اللہ عليہ وآلہ وسلم) کي اطاعت بجا لاتے رہو، اور اللہ تمہارے سب کاموں سے خوب آگاہ ہےo",
                            "verse 58:27": "کيا آپ نے اُن لوگوں کو نہيں ديکھا جو ايسي جماعت کے ساتھ دوستي رکھتے ہيں جن پر اللہ نے غضب فرمايا، نہ وہ تم ميں سے ہيں اور نہ اُن ميں سے ہيں اور جھوٹي قَسميں کھاتے ہيں حالانکہ وہ جانتے ہيںo",
                            "verse 58:28": "بھلا تم نے ان لوگوں کو نہیں دیکھا جو ایسوں سے دوستی کرتے ہیں جن پر خدا کا غضب ہوا۔ وہ نہ تم میں ہیں نہ ان میں۔ اور جان بوجھ کر جھوٹی باتوں پر قسمیں کھاتے ہیں",
                            "verse 58:29": "خدا نے ان کے لئے سخت عذاب تیار کر رکھا ہے۔ یہ جو کچھ کرتے ہیں یقیناً برا ہے",
                            "verse 58:30": "اللہ نے اُن کے لئے سخت عذاب تيار فرما رکھا ہے، بيشک وہ برا (کام) ہے جو وہ کر رہے ہيںo",
                            "verse 58:31": "انہوں نے اپني (جھوٹي) قَسموں کو ڈھال بنا ليا ہے سو وہ (دوسروں کو) راہِ خدا سے روکتے ہيں، پس اُن کے لئے ذِلّت انگيز عذاب ہےo",
                            "verse 58:32": "انہوں نے اپنی قسموں کو ڈھال بنا لیا اور (لوگوں کو) خدا کے راستے سے روک دیا ہے سو ان کے لئے ذلت کا عذاب ہے",
                            "verse 58:33": "خدا کے (عذاب کے) سامنے نہ تو ان کا مال ہی کچھ کام آئے گا اور نہ اولاد ہی (کچھ فائدہ دے گی)۔ یہ لوگ اہل دوزخ ہیں اس میں ہمیشہ (جلتے) رہیں گے",
                            "verse 58:34": "اللہ (کے عذاب) سے ہرگز نہ ہي اُن کے مال انہيں بچا سکيں گے اور نہ اُن کي اولاد ہي (انہيں بچا سکے گي)، يہي لوگ اہلِ دوزخ ہيں، وہ اس ميں ہميشہ رہنے والے ہيںo",
                            "verse 58:35": "جس دن اللہ اُن سب کو (دوبارہ زندہ کر کے) اٹھائے گا تو وہ اُس کے حضور (بھي) قَسميں کھا جائيں گے جيسے تمہارے سامنے قَسميں کھاتے ہيں اور وہ گمان کرتے ہيں کہ وہ کسي (اچھي) شے (يعني روِش) پر ہيں? آگاہ رہو کہ يہ لوگ جھوٹے ہيںo",
                            "verse 58:36": "جس دن خدا ان سب کو جلا اٹھائے گا تو جس طرح تمہارے سامنے قسمیں کھاتے (اسی طرح) خدا کے سامنے قسمیں کھائیں گے اور خیال کریں گے کہ (ایسا کرنے سے) کام لے نکلے ہیں۔ دیکھو یہ جھوٹے (اور برسر غلط) ہیں",
                            "verse 58:37": "شیطان نے ان کو قابو میں کرلیا ہے۔ اور خدا کی یاد ان کو بھلا دی ہے۔ یہ (جماعت) شیطان کا لشکر ہے۔ اور سن رکھو کہ شیطان کا لشکر نقصان اٹھانے والا ہے",
                            "verse 58:38": "اُن پر شيطان نے غلبہ پا ليا ہے سو اُس نے انہيں اللہ کا ذکر بھلا ديا ہے، يہي لوگ شيطان کا لشکر ہيں? جان لو کہ بيشک شيطاني گروہ کے لوگ ہي نقصان اٹھانے والے ہيںo",
                            "verse 58:39": "بيشک جو لوگ اللہ اور اُس کے رسول (صلي اللہ عليہ وآلہ وسلم) سے عداوت رکھتے ہيں وہي ذليل ترين لوگوں ميں سے ہيںo",
                            "verse 58:40": "جو لوگ خدا اور اس کے رسول کی مخالفت کرتے ہیں وہ نہایت ذلیل ہوں گے",
                            "verse 58:41": "خدا کا حکم ناطق ہے کہ میں اور میرے پیغمبر ضرور غالب رہیں گے۔ بیشک خدا زورآور (اور) زبردست ہے",
                            "verse 58:42": "اللہ نے لکھ ديا ہے کہ يقينا ميں اور ميرے رسول ضرور غالب ہو کر رہيں گے، بيشک اللہ بڑي قوت والا بڑے غلبہ والا ہےo",
                            "verse 58:43": "آپ اُن لوگوں کو جو اللہ پر اور يومِ آخرت پر ايمان رکھتے ہيں کبھي اس شخص سے دوستي کرتے ہوئے نہ پائيں گے جو اللہ اور اُس کے رسول (صلي اللہ عليہ وآلہ وسلم) سے دشمني رکھتا ہے خواہ وہ اُن کے باپ (اور دادا) ہوں يا بيٹے (اور پوتے) ہوں يا اُن کے بھائي ہوں يا اُن کے قريبي رشتہ دار ہوں? يہي وہ لوگ ہيں جن کے دلوں ميں اُس (اللہ) نے ايمان ثبت فرما ديا ہے اور انہيں اپني روح (يعني فيضِ خاص) سے تقويت بخشي ہے، اور انہيں (ايسي) جنتوں ميں داخل فرمائے گا جن کے نيچے سے نہريں بہہ رہي ہيں، وہ اُن ميں ہميشہ رہنے والے ہيں، اللہ اُن سے راضي ہو گيا ہے اور وہ اللہ سے راضي ہو گئے ہيں، يہي ا? (والوں) کي جماعت ہے، ياد رکھو! بيشک ا? (والوں) کي جماعت ہي مراد پانے والي ہےo",
                            "verse 58:44": "جو لوگ خدا پر اور روز قیامت پر ایمان رکھتے ہیں تم ان کو خدا اور اس کے رسول کے دشمنوں سے دوستی کرتے ہوئے نہ دیکھو گے۔ خواہ وہ ان کے باپ یا بیٹے یا بھائی یا خاندان ہی کے لوگ ہوں۔ یہ وہ لوگ ہیں جن کے دلوں میں خدا نے ایمان (پتھر پر لکیر کی طرح) تحریر کردیا ہے اور فیض غیبی سے ان کی مدد کی ہے۔ اور وہ ان کو بہشتوں میں جن کے تلے نہریں بہہ رہی ہیں داخل کرے گا ہمیشہ ان میں رہیں گے۔ خدا ان سے خوش اور وہ خدا سے خوش۔ یہی گروہ خدا کا لشکر ہے۔ (اور) سن رکھو کہ خدا ہی کا لشکر مراد حاصل کرنے والا ہے ہےo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 58:1": "Албатта, Аллоҳ Сен билан ўз эри ҳақида тортишаётган ва Аллоҳга шикоят қилаётган (аёл)нинг сўзини эшитди.",
                            "verse 58:2": "Сизлардан ўз хотинларидан зиҳор қиладиганлар (билиб қўйсинларки), у(хотин)лар оналари эмас.",
                            "verse 58:3": "Хотинларидан зиҳор қилганлар ўз айтганларидан қайтсалар, (қайта) қўшилмасларидан аввал бир қул озод қилсинлар.",
                            "verse 58:4": "Ким (қул) топмаса, бас (қайта) қўшилмасдан аввал икки ой кетма-кет рўза тутсин.",
                            "verse 58:5": "Албатта, Аллоҳга ва Унинг Пайғамбарига душманлик қиладиганлар, улардан аввалгилар хор бўлганидек, хор бўлурлар.",
                            "verse 58:6": "Аллоҳ барчаларини қайта тирилтирадиган кунда, уларга қилган ишларининг хабарини берур.",
                            "verse 58:7": "Албатта, Аллоҳ осмонлару ердаги барча нарсаларни билишини англамадингми? Агар учтанинг сирли сўзлашуви бўлса, албатта, У зот тўртинчидир.",
                            "verse 58:8": "Сирли сўзлашувдан қайтарилганларни кўрмадингми?! Ман этилган ишга яна қайтурлар, гуноҳ ва душманлик-ла ва Пайғамбарга осий бўлиб, сирли сўзлашурлар.",
                            "verse 58:9": "Эй иймон келтирганлар! Қачон сирли суҳбат қилсангиз, гуноҳ, душманлик ва Пайғамбарга маъсиятга сирли суҳбат қилмангиз.",
                            "verse 58:10": "Албатта, иймонлиларни ранжитиш учун қилинган сирли суҳбат шайтондандур, Аллоҳнинг изни билан қилинган сирли суҳбатгина уларга ҳеч зарар етказмас.",
                            "verse 58:11": "Эй иймон келтирганлар! Агар сизларга мажлисларда силжиброқ ўтиринг, дейилса, бас, силжинг, агар туринг дейилса, туринг.",
                            "verse 58:12": "Эй иймон келтирганлар! Агар Пайғамбар билан сирли суҳбат қилмоқчи бўлсангиз, сирли суҳбатингиздан аввал садақа беринг.",
                            "verse 58:13": "Сизларга сирли суҳбатингиздан аввал садақа бериш оғир келдими.",
                            "verse 58:14": "Аллоҳнинг ғазабига дучор бўлган қавмни дўст тутганларни кўрмайсанми? Улар сизлардан ҳам эмас, улардан ҳам эмас.",
                            "verse 58:15": "Аллоҳ улар учун шиддатли азобни тайёрлаган.",
                            "verse 58:16": "Қасамларини ўзлари учун тўсиқ қилиб олдилар.",
                            "verse 58:17": "Моллари ҳам, болалари ҳам улардан Аллоҳ(азоби)дан ҳеч нарсани қайтара олмас.",
                            "verse 58:18": "Аллоҳ уларнинг барчасини қайта тирилтирадиган кунда худди сизларга қасам ичганларидек, Унга ҳам қасам ичарлар, ва бирор нарсага эришамиз, деб ўйларлар.",
                            "verse 58:19": "Шайтон уларни эгаллаб олган ва Аллоҳнинг зикрини унутдирган.",
                            "verse 58:20": "Албатта, Аллоҳга ва Унинг Расулига душманлик қилувчилар, ана ўшалар, энг хорлар ичидадир.",
                            "verse 58:21": "Аллоҳ, Мен ва Менинг Расулларим ғалаба қиламиз, деб ҳукм қилган.",
                            "verse 58:22": "Аллоҳга ва охират кунига иймон келтирган қавмнинг Аллоҳга ва Унинг Расулига душманлик қилувчиларга дўстлик қилганларини топмайсан."
                        }
                    }
                }
            }
        }
    }
}