{
    "id": 59,
    "name_simple": "Al-Hashr",
    "revelation_place": "madinah",
    "revelation_order": 101,
    "bismillah_pre": true,
    "verses_count": 24,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah derives its name from the mention of the word al-hashr in verse thereby implying that it is the Surah in which the word al-hashr has occurred.",
    "text": [
        "\n",
        "The Surah derives its name from the mention of the word al-hashr in verse thereby implying that it is the Surah in which the word al-hashr has occurred.",
        "\n",
        "Period of Revelation",
        "\n",
        "Bukhari and Muslim contain a tradition from Hadrat Sa'id bin Jubair to the effect \"When I asked Hadrat Abdullah bin Abbas about Surah Al-Hashr, he replied that it was sent down concerning the battle against the Bani an-Nadir just as Surah Al-Anfal was sent down concerning the Battle of Badr. In another tradition from Hadrat Sa'id bin Jubair, the words cited from Ibn Abbas (may Allah be pleased with him) are: Qul: Surah an-Nadir : Say, it is Surah an-Nadir.\" The same thing has been related also from Mujahid, Qatadah, Zuhri, Ibn Zaid, Yazid bin Ruman, Muhammad bin Ishaq and others. They are unanimous that the followers of the Book whose banishment has been mentioned in it, imply the Bani an-Nadir. Yazid bin Ruman, Mujahid and Muhammad bin Ishaq have stated that this whole Surah, from beginning to end, came down concerning this very battle.",
        "\n",
        "As for the question as to when this battle took place, Imam Zuhri has stated on the authority of Urwah bin Zubair that it took place six months after the Battle of Badr. However, Ibn Sa'd, Ibn Hisham and Baladhuri regard it as an event of Rabi' al-Awwal, A. H. 4, and the same is correct. For all traditions agree that this battle took place after the incident of Bi'r Ma'unah, and historically also it is well known that the incident of Bir Ma'unah occurred after the Battle of Uhud and not before it.",
        "\n",
        "Historical Background",
        "\n",
        "In order to understand the subject matter of this Surah well, it is necessary to have a look at the history of the Madinah and Hejaz Jews, for without it one cannot know precisely the real causes of the Holy Prophet's dealing with their different tribes the way he did.",
        "\n",
        "No authentic history of the Arabian Jews exists in the world. They have not left any writing of their own in the form of a book or a tablet which might throw light on their past, nor have the Jewish historians and writers of the non-Arab world made any mention of them, the reason being that after their settlement in the Arabian peninsula they had detached themselves from the main body of the nation, and the Jews of the world did not count them as among themselves. For they had given up Hebrew culture and language, even the names, and adopted Arabism instead. In the tablets that have been unearthed in the archaeological research in the Hejaz no trace of the Jews is found before the first century of the Christian era, except for a few Jewish names. Therefore, the history of the Arabian Jews is based mostly on the verbal traditions prevalent among the Arabs most of which bad been spread by the Jews themselves.",
        "\n",
        "The Jews of the Hejaz claimed that they had come to settle in Arabia during the last stage of the life of the Prophet Moses (peace be upon him). They said that the Prophet Moses had dispatched an army to expel the Amalekites from the land of Yathrib and had commanded it not to spare even a single soul of that tribe. The Israelite army carried out the Prophet's command, but spared the life of a handsome prince of the Amalekite king and returned with him to Palestine. By that time the Prophet Moses had passed sway. His successors took great exception to what the army had done, for by sparing the life of an Amalekite it had clearly disobeyed the Prophet and violated the Mosaic law. Consequently, they excluded the army from their community, and it had to return to Yathrib and settle there for ever.(Kitab al-Aghani, vol. xix, p. 94). Thus the Jews claimed that they had been living in Yathrib since about 1200 B.C. But, this had in fact no historical basis and probably the\r\nJews had invented this story in order to overawe the Arabs into believing that they were of noble lineage and the original inhabitants of the land.",
        "\n",
        "The second Jewish immigration, according to the Jews, took, place in 587 BC. when Nebuchadnezzer, the king of Babylon, destroyed Jerusalem and dispersed the Jews throughout the world. The Arab Jews said that several of their tribes at that time had come to settle in Wadi al-Qura, Taima, and Yathrib.(Al-Baladhuri, Futuh al-Buldan). But this too has no historical basis. By this also they might have wanted to prove that they were the original settlers of the area.",
        "\n",
        "As a matter of fact, what is established is that when in A. D. 70 the Romans massacred the Jews in Palestine, and then in A. D. 132 expelled them from that land, many of the Jewish tribes fled to find an asylum in the Hejaz, a territory that was contiguous to Palestine in the south. There, they settled wherever they found water springs and greenery, and then by intrigue and through money lending business gradually occupied the fertile lands. Ailah, Maqna, Tabuk, Taima, Wadi al Qura, Fadak and Khaiber came under their control in that very period, and Bani Quraizah, Bani al-Nadir, Bani Bahdal, and Bani Qainuqa also came in the same period and occupied Yathrib.",
        "\n",
        "Among the tribes that settled in Yathrib the Bani al Nadir and the Bani Quraizah were more prominent for they belonged to the Cohen or priest class. They were looked upon as of noble descent and enjoyed religious leadership among their co- religionists. When they came to settle in Madinah there were some other tribes living there before, whom they subdued and became practically the owners of this green and fertile land. About three centuries later, in A. D. 450 or 451, the great flood of Yemen occurred which has been mentioned in vv. 16-17 of Surah Saba above. As a result of this different tribes of the people of Saba were compelled to leave Yemen and disperse in different parts of Arabia. Thus, the Bani Ghassan went to settle in Syria, Bani Lakhm in Hirah (Iraq), Bani Khuzaah between Jeddah and Makkah and the Aus and the Khazraj went to settle in Yathrib. As Yathrib was under Jewish domination, they at first did not allow the Aus and the Khazraj to gain a footing and the two\r\nArab tribes had to settle on lands that had not yet been brought under cultivation, where they could hardly produce just enough to enable them to survive. At last, one of their chiefs went to Syria to ask for the assistance of their Ghassanide brothers; he brought an army from there and broke the power of the Jews. Thus, the Aus and the Khazraj were able to gain complete dominance over Yathrib, with the result that two of the major Jewish tribes, Bani an-Nadir and Bani Quraizaha were forced to take quarters outside the city. Since the third tribe, Bani Qainuqa, was not on friendly terms with the other two tribes, it stayed inside the city as usual, but had to seek protection of the Khazraj tribe. As a counter measure to this Bani an Nadir and Bani Quraizah took protection of the Aus tribe so that they could live in peace in the suburbs of Yathrib.",
        "\n",
        "Before the Holy Prophet's arrival at Madinah until his emigration the following were the main features of the Jews position in Hejaz in general and in Yathrib in particular:",
        "\n",
        "\n\nIn the matter of language, dress, civilization and way of life they had completely adopted Arabism, even their names had become Arabian. Of the 12 Jewish tribes that had settled in Hejaz, none except the Bani Zaura retained its Hebrew name. Except for a few scattered scholars none knew Hebrew. In fact, there is nothing in the poetry of the Jewish poets of the pre-Islamic days to distinguish it from the poetry of the Arab poets in language, ideas and themes. They even inter-married with the Arabs. In fact, nothing distinguished them from the common Arabs except religion. Notwithstanding this, they had not lost their identity among the Arabs and had kept their Jewish prejudice alive most ardently and jealously. They had adopted superficial Arabism because they could not survive in Arabia without it.\n\n\nBecause of this Arabism the western orientalists have been misled into thinking that perhaps they were not really Israelites but Arabs who had embraced Judaism, or that at least majority of them consisted of the Arab Jews. But there is no historical proof to show that the Jews ever engaged in any proselytizing activities in Hejaz, or their rabbis invited the Arabs to embrace Judaism like the Christian priests and missionaries. On the contrary, we see that they prided themselves upon their Israelite descent and racial prejudices. They called the Arabs the Gentiles, which did not mean illiterate or uneducated but savage and uncivilized people. They believed that the Gentiles did not possess any human rights; these were only reserved for the Israelites, and therefore, it was lawful and right for the Israelites to defraud them of their properties by every fair and foul means. Apart from the Arab chiefs, they did not consider the common Arabs fit enough to have equal status with\r\n    them even if they entered Judaism. No historical proof is available, nor is there any evidence in the Arabian traditions, that some Arab tribe or prominent clan might have accepted Judaism. However, mention has been made of some individuals, who had become Jews. The Jews, however, were more interested in their trade and business than in the preaching of their religion. That is why Judaism did not spread as a religion and creed in Hejaz but remained only as a mark of pride and distinction of a few Israelite tribes. The Jewish rabbis, however, had a flourishing business in granting amulets and charms, fortune telling and sorcery, because of which they were held in great awe by the Arabs for their \"knowledge\" and practical wisdom.\n\n\nEconomically they were much stronger than the Arabs. Since they bad emigrated from more civilized and culturally advanced countries of Palestine and Syria, they knew many such arts as were unknown to the Arabs; they also enjoyed trade relations with the outside world. Hence, they had captured the business of importing grain in Yathrib and the upper Hejaz and exporting dried dates to other countries. Poultry farming and fishing also were mostly under their controls They were good at cloth weaving too. They had also set up wine shops here and there, where they sold wine which they imported from Syria. The Bani Qainuqa generally practiced crafts such as that of the goldsmith, blacksmith and vessel maker. In all these occupations, trade and business these Jews earned exorbitant profits, but their chief occupation was trading in money lending in which they had ensnared the Arabs of the surrounding areas. More particularly the chiefs and elders of the Arab tribes who were given to\r\n    a life of pomp, bragging and boasting on the strength of borrowed money were deeply indebted to them. They lent money on high rates of interest and then would charge compound interest, which one could hardly clear off once one was involved in it. Thus, they had rendered the Arabs economically hollow, but it had naturally induced a deep rooted hatred among the common Arabs against the Jews.\n\n\nThe demand of their trade and economic interests was that they should neither estrange one Arab tribe by befriending another, nor take part in their mutual wars. But, on the other hand, it was also in their interests, that they should not allow the Arabs to be united and should keep them fighting and entrenched against each other, for they knew that whenever the Arab tribes united, they would not allow them to remain in possession of their 1large properties, gardens and fertile lands, which they had come to own through their profiteering and money lending business. Furthermore, each of their tribes also had to enter into alliance with one or another powerful Arab tribe for the sake of its own protection so that no other powerful tribe should overawe it by its might. Because of this they had not only to take part in the mutual wars of the Arabs but they often had to go to war in support of the Arab tribe to which their tribe was tied in alliance against another Jewish tribe\r\n    which was allied to the enemy tribe. In Yathrib the Bani Quraizah and the Bani an-Nadir were the allies of the Aus while the Bani Qainuqa of the Khazraj. A little before the Holy Prophet's emigration, these Jewish tribes had confronted each other in support of their respective allies in the bloody war that took place between the Aus and the Khazraj at Buath.\n\n",
        "\n",
        "Such were the conditions when Islam came to Madinah, and ultimately an Islamic State came into existence after the Holy Prophet's (upon whom be Allah's peace) arrival there. One of the first things that he accomplished soon after establishing this state was unification of the Aus and the Khazraj and the Emigrants into a brotherhood, and the second was that he concluded a treaty between the Muslims and the Jews on definite conditions, in which it was pledged that neither party would encroach on the rights of the other, and both would unite in a joint defense against the external enemies. Some important clauses of this treaty are as follows, which clearly show what the Jews and the Muslims had pledged to adhere to in their mutual relationship:",
        "\n",
        "\"The Jews must bear their expenses and the Muslims their expenses. Each must help the other against anyone who attacks the people of this document. They must seek mutual advice and consultation, and loyalty is a protection against treachery. They shall sincerely wish one another well. Their relations will be governed by piety and recognition of the rights of others, and not by sin and wrongdoing. The wronged must be helped. The Jews must pay with the believers so long as the war lasts. Yathrib shall be a sanctuary for the people of this document. If any dispute or controversy likely to cause trouble should arise, it must be referred to God and to Muhammad the Apostle of God; Quraish and their helpers shall not be given protection. The contracting parties are bound to help one another against any attack on Yathrib; Every one shall be responsible for the defense of the portion to which he belongs\" (lbn Hisham, vol. ii, pp. 147 to 150).",
        "\n",
        "This was on absolute and definitive covenant to the conditions of which the Jews themselves had agreed. But not very long after this they began to show hostility towards the Holy Prophet of Allah (upon whom be Allah's peace) and Islam and the Muslims, and their hostility and perverseness went on increasing day by day. Its main causes were three:",
        "\n",
        "First, they envisaged the Holy Prophet (upon whom be Allah's peace) merely as a chief of his people, who should be content to have concluded a political agreement with them and should only concern himself with the worldly interests of his group. But they found that he was extending an invitation to belief in Allah and the Prophethood and the Book (which also included belief in their own Prophets and scriptures), and was urging the people to give up disobedience of Allah and adopt obedience to the Divine Commands and abide by the moral laws of their own prophets. This they could not put up with. They feared that if this universal ideological movement gained momentum it would destroy their rigid religiosity and wipe out their racial nationhood.",
        "\n",
        "Second, when they saw that the Aus and the Khazraj and the Emigrants were uniting into a brotherhood and the people from the Arab tribes of the surrounding areas, who entered Islam, were also joining this Islamic Brotherhood of Madinah and forming a religious community, they feared that the selfish policy that they had been following of sowing discord between the Arab tribes for the promotion of their own well being and interests for centuries, would not work in the new system, but they would face a united front of the Arabs against which their intrigues and machinations would not succeed.",
        "\n",
        "Third, the work that the Holy Messenger of Allah (upon whom be Allah's 'peace) was carrying out of reforming the society and civilization included putting an end to all unlawful methods\" in business and mutual dealings. More than that; he had declared taking and giving of interest also as impure and unlawful earning. This caused them the fear that if his rule became established in Arabia, he would declare interest legally forbidden, and in this they saw their own economic disaster and death.",
        "\n",
        "For these reasons they made resistance and opposition to the Holy Prophet their national ideal. They would never hesitate to employ any trick and machination, any device and cunning, to harm him. They spread every kind of falsehood so as to cause distrust against him in the people's minds. They created every kind of doubt, suspicion and misgiving in the hearts of the new converts so as to turn them back from Islam. They would make false profession of Islam and then would turn apostate so that it may engender more and more misunderstandings among the people against Islam and the Holy Prophet (upon whom be Allah's peace). They would conspire with the hypocrites to create mischief and would cooperate with every group and tribe hostile to Islam. They would create rifts between the Muslims and would do whatever they could to stir them up to mutual feuds and fighting. The people of the Aus and the Khazraj tribes were their special target, with whom they had been allied for centuries.\r\nMaking mention of the war of Buath before them they would remind them of their previous enmities so that they might again resort to the sword against each other and shatter their bond of fraternity into which Islam had bound them. They would resort to every kind of deceit and fraud in order to harm the Muslims economically. Whenever one of those with whom that had business dealings, would accept Islam, they would do whatever they could to cause him financial loss. If he owed them something they would worry and harass him by making repeated demands, and if they owed him something, they would withhold the payment and would publicly say that at the time the bargain was made he professed a different religion, and since he had changed his religion, they were no longer under any obligation towards him. Several instances of this nature have been cited in the explanation of verse 75 of Surah Al Imran given in the commentaries by Tabari, Nisaburi, Tabrisi and in Ruh al Ma'ani.",
        "\n",
        "They had adopted this hostile attitude against the covenant even before the Battle of Badr. But when the Holy Prophet (upon whom be Allah's peace) and the Muslims won a decisive victory over the Quraish at Badr, they were filled with grief and anguish, malice and anger. They were in fact anticipating that in that war the powerful Quraish would deal a death blow to the Muslims. That is why even before the news of the Islamic victory reached Madinah they had begun to spread the rumor that the Holy Prophet (upon whom be Allah's peace) had fallen a martyr and the Muslims had been routed, and the Quraish army under Abu Jahl was advancing on Madinah. But when the battle was decided against their hopes and wishes, they burst with anger and grief. Ka'b bin Ashraf, the chief of the Bani an-Nadir, cried out:\"By God, if Muhammad has actually killed these nobles of Arabia, the earth's belly would be better for us than its back.\" Then he went to Makkah and incited the people to vengeance by\r\nwriting and reciting provocative elegies for the Quraish chiefs killed at Badr. Then he returned to Madinah and composed lyrical verses of an insulting nature about the Muslim women. At last, enraged with his mischief, the Holy Prophet (upon whom be Allah's peace) sent Muhammad bin Maslamah Ansari in Rabi al-Awwal, A. H. 3, and had him slain. (Ibn Sad, Ibn Hisham, Tabari).",
        "\n",
        "The first Jewish tribe which, after the Battle of Badr, openly and collectively broke their covenant were the Bani Qainuqa. They lived in a locality inside the city of Madinah. As they practiced the crafts of the goldsmith, blacksmith and vessel maker, the people of Madinah had to visit their shops fairly frequently. They were proud of their bravery and valor. Being blacksmiths by profession even their children were well armed, and they could instantly muster 700 fighting men from among themselves. They were also arrogantly aware that they enjoyed relations of confederacy with the Khazraj and Abdullah bin Ubbay, the chief of the, Khazraj, was their chief supporter. At the victory of Badr, they became so provoked that they began to trouble and harass the Muslims and their women in particular, who visited their shops. By and by things came to such a pass that one day a Muslim woman was stripped naked publicly in their bazaar. This led to a brawl in which a Muslim and a Jew were\r\nkilled. Thereupon the Holy Prophet (upon whom be Allah's peace) himself visited their locality, got them together and counseled them on decent conduct. But the reply that they gave was; \"O Muhammad, you perhaps think we are like the Quraish. They did not know fighting; therefore, you overpowered them. But when you come in contact with us, you will see how men fight.\" This was in clear words a declaration of war. Consequently, the Holy Prophet (upon whom be Allah's peace) laid siege to their quarters towards the end of Shawwal (and according to some others, of Dhi Qa'dah) A. H. 2. The siege had hardly lasted for a fortnight when they surrendered and all their fighting men were tied and taken prisoners. Now Abdullah bin Ubayy came up in support of them and insisted that they should be pardoned. The Holy Prophet conceded his request and decided that the Bani Qainuqa would be exiled from Madinah leaving their properties, armor and tools of trade behind. (Ibn Sa'd, Ibn Hisham,\r\nTarikh Tabari).",
        "\n",
        "For some time after these punitive measures (i. e. the banishment of the Qainuqa and killing of Ka'b bin Ashraf the Jews remained so terror stricken that they did not dare commit any further mischief. But later when in Shawwal, A. H. 3, the Quraish in order to avenge themselves for the defeat at Badr, marched against Madinah with great preparations, and the Jews saw that only a thousand men had marched out with the Holy Prophet (upon whom be Allah's peace) as against three thousand men of the Quraish, and even they were deserted by 300 hypocrites who returned to Madinah, they committed the first and open breach of the treaty by refusing to join the Holy Prophet in the defense of the city although they were bound to it. Then, when in the Battle of Uhud the Muslims suffered reverses, they were further emboldened. So much so that the Bani an-Nadir made a secret plan to kill the Holy Prophet (upon whom be Allah's peace) though the plan failed before it could be executed. According\r\nto the details, after the incident of Bi'r Maunah (Safar, A. H. 4) Amr bin Umayyah Damri slew by mistake two men of the Bani Amir in retaliation, who actually belonged to a tribe which was allied to the Muslims, but Amr had mistaken them for the men of the enemy. Because of this mistake their blood money became obligatory on the Muslims. Since the Bani an-Nadir were also a party in the alliance with the Bani Amir, the Holy Prophet (upon whom be Allah's peace) went to their clan along with some of his Companions to ask for their help in paying the blood money. Outwardly they agreed to contribute, as he wished, but secretly they plotted that a person should go up to the top of the house by whose wall the Holy Prophet was sitting and drop a rock on him to kill him. But before they could execute their plan, he was informed in time and be immediately got up and returned to Madinah.",
        "\n",
        "Now there was no question of showing them any further concession. The Holy Prophet at once sent to them the ultimatum that the treachery they had meditated against him had come to his knowledge; therefore, they were to leave Madinah within ten days; if anyone of them was found staying behind in their quarters, he would be put to the sword. Meanwhile Abdullah bin Ubayy sent them the message that he would help them with two thousand men and that the Bani Quraizah and Bani Ghatafan also would come to their aid; therefore, they should stand firm and should not go. On this false assurance they responded to the Holy Prophet's ultimatum saying that they would not leave Madinah and he could do whatever was in his power. Consequently, in Rabi' al-Awwal, A. H. 4, the Holy Prophet (upon whom be Allah's peace) laid siege to them, and after a few days of the siege (which according to some traditions were 6 and according to others 15 days) they agreed to leave Madinah on the condition that\r\nthey could retain all their property which they could carry on thee camels, except the armor. Thus, Madinah was rid of this second mischievous tribe of Jews. Only two of the Bani an-Nadir became Muslims and stayed behind. Others went to Syria and Khaiber.",
        "\n",
        "This is the event that has been discussed in this Surah.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "The theme of the Surah as stated above, is an appraisal of the battle against the Bani an Nadir. In this, on the whole, four things have been discussed.",
        "\n",
        "\n\nIn the first four verses the world has been, admonished to take heed of the fate that had just befallen the Bani an-Nadir. A major tribe which was as strong in numbers as the Muslims, whose people boasted of far more wealth and possession who were by no means ill equipped militarily and whose forts were well fortified could not stand siege even for a few Days, and expressed their readiness to accept banishment from their centuries old, well established settlement even though not a single man from among them was slain. Allah says that this happened not because of any power possessed by the Muslims but because the Jews had tried to resist and fight Allah and His Messenger, and those who dare to resist the power of Allah, always meet with the same fate.\n\n\nIn verse 5, the rule of the law of war that has been enunciated is: the destruction caused in the enemy territory for military purposes does not come under \"spreading mischief in the earth.\"\n\n\nIn vv. 6-10 it has been stated how the lands and properties which come under the control of the Islamic State as a result of war or peace terms, are to be managed. As it was the first ever occasion that the Muslims took control of a conquered territory, the law concerning it was laid down for their guidance.\n\n\nIn vv. 11-17 the attitude that the hypocrites had adopted on the occasion of the battle against the Bani an-Nadir has been reviewed and the causes underlying it have been pointed out.\n\n\nThe whole of the last section (vv. 18-24) is an admonition for all those people who had professed to have affirmed the faith and joined the Muslim community, but were devoid of the true spirit of the faith. In it they have been told what is the real demand of the Faith, what is the real difference between piety and wickedness, what is the place and importance of the Quran which they professed to believe in, and what are the attributes of God in Whom they claimed to have believed.\n\n",
        ";\r\n"
    ],
    "description": "The surah that mentions The Banishment, God’s expulsion, of the clan of Banū al-Naḍīr from their prodigious fortress-settlement near Medina, in the mustering it calls the first of its kind: for they had betrayed their covenant of mutual defence by aiding idolaters against monotheistic believers. It takes its name from the “banishment” or “gathering of forces” (ḥashr) of the Jewish tribe from Medina, which is mentioned in verse 2. The Banū al-Naḍīr, who originally agreed with the Prophet that they would fight neither for nor against him, yet, after the Meccan defeat of the Muslims in the Battle of Uḥud (year 3/625), made an alliance with the Meccans. They also tried to kill the Prophet while he was in their area. He asked them to leave and they agreed, but Ibn Ubayy, the head of the “hypocrites” of Medina, promised them that, if they fought the Muslims, he and his camp would fight with them (verse 11 .), and, if they had to leave Medina, he and his camp would leave with them. Because the Banū al-Naḍīr had repeatedly broken their agreements, the Muslims besieged them in Medina (in year 4/626), Ibn Ubayy did not keep his promise, and the Banū al-Naḍīr agreed to leave, some going to Syria and some to Khaybar. In this surah, God stresses that any gains were His doing and so should be distributed in accordance with His instructions (verse 6 .). The end of the surah, consequently, emphasizes obedience and awe towards God (verse 21 .).The surah is also known as: Confrontation, Exile, The Fathering, The Gathering, The Gathering (of Forces), The Mustering.",
    "name_translation": "THE BANISHMENT",
    "name_complex": "Al-Hashr",
    "surah_name_ar": "الحشر",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 59:1": "Perëndinë e falenderon çdo gjë në qiej dhe çdo gjë në Tokë.",
                            "verse 59:2": "Ai është që i ka dëbuar për here të pare prej shtëpive të tyre, ata të cilët nuk kanë besuar Librin; ju nuk keni menduar se ata do të shkojnë, kurse ata kanë menduar se kështjellat e tyre do t’i mbrojnë nga dënimet e Perëndisë, por dënimi i Perëndisë u ka ardhur prej nga ata nuk e kanë pritur, dhe Ai në zemrat e tyre ka mbjellë frikë; e, ata, me duart e tyre dhe me duart e besimtarëve i kanë shkatërruar shtëpitë e veta.",
                            "verse 59:3": "Sikur mos ta kishte caktuar Perëndia ndjekjen e tyre, Ai do t’i kishte dënuar në këtë jetë, por ata në jetën tjetër i pret dënimi në zjarr,",
                            "verse 59:4": "sepse, ata e kanë kundërshtuar Perëndinë dhe Profetin e Tij; e ai që kundërshton Perëndinë, Perëndia, me të vërtetë, do t’i dënojë ashpër.",
                            "verse 59:5": "Ato palme hurmesh që i keni prerë ju ose i keni lënë të qëndrojnë vertikalisht – i keni bërë me miratimin e Perëndisë dhe që Ai (Perëndia) t’i poshtërojë ngatërrestarët.",
                            "verse 59:6": "E, atë që Perëndia ia ka dhuruar (kthyer prej ngatërrestarëve) Profetit të Vet, e që ju nuk e keni marrë si plaçkë me sulmim as të kuajve as të deeve, por që, Perëndia i jep pushtet profetëve të Vet mbi ata që Ai dëshiron.",
                            "verse 59:7": "Pasuria e mbetur e fshatrave, të cilën Perëndia ia ka dhuruar Profetit të Tij, u takon: Perëndisë dhe Profetit të Tij, dhe të afërmëve të tij (Pejgamberit), bonjakëve, të varfërve, dhe udhëtarëve të rastit, - në mënyrë që të mos bie prej dorës në dorë të pasanikëve tuaj; atë që ua jep Profeti (si shpërblim), atë merreni, e atë çka ua ndalon, lënie; dhe ruajuni (mos i kundërshtoni) Perëndisë, sepse, Perëndia, me të vërtetë, dënon ashpër,",
                            "verse 59:8": "(ajo pasuri u takon) edhe emigrantëve të varfër, të cilët janë përzënë nga vendlindja e tyre dhe pasurisë së tyre, të cilët ëshirojnë mirësinë dhe kënaqësinë e Perëndisë, dhe ta ndihmojnë Perëndinë dhe Profetin e Tij, ata, me të vërtetë, janë besimtarë të sinqertë, -",
                            "verse 59:9": "dhe (u takon pasuria) atyre që e kanë bërë Medinen vendstrehim (shtëpi) të besimit qysh më parë (para emigrimit), e i duan ata që vijnë në Medine dhe në zemrat e tyre nuk ndjejnë kurrfarë rëndimi, për atë që u është dhënë atyre (ardhacakëve), por më tepër duan t’u bëjnë mirë atyre se sa vetes, edhe pse madje vetë janë nevojtarë.",
                            "verse 59:10": "Edhe ata që vijnë pas tyre – thonë: “O Zoti ynë, falna neve dhe vëllezërit tanë, të cilët kanë besuar para nesh dhe mos lejo që në zemrat tona të ketë asnjë të keqe ndaj besimtarëve; O Zoti ynë, Ti je, me të vërtetë, i mirë dhe mëshirues!”",
                            "verse 59:11": "A nuk po sheh se si hipokritët ju thonë shokëve të vet, të cilët janë ithtarë të Librit, e që nuk besojnë: “Nëse ju dëbojnë, ne do të dalim me ju dhe kurrkujt – asnjëherë, nuk do t’i përulemi kundër jush; e nëse ju sulmoheni, me siguri, do t’u dalim në ndihmë”, - e, Perëndia dëshmon, se ata, me të vërtetë, janë gënjeshtarë:",
                            "verse 59:12": "nëse do të jenë të dëbuar, ata nuk do të shkojnë me ta; nëse do të jenë të sulmuar, ata nuk do t’i dalin në ndihmë; e nëse u dalin në ndihmë, sigurisht do të ikin, dhe ata do të ngelin pa ndihmë (përgjithmonë).",
                            "verse 59:13": "Ju, në zemrat e tyre jeni më të tmerrshëm (frikësues) se sa Perëndia, ngase ata janë popull i pakuptueshëm.",
                            "verse 59:14": "Ata luftojnë me ju duke qenë grumbull vetëm në vende të fortifikuara, ose pas mureve.",
                            "verse 59:15": "Këta janë të ngjashëm me ata që kanë qenë pak para tyre, që e kanë shijuar dënimin e punës së tyre – ata i pret dënimi i dhembshëm!",
                            "verse 59:16": "Janë të ngjashëm ata me djallin kur i thotë njeriut: “Mos beso!” – e kur bëhet mohues, atëherë ai i thotë: “Unë jam larg prej teje, unë, me të vërtetë, i frikohem Perëndisë, Zotit të gjithësisë!”",
                            "verse 59:17": "Fundi i këtyre të dyve, me të vërtetë, është qëndrimi i përhershëm në zjarr, e ky është dënimi për të gjithë njerëzit e këqinj.",
                            "verse 59:18": "O besimtarë, druajuni Perëndisë, dhe çdo njeri le të shikojë se ç’ka përgatitur për të nesërmen, duke mos e kundërshtuar Perëndinë, sepse, Ai di çdo gjë që punoni ju.",
                            "verse 59:19": "Dhe mos u bëni si ata që duke i harruar urdhërat e Perëndisë, Ai (Perëndia) i ka shpie ata që të harrojnë edhe vetveten; ata janë mëkatarë të vërtetë.",
                            "verse 59:20": "Nuk janë të barabartë banorët e xhehennemit dhe banorët e xhennetit; bnorët e xhennetit do të jenë fitues.",
                            "verse 59:21": "Sikur këtë Kur’an t’ia shpallim ndonjë mali, ti do ta shihje atë të përulur dhe të copëtuar nga frika e Perëndisë.",
                            "verse 59:22": "Ai është Perëndia, që s’ka zot tjetër përveç Tij.",
                            "verse 59:23": "Ai është Perëndia, që s’ka zot tjetër përveç Tij, Sundues, i Amshueshëm, Ai është i pastër nga të metat, Paqëdashës, ai që jep siguri, Ai që mbikëqyrë të gjitha, i Plotëfuqishëm, Imponus, Madhështor.",
                            "verse 59:24": "Ai është Perëndia, Krijues, Ai që prej asgjëje krijon, Ai që çdo gjëje ia jep formën, ai posedon emërat më të bukur, Atë e falenderojnë të gjithë (çka ekziston) në qiej dhe në Tokë, Ai është i Plotëfuqishëm dhe i Gjithëdijshëm."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Göylərdə və yerdə nə varsa, (hamısı) Allahı təqdis edib şə'ninə tə'riflər deyər.",
                            "verse 59:2": "Kitab əhlindən kafir olanları (Mədinə ətrafında yaşayıb Muhəmməd əleyhissəlamın peyğəmbərliyini inkar edən Bəni Nəzir qəbiləsini) ilk dəfə (bir yerə) toplayıb öz yurdundan çıxardan (Şama sürgün edən) Odur.",
                            "verse 59:3": "Əgər Allah onlara (yurdlarından çıxardılıb) sürgün olunmağı hökm etməsəydi, onları dünyada mütləq (başqa bir) əzaba düçar edərdi.",
                            "verse 59:4": "Bu onların Allaha və Onun Peyğəmbərinə asi olmalarına görədir.",
                            "verse 59:5": "(Ey mö'minlər! Sizin kafirlərə məxsus olan) hər hansı bir xurma ağacını kəsməyiniz, yaxud (toxunmayıb) onu kökü üstündə salamat qoymağınız Allahın iznilədir.",
                            "verse 59:6": "(Ey mö'minlər!) Allahın onların (Bəni Nəzər qəbiləsinin) mallarından ?z Peyğəmbərinə verdiyi qənimət üçün siz onların üstünə nə at, nə də dəvə sürdünüz.",
                            "verse 59:7": "Allah ?z Peyğəmbərinə (fəth olunmuş) məmləkətlərin əhalisindən (dinc yolla) verdiyi qənimət Allaha, Peyğəmbərə, (Muhəmməd əleyhissəlama yaxın olan) qohum-əqrabaya, yetimlərə, yoxsullara və (pulu qurtarıb yolda qalan) müsafirə (yolçulara) məxsusdur.",
                            "verse 59:8": "(Bu qənimət) yurdlarından qovulub çıxardılmış, Allahdan mərhəmət və riza diləyən, Allaha və Onun Peyğəmbərinə kömək edən yoxsul mühacirlərə məxsusdur.",
                            "verse 59:9": "Onlardan (mühacirlərdən) əvvəl (Mədinədə) yurd salmış və (Muhəmməd əleyhissəlama qəlbən) iman gətirirmiş kimsələr (ənsar) öz yanlarına (şəhərlərinə) mühacirət edənləri sevər, onlara verilən qənimətə görə ürəklərində həsəd (qəzəb) duymaz, özləri ehtiyac içində olsalar belə, onları özlərindən üstün tutarlar.",
                            "verse 59:10": "Onlardan (mühacirlərdən və ənsarlardan) sonra gələnlər belə deyirlər: \"Ey Rəbbimiz! Bizi və bizdən əvvəlki iman gətirmiş (din) qardaşlarımızı bağışla.",
                            "verse 59:11": "(Ya Peyğəmbər) Məgər kitab əhlindən kafir olan qardaşlarına: \"Əgər (siz öz yurdunuzdan) çıxarılsanız, biz də sizinlə birlikdə mütləq (yurdumuzdan) çıxacaq, sizin əleyhinizə heç vaxt heç kəsə qoşulub tabe olmayacağıq.",
                            "verse 59:12": "And olsun ki, əgər onlar (Bəni Nəzər qəbiləsi) yurdlarından çıxarılsalar, (münafiqlər) onlarla birlikdə (öz yurdlarından) çıxmazlar.",
                            "verse 59:13": "(Ey mö'minlər!) Onların (münafiqlərlə yəhudilərin) ürəklərinə qorxu salan Allahdan çox sizsiniz.",
                            "verse 59:14": "Onlar (münafiqlərlə yəhudilər) hamılıqla sizə qarşı ancaq möhkəm şəhərlərdə (kəndlərdə), yaxud divar arxasında (qala içərisində) olarkən döyüşərlər (başqa şəraitdə sizinlə vuruşmağa cür'ət etməzlər).",
                            "verse 59:15": "Onlar özlərindən bir az əvvəl əməllərinin cəzasını (dünyada) dadmış kimsələrə (Bədrdə məğlub olmuş Məkkə müşriklərinə) bənzəyirlər.",
                            "verse 59:16": "(Münafiqlər Bəni Nəzir yəhudilərini aldatması) Şeytana (Şeytanın insanı aldatmasına) bənzəyir.",
                            "verse 59:17": "Onların hər ikisinin (Şeytanla onun aldatdığı adamın, eləcə də münafiqlərlə Bəni Nəzir qəbiləsinin) aqibəti cəhənnəm odu içində həmişəlik qalmaqdır.",
                            "verse 59:18": "Ey iman gətirənlər! Allahdan qorxun! Hər kəs sabah üçün nə etdiyinə (axirət üçün özünə nə hazırladığına) nəzər salsın.",
                            "verse 59:19": "Allahı unutduları üçün Allahın da onları özlərinə unutdurduğu (xeyirlərini başa düşməyən) kimsələrə bənzəməyin! Onlar (Allahın itaətindən çıxmış) fasiqlərdir!",
                            "verse 59:20": "Cəhənnəm əhli ilə cənnət əhli eyni ola bilməz.",
                            "verse 59:21": "(Ya Peyğəmbər!) Əgər Biz bu Qur'anı bir dağa nazil etsəydik, sən onun Allahın qorxusundan (kiçildiyini) parça-parça olduğunu görərdin (halbuki ağıl və ruh sahibi olan insan onun öyüd-nəsihətlərindən ibrət almır).",
                            "verse 59:22": "O ?zündən başqa heç bir tanrı olmayan, gizlini də, aşkarı da bilən Allahdır.",
                            "verse 59:23": "O ?zündən başqa heç bir tanrı (mə'bud) olmayan, (bütün məxluqatın) ixtiyar sahibi, müqəddəs (pak) olan, (bəndələrinə) salamatlıq, əmin-amanlıq bəxş edən, (hər şeydən) göz-qulaq olub (onu) qoruyan, yenilməz qüdrət (qüvvət) sahibi, (hamını istədiyi hər hansı bir şeyə) məcbur etməyə qadir olan, (hər şeydən) böyük (hər şeyin fövqündə) olan Allahdır.",
                            "verse 59:24": "O, (hər şeyi) yaradan, yoxdan var edən, (hər şeyə) surət verən Allahdır."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Allaha hvali sve što je na nebesima i što je na Zemlji.",
                            "verse 59:2": "On je prilikom prvog progonstva iz domova njihovih protjerao one sljedbenike Knjige koji nisu vjerovali.",
                            "verse 59:3": "Da nije bio već odredio da će biti protjerani, Allah bi ih još na ovome svijetu kaznio; ali, njih na onome svijetu čeka patnja u ognju",
                            "verse 59:4": "zato što su se Allahu i Poslaniku Njegovu suprotstavljali; a onoga ko se Allahu suprotstavi Allah će, zaista, strahovito kazniti.",
                            "verse 59:5": "To što ste neke palme posjekli ili ih da uspravno stoje ostavili - Allahovom voljom ste učinili, i zato da On nevjernike ponizi.",
                            "verse 59:6": "A vi niste kasom tjerali ni konje ni kamile radi onoga što je Allah od njih, kao plijen, darovao Poslaniku Svome, nego, Allah prepušta vlast poslanicima Svojim nad onima nad kojima On hoće; Allah sve može.",
                            "verse 59:7": "Plijen od stanovnika sela i gradova koji Allah Poslaniku Svome daruje pripada: Allahu i Poslaniku Njegovu, i bližnjim njegovim, i siročadi, i siromasima, i putnicima-namjernicima - da ne bi prelazilo iz ruku u ruke bogataša vaših; ono",
                            "verse 59:8": "i siromašnim muhadžirima koji su iz rodnog kraja svoga protjerani i imovine svoje lišeni, koji žele da Allahovu milost i naklonost steknu, i Allaha i Poslanika Njegova pomognu - to su, zaista, pravi vjernici -",
                            "verse 59:9": "i onima koji su Medinu za življenje izabrali i domom prave vjere još prije njih je učinili; oni vole one koji im se doseljavaju i u grudima svojim nikakvu tegobu, zato što im se daje, ne osjećaju, i više vole njima nego sebi,",
                            "verse 59:10": "Oni koji poslije njih dolaze - govore: \"Gospodaru naš, oprosti nama i braći našoj koja su nas u vjeri pretekla i ne dopusti da u srcima našim bude imalo zlobe prema vjernicima; Gospodaru naš, ti si, zaista, dobar i milostiv!\"",
                            "verse 59:11": "Zar ne vidiš kako licemjeri govore svojim prijateljima, sljedbenicima Knjige koji ne vjeruju: \"Ako budete protjerani, mi ćemo, sigurno, s vama poći i kad se bude ticalo vas, nikada se nikome nećemo pokoriti; a ako budete napadnuti, sig",
                            "verse 59:12": "ako bi bili protjerani, oni ne bi s njima pošli; ako bi bili napadnuti, oni im ne bi u pomoć pritekli; a ako bi im u pomoć pritekli, sigurno bi pobjegli, i oni bi bez pomoći ostali.",
                            "verse 59:13": "Oni se više boje vas nego Allaha, zato što su oni ljudi nerazumni.",
                            "verse 59:14": "Samo u utvrđenim gradovima ili iza zidina, oni se protiv vas smiju skupno boriti.",
                            "verse 59:15": "Slični su onima koji su, tu nedavno, svu pogubnost postupaka svojih iskusili - njih čeka nesnosna patnja;",
                            "verse 59:16": "slični su šejtanu kad kaže čovjeku: \"Budi nevjernik!\" - pa kad on postane nevjernik, on onda rekne: \"Ti se mene više ne tičeš, ja se, zaista, Allaha, Gospodara svjetova, bojim!\"",
                            "verse 59:17": "Obojicu ih na kraju čeka vatra, u kojoj će vječno boraviti, a to će biti kazna za sve nevjernike.",
                            "verse 59:18": "O vjernici, Allaha se bojte, i neka svaki čovjek gleda šta je za sutra pripremio i Allaha se bojte jer On dobro zna šta radite.",
                            "verse 59:19": "I ne budite kao oni koji su zaboravili Allaha, pa je On učinio da sami sebe zaborave; to su pravi grješnici.",
                            "verse 59:20": "Nisu jednaki stanovnici Džehennema i stanovnici Dženneta; stanovnici Dženneta će ono što žele postići.",
                            "verse 59:21": "Da ovaj Kur’an kakvom brdu objavimo, ti bi vidio kako je strahopoštovanja puno i kako bi se od straha pred Allahom raspalo.",
                            "verse 59:22": "On je Allah - nema drugog boga osim Njega - On je poznavalac nevidljivog i vidljivog svijeta, On je Milostivi, Samilosni!",
                            "verse 59:23": "On je Allah - nema drugog boga osim Njega, Vladar, Sveti, Onaj koji je bez nedostataka, Onaj koji svakoga osigurava, Onaj koji nad svi bdi, Silni, Uzvišeni, Gordi.",
                            "verse 59:24": "On je Allah, Tvorac, Onaj koji iz ničega stvara, Onaj koji svemu daje oblik, On ima najljepša imena."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "নভোমন্ডল ও ভূমন্ডলে যা কিছু আছে, সবই আল্লাহর পবিত্রতা বর্ণনা করে। তিনি পরাক্রমশালী মহাজ্ঞানী।",
                            "verse 59:2": "তিনিই কিতাবধারীদের মধ্যে যারা কাফের, তাদেরকে প্রথমবার একত্রিত করে তাদের বাড়ী-ঘর থেকে বহিস্কার করেছেন। তোমরা ধারণাও করতে পারনি যে, তারা বের হবে এবং তারা মনে করেছিল যে, তাদের দূর্গগুলো তাদেরকে আল্লাহর কবল থেকে রক্ষা করবে। অতঃপর আল্লাহর শাস্তি তাদের উপর এমনদিক থেকে আসল, যার কল্পনাও তারা করেনি। আল্লাহ তাদের অন্তরে ত্রাস সঞ্চার করে দিলেন। তারা তাদের বাড়ী-ঘর নিজেদের হাতে এবং মুসলমানদের হাতে ধ্বংস করছিল। অতএব, হে চক্ষুষ্মান ব্যক্তিগণ, তোমরা শিক্ষা গ্রহণ কর।",
                            "verse 59:3": "আল্লাহ যদি তাদের জন্যে নির্বাসন অবধারিত না করতেন, তবে তাদেরকে দুনিয়াতে শাস্তি দিতেন। আর পরকালে তাদের জন্যে রয়েছে জাহান্নামের আযাব।",
                            "verse 59:4": "এটা এ কারণে যে, তারা আল্লাহ ও তাঁর রসূলের বিরুদ্ধাচরণ করেছে। যে আল্লাহর বিরুদ্ধাচরণ করে, তার জানা উচিত যে, আল্লাহ কঠোর শাস্তিদাতা।",
                            "verse 59:5": "তোমরা যে কিছু কিছু খর্জুর বৃক্ষ কেটে দিয়েছ এবং কতক না কেটে ছেড়ে দিয়েছ, তা তো আল্লাহরই আদেশ এবং যাতে তিনি অবাধ্যদেরকে লাঞ্ছিত করেন।",
                            "verse 59:6": "আল্লাহ বনু-বনুযায়রের কাছ থেকে তাঁর রসূলকে যে ধন-সম্পদ দিয়েছেন, তজ্জন্যে তোমরা ঘোড়ায় কিংবা উটে চড়ে যুদ্ধ করনি, কিন্তু আল্লাহ যার উপর ইচ্ছা, তাঁর রসূলগণকে প্রাধান্য দান করেন। আল্লাহ সবকিছুর উপর সর্বশক্তিমান।",
                            "verse 59:7": "আল্লাহ জনপদবাসীদের কাছ থেকে তাঁর রসূলকে যা দিয়েছেন, তা আল্লাহর, রসূলের, তাঁর আত্নীয়-স্বজনের, ইয়াতীমদের, অভাবগ্রস্তদের এবং মুসাফিরদের জন্যে, যাতে ধনৈশ্বর্য্য কেবল তোমাদের বিত্তশালীদের মধ্যেই পুঞ্জীভূত না হয়। রসূল তোমাদেরকে যা দেন, তা গ্রহণ কর এবং যা নিষেধ করেন, তা থেকে বিরত থাক এবং আল্লাহকে ভয় কর। নিশ্চয় আল্লাহ কঠোর শাস্তিদাতা।",
                            "verse 59:8": "এই ধন-সম্পদ দেশত্যাগী নিঃস্বদের জন্যে, যারা আল্লাহর অনুগ্রহ ও সন্তুষ্টিলাভের অন্বেষণে এবং আল্লাহ তাঁর রসূলের সাহায্যার্থে নিজেদের বাস্তুভিটা ও ধন-সম্পদ থেকে বহিস্কৃত হয়েছে। তারাই সত্যবাদী।",
                            "verse 59:9": "যারা মুহাজিরদের আগমনের পূর্বে মদীনায় বসবাস করেছিল এবং বিশ্বাস স্থাপন করেছিল, তারা মুহাজিরদের ভালবাসে, মুহাজিরদেরকে যা দেয়া হয়েছে, তজ্জন্যে তারা অন্তরে ঈর্ষাপোষণ করে না এবং নিজেরা অভাবগ্রস্ত হলেও তাদেরকে অগ্রাধিকার দান করে। যারা মনের কার্পণ্য থেকে মুক্ত, তারাই সফলকাম।",
                            "verse 59:10": "আর এই সম্পদ তাদের জন্যে, যারা তাদের পরে আগমন করেছে। তারা বলেঃ হে আমাদের পালনকর্তা, আমাদেরকে এবং ঈমানে আগ্রহী আমাদের ভ্রাতাগণকে ক্ষমা কর এবং ঈমানদারদের বিরুদ্ধে আমাদের অন্তরে কোন বিদ্বেষ রেখো না। হে আমাদের পালনকর্তা, আপনি দয়ালু, পরম করুণাময়।",
                            "verse 59:11": "আপনি কি মুনাফিকদেরকে দেখেন নি? তারা তাদের কিতাবধারী কাফের ভাইদেরকে বলেঃ তোমরা যদি বহিস্কৃত হও, তবে আমরা অবশ্যই তোমাদের সাথে দেশ থেকে বের হয়ে যাব এবং তোমাদের ব্যাপারে আমরা কখনও কারও কথা মানব না। আর যদি তোমরা আক্রান্ত হও, তবে আমরা অবশ্যই তোমাদেরকে সাহায্য করব। আল্লাহ তা’আলা সাক্ষ্য দেন যে, ওরা নিশ্চয়ই মিথ্যাবাদী।",
                            "verse 59:12": "যদি তারা বহিস্কৃত হয়, তবে মুনাফিকরা তাদের সাথে দেশত্যাগ করবে না আর যদি তারা আক্রান্ত হয়, তবে তারা তাদেরকে সাহায্য করবে না। যদি তাদেরকে সাহায্য করে, তবে অবশ্যই পৃষ্ঠপ্রদর্শন করে পলায়ন করবে। এরপর কাফেররা কোন সাহায্য পাবে না।",
                            "verse 59:13": "নিশ্চয় তোমরা তাদের অন্তরে আল্লাহ তা’আলা অপেক্ষা অধিকতর ভয়াবহ। এটা এ কারণে যে, তারা এক নির্বোধ সম্প্রদায়।",
                            "verse 59:14": "তারা সংঘবদ্ধভাবেও তোমাদের বিরুদ্ধে যুদ্ধ করতে পারবে না। তারা যুদ্ধ করবে কেবল সুরক্ষিত জনপদে অথবা দুর্গ প্রাচীরের আড়াল থেকে। তাদের পারস্পরিক যুদ্ধই প্রচন্ড হয়ে থাকে। আপনি তাদেরকে ঐক্যবদ্ধ মনে করবেন; কিন্তু তাদের অন্তর শতধাবিচ্ছিন্ন। এটা এ কারণে যে, তারা এক কান্ডজ্ঞানহীণ সম্প্রদায়।",
                            "verse 59:15": "তারা সেই লোকদের মত, যারা তাদের নিকট অতীতে নিজেদের কর্মের শাস্তিভোগ করেছে। তাদের জন্যে রয়েছে যন্ত্রণাদায়ক শাস্তি।",
                            "verse 59:16": "তারা শয়তানের মত, যে মানুষকে কাফের হতে বলে। অতঃপর যখন সে কাফের হয়, তখন শয়তান বলেঃ তোমার সাথে আমার কোন সম্পর্ক নেই। আমি বিশ্বপালনকর্তা আল্লাহ তা’আলাকে ভয় করি।",
                            "verse 59:17": "অতঃপর উভয়ের পরিণতি হবে এই যে, তারা জাহান্নামে যাবে এবং চিরকাল তথায় বসবাস করবে। এটাই জালেমদের শাস্তি।",
                            "verse 59:18": "মুমিনগণ, তোমরা আল্লাহ তা’আলাকে ভয় কর। প্রত্যেক ব্যক্তির উচিত, আগামী কালের জন্যে সে কি প্রেরণ করে, তা চিন্তা করা। আল্লাহ তা’আলাকে ভয় করতে থাক। তোমরা যা কর, আল্লাহ তা’আলা সে সম্পর্কে খবর রাখেন।",
                            "verse 59:19": "তোমরা তাদের মত হয়ো না, যারা আল্লাহ তা’আলাকে ভুলে গেছে। ফলে আল্লাহ তা’আলা তাদেরকে আত্ন বিস্মৃত করে দিয়েছেন। তারাই অবাধ্য।",
                            "verse 59:20": "জাহান্নামের অধিবাসী এবং জান্নাতের অধিবাসী সমান হতে পারে না। যারা জান্নাতের অধিবাসী, তারাই সফলকাম।",
                            "verse 59:21": "যদি আমি এই কোরআন পাহাড়ের উপর অবতীর্ণ করতাম, তবে তুমি দেখতে যে, পাহাড় বিনীত হয়ে আল্লাহ তা’আলার ভয়ে বিদীর্ণ হয়ে গেছে। আমি এসব দৃষ্টান্ত মানুষের জন্যে বর্ণনা করি, যাতে তারা চিন্তা-ভাবনা করে।",
                            "verse 59:22": "তিনিই আল্লাহ তা’আলা, তিনি ব্যতীত কোন উপাস্য নেই; তিনি দৃশ্য ও অদৃশ্যকে জানেন তিনি পরম দয়ালু, অসীম দাতা।",
                            "verse 59:23": "তিনিই আল্লাহ তিনি ব্যতিত কোন উপাস্য নেই। তিনিই একমাত্র মালিক, পবিত্র, শান্তি ও নিরাপত্তাদাতা, আশ্রয়দাতা, পরাক্রান্ত, প্রতাপান্বিত, মাহাত্ন?শীল। তারা যাকে অংশীদার করে আল্লাহ তা’ আলা তা থেকে পবিত্র।",
                            "verse 59:24": "তিনিই আল্লাহ তা’আলা, স্রষ্টা, উদ্ভাবক, রূপদাতা, উত্তম নাম সমূহ তাঁরই। নভোমন্ডলে ও ভূমন্ডলে যা কিছু আছে, সবই তাঁর পবিত্রতা ঘোষণা করে। তিনি পরাক্রান্ত প্রজ্ঞাময়। পবিত্র।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 59:1": "Всичко на небесата и всичко на земята прославя Аллах.",
                            "verse 59:2": "Той е, Който прогони от домовете им при първото изселване неверниците сред хората на Писанието.",
                            "verse 59:3": "И ако Аллах не им бе предписал отпращане, щеше да ги мъчи в земния живот, а в отвъдния за тях е мъчението на Огъня.",
                            "verse 59:4": "Това е, защото се противяха на Аллах и на Неговия Пратеник.",
                            "verse 59:5": "Каквато и палма да отсечете или да я оставите изправена върху корените й, то е с позволението на Аллах и за да опозори Той нечестивците.",
                            "verse 59:6": "За онова, което Аллах дари от тях на Своя Пратеник вие не препускахте нито на коне, нито на камили.",
                            "verse 59:7": "Онова, което Аллах е дарил на Своя Пратеник от жителите на селищата, принадлежи на Аллах и на Пратеника, и на роднините ,",
                            "verse 59:8": "и на сираците, и нуждаещите се, и пътниците [в нужда], за да не бъде в обращение сред богатите измежду вас.",
                            "verse 59:9": "[Част от това е] за бедняците-преселници, които бяха прогонени от своите домове и имоти, търсейки обилие и благоволение от Аллах, и помагайки на Аллах и на Неговия Пратеник.",
                            "verse 59:10": "Настанилите се в дома [на преселението Медина] и",
                            "verse 59:11": "вярата преди онези, които се преселиха там, ги обичат и не усещат в сърцата си завист за онова, което им бе дарено.",
                            "verse 59:12": "А които дойдоха след тях, казват: Господи наш, опрости нас и братята ни, които ни изпревариха във вярата, и не влагай в сърцата ни омраза към онези, които повярваха! Господи наш, Ти си състрадателен, милосърден.",
                            "verse 59:13": "Не виждаш ли как лицемерите казват на своите братя сред хората на Писанието, които не повярваха: Ако бъдете прогонени, ще излезем заедно с вас и не ще се подчиним заради вас никога на никого, и ако бъдете нападнати, ще ви подкрепим.",
                            "verse 59:14": "Ако бъдат прогонени, те не ще излязат заедно с тях и ако бъдат нападнати, не ще ги подкрепят.",
                            "verse 59:15": "В сърцата им вие сте по-страшни от Аллах.",
                            "verse 59:16": "И не ще се сражават с вас вкупом, освен ако са в укрепени селища или зад стени.",
                            "verse 59:17": "Подобно на онези, които бяха преди тях неотдавна, те вкусиха пагубността на своето дело и за тях има болезнено мъчение,",
                            "verse 59:18": "подобно на сатаната, който казва на човека: Отхвърли вярата! А щом стане неверник, казва: Непричастен съм към теб.",
                            "verse 59:19": "Последствието и за двамата е, че ще пребъдат в Огъня, там ще пребивават вечно.",
                            "verse 59:20": "О, вярващи, бойте се от Аллах! И всеки да види какво е приготвил за Утре! И бойте се от Аллах! Сведущ е Аллах за вашите дела.",
                            "verse 59:21": "И не бъдете като онези, които забравиха Аллах - Той ги накара да забравят себе си! Те са нечестивците.",
                            "verse 59:22": "Не са равни обитателите на Огъня и обитателите на Рая.",
                            "verse 59:23": "Ако бяхме низпослали този Коран върху планина, щеше да я видиш смирена, разцепена от страх пред Аллах.",
                            "verse 59:24": "Той е Аллах, няма друг Бог освен Него - Знаещия и неведомото, и явното.",
                            "verse 59:25": "Той е Аллах, няма друг Бог освен Него - Владетеля, Пресветия, Съвършения, Утвърждаващия, Наблюдаващия, Всемогъщия, Подчиняващия, Превъзходния! Пречист е Аллах от онова, с което Го съдружават!",
                            "verse 59:26": "Той е Аллах - Сътворителя, Изкусния, Ваятеля! Негови са Най-прекрасните имена."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "凡在天地間的，都讚頌真主超絕萬物。他確是萬能的，確是至睿的。",
                            "verse 59:2": "在初次放逐的時侯，他曾將信奉《聖經》而不信《古蘭經》的人從他們的家中驅逐出境。你們沒有猜想到他們會退出去，他們猜想自己的堡壘能防禦真主；但真主的刑罰，竟從他們料不到的地方降臨他們。他將恐怖投在他們的心中，他們用自己的手和信士們的手拆毀自己的房屋。有眼光的人們啊！你們警惕吧！",
                            "verse 59:3": "假若真主沒有判決他們應受放逐，他必在今世懲罰他們；他們在後世，將受火刑。",
                            "verse 59:4": "這是由於他們違抗真主和使者。凡違抗真主者，真主必定懲罰他，因為真主的刑罰確是嚴厲的。",
                            "verse 59:5": "無論你們砍伐海棗樹，或任其依然存在，都是真主所允許的，他准許伐樹，原為凌辱放蕩者。",
                            "verse 59:6": "凡真主收歸使者的逆產，你們都沒有汗馬之勞；但真主使眾使者，制服他所意欲者；真主對於萬事，是全能的。",
                            "verse 59:7": "城巿的居民的逆產，凡真主收歸使者的，都歸真主、使者、至親、孤兒、貧民和旅客，以免那些逆產，成為在你們中富豪之間周轉的東西。凡使者給你們的，你們都應當接受；凡使者禁止你們的，你們都應當戒除。你們應當敬畏真主，真主確是刑罰嚴厲的。",
                            "verse 59:8": "那些逆產一部份歸遷士中的貧民，他們曾被驅逐出境，以致喪失自己的房屋和財產。他們尋求從真主發出的恩典和喜悅，他們協助真主和使者；這等人，確是說實話的。",
                            "verse 59:9": "在他們之前，安居故鄉而且確信正道的人們，他們喜愛遷居來的教胞們，他們對於那些教胞所獲的賞賜，不懷怨恨，他們雖有急需，也願把自己所有的讓給那些教胞。能戒除自身的貪吝者，才是成功的。",
                            "verse 59:10": "在他們之後到來的人們說：「我們的主啊！求你赦宥我們，並赦宥在我們之前已經信道的教胞們，求你不要讓我們怨恨在我們之前已經信道的人們，我們的主啊！你確是仁愛的，確是至慈的。」",
                            "verse 59:11": "道你沒有看見那些偽信者嗎？他們對自己的朋友──信奉《聖經》而不信《古蘭經》的人們，說：「如果你們被放逐，我們必定與你們一同出境，我們永不服從任何人的命令而放棄你們；如果你們被攻擊，我們必援助你們。」真主作証，他們確是說謊的。",
                            "verse 59:12": "如果他們被放逐，偽信者不與他們一道出境；如果他們被攻擊，偽信者不援助他們；即使援助他們，也必轉身逃跑，使之不獲援助。",
                            "verse 59:13": "你們在他們的胸中確是比真主還可怕的，那是因為他們是不明理的民眾。",
                            "verse 59:14": "他們只在鞏固的城市中或在堡壘後共同作戰。他們的內爭是嚴重的，你以為他們是團結的，其實，他們的心是渙散的。那是因為他們是不明理的民眾。",
                            "verse 59:15": "他們像在他們之前剛逝去的人們一樣，他們已賞試他們行為的惡果，他們將受痛苦的刑罰。",
                            "verse 59:16": "他們又像惡魔一樣。當時，他曾對人說：「你不要信道。」當他不信道的時候，他說：「我確是與你無干的，我的確畏懼真主──全世界的主。」",
                            "verse 59:17": "他們倆的結局，是同入火獄，而永居其中；那是不義者的報酬。",
                            "verse 59:18": "信道的人們啊！你們應當敬畏真主，各人應當想一想自己為明日而預備了什麼，你們應當敬畏真主，真主確是徹知你們的行為的。",
                            "verse 59:19": "你們不要像那些忘卻真主故真主使他們忘卻自身的人們一樣；這等人，確是悖逆的。",
                            "verse 59:20": "火獄的居民與樂園的居民不是平等的。樂園的居民，確是成功的。",
                            "verse 59:21": "假若我把這部《古蘭經》降示一座山，你必定看見那座山因畏懼真主而成為柔和的，崩潰的。這些譬喻，是我為眾人而設的，以便他們省悟。",
                            "verse 59:22": "他是真主，除他外，絕無應受崇拜的。他是全知幽玄的，他是至仁的，是至慈的。",
                            "verse 59:23": "他是真主，除他外，絕無應受崇拜的。他是君主。他是至潔的，是健全的，是保祐的，是見証的，是萬能的，是尊嚴的，是尊大的。讚頌真主，超絕萬物，他是超乎他們所用以配他的。",
                            "verse 59:24": "他是真主，是創造者，是造化者，是賦形者，他有許多極美的稱號，凡在天地間的，都讚頌他，他是萬能的，是至睿的。 他是真主，除他外，絕無應受崇拜的。他是君主。他是至潔的，是健全的，是保祐的，是見証的，是萬能的，是尊嚴的，是尊大的。讚頌真主，超絕萬物，他是超乎他們所用以配他的。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Slaví Boha vše, co na nebesích je i na zemi, a On mocný je i moudrý.",
                            "verse 59:2": "On je ten, jenž vyhnal ty z vlastníků Písma, kteří neuvěřili, z příbytků jejich k prvnímu shromáždění.",
                            "verse 59:3": "Kdyby byl Bůh pro ně nepředepsal vyhnanství, byl by je věru potrestal v životě pozemském jiným způsobem; v životě budoucím pak je očekává trest ohnivý.",
                            "verse 59:4": "A to proto, že se vzepřeli Bohu a poslu Jeho.",
                            "verse 59:5": "Vše, co jste porazili z palem datlových či nechali stát na kořenech jejich, to učinili jste z dovolení Božího, a aby poníženi byli hanebníci.",
                            "verse 59:6": "To, co Bůh poskytl jako kořist poslu Svému z majetku jejich, k tomu jste vy nemusili popohánět ani koně, ani velbloudy.",
                            "verse 59:7": "To, co Bůh poskytl poslu Svému jako kořist z obyvatelů měst, to patří Bohu a poslu Jeho, příbuzným, sirotkům, chudákům a tomu, kdo po cestě Boží kráčí, aby se to nedostalo do oběhu mezi bohatými z vás.",
                            "verse 59:8": "A část kořisti náleží chudým vystěhovalcům, kteří byli vyhnáni z příbytků svých a od majetků svých a kteří usilují dosáhnout přízně Boží a zalíbení a pomáhají Bohu a poslu Jeho.",
                            "verse 59:9": "Ti, kdož pevně sídlí v tomto obvodu a utvrdili se ve víře ještě před nimi, ti milují ty, kdož se k nim vystěhovali, a nenalézají v hrudích svých žádnou závist kvůli tomu, co dáno bylo vystěhovalcům.",
                            "verse 59:10": "A ti, kdož přišli po nich, hovoří: \"Pane náš, odpusť nám i bratřím našim, kteří nás předešli ve víře; a nevkládej do srdcí našich zlobu proti těm, kdož před námi uvěřili, Pane náš, vždyť Tys věru shovívavý, slitovný!\"",
                            "verse 59:11": "Což jsi neviděl pokrytce, jak říkají bratřím svým nevěřícím z vlastníků Písma: \"Budete-li vyhnáni, my věru odejdeme s vámi a nikdy neuposlechneme nikoho proti vám.",
                            "verse 59:12": "A budou-li tito vskutku vyhnáni, oni s nimi neodejdou, a bude-li proti nim bojováno, oni jim nepomohou, anebo poskytnou-li jim pomoc, obrátí se potom zády a nakonec jim samým nebude pomoci.",
                            "verse 59:13": "Vy naháníte srdcím jejich větší hrůzu než Bůh, a to je proto, že to jsou lidé, kteří nic nechápou.",
                            "verse 59:14": "Nebudou bojovat proti vám společně, nýbrž jednotlivě v sídlištích opevněných či za hradbami.",
                            "verse 59:15": "podobní těm, kdož byli nedlouho před nimi: okusili již špatných následků svého počínání a očekává je ještě trest bolestný.",
                            "verse 59:16": "A podobají se satanovi, jenž říká člověku: \"Buď nevěřící!\" A když se stane nevěřícím, tu mu řekne: \"Já nejsem za tebe zodpovědný, neboť se věru obávám Boha, Pána lidstva veškerého!\"",
                            "verse 59:17": "A konec jich obou bude jedině v ohni pekelném a budou tam nesmrtelní.",
                            "verse 59:18": "Vy, kteří věříte, bojte se Boha! Nechť duše každá popatří na to, co si již dříve připravila pro zítřek.",
                            "verse 59:19": "Nebuďte jako ti, kdož zapomněli na Boha a jimž On dal zapomenout na sebe samé - a toto jsou věru hanebníci.",
                            "verse 59:20": "A nebudou si rovni obyvatelé ohně a obyvatelé ráje; a obyvatelé ráje jsou ti, kdož velkého úspěchu dosáhli.",
                            "verse 59:21": "Kdybychom byli seslali tento Korán na horu, byl bys ji viděl pokornou a pukající ze strachu před Bohem.",
                            "verse 59:22": "On je Bůh - a není božstva kromě Něho - jenž zná nepoznatelné i všeobecně známé.",
                            "verse 59:23": "On je Bůh - a není božstva kromě Něho - vládce, přesvatý, mír, věrný, ochránce bezpečný, mocný, samovládný, velmožný; oč slavnější je Bůh než vše to, co k Němu přidružují.",
                            "verse 59:24": "On je Bůh, stvořitel, tvůrce i utvářející."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Alles wat in de hemelen en op aarde is, verheerlijkt God; en Hij is de Almachtige, de Alwijze.",
                            "verse 59:2": "Hij is het Die de ongelovigen onder de mensen van het Boek, uit hun huizen zette bij de eerste verbanning.",
                            "verse 59:3": "En indien God hun geen verbanning voorgeschreven had, zou Hij hen zeker in deze wereld (nog zwaarder) hebben bestraft.",
                            "verse 59:4": "Dat is omdat zij God en Zijn boodschapper tegenwerkten - en hij die God tegenwerkt - waarlijk, God is streng in het straffen.",
                            "verse 59:5": "Welke palmbomen gij ook hebt nedergehouwen of op hun wortels hebt laten staan, het was met God’s toelating, opdat Hij de overtreders mocht vernederen.",
                            "verse 59:6": "Hetgeen God van hen als buit aan, Zijn boodschapper heeft gegeven daarvoor spoordet gij noch paard noch kamelen aan; maar God geeft macht aan Zijn boodschappers over wie Hij wil.",
                            "verse 59:7": "Wat God aan Zijn boodschapper heeft gegeven als buit van het volk van de stadsgebieden, is voor God en Zijn boodschapper en voor de naaste familieleden en de wezen en de armen en de reiziger, opdat het niet alleen in omloop moge zijn tussen de rijken onder u.",
                            "verse 59:8": "Een deel behoort aan de arme vluchtelingen die van hun huizen en hun eigendommen zijn verdreven, terwijl zij de genade van God en Zijn welbehagen zochten en God en Zijn boodschapper hielpen; dit zijn de waarachtigen.",
                            "verse 59:9": "En degenen die zich in de stad hebben gehuisvest en(anderen) vóórgingen in het geloof, hebben diegenen lief, die tot hen de toevlucht nemen, en gevoelen geen behoefte in hun hart aan hetgeen hun gegeven wordt, zij geven anderen de voorkeur boven zichzelf, al verkeren zij zelf in armoede.",
                            "verse 59:10": "En degenen die na hen kwamen, zeggen: \"Onze Heer, vergeef ons en onze broeders, die ons voorafgingen in het geloof, en laat geen wrok in ons hart blijven tegen de gelovigen.",
                            "verse 59:11": "Hebt gij de huichelaars gezien? Zij zeggen tegen hun ongelovige broeders onder de mensen van het Boek: \"Indien gij verdreven wordt, zullen wij zeker met u medegaan, en wij zullen nooit iemand ten (nadele van) uw zaak gehoorzamen en als gij wordt aangevallen zullen wij u beslist helpen.",
                            "verse 59:12": "Als zij (de ongelovigen) verbannen zouden worden, zouden (de huichelaars) nooit met hen medegaan en als zij aangevallen zouden worden, zouden zij hen nooit helpen.",
                            "verse 59:13": "Voorzeker zij hebben meer angst in hun hart voor u (Moslims) dan voor God.",
                            "verse 59:14": "Zij zullen u niet bestrijden zelfs allen tezamen, tenzij in versterkte steden of achter muren, ofschoon zij onderling grote dapperheid tonen.",
                            "verse 59:15": "Evenals voor degenen die kort vóór hen het kwade gevolg hunner daden ondergingen, is er voor hen een pijnlijke straf.",
                            "verse 59:16": "Evenals Satan, wanneer hij tegen de mens zegt: \"Verwerp (de waarheid)\"; maar wanneer deze haar verwerpt zegt hij: \"Ik heb niets met u uitstaande, voorzeker, ik vrees God, de Heer der Werelden.",
                            "verse 59:17": "Daarom zal het einde van beiden wezen, dat zij samen in het Vuur zullen vertoeven; dit is het loon der onrechtvaardigen.",
                            "verse 59:18": "O gij die gelooft, vreest God; en laat iedere ziel acht geven op hetgeen zij voor morgen voorbereidt.",
                            "verse 59:19": "En weest niet als degenen die God vergaten, zodat Hij hun hun eigen ziel heeft doen vergeten.",
                            "verse 59:20": "De bewoners van het Vuur en de bewoners van het paradijs zijn niet gelijk: de bewoners van het paradijs zullen slagen.",
                            "verse 59:21": "Indien Wij deze Koran op een berg hadden doen neerkomen, dan hadt gij de berg zich zien vernederen en splijten uit vrees voor God.",
                            "verse 59:22": "Hij is God, naast Wie er geen God is, de Kenner van het onzienlijke en het zienlijke, Hij is de Barmhartige, de Genadevolle.",
                            "verse 59:23": "Hij is God, naast Wie er geen God is, de Koning, de Heilige, de Brenger van Vrede, de Schenker van Veiligheid, de Beschermer, de Machtige, de Krachtige, Bezitter van Grootheid.",
                            "verse 59:24": "Hij is God, de Schepper, de Maker, de Vormer."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 59:1": "All that is in the heavens and all that is in the earth glorifieth Allah, and He is the Mighty, the Wise.",
                            "verse 59:2": "He it is Who hath caused those of the People of the Scripture who disbelieved to go forth from their homes unto the first exile.",
                            "verse 59:3": "And if Allah had not decreed migration for them, He verily would have punished them in the world, and theirs in the Hereafter is the punishment of the Fire.",
                            "verse 59:4": "That is because they were opposed to Allah and His messenger; and whoso is opposed to Allah, (for him) verily Allah is stern in reprisal.",
                            "verse 59:5": "Whatsoever palm-trees ye cut down or left standing on their roots, it was by Allah’s leave, in order that He might confound the evil-livers.",
                            "verse 59:6": "And that which Allah gave as spoil unto His messenger from them, ye urged not any horse or riding-camel for the sake thereof, but Allah giveth His messenger lordship over whom He will.",
                            "verse 59:7": "That which Allah giveth as spoil unto His messenger from the people of the townships, it is for Allah and His messenger and for the near of kin and the orphans and the needy and the wayfarer, that it become not a commodity between the rich among you.",
                            "verse 59:8": "And (it is) for the poor fugitives who have been driven out from their homes and their belongings, who seek bounty from Allah and help Allah and His messenger.",
                            "verse 59:9": "Those who entered the city and the faith before them love those who flee unto them for refuge, and find in their breasts no need for that which hath been given them, but prefer (the fugitives) above themselves though poverty become their lot.",
                            "verse 59:10": "And those who came (into the faith) after them say: Our Lord! Forgive us and our brethren who were before us in the faith, and place not in our hearts any rancour toward those who believe.",
                            "verse 59:11": "Hast thou not observed those who are hypocrites, (how) they tell their brethren who disbelieve among the People of the Scripture: If ye are driven out, we surely will go out with you, and we will never obey anyone against you, and if ye are attacked we verily will help you.",
                            "verse 59:12": "(For) indeed if they are driven out they go not out with them, and indeed if they are attacked they help them not, and indeed if they had helped them they would have turned and fled, and then they would not have been victorious.",
                            "verse 59:13": "Ye are more awful as a fear in their bosoms than Allah.",
                            "verse 59:14": "They will not fight against you in a body save in fortified villages or from behind walls.",
                            "verse 59:15": "On the likeness of those (who suffered) a short time before them, they taste the ill-effects of their own conduct, and theirs is painful punishment.",
                            "verse 59:16": "(And the hypocrites are) on the likeness of the devil when he telleth man to disbelieve, then, when he disbelieveth saith: Lo! I am quit of thee.",
                            "verse 59:17": "And the consequence for both will be that they are in the Fire, therein abiding.",
                            "verse 59:18": "O ye who believe! Observe your duty to Allah.",
                            "verse 59:19": "And be not ye as those who forgot Allah, therefor He caused them to forget their souls.",
                            "verse 59:20": "Not equal are the owners of the Fire and the owners of the Garden.",
                            "verse 59:21": "If We had caused this Qur’an to descend upon a mountain, thou (O Muhammad) verily hadst seen it humbled, rent asunder by the fear of Allah.",
                            "verse 59:22": "He is Allah, than Whom there is no other God, the Knower of the Invisible and the Visible.",
                            "verse 59:23": "He is Allah, than Whom there is no other God, the Sovereign Lord, the Holy One, Peace, the Keeper of Faith, the Guardian, the Majestic, the Compeller, the Superb.",
                            "verse 59:24": "He is Allah, the Creator, the Shaper out of naught, the Fashioner."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 59:1": "Whatever is in the heavens and on earth, let it declare the Praises and Glory of God: for He is the Exalted in Might, the Wise.",
                            "verse 59:2": "It is He Who got out the Unbelievers among the People of the Book from their homes at the first gathering (of the forces).",
                            "verse 59:3": "And had it not been that God had decreed banishment for them, He would certainly have punished them in this world: And in the Hereafter they shall (certainly) have the Punishment of the Fire.",
                            "verse 59:4": "That is because they resisted God and His Apostle: and if any one resists God, verily God is severe in Punishment.",
                            "verse 59:5": "Whether ye cut down (O ye Muslim!) The tender palm-trees, or ye left them standing on their roots, it was by leave of God, and in order that He might cover with shame the rebellious transgresses.",
                            "verse 59:6": "What God has bestowed on His Apostle (and taken away) from them - for this ye made no expedition with either cavalry or camelry: but God gives power to His apostles over any He pleases: and God has power over all things.",
                            "verse 59:7": "What God has bestowed on His Apostle (and taken away) from the people of the townships,- belongs to God,- to His Apostle and to kindred and orphans, the needy and the wayfarer; In order that it may not (merely) make a circuit between the wealthy among you.",
                            "verse 59:8": "(Some part is due) to the indigent Muhajirs, those who were expelled from their homes and their property, while seeking Grace from God and (His) Good Pleasure, and aiding God and His Apostle: such are indeed the sincere ones:-",
                            "verse 59:9": "But those who before them, had homes (in Medina) and had adopted the Faith,- show their affection to such as came to them for refuge, and entertain no desire in their hearts for things given to the (latter), but give them preference over themselves, even though poverty was their (own lot).",
                            "verse 59:10": "And those who came after them say: \"Our Lord! Forgive us, and our brethren who came before us into the Faith, and leave not, in our hearts, rancour (or sense of injury) against those who have believed.",
                            "verse 59:11": "Hast thou not observed the Hypocrites say to their misbelieving brethren among the People of the Book? - \"If ye are expelled, we too will go out with you, and we will never hearken to any one in your affair; and if ye are attacked (in fight) we will help you\".",
                            "verse 59:12": "If they are expelled, never will they go out with them; and if they are attacked (in fight), they will never help them; and if they do help them, they will turn their backs; so they will receive no help.",
                            "verse 59:13": "Of a truth ye are stronger (than they) because of the terror in their hearts, (sent) by God.",
                            "verse 59:14": "They will not fight you (even) together, except in fortified townships, or from behind walls.",
                            "verse 59:15": "Like those who lately preceded them, they have tasted the evil result of their conduct; and (in the Hereafter there is) for them a grievous Penalty;-",
                            "verse 59:16": "(Their allies deceived them), like the Evil One, when he says to man, \"Deny God\": but when (man) denies God, (the Evil One) says, \"I am free of thee: I do fear God, the Lord of the Worlds!\"",
                            "verse 59:17": "The end of both will be that they will go into the Fire, dwelling therein for ever.",
                            "verse 59:18": "O ye who believe! Fear God, and let every soul look to what (provision) He has sent forth for the morrow.",
                            "verse 59:19": "And be ye not like those who forgot God; and He made them forget their own souls! Such are the rebellious transgressors!",
                            "verse 59:20": "Not equal are the Companions of the Fire and the Companions of the Garden: it is the Companions of the Garden, that will achieve Felicity.",
                            "verse 59:21": "Had We sent down this Qur’an on a mountain, verily, thou wouldst have seen it humble itself and cleave asunder for fear of God.",
                            "verse 59:22": "God is He, than Whom there is no other god;- Who knows (all things) both secret and open; He, Most Gracious, Most Merciful.",
                            "verse 59:23": "God is He, than Whom there is no other god;- the Sovereign, the Holy One, the Source of Peace (and Perfection), the Guardian of Faith, the Preserver of Safety, the Exalted in Might, the Irresistible, the Supreme: Glory to God! (High is He) above the partners they attribute to Him.",
                            "verse 59:24": "He is God, the Creator, the Evolver, the Bestower of Forms (or Colours)."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 59:1": "All that is in the heavens and the earth magnifies God; He is the All-mighty, the All-wise.",
                            "verse 59:2": "It is He who expelled from their habitations the unbelievers among the People of the Book at the first mustering.",
                            "verse 59:3": "Had God not prescribed dispersal for them, He would have chastised them in this world; and there awaits them in the world to come the chastisement of the Fire.",
                            "verse 59:4": "That is because they made a breach with God and His Messenger; and whosoever makes a breach with God, God is terrible in retribution.",
                            "verse 59:5": "Whatever palm-trees you cut down, or left standing upon their roots, that was by God’s leave, and that He might degrade the ungodly.",
                            "verse 59:6": "And whatever spoils of war God has given unto His Messenger from them, against that you pricked neither horse nor camel; but God gives authority to His Messengers over whomsoever He will.",
                            "verse 59:7": "Whatsoever spoils of war God has given to His Messenger from the people of the cities belongs to God, and His Messenger, and the near kinsman, orphans, the needy and the traveller, so that it be not a thing taken in turns among the rich of you.",
                            "verse 59:8": "It is for the poor emigrants, who were expelled from their habitations and their possessions, seeking bounty from God and good pleasure, and helping God and His Messenger; those -- they are the truthful ones.",
                            "verse 59:9": "And those who made their dwelling in the abode, and in belief, before them; love whosoever has emigrated to them, not finding in their breasts any need for what they have been given, and preferring others above themselves, even though poverty be their portion.",
                            "verse 59:10": "And as for those who came after them, they say, ’Our Lord, forgive us and our brothers, who preceded us in belief, and put Thou not into our hearts any rancour towards those who believe.",
                            "verse 59:11": "Hast thou not regarded the hypocrites, saying to their brothers of the People of the Book who disbelieve, ’If you are expelled, we will go forth with you, and we will never obey anyone in regard to you.",
                            "verse 59:12": "If those are expelled, they will not go forth with them, and if they are fought against, they will not help them.",
                            "verse 59:13": "Why, you arouse greater fear in their hearts than God; that is because they are a people who understand not.",
                            "verse 59:14": "They will not fight against you all together except in fortified cities, or from behind walls.",
                            "verse 59:15": "Like those who a short time before them tasted the mischief of their action; there awaits them a painful chastisement.",
                            "verse 59:16": "Like Satan, when he said to man, ’Disbelieve’; then, when he disbelieved, he said, ’Surely I am quit of you.",
                            "verse 59:17": "Their end is, both are in the Fire, there dwelling forever; that is the recompense of the evildoers.",
                            "verse 59:18": "O believers, fear God.",
                            "verse 59:19": "Be not as those who forgot God, and so He caused them to forget their souls; those -- they are the ungodly.",
                            "verse 59:20": "Not equal are the inhabitants of the Fire and the inhabitants of Paradise.",
                            "verse 59:21": "If We had sent down this Koran upon a mountain, thou wouldst have seen it humbled, split asunder out of the fear of God.",
                            "verse 59:22": "He is God; there is no god but He.",
                            "verse 59:23": "He is God; there is no god but He.",
                            "verse 59:24": "He is God, the Creator, the Maker, the Shaper."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 59:1": "ALL THAT IS in the heavens and all that is on earth extols God’s limitless glory: for He alone is almighty, truly wise.",
                            "verse 59:2": "He it is who turned out of their homes, at the time of",
                            "verse 59:3": "first gathering [for war], such of the followers of earlier revelation as were bent on denying the truth.",
                            "verse 59:4": "And had it not been for God’s having ordained banishment for them, He would indeed have imposed [yet greater] suffering on them in this world: still, in the life to come there awaits them suffering through fire:",
                            "verse 59:5": "this, because they cut themselves off from God and His Apostle: and as for him who cuts himself off from God and His Apostle – verily, God is severe in retribution!",
                            "verse 59:6": "Whatever [of their] palm trees you may have cut down, [O believers,] or left standing on their roots, was",
                            "verse 59:7": "by God’s leave, and in order that He might confound the iniquitous.",
                            "verse 59:8": "Yet",
                            "verse 59:9": "whatever [spoils taken] from the enemy God has turned over to His Apostle, you did not have to spur horse or riding-camel for its sake: but God gives His apostles mastery over whomever He wills – for God has the power to will anything.",
                            "verse 59:10": "Whatever [spoils taken] from the people of those villages God has turned over to His Apostle – [all of it] belongs to God and the Apostle, and the near of kin [of deceased believers], and the orphans, and the needy, and the wayfarer, so that it may not be [a benefit] going round and round among such of you as may",
                            "verse 59:11": "be rich.",
                            "verse 59:12": "whatever the Apostle gives you ,",
                            "verse 59:13": "and refrain from",
                            "verse 59:14": "anything that he withholds from you; and remain conscious of God: for, verily, God is severe in retribution.",
                            "verse 59:15": "[Thus, part of such war-gains shall be given] to the poor among those who have forsaken the domain of evil: those who have been driven from their homelands and their possessions, seeking favour with God and",
                            "verse 59:16": "goodly acceptance, and who aid [the cause of] God and His Apostle: it is they, they who are true to their word!",
                            "verse 59:17": "And [it shall be offered, too, unto the poor from among] those who, before them, had their abode in this realm and in faith –",
                            "verse 59:18": "who love all that come to them in search of refuge, and who harbour in their hearts no grudge for whatever the others may have been given, but rather give them preference over themselves, even though poverty be their own lot: for such as from their own covetousness are saved – it is they, they that shall attain to a happy state!",
                            "verse 59:19": "And so, they who come after them pray: \"O our Sustainer! Forgive us our sins, as well as those of our brethren who preceded us in faith, and let not our hearts entertain any unworthy thoughts or feelings against [any of] those who have attained to faith.",
                            "verse 59:20": "ART THOU NOT aware of how those who would always dissemble [their real feelings] speak to their truth-denying brethren from among the followers of earlier revelation: \"If you are driven away, we shall most certainly go forth with you, and shall never pay heed to anyone against you; and if war is waged against you, we shall most certainly come to your succour.",
                            "verse 59:21": "",
                            "verse 59:22": "if those [to whom they have pledged themselves] are indeed driven away, they will not go forth with them; and if war is waged against them, they will not come to their succour; and even if they [try to] succour them, they will most certainly turn their backs [in flight], and in the end will",
                            "verse 59:23": "find no succour.",
                            "verse 59:24": "Nay, [O believers,] you arouse in their bosoms a fear more intense than [even their fear of] God: this, because they are people who fail to grasp the truth.",
                            "verse 59:25": "Never will they fight you,",
                            "verse 59:26": "in unison, otherwise than from within fortified strongholds or from behind walls.",
                            "verse 59:27": "[To both kinds of your enemies, O believers, is bound to happen] the like of [what happened to] those who, a short while before them, had to taste the evil that came from their own doings, with [yet more] grievous suffering awaiting them [in the life to come]:",
                            "verse 59:28": "the like of [what happens] when Satan says unto man, \"Deny the truth!\" – but as soon as",
                            "verse 59:29": "has denied the truth,",
                            "verse 59:30": "says, \"Behold, I am not responsible for thee: behold, I fear God, the Sustainer of all the worlds!\"",
                            "verse 59:31": "Thus, in the end, both [the deniers of the truth and the hypocrites] will find themselves in the fire, therein to abide: for such is the recompense of evildoers.",
                            "verse 59:32": "O YOU who have attained to faith! Remain conscious of God; and let every human being look to what he sends ahead for the morrow! And [once again]: Remain conscious of God, for God is fully aware of all that you do;",
                            "verse 59:33": "and be not like those who are oblivious of God, and whom He therefore causes to be oblivious of [what is good for] their own selves:",
                            "verse 59:34": "it is they, they who are truly depraved!",
                            "verse 59:35": "Not equal are those who are destined for the fire and those who are destined for paradise: those who are destined for paradise – it is they, they",
                            "verse 59:36": "who shall triumph [on Judgment Day]!",
                            "verse 59:37": "HAD WE bestowed this Qur’ān from on high upon a mountain, thou wouldst indeed see it humbling itself, breaking asunder for awe of God….",
                            "verse 59:38": "such parables We propound unto men, so that they might [learn to] think.",
                            "verse 59:39": "GOD IS HE save whom there is no deity: the One who knows all that is beyond the reach of a created being’s perception, as well as all that can be witnessed by a creature’s senses or mind: He, the Most Gracious, the Dispenser of Grace.",
                            "verse 59:40": "God is He save whom there is no deity: the Sovereign Supreme, the Holy, the One with whom all salvation rests, the Giver of Faith, the One who determines what is true and false, the Almighty, the One who subdues wrong and restores right, the One to whom all greatness belongs! Utterly remote is God, in His limitless glory, from anything to which men may ascribe a share in His divinity!",
                            "verse 59:41": "He is God, the Creator, the Maker who shapes all forms and appearances! His",
                            "verse 59:42": "are the attributes of perfection.",
                            "verse 59:43": "or “turned",
                            "verse 59:44": "over”) is applied in the Qur’ān and the Traditions exclusively to war-gains – whether consisting of lands, or tribute, or indemnities – which are obtained, as a condition of peace, from an enemy who has laid down arms before actual fighting has taken place (Tāj al-‘Arūs)."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 59:1": "…the poor emigrants who have been driven from their homes.",
                            "verse 59:2": "…ill feeling is rife amongst them.",
                            "verse 59:3": "If We caused this Qoran to descend upon a mountain, thou wouldst see the mountain lying prostrate with humility, rent asunder through fear of God.",
                            "verse 59:4": "We had sent down this Qur’an upon a mountain, thou wouldst have seen it lying prostrate in humility, rent asunder through fear of God.",
                            "verse 59:5": "If",
                            "verse 59:6": "We sent down this Koran upon a mountain, thou wouldst see it prostrate in humility, rent asunder through fear of God.",
                            "verse 59:7": "We had sent down this Quran upon a mountain, thou wouldst have seen it humbled, split asunder out of the fear of God.",
                            "verse 59:8": "We had sent down this Qur’an upon a mountain, thou wouldst have seen it lying prostrate in humility, rent asunder through fear of God.",
                            "verse 59:9": "We had sent down this Qur’an upon a mountain, thou wouldst have seen it humbled, split asunder through fear of God.",
                            "verse 59:10": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 59:11": "The Book of Certainty (1952) •",
                            "verse 59:12": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 59:13": "What is Sufism (1975) •",
                            "verse 59:14": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 59:15": "Muhammad (1983) •",
                            "verse 59:16": "Symbol and Archetype (1991) •",
                            "verse 59:17": "Sufi Poems (2004) •",
                            "verse 59:18": "Mecca (2004) •",
                            "verse 59:19": "Return to the Spirit (2005) •",
                            "verse 59:20": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 59:21": "“Proofs of Islam”(1954).",
                            "verse 59:22": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 59:23": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 59:24": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 59:25": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 59:26": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 59:27": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 59:28": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 59:29": "“The Quranic Origins of Sufism” •",
                            "verse 59:30": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 59:31": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 59:32": "“An Introduction to Islam” •",
                            "verse 59:33": "“The Universality of the Quran” •",
                            "verse 59:34": "Private Talks Books",
                            "verse 59:35": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 59:1": "Allah’s purity has been proclaimed by all that is in the heavens and all that is in the earth.",
                            "verse 59:2": "He is the One who expelled the disbelievers of the People of the Book from their homes at the time of the first gathering.",
                            "verse 59:3": "If Allah had not destined exile for them, He would have punished them in the world.",
                            "verse 59:4": "That is because they were hostile to Allah and His Messenger.",
                            "verse 59:5": "Whatever palm-trees you have cut down, or have left them standing on their roots, it was with Allah’s permission, and so that He might disgrace the transgressors.",
                            "verse 59:6": "And whatever fai’ (left over property) Allah has passed on to His Messenger from them, you had not urged on your horses or camels for it, but Allah gives predominance to His messengers over whomsoever He wills, and Allah is Powerful over every thing.",
                            "verse 59:7": "Whatever fai’ Allah has passed on to His Messenger from the people of the towns is for Allah and for the Messenger, and for the kinsmen and the orphans and the needy and the wayfarer, so that it may not circulate only between the rich among you.",
                            "verse 59:8": "(And fai’ is especially) for the poor emigrants who were expelled from their homes and properties, while they were seeking Allah’s grace and pleasure, and were helping (the religion of) Allah and His Messenger.",
                            "verse 59:9": "And (fai’ is also) for those who established themselves in the homeland (of Madīnah) and in faith before the former ones (arrived in Madīnah), who have love for those who emigrated to them, and do not feel in their hearts any ambition for what is given to the former ones (from fai’), and give preference (to them) over themselves, even though they are in poverty.",
                            "verse 59:10": "And (fai’ is also) for those who came after them saying, “Our Lord, forgive us and those of our brothers who preceded us in faith, and do not place in our hearts any rancor against those who believe; Surely, Our Lord, you are Very-Kind, Very-Merciful.",
                            "verse 59:11": "Did you not see the hypocrites saying to their brothers from those of the people of the Book who are unbelievers, “If you are expelled, we will certainly go out with you, and we will never obey anyone about you.",
                            "verse 59:12": "If they are expelled, they will not go out with them, and if they are fought against, they will not help them.",
                            "verse 59:13": "In fact, your fear in their hearts is greater than (that of) Allah.",
                            "verse 59:14": "They do not fight you, even assembled together, but in fortified towns, or from behind the walls.",
                            "verse 59:15": "The example (of Banū NaDīr) is like those who were before them in near past, who tasted the evil consequence of their conduct, and for them (in the Hereafter) there is a painful punishment.",
                            "verse 59:16": "The example (of the hypocrites) is like the ShaiTān when he says to a human being, “Become disbeliever” then once he disbelieves, he says, “I disown you; I fear Allah, the Lord of the worlds.",
                            "verse 59:17": "So the end of both of them is that they will be in the Fire, living there forever.",
                            "verse 59:18": "O you who believe, fear Allah, and everybody must consider what he (or she) has sent ahead for tomorrow.",
                            "verse 59:19": "Do not be like those who forgot Allah, so He made them forget their own selves.",
                            "verse 59:20": "The people of Hell and the people of Paradise are not equal.",
                            "verse 59:21": "Had We sent down this Qur’ān to a mountain, you would have seen it humbled, burst apart out of awe for Allah.",
                            "verse 59:22": "He is Allah, besides whom there is no god, the Knower of the unseen and the seen.",
                            "verse 59:23": "He is Allah, besides whom there is no god, the Sovereign, the Supreme-In-Holiness, the Safe (from all defects), the Giver-Of-Peace, the Guardian, the All-Mighty, the All-Repairer, the Sublime.",
                            "verse 59:24": "He is Allah, the Creator, the Inventor, the Shaper."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 59:1": "All that is in the heavens and all that is in the earth glorifies God.",
                            "verse 59:2": "It is He Who expelled those who disbelieved of the People of the Scripture from their homelands at the first exile.",
                            "verse 59:3": "And had God not prescribed banishment for them, He would have chastised them in this world, and in the Hereafter there is for them the chastisement of the Fire.",
                            "verse 59:4": "That is because they defied God and His Messenger; and whoever defies God, indeed God is severe in retribution.",
                            "verse 59:5": "Whatever palm-trees you cut down or left standing on their roots, it was by God’s leave, and in order that He might disgrace those who are immoral.",
                            "verse 59:6": "And whatever spoils God has given to His Messenger from these, you did not spur for it any horses or camels, but God gives His messengers sway over whomever He will, and God has power over all things.",
                            "verse 59:7": "Whatever spoils God has given to His Messenger from the people of the towns, belong to God and to the Messenger and to the near of kin, and the orphans, and the needy, and the traveller, so that these do not become a thing circulating between the rich among you.",
                            "verse 59:8": "",
                            "verse 59:9": "the poor Emigrants who have been driven away from their homes and their possessions that they should seek bounty from God and beatitude and help God and His Messenger? Those — they are the sincere.",
                            "verse 59:10": "And those who had settled in the hometown, and [had abided] in faith before them, love those who have emigrated to them, and do not find in their breasts any need of that which those",
                            "verse 59:11": "have been given, but prefer",
                            "verse 59:12": "to themselves, though they be in poverty.",
                            "verse 59:13": "And those who will come after them say, ‘Our Lord, forgive us and our brethren who preceded us in",
                            "verse 59:14": "the faith, and do not place any rancour in our hearts toward those who believe.",
                            "verse 59:15": "Have you not considered the hypocrites who say to their brethren who disbelieve from among the People of the Scripture: ‘If you are expelled, we will assuredly go forth with you, and we will never obey anyone against you.",
                            "verse 59:16": "",
                            "verse 59:17": "indeed if they are expelled, they would not go forth with them, and if they are fought against, they would not help them.",
                            "verse 59:18": "You indeed arouse greater awe in their hearts than God.",
                            "verse 59:19": "They will not fight against you together, except in fortified towns or from behind some wall.",
                            "verse 59:20": "suppose them to be all together, but their hearts are disunited.",
                            "verse 59:21": "as the likeness of those who, recently before them tasted the evil consequences of their conduct.",
                            "verse 59:22": "Like Satan when he says to man, ‘Disbelieve!’; so that when he",
                            "verse 59:23": "disbelieves, he says, ‘Lo! I am absolved of you.",
                            "verse 59:24": "So the sequel for both will be that they are in the Fire, therein abiding.",
                            "verse 59:25": "O you who believe, fear God and let every soul consider what it has sent ahead for tomorrow.",
                            "verse 59:26": "And do not be like those who forget God, so that He makes them forget their own souls.",
                            "verse 59:27": "Not equal are the inhabitants of the Fire and the inhabitants of Paradise.",
                            "verse 59:28": "Had We sent down this Qur’ān upon a mountain, you would have surely seen it humbled, rent asunder by the fear of God.",
                            "verse 59:29": "He is God, than Whom there is no other god, Knower of the unseen and the visible.",
                            "verse 59:30": "He is God, than Whom there is no other god, the King, the Holy, the Peace, the Securer, the Guardian, the Mighty, the Compeller, the Exalted.",
                            "verse 59:31": "He is God, the Creator, the Maker, the Shaper."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 59:1": "Whatever is in the heavens and whatever is in the earth (all) glorify Allah and He alone is Almighty, Most Wise.",
                            "verse 59:2": "He is the One Who collected the disbelievers from amongst the People of the Book (i.",
                            "verse 59:3": "And had Allah not written exile for them, He would have tormented them (more severely) in the world.",
                            "verse 59:4": "That is because they showed extreme enmity against Allah and His Messenger (blessings and peace be upon him).",
                            "verse 59:5": "(O believers!) The palm-trees that you cut down or left standing upon their roots (during the siege of Banu Nadir tribe—it) was done by Allah’s command so that He might humiliate and disgrace the disobedient.",
                            "verse 59:6": "And whatever spoils (materials of fay) Allah restored to His Messenger ([blessings and peace be upon him] taking out) from them, you galloped neither horses nor camels in (procuring) them.",
                            "verse 59:7": "And whatever (materials of fay—spoils) Allah restored to His Messenger ([blessings and peace be upon him] taking out) from the people of (the towns captured without war in addition to those of Qurayza, Nadir, Fadak, Khaybar and ‘Urayna) belong to Allah and His Messenger (blessings and peace be upon him) and (the Messenger’s) near relatives (i.",
                            "verse 59:8": "(The fore-mentioned fay materials) are (also) for the poor Emigrants who are driven out of their houses and possessions (and properties).",
                            "verse 59:9": "(These spoils are for those Ansar",
                            "verse 59:10": "as well) who had taken the city (of Medina) and the faith as their home before (the Emigrants came).",
                            "verse 59:11": "And those (too) who came after these (Emigrants and the Ansar )",
                            "verse 59:12": "submit: ‘O our Lord, forgive us and our brothers who have preceded in embracing faith.",
                            "verse 59:13": "Have you not seen the hypocrites who say to their brothers amongst the People of the Book who have become disbelievers: ‘If you are driven out (from here), we too will necessarily leave with you and will never obey anyone in your case, and if you are attacked, we will most certainly help you’? But Allah bears witness that they are certainly liars.",
                            "verse 59:14": "If they (the mischief-monger Jews) are driven out (from Medina), these (hypocrites) will never leave with them.",
                            "verse 59:15": "(O Muslims!) Indeed, they have greater fear of you in their hearts than Allah’s.",
                            "verse 59:16": "They (the Jews of Medina, who breached the treaty, and the hypocrites) will not be able to fight against you (even) allied, except in fortified towns or taking cover behind walls.",
                            "verse 59:17": "(Their plight) resembles those who have tasted the evil consequences of their works shortly before them (i.",
                            "verse 59:18": "(The example of hypocrites) is like that of Satan when he says to man: ‘Become a disbeliever,’ but when he disbelieves, he (Satan) says: ‘I feel sick of you.",
                            "verse 59:19": "Then both of them will end up in Hell and will dwell in it forever.",
                            "verse 59:20": "O believers! Keep fearing Allah.",
                            "verse 59:21": "And be not like those who forgot Allah.",
                            "verse 59:22": "The inmates of Hell and the people of Paradise cannot be equal.",
                            "verse 59:23": "Had We sent down this Qur’an on some mountain, then, (O listener,) you would certainly have seen it bowed, split and crushed to pieces for fear of Allah.",
                            "verse 59:24": "Allah is He besides Whom there is no God: the Knower of the unseen and the seen.",
                            "verse 59:25": "Allah is He apart from Whom there is no God: (the Real) King, the Most Pure of all shortcomings, Perfectly Free from all imperfections (and the Bestower of Peace), the Giver of security and protection (and the Attester of the Messengers by means of Miracles), the Guardian and Watchful, the Almighty and the Lord of Honour, the Lord of Great Majesty, the Supreme Authority and the Supremely Great.",
                            "verse 59:26": "Allah is He Who is the Creator, the One Who brings into existence from nothingness (i."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Kaikki, mitä on taivaassa, ja kaikki, mitä on maassa, julistaa Jumalan kunniaa, sillä Hän on kaikkivoipa, viisas.",
                            "verse 59:2": "Hän ensimmäisessä maastamuutossa karkoitti kodeistaan ne Pyhän kirjan saajista , jotka olivat epäuskoisia.",
                            "verse 59:3": "Ja ellei Jumala olisi määrännyt heille karkoitusta, Hän olisi varmasti antanut heille kärsimyksiä tässä maailmassa; ja tulevassa elämässä heitä odottaa tulen tuska.",
                            "verse 59:4": "Näin on, koska he vastustivat Jumalaa ja Hänen sananjulistajaansa; sillä jos joku vastustaa Jumalaa, on Jumala totisesti ankara rangaistessaan.",
                            "verse 59:5": "Jos olette kaataneet jonkun palmun tai jättäneet sen pystyyn juurilleen, on tämä tapahtunut Jumalan tahdosta ja jotta Hän saattaisi tottelemattomat häpeään.",
                            "verse 59:6": "Ja noilta ihmisiltä saatua sotasaalista, jonka Jumala antoi sananjulistajalleen, ei saatu siksi, että te ahdistitte heitä hevosin tai ratsukameelein, vaan Jumala antaa sananjulistajilleen vallan kenen suhteen tahtoo, sillä Jumala voi tehdä kaiken, mitä haluaa.",
                            "verse 59:7": "Ja kaupunkien asukkailta otettu saalis, jonka Jumala on antanut sanansaattajalleen, kuuluu Jumalalle ja Hänen sananjulistajalleen, läheisille sukulaisille, orvoille, köyhille ja maankiertäjille, jotta sitä ei jaettaisi niiden kesken teistä, jotka ovat rikkaita.",
                            "verse 59:8": "Osa saaliista on köyhiä varten, jotka pakenivat, jotka häädettiin kodeistaan ja joilta riistettiin omaisuus heidän etsiessään Jumalan armoa ja mielisuosiota ja auttaessaan Jumalaa ja Hänen sananjulistajaansa.",
                            "verse 59:9": "Ne, jotka ovat saaneet kodin ja uskon ennen heitä, rakastavat niitä, jotka pakenevat heidän turviinsa, eivätkä sydämessään kaipaa sitä, mitä näille on annettu.",
                            "verse 59:10": "Ne, jotka tulevat heidän jälkeensä, sanovat: »Herra, anna anteeksi meille ja meidän veljillemme, jotka ovat olleet ennen meitä uskossa, äläkä salli meidän tuntea kaunaa sydämissämme niitä kohtaan, jotka uskovat.",
                            "verse 59:11": "Ajattale niitä, joista on tullut teeskentelijöitä.",
                            "verse 59:12": "Jos nuo karkoitetaan, eivät he lähde heidän kanssaan, ja jos noita vastaan taistellaan, eivät he auta heitä, ja vaikka ryhtyisivätkin auttamaan heitä, niin kääntävät heille varmasti selkänsä, eivätkä he kuitenkaan apua saa.",
                            "verse 59:13": "Totisesti on heillä sydämissään suurempi pelko teitä (muslimeja) kuin Jumalaa kohtaan, sillä he ovat ymmärtämättömiä ihmisiä.",
                            "verse 59:14": "He eivät taistele teitä vastaan joukkona, vaan linnoitetuissa kaupungeissa tai muurien takaa.",
                            "verse 59:15": "He ovat juuri kuin edeltäjänsä, jotka äsken saivat kokea tekojensa onnettomat seuraukset; heitä odottaa tuska ja vaiva.",
                            "verse 59:16": "Heidän laitansa on kuin saatanan, joka sanoi ihmiselle: »Älä usko», mutta kun tämä luopui uskostaan, hän sanoi: »Totisesti minulla ei ole mitään tekemistä sinun kanssasi; totisesti minä pelkään Jumalaa, kaikkien maailmojen Herraa.",
                            "verse 59:17": "Mutta kummankin loppu on se, että he joutuvat tuleen ainiaaksi.",
                            "verse 59:18": "Te, jotka uskotte, pelätkää Jumalaa.",
                            "verse 59:19": "Älkää olko niinkuin ne, jotka unohtavat Jumalan, niin että Hän antaa heidän unohtaa oman sielunsa.",
                            "verse 59:20": "Eivät ole toistensa kaltaisia tulen ja paratiisin asukkaat.",
                            "verse 59:21": "Jos olisimme lähettänyt tämän Koraanin vuorelta, niin olisit varmasti nähnyt sen sortuvan ja pirstoutuvan Jumalan pelosta.",
                            "verse 59:22": "Hän on Jumala, ja paitsi Häntä ei ole muuta jumaluutta; Hän tuntee salatun ja näkyvän.",
                            "verse 59:23": "Hän on Jumala, ja paitsi Häntä ei ole muuta jumaluutta, kuningas, pyhä, rauhantuoja, turvanantaja, kaiken suojelija, kaikkivoipa, korkein, kaiken suuruuden alkulähde.",
                            "verse 59:24": "Hän on Jumala, luoja, alkuunpanija, muodostaja; Hänelle kuuluvat kaikki erinomaiset nimet."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 59:1": "Tout ce qui est dans les cieux et tout ce qui est sur la terre glorifie Dieu.",
                            "verse 59:2": "C'est Lui qui a fait sortir de leurs demeures, lors du premier rassemblement, ceux des Gens du Livre qui avaient fait preuve de mécréance.",
                            "verse 59:3": "Si Dieu n'avait pas décrété leur bannissement, Il les aurait certainement châtiés en ce monde ; mais dans l'autre monde les attend le châtiment du Feu.",
                            "verse 59:4": "Il en est ainsi, parce qu'ils ont fait scission avec Dieu et Son Envoyé.",
                            "verse 59:5": "Les palmiers que vous avez coupés, comme ceux que vous avez laissés debout l'ont tous été avec la permission de Dieu et pour confondre les pervers.",
                            "verse 59:6": "Quant au butin pris sur eux, que Dieu octroie à Son Envoyé, vous n'avez fourni ni chevaux, ni montures pour y avoir droit.",
                            "verse 59:7": "Le butin pris sur les habitants des cités, que Dieu octroie à Son Envoyé, est destiné à Dieu et à l'Envoyé, ainsi qu'aux proches parents, aux orphelins, aux pauvres, au voyageur, et il ne doit pas être partagé avec ceux d'entre vous qui sont riches.",
                            "verse 59:8": "[Le butin est destiné] aux Emigrés (Muhâjirûn) pauvres, qui ont été expulsés de leurs maisons et privés de leurs biens en cherchant à obtenir la grâce de Dieu et Sa satisfaction et en prêtant assistance à Dieu et à Son Envoyé.",
                            "verse 59:9": "Quant à ceux (les Auxiliaires - Ansâr - de Médine) qui s'étaient établis avant eux dans cette cité (Médine) et dans la foi, ils aiment ceux qui ont émigré vers eux et ne trouvent dans leurs cœurs nul motif d'envie pour ce qui a été donné à ces émigrés.",
                            "verse 59:10": "Quant à ceux qui sont venus après les Emigrés, ils disent : \" Notre Seigneur ! Pardonnenous ainsi qu'à ceux de nos frères qui nous ont précédés dans la foi.",
                            "verse 59:11": "Ne vois-tu pas les hypocrites, comment ils disent à ceux de leurs frères qui sont devenus mécréants parmi les Gens du Livre : \" Si vous êtes expulsés, nous partirons avec vous et nous n'obéirons jamais à quiconque s'en prendrait à vous.",
                            "verse 59:12": "Si les Gens du Livre sont expulsés, les hypocrites ne partiront pas avec eux.",
                            "verse 59:13": "En fait, vous jetez dans leurs cœurs plus d'effroi que Dieu lui-même, parce que ce sont des gens qui n'entendent pas raison.",
                            "verse 59:14": "Ils ne vous combattront ensemble que retranchés dans des cités fortifiées ou derrière des murailles.",
                            "verse 59:15": "Ils sont semblables à ceux qui, peu de temps avant eux, ont goûté les conséquences de leur conduite et subi un châtiment douloureux.",
                            "verse 59:16": "Ils sont semblables au Démon quand il dit à l'homme \" Mécrois ! \" Mais quand celui-ci mécroit, il dit : \" Je te désavoue ! Moi, je crains Dieu, le Seigneur des mondes \".",
                            "verse 59:17": "Leur fin à tous deux sera le Feu, où ils demeureront à jamais.",
                            "verse 59:18": "O vous qui croyez ! Craignez Dieu, et que chacun considère ce qu'il a avancé pour demain ! Craignez Dieu ! Certes, Dieu est parfaitement instruit de ce que vous faites.",
                            "verse 59:19": "Ne soyez pas comme ceux qui oublient Dieu ; car Dieu fait qu'ils s'oublient euxmêmes.",
                            "verse 59:20": "Les hôtes du Feu et ceux du Paradis ne sont pas égaux.",
                            "verse 59:21": "Si Nous avions fait descendre ce Coran sur une montagne, tu aurais vu celle-ci s'humilier et se fendre par crainte de Dieu.",
                            "verse 59:22": "Il est Dieu - Allâh -, il n'y a de dieu que Lui ! Il est Celui qui connaît ce qui est caché et ce qui est apparent.",
                            "verse 59:23": "Il est Dieu ; il n'y a de dieu que Lui !, le Roi, le Saint, la Paix, le Fiable, le Vigilant, l'Omnipotent, l'Irrésistible, l'Inatteignable.",
                            "verse 59:24": "Il est Dieu ! Le Créateur, Celui qui existencie, Celui qui façonne ! A Lui les plus beaux Noms."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 59:1": "Ce qui est dans les cieux et ce qui est sur la terre glorifient Dieu, et Il est le Puissant, le Sage.",
                            "verse 59:2": "C’est Lui qui a expulsé de leurs maisons, ceux parmi les gens du Livre qui ne croyaient pas, lors du premier exode .",
                            "verse 59:3": "Et si Dieu n’avait pas prescrit contre eux l’expatriation, Il les aurait certainement châtiés ici-bas; et dans l’au-delà ils auront le châtiment du Feu.",
                            "verse 59:4": "Il en est ainsi parce qu’ils se sont dressés contre Dieu et Son messager.",
                            "verse 59:5": "Tout palmier que vous avez coupé ou que vous avez laissé debout sur ses racines, c’est avec la permission de Dieu et afin qu’Il couvre ainsi d’ignominie les pervers.",
                            "verse 59:6": "Le butin provenant de leurs biens et que Dieu a accordé sans combat à Son Messager, vous n’y aviez engagé ni chevaux, ni chameaux; mais Dieu donne à Ses messagers la domination sur qui Il veut, et Dieu est Omnipotent.",
                            "verse 59:7": "Le butin provenant [des biens] des habitants des cités, que Dieu a accordé sans combat à Son Messager, appartient à Dieu, au Messager, aux proches parents, aux orphelins, aux pauvres et au voyageur en détresse, afin que cela ne circule pas parmi les seuls riches d’entre vous.",
                            "verse 59:8": "[Il appartient aussi] aux émigrés besogneux qui ont été expulsés de leurs demeures et de leurs biens, tandis qu’ils recherchaient une grâce et un agrément de Dieu, et qu’ils portaient secours à (la cause d’) Dieu et à Son Messager.",
                            "verse 59:9": "Il [appartient également] à ceux qui, avant eux, se sont installés dans le pays et dans la foi, qui aiment ceux qui émigrent vers eux, et ne ressentent dans leurs coeurs aucune envie pour ce que [ces immigrés] ont reçu, et qui",
                            "verse 59:10": "préfèrent à eux-mêmes, même s’il y a pénurie chez eux.",
                            "verse 59:11": "Et [il appartient également] à ceux qui sont venus après eux en disant : «Seigneur, pardonne-nous, ainsi qu’à nos frères qui nous ont précédés dans la foi; et ne mets dans nos coeurs aucune rancoeur pour ceux qui ont cru.",
                            "verse 59:12": "N’as-tu pas vu les hypocrites disant à leurs confrères qui ont mécru parmi les gens du Livre : «Si vous êtes chassés, nous partirons certes avec vous et nous n’obéirons jamais à personne contre vous; et si vous êtes attaqués, nous vous secourrons certes».",
                            "verse 59:13": "S’ils sont chassés, ils ne partiront pas avec eux; et s’ils sont attaqués, ils ne les secourront pas; et même s’ils allaient à leur secours, ils tourneraient sûrement le dos; puis ils ne seront point secourus.",
                            "verse 59:14": "Vous jetez dans leurs coeurs plus de terreur que Dieu.",
                            "verse 59:15": "Tous ne vous combattront que retranchés dans des cités fortifiées ou de dernière des murailles.",
                            "verse 59:16": "ils sont semblables à ceux qui, peu de temps avant eux, ont goûté la conséquence de leur comportement et ils auront un châtiment douloureux ;",
                            "verse 59:17": "ils sont semblables au Diable quand il dit à l’homme : «Sois incrédule».",
                            "verse 59:18": "Ils eurent pour destinée d’être tous deux dans le Feu pour y demeurer éternellement.",
                            "verse 59:19": "ô vous qui avez cru ! Craignez Dieu.",
                            "verse 59:20": "Et ne soyez pas comme ceux qui ont oublié Dieu;",
                            "verse 59:21": "leur a fait alors oublier leur propres personnes; ceux-là sont les pervers.",
                            "verse 59:22": "Ne seront pas égaux les gens du Feu et les gens du Paradis.",
                            "verse 59:23": "Si Nous avions fait descendre ce Coran sur une montage, tu l’aurais vu s’humilier et se fendre par crainte de Dieu.",
                            "verse 59:24": "C’est Lui Dieu.",
                            "verse 59:25": "C’est Lui, Dieu.",
                            "verse 59:26": "C’est Lui Dieu, le Créateur, Celui qui donne un commencement à toute chose, le Formateur."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Alles, was in den Himmeln, und alles, was auf Erden ist, preist Allah; und Er ist der Allmächtige, der Allweise.",
                            "verse 59:2": "Er ist es, Der diejenigen von dem Volk der Schrift, die ungläubig waren, austrieb aus ihren Heimstätten bei dem ersten Heerbann.",
                            "verse 59:3": "Und wäre es nicht so gewesen, daß Allah für sie Verbannung angeordnet hatte, Er hätte sie sicherlich hienieden bestraft, und im Jenseits wird ihnen die Strafe des Feuers.",
                            "verse 59:4": "Dies, weil sie sich Allah widersetzten und Seinem Gesandten; und wer sich Allah widersetzt - wahrlich, dann ist Allah streng im Strafen.",
                            "verse 59:5": "Was ihr umgehauen habt an Palmen oder auf ihren Wurzeln stehen ließet, es geschah mit Allahs Erlaubnis und damit Er die Übertreter in Schmach stürze.",
                            "verse 59:6": "Und was Allah Seinem Gesandten als Beute von ihnen gegeben hat, ihr habt weder Roß noch Kamel dazu angespornt; aber Allah gibt Seinen Gesandten Gewalt über wen Er will: und Allah vermag alle Dinge zu tun.",
                            "verse 59:7": "Was Allah Seinem Gesandten als Beute von den Bewohnern der Städte gegeben hat, das ist für Allah und für den Gesandten und für die nahen Verwandten und die Waisen und die Armen und den Wanderer, damit es nicht bloß bei den Reichen unter euch die Runde mache.",
                            "verse 59:8": "(Es ist) für die armen Flüchtlinge, die von ihren Heimstätten und ihren Besitztümern vertrieben wurden, indes sie nach Allahs Huld und Wohlgefallen trachteten und Allah und Seinem Gesandten beistanden.",
                            "verse 59:9": "Und jene, die vor ihnen in der Stadt wohnten und im Glauben (beharrten), lieben jene, die bei ihnen Zuflucht suchten, und finden in ihrer Brust keinen Wunsch nach dem, was ihnen gegeben ward, sondern sehen (die Flüchtlinge gern) vor sich selber bevorzugt, auch wenn sie selbst in Dürftigkeit sind.",
                            "verse 59:10": "Und die nach ihnen kamen, sprechen: «Unser Herr, vergib uns und unseren Brüdern, die uns im Glauben vorangingen, und lasse in unseren Herzen keinen Groll gegen die Gläubigen.",
                            "verse 59:11": "Hast du nicht die beobachtet, die Heuchler sind? Sie sprechen zu ihren Brüdern, die ungläubig sind unter dem Volk der Schrift: «Wenn ihr vertrieben werdet, so werden wir sicherlich mit euch ziehen, und wir werden nie jemandem gegen euch gehorchen; und wenn ihr angegriffen werdet, so werden wir euch sicherlich helfen.",
                            "verse 59:12": "Wenn sie vertrieben werden, sie würden nie mit ihnen ausziehen; und wenn sie angegriffen werden, sie würden ihnen niemals helfen.",
                            "verse 59:13": "Wahrlich, sie hegen größere Furcht vor euch in ihren Herzen als vor Allah.",
                            "verse 59:14": "Sie würden euch nicht bekämpfen - nicht einmal alle zusammen -, außer in befestigten Städten oder hinter Mauern, (obgleich) ihre Heldentaten untereinander groß sind.",
                            "verse 59:15": "Gleich jenen, die kurz vor ihnen die bösen Folgen ihrer Handlungsweise kosteten.",
                            "verse 59:16": "Gleich Satan, wenn er zu dem Menschen spricht: «Sei ungläubig!»; ist er aber ungläubig, so spricht er: «Ich habe nichts mit dir zu schaffen, denn ich fürchte Allah, den Herrn der Welten.",
                            "verse 59:17": "Und das Ende beider wird sein, daß sie im Feuer sein werden und darin bleiben.",
                            "verse 59:18": "O die ihr glaubt, fürchtet Allah; und eine jede Seele schaue nach dem, was sie für morgen vorausschickt.",
                            "verse 59:19": "Und seid nicht gleich jenen, die Allah vergaßen und die Er darum ihre eignen Seelen vergessen ließ.",
                            "verse 59:20": "Nicht gleich sind die Bewohner des Feuers und die Bewohner des Gartens.",
                            "verse 59:21": "Hätten Wir diesen Koran auf einen Berg herabgesandt, du hättest gesehen, wie er sich demütigte und sich spaltete aus Furcht vor Allah.",
                            "verse 59:22": "Er ist Allah, außer Dem es keinen Gott gibt, der Wisser des Ungesehenen und des Sichtbaren.",
                            "verse 59:23": "Er ist Allah, außer Dem es keinen Gott gibt, der König, der Heilige, der Eigner des Friedens, der Gewährer von Sicherheit, der Beschützer, der Allmächtige, der Verbesserer, der Majestätische.",
                            "verse 59:24": "Er ist Allah, der Schöpfer, der Bildner, der Gestalter."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "tks pht+ vklekuksa esa gS vkSj tks pht+ t+ehu esa gS ¼lc½ [+kqnk dh rLchg djrh gSa vkSj ogh x+kfyc fgder okyk gS",
                            "verse 59:2": "ogh rks gS ftlus dq¶+Q+kj ,gys fdrkc ¼cuh uqtS+j½ dks igys g’kz ¼ft+yk, oru½ esa muds ?kjksa ls fudky ckgj fd;k ¼eqlyekuksa½ rqedks rks ;s oge Hkh u Fkk fd og fudy tk,¡xs vkSj og yksx ;s le>s gq;s Fks fd muds fd+ys mudks [+kqnk ¼ds vt+kc½ ls cpk ysaxs exj tgk¡ ls mudks [+;ky Hkh u Fkk [+kqnk us mudks vk fy;k vkSj muds fnyksa essa ¼eqlyekuksa½ dks jkSc Mky fn;k fd og yksx [+kqn vius gkFkksa ls vkSj eksfeuhu ds gkFkksa ls vius ?kjksa dks mtkM+us yxs rks ,s vk¡[k okyksa bcjr gkfly djks",
                            "verse 59:3": "vkSj [+kqnk us mudh fdler esa ft+yk oruh u fy[kk gksrk rks mu ij nqfu;k esa Hkh ¼nwljh rjg½ vt+kc djrk vkSj vk[+ksjr esa rks mu ij tgUuqe dk vt+kc gS gh",
                            "verse 59:4": ";s blfy, fd mu yksxksa us [+kqnk vkSj mlds jlwy dh eq[+kkysQ+r dh vkSj ftlus [+kqnk dh eq[+kkysQ+r dh rks ¼;kn jgs fd½ [+kqnk cM+k l[+r vt+kc nsus okyk gS",
                            "verse 59:5": "¼eksfeuksa½ [ktwj dk nj[+r tks rqeus dkV Mkyk ;k tw¡ dk r¡w ls mudh tM+ksa ij [kM+k jgus fn;k rks [+kqnk gh ds gqD+e ls vkSj eryc ;s Fkk fd og ukQjekuksa dks :lok djs",
                            "verse 59:6": "¼rks½ tks eky [+kqnk us vius jlwy dks mu yksxksa ls cs yM+s fnyok fn;k mlesa rqEgkj gd+ ugha D;ksafd rqeus mlds fy, dqN nkSM+ /kwi rks dh gh ugha] u ?kksM+ksa ls u Å¡Vksa ls] exj [+kqnk vius iSx+Ecjksa dks ftl ij pkgrk gS x+yck vrk Qjekrk gS vkSj [+kqnk gj pht+ ij d+kfnj gS",
                            "verse 59:7": "rks tks eky [+kqnk us vius jlwy dks nsgkr okyksa ls cs yM+s fnyok;k gS og [+kkl [+kqnk vkSj mlds jlwy vkSj ¼jlwy ds½ d+jkcrnkjksa vkSj ;rheksa vkSj eksgrktksa vkSj ijnsfl;ksa dk gS rkfd tks yksx rqeesa ls nkSyreUn gSa fgj fQj dj nkSyr mUgha esa u jgs] gk¡ tks rqedks jlwy nsa nsa og ys fy;k djks vkSj ftlls euk djsa mlls ckt+ jgks vkSj [+kqnk ls Mjrs jgks cs’kd [+kqnk l[+r vt+kc nsus okyk gS",
                            "verse 59:8": "¼bl eky esa½ mu eqQfyl eqgkftjksa dk fgLlk Hkh gS tks vius ?kjksa ls vkSj ekyksa ls fudkys ¼vkSj vyx fd,½ x, ¼vkSj½ [+kqnk ds Q+t+y o [+kq’kuwnh ds rycxkj gSa vkSj [+kqnk dh vkSj mlds jlwy dh enn djrs gSa ;gh yksx lPps bekunkj gSa vkSj ¼mudk Hkh fgLlk gS½",
                            "verse 59:9": "tks yksx eksgktsjhu ls igys ¼fgtjr ds½ ?kj ¼enhuk½ esa eqd+he gSa vkSj bZeku esa ¼eqlrfd+y½ jgs vkSj tks yksx fgtjr djds muds ikl vk, muls eksgCcr djrs gSa vkSj tks dqN mudks feyk mlds fy, vius fnyksa esa dqN x+jt+ ugha ikrs vkSj vxjps vius Åij raxh gh D;ksa u gks nwljksa dks vius u¶+l ij rjthg nsrs gSa vkSj tks Ó[+l vius u¶l dh fglZ ls cpk fy;k x;k rks ,sls gh yksx viuh fnyh eqjknsa ik,¡xs",
                            "verse 59:10": "vkSj mudk Hkh fgLlk gS vkSj tks yksx mu ¼eksgktsjhu½ ds ckn vk, ¼vkSj½ nqvk djrs gSa fd ijojfnxkjk gekjh vkSj mu yksxksa dh tks gels igys bZeku yk pqds ex+Qs+jr dj vkSj eksfeuksa dh rjQ ls gekjs fnyksa esa fdlh rjg dk dhuk u vkus ns ijojfnxkj cs’kd rw cM+k ÓQhd+ fugk;r jge okyk gS",
                            "verse 59:11": "D;k rqeus mu equkfQ+dksa dh gkyr ij ut+j ugha dh tks vius dkfQ+j Hkkb;ksa ,gys fdrkc ls dgk djrs gSa fd vxj dgha rqe ¼?kjksa ls½ fudkys x, rks ;d+hu tkuksa fd ge Hkh rqEgkjs lkFk ¼t+:j½ fudy [kM+s gksaxs vkSj rqEgkjs ckjs esa dHkh fdlh dh brkvr u djasxs vkSj vxj rqels yM+kbZ gksxh rks t+:j rqEgkjh enn djsaxs] exj [+kqnk c;ku fd, nsrk gS fd ;s yksx ;d+huu >wBs gSa",
                            "verse 59:12": "vxj dq¶+Q+kj fudkys Hkh tk,¡ rks ;s equkQs+d+hu muds lkFk u fudysaxs vkSj vxj muls yM+kbZ gq;h rks mudh enn Hkh u djsaxs vkSj ;d+huu djsaxs Hkh rks ihB Qsj dj Hkkx tk,¡xs",
                            "verse 59:13": "fQj mudks dgha ls dqed Hkh u feysxh ¼eksfeuksa½ rqEgkjh gScr muds fnyksa esa [+kqnk ls Hkh c<+dj gS] ;s bl otg ls fd ;s yksx le> ugha j[krs",
                            "verse 59:14": ";s lc ds lc feydj Hkh rqels ugha yM+ ldrs] exj gj rjQ ls egQwt+ cfLr;ksa esa ;k ¼Ógj iukg dh½ nhokjksa dh vkM+ esa budh vkil esa rks cM+h /kkd gS fd rqe [+;ky djksxs fd lc ds lc ¼,d tku½ gSa exj muds fny ,d nwljs ls QVs gq, gSa ;s bl otg ls fd ;s yksx csvD+y gSa",
                            "verse 59:15": "mudk gky mu yksxksa dk lk gS tks muls dqN gh is’krj vius dkeksa dh lt+k dk et+k p[k pqds gSa vkSj muds fy, nnZukd vt+kc gS",
                            "verse 59:16": "¼equkfQ+dksa½ dh felky ÓSrku dh lh gS fd bUlku ls dgrk jgk fd dkfQ+j gks tkvks] fQj tc og dkfQ+j gks x;k rks dgus yxk eSa rqels cst+kj gw¡ eSa lkjs tgk¡ ds ijojfnxkj ls Mjrk gw¡",
                            "verse 59:17": "rks nksuksa dk urhtk ;s gqvk fd nksuksa nkst+[+k esa ¼Mkys½ tk,¡xs vkSj mlesa ges’kk jgsaxs vkSj ;gh reke t+kfyeksa dh lt+k gS",
                            "verse 59:18": ",s bZekunkjksa [+kqnk ls Mjks] vkSj gj Ó[+l dks x+kSj djuk pkfg, fd dy d+;ker ds okLrs mlus igys ls D;k Hkstk gS vkSj [+kqnk gh ls Mjrs jgks css’kd tks dqN rqe djrs gks [+kqnk mlls ck[+kcj gS",
                            "verse 59:19": "vkSj mu yksxksa ds tSls u gks tkvks tks [+kqnk dks Hkqyk cSBs rks [+kqnk us mUgsa ,slk dj fn;k fd og vius vkidks Hkwy x, ;gh yksx rks cn fdjnkj gSa",
                            "verse 59:20": "tgUuqeh vkSj tUurh fdlh rjg cjkcj ugha gks ldrs tUurh yksx gh rks dke;kch gkfly djus okys gSa",
                            "verse 59:21": "vxj ge bl d+qjku dks fdlh igkM+ ij ¼Hkh½ ukft+y djrs rks rqe mldks ns[krs fd [+kqnk ds Mj ls >qdk vkSj QVk tkrk gS ;s felkysa ge yksxksa ¼ds le>kus½ ds fy, c;ku djrs gSa rkfd og x+kSj djsa",
                            "verse 59:22": "ogh [+kqnk gS ftlds flok dksbZ ekcwn ugha] iks’khnk vkSj t+kfgj dk tkuus okyk ogh cM+k esgjcku fugk;r jge okyk gS",
                            "verse 59:23": "ogh og [+kqnk gS ftlds flok dksbZ d+kfcys bcknr ugha ¼gd+hd+h½ ckn’kkg] ikd t+kr ¼gj ,sc ls½ cjh veu nsus okyk fuxsgcku] x+kfyc t+cjnLr cM+kbZ okyk ;s yksx ftldks ¼mldk½ Ójhd Bgjkrs gSa",
                            "verse 59:24": "mlls ikd gS ogh [+kqnk ¼reke pht+ksa dk [+kkfyd½ eqftn lwjrksa dk cukus okyk mlh ds vPNs vPNs uke gSa tks pht+s lkjs vkleku o t+ehu esa gSa lc mlh dh rlchg djrh gSa] vkSj ogh x+kfyc fgder okyk gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Bertasbih kepada Allah apa yang ada di langit dan apa yang ada di bumi dan Dia-lah Yang Maha Perkasa lagi Maha Bijaksana.",
                            "verse 59:2": "Dia-lah yang mengeluarkan orang-orang kafir di antara ahli Kitab dari kampung-kampung mereka pada saat pengusiran kali yang pertama.",
                            "verse 59:3": "Dan jika tidaklah karena Allah telah menetapkan pengusiran terhadap mereka benar-benar Allah mengazab mereka di dunia.",
                            "verse 59:4": "Yang demikian itu adalah karena sesungguhnya mereka menentang Allah dan Rasul-Nya.",
                            "verse 59:5": "Apa saja yang kamu tebang dari pohon kurma (milik orang-orang kafir) atau yang kamu biarkan (tumbuh) berdiri di atas pokoknya, maka (semua itu) adalah dengan izin Allah; dan karena Dia hendak memberikan kehinaan kepada orang-orang fasik.",
                            "verse 59:6": "Dan apa saja harta rampasan (fai-i) yang diberikan Allah kepada Rasul-Nya (dari harta benda) mereka, maka untuk mendapatkan itu kamu tidak mengerahkan seekor kudapun dan (tidak pula) seekor untapun, tetapi Allah yang memberikan kekuasaan kepada Rasul-Nya terhadap siapa yang dikehendaki-Nya.",
                            "verse 59:7": "Apa saja harta rampasan (fai-i) yang diberikan Allah kepada Rasul-Nya yang berasal dari penduduk kota-kota maka adalah untuk Allah, Rasul, kerabat Rasul, anak-anak yatim, orang-orang miskin dan orang-orang yang dalam perjalanan, supaya harta itu jangan hanya beredar di antara orang-orang kaya saja di antara kamu.",
                            "verse 59:8": "(Juga) bagi para fakir yang berhijrah yang diusir dari kampung halaman dan dari harta benda mereka (karena) mencari karunia dari Allah dan keridhaan (Nya) dan mereka menolong Allah dan Rasul-Nya.",
                            "verse 59:9": "Dan orang-orang yang telah menempati Kota Madinah dan telah beriman (Ansar) sebelum (kedatangan) mereka (Muhajirin), mereka mencintai orang yang berhijrah kepada mereka.",
                            "verse 59:10": "Dan orang-orang yang datang sesudah mereka (Muhajirin dan Ansar), mereka berdo’a: \"Ya Tuhan kami, beri ampunlah kami dan saudara-saudara kami yang telah beriman lebih dahulu dari kami, dan janganlah Engkau membiarkan kedengkian dalam hati kami terhadap orang-orang yang beriman; Ya Tuhan kami, sesungguhnya Engkau Maha Penyantun lagi Maha Penyayang\".",
                            "verse 59:11": "Apakah kamu tiada memperhatikan orang-orang munafik yang berkata kepada saudara-saudara mereka yang kafir di antara ahli Kitab: \"Sesungguhnya jika kamu diusir niscaya kamipun akan keluar bersama kamu; dan kami selama-lamanya tidak akan patuh kepada siapapun untuk (menyusahkan) kamu, dan jika kamu diperangi pasti kami akan membantu kamu\".",
                            "verse 59:12": "Sesungguhnya jika mereka diusir, orang-orang munafik itu tiada akan keluar bersama mereka, dan sesungguhnya jika mereka diperangi; niscaya mereka tiada akan menolongnya; sesungguhnya jika mereka menolongnya niscaya mereka akan berpaling lari ke belakang, kemudian mereka tiada akan mendapat pertolongan.",
                            "verse 59:13": "Sesungguhnya kamu dalam hati mereka lebih ditakuti daripada Allah.",
                            "verse 59:14": "Mereka tiada akan memerangi kamu dalam keadaan bersatu padu, kecuali dalam kampung-kampung yang berbenteng atau di balik tembok.",
                            "verse 59:15": "(Mereka adalah) seperti orang-orang Yahudi yang belum lama sebelum mereka telah merasai akibat buruk dari perbuatan mereka dan bagi mereka azab yang pedih.",
                            "verse 59:16": "(Bujukan orang-orang munafik itu adalah) seperti (bujukan) syaitan ketika dia berkata kepada manusia: \"Kafirlah kamu\", maka tatkala manusia itu telah kafir ia berkata: \"Sesungguhnya aku berlepas diri dari kamu karena sesungguhnya aku takut kepada Allah Tuhan semesta alam\".",
                            "verse 59:17": "Maka adalah kesudahan keduanya, bahwa sesungguhnya keduanya (masuk) ke dalam neraka, mereka kekal di dalamnya.",
                            "verse 59:18": "Hai orang-orang yang beriman, bertakwalah kepada Allah dan hendaklah setiap diri memperhatikan apa yang telah diperbuatnya untuk hari esok (akhirat), dan bertakwalah kepada Allah, sesungguhnya Allah Maha Mengetahui apa yang kamu kerjakan.",
                            "verse 59:19": "Dan janganlah kamu seperti orang-orang yang lupa kepada Allah, lalu Allah menjadikan mereka lupa kepada diri mereka sendiri.",
                            "verse 59:20": "Tiada sama penghuni-penghuni neraka dengan penghuni-penghuni surga; penghuni-penghuni surga itulah orang-orang yang beruntung.",
                            "verse 59:21": "Kalau sekiranya Kami menurunkan Al Qur’an ini kepada sebuah gunung, pasti kamu akan melihatnya tunduk terpecah belah disebabkan takut kepada Allah.",
                            "verse 59:22": "Dia-lah Allah Yang tiada Tuhan (yang berhak disembah) selain Dia, Yang Mengetahui yang ghaib dan yang nyata, Dia-lah Yang Maha Pemurah lagi Maha Penyayang.",
                            "verse 59:23": "Dia-lah Allah Yang tiada Tuhan (yang berhak disembah) selain Dia, Raja, Yang Maha Suci, Yang Maha Sejahtera, Yang Mengaruniakan keamanan, Yang Maha Memelihara, Yang Maha Perkasa, Yang Maha Kuasa, Yang Memiliki segala keagungan, Maha Suci Allah dari apa yang mereka persekutukan.",
                            "verse 59:24": "Dia-lah Allah Yang Menciptakan, Yang Mengadakan, Yang Membentuk Rupa, Yang Mempunyai Nama-Nama Yang Paling baik."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Glorifica Allah ciò che è nei cieli e ciò che è sulla terra .",
                            "verse 59:2": "Egli è Colui che ha fatto uscire dalle loro dimore , in occasione del primo esodo , quelli fra la gente della Scrittura che erano miscredenti.",
                            "verse 59:3": "E se Allah non avesse decretato il loro bando, li avrebbe certamente castigati in questa vita: nell'altra vita avranno il castigo del Fuoco,",
                            "verse 59:4": "poiché si opposero ad Allah e al Suo Inviato.",
                            "verse 59:5": "Tutte le palme che abbatteste e quelle che lasciaste ritte sulle loro radici, fu con il permesso di Allah , affinché Egli copra gli empi di ignominia.",
                            "verse 59:6": "Il bottino che Allah concesse",
                            "verse 59:7": "al Suo Inviato; non faceste correre [per conquistarlo] né cavalli, né cammelli .",
                            "verse 59:8": "Il bottino che Allah concesse al Suo Inviato, sugli abitanti delle città, appartiene ad Allah e al Suo Inviato, ai",
                            "verse 59:9": "famigliari, agli orfani, ai poveri e al viandante diseredato, cosicché non sia diviso tra i ricchi fra di voi.",
                            "verse 59:10": "",
                            "verse 59:11": "inoltre agli emigrati bisognosi che sono stati scacciati dalle loro case e dai loro beni poiché bramavano la grazia e il compiacimento di Allah, ausiliari di Allah e del Suo Inviato: essi sono i sinceri;",
                            "verse 59:12": "e",
                            "verse 59:13": "a quanti prima di loro abitavano il paese e",
                            "verse 59:14": "nella fede, che amano quelli che emigrarono presso di loro e non provano in cuore invidia alcuna per ciò che hanno ricevuto e che",
                            "verse 59:15": "preferiscono a loro stessi nonostante siano nel bisogno.",
                            "verse 59:16": "Coloro che verranno dopo di loro diranno: « Signore, perdona noi e i nostri fratelli che ci hanno preceduto nella fede, e non porre nei nostri cuori alcun rancore verso i credenti.",
                            "verse 59:17": "Non hai visto gli ipocriti, mentre dicevano ai loro alleati miscredenti fra la gente della Scrittura: « Se sarete scacciati, verremo con voi e rifiuteremo di obbedire a chiunque contro di voi.",
                            "verse 59:18": "Se verranno scacciati, essi non partiranno con loro, mentre se saranno attaccati non li soccorreranno, e quand' anche portassero loro soccorso, certamente volgerebbero le spalle e quindi non li aiuterebbero affatto.",
                            "verse 59:19": "Voi mettete nei loro cuori più terrore che Allah Stesso, poiché invero è gente che non capisce.",
                            "verse 59:20": "Vi combatteranno uniti solo dalle loro fortezze o dietro le mura.",
                            "verse 59:21": "Sono simili a coloro che di poco li precedettero : subirono le conseguenze del loro comportamento: riceveranno doloroso castigo.",
                            "verse 59:22": "[Furono traditi] come quando Satana disse all'uomo: « Non credere»; ma quando questo fu miscredente gli disse: «Ti sconfesso, io temo Allah, il Signore dei mondi».",
                            "verse 59:23": "La fine di entrambi sarà nel Fuoco, in cui rimarranno in perpetuo.",
                            "verse 59:24": "O voi che credete, temete Allah e che ognuno rifletta su ciò che avrà preparato per l'indomani.",
                            "verse 59:25": "Non siate come coloro che dimenticano Allah e cui Allah fece dimenticare se stessi.",
                            "verse 59:26": "Non saranno uguali i compagni del Fuoco e i compagni del Giardino: i compagni del Giardino avranno la beatitudine.",
                            "verse 59:27": "Se avessimo fatto scendere questo Corano su una montagna, l'avresti vista umiliarsi e spaccarsi per il timor di Allah.",
                            "verse 59:28": "Egli è Allah, Colui all'infuori del Quale non c'è altro dio, il Conoscitore dell'invisibile e del palese.",
                            "verse 59:29": "Egli è Allah, Colui all'infuori del Quale non c'è altro dio, il Re, il Santo, la Pace, il Fedele, il Custode, l'Eccelso, Colui che costringe al Suo volere, Colui che è cosciente della Sua grandezza.",
                            "verse 59:30": "Egli è Allah, il Creatore, Colui che dà inizio a tutte le cose, Colui che dà forma a tutte le cose.",
                            "verse 59:31": "i nomi più belli."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "天にあり地にある凡てのものは，アッラーを讃える。本当にかれは偉力ならびなく英明であられる。",
                            "verse 59:2": "かれこそは，啓典の民の中の不信心な者を，その住まいから最初に追い出し放逐された方である。あなたがたはかれらが退去するものとは考えなかった。またかれらにしても，その砦だけでアッラー（の攻撃）を防げると思っていた。だがアッラーはかれらの予期しなかった方面から襲い，かれらの心に� 気を投げ込み，それでムスリムたちと一緒になって，自分（自ら）の手で，かれらの住まいを破壊した。あなたがた見る目を持つ者よ，訓戒とするがいい。",
                            "verse 59:3": "アッラーは，仮令かれらに対し，放逐と御決めにならなくても，必ず現世においてかれらを懲罰なされる。また，来世においては（必ず）火獄の懲罰がある。",
                            "verse 59:4": "それはかれら（不信者）が，アッラーとその使徒に反抗したためである。誰でもアッラーに反抗するならば，本当にアッラーは懲罰に厳重であられる。",
                            "verse 59:5": "あなたがたが，ナツメヤシの木を切り� しても，またその根の上に立たせて置いても，それはアッラーの御許しによるもので，アッラーの� に背く者たちを卑しめられるためである。",
                            "verse 59:6": "またアッラーが，かれらから（取り上げて）かれの使徒に与えた物は，あなたがたが，馬やラクダを駆りたてて手に入れた訳ではない。だがアッラーは，御望みの者を使徒の権限の下に委ねられる。本当にアッラーは，凡てのことに全能であられる。",
                            "verse 59:7": "アッラーが（敵の）村の民から得て使徒に与えた物は，アッラーの有であり，また使徒や近親，孤児，貧者，旅人のものである。それはあなたがたの中の，只富裕な者の間に専らわたらせないためである。また使徒があなたがたに与える物はこれを受け，あなたがたに禁じる物は，避けなさい。アッラーを畏れなさい。本当にアッラーは懲罰に厳重であられる。",
                            "verse 59:8": "（戦利品は）貧困な移佳者たちのものでもある。かれらは自分の家から追われ，また財産から離れ，アッラーの恩恵と御喜びを求めて，アッラーと使徒を助けている。これらの者こそ，真実な者である。",
                            "verse 59:9": "そして以前から（アル・マディーナに）家を持っていて，信仰を受け入れた者たちは，（移住して）かれらのもとに来た者を愛護し，またかれら（移住者〔ムハージル〕）に与えられた（戦利品）に対しても心の中で欲しがることもなく，自分（援助者〔アンサール〕）自身に先んじて（かれらに）与える。仮令自分は窮乏していても。また，自分の貪欲をよく押えた者たち。これらの者こそ至福を成就する者である。",
                            "verse 59:10": "かれら（移住者，援助者）の後に来た者たちは，（祈って）「主よ，わたしたちと，わたしたち以前に信仰に入った兄弟たちを，御赦し下さい。信仰している者に対する恨み心を，わたしたちの胸の中に持たせないで下さい。主よ，本当にあなたは，親切で慈悲深くあられます。」と言う。",
                            "verse 59:11": "あなたは，偽信者たちが啓典の民の中の不信心な仲間に言うのを見なかったのか。「もしあなたがたが追放されるなら，わたしたちは一緒に出て行くであろう。あなたがたのことに関しては，誰にも決して従わないであろう。またあなたがたがもし攻撃されるならば，わたしたちは必ず助けるであろう。」だがアッラーは，かれらが真に虚言の徒であることを立証なされる。",
                            "verse 59:12": "もしかれらが追放されても，かれら（偽信者）は，決して一緒に出て行かないであろう。もしかれらが攻められても，決して助けないであろう。もしかれら（偽信者）が助けようとしても，必ず背を向けて逃げ，結局かれらは何の助けも得られないであろう。",
                            "verse 59:13": "かれら（ユダヤ人と偽信者）の胸の中では，あなたがたの方がアッラーよりも，ずっと恐ろしいのである。これはかれらが，何も分らない民のためである。",
                            "verse 59:14": "かれらが一緒でも，しっかりと防備した村とか防壁の陰でない限りは戦わないであろう。強いのはかれらの間の闘争心（だけである）。あなたはかれらが団結していると思うであろうが，その心はばらばらである。これはかれらが，知性のない民のためである。",
                            "verse 59:15": "かれら以前にも，つい先頃，自分の行いの悪い結果を味わった者がいたが，かれらにしても同じである。（来世においても）かれらには痛ましい懲罰があろう。",
                            "verse 59:16": "（かれらは）悪魔のように人に向かって，「信仰を捨てなさい。」と言う。（その人が）一度不信心になると，かれは，「わたしはあなたと関わりはない。本当に万有の主アッラーが恐ろしいのである。」と言う。",
                            "verse 59:17": "それで両者（ユダヤ人と偽信者）は最後に，（地獄の）業火に陥ることになり，かれらはその中に永遠に住もう。これが，不義の徒への応報である。",
                            "verse 59:18": "あなたがた信仰する者よ，アッラーを畏れなさい。明日のために何をしたか，それぞれ考えなさい。そしてアッラーを畏れなさい。本当にアッラーは，あなたがたの行うことに通暁なされる。",
                            "verse 59:19": "あなたがたは，アッラーを忘れた者のようであってはならない。かれは，かれら自身の魂を忘れさせたのである。これらの者はアッラーの� に背く者たちである。",
                            "verse 59:20": "火獄の住人と楽園の住人とは同じではない。楽目の住人こそ勝利者である。",
                            "verse 59:21": "もしもわれがこのクルアーンを山に下したならば，それはきっと遜って，アッラーを恐れて粉々に砕けるのを見るであろう。こんな譬えを，われは人間に示すのは，恐らくかれらが熟考するであろうと思うからである。",
                            "verse 59:22": "かれこそは，アッラーであられる。かれの外に神はないのである。かれは幽玄界と現象界を知っておられ，慈悲あまねく慈愛深き御方であられる。",
                            "verse 59:23": "かれこそは，アッラーであられる。かれの外に神はないのである。至高の王者，神聖にして平安の源であり，信仰を管理し，安全を守護なされ，偉力ならびなく全能で，限りなく尊い方であられる。アッラーに讃えあれ。（かれは）人が配するものの上に（高くおられる）。",
                            "verse 59:24": "かれこそは，アッラーであられる。造物の主，造化の主，形態を授ける（主であり），最も美しい御名はかれの有である。天地の凡てのものは，かれを讃える。本当にかれは偉力ならびなく英明であられる。 かれこそは，アッラーであられる。かれの外に神はないのである。至高の王者，神聖にして平安の源であり，信仰を管理し，安全を守護なされ，偉力ならびなく全能で，限りなく尊い方であられる。アッラーに讃えあれ。（かれは）人が配するものの上に（高くおられる）。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "하늘과 대지에 있는 모든 것 이 하나님을 찬미하나니 실로 그 분은 권능과 지혜로 충만하심이라",
                            "verse 59:2": "성서의 백성들 가운데 불신자들을 모아 그들의 주거지로부터 최초로 추방케 하신 분은 바로 하나님이시라 너희는 그들의 요 새들이 하나님으로부터 그들을 방 어하여 주리라는 그들의 확신으로 그들이 나가지 아니하리라 생각하 느뇨 그러나 하나님은 그들이 생 각지 아니한 때 그들에게 이르러 그들 심중에 공포를 불어넣으매 그들은 그들의 손들과 믿는사람 들의 손들로 그들의 집들을 파괴 하였으니 그것이 지켜보는 자들을 위한 교훈이라",
                            "verse 59:3": "하나님께서 그들의 추방을 명 령하지 아니 했더라고 그분께서는 현세에서 그들에게 응벌을 내렸을 것이며 내세애서는 불지옥의 응벌 이 그들에게 있을 것이라",
                            "verse 59:4": "그것은 그들이 하나님과 그분 의 선지자를 거역했기 때문으로 누구든지 하나님께 거역하는 자는 그에게 무서운 응벌을 주시너라",
                            "verse 59:5": "너희가 종려나무를 베어 넘어뜨리거나 뿌리는 드러내어 세워두는 것은 하나님의 허락에 의한 것이며 이로 하여 그분께서 사악한 자들을 수치스럽게 하고자 하셨노라",
                            "verse 59:6": "하나님께서 그들로부터 빼앗 아 그분의 선지자에게 환원하여 주신 모든 것은 너희가 그것을 위해 말이나 낙타로써 원정한 것 이 아니거늘 하나님께서 그분의 선지자들로 하여금 그분이 원하 는 자 위에 있도록 권능을 주셨으니 하나님은 모든 일에 전지전능 하심이라",
                            "verse 59:7": "하나님께서 그 고을의 백성 들로부터 빼앗아 그분의 선지자 에게 주신 모든 것은 하나님과 선지자와 친척과 고아들과 필요 로 한 사람과 여행자를 위한 것 으로 너희 가운데 부유한 자에게 분배되는 것이 아니라 그리고 선 지자께서 너희에게 준 것은 수락 하되 그분께서 금기한 것은 거절 하고 하나님을 두려워하라 실로 하나님은 엄한 응벌을 내리시니라",
                            "verse 59:8": "일부는 무하지린을 위한 것으로 그들은 하나님의 은혜와 그분 의 기쁨을 추구하고 하나님과 그 분의 선지자들을 돕기 위하여 그 들의 가정과 그들의 재산을 버려 둔 채 쫓겨난 자들로 그들은 진실한 자들이라",
                            "verse 59:9": "그러나 그들 이전에 가정을 갖고 믿음을 가졌던 자들은 그들 에게로 이주하여 온 사람들을 사 랑하였고 그들에게 베풀어진 것 으로 시기하지 아니했으며 가난하면서도 자신들보다 그들을 우선 대우하였으며 누구에게든 마음 이 인색하지 아니했으니 이들이 번성한 자들이라",
                            "verse 59:10": "그들 이후에 온 자들은 주 여 저희와 저희 이전에 믿음을 가졌던 자들에게 관용을 베풀어 주 소서 저희의 마음속에 믿는 사람 들데 대한 증오함이 남아 있지 않도록 하여 주소서 주여 실로 당신은 친절과 자비로 충만하십니다라고 말하더라",
                            "verse 59:11": "그대는 위선자들이 성서의 백성 중 믿지 아니한 자들에게 만일 너희가 추방 당한다면 우리 도 너희와 함께 나가 너희의 일에관하여 어느 누구에게도 귀를 기 울이지 아니할 것이며 너희가 전 투에서 공격을 받는다면 우리가 너희를 도우리요 라고 말하는 것 을 듣지 아니 했느뇨 그러나 하나님은 그들이 거짓하는 것들을 지 켜보고 계시니라",
                            "verse 59:12": "그러나 그들이 추방당하여 도 이들은 그들과 함께 나가지 아니하며 그들이 전투에서 공격을받아도 이들은 결코 그들을 도울 수 없으며 이들이 도운다 하더라 도 곧 뒤돌아 서리니 그들은 아무런 도움도 받지 못하리라",
                            "verse 59:13": "오히려 그들의 마음에는 하나님보다 너희가 더욱 두려울 것 이라 이것은 그들이 이해하지 못 하는 백성들이기 때문이라",
                            "verse 59:14": "이들은 요새의 마을과 성벽 뒤가 아니고는 너희와 협력하여 싸우지 아니하며 오히려 그들간의 싸움만 격렬할 뿐 그들이 하나로 단결된 것처럼 보이나 그들의 마 음들은 분열되어 있노라 이는 그 들이 이해하지 못하는 백성이기 때문이라",
                            "verse 59:15": "그들 이전의 자들처럼 이들 도 사악한 결과를 맛보리니 고통 스러운 응벌이 있으리라",
                            "verse 59:16": "그들은 사탄과 같나니 사탄은 인간에게 불신하라 하여 불신 하면 그는 나는 너희와 관계가 없으며 나는 만유의 주님이신 하 나님을 두려워 하도다 라고 말하 니라",
                            "verse 59:17": "그리하여 이들의 말로는 불지옥이 되어 그곳에서 영주하니 그것이 사악한 자들을 위한 보상 이라",
                            "verse 59:18": "믿는 사람들이여 하나님을 두려워하고 내일을 위해 스스 로가 무엇을 했는지 각자가 숙고 하라 그리고 하나님을 두려워 하 라 실로 하나님은 너희가 행하는 모든 것을 지켜보고 계시너라",
                            "verse 59:19": "그리하되 하나님을 망각한 자처럼 되지 말라 그리하면 그분 은 그들의 영혼을 그들로 하여금 망각케 하시나니 그들이야말로 죄인들이라",
                            "verse 59:20": "불지옥의 무리와 천국에 사 는 동료가 같지 아니하니 이들이 승리자들이라",
                            "verse 59:21": "하나님이 꾸란을 어느 산에계시했다면 그것도 하나님이 두려워 겸손해 하고 분리되는 것을 너희가 보았으리라 하나님은 이것을인간에게 비유하였나니 이로 하여그들이 숙고하도록 함이라",
                            "verse 59:22": "하나님 외에는 신이 없나니 그분은 보이지 않는 것과 보이는 것도 알고 계시는 자비로우시고 자애로우신 분이시라",
                            "verse 59:23": "하나님 외에는 신이 없으며 그분은 왕이시요 성스러운 분이 시며 평화를 주시고 안전을 수여 하시는 분이며 모든 것을 지켜주 시는 분이시며 가장 위대하시고 권세와 모든 위대함의 소유자이시 라 그들이 비유하는 모든 것 위에 계신 하나님께 영광이 있으소서",
                            "verse 59:24": "이분이 창조주 하나님으로창조하시는 분이요 형상을 만드 는 분이시라 가장 훌륭한 이름들은 그분의 것이며 하늘과 대지에있는 모든 것들이 그분께 영광을드리나니 실로 그분은 권능과 지혜로 충만하심이라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "هه‌رچی له ئاسمانه‌کان و زه‌ویدا هه‌یه به‌پاکی و بێگه‌ردی یادی خوایان کردووه‌، هه‌ر ئه‌ویش باڵاده‌ست و دانایه‌.",
                            "verse 59:2": "ئه‌و خوایه ئه‌و زاته‌یه‌، ئه‌وانه‌ی بێ باوه‌ڕ بوون له خاوه‌نانی کتێب، هه‌ڵیکه‌ندن له شوێنه‌واریان و ناچاری کۆچی کردن له یه‌که‌م ده‌ست پێکردنی کۆکردنه‌وه‌و ده‌رکردنیاندا، ئێوه به‌ته‌ما نه‌بوون و گومانتان نه‌ده‌برد ئاوا به‌ئاسانی بڕۆن، ئه‌وانیش گومانیان وابوو که به‌ڕاستی قه‌ڵاکانیان به‌رگریان ده‌کات له ویست و فه‌رمانی خوا، ئه‌وسا ئیتر له لا‌یه‌که‌وه خوا به‌ڵای به‌سه‌ر هێنان که به‌خه‌یاڵیاندا نه‌هاتبوون و حسابیان بۆ نه‌کردبوو، ئه‌وسا خوا ترسێکی فڕێدایه دڵیانه‌وه‌، به‌ناچاری ده‌ستیان کرد به‌کاولکردنی خانووبه‌ره‌و ماڵه‌کانیان به‌ده‌ستی خۆیان و ده‌ستی ئیمانداران، که‌واته‌: ئه‌ی خاوه‌ن بیروهۆش و دوور بینه‌کان ده‌رس و په‌ندو ئامۆژگاری وه‌ربگرن (جووله‌که هه‌روا بۆیان ناچێته سه‌ر).",
                            "verse 59:3": "خۆ ئه‌گه‌ر خوا چۆڵکردنی له‌سه‌ر بڕیار نه‌دانایه‌، ئه‌وه هه‌ر له دنیادا سزای ده‌دان، له قیامه‌تیشدا سزای ئاگری دۆزه‌خ بۆیان ئاماده‌یه (چو‌نکه زۆر دڵڕه‌ق و پیلانگێرن).",
                            "verse 59:4": "ئه‌و سزایه به‌هۆی ئه‌وه‌وه بوو به‌ڕاستی ئه‌وانه دوژمنایه‌تی خواو پێغه‌مبه‌ره‌که‌یان کرد، ئه‌وه‌ش دژایه‌تی ئاینی خوا بکات، با چاك بزانێت خوا سزاو تۆڵه‌ی زۆر به‌ئێش و ئازاره‌.",
                            "verse 59:5": "هه‌ر دره‌ختێکی ته‌ڕتان بڕی بێت یان وازتان لێ هێنابێت و له‌سه‌ر بنجی خۆی ما بێت (له خه‌یبه‌ردا)، به‌فه‌رمانی خوا بووه و ویستی ئه‌وی له‌سه‌ره‌، تا تاوانباران و له سنوور ده‌رچووه‌کان سه‌رشۆڕ و خه‌جاڵه‌ت بکات.",
                            "verse 59:6": "ئه‌و ده‌ستکه‌وتانه‌، خوا له جووله‌که‌ی سه‌ندووه و به‌خشیوویه‌تی به‌پێغه‌مبه‌ره‌که‌ی، ئێوه هیچ خۆتان ماندوو نه‌کردبوو بۆ به‌ده‌ست هێنانی، نه به‌سواری ئه‌سپ بۆی چووبوون نه به سواری وشتر، به‌ڵکو ئه‌وه خوایه که پێغه‌مبه‌ره‌که‌ی زاڵ ده‌کات به‌سه‌ر هه‌ر ده‌سته و تاقمێکدا که بیه‌وێت، خوایش ده‌سته‌ڵاتی به‌سه‌ر هه‌موو شتێکدا هه‌یه‌.",
                            "verse 59:7": "ئه‌و ده‌ستکه‌وتانه‌ی، خوا به‌خشی به پێغه‌مبه‌ره‌که‌ی له خه‌ڵکی دێهات و شاره‌کانی جوو، ئه‌وه خوا بڕیاری له‌سه‌رداوه که بۆ پێغه‌مبه‌ر و خزمانیه‌تی، بۆ هه‌تیوان و هه‌ژاران و ڕێبوارانیشه‌، بۆ ئه‌وه‌ی ئه‌و سامانه ته‌نها له نێوان ده‌وڵه‌مه‌نده‌کانی ئێوه‌دا نه‌بێت، جا ئه‌وه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم) پێی به‌خشیوون وه‌ری بگرن، هه‌ر فه‌رمانێکی پێدان به‌گوێی بکه‌ن، قه‌ده‌غه‌ی هه‌ر شتێکی لێ کردن مه‌یکه‌ن، له خوا بترسن؛ چونکه به‌ڕاستی خوا به‌توندی تۆڵه ده‌سێنێت.",
                            "verse 59:8": "هه‌روه‌ها له‌و ده‌ستکه‌وتانه‌، به‌شی کۆچبه‌رانی هه‌ژار ده‌بێت بدرێت، ئه‌وانه‌ی له شوێنه‌وارو سامانیان دوور خراونه‌ته‌وه‌و ده‌رکراون، ئه‌وانه به‌ته‌مای به‌خششی خواو ڕه‌زامه‌ندیی ئه‌ون و به‌بێ هیچ ته‌ماعێک پشتیوانی له خواو پێغه‌مبه‌ره‌که‌ی ده‌که‌ن و هه‌وڵی سه‌رخستنی به‌رنامه‌که‌یان ده‌ده‌ن، هه‌ر ئا ئه‌وانه ڕاستگۆو ڕاستانن.",
                            "verse 59:9": "ئه‌وانه‌ی که پێشتر ماڵ و شوێنی خۆیان ئاماده کرد بۆ پێشوازیی له کۆچبه‌ران و دڵ و ده‌روونی خۆیان ڕازانده‌وه به‌ئیمان، ئه‌وانه‌شیان خۆش ده‌وێت که کۆچیان کردووه بۆ لایان و له دڵ و ده‌رونیاندا جێی هیچ جۆره حه‌سوودی و به‌خیلیه‌ك نابێته‌وه (له‌سه‌ر ئه‌وه‌ی که به‌شی کۆچبه‌ران دراوه و به‌شی ئه‌وان نه‌دراوه‌)، حه‌ز به به‌خشینی ده‌ستکه‌وته‌کان به‌وان ده‌که‌ن، فه‌زڵی ئه‌وان ده‌ده‌ن به‌سه‌ر خۆیاندا هه‌رچه‌نده هه‌ژارو نه‌داریشن، جا ئه‌وه‌ی خۆی له نه‌فسی ڕه‌زیلی بپارێزێت و زاڵ بێت به‌سه‌ریدا، ئا ئه‌وانه هه‌ر سه‌رفرازن.",
                            "verse 59:10": "ئه‌وانه‌ش که به شوین کۆچبه‌ران و پشتیواناندا هاتن (تا کۆتایی دنیا ئه‌مه دۆعا و نزایانه و به‌رده‌وام) ده‌ڵێن: په‌روه‌ردگارا له ئێمه و له برایانه‌شمان خۆش ببه که پێش ئێمه ڕێبازی ئیمانیان گرته‌به‌ر و له دڵه‌کانماندا هیچ جۆره بوغزو کینه‌یه‌ک مه‌خه‌ره دڵمانه‌وه له ئاستی ئه‌وانه‌ی ئیمانیان هێناوه‌، په‌روه‌ردگارا تۆ به‌ڕاستی به‌سۆزو به‌خشنده و میهره‌بانیت.",
                            "verse 59:11": "ئایا سه‌رنجت نه‌داوه له‌وانه‌ی که دووڕوو بوون و به‌برا بێباوه‌ڕه‌کانیان له خاوه‌ن کتێب ده‌ڵێن: ئه‌گه‌ر ئێوه ده‌ربکرێن ئێمه‌ش له‌گه‌ڵتاندا ده‌رده‌چین، هه‌رگیز دژی ئێوه به‌قسه‌ی که‌س ناکه‌ین، خۆ ئه‌گه‌ر جه‌نگتان دژ بکرێت ئێمه پشتیوانیتان لێ ده‌که‌ین، به‌مه‌رجێک؛ خوا خۆی شایه‌ته که ئه‌وانه بێگومان درۆزنن.",
                            "verse 59:12": "سوێند به خوا ئه‌گه‌ر ده‌ربکرێن له‌گه‌ڵیاندا ده‌رناچن و ئه‌گه‌ر جه‌نگیان دژبکرێت، پشتیوانییان لێناکه‌ن و ئه‌گه‌ر پشتیوانیشیان لێکردن، دوای تاوێک پشت هه‌ڵده‌که‌ن و پاشان سه‌رکه‌وتوو نابن.",
                            "verse 59:13": "به‌ڕاستی ئێوه‌ی ئیماندار ترستان زیاتره له دڵ و ده‌روونیاندا تا خوای گه‌وره‌، چونکه بێگومان ئه‌وانه که‌سانێکی ناحاڵی و تێ نه‌گه‌یشتوون (هه‌میشه له دڵه‌ڕاوکێدان).",
                            "verse 59:14": "هۆزی جوو‌له‌که هه‌رگیز به‌یه‌ک پارچه‌یی ناوێرن دژی ئێوه بجه‌نگن، مه‌گه‌رله شوێنی قایم و قه‌ڵای سه‌ختدا، یان له پشتی دیواری به‌رزو قایمه‌وه‌، چونکه ئه‌و جووانه نێوانیان زۆر ناخۆشه و چاره‌ی یه‌کتریان ناوێت، هه‌رچه‌نده وا ده‌زانیت یه‌کپارچه‌ن، به‌ڵام له‌ڕاستیدا دڵه‌کانیان دوورن له یه‌که‌وه‌، چونکه ئه‌وانه ژیر و هۆشمه‌ند نین.",
                            "verse 59:15": "نموونه‌یان وه‌ك نموونه‌ی بێباواڕانی ئه‌م نزیکانه وایه (که له جه‌نگی به‌دردا) به‌ئه‌نجامی کارو کرده‌وه‌ی خۆیان گه‌یشتن، له قیامه‌تیشدا سزای به ئێش و ئازار بۆیان ئاماده‌یه‌.",
                            "verse 59:16": "(نێوانی دووڕووه‌کان له گه‌ڵ جووه‌کان) وه‌ك شه‌یتان وایه که هانی ئاده‌میزاد ده‌دات له ڕێی خه‌یاڵ و وه‌سوه‌سه‌وه‌؛ پێی ده‌ڵێت: وه‌ره کافربه (به جوانکردنی هه‌موو جۆره تاوانێک که خوا پێی ناخۆشه‌)، جا کاتێك که کافر بوو (واته ئه‌و کارانه‌ی ئه‌نجام دا که شه‌یتان پێی ڕازیه‌) پێی ده‌ڵێت: به‌ڕاستی من به‌ریم له تۆ من له په‌روه‌ردگاری جیهانیان ده‌ترسم!!.",
                            "verse 59:17": "سه‌رئه‌نجامی هه‌ردووکیان (شه‌یتان و ئاده‌میزادی کافر) ئه‌وه‌یه که هه‌ردوو له دۆزه‌خدا بۆ هه‌میشه‌، به‌نه‌مریی ده‌مێننه‌و، ئه‌وه‌ش پاداشتی سته‌مکارانه‌.",
                            "verse 59:18": "ئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه‌، خواناس و پارێزکاربن و له سنووره‌کانی مه‌ترازێن، با هه‌موو که‌سێك سه‌رنج بدات و بزانێت چی بۆ سبه‌ی ده‌ست پێشکه‌ری کردووه‌، هه‌وڵ بده‌ن هه‌میشه‌و به‌رده‌وام پارێزکارو دیندارو خواناس بن، چونکه به‌ڕاستی خوا زۆر ئاگایه به‌هه‌موو ئه‌و کاروکرده‌وانه‌ی که ئه‌نجامی ده‌ده‌ن.",
                            "verse 59:19": "نه‌که‌ن وه‌کو ئه‌و که‌سانه بن که خوایان فه‌رامۆش کرد، شوێنی به‌رنامه‌که‌ی نه‌که‌وتن، خوایش ئه‌وانی له بیر خۆیان برده‌وه‌، ئه‌وانه له سنوور ده‌رچوو تاوانباره‌کانن.",
                            "verse 59:20": "(بێگومان) نیشته‌جێکانی دۆزه‌خ وه‌ك به‌هه‌شتیه‌کان نین، چونکه هه‌ر به‌هه‌شتیه‌کان سه‌رفرازو کامه‌ران و به‌خته‌وه‌رن.",
                            "verse 59:21": "ئه‌گه‌ر ئه‌م قورئانه‌مان داببه‌زاندایه سه‌ر که‌ژو کێوێك، ده‌تبینی ملکه‌چ ده‌بوو، وردو و خاش ده‌بوو، شه‌ق و په‌ق ده‌بوو، له ترسی فه‌رمانی خوا، له هه‌یبه‌تی گه‌وره‌یی و ده‌سه‌ڵاتی خوا، ئێمه ئه‌م نموونانه ده‌هێنینه‌وه بۆ خه‌ڵکی بۆ ئه‌وه‌ی بیربکه‌نه‌وه و ژیرییان بخه‌نه کار و شوین قورئانی پیرۆز بکه‌ون.",
                            "verse 59:22": "خوا ئه‌و زاته‌یه که جگه له‌و خوایه‌کی تر نیه زانایه به هه‌موو نهێنی و ئاشکراکان، ئه‌و خوایه به‌خشنده و میهره‌بان و دلۆڤانه کانگای ڕه‌حم و به‌زه‌ییه‌.",
                            "verse 59:23": "خوا ئه‌و زاته‌یه که جگه له‌و خوایه‌کی تر نیه پاشای هه‌موو بوونه‌وه‌ره‌، پاك و بێگه‌ردو پوخته‌، ئاشتی خواز و ئاشتی په‌روه‌ره‌، ئاسایش به‌خش و په‌ناگای ئیماندارانه‌، ده‌سه‌ڵاتداره و چاودێری دروستکراوه‌کانیه‌تی، باڵاده‌سته‌، خاوه‌نی خێری بێسنووره‌، گه‌وره‌یه و خۆی به‌گه‌وره ده‌زانێت، پاکی و بێگه‌ردی بۆ ئه‌و خوایه‌یه له‌وه‌ی تینه‌گه‌یشتوان شه‌ریك و هاوه‌ڵی بۆ بڕیار ده‌ده‌ن.",
                            "verse 59:24": "هه‌ر ئه‌و خوایه به‌دیهێنه‌رو دروستکراوه‌، (له نه‌بوون هه‌رچی بۆی به‌دی ده‌هێنێت)، نه‌خشه و وێنه کێشه‌ره‌، ناوه پیرۆزو جوانه‌کان، هه‌مووی شایسته‌ی ئه‌ون، هه‌رچی له ئاسمانه‌کان و زه‌ویدا هه‌یه ستایشی ئه‌و ده‌که‌ن، به‌ڕاستی ئه‌و زاته خوایه‌کی باڵاده‌ست و دانایه‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Segala yang ada di langit dan di bumi tetap mengucap tasbih kepada Allah dan Dialah Yang Maha Kuasa, lagi Maha Bijaksana.",
                            "verse 59:2": "Dialah yang telah mengeluarkan orang-orang kafir di antara Ahli Kitab dari kampung halaman mereka pada julung-julung kali mereka berhimpun hendak memerangi Rasulullah.",
                            "verse 59:3": "Dan kalaulah tidak kerana Allah telah menetapkan pengusiran (yang demikian buruknya) terhadap mereka, tentulah Dia akan menyeksa mereka di dunia dan mereka pula akan beroleh azab seksa Neraka pada hari akhirat kelak.",
                            "verse 59:4": "(Mereka ditimpakan azab) yang demikian, kerana mereka menentang (perintah) Allah dan RasulNya dan (ingatlah), sesiapa yang menentang (perintah) Allah, maka sesungguhnya Allah amatlah berat azab seksaNya.",
                            "verse 59:5": "Mana-mana jua pohon kurma (kepunyaan musuh) yang kamu tebang atau kamu biarkan tegak berdiri seperti keadaannya yang asal, maka yang demikian adalah dengan izin Allah (kerana Dia hendak memberi kemenangan kepada orang-orang mukmin), dan kerana Dia hendak menimpakan kehinaan kepada orang-orang yang fasik.",
                            "verse 59:6": "Dan apajua yang Allah kurniakan kepada RasulNya dari peninggalan harta benda mereka (yang telah diusir itu, maka kamu tidak berhak mendapatnya), kerana kamu tidak memecut seekor kuda pun dan tidak menunggang seekor unta pun (untuk berperang mengalahkan mereka); tetapi Allah memberikan kekuasaan kepada Rasul-rasulNya mengalahkan sesiapa yang dikehendakiNya (dengan tidak payah berperang) dan Allah Maha Kuasa atas tiap-tiap sesuatu.",
                            "verse 59:7": "Apa yang Allah kurniakan kepada RasulNya (Muhammad) dari harta penduduk negeri, bandar atau desa dengan tidak berperang, maka adalah ia tertentu bagi Allah, dan bagi Rasulullah dan bagi kaum kerabat (Rasulullah) dan anak-anak yatim dan orang-orang miskin, serta orang-orang musafir (yang keputusan).",
                            "verse 59:8": "(Pemberian itu hendaklah diuntukkan) kepada orang-orang fakir yang berhijrah, yang telah diusir keluar dari kampung halamannya dan harta bendanya (kerana berpegang teguh kepada ajaran Islam), untuk mencari limpah kurnia dari Allah dan keredaanNya, serta menolong (agama) Allah dan RasulNya; mereka itulah orang-orang yang benar (imannya dan amalnya).",
                            "verse 59:9": "Dan orang-orang (Ansar) yang mendiami negeri (Madinah) serta beriman sebelum mereka, mengasihi orang-orang yang berhijrah ke negeri mereka dan tidak ada pula dalam hati mereka perasaan berhajatkan apa yang telah diberi kepada orang-orang yang berhijrah itu dan mereka juga mengutamakan orang-orang yang berhijrah itu lebih daripada diri mereka sendiri, sekalipun mereka dalam keadaan kekurangan dan amat berhajat dan (ingatlah), sesiapa yang menjaga serta memelihara dirinya daripada dipengaruhi oleh tabiat bakhilnya, maka merekalah orang-orang yang berjaya.",
                            "verse 59:10": "Dan orang-orang (Islam) yang datang kemudian daripada mereka (berdoa dengan) berkata: Wahai Tuhan Kami! Ampunkanlah dosa kami dan dosa saudara-saudara kami yang mendahului kami dalam iman dan janganlah Engkau jadikan dalam hati perasaan hasad dengki dan dendam terhadap orang-orang yang beriman.",
                            "verse 59:11": "Tidakkah engkau melihat dan merasa hairan (wahai Muhammad) terhadap sikap orang-orang munafik itu? Mereka tergamak berkata kepada saudara-saudara mereka yang kafir dari kalangan (kaum Yahudi) ahli Kitab: Sesungguhnya, kalau kamu dihalau keluar sudah tentu kami akan keluar bersama-sama kamu dan kami tidak akan tunduk taat kepada sesiapapun untuk menentang kamu selama-lamanya; dan kalau kamu diperangi, sudah tentu kami akan membela kamu! Padahal Allah mengetahui dan menyaksikan bahawa sebenarnya mereka adalah pendusta.",
                            "verse 59:12": "Demi sesungguhnya! Jika orang-orang (Yahudi) itu dihalau keluar (dari Madinah), mereka (yang munafik) ini tidak akan keluar bersama-samanya dan demi sesungguhnya, jika orang-orang (Yahudi) itu diperangi, mereka (yang munafik) ini tidak akan membelanya dan demi sesungguhnya, jika ditakdirkan mereka membelanya sekalipun, sudah tentu mereka (semuanya, Yahudi dan munafik) akan melarikan diri; kemudian mereka tidak akan mendapat pertolongan;",
                            "verse 59:13": "(Kerana) sesungguhnya kamu dalam hati mereka, sangat ditakuti lebih dari Allah; yang demikian itu, kerana mereka ialah kaum yang tidak memgerti (akan kekuasaan Allah dan kebesaranNya).",
                            "verse 59:14": "(Orang-orang Yahudi dan orang-orang munafik) dengan keadaan bersatu padu sekalipun, tidak berani memerangi kamu melainkan di kampung-kampung yang berbenteng kukuh, atau dari sebalik tembok.",
                            "verse 59:15": "(Keadaan kaum Yahudi itu) samalah seperti orang-orang (dari suku Yahudi) yang terdahulu sedikit dari mereka, yang telah merasai akibat yang buruk (di dunia) dengan sebab bawaan kufur mereka dan mereka pula akan beroleh azab seksa yang tidak terperi sakitnya (pada hari akhirat kelak).",
                            "verse 59:16": "(Sikap kaum munafik dengan kaum Yahudi) itu samalah seperti (sikap) Syaitan ketika dia berkata kepada manusia: Berlaku kufurlah engkau! Setelah orang itu berlaku kufur (dan tetap terkena azab), berkatalah Syaitan kepadanya: Sesungguhnya aku adalah berlepas diri daripadamu, kerana sebenarnya aku takut kepada Allah, Tuhan Yang Menguasai seluruh alam!",
                            "verse 59:17": "Maka kesudahan keduanya, bahawa mereka ditempatkan di dalam Neraka, kekal mereka di dalamnya dan yang demikian itulah balasan makhluk-makhluk yang zalim.",
                            "verse 59:18": "Wahai orang-orang yang beriman! Bertakwalah kepada Allah (dengan mengerjakan suruhanNya dan meninggalkan laranganNya) dan hendaklah tiap-tiap diri melihat dan memerhatikan apa yang dia telah sediakan (dari amal-amalnya) untuk hari esok (hari akhirat) dan (sekali lagi diingatkan): Bertakwalah kepada Allah, sesungguhnya Allah Amat Meliputi PengetahuanNya akan segala yang kamu kerjakan.",
                            "verse 59:19": "Dan janganlah kamu menjadi seperti orang-orang yang telah melupakan (perintah-perintah) Allah, lalu Allah menjadikan mereka melupakan (amal-amal yang baik untuk menyelamatkan) diri mereka.",
                            "verse 59:20": "Tidaklah sama ahli Neraka dan ahli Syurga; ahli Syurgalah orang-orang yang beroleh kemenangan (mendapat segala yang diingini).",
                            "verse 59:21": "Sekiranya Kami turunkan Al-Quran ini ke atas sebuah gunung, nescaya engkau melihat gunung itu khusyuk serta pecah belah kerana takut kepada Allah dan (ingatlah), misal-misal perbandingan ini Kami kemukakan kepada umat manusia, supaya mereka memikirkannya.",
                            "verse 59:22": "Dialah Allah, yang tidak ada Tuhan melainkan Dia; Yang Mengetahui perkara yang ghaib dan yang nyata; Dialah Yang Maha Pemurah, lagi Maha Mengasihani.",
                            "verse 59:23": "Dialah Allah, yang tidak ada Tuhan melainkan Dia; Yang Menguasai (sekalian alam); Yang Maha Suci; Yang Maha Selamat Sejahtera (dari segala kekurangan); Yang Maha Melimpahkan Keamanan; Yang Maha Pengawal serta Pengawas; Yang Maha Kuasa; Yang Maha Kuat (menundukkan segala-galanya); Yang Melengkapi segala KebesaranNya.",
                            "verse 59:24": "Dialah Allah, Yang Menciptakan sekalian makhluk; Yang Mengadakan (dari tiada kepada ada); Yang Membentuk rupa (makhluk-makhlukNya menurut yang dikehendakiNya); bagiNyalah nama-nama yang sebaik-baiknya dan semulia-mulianya; bertasbih kepadaNya segala yang ada di langit dan di bumi dan Dialah Yang tiada bandingNya, lagi Maha Bijaksana."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "آنچه در آسمانها و آنچه در زمين است، براى خدا تسبيح مى‏گويد; و او عزيز و حكيم است!",
                            "verse 59:2": "او كسى است كه كافران اهل كتاب را در نخستين برخورد (با مسلمانان) از خانه‏هايشان بيرون راند! گمان نمى‏كرديد آنان خارج شوند، و خودشان نيز گمان مى‏كردند كه دژهاى محكمشان آنها را از عذاب الهى مانع مى‏شود; اما خداوند از آنجا كه گمان نمى‏كردند به سراغشان آمد و در دلهايشان ترس و وحشت افكند، بگونه‏اى كه خانه‏هاى خود را با دست خويش و با دست مؤمنان ويران مى‏كردند; پس عبرت بگيريد اى صاحبان چشم!",
                            "verse 59:3": "و اگر نه اين بود كه خداوند ترك وطن را بر آنان مقرر داشته بود، آنها را در همين دنيا مجازات مى‏كرد; و براى آنان در آخرت نيز عذاب آتش است!",
                            "verse 59:4": "اين به خاطر آن است كه آنها با خدا و رسولش دشمنى كردند; و هر كس با خدا دشمنى كند (بايد بداند) كه خدا مجازات شديدى دارد!",
                            "verse 59:5": "هر درخت باارزش نخل را قطع كرديد يا آن را به حال خود واگذاشتيد، همه به فرمان خدا بود; و براى اين بود كه فاسقان را خوار و رسوا كند!",
                            "verse 59:6": "و آنچه را خدا از آنان ( يهود) به رسولش بازگردانده (و بخشيده) چيزى است كه شما براى به دست آوردن آن (زحمتى نكشيديد،) نه اسبى تاختيد و نه شترى; ولى خداوند رسولان خود را بر هر كس بخواهد مسلط مى‏سازد; و خدا بر هر چيز توانا است!",
                            "verse 59:7": "آنچه را خداوند از اهل اين آباديها به رسولش بازگرداند، از آن خدا و رسول و خويشاوندان او، و يتيمان و مستمندان و در راه ماندگان است، تا (اين اموال عظيم) در ميان ثروتمندان شما دست به دست نگردد! آنچه را رسول خدا براى شما آورده بگيريد (و اجرا كنيد)، و از آنچه نهى كرده خوددارى نماييد; و از (مخالفت) خدا بپرهيزيد كه خداوند كيفرش شديد است!",
                            "verse 59:8": "اين اموال براى فقيران مهاجرانى است كه از خانه و كاشانه و اموال خود بيرون رانده شدند در حالى كه فضل الهى و رضاى او را مى‏طلبند و خدا و رسولش را يارى مى‏كنند; و آنها راستگويانند!",
                            "verse 59:9": "و براى كسانى است كه در اين سرا ( سرزمين مدينه) و در سراى ايمان پيش از مهاجران مسكن گزيدند و كسانى را كه به سويشان هجرت كنند دوست مى‏دارند، و در دل خود نيازى به آنچه به مهاجران داده شده احساس نمى‏كنند و آنها را بر خود مقدم مى‏دارند هر چند خودشان بسيار نيازمند باشند; كسانى كه از بخل و حرص نفس خويش باز داشته شده‏اند رستگارانند!",
                            "verse 59:10": "(همچنين) كسانى كه بعد از آنها ( بعد از مهاجران و انصار) آمدند و مى‏گويند: «پروردگارا! ما و برادرانمان را كه در ايمان بر ما پيشى گرفتند بيامرز، و در دلهايمان حسد و كينه‏اى نسبت به مؤمنان قرار مده! پروردگارا، تو مهربان و رحيمى!»",
                            "verse 59:11": "آيا منافقان را نديدى كه پيوسته به برادران كفارشان از اهل كتاب مى‏گفتند: «هرگاه شما را (از وطن) بيرون كنند، ما هم با شما بيرون خواهيم رفت و هرگز سخن هيچ كس را درباره شما اطاعت نخواهيم كرد; و اگر با شما پيكار شود، ياريتان خواهيم نمود!» خداوند شهادت مى‏دهد كه آنها دروغگويانند!",
                            "verse 59:12": "اگر آنها را بيرون كنند با آنان بيرون نمى‏روند، و اگر با آنها پيكار شود ياريشان نخواهند كرد، و اگر ياريشان كنند پشت به ميدان كرده فرار مى‏كنند; سپس كسى آنان را يارى نمى‏كند!",
                            "verse 59:13": "وحشت از شما در دلهاى آنها بيش از ترس از خداست; اين به خاطر آن است كه آنها گروهى نادانند!",
                            "verse 59:14": "آنها هرگز با شما بصورت گروهى نمى‏جنگند جز در دژهاى محكم يا از پشت ديوارها! پيكارشان در ميان خودشان شديد است، (اما در برابر شما ضعيف!) آنها را متحد مى‏پندارى، در حالى كه دلهايشان پراكنده است; اين به خاطر آن است كه آنها قومى هستند كه تعقل نمى‏كنند!",
                            "verse 59:15": "كار اين گروه از يهود همانند كسانى است كه كمى قبل از آنان بودند، طعم تلخ كار خود را چشيدند و براى آنها عذابى دردناك است!",
                            "verse 59:16": "كار آنها همچون شيطان است كه به انسان گفت: «كافر شو (تا مشكلات تو را حل كنم)!» اما هنگامى كه كافر شد گفت: «من از تو بيزارم، من از خداوندى كه پروردگار عالميان است بيم دارم!»",
                            "verse 59:17": "سرانجام كارشان اين شد كه هر دو در آتش دوزخ خواهند بود، جاودانه در آن مى‏مانند; و اين است كيفر ستمكاران!",
                            "verse 59:18": "اى كسانى كه ايمان آورده‏ايد از (مخالفت) خدا بپرهيزيد; و هر كس بايد بنگرد تا براى فردايش چه چيز از پيش فرستاده; و از خدا بپرهيزيد كه خداوند از آنچه انجام مى‏دهيد آگاه است!",
                            "verse 59:19": "و همچون كسانى نباشيد كه خدا را فراموش كردند و خدا نيز آنها را به «خود فراموشى‏» گرفتار كرد، آنها فاسقانند",
                            "verse 59:20": "هرگز دوزخيان و بهشتيان يكسان نيستند; اصحاب بهشت رستگار و پيروزند!",
                            "verse 59:21": "اگر اين را بر كوهى نازل مى‏كرديم، مى‏ديدى كه در برابر آن خاشع مى‏شود و از خوف خدا مى‏شكافد! اينها مثالهايى است كه براى مردم مى‏زنيم، شايد در آن بينديشيد!",
                            "verse 59:22": "او خدايى است كه معبودى جز او نيست، داناى آشكار و نهان است، و او رحمان و رحيم است!",
                            "verse 59:23": "و خدايى است كه معبودى جز او نيست، حاكم و مالك اصلى اوست، از هر عيب منزه است، به كسى يتم نمى‏كند، امنيت بخش است، مراقب همه چيز است، قدرتمندى شكست‏ناپذير كه با اراده نافذ خود هر امرى را اصلاح مى‏كند، و شايسته عظمت است; خداوند منزه است از آنچه شريك براى او قرارمى‏دهند!",
                            "verse 59:24": "او خداوندى است خالق، آفريننده‏اى بى‏سابقه، و صورتگرى (بى‏نظير); براى او نامهاى نيك است; آنچه در آسمانها و زمين است تسبيح او مى‏گويند; و او عزيز و حكيم است!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Tudo quando existe nos céus e na terra glorifica Deus.",
                            "verse 59:2": "Foi ele Quem expatriou os incrédulos, dentre os adeptos do Livro , quando do primeiro desterro.",
                            "verse 59:3": "E se Deus não lhes tivesse decretado o seu banimento, tê-los-ia castigado nesse mundo, e no outro, sofreriam o tormento infernal.",
                            "verse 59:4": "Isso, por terem contrariado Deus e Seu Mensageiro; e, quem contraria Deus (saiba que), certamente Deus é severíssimo no castigo.",
                            "verse 59:5": "(Ó muçulmanos), ficai sabendo que, se cortardes as tamareiras tenras ou se as deixardes de pé, fá-lo-eis com o beneplácito de Deus, e para que Ele avilte os depravados.",
                            "verse 59:6": "Tudo quanto Deus concedeu ao Seu Mensageiro, (tirado) dos bens deles (dos Bani Annadhir), não tivestes de fazer galopar cavalo ou camelo algum para conseguir (para transportar).",
                            "verse 59:7": "Tudo quanto Deus concedeu ao Seu Mensageiro, (tomado) dos moradores das cidades, corresponde a Deus, ao Seu Mensageiro e aos seus parentes, aos órfãos, aos necessitados e aos viajantes; isso, para que (as riquezas) não sejam monopolizadas pelos opulentos, dentre vós.",
                            "verse 59:8": "(E também corresponde uma parte) aos pobres migrantes (maquenses), que foram expatriados e despojados dos seus bens, que procuram a graça de Deus e a Sua complacência, e secundam Deus e Seu Mensageiro; estes são os verazes.",
                            "verse 59:9": "Os que antes deles residiam (em Madina) e haviam adotado a fé, mostram afeição por aqueles que migraram para junto deles e não nutrem inveja alguma em seus corações, pelo que (tais migrantes) receberam (de despojos); por outra, preferem-nos, em detrimento de si mesmos.",
                            "verse 59:10": "E aqueles que os seguiram dizem: Ó Senhor nosso, perdoa-nos, assim como também aos nosso irmãos, que nos precederam na fé, e não infundas em nossos corações rancor algum pelos fiéis.",
                            "verse 59:11": "Não reparas, acaso, nos hipócritas, que dizem aos seus irmãos incrédulos, dentre os adeptos do Livro: Juramos que se fordes expulsos, sairemos convosco e jamais obedeceremos a ninguém, contra vós; e, se fordes combatidos, socorrer-vos-emos.",
                            "verse 59:12": "Porque, na verdade, se fossem expulsos, não sairiam com eles, se fossem combatidos, não os socorreriam; e, mesmo que os socorressem, empreenderiam a fuga; e, ainda, eles mesmos não seriam socorridos.",
                            "verse 59:13": "Seguramente, vós, ó fiéis, infundis em seus corações mais terror ainda do que Deus; isso, porque são uns insensatos.",
                            "verse 59:14": "Eles não vos combaterão (mesmo) em conjunto, senão em cidades fortificadas, ou por detrás das muralhas.",
                            "verse 59:15": "Parecem-se com os seus predecessores imediatos, ao auferirem e revés da sua conduta; terão um doloroso castigo.",
                            "verse 59:16": "São como Satanás, quando diz ao humano: Renega! Porém, quando este renega a Deus, diz-lhe: Sabe que não sou responsável pelo que te acontecer, porque temo a Deus, Senhor do Universo!",
                            "verse 59:17": "Porém, o destino deles é serem condenados ao fogo, onde permanecerão eternamente.",
                            "verse 59:18": "Ó fiéis, temei a Deus! E que cada alma considere o que tiver oferecido, para o dia de amanhã; temei, pois, a Deus, porque Deus está bem inteirado de tudo quanto fazeis.",
                            "verse 59:19": "E não sejais como aqueles que se esqueceram de Deus e, por isso mesmo, Ele os fez esquecerem-se de si próprios.",
                            "verse 59:20": "Jamais poderão equiparar-se os condenados ao inferno com os diletos do Paraíso, porque os diletos do Paraíso serão os ganhadores.",
                            "verse 59:21": "Se tivéssemos feito descer este Alcorão sobre uma montanha, tê-las-ias visto humilhar-se e fender-se, por temor a Deus, Tais exemplos propomos aos humanos, para que raciocinem.",
                            "verse 59:22": "Ele é Deus; não há mais divindade além d’Ele, conhecedor do cognoscível e do incognoscível.",
                            "verse 59:23": "Ele é Deus; não há mais divindade além d’Ele, Soberano, Augusto, Pacífico, Salvador, Zeloso, Poderoso, Compulsor, Supremo! Glorificado seja Deus, de tudo quanto (Lhe) associam!",
                            "verse 59:24": "Ele é Deus, Criador, Onifeitor, Formador."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 59:1": "Cele din ceruri și cele de pre pãmânt Îi aduc laudã lui Allah, cãciEl este Cel Puternic",
                            "verse 59:2": "Înțelept [Al-'Aziz, Al-Hakim].",
                            "verse 59:3": "El este Cel care i-a scos pe cei care nu au crezut dintre oameniiCãrții din cãminele lor în prima pribegie .",
                            "verse 59:4": "Și dacã Allah n-ar fi scris pentru ei pribegia, El i-ar fi chinut pe ei în lumea aceasta, iar în Lumea de Apoi ar fi avut parte de chinul Focului.",
                            "verse 59:5": "Aceasta pentru cã ei s-au împotrivit lui Allah și Trimisului Sãu.",
                            "verse 59:6": "Câți palmieri ați tãiat sau i-ați lãsat în picioare pe rãdãcinile lor,[aceasta a fost] cu voia lui Allah, pentru ca sã-i acopere de rușine pe nelegiuiți .",
                            "verse 59:7": "Voi nu ați intrat în nici o luptã cu cai și nici cu cãmile pentru ceeace Allah a dãruit ca pradã Trimisului Sãu de la ei.",
                            "verse 59:8": "Ceea ce Allah a dãruit Trimisului Sãu ca pradã de la locuitoriicetãților, aceasta aparține lui Allah și Trimisului, rudelor, or fanilor, sãrmanilor și cãlãtorului",
                            "verse 59:9": "[Și din acestea se cuvine] și muhajiriților sãraci care au fostalungați din cãminele lor și de la averile lor, cãutând îndurare șimulțumire de la Allah și fã",
                            "verse 59:10": "Cât despre aceia care, înainte de ei, s-au statornicit în Casã și încredințã și i-au iubit pe aceia care s-au dus în pribegie la ei, nu au avut în piepturile lor nici o supãrare pentru ceea ce li s-a dat",
                            "verse 59:11": "Și acelora care au venit dupã ei și au zis: \"Doamne, iartã-ne nouã și fraților noștri care ne-au luat-o înainte întru credințã și nu nelãsa în sufletele noastre nici un fel d",
                            "verse 59:12": "Oare nu i-ai vãzut pe cei fãțarnici , spunându-le fraților lor, care nu au crezut, dintre oamenii Cãrții : \"Dacã veți fi alungați , vom ieși împreunã cu voi și nu ne vom supune ni",
                            "verse 59:13": "Dar dacã ei sunt alungați, nu vor ieși împreunã cu ei, iar dacã se va purta luptã împotriva lor, nu le vor veni în ajutor.",
                            "verse 59:14": "Voi [stâr niți] în piepturile lor mai multã spaimã decât Allah.",
                            "verse 59:15": "Ei nu vor lupta laolaltã împotriva voastrã , ci numai din cetãți întãrite sau din spatele unor ziduri.",
                            "verse 59:16": "[Ei sunt] asemenea acelora care puțin înaintea lor au gustat urmarea rea a purtãrii lor și au avut parte de chin dureros .",
                            "verse 59:17": "[Ei sunt] asemenea lui Șeitan, când îi zice omului: \"Fii fãrã credințã!\", iar dupã ce el rãmâne necredincios, el zice: \"Eu nu am nicio vinã în privința ta! Eu mã tem de Allah, S",
                            "verse 59:18": "Și sfârșitul amândurora va fi în Focul în care vor rãmâne veșnic, cãci aceasta este rãsplata nelegiuiților.",
                            "verse 59:19": "O, voi cei care credeți, fiți cu fricã de Allah! Și fiecare suflet sãbage de seamã ce trimite înainte pentru Ziua de mâine! Și fiți cufricã de Allah, cãci Allah este bine știutor a tot",
                            "verse 59:20": "Nu fiți ca aceia care L-au uitat pe Allah și pe care El i-a fãcut de aceea sã uite de ei înșiși! Aceștia sunt nelegiuiții.",
                            "verse 59:21": "Oaspeții Focului nu sunt deopotrivã cu oaspeții Raiului! OaspețiiRaiului sunt cei care izbândesc.",
                            "verse 59:22": "Dacã am fi trimis Noi acest Coran unui munte, l-ai fi vãzut tu umilindu-se smerit și despicându-se de frica lui Allah.",
                            "verse 59:23": "El este Allah, afarã de care nu este alt dumnezeu, Știutorul celornevãzute și al celor vãzute.",
                            "verse 59:24": "El este Allah, afarã de care nu este alt dumnezeu: Stãpânitorul,",
                            "verse 59:25": "Cel Sfânt ,",
                            "verse 59:26": "Fãcãtorul de pace ,Apãrãtorul",
                            "verse 59:27": "Credinței ,",
                            "verse 59:28": "Veghetorul ,",
                            "verse 59:29": "CelTar",
                            "verse 59:30": "El este Allah: Fãcãtorul ,",
                            "verse 59:31": "Creatorul ,",
                            "verse 59:32": "Dãtã-torul de chipuri .",
                            "verse 59:33": "Ale Lui sunt numele cele mai frumoase."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 59:1": "Cele din ceruri şi de pe pământ îl preamăresc pe Dumnezeu.",
                            "verse 59:2": "El este Cel ce i-a prigonit din casele lor în cel dintâi surghiun pe oamenii Cărţii care tăgăduiau.",
                            "verse 59:3": "Dacă Dumnezeu nu le-ar fi sortit surghiunul, i-ar fi osândit în Viaţa de Acum.",
                            "verse 59:4": "Aceasta, căci s-au rupt de Dumnezeu şi de trimisul Său.",
                            "verse 59:5": "Câţi curmali aţi tăiat şi câţi aţi lăsat în picioare, a fost cu îngăduinţa lui Dumnezeu, iar El îi va face de ruşine pe cei desfrânaţi.",
                            "verse 59:6": "Dumnezeu îi dă toată prada trimisului Său, căci voi nu i-aţi sărit în ajutor pe cai şi pe cămile.",
                            "verse 59:7": "Ceea ce Dumnezeu a dăruit trimisului Său ca pradă de la locuitorii cetăţilor, este a lui Dumnezeu şi a trimisului Său, a rudelor sale, a orfanilor, a sărmanilor şi a drumeţului, însă nu şi celor dintre voi ce sunt bogaţi.",
                            "verse 59:8": "Prada este pentru sărmanii pribegiţi care din casele lor au fost prigoniţi şi de averile lor lipsiţi în vreme ce căutau harul şi mulţumirea lui Dumnezeu şi erau de ajutor lui Dumnezeu şi trimisului Său.",
                            "verse 59:9": "Cei care au venit, înaintea lor, în această casă şi credinţă, îl iubesc pe cel care vine în pribegie la ei.",
                            "verse 59:10": "Prada este a celor care au venit după ei spunând: “Domnul nostru! Iartă-ne nouă şi fraţilor noştri care au intrat înaintea noastră în credinţă.",
                            "verse 59:11": "Îi vezi pe cei care umblă cu făţărnicii? Ei spun fraţilor lor dintre oamenii Cărţii care tăgăduiesc: “Dacă veţi fi prigoniţi, vom pleca cu voi.",
                            "verse 59:12": "Dacă Oamenii Cărţii sunt prigoniţi, făţarnicii nu vor pleca cu ei.",
                            "verse 59:13": "Voi semănaţi în inimile lor mai multă groază decât Dumnezeu însuşi, fiindcă sunt oameni care nu pricep.",
                            "verse 59:14": "Toţi se războiesc cu voi numai din cetăţi fortificate ori din spatele zidurilor.",
                            "verse 59:15": "Ei sunt asemenea celor care cu puţin înaintea lor au gustat urmările faptelor lor.",
                            "verse 59:16": "Ei sunt asemenea Satanei când i-a spus omului: “Fii tăgăduitor!” Când acesta este însă tăgăduitor, îi spune: “Mă lepăd de tine! Da, eu mă tem de Domnul lumilor.",
                            "verse 59:17": "Sfârşitul amândurora va fi Focul, unde vor veşnici.",
                            "verse 59:18": "O, voi cei ce credeţi! Temeţi-vă de Dumnezeu! Fiecare să cumpănească ceea ce şi-a pregătit pentru ziua de mâine.",
                            "verse 59:19": "Nu fiţi ca cei care Îl uită pe Dumnezeu, căci Dumnezeu îi face să uite de ei înşişi.",
                            "verse 59:20": "Soţii Focului şi soţii Raiului nu sunt deopotrivă, căci soţii Raiului sunt cei fericiţi!",
                            "verse 59:21": "Dacă am fi pogorât acest Coran asupra unui munte, l-ai fi văzut smerindu-se şi despicându-se de frica lui Dumnezeu.",
                            "verse 59:22": "El este Dumnezeu! Nu este dumnezeu afară de El.",
                            "verse 59:23": "El este Dumnezeu! Nu este dumnezeu afară de El! El este Regele, Sfântul, Pacea, Credinciosul, Oblăduitorul, Puternicul, Tarele, Preamăritul.",
                            "verse 59:24": "El este Dumnezeu, Creatorul, Alcătuitorul, Plăsmuitorul."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Все в небесах и на землеХвалу и славу воздает Аллаху —Тому, Кто мудрости и мощипреисполнен.",
                            "verse 59:2": "Он — Тот, Кто из жилищ изгналневерныхИз обладателей (Господней) КнигиПри первом их переселенье.",
                            "verse 59:3": "И если бы Аллах им выселенияне предназначил,Он наказал бы в этом мире их.",
                            "verse 59:4": "И это все за то, что воспротивилисьони Аллаху и посланнику Его.",
                            "verse 59:5": "Ссекли ли вы часть (нежных) пальм,Оставили ль другие на корню —Все это волею Аллаха,Чтобы покрыть стыдом неверных.",
                            "verse 59:6": "Чтоб взять от них добро2225,Которое Аллах посланнику назначил,Вам не пришлось своих конейили верблюдов гнать.",
                            "verse 59:7": "Все то добро, что жаловал посланникуАллахОт жителей окружных сел,Принадлежит Аллаху, и посланникуЕго,И тем, кто близок по крови,Сиротам, путникам и нищим,Чтоб меж богатыми из васСие добро не расходилось.",
                            "verse 59:8": "И (доля этого добра — для) бедняков,Кто в поисках Господней милостии благЛишился дома и добра2226,Служа Аллаху и посланнику Его, —Они, поистине, благочестивы.",
                            "verse 59:9": "И те, кто в вере утвердился,И собственный очаг имеет,И повернулся всей душойК тем, кто нашел у них приют,И в своем сердце не испытывает тягиК тому добру, что предоставленодругим,А отдает им предпочтенье над собой,Хотя находится в нужде;И те, кто оградил себя от скупостидуши, —Они, поистине, восторжествуют!",
                            "verse 59:10": "И скажут те, кто после них пришел:«О наш Господь! Прости и нам,и нашим братьям!Не оставляй в наших сердцахобиды к тем,Которые до нас Тебе предались.",
                            "verse 59:11": "Ужель не видел ты, (о Мухаммад!),тех лицемеров,Кто говорит своим отвергшим верубратьямИз обладателей Господней Книги:«Коль будут вас отсюда гнать,Уйдем мы вместе с вами,И мы не станем слушать никого,Если о вас заходит дело;И если с вами будут воевать,Мы непременно вам окажем помощь».",
                            "verse 59:12": "И если тех отсюда будут гнать,За ними не пойдут они.",
                            "verse 59:13": "Ведь в их сердцах страх перед вамиСильнее, чем их страх перед Аллахом,И это потому, что сей народЛишен любого разуменья.",
                            "verse 59:14": "Они не будут с вами воевать единойсилой,А лишь из укрепленных селили закрытых стен;И меж собой у них жестокая вражда.",
                            "verse 59:15": "Подобно тем, кто был до них,Они уже вкусили (в жизни ближней)Своих деяний вредный плод, —И им — жестокая расплата!",
                            "verse 59:16": "(Они) подобны Сатане.",
                            "verse 59:17": "Концом обоих будет то,Что они вступят в огнь Ада,Навечно в нем пристанище найдут, —Таким и будет воздаяние неверным!",
                            "verse 59:18": "О вы, кто верует! Благочестивы будьтепред Аллахом,Страшася (гнев) Его (навлечь)!И пусть посмотрит каждая душа,Что’ уготовила себе на завтра.",
                            "verse 59:19": "Не будьте вы подобны тем,Которые забыли Бога,А Он заставил их забыть самихсебя, —Они все грешники (надменные)(пред Богом).",
                            "verse 59:20": "И меж собою не сравнятьсяВсем обитателям Огня и Сада,И в благодати быть лишь обитателямСадов!",
                            "verse 59:21": "И если б сей Коран Мы низвелина гору,Склонилась бы в смирении онаИ раскололась в страхепред Аллахом, —Такие Мы приводим притчи людям,Чтоб поразмыслили они.",
                            "verse 59:22": "И Он — Аллах!Кроме Него, другого божестване существует.",
                            "verse 59:23": "И Он — Аллах!Кроме Него, другого божестване существует.",
                            "verse 59:24": "И Он — Аллах, Творец(Вселенной)2226а,Создатель (совершенного порядкав ней),Образователь (высших форми видов), —К Нему прекраснейшие именавосходят,И все, что в небесах и на земле,Хвалу и славу воздает Аллаху,(Кто безгранично) мудр и велик! Ему!"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Lo que está en los cielos y en la tierra glorifica a Alá.",
                            "verse 59:2": "Él es Quien expulsó de sus viviendas a los de la gente de la Escritura que no creían, cuando la primera reunión.",
                            "verse 59:3": "Si Alá no hubiera decretado su destierro, les habría castigado en la vida de acá.",
                            "verse 59:4": "por haberse separado de Alá y de Su Enviado.",
                            "verse 59:5": "Cuando talabais una palmera o la dejabais en pie, lo hacíais con permiso de Alá y para confundir a los perversos.",
                            "verse 59:6": "No habéis contribuido ni con caballos ni con camellos a lo que, de ellos, ha concedido Alá a Su Enviado.",
                            "verse 59:7": "Lo que Alá ha concedido a Su Enviado, de la población de las ciudades, pertenece a Alá, al Enviado.",
                            "verse 59:8": "A los emigrados necesitados, que fueron expulsados de sus hogares y despojados de sus bienes cuando buscaban favor de Alá y satisfacerle, auxiliar a Alá y a Su Enviado.",
                            "verse 59:9": "Los ya establecidos en la Casa y en la fe desde antes de su llegada, aman a los que han emigrado a ellos, no codician lo que se les ha dado y les prefieren a sí mismos, aun si están en la penuria.",
                            "verse 59:10": "Quienes vinieron después de ellos, dicen: «¡Señor! ¡Perdónanos, a nosotros y a nuestros hermanos que nos han precedido en la fe! ¡Haz que no abriguen nuestros corazones rencor a los que creen! ¡Señor! Tú eres manso, misericordioso».",
                            "verse 59:11": "¿No has visto a los hipócritas, que dicen a sus hermanos infieles de los de la gente de la Escritura: «Si os expulsan, nos iremos, ciertamente, con vosotros, y nunca obedeceremos a nadie que nos mande algo contra vosotros.",
                            "verse 59:12": "Si son expulsados, no se irán con ellos.",
                            "verse 59:13": "Infundís en sus pechos más terror que Alá.",
                            "verse 59:14": "No combatirán unidos contra vosotros, sino en poblados fortificados o protegidos por murallas.",
                            "verse 59:15": "Como los que fueron poco antes que ellos.",
                            "verse 59:16": "Como el Demonio cuando dice al hombre: «¡No creas!».",
                            "verse 59:17": "Su fin será el Fuego, eternamente.",
                            "verse 59:18": "¡Creyentes! ¡Temed a Alá! ¡Que cada uno considere lo que prepara para Mañana! ¡Temed a Alá! Alá está bien informado de lo que hacéis.",
                            "verse 59:19": "No seáis como quienes, habiendo olvidado a Alá, hace Él que se olviden de sí mismos.",
                            "verse 59:20": "No son iguales los moradores del Fuego y los moradores del Jardín.",
                            "verse 59:21": "Si hubiéramos hecho descender este Corán en una montaña, habrías visto a ésta humillarse y henderse por miedo a Alá.",
                            "verse 59:22": "Es Alá -no hay más dios que Él-, el Conocedor de lo oculto y de lo patente.",
                            "verse 59:23": "Es Alá -no hay más dios que Él-, el Rey, el Santísimo, la Paz, Quien da Seguridad, el Custodio, el Poderoso, el Fuerte, el Sumo.",
                            "verse 59:24": "Es Alá, el Creador, el Hacedor, el Formador."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "வானங்களிலுள்ளவையும், பூமியிலுள்ளவையும் அல்லாஹ்வை தஸ்பீஹு செய்கின்றன (துதிக்கின்றன); அவன் (யாவரையும்) மிகைத்தவன், ஞானம் மிக்கவன்.",
                            "verse 59:2": "வேதத்தை உடையோரில் எவர்கள் நிராகரித்துக் கொண்டிருந்தனரோ, அவர்களை அவர்களுடைய வீடுகளிலிருந்து முதல் வெளியேற்றத்தில் வெளியேற்றியவன் அவனே, எனினும் அவர்கள் வெளியேறுவார்கள் என்று நீங்கள் நினைக்கவில்லை, அவர்களும், தங்களுடைய கோட்டைகள் நிச்சயமாக அல்லாஹ்வை விட்டும் தங்களைத் தடுத்துக் கொள்பவை என்று நினைத்தார்கள்; ஆனால், அவர்கள் எண்ணியிராத புறத்திலிருந்து அவர்கள்பால் அல்லாஹ் (வேதனையைக் கொண்டு) வந்து அவர்களுடைய இதயங்களில் பீதியையும் போட்டான், அன்றியும் அவர்கள் தம் கைகளாலும் முஃமின்களின் கைகளாலும் தம் வீடுகளை அழித்துக் கொண்டனர் எனவே அகப்பார்வையுடையோரே! நீங்கள் (இதிலிருந்து) படிப்பினை பெறுவீர்களாக.",
                            "verse 59:3": "தவிரவும், அவர்கள் மீது வெளியேறுகையை அல்லாஹ் விதிக்காதிருந்தால், இவ்வுலகிலேயே அவர்களைக் கடினமாக வேதனை செய்திருப்பான், இன்னும் அவர்களுக்கு மறுமையிலும் (நரக) நெருப்பின் வேதனை உண்டு.",
                            "verse 59:4": "அதற்கு(க் காரணம்); நிச்சயமாக அவர்கள் அல்லாஹ்வுக்கும், அவனுடைய தூதருக்கும் விரோதம் செய்தார்கள், அன்றியும், எவன் அல்லாஹ்வை விரோதிக்கின்றானோ, (அவனை) நிச்சயமாக அல்லாஹ் வேதனை செய்வதில் கடினமானவன்.",
                            "verse 59:5": "நீங்கள் (அவர்களுடைய) பேரீத்த மரங்களை வெட்டியதோ, அல்லது அவற்றின் வேர்களின் மீது அவை நிற்கும்படியாக விட்டு விட்டதோ அல்லாஹ்வின் அனுமதியாலும், அந்த ஃபாஸிக்குகளை(ப் பாவிகளை) அவன் இழிவு படுத்துவதற்காவுமே தான்.",
                            "verse 59:6": "மேலும், அல்லாஹ் தன் தூதருக்கு அவர்களிலிருந்தும் எதை (மீட்டுக்) கொடுத்தானோ அதற்காக நீங்கள் குதிரைகளையோ, ஒட்டகங்களையோ ஓட்டி(ப் போர் செய்து) விடவில்லை, எனினும், நிச்சியமாக அல்லாஹ் தான் நாடுவோர் மீது தம் தூதர்களுக்கு ஆதிக்கத்தைத் தருகிறான்; மேலும் அல்லாஹ் எல்லாப் பொருட்களின் மீதும் பேராற்றலுடையவன்.",
                            "verse 59:7": "அவ்வூராரிடமிருந்தவற்றில் அல்லாஹ் தன் தூதருக்கு (மீட்டுக்) கொடுத்தவை, அல்லாஹ்வுக்கும் (அவன்) தூதருக்கும், உறவினர்களுக்கும், அநாதைகளுக்கும், ஏழைகளுக்கும், வழிப்போக்கருக்குமாகும், மேலும், உங்களிலுள்ள செல்வந்தர்களுக்குள்ளேயே (செல்வம்) சுற்றிக் கொண்டிருக்காமல் இருப்பதற்காக (இவ்வாறு பங்கிட்டுக் கொடுக்கக் கட்டளையிடப் பட்டுள்ளது) மேலும், (நம்) தூதர் உங்களுக்கு எதைக் கொடுக்கின்றாரோ அதை எடுத்துக் கொள்ளுங்கள், இன்னும், எதை விட்டும் உங்களை விலக்குகின்றாரோ அதை விட்டும் விலகிக் கொள்ளுங்கள், மேலும், அல்லாஹ்வை அஞ்சிக் கொள்ளுங்கள்.",
                            "verse 59:8": "எவர்கள் தம் வீடுகளையும், தம் சொத்துகளையும் விட்டு, அல்லாஹ்வின் அருளையும், அவன் திருப் பொருத்தத்தையும் தேடியவர்களாக வெளியேற்றப்பட்டனரோ அந்த ஏழை முஹாஜிர்களுக்கும் (ஹிஜ்ரத் செய்தவர்களுக்கும் அப்பொருளில் பங்குண்டு); அல்லாஹ்வுக்கும் அவன் தூதருக்கும் உதவி செய்து கொண்டிருக்கின்றனர் அவர்கள் தாம் உண்மையாளர்கள்.",
                            "verse 59:9": "இன்னும் சிலருக்கும் (இதில் பங்குண்டு, அவர்கள் மதீனாவில் முஹாஜிர்களுக்கு) முன்னரே ஈமானுடன் வீட்டை அமைத்துக் கொண்டவர்கள், அவர்கள் நாடு துறந்து தங்களிடம் குடியேறி வந்தவர்களை நேசிக்கின்றனர், அன்றியும் அ(வ்வாறு குடியேறிய)வர்களுக்குக் கொடுக்கப் பட்டதிலிருந்து தங்கள் நெஞ்சங்களில் தேவைப்பட மாட்டார்கள், மேலும், தங்களுக்குத் தேவையிருந்த போதிலும், தங்களைவிட அவர்களையே (உதவி பெறுவதற்குத் தக்கவர்களாகத்) தேர்ந்தெடுத்துக் கொள்வார்கள் - இவ்வாறு எவர்கள் உள்ளத்தின் உலோபித்தனத்திலிருந்து காக்கப்பட்டார்களோ, அத்தகையவர்கள் தான் வெற்றி பெற்றவர்கள் ஆவார்கள்.",
                            "verse 59:10": "அவர்களுக்குப்பின் குடியேறியவர்களுக்கும் (இதில் பங்குண்டு).",
                            "verse 59:11": "(நபியே!) நயவஞ்சகம் செய்வோரை நீர் கவனிக்கவில்லையா? அவர்கள், வேதத்தை உடையோரிலுள்ள நிராகரித்துக் கொண்டிருப்போரான தம் சகோதரர்களிடம் \"நீங்கள் வெளியேற்றப்பட்டால், உங்களுடன் நாங்களும் நிச்சயமாக வெளியேறுவோம், அன்றியும், (உங்களுக்கெதிராக) நாங்கள் எவருக்கும், எப்பொழுதும் நாம் வழிப்பட மாட்டோம்; மேலும், உங்களுக்கெதிராக போர் செய்யப்பெற்றால், நிச்சயமாக நாங்கள் உங்களுக்கு உதவி செய்வோம்\" என்று கூறுகின்றனர், ஆனால் நிச்சயமாக அவர்கள் பொய்யர்கள் என்று அல்லாஹ் சாட்சியங் கூறுகிறான்.",
                            "verse 59:12": "அவர்கள் வெளியேற்றப்பட்டால், இவர்கள் அவர்களுடன் வெளியேற மாட்டார்கள், மேலும், அவர்களுக்கெதிராக போர் செய்யப்பெற்றால், இவர்கள் அவர்களுக்கு உதவி செய்யவும் மாட்டார்கள், அன்றியும் இவர்கள் அவர்களுக்கு உதவி செய்தாலும், நிச்சயமாக புறுமுதுகு காட்டிப் பின் வாங்கி விடுவார்கள் - பின்னர் அவர்கள் (எத்தகைய) உதவியும் அளிக்கப்பட மாட்டார்கள்.",
                            "verse 59:13": "நிச்சயமாக, அவர்களுடைய இதயங்களில் அல்லாஹ்வை விட உங்களைப் பற்றிய பயமே பலமாக இருக்கிறது, (அல்லாஹ்வை விட்டும் அவர்கள் உங்களை அதிகம் அஞ்சுவதற்கு காரணம்) அவர்கள் (உண்மையை) உணர்ந்து கொள்ளாத சமூகத்தினராக இருப்பதனால்தான் இந்த நிலை!",
                            "verse 59:14": "கோட்டைகளால் அரண் செய்யப்பட்ட ஊர்களிலோ அல்லது மதில்களுக்கு அப்பால் இருந்து கொண்டோ அல்லாமல் அவர்கள் எல்லோரும் ஒன்று சேர்ந்து உங்களுடன் போரிட மாட்டார்கள், அவர்களுக்குள்ளேயே போரும், பகையும் மிகக் கடுமையானவை, (இந்நிலையில்) அவர்கள் யாவரும் ஒன்று பட்டிருப்பதாக நீர் எண்ணுகிறீர்; (ஆனால்) அவர்களுடைய இதயங்கள், சிதறிக் கிடக்கின்றன - இதற்குக் காரணம்; மெய்யாகவே அவர்கள் அறிவற்ற சமூகத்தார் என்பதுதான்.",
                            "verse 59:15": "இவர்களுக்கு முன்னர் (காலத்தால்) நெருங்கி இருந்த சிலரைப் போன்றே (இவர்களும் இருக்கின்றனர்) அவர்கள் தம் தீய செயல்களுக்குரிய பலனை அனுபவித்தனர், அன்றியும், அவர்களுக்கு (மறுமையில்) நோவினை செய்யும் வேதனையுமுண்டு.",
                            "verse 59:16": "(இன்னும் இவர்கள் நிலை) ஷைத்தானுடைய உதாரணத்தைப் போன்றிருக்கிறது, (அவன்) மனிதனை நோக்கி, \"நீ (இறைவனை) நிராகரித்து விடு\" என்று கூறுகிறான்.",
                            "verse 59:17": "அவ்விருவரின் முடிவு, நிச்சயமாக அவர்கள் என்றென்றும் தங்கும் நரக நெருப்புத்தான், அநியாயக் காரர்களின் கூலி இதுவேயாகும்.",
                            "verse 59:18": "ஈமான் கொணடவர்களே! அல்லாஹ்வுக்கு அஞ்சி நடந்து கொள்ளுங்கள், மேலும், ஒவ்வொருவரும் (மறுமை) நாளுக்காக தான் முற்படுத்தி வைத்திருப்பதைப் பார்த்துக் கொள்ளட்டும், இன்னும், நீங்கள் அல்லாஹ்வை அஞ்சி நடந்து கொள்ளுங்கள், நீங்கள் செய்பவற்றை, நிச்சயமாக அல்லாஹ் நன்கறிந்தவன்.",
                            "verse 59:19": "அன்றியும், அல்லாஹ்வை மறந்து விட்டவர்கள் போன்று நீங்கள் ஆகிவிடாதீர்கள், ஏனெனில் அவர்கள் தங்களையே மறக்கும்படி (அல்லாஹ்) செய்து விட்டான், அத்தகையோர் தாம் ஃபாஸிக்குகள் - பெரும் பாவிகள் ஆவார்கள்.",
                            "verse 59:20": "நரக வாசிகளும், சுவர்க்கவாசிகளும் சமமாக மாட்டார்கள், சுவர்க்கவாசிகளே பெரும் பாக்கியம் உடையோர்.",
                            "verse 59:21": "(நபியே!) நாம் ஒரு மலையின் மீது இந்த குர்ஆனை இறக்கியிருந்தோமானால், அல்லாஹ்வின் பயத்தால், அது நடுங்கிப் பிளந்து போவதாகக் கண்டிருப்பீர்; மேலும், மனிதர்கள் சிந்திக்கும் பொருட்டு இத்தகைய உதாரணங்களை நாம் அவர்களுக்கு விளக்குகிறோம்.",
                            "verse 59:22": "அவனே அல்லாஹ், வணக்கத்திற்குரியவன், அவனைத் தவிர வேறு நாயன் இல்லை, மறைவானதையும், பகிரங்கமானதையும் அறிபவன், அவனே அளவற்ற அருளாளன், நிகரற்ற அன்புடையோன்.",
                            "verse 59:23": "அவனே அல்லாஹ், வணக்கத்திற்குரிய நாயன் அவனைத் தவர, வேறு யாரும் இல்லை, அவனே பேரரசன், மிகப்பரிசுத்தமானவன், சாந்தியளிப்பவன், தஞ்சமளிப்பவன், பாதுகாப்பவன், (யாவரையும்) மிகைப்பவன், அடக்கியாள்பவன், பெருமைக்குரித்தானவன் - அவர்கள் இணைவைப்பவற்றையெல்லாம் விட்டு அல்லாஹ் மிகத் தூய்மையானவன்.",
                            "verse 59:24": "அவன்தான் அல்லாஹ்; படைப்பவன், ஒழுங்குபடுத்தி உண்டாக்குபவன், உருவமளிப்பவன் - அவனுக்கு அழகிய திருநாமங்கள் இருக்கின்றன, வானங்களிலும், பூமியிலும் உள்ளவையாவும் அவனையே தஸ்பீஹு (செய்து துதி) செய்கின்றன - அவனே (யாவரையும்) மிகைத்தவன் ஞானம் மிக்கவன்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "สิ่งที่อยู่ในชั้นฟ้าทั้งหลาย และสิ่งที่อยู่ในแผ่นดินต่างแซ่ซ้องสดุดีแด่อัลลอฮ์ และพระองค์เป็นผู้ทรงทรงอำนาจ ผู้ทรงปรีชาญาณ",
                            "verse 59:2": "พระองค์เป็นผู้ทรงให้บรรดาผู้ปฏิเสธศรัทธาในหมู่พวกอะฮ์ลุลกิตาลออกจากบ้านเรือนของพวกเขา เป็นครั้งแรกของการถูกไล่ออกเป็นกลุ่ม ๆ พวกเจ้ามิได้คาดคิดกันเลยว่าพวกเขาจะออกไป (ในสภาพเช่นนั้น) และพวกเขาคิดว่า แท้จริงป้อมปราการของพวกเขานั้นจะป้องกันพวกเขาให้รอดพ้นจากการลงโทษของอัลลอฮ์ได้ แต่การลงโทษของอัลลอฮ์ได้มีมายังพวกเขาโดยมิได้คาดคิดมาก่อนเลย และพระองค์ทรงทำให้ความหวาดกลัวเกิดขึ้นในจิตใจของพวกเขา โดยพวกเขาได้ทำลายบ้านเรือนของพวกเขาด้วยน้ำมือของพวกเขาเอง และด้วยน้ำมือของบรรดามุอฺมิน จงยึดถือเป็นบทเรียนเถิด โอ้ผู้มีสติปัญญาทั้งหลายเอ๋ย",
                            "verse 59:3": "และหากมิใช่เพราะอัลลอฮ์ได้ทรงกำหนดการเนรเทศแก่พวกเขาแล้ว แน่นอนพระองค์จะทรงลงโทษพวกเขาในโลกนี้ และสำหรับพวกเขาในปรโลกนั้นก็คือการลงโทษด้วยนรก",
                            "verse 59:4": "ทั้งนี้ก็เพราะว่า พวกเขาต่อต้านอัลลอฮ์และร่อซู้ลของพระองค์ และผู้ใดต่อต้านอัลลอฮ์ แท้จริงอัลลอฮ์เป็นผู้ทรงเข้มงวดในการลงโทษ",
                            "verse 59:5": "การที่พวกเจ้าโค่นต้นอินทผาลัมหรือปล่อยให้มันยืนไว้บนรากของมันนั้น เนื่องด้วยอนุมัติของอัลลอฮ์ และเพื่อพระองค์จะทำให้บรรดาผู้ฝ่าฝืนได้รับอัปยศ",
                            "verse 59:6": "และสิ่งใดที่อัลลอฮ์ทรงให้ร่อซู้ลของพระองค์ยึดมาได้จากพวกเขา (พวกยะฮูด) พวกเจ้ามิได้เหน็ดเหนื่อยด้วยการขี่ม้าหรือขี่อูฐออกไป แต่อัลลอฮ์ทรงให้บรรดาร่อซู้ลของพระองค์มีอำนาจเหนือผู้ที่พระองค์ทรงประสงค์ และอัลลอฮ์เป็นผู้ทรงอานุภาพเหนือทุกสิ่งทุกอย่าง",
                            "verse 59:7": "และสิ่งใดที่อัลลอฮ์ทรงให้ร่อซู้ลของพระองค์ยึดมาได้จากชาวเมือง (พวกกุฟฟาร) เป็นสิทธิ์ของอัลลอฮ์และร่อซู้ล และญาติสนิท และเด็กกำพร้า และผู้ขัดสน และผู้เดินทาง เพื่อมันจะมิได้หมุนเวียนอยู่ในระหว่างผู้มั่งมีของพวกเจ้าเท่านั้น และอันใดที่ร่อซู้ลได้นำมายังพวกเจ้าก็จงยึดเอาไว้ และอันใดที่ท่านได้ห้าม พวกเจ้าก็จงละเว้นเสีย พวกเจ้าจงยำเกรงอัลลอฮ์เถิด แท้ริงอัลลอฮ์เป็นผู้ทรงเข้มงวดในการลงโทษ",
                            "verse 59:8": "(สิ่งที่ยึดมาได้จากพวกยะฮูด) เป็นของบรรดาผู้อพยพที่ขัดสน ซึ่งถูกขับไล่ออกจากบ้านเกิดเมืองนอนของพวกเขาและทอดทิ้งทรัพย์สินของพวกเขาเพื่อแสวงหาความโปรดปรานจากอัลลอฮ์ และความยินดีของพระองค์ และช่วยเหลืออัลลอฮ์และร่อซู้ลของพระองค์ ชนเหล่านั้นพวกเขาคือผู้สัตย์จริง",
                            "verse 59:9": "และบรรดาผู้ที่ได้ตั้งหลักแหล่งอยู่ที่นครมะดีนะฮ์ (ชาวอันศอร) และพวกเขาศรัทธาก่อนหน้าการอพยพของพวกเขา (ชาวมุฮาญิรีน) พวกเขารักใคร่ผู้ที่อพยพมายังพวกเขา และจะไม่พบความต้องการหรือความอิจาฉาอยู่ในทรวงอกของพวกเขาในสิ่งที่ได้ถูกประทานให้ และให้สิทธิผู้อื่นก่อนตัวของพวกเขาเอง ถึงแม้ว่าพวกเขายังมีความต้องการอยู่มากก็ตาม และผู้ใดปกป้องการตระหนี่ที่อยู่ในตัวของเขา ชนเหล่านั้นพวกเขาเป็นผู้ประสบความสำเร็จ",
                            "verse 59:10": "และบรรดาผู้ที่มาหลังจากพวกเขา โดยพวกเขากล่าวว่า ข้าแต่พระเจ้าของเราทรงโปรดอภัยให้แก่เราและพี่น้องของเราผู้ซึ่งได้ศรัทธาก่อนหน้าเรา และขอพระองค์อย่าได้ให้มีการเคียดแค้นเกิดขึ้นในหัวใจของเราต่อบรรดาผู้ศรัทธา ข้าแต่พระเจ้าของเรา แท้จริงพระองค์ท่านเป็นผู้ทรงเอ็นดู ผู้ทรงเมตตาเสมอ",
                            "verse 59:11": "เจ้ามิเห็นดอกหรือว่า บรรดาผู้กลับกลอกกล่าวแก่พี่น้องของพวกเขาที่ปฏิเสธศรัทธาในหมู่อะฮ์ลุลกิตาบว่า หากพวกท่านถูกไล่ออกแน่นอนเราก็จะออกไปพร้อมกับพวกท่านด้วย และเราจะไม่เชื่อฟังปฏิบัติตามผู้ใดเป็นอันขาดเกี่ยวกับพวกท่าน และหากพวกท่านถูกโจมตี แน่นอนเราจะช่วยเหลือพวกท่าน และอัลลอฮ์ทางเป็นพยานว่า แท้จริงพวกเขาเป็นผู้กล่าวเท็จ",
                            "verse 59:12": "หากพวกเขาถูกขับไล่ออกไป บรรดาผู้กลับกลอกเหล่านั้นก็จะไม่ออกไปพร้อมกับพวกเขา และถ้าพวกเขาถูกโจมตี บรรดาผู้กลับกลอกเหล่านั้นก็จะไม่ช่วยเหลือพวกเขา (ยะฮูดบะนีนะฎีร) และหากบรรดาผู้กลับกลอกช่วยเหลือพวกเขา แน่นอนบรรดาผู้กลับกลอกก็จะผินหลังหนีออกไป พวกเขาก็จะไม่ได้รับความช่วยเหลือ",
                            "verse 59:13": "แน่นอนพวกเจ้านั้นเป็นที่หวาดเกรงในทรวงอกของพวกเขายิ่งกว่าที่พวกเขามีต่ออัลลอฮ์ ทั้งนี้ก็เพราะว่าพวกเขาเป็นหมู่ชนที่ไม่เข้าใจ",
                            "verse 59:14": "พวกเขาทั้งหมดจะไม่ต่อสู้กับพวกเจ้า เว้นแต่ในเมืองที่มีป้องปราการ หรือจากเบื้องหลังของกำแพง การเป็นศัตรูระหว่างพวกเขากันเองนั้นรุนแรงยิ่งนัก เจ้าเข้าใจว่าพวกเขารวมกันเป็นปึกแผ่น แต่ (ความจริงแล้ว) จิตใจของพวกเขาแตกแยกกัน ทั้งนี้ก็เพราะว่าพวกเขาเป็นหมู่ชนที่ไม่ใช้สติปัญญาใคร่ครวญ",
                            "verse 59:15": "(สภาพของพวกเขา) ประหนึ่งอุปมาสภาพของบรรดา (พวกยิว) ก่อนหน้าพวกเขาเพียงเล็กน้อย ซึ่งพวกเขาได้ลิ้มรสผลร้ายแห่งการงานของพวกเขา และการลงโทษอันเจ็บปวดจะได้แก่พวกเขา",
                            "verse 59:16": "ประหนึ่งเช่นชัยฏอนเมื่อมันกล่าวแก่มนุษย์ว่า จงปฏิเสธศรัทธาเถิด ครั้นเมื่อเขาได้ปฏิเสธศรัทธาแล้ว มันจะกล่าวว่า แท้จริงฉันขอปลีกตัวออกจากท่าน แท้จริงฉันกลัวอัลลอฮ์ พระเจ้าแห่งสากลโลก",
                            "verse 59:17": "ดังนั้น บั้นปลายของพวกเขาทั้งสองคือ พวกเขาทั้งสองจะพำนักอยู่ในนรก เป็นผู้พำนักอยู่ในนั้นตลอดกาล และนั่นคือการตอบแทนของบรรดาผู้อธรรม",
                            "verse 59:18": "โอ้บรรดาผู้ศรัทธาเอ๋ย พวกเจ้าจงยำเกรงอัลลอฮ์เถิด และทุกชีวิตจงพิจารณาดูว่า อะไรบ้างที่ตนได้เตรียมไว้สำหรับวันพรุ่งนี้ (วันกิยามะฮ์) และจงยำเกรงอัลลอฮ์เถิด แท้จริงอัลลอฮ์นั้นทรงรู้ดียิ่งในสิ่งที่พวกเจ้ากระทำ",
                            "verse 59:19": "และพวกเจ้าอย่าได้เป็นเช่นบรรดาผู้ที่ลืมอัลลอฮ์ มิฉะนั้นอัลลอฮ์จะทรงทำให้พวกเขาลืมตัวของพวกเขาเอง ชนเหล่านั้นพวกเขาเป็นผู้ฝ่าฝืน",
                            "verse 59:20": "บรรดาชาวนรกกับบรรดาชาวสวนสวรรค์นั้นไม่เหมือนกันดอก บรรดาชาวสวนสวรรค์พวกเขาเป็นผู้ได้รับความสำเร็จ",
                            "verse 59:21": "หากเราประทานอัลกุรอานนี้ลงมาบนภูเขาลูกหนึ่ง แน่นอนเจ้าจะเห็นมันนอบน้อมแตกแยกออกเป็นเสี่ยง ๆ เนื่องเพราะความกลัวต่ออัลลอฮ์ อุปมาเหล่านี้เราได้ยกมันมาเปรียบเทียบสำหรับมนุษย์เพื่อพวกเขาจะได้พิจารณาใคร่ครวญ",
                            "verse 59:22": "พระองค์คืออัลลอฮ์ ซึ่งไม่มีพระเจ้าอื่นใดอีกนอกจากพระองค์ ผู้ทรงรองรู้สิ่งเร้นลับและสิ่งเปิดเผย พระองค์คือผู้ทรงกรุณาปรานี ผู้ทรงเมตตาเสมอ",
                            "verse 59:23": "พระองค์คือ อัลลอฮ์ ซึ่งไม่มีพระเจ้าอื่นใดอีกนอกจากพระองค์ ผู้ทรงอำนาจสูงสุด ผู้ทรงบริสุทธิ์ ผู้ทรงความศานติสุข ผู้ทรงคุ้มครองการศรัทธา ผู้ทรงปกปักรักษาความปลอดภัย ผู้ทรงอำนาจยิ่ง ผู้ทรงปราบให้เรียบร้อย ผู้ทรงความยิ่งใหญ่ภูมิใจ มหาบริสุทธิ์แด่อัลลอฮ์ให้พ้นจากสิ่งที่พวกเขาตั้งภาคีต่อพระองค์",
                            "verse 59:24": "พระองค์คือ อัลลอฮ์ ผู้ทรงสร้าง ผู้ทรงให้บังเกิด ผู้ทรงทำให้เป็นรูปร่าง สำหรับพระองค์คือพระนามทั้งหลายอันสวยงามไพเราะ สิ่งที่อยู่ในชั้นฟ้าทั้งหลายและแผ่นดินต่างแซ่ซ้องสดุดีพระองค์ และพระองค์เป็นผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Göklerde ve yerde olanların hepsi Allah'ı tesbih etmektedir.",
                            "verse 59:2": "Ehl-i kitaptan inkâr edenleri, ilk sürgünde yurtlarından çıkaran O'dur.",
                            "verse 59:3": "Eğer Allah onlara sürgünü yazmamış olsaydı, elbette onları dünyada (başka şekilde) cezalandıracaktı.",
                            "verse 59:4": "Bu, onların Allah'a ve Peygamberine karşı gelmelerinden dolayıdır.",
                            "verse 59:5": "Hurma ağaçlarından, herhangi birini kesmeniz veya olduğu gibi bırakmanız hep Allah'ın izniyledir ve O'nun yoldan çıkanları rezil etmesi içindir.",
                            "verse 59:6": "Allah'ın, onlardan (mallarından) Peygamberine verdiği ganimetler için siz at ve deve koşturmuş değilsiniz.",
                            "verse 59:7": "Allah'ın, (fethedilen) ülkeler halkından Peygamberine verdiği ganimetler, Allah, Peygamber, yakınları, yetimler, yoksullar ve yolda kalmışlar içindir.",
                            "verse 59:8": "(Allah'ın verdiği bu ganimet malları,) yurtlarından ve mallarından uzaklaştırılmış olan, Allah'tan bir lütuf ve rıza dileyen, Allah'ın dinine ve Peygamberine yardım eden fakir muhacirlerindir.",
                            "verse 59:9": "Daha önceden Medine'yi yurt edinmiş ve gönüllerine imanı yerleştirmiş olan kimseler, kendilerine göç edip gelenleri severler ve onlara verilenlerden dolayı içlerinde bir rahatsızlık hissetmezler.",
                            "verse 59:10": "Bunların arkasından gelenler şöyle derler: Rabbimiz! Bizi ve bizden önce gelip geçmiş imanlı kardeşlerimizi bağışla; kalplerimizde, iman edenlere karşı hiçbir kin bırakma! Rabbimiz! Şüphesiz ki sen çok şefkatli, çok merhametlisin!",
                            "verse 59:11": "Münafıkların, kitap ehlinden inkâr eden dostlarına: Eğer siz yurdunuzdan çıkarılırsanız, mutlaka biz de sizinle beraber çıkarız; sizin aleyhinizde kimseye asla uymayız.",
                            "verse 59:12": "Andolsun, eğer onlar çıkarılsalar, onlarla beraber çıkmazlar; savaşa tutuşmuş olsalar, onlara yardım etmezler; yardım etseler bile arkalarını dönüp kaçarlar, sonra kendilerine de yardım edilmez.",
                            "verse 59:13": "Onların içlerinde size karşı duydukları korku, Allah'a olan korkularından daha şiddetlidir.",
                            "verse 59:14": "Onlar müstahkem şehirlerde veya siperler arkasında bulunmaksızın sizinle toplu halde savaşamazlar.",
                            "verse 59:15": "(Onların durumu) kendilerinden az önce geçmiş ve yaptıklarının cezasını tatmış olanların durumu gibidir.",
                            "verse 59:16": "Münafıkların durumu tıpkı şeytanın durumu gibidir.",
                            "verse 59:17": "Nihayet ikisinin de sonu, içinde ebedî kalacakları ateş olacaktır.",
                            "verse 59:18": "Ey iman edenler! Allah'tan korkun ve herkes, yarına ne hazırladığına baksın.",
                            "verse 59:19": "Allah'ı unutan ve bu yüzden Allah'ın da onlara kendilerini unutturduğu kimseler gibi olmayın.",
                            "verse 59:20": "Cehennem ehliyle cennet ehli bir olmaz.",
                            "verse 59:21": "Eğer biz bu Kur'an'ı bir dağa indirseydik, muhakkak ki onu, Allah korkusundan baş eğerek, parça parça olmuş görürdün.",
                            "verse 59:22": "O, öyle Allah'tır ki, O'ndan başka tanrı yoktur.",
                            "verse 59:23": "O, öyle Allah'tır ki, kendisinden başka hiçbir tanrı yoktur.",
                            "verse 59:24": "O, yaratan, var eden, şekil veren Allah'tır."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "جو چیزیں آسمانوں میں ہیں اور جو چیزیں زمین میں ہیں (سب) خدا کی تسبیح کرتی ہیں۔ اور وہ غالب حکمت والا ہے",
                            "verse 59:2": "جو کچھ آسمانوں ميں ہے اور جو کچھ زمين ميں ہے (سب) اللہ کي تسبيح کرتے ہيں، اور وہي غالب ہے حکمت والا ہےo",
                            "verse 59:3": "وہي ہے جس نے اُن کافر کتابيوں کو (يعني بنو نضير کو) پہلي جلاوطني ميں گھروں سے (جمع کر کے مدينہ سے شام کي طرف) نکال ديا? تمہيں يہ گمان (بھي) نہ تھا کہ وہ نکل جائيں گے اور انہيں يہ گمان تھا کہ اُن کے مضبوط قلعے انہيں اللہ (کي گرفت) سے بچا ليں گے پھر اللہ (کے عذاب) نے اُن کو وہاں سے آليا جہاں سے وہ گمان (بھي) نہ کرسکتے تھے اور اس (اللہ) نے اُن کے دلوں ميں رعب و دبدبہ ڈال ديا وہ اپنے گھروں کو اپنے ہاتھوں اور اہلِ ايمان کے ہاتھوں ويران کر رہے تھے? پس اے ديد? بينا والو! (اس سے) عبرت حاصل کروo",
                            "verse 59:4": "وہی تو ہے جس نے کفار اہل کتاب کو حشر اول کے وقت ان کے گھروں سے نکال دیا۔ تمہارے خیال میں بھی نہ تھا کہ وہ نکل جائیں گے اور وہ لوگ یہ سمجھے ہوئے تھے کہ ان کے قلعے ان کو خدا (کے عذاب) سے بچا لیں گے۔ مگر خدا نے ان کو وہاں سے آ لیا جہاں سے ان کو گمان بھی نہ تھا۔ اور ان کے دلوں میں دہشت ڈال دی کہ اپنے گھروں کو خود اپنے ہاتھوں اور مومنوں کے ہاتھوں سے اُجاڑنے لگے تو اے (بصیرت کی) آنکھیں رکھنے والو عبرت پکڑو",
                            "verse 59:5": "اور اگر خدا نے ان کے بارے میں جلاوطن کرنا نہ لکھ رکھا ہوتا تو ان کو دنیا میں بھی عذاب دے دیتا۔ اور آخرت میں تو ان کے لئے آگ کا عذاب (تیار) ہے",
                            "verse 59:6": "اور اگر اللہ نے اُن کے حق ميں جلا وطني لکھ نہ دي ہوتي تو وہ انہيں دنيا ميں (اور سخت) عذاب ديتا، اور ان کے لئے آخرت ميں (بھي) دوزخ کا عذاب ہےo",
                            "verse 59:7": "يہ اس وجہ سے ہوا کہ انہوں نے اللہ اور اس کے رسول (صلي اللہ عليہ وآلہ وسلم) سے شديد عداوت کي (ان کا سرغنہ کعب بن اشرف بدنام زمانہ گستاخ رسول تھا)، اور جو شخص اللہ (اور رسول صلي اللہ عليہ وآلہ وسلم کي) مخالفت کرتا ہے تو بيشک اللہ سخت عذاب دينے والا ہےo",
                            "verse 59:8": "یہ اس لئے کہ انہوں نے خدا اور اس کے رسول کی مخالفت کی۔ اور جو شخص خدا کی مخالفت کرے تو خدا سخت عذاب دینے والا ہے",
                            "verse 59:9": "(مومنو) کھجور کے جو درخت تم نے کاٹ ڈالے یا ان کو اپنی جڑوں پر کھڑا رہنے دیا سو خدا کے حکم سے تھا اور مقصود یہ تھا کہ وہ نافرمانوں کو رسوا کرے",
                            "verse 59:10": "(اے مومنو! يہود بنو نَضير کے محاصرہ کے دوران) جو کھجور کے درخت تم نے کاٹ ڈالے يا تم نے انہيں اُن کي جڑوں پر کھڑا چھوڑ ديا تو (يہ سب) اللہ ہي کے حکم سے تھا اور اس لئے کہ وہ نافرمانوں کو ذليل و رسوا کرےo",
                            "verse 59:11": "اور جو (اَموالِ فَے) اللہ نے اُن سے (نکال کر) اپنے رسول (صلي اللہ عليہ وآلہ وسلم) پر لَوٹا ديئے تو تم نے نہ تو اُن (کے حصول) پر گھوڑے دوڑائے تھے اور نہ اونٹ، ہاں! اللہ اپنے رسولوں کو جِس پر چاہتا ہے غلبہ و تسلّط عطا فرما ديتا ہے، اور اللہ ہر چيز پر بڑي قدرت رکھنے والا ہےo",
                            "verse 59:12": "اور جو (مال) خدا نے اپنے پیغمبر کو ان لوگوں سے (بغیر لڑائی بھڑائی کے) دلوایا ہے اس میں تمہارا کچھ حق نہیں کیونکہ اس کے لئے نہ تم نے گھوڑے دوڑائے نہ اونٹ لیکن خدا اپنے پیغمبروں کو جن پر چاہتا ہے مسلط کردیتا ہے۔ اور خدا ہر چیز پر قادر ہے",
                            "verse 59:13": "جو مال خدا نے اپنے پیغمبر کو دیہات والوں سے دلوایا ہے وہ خدا کے اور پیغمبر کے اور (پیغمبر کے) قرابت والوں کے اور یتیموں کے اور حاجتمندوں کے اور مسافروں کے لئے ہے۔ تاکہ جو لوگ تم میں دولت مند ہیں ان ہی کے ہاتھوں میں نہ پھرتا رہے۔ سو جو چیز تم کو پیغمبر دیں وہ لے لو۔ اور جس سے منع کریں (اس سے) باز رہو۔ اور خدا سے ڈرتے رہو۔ بیشک خدا سخت عذاب دینے والا ہے",
                            "verse 59:14": "جو (اَموالِ فَے) اللہ نے (قُرَيظہ، نَضِير، فِدَک، خَيبر، عُرَينہ سميت ديگر بغير جنگ کے مفتوحہ) بستيوں والوں سے (نکال کر) اپنے رسول (صلي اللہ عليہ وآلہ وسلم) پر لوٹائے ہيں وہ اللہ اور اس کے رسول (صلي اللہ عليہ وآلہ وسلم) کے لئے ہيں اور (رسول صلي اللہ عليہ وآلہ وسلم کے) قرابت داروں (يعني بنو ہاشم اور بنو المطّلب) کے لئے اور (معاشرے کے عام) يتيموں اور محتاجوں اور مسافروں کے لئے ہيں، (يہ نظامِ تقسيم اس لئے ہے) تاکہ (سارا مال صرف) تمہارے مال داروں کے درميان ہي نہ گردش کرتا رہے (بلکہ معاشرے کے تمام طبقات ميں گردش کرے)? اور جو کچھ رسول (صلي اللہ عليہ وآلہ وسلم) تمہيں عطا فرمائيں سو اُسے لے ليا کرو اور جس سے تمہيں منع فرمائيں سو (اُس سے) رُک جايا کرو، اور اللہ سے ڈرتے رہو (يعني رسول صلي اللہ عليہ وآلہ وسلم کي تقسيم و عطا پر کبھي زبانِ طعن نہ کھولو)، بيشک اللہ سخت عذاب دينے والا ہےo",
                            "verse 59:15": "(مذکورہ بالا مالِ فَے) نادار مہاجرين کے لئے (بھي) ہے جو اپنے گھروں اور اپنے اموال (اور جائيدادوں) سے باہر نکال ديئے گئے ہيں، وہ اللہ کا فضل اور اس کي رضاء و خوشنودي چاہتے ہيں اور (اپنے مال و وطن کي قرباني سے) اللہ اور اس کے رسول (صلي اللہ عليہ وآلہ وسلم) کي مدد کرتے ہيں، يہي لوگ ہي سچے مؤمن ہيںo",
                            "verse 59:16": "(اور) ان مفلسان تارک الوطن کے لئے بھی جو اپنے گھروں اور مالوں سے خارج (اور جدا) کر دیئے گئے ہیں (اور) خدا کے فضل اور اس کی خوشنودی کے طلبگار اور خدا اور اس کے پیغمبر کے مددگار ہیں۔ یہی لوگ سچے (ایماندار) ہیں",
                            "verse 59:17": "اور (ان لوگوں کے لئے بھی) جو مہاجرین سے پہلے (ہجرت کے) گھر (یعنی مدینے) میں مقیم اور ایمان میں (مستقل) رہے (اور) جو لوگ ہجرت کرکے ان کے پاس آتے ہیں ان سے محبت کرتے ہیں اور جو کچھ ان کو ملا اس سے اپنے دل میں کچھ خواہش (اور خلش) نہیں پاتے اور ان کو اپنی جانوں سے مقدم رکھتے ہیں خواہ ان کو خود احتیاج ہی ہو۔ اور جو شخص حرص نفس سے بچا لیا گیا تو ایسے لوگ مراد پانے والے ہیں",
                            "verse 59:18": "(يہ مال اُن انصار کے لئے بھي ہے) جنہوں نے اُن (مہاجرين) سے پہلے ہي شہرِ (مدينہ) اور ايمان کو گھر بنا ليا تھا? يہ لوگ اُن سے محبت کرتے ہيں جو اِن کي طرف ہجرت کر کے آئے ہيں? اور يہ اپنے سينوں ميں اُس (مال) کي نسبت کوئي طلب (يا تنگي) نہيں پاتے جو اُن (مہاجرين) کو ديا جاتا ہے اور اپني جانوں پر انہيں ترجيح ديتے ہيں اگرچہ خود اِنہيں شديد حاجت ہي ہو، اور جو شخص اپنے نفس کے بُخل سے بچا ليا گيا پس وہي لوگ ہي بامراد و کامياب ہيںo",
                            "verse 59:19": "اور وہ لوگ (بھي) جو اُن (مہاجرين و انصار) کے بعد آئے (اور) عرض کرتے ہيں: اے ہمارے رب! ہميں بخش دے اور ہمارے ان بھائيوں کو بھي، جو ايمان لانے ميں ہم سے آگے بڑھ گئے اور ہمارے دلوں ميں ايمان والوں کے لئے کوئي کينہ اور بغض باقي نہ رکھ? اے ہمارے رب! بيشک تو بہت شفقت فرمانے والا بہت رحم فرمانے والا ہےo",
                            "verse 59:20": "اور (ان کے لئے بھی) جو ان (مہاجرین) کے بعد آئے (اور) دعا کرتے ہیں کہ اے پروردگار ہمارے اور ہمارے بھائیوں کے جو ہم سے پہلے ایمان لائے ہیں گناہ معاف فرما اور مومنوں کی طرف سے ہمارے دل میں کینہ (وحسد) نہ پیدا ہونے دے۔ اے ہمارے پروردگار تو بڑا شفقت کرنے والا مہربان ہے",
                            "verse 59:21": "کیا تم نے ان منافقوں کو نہیں دیکھا جو اپنے کافر بھائیوں سے جو اہل کتاب ہیں کہا کرتے ہیں کہ اگر تم جلا وطن کئے گئے تو ہم بھی تمہارے ساتھ نکل چلیں گے اور تمہارے بارے میں کبھی کسی کا کہا نہ مانیں گے۔ اور اگر تم سے جنگ ہوئی تو تمہاری مدد کریں گے۔ مگر خدا ظاہر کئے دیتا ہے کہ یہ جھوٹے ہیں",
                            "verse 59:22": "کيا آپ نے منافقوں کو نہيں ديکھا جو اپنے اُن بھائيوں سے کہتے ہيں جو اہلِ کتاب ميں سے کافر ہوگئے ہيں کہ اگر تم (يہاں سے) نکالے گئے توہم بھي ضرور تمہارے ساتھ ہي نکل چليں گے اور ہم تمہارے معاملے ميں کبھي بھي کسي ايک کي بھي اطاعت نہيں کريں گے اور اگر تم سے جنگ کي گئي تو ہم ضرور بالضرور تمہاري مدد کريں گے، اور اللہ گواہي ديتا ہے کہ وہ يقيناً جھوٹے ہيںo",
                            "verse 59:23": "اگر وہ (شر پسند يہود مدينے سے) نکال ديے گئے تو يہ (منافقين) اُن کے ساتھ (کبھي) نہيں نکليں گے، اور اگر اُن سے جنگ کي گئي تو يہ اُن کي مدد نہيں کريں گے، اور اگر انہوں نے اُن کي مدد کي (بھي) تو ضرور پيٹھ پھير کر بھاگ جائيں گے، پھر اُن کي مدد (کہيں سے) نہ ہوسکے گيo",
                            "verse 59:24": "اگر وہ نکالے گئے تو یہ ان کے ساتھ نہیں نکلیں گے۔ اور اگر ان سے جنگ ہوئی تو ان کی مدد نہیں کریں گے۔ اگر مدد کریں گے تو پیٹھ پھیر کر بھاگ جائیں گے۔ پھر ان کو (کہیں سے بھی) مدد نہ ملے گی",
                            "verse 59:25": "(مسلمانو!) تمہاری ہیبت ان لوگوں کے دلوں میں خدا سے بھی بڑھ کر ہے۔ یہ اس لئے کہ یہ سمجھ نہیں رکھتے",
                            "verse 59:26": "(اے مسلمانو!) بيشک اُن کے دلوں ميں اللہ سے (بھي) زيادہ تمہارا رعب اور خوف ہے، يہ اس وجہ سے کہ وہ ايسے لوگ ہيں جو سمجھ ہي نہيں رکھتےo",
                            "verse 59:27": "وہ (مدينے کے عہد شکن يہود اور منافقين) سب مل کر (بھي) تم سے جنگ نہ کرسکيں گے سوائے قلعہ بند شہروں ميں يا ديواروں کي آڑ ميں، اُن کي لڑائي اُن کے آپس ميں (ہي) سخت ہے، تم انہيں اکٹھا سمجھتے ہو حالانکہ اُن کے دل باہم متفرّق ہيں، يہ اس لئے کہ وہ لوگ عقل سے کام نہيں ليتےo",
                            "verse 59:28": "یہ سب جمع ہو کر بھی تم سے (بالمواجہہ) نہیں لڑ سکیں گے مگر بستیوں کے قلعوں میں (پناہ لے کر) یا دیواروں کی اوٹ میں (مستور ہو کر) ان کا آپس میں بڑا رعب ہے۔ تم شاید خیال کرتے ہو کہ یہ اکھٹے (اور ایک جان) ہیں مگر ان کے دل پھٹے ہوئے ہیں یہ اس لئے کہ یہ بیعقل لوگ ہیں",
                            "verse 59:29": "ان کا حال ان لوگوں کا سا ہے جو ان سے کچھ ہی پیشتر اپنے کاموں کی سزا کا مزہ چکھ چکے ہیں۔ اور (ابھی) ان کے لئے دکھ دینے والا عذاب (تیار) ہے",
                            "verse 59:30": "(اُن کا حال) اُن لوگوں جيسا ہے جو اُن سے پہلے زمان? قريب ميں ہي اپني شامتِ اعمال کا مزہ چکھ چکے ہيں (يعني بدر ميں مشرکينِ مکہ، اور يہود ميں سے بنو نضير، بنو قينقاع و بنو قريظہ وغيرہ)، اور ان کے لئے (آخرت ميں بھي) دردناک عذاب ہےo",
                            "verse 59:31": "(منافقوں کي مثال) شيطان جيسي ہے جب وہ انسان سے کہتا ہے کہ تُو کافر ہو جا، پھر جب وہ کافر ہوجاتا ہے تو (شيطان) کہتا ہے: ميں تجھ سے بيزار ہوں، بيشک ميں اللہ سے ڈرتا ہوں جو تمام جہانوں کا رب ہےo",
                            "verse 59:32": "منافقوں کی) مثال شیطان کی سی ہے کہ انسان سے کہتا رہا کہ کافر ہوجا۔ جب وہ کافر ہوگیا تو کہنے لگا کہ مجھے تجھ سے کچھ سروکار نہیں۔ مجھ کو خدائے رب العالمین سے ڈر لگتا ہے",
                            "verse 59:33": "تو دونوں کا انجام یہ ہوا کہ دونوں دوزخ میں (داخل ہوئے) ہمیشہ اس میں رہیں گے۔ اور بیانصافوں کی یہی سزا ہے",
                            "verse 59:34": "پھر ان دونوں کا انجام يہ ہوگا کہ وہ دونوں دوزخ ميں ہوں گے ہميشہ اسي ميں رہيں گے، اور ظالموں کي يہي سزا ہےo",
                            "verse 59:35": "اے ايمان والو! تم اللہ سے ڈرتے رہو اور ہر شخص کو ديکھتے رہنا چاہئيے کہ اس نے کل (قيامت) کے لئے آگے کيا بھيجا ہے، اور تم اللہ سے ڈرتے رہو، بيشک اللہ اُن کاموں سے باخبر ہے جو تم کرتے ہوo",
                            "verse 59:36": "اے ایمان والوں! خدا سے ڈرتے رہو اور ہر شخص کو دیکھنا چاہیئے کہ اس نے کل (یعنی فردائے قیامت) کے لئے کیا (سامان) بھیجا ہے اور (ہم پھر کہتے ہیں کہ) خدا سے ڈرتے رہو بیشک خدا تمہارے سب اعمال سے خبردار ہے",
                            "verse 59:37": "اور ان لوگوں جیسے نہ ہونا جنہوں نے خدا کو بھلا دیا تو خدا نے انہیں ایسا کردیا کہ خود اپنے تئیں بھول گئے۔ یہ بدکردار لوگ ہیں",
                            "verse 59:38": "اور اُن لوگوں کي طرح نہ ہو جاؤ جو اللہ کو بھلا بيٹھے پھر اللہ نے اُن کي جانوں کو ہي اُن سے بھلا ديا (کہ وہ اپني جانوں کے لئے ہي کچھ بھلائي آگے بھيج ديتے)، وہي لوگ نافرمان ہيںo",
                            "verse 59:39": "اہلِ دوزخ اور اہلِ جنت برابر نہيں ہوسکتے، اہلِ جنت ہي کامياب و کامران ہيںo",
                            "verse 59:40": "اہل دوزخ اور اہل بہشت برابر نہیں۔ اہل بہشت تو کامیابی حاصل کرنے والے ہیں",
                            "verse 59:41": "اگر ہم یہ قرآن کسی پہاڑ پر نازل کرتے تو تم اس کو دیکھتے کہ خدا کے خوف سے دبا اور پھٹا جاتا ہے۔ اور یہ باتیں ہم لوگوں کے لئے بیان کرتے ہیں تاکہ وہ فکر کریں",
                            "verse 59:42": "اگر ہم يہ قرآن کسي پہاڑ پر نازل فرماتے تو (اے مخاطب!) تو اسے ديکھتا کہ وہ ا? کے خوف سے جھک جاتا، پھٹ کر پاش پاش ہوجاتا، اور يہ مثاليں ہم لوگوں کے لئے بيان کر رہے ہيں تاکہ وہ غور و فکر کريںo",
                            "verse 59:43": "وہي اللہ ہے جس کے سوا کوئي معبود نہيں، پوشيدہ اور ظاہر کو جاننے والا ہے، وہي بے حد رحمت فرمانے والا نہايت مہربان ہےo",
                            "verse 59:44": "وہی خدا ہے جس کے سوا کوئی معبود نہیں۔ پوشیدہ اور ظاہر کا جاننے والا ہے وہ بڑا مہربان نہایت رحم والا ہے",
                            "verse 59:45": "وہی خدا ہے جس کے سوا کوئی عبادت کے لائق نہیں۔ بادشاہ (حقیقی) پاک ذات (ہر عیب سے) سلامتی امن دینے والا نگہبان غالب زبردست بڑائی والا۔ خدا ان لوگوں کے شریک مقرر کرنے سے پاک ہے",
                            "verse 59:46": "وہي اللہ ہے جس کے سوا کوئي معبود نہيں، (حقيقي) بادشاہ ہے، ہر عيب سے پاک ہے، ہر نقص سے سالم (اور سلامتي دينے والا) ہے، امن و امان دينے والا (اور معجزات کے ذريعے رسولوں کي تصديق فرمانے والا) ہے، محافظ و نگہبان ہے، غلبہ و عزّت والا ہے، زبردست عظمت والا ہے، سلطنت و کبريائي والا ہے، اللہ ہر اُس چيز سے پاک ہے جسے وہ اُس کا شريک ٹھہراتے ہيںo",
                            "verse 59:47": "وہي اللہ ہے جو پيدا فرمانے والا ہے، عدم سے وجود ميں لانے والا (يعني ايجاد فرمانے والا) ہے، صورت عطا فرمانے والا ہے? (الغرض) سب اچھے نام اسي کے ہيں، اس کے لئے وہ (سب) چيزيں تسبيح کرتي ہيں جو آسمانوں اور زمين ميں ہيں، اور وہ بڑي عزت والا ہے بڑي حکمت والا ہےo",
                            "verse 59:48": "وہی خدا (تمام مخلوقات کا) خالق۔ ایجاد واختراع کرنے والا صورتیں بنانے والا اس کے سب اچھے سے اچھے نام ہیں۔ جتنی چیزیں آسمانوں اور زمین میں ہیں سب اس کی تسبیح کرتی ہیں اور وہ غالب حکمت والا ہے ہےo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 59:1": "Осмонлардагию ердаги барча нарсалар Аллоҳни поклаб ёд этди.",
                            "verse 59:2": "У зот аҳли китобдан бўлган кофирларни ўз диёрларидан биринчи ҳашр учун чиқарди.",
                            "verse 59:3": "Мабодо Аллоҳ уларга кўчишни ёзмаганда ҳам бу дунёда уларни азоблар эди.",
                            "verse 59:4": "Ундай бўлиши, улар Аллоҳга ва Унинг Расулига хилоф қилганлари учундир.",
                            "verse 59:5": "Сизнинг хурмони кесишингиз ёки аслида тик қолдирганингиз фақат, Аллоҳнинг изни билан ва бузғунчиларни хорлаши учун бўлди.",
                            "verse 59:6": "Аллоҳ Ўз Расулига улардан қайтариб берган нарсага сизлар от ёки туя чоптириб бормадингиз.",
                            "verse 59:7": "Аллоҳ Ўз Расулига шаҳар аҳлидан қайтариб берган нарса.",
                            "verse 59:8": "Фақир муҳожирларгаки, улар ўз диёрларидан ва мол-мулкларидан жудо қилинган эдилар, (улар) Аллоҳдан фазл ва Унинг розилигини умид қилулар.",
                            "verse 59:9": "У(муҳожир)лардан аввал бу жойда яшаган ва иймонга (ихлос қилганлар).",
                            "verse 59:10": "Улардан кейин келганлар: «Эй Роббимиз, бизни ва биздан аввал иймон билан ўтган биродарларимизни мағфират қилгин, қалбимизда иймон келтирганларга нафрат солмагин, эй Роббимиз, албатта, сен шафқатли ва меҳрибонсан», дерлар.",
                            "verse 59:11": "Нифоқ қилганларнинг аҳли китобдан бўлмиш куфр келтирган ўз биродарларига: «Агар сизлар чиқарилсангиз, биз ҳам сизлар билан чиқамиз, сизни қуйиб ҳеч қачон ҳеч кимга итоат қилмасмиз ва мабодо сизларга уруш қилинса, албатта ёрдам берурмиз», дейишларини кўрмайсанми? (Мунофиқ лар аҳли китоб бўлмиш яҳудий қабиласи Бани Назийрга келиб: «Муҳаммаддан қўрқманглар, биз сизлар билан биргамиз.",
                            "verse 59:12": "Албатта агар у(яҳудий)лар чиқарилсалар, улар бирга чиқмаслар.",
                            "verse 59:13": "Албатта, уларнинг қалбларига Аллоҳдан кўра сизлар кўпроқ қўрқинчли туюласизлар.",
                            "verse 59:14": "Сизларга қарши уюшиб очиқ уруш қила олмаслар, балки қўрғон билан ўралган қишлоқларда ёки деворлар ортига бекиниб олиб уруш қилурлар.",
                            "verse 59:15": "Бу худди яқинда ўз қилмишларининг оқибатини татиб кўрганларга ўхшашдир.",
                            "verse 59:16": "Бу худди Шайтон инсонга, кофир бўл, деган пайтга ўхшайдир.",
                            "verse 59:17": "Бас, уларнинг оқибатлари бир.",
                            "verse 59:18": "Эй иймон келтирганлар! Аллоҳга тақво қилинглар! Ҳар ким эрталик учун нима тақдим қилганига назар солсин.",
                            "verse 59:19": "Аллоҳни унутганларга ўхшаган бўлманглар.",
                            "verse 59:20": "Дўзах эгалари ва жаннат эгалари тенг бўлмаслар.",
                            "verse 59:21": "Агар ушбу Қуъонни тоғга туширганимизда эди, унинг Аллоҳдан қўрққанидан титраб-қақшаб ва парчаланиб кетганини кўрар эдинг.",
                            "verse 59:22": "У Аллоҳ Ундан ўзга илоҳ йўқ зотдир.",
                            "verse 59:23": "У Аллоҳ, Ундан ўзга илоҳ йўқ.",
                            "verse 59:24": "У Аллоҳ Холиқ, Бариъу, Мусаввирдур."
                        }
                    }
                }
            }
        }
    }
}