{
    "id": 61,
    "name_simple": "As-Saf",
    "revelation_place": "madinah",
    "revelation_order": 109,
    "bismillah_pre": true,
    "verses_count": 14,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah derives its name from the sentence yuqatiluna fi sabil-i- hlsaff-an of verse 4; thereby implying that it is a Surah in which the word saff occurred.",
    "text": [
        "\n",
        "The Surah derives its name from the sentence yuqatiluna fi sabil-i- hlsaff-an of verse 4; thereby implying that it is a Surah in which the word saff occurred.",
        "\n",
        "Period of Revelation",
        "\n",
        "It could not be known from any reliable tradition, but a study of its subject-matter shows that this Surah probably was sent down in the period closely following the Battle of Uhud, for by reading between the lines perceives a clear description of the conditions that prevailed in that period.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "Its theme is to exhort the Muslims to adopt sincerity in Faith and to struggle with their lives in the cause of Allah. It is addressed to the Muslims with weak faith as well as those who had entered Islam with a false profession of the Faith and also those who were sincere in their profession. Some verses are addressed to the first two groups, some only to the hypocrites, and some only to the sincere Muslims. The style itself shows where one particular group has been addressed and where the other.",
        "\n",
        "At the outset the believers have been warned to the effect; \"Allah indeed hates those people who say one thing and do another, and He indeed loves. those who fight in the cause of the Truth, standing like a solid structure, against the enemies of Allah.\"'",
        "\n",
        "In vv. 5-7 the people of the Holy Prophet's community have been warned that their attitude towards their Messenger and their Religion should not be like the attitude that the Israelites had adopted towards the Prophets Moses and Jesus (peace be upon them). In spite of acknowledging the Prophet Moses as a Messenger of God they continued to malign him as long as he lived, and in spite of witnessing clear signs from the Prophet Jesus they denied him without any hesitation. Consequently, the Israelites became perverse, incapable of benefiting from divine guidance. This is certainly not an enviable state which another nation should imitate.",
        "\n",
        "Then, in vv. 8-9 a proclamation has been made with the challenge:\"The Jews and the Christians, and the hypocrites, who are conspiring with them, may try however hard they may to extinguish this Light of Allah, it will shine forth and spread in the world in all its fullness, and the Religion brought by the true Messenger of Allah shall prevail over every other religion however hateful it may be to the pagans and polytheists.",
        "\n",
        "In vv. 10-13, the believers have been told that the way to success both here and in the Hereafter is only one: that they should believe in Allah and His Messenger sincerely and should exert their utmost in Allah's Way with their selves and their wealth. As a reward for this they will earn immunity from Allah's punishment, forgiveness of their sins and the eternal Paradise in the Hereafter, and will be blessed with Allah's good pleasure, succor and victory in the world.",
        "\n",
        "In conclusion, the believers have been exhorted to' the effect that just as the disciples of the Prophet Jesus had helped him in the cause of Allah, so should they also become \"helpers of Allah\", so that they too are blessed with the same kind of good pleasure and approval of Allah as had been the believers before them against the disbelievers.",
        "\n"
    ],
    "description": "The surah that declares God’s love of all those believers who maintain the solid Ranks or lines of unreachable communal unity in selflessly and fearlessly defending God’s cause against aggression. It takes its name from verse 4, in whicn the word “ranks” (ṣa) occurs. The surah encouraging the believers to stick together in support of God’s cause and criticizes those who broke their word (verse 3) and those who argued against the faith (verse 7 .). Moses and Jesus are cited as examples of prophets whose communities were divided: the rebellious were left to stray and the faithful granted success (verse 5 . and verse 14). The rewards of those who strive in God’s cause are described in some detail (verse 11 .).The surah is also known as: Formations, Solid Lines, The Battle Array, The Solid Ranks.",
    "name_complex": "As-Saff",
    "surah_name_ar": "الصف",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 61:1": "Perëndinë e falenderon çka gjendet në qiej dhe çka gjendet në Tokë.",
                            "verse 61:2": "O besimtarë, përse flisni atë që nuk e punoni?",
                            "verse 61:3": "Eshtë neveri e madhe te Perëndia të thoni atë që nuk e punoni!",
                            "verse 61:4": "Me të vërtetë, Perëndia i don ata që luftojnë në rrugën e Tij, të radhitur si një godinë e lidhur fortë.",
                            "verse 61:5": "Kur Musai i tha popullit të vet: “O populli im, përse po më mundoni, kur mirë e dini se unë jam profeti i Perëndisë te ju!” E, pasi ata u shmangën – Perëndia u shmangu zemrat e tyre; - e Perëndia, nuk e shpie në rrugë të drejtë atë popull që është zhytur në mëkate.",
                            "verse 61:6": "E kur Isai, i biri i Merjemës, ka thënë: “O bijtë e Israelit, unë u jam profet i Perëndisë te ju, për t’ju vërtetuar Teuratin e shpallur para meje dhe për t’ju sjellë lajmin e gëzueshëm për profetin, emrin e të cilit është Ahmed, që do të vijë pas meje; dhe kur ai u solli atyre argumente të qarta, ata thanë: “Kjo është magji e qartë!”",
                            "verse 61:7": "E, kush është më zullumqarë se ai që shpif gënjeshtra kundër Zotit, duke u thirrur në fé të vërtetë? – E Perëndia nuk e shpie në rrugë të drejtë popullin zullumqarë (që bën padrejtësi).",
                            "verse 61:8": "Ata dëshirojnë të fikin dritën e Perëndisë, me gojën e tyre, e Perëndia – e përsos dritën e Vet, edhe, nëse e urrejnë mohuesit.",
                            "verse 61:9": "Perëndia është Ai, që ka dërguar Profetin e Vet me udhëzim për rrugën e drejtë dhe fenë e vërtetë, për ta ngritur më lartë se të gjitha fetë, edhe nëse e urrejnë paganët.",
                            "verse 61:10": "O besimtarë, a doni t’ju orientojë në një tregti, e cila ju shpëton nga vuajtja e dhembshme:",
                            "verse 61:11": "Besoni në Perëndinë dhe në Profetin e Tij, dhe luftoni në rrugën e Perëndisë me pasurinë dhe trupin tuaj.",
                            "verse 61:12": "Ai do t’ju falë gabimet tuaja dhe do t’ju shpie në kopshte, nëpër të cilat rrjedhin lumenjt, dhe në pallate – të mrekullueshme – në xhennetin e Adnit, - e ky është sukses i madh, -",
                            "verse 61:13": "E tjetrën (dhunti) që e doni ju: Ndihma e Perëndisë dhe fitorja e afërt! Andaj, sihariqoji besimtarët!",
                            "verse 61:14": "O besimtarë, bëhuni ndihmësit e besimit të Perëndisë, ashtu siç u ka thënë Isai, i biri i Merjemës, nxënësve (apostujve të tij): “Kush janë ndihmësit e mi te Perëndia? Apostujt, u përgjegjën: “Ne jemi ndihmësit e Perëndisë!” – Dhe, kanë besuar një grup nga bijtë e Israelit, e një grup tjetër kanë mohuar; - andaj Ne i kemi forcuar (ndihmuar) besimtarët kundër armikut të tyre dhe ata u bënë fitues."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Göylərdə və yerdə nə varsa, (hamısı, bütün məxluqat) Allahı təqdis edib şə'ninə tə'riflər deyər.",
                            "verse 61:2": "Ey iman gətirənlər! Etməyəcəyiniz bir şeyi niyə deyirsiniz? (Bə'zi müsəlmanlar: \"Hansı əməllərin Allaha daha xoş getdiyini bilsəydik, onları edər, malımızı və canımızı onların yolunda qoyardıq!\" - deyirdilər.",
                            "verse 61:3": "Etməyəcəyiniz bir şeyi demək Allah yanında böyük qəzəbə səbəb olar.",
                            "verse 61:4": "Şübhəsiz ki, Allah ?z yolunda möhkəm divar kimi səf çəkib döyüşənləri sevər!",
                            "verse 61:5": "(Ya Rəsulum!) Xatırla ki, bir zaman Musa öz qövmünə demişdi: \"Ey qövmüm! Mənim Allahın sizə göndərilmiş peyğəmbəri olduğumu bildiyiniz halda, niyə məni incidirsiniz?\" Onlar (haqdan) üz döndərdi.",
                            "verse 61:6": "Onu da xatırla ki, bir vaxt Məryəm oğlu İsa belə demişdi: \"Ey İsrail oğulları! Həqiqətən, mən özümdən əvvəl nazil olmuş Tövratı təsdiq edən və məndən sonra gələcək Əhməd adlı bir peyğəmbərlə (sizə) müjdə verən Allahın elçisiyəm!\" Sonra (İsa, yaxud Muhəmməd əleyhissəlam) onlara açıq-aşkar mö'cüzələr gətirdikdə onlar: \"Bu, açıq-aydın sehrdir!\" - dedilər.",
                            "verse 61:7": "İslama də'vət olunduğu halda, Allaha qarşı yalan uydurandan (Onun peyğəmbərinə sehrbaz deyəndən) daha zalım kim ola bilər?! Allah zalım qövmü doğru yola yönəltməz!",
                            "verse 61:8": "Onlar Allahın nurunu (islam dinini) öz ağızları (öz iftiraları və şər sözləri) ilə söndürmək istəyirlər.",
                            "verse 61:9": "Müşriklərin xoşuna gəlməsə də, onu (islamı) bütün dinlərdən üstün etmək üçün ?z Peyğəmbərini hidayət (Qur'an) və haqq dinlə göndərən Odur!",
                            "verse 61:10": "Ey iman gətirənlər! Sizə elə bir ticarət (qazanc yolu) göstərimmi ki, o sizi şiddətli əzabdan xilas etsin?",
                            "verse 61:11": "(O qazanc yolu budur: ) Allaha və Onun Peyğəmbərinə iman gətirəsiniz.",
                            "verse 61:12": "(Əgər belə etsəniz) O sizin günahlarınızı bağışlayar və sizi (ağacları) altından çaylar axan cənnətlərə və Ədn cənnətlərindəki gözəl saraylara daxil edər.",
                            "verse 61:13": "(Sizi hələ) sevdiyiniz başqa bir şey (bir ne'mət) də - Allah dərgahından kömək və yaxın qələbə (Məkkənin fəthi) gözləyir.",
                            "verse 61:14": "Ey iman gətirənlər! Allahın (dininin və peyğəmbərinin) köməkçiləri olun! Necə ki, Məryəm oğlu İsa həvarilərə: \"Allah yolunda mənim köməkçilərim kimdir?\" - demiş, həvarilər də: \"Allahın köməkçiləri bizik!\" - deyə cavab vermişdilər."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Allaha hvali ono što je na nebesima i ono što je na Zemlji, On je Silni i Mudri!",
                            "verse 61:2": "O vjernici, zašto jedno govorite a drugo radite?",
                            "verse 61:3": "O, kako je Allahu mrsko kada govorite riječi koje djela ne prate!",
                            "verse 61:4": "Allah voli one koji se na Njegovu putu bore u redovima kao da su bedem čvrsti.",
                            "verse 61:5": "Kada Musa reče narodu svome: \"O narode moj, zašto me mučite, a dobro znate da sam ja Allahov poslanik vama!” - i kad oni skrenuše u stranu, Allah učini da i srca njihova u stranu skrenu - a Allah neće ukazati na Pravi put nar",
                            "verse 61:6": "A kada Isa, sin Merjemin, reče: \"O sinovi Israilovi, ja sam vam Allahov poslanik da vam potvrdim prije mene objavljeni Tevrat i da vam donesem radosnu vijest o poslaniku čije je ime Ahmed,",
                            "verse 61:7": "A ima li nepravednijeg od onoga koji o Allahu laži iznosi dok se u pravu vjeru poziva? - A Allah neće ukazati na Pravi put narodu koji nepravdu čini.",
                            "verse 61:8": "Oni žele utrnuti Allahovo svjetlo ustima svojim, a Allah će učiniti da svjetla Njegova uvijek bude, makar krivo bilo nevjernicima.",
                            "verse 61:9": "On po Poslaniku Svome šalje uputstvo i vjeru istinitu da bi je uzdigao iznad svih vjera, makar ne bilo pravo mnogobošcima.",
                            "verse 61:10": "O vjernici, hoćete li da vam ukažem na trgovinu, ona će vas spasiti patnje nesnosne:",
                            "verse 61:11": "u Allaha i Poslanika Njegova vjerujte i imecima svojim i životima svojim na Allahovu putu se borite - to vam je, da znate, bolje -",
                            "verse 61:12": "On će vam grijehe vaše oprostiti i u džennetske bašče vas, kroz koje će rijeke teći, uvesti, i u divne dvorove u edenskim vrtovima; to će biti uspjeh veliki,",
                            "verse 61:13": "a daće vam i drugu blagodat koju jedva čekate; Allahovu pomoć i skoru pobjedu! Zato obraduj radosnom viješću vjernike!",
                            "verse 61:14": "O vjernici, pomozite Allahovu vjeru, kao što su učenici rekli: \"Mi ćemo pomoći Allahovu vjeru!\" - kad ih je Isa, sin Merjemin, upitao: \"Hoćete li me pomoći Allaha radi?\" I neki od sinova Israilovih su povjerovali, a drugi nis vjernike!"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "নভোমন্ডলে ও ভূমন্ডলে যা কিছু আছে, সবই আল্লাহর পবিত্রতা ঘোষণা করে। তিনি পরাক্রান্ত প্রজ্ঞাবান।",
                            "verse 61:2": "মুমিনগণ! তোমরা যা কর না, তা কেন বল?",
                            "verse 61:3": "তোমরা যা কর না, তা বলা আল্লাহর কাছে খুবই অসন্তোষজনক।",
                            "verse 61:4": "আল্লাহ তাদেরকে ভালবাসেন, যারা তাঁর পথে সারিবদ্ধভাবে লড়াই করে, যেন তারা সীসাগালানো প্রাচীর।",
                            "verse 61:5": "স্মরণ কর, যখন মূসা (আঃ) তাঁর সম্প্রদায়কে বললঃ হে আমার সম্প্রদায়, তোমরা কেন আমাকে কষ্ট দাও, অথচ তোমরা জান যে, আমি তোমাদের কাছে আল্লাহর রসূল। অতঃপর তারা যখন বক্রতা অবলম্বন করল, তখন আল্লাহ তাদের অন্তরকে বক্র করে দিলেন। আল্লাহ পাপাচারী সম্প্রদায়কে পথপ্রদর্শন করেন না।",
                            "verse 61:6": "স্মরণ কর, যখন মরিয়ম-তনয় ঈসা (আঃ) বললঃ হে বনী ইসরাইল! আমি তোমাদের কাছে আল্লাহর প্রেরিত রসূল, আমার পূর্ববর্তী তওরাতের আমি সত্যায়নকারী এবং আমি এমন একজন রসূলের সুসংবাদদাতা, যিনি আমার পরে আগমন করবেন। তাঁর নাম আহমদ। অতঃপর যখন সে স্পষ্ট প্রমাণাদি নিয়ে আগমন করল, তখন তারা বললঃ এ তো এক প্রকাশ্য যাদু।",
                            "verse 61:7": "যে ব্যক্তি ইসলামের দিকে আহুত হয়েও আল্লাহ সম্পর্কে মিথ্যা বলে; তার চাইতে অধিক যালেম আর কে? আল্লাহ যালেম সম্প্রদায়কে পথ প্রদর্শন করেন না।",
                            "verse 61:8": "তারা মুখের ফুঁৎকারে আল্লাহর আলো নিভিয়ে দিতে চায়। আল্লাহ তাঁর আলোকে পূর্ণরূপে বিকশিত করবেন যদিও কাফেররা তা অপছন্দ করে।",
                            "verse 61:9": "তিনি তাঁর রসূলকে পথ নির্দেশ ও সত্যধর্ম নিয়ে প্রেরণ করেছেন, যাতে একে সবধর্মের উপর প্রবল করে দেন যদিও মুশরিকরা তা অপছন্দ করে।",
                            "verse 61:10": "মুমিনগণ, আমি কি তোমাদেরকে এমন এক বানিজ্যের সন্ধান দিব, যা তোমাদেরকে যন্ত্রণাদায়ক শাস্তি থেকে মুক্তি দেবে?",
                            "verse 61:11": "তা এই যে, তোমরা আল্লাহ ও তাঁর রসূলের প্রতি বিশ্বাস স্থাপন করবে এবং আল্লাহর পথে নিজেদের ধন-সম্পদ ও জীবনপণ করে জেহাদ করবে। এটাই তোমাদের জন্যে উত্তম; যদি তোমরা বোঝ।",
                            "verse 61:12": "তিনি তোমাদের পাপরাশি ক্ষমা করবেন এবং এমন জান্নাতে দাখিল করবেন, যার পাদদেশে নদী প্রবাহিত এবং বসবাসের জান্নাতে উত্তম বাসগৃহে। এটা মহাসাফল্য।",
                            "verse 61:13": "এবং আরও একটি অনুগ্রহ দিবেন, যা তোমরা পছন্দ কর। আল্লাহর পক্ষ থেকে সাহায্য এবং আসন্ন বিজয়। মুমিনদেরকে এর সুসংবাদ দান করুন।",
                            "verse 61:14": "মুমিনগণ, তোমরা আল্লাহর সাহায্যকারী হয়ে যাও, যেমন ঈসা ইবনে-মরিয়ম তার শিষ্যবর্গকে বলেছিল, আল্লাহর পথে কে আমার সাহায্যকারী হবে? শিষ্যবর্গ বলেছিলঃ আমরা আল্লাহর পথে সাহায্যকারী। অতঃপর বনী-ইসরাঈলের একদল বিশ্বাস স্থাপন করল এবং একদল কাফের হয়ে গেল। যারা বিশ্বাস স্থাপন করেছিল, আমি তাদেরকে তাদের শত্রুদের মোকাবেলায় শক্তি যোগালাম, ফলে তারা বিজয়ী হল। করুন।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 61:1": "Всичко на небесата и всичко на земята прославя Аллах.",
                            "verse 61:2": "О, вярващи, защо говорите онова, което не вършите?",
                            "verse 61:3": "Най-омразно пред Аллах е да говорите онова, което не вършите.",
                            "verse 61:4": "Аллах обича онези, които се сражават по Неговия път в редица, сякаш са здрава крепост.",
                            "verse 61:5": "И рече Муса на своя народ: О, народе мой, защо ме огорчавате, след като вече узнахте, че аз съм пратеник на Аллах при вас? И когато се отклониха, Аллах отклони сърцата им.",
                            "verse 61:6": "И рече Иса, синът на Мариам: О, синове на Исраил, аз съм пратеник на Аллах при вас, да потвърдя Тората преди мен и да благовестя за пратеник, който ще дойде след мен.",
                            "verse 61:7": "им донесе ясните знаци, рекоха: Това е явна маг",
                            "verse 61:8": "И кой е по-голям угнетител от онзи, който измисля лъжа за Аллах, когато го зоват към Исляма? Аллах не напътва хората-угнетители.",
                            "verse 61:9": "Те искат да угасят светлината на Аллах с уста.",
                            "verse 61:10": "Той е, Който изпрати Своя Пратеник с напътствието и с правата религия, за да я издигне над всички религии, дори съдружаващите да възненавиждат това.",
                            "verse 61:11": "О, вярващи, да ви посоча ли търговия, която ще ви спаси от болезнено мъчение?",
                            "verse 61:12": "Да вярвате в Аллах и в Неговия Пратеник, и да се борите по пътя на Аллах чрез своите имоти и души.",
                            "verse 61:13": "Тогава Той ще ви опрости греховете и ще ви въведе в Градините, сред които реки текат, и в хубави жилища в Градините на Адн.",
                            "verse 61:14": "И друго, което обичате - помощ от Аллах и близка победа.",
                            "verse 61:15": "О, вярващи, бъдете помощници [по пътя] на Аллах, както Иса, синът на Мариам, рече на учениците си: Кои са моите помощници [по пътя] на Аллах? Учениците рекоха: Ние сме помощниците [по пътя] на Аллах."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "凡在天地間的，都讚頌真主超絕萬物，他是萬能的，是至睿的。",
                            "verse 61:2": "信道的人們啊！你們為什麼說你們所不做的事呢？",
                            "verse 61:3": "你們說你們所不做的，這在真主看來，是很可恨的。",
                            "verse 61:4": "真主的確喜愛那等人；他們為他而列陣作戰，好像堅實的墻壁一樣。",
                            "verse 61:5": "當時，穆薩曾對他的宗族說：「我的宗族啊！你們既知道我是真主派來教化你們的使者，你們為什麼誹謗我呢？」當他們背離正道的時候，真主使他們的心背離真理；真主是不引導悖逆的民眾的。",
                            "verse 61:6": "當時，麥爾彥之子爾撒曾說：「以色列的後裔啊！我確是真主派來教化你們的使者，他派我來証實在我之前的《討拉特》，並且以在我之後誕生的使者，名叫艾哈默德的，向你們報喜。」當他已昭示他們許多明証的時候，他們說：「這是明顯的魔術。」",
                            "verse 61:7": "別人勸他入伊斯蘭，他卻假借真主的名義而造謠；這樣的人，誰比他還不義呢？真主是不引導不義的民眾的。",
                            "verse 61:8": "他們想吹滅真主的光明，但真主要完成他的光明，即使不信道的人不願意。",
                            "verse 61:9": "他曾以正道和真教的使命委托他的使者，以便他使真教勝過一切宗教，即使以物配主的人不願意。",
                            "verse 61:10": "信道的人們啊！我將指示你們一種生意，它能拯救你們脫離痛苦的刑罰，好嗎？",
                            "verse 61:11": "你們信仰真主和使者，你們以自己的財產和生命，為真主而奮鬥，那對於你們是更好的，如果你們知道。",
                            "verse 61:12": "他將赦宥你們的罪過，並且使你們入下臨諸河的樂園和常住的樂園中的許多優美的住宅，那確是偉大的成功。",
                            "verse 61:13": "他將賞賜你們另一種為你們所愛好的恩典——從真主降下的援助，和臨近的勝利。你向信士們報喜吧。",
                            "verse 61:14": "信道的人們啊！你們應當做協助真主的人，猶如麥爾彥之子爾撒對他的門徒所說的：「誰是與我共同協助真主的？」那些門徒說：「我們是協助真主的。」以色列的後裔中，有一派人已經信道，有一派人並不信道。我扶助信道的人們對抗他們的敵人，故他們變成優勝的。 他將賞賜你們另一種為你們所愛好的恩典——從真主降下的援助，和臨近的勝利。你向信士們報喜吧。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Chválí Boha vše, co na nebesích je i na zemi - a On mocný je i moudrý.",
                            "verse 61:2": "Vy, kteří věříte! Proč říkáte to, co nečiníte?",
                            "verse 61:3": "Bůh velice nenávidí, že říkáte něco, co neděláte,",
                            "verse 61:4": "avšak Bůh věru miluje ty, kdož bojují na cestě Jeho v sevřeném šiku, jako by byli stavbou olovem spojenou.",
                            "verse 61:5": "Vzpomeň si, jak pravil Mojžíš lidu svému: \"Lide můj, proč se mnou zle nakládáte, když víte, že jsem poslem Božím k vám?\" A když se odvrátili, Bůh odvrátil srdce jejich, neboť Bůh nevede cestou správnou lid hanebníků.",
                            "verse 61:6": "A vzpomeň si, jak pravil Ježíš, syn Mariin: \"Dítka Izraele, já jsem vskutku poslem Božím k vám, potvrzujícím pravdivost toho, co bylo přede mnou sesláno z Tóry, a oznamujícím vám radostnou zvěst o poslu, jenž přijde po mně a jehož jméno Ahmad bude.",
                            "verse 61:7": "Kdo je nespravedlivější než ten, kdo si proti Bohu lži vymýšlí, zatímco je vyzýván k přijetí islámu? Bůh věru nevede cestou správnou lid nespravedlivý.",
                            "verse 61:8": "Rádi by sfoukli světlo Boží ústy svými, avšak Bůh učiní světlo Své dokonalým, i když se to protiví nevěřícím.",
                            "verse 61:9": "A On je ten, jenž seslal posla Svého se správným vedením i s náboženstvím pravdivým, aby zvítězilo nad všemi náboženstvími, i když se to protiví modloslužebníkům.",
                            "verse 61:10": "Vy, kteří věříte! Mám vám ukázat obchod, jenž ochrání vás před trestem bolestným?",
                            "verse 61:11": "Uvěřte v Boha a posla Jeho a veďte boj na cestě Boží majetky svými i osobami svými! A to bude pro vás nejlepší, jestliže jste vědoucí!",
                            "verse 61:12": "A tehdy vám On odpustí hříchy vaše a uvede vás do zahrad, pod nimiž řeky tekou, a do příbytků příjemných v zahradách Edenu; a to bude úspěch nesmírný",
                            "verse 61:13": "a dá vám i jiné, jež budete milovat: vítěznou pomoc od Boha a blízké vítězství.",
                            "verse 61:14": "Vy, kteří věříte! Buďte pomocníky Božími, tak jak to řekl Ježíš, syn Mariin, apoštolům: \"Kdož budou pomocníky mými na cestě Boží?\" I odvětili apoštolové: \"My budeme pomocníky Božími."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Wat zich ook in de hemelen en op de aarde bevindt, verheerlijkt God; Hij is de Almachtige, de Alwijze.",
                            "verse 61:2": "O gij die gelooft, waarom zegt gij hetgeen gij niet doet?",
                            "verse 61:3": "Het is afkeurenswaardig bij God dat gij zegt hetgeen gij niet doet.",
                            "verse 61:4": "Voorzeker, God heeft diegenen lief die terwille van Hem strijden in geordende gelederen, alsof zij een hechte muur vormen.",
                            "verse 61:5": "En toen Mozes tegen zijn volk zeide: \"O mijn volk, waarom ergert gij mij, wetende dat ik God’s boodschapper voor u ben?\" En toen zij afdwaalden deed God hun hart zich afwenden, want God leidt het opstandige volk niet.",
                            "verse 61:6": "En toen Jezus, zoon van Maria, zeide: \"O kinderen van Israël, Ik ben God’s boodschapper voor u, datgene bevestigend wat vóór mij in de Torah was, en een blijde tijding gevende van een boodschapper die na mij komen zal, zijn naam zal Ahmad zijn.",
                            "verse 61:7": "Wie is onrechtvaardiger dan hij die leugen over God verzint, terwijl hij opgeroepen wordt tot de Islam? God leidt het onrechtvaardige volk niet.",
                            "verse 61:8": "Zij wensen God’s licht door hun mond te doven, maar God zal Zijn licht vervolmaken, hoewel de ongelovigen er afkerig van zijn.",
                            "verse 61:9": "Hij is het Die Zijn boodschapper heeft gezonden met leiding en de godsdienst der Waarheid, opdat hij deze moge doen zegevieren over alle andere godsdiensten, al zijn de afgodendienaren er afkerig van.",
                            "verse 61:10": "O gij die gelooft, zal ik u inlichten over een handel die u zal redden van een pijnlijke straf?",
                            "verse 61:11": "Dat gij in God en Zijn boodschapper gelooft en voor de zaak van God met uw bezit en uw persoon strijdt.",
                            "verse 61:12": "Hij zal u uw zonden vergeven en u in tuinen leiden waar doorheen rivieren stromen en tot reine woningen toelaten in tuinen der Eeuwigheid.",
                            "verse 61:13": "En nog meer waarnaar gij verlangt: hulp van God en een spoedige overwinning.",
                            "verse 61:14": "O, gij die gelooft, weest God’s helpers, zoals toen Jezus, zoon van Maria, tot zijn discipelen zeide: \"Wie zijn mijn helpers terwille van God?\" De discipelen antwoordden: \"Wij zijn God’s helpers!\" Toen geloofde een gedeelte van de kinderen Israëls, terwijl een ander deel niet geloofde maar Wij hielpen de gelovigen tegen hun vijand en zij werden overwinnaars."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 61:1": "All that is in the heavens and all that is in the earth glorifieth Allah, and He is the Mighty, the Wise.",
                            "verse 61:2": "O ye who believe! Why say ye that which ye do not ?",
                            "verse 61:3": "It is most hateful in the sight of Allah that ye say that which ye do not.",
                            "verse 61:4": "Lo! Allah loveth them who battle for His cause in ranks, as if they were a solid structure.",
                            "verse 61:5": "And (remember) when Moses said unto his people: O my people! Why persecute ye me, when ye well know that I am Allah’s messenger unto you ? So when they went astray Allah sent their hearts astray.",
                            "verse 61:6": "And when Jesus son of Mary said: O Children of Israel! Lo! I am the messenger of Allah unto you, confirming that which was (revealed) before me in the Torah, and bringing good tidings of a messenger who cometh after me, whose name is the Praised One.",
                            "verse 61:7": "And who doeth greater wrong than he who inventeth a lie against Allah when he is summoned unto Al-Islam ? And Allah guideth not wrongdoing folk.",
                            "verse 61:8": "Fain would they put out the light of Allah with their mouths, but Allah will perfect His light however much the disbelievers are averse.",
                            "verse 61:9": "He it is Who hath sent His messenger with the guidance and the religion of truth, that He may make it conqueror of all religion however much idolaters may be averse.",
                            "verse 61:10": "O ye who believe! Shall I show you a commerce that will save you from a painful doom ?",
                            "verse 61:11": "Ye should believe in Allah and His messenger, and should strive for the cause of Allah with your wealth and your lives.",
                            "verse 61:12": "He will forgive you your sins and bring you into Gardens underneath which rivers flow, and pleasant dwellings in Gardens of Eden.",
                            "verse 61:13": "And (He will give you) another (blessing) which ye love: help from Allah and present victory.",
                            "verse 61:14": "O ye who believe! Be Allah’s helpers, even as Jesus son of Mary said unto the disciples: Who are my helpers for Allah ? They said: We are Allah’s helpers."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 61:1": "Whatever is in the heavens and on earth, let it declare the Praises and Glory of God: for He is the Exalted in Might, the Wise.",
                            "verse 61:2": "O ye who believe! Why say ye that which ye do not?",
                            "verse 61:3": "Grievously odious is it in the sight of God that ye say that which ye do not.",
                            "verse 61:4": "Truly God loves those who fight in His Cause in battle array, as if they were a solid cemented structure.",
                            "verse 61:5": "And remember, Moses said to his people: \"O my people! why do ye vex and insult me, though ye know that I am the apostle of God (sent) to you?\" Then when they went wrong, God let their hearts go wrong.",
                            "verse 61:6": "And remember, Jesus, the son of Mary, said: \"O Children of Israel! I am the apostle of God (sent) to you, confirming the Law (which came) before me, and giving Glad Tidings of an Apostle to come after me, whose name shall be Ahmad.",
                            "verse 61:7": "Who doth greater wrong than one who invents falsehood against God, even as he is being invited to Islam? And God guides not those who do wrong.",
                            "verse 61:8": "Their intention is to extinguish God’s Light (by blowing) with their mouths: But God will complete (the revelation of) His Light, even though the Unbelievers may detest (it).",
                            "verse 61:9": "It is He Who has sent His Apostle with Guidance and the Religion of Truth, that he may proclaim it over all religion, even though the Pagans may detest (it).",
                            "verse 61:10": "O ye who believe! Shall I lead you to a bargain that will save you from a grievous Penalty?-",
                            "verse 61:11": "That ye believe in God and His Apostle, and that ye strive (your utmost) in the Cause of God, with your property and your persons: That will be best for you, if ye but knew!",
                            "verse 61:12": "He will forgive you your sins, and admit you to Gardens beneath which Rivers flow, and to beautiful mansions in Gardens of Eternity: that is indeed the Supreme Achievement.",
                            "verse 61:13": "And another (favour will He bestow,) which ye do love,- help from God and a speedy victory.",
                            "verse 61:14": "O ye who believe! Be ye helpers of God: As said Jesus the son of Mary to the Disciples, \"Who will be my helpers to (the work of) God?\" Said the disciples, \"We are God’s helpers!\" then a portion of the Children of Israel believed, and a portion disbelieved: But We gave power to those who believed, against their enemies, and they became the ones that prevailed."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 61:1": "All that is in the heavens and the earth magnifies God; He is the All-mighty; the All-wise.",
                            "verse 61:2": "O you who believe, wherefore do you say what you do not?",
                            "verse 61:3": "Very hateful is it to God, that you say what you do not.",
                            "verse 61:4": "God loves those who fight in His way in ranks, as though they were a building well-compacted.",
                            "verse 61:5": "And when Moses said to his people, ’O my people, why do you hurt me, though you know I am the Messenger of God to you?’ When they swerved, God caused their hearts to swerve; and God.",
                            "verse 61:6": "And when Jesus son of Mary said, ’Children of Israel, I am indeed the Messenger of God to you, confirming the Torah that is before me, and giving good tidings of a Messenger who shall come after me, whose name shall be Ahmad.",
                            "verse 61:7": "And who does greater evil than he who forges against God falsehood, when he is being called unto surrender? And God guides never the people of the evildoers.",
                            "verse 61:8": "They desire to extinguish with their mouths, the light of God; but God will perfect His light, though the unbelievers be averse.",
                            "verse 61:9": "It is He who has sent His Messenger with the guidance and the religion of truth, that he may uplift it above every religion, though the unbelievers be averse.",
                            "verse 61:10": "O believers, shall I direct you to a commerce that shall deliver you from a painful chastisement?",
                            "verse 61:11": "You shall believe in God and His Messenger, and struggle in the way of God with your possessions and your selves.",
                            "verse 61:12": "He will forgive you your sins and admit you into gardens underneath which rivers flow, and to dwelling-places goodly in Gardens of Eden; that is the mighty triumph;",
                            "verse 61:13": "and other things you love, help from God and a nigh victory.",
                            "verse 61:14": "O believers, be you God’s helpers, as Jesus, Mary’s son, said to the Apostles."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 61:1": "ALL THAT IS in the heavens and all that is on earth extols God’s limitless glory: for He alone is almighty, truly wise!",
                            "verse 61:2": "O YOU who have attained to faith! Why do you say one thing and do another?",
                            "verse 61:3": "Most loathsome is it in the sight of God that you say what you do not do!",
                            "verse 61:4": "Verily, God loves",
                            "verse 61:5": "those who fight in His cause in",
                            "verse 61:6": "ranks, as though they were a building firm and compact.",
                            "verse 61:7": "Now when Moses spoke to his people, [it was this same truth that he had in mind:] \"O my people! Why do you cause me grief, the while you know that I am an apostle of God sent unto you?\" And so, when they swerved from the right way, God let their hearts swerve from the truth: for God does not bestow His guidance upon iniquitous folk.",
                            "verse 61:8": "And [this happened, too,] when Jesus, the son of Mary, said: \"O children of Israel! Behold, I am an apostle of God unto you,",
                            "verse 61:9": "to confirm the truth of whatever there still remains of the Torah, and to give",
                            "verse 61:10": "the glad tiding of an apostle who shall come after me, whose name shall be Ahmad.",
                            "verse 61:11": "And who could be more wicked than one who invents",
                            "verse 61:12": "a lie about [a message from] God, seeing that he is",
                            "verse 61:13": "being called to self-surrender unto Him? But God does not bestow His guidance upon evildoing folk.",
                            "verse 61:14": "They aim to extinguish God’s light with their utterances: but God has willed to spread His light in all its fullness, however hateful this may be to all who deny the truth.",
                            "verse 61:15": "He it is who has sent forth His Apostle with [the task of] spreading guidance and the religion of truth, to the end that He make it prevail over all",
                            "verse 61:16": "religion, however hateful this may be to those who ascribe divinity to aught but God.",
                            "verse 61:17": "O YOU who have attained to faith! Shall I point out to you a bargain that will save you from grievous suffering [in this world and in the life to come]?",
                            "verse 61:18": "You are to believe in God and His Apostle, and to strive hard in God’s cause with your possessions and your lives: this is for your own good – if you but knew it!",
                            "verse 61:19": "[If you do so,] He will forgive you your sins, and [in the life to come] will admit you into gardens through which running waters flow, and into goodly mansions in",
                            "verse 61:20": "gardens of perpetual bliss: that [will be] the triumph supreme!",
                            "verse 61:21": "And [withal, He will grant you] yet another thing that you dearly love: succour from God [in this world], and a victory soon to come: and [thereof, O Prophet,] give thou a glad tiding to all who believe.",
                            "verse 61:22": "O YOU who have attained to faith! Be helpers [in the cause of God – even as Jesus, the son of Mary, said unto the white-garbed ones, \"Who will be my helpers in God’s cause?\" – whereupon the white-garbed",
                            "verse 61:23": "replied, \"We shall be",
                            "verse 61:24": "helpers [in the cause] of God!\" And so [it happened that] some of the children of Israel came to believe [in the apostleship of Jesus], whereas others denied the truth.",
                            "verse 61:25": "We have given strength against their foes unto those who have",
                            "verse 61:26": "attained to faith: and they have become the ones that shall prevail.",
                            "verse 61:27": "religion in the sight of God is",
                            "verse 61:28": "self-surrender unto Him."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 61:1": "Verily God loveth those who fight for His cause in ranks as if they were a close-built block.",
                            "verse 61:2": "He it is who has sent His Messenger with the guidance and the Religion of Truth, that He may make it prevail over all religion, though the idolaters be averse.",
                            "verse 61:3": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 61:4": "The Book of Certainty (1952) •",
                            "verse 61:5": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 61:6": "What is Sufism (1975) •",
                            "verse 61:7": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 61:8": "Muhammad (1983) •",
                            "verse 61:9": "Symbol and Archetype (1991) •",
                            "verse 61:10": "Sufi Poems (2004) •",
                            "verse 61:11": "Mecca (2004) •",
                            "verse 61:12": "Return to the Spirit (2005) •",
                            "verse 61:13": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 61:14": "“Proofs of Islam”(1954).",
                            "verse 61:15": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 61:16": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 61:17": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 61:18": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 61:19": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 61:20": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 61:21": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 61:22": "“The Quranic Origins of Sufism” •",
                            "verse 61:23": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 61:24": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 61:25": "“An Introduction to Islam” •",
                            "verse 61:26": "“The Universality of the Quran” •",
                            "verse 61:27": "Private Talks Books",
                            "verse 61:28": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 61:1": "All that is in the heavens and all that is in the earth proclaim Allah’s purity, and He is the All-Mighty, the All-Wise.",
                            "verse 61:2": "O you who believe, why do you say what you do not do?",
                            "verse 61:3": "It is severely hateful in Allah’s sight that you say what you do not do.",
                            "verse 61:4": "Surely Allah loves those who fight in His way in firm rows, as if they were solid edifice.",
                            "verse 61:5": "And (remember) when Mūsā said to his people, “O my people, why do you hurt me, while you know that I am a messenger of Allah sent towards you.",
                            "verse 61:6": "(Remember) when ‘Īsā, son of Maryam, said, “O children of Isrā’īl, I am a messenger of Allah sent towards you, confirming the Torah that is (sent down) before me, and giving you the good news of a messenger who will come after me, whose name will be AHmad.",
                            "verse 61:7": "And who is more unjust than the one who forges a lie against Allah, while he is invited to Islām? And Allah does not guide the unjust people.",
                            "verse 61:8": "They wish to extinguish the light of Allah with their mouths, but Allah is to perfect His light, even though the disbelievers dislike (it).",
                            "verse 61:9": "He is the One who has sent His Messenger with guidance and the religion of truth, so that He makes it prevail over all religions, even though the mushriks (those who ascribe partners to Allah) dislike (it).",
                            "verse 61:10": "O you who believe, shall I tell you about a trade that saves you from a painful punishment?",
                            "verse 61:11": "That you believe in Allah and His Messenger, and carry out Jihād in His way with your riches and your lives.",
                            "verse 61:12": "(If you do this,) He will forgive your sins, and will admit you to gardens beneath which rivers flow, and to pleasant dwellings in gardens of eternity.",
                            "verse 61:13": "And (He will give you) another thing, which you love: Help from Allah, and victory, near at hand.",
                            "verse 61:14": "O you who believe, be supporters of (the religion of) Allah, just as ‘Īsā, son of Maryam, said to the Disciples, “Who are my supporters towards Allah?” The Disciples said, “We are the supporters of (the religion of) Allah."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 61:1": "All that is in the heavens and all that is in the earth glorifies God, and He is the Mighty, the Wise.",
                            "verse 61:2": "O you who believe, why do you say what you do not do?",
                            "verse 61:3": "It is greatly loathsome to God that you say what you do not do.",
                            "verse 61:4": "Indeed God loves those who fight for His cause in ranks, as if they were a solid structure.",
                            "verse 61:5": "And when Moses said to his people, ‘O my people, why do you harm me, when certainly you know that I am the messenger of God to you?’ So when they deviated, God caused their hearts to deviate: and God does not guide the immoral folk.",
                            "verse 61:6": "And when Jesus son of Mary said, ‘O Children of Israel I am indeed God’s messenger to you, confirming what is before me of the Torah and bringing good tidings of a messenger who will come after me, whose name is Ahmad’.",
                            "verse 61:7": "And who does greater wrong than he who invents lies against God, when he is",
                            "verse 61:8": "being summoned to submission [to God]? And God does not guide the wrongdoing folk.",
                            "verse 61:9": "They desire to extinguish the light of God with their mouths, but God will perfect His light, though the disbelievers be averse.",
                            "verse 61:10": "It is He Who has sent His Messenger with the guidance and the religion of truth, that He may make it prevail over all",
                            "verse 61:11": "religions, though the disbelievers be averse.",
                            "verse 61:12": "O you who believe, shall I show you a commerce that will deliver you from a painful chastisement?",
                            "verse 61:13": "You should believe in God and His Messenger and struggle for the cause of God with your possessions and your lives.",
                            "verse 61:14": "He will",
                            "verse 61:15": "forgive you your sins and admit you into gardens underneath which rivers flow and pleasant dwellings in the Gardens of Eden.",
                            "verse 61:16": "And, another which you love: help from God and a victory near at hand.",
                            "verse 61:17": "O you who believe, be helpers of God, just as said Jesus son of Mary to the disciples, ‘Who will be my helpers unto God?’ The disciples said, ‘We will be God’s helpers!’ So a group of the Children of Israel believed, while a group disbelieved."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 61:1": "Whatever is in the heavens and whatever is in the earth (all) glorify Allah.",
                            "verse 61:2": "O believers! Why do you say what you do not do?",
                            "verse 61:3": "It is most hateful in the sight of Allah that you should say what you do not do.",
                            "verse 61:4": "Assuredly, Allah loves those who fight in the way of Allah (to eliminate tyranny and terrorism and restore peace and human dignity, so) organized in ranks as if they were a wall cemented with molten lead.",
                            "verse 61:5": "And, (O Beloved, recall) when Musa (Moses) said to his people: ‘O my people, why do you offend me whilst you know that I am (a Messenger) sent to you by Allah?’ So when they continued deviating, then Allah made their hearts deviate.",
                            "verse 61:6": "(And also recall) when ‘Isa, the son of Maryam (Jesus, the son of Mary) said: ‘O Children of Israel, indeed I am (a Messenger) sent to you by Allah, confirming the Torah, the Book which came before me, and bearing the good news of (the pleasant arrival) of (the Esteemed) Messenger (blessings and peace be upon him) who will come after me, whose name is Ahmad (now in the heavens).",
                            "verse 61:7": "And who can be a greater wrongdoer than he who invents a lie against Allah whilst he is being invited towards Islam? And Allah does not guide the wrongdoers.",
                            "verse 61:8": "These (deniers of the truth) desire to put out the Light of Allah by (blowing) with their mouths, whereas Allah will take His Light to perfection, even though the disbelievers may dislike it intensely.",
                            "verse 61:9": "He is the One Who has sent His Messenger with guidance and the Din (Religion) of truth so that He may make it dominate and prevail over all other religions, even though the idolaters may hate it much.",
                            "verse 61:10": "O believers! Shall I advise you a trade which will save you from a painful torment?",
                            "verse 61:11": "(It is that) you have (perfect) belief in Allah and His Messenger (blessings and peace be upon him) and strive hard for the cause of Allah with your human and material resources.",
                            "verse 61:12": "He will forgive your sins and will admit you into Gardens with streams flowing under them, and (will make you reside) in excellent dwellings in the Gardens of Eden (i.",
                            "verse 61:13": "And, (besides this favour in the Hereafter, He will grant you) another (worldly blessing too) which you earnestly desire: (that is) help from Allah and a near victory, and, (O Esteemed Prophet,) give this good news to the believers.",
                            "verse 61:14": "O believers! Be helpers of Allah as ‘Isa, the son of Maryam (Jesus, the son of Mary) said to (his) disciples: ‘Who are my helpers towards (the path of) Allah?’ The disciples said: ‘We are Allah’s helpers."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Kaikki, mitä on taivaassa ja maassa, julistaa Jumalan kunniaa, sillä Jumala on kaikkivoipa, viisas.",
                            "verse 61:2": "Uskovaiset, miksi lupaatte sanoilla sellaista, mitä ette tee?",
                            "verse 61:3": "Jumalan silmissä on inhottavaa se, että lupaatte sellaista, mitä ette tee.",
                            "verse 61:4": "Jumala rakastaa totisesti niitä, jotka taistelevat Hänen retkillään taistelurintamassa, joka on kuin kivimuuri.",
                            "verse 61:5": "Muistakaa, kuinka Mooses sanoi kansalleen: »Miksi kiusaatte minua, vaikka tiedätte, että olen Jumalan teitä varten lähettämä sananjulistaja?» Mutta kun he halusivat poiketa totuudesta, Jumala antoi heidän sydämensä harhautua, sillä Jumala ei ohjaa väärintekijöitä.",
                            "verse 61:6": "Ja kun Jeesus, Marian poika, sanoi: »Israelin lapset, totisesti olen sananjulistaja, jonka Jumala on lähettänyt teille vahvistamaan Toorasta sen, mikä annettiin ennen minua, ja ilmoittamaan ilosanoman sananjulistajasta, joka on tuleva minun jälkeeni ja jonka nimi on oleva Ahmad.",
                            "verse 61:7": "Kuka on jumalattomampi kuin se, joka keksii valheen Jumalaa vastaan juuri silloin, kun häntä kutsutaan islaamiin? Jumala ei kaitse väärintekijöitä.",
                            "verse 61:8": "He tahtovat suullaan puhaltaa sammuksiin Jumalan kynttilän, mutta Jumala tekee valonsa täydelliseksi, vaikka uskottomat ovat sitä vastaan.",
                            "verse 61:9": "Hän on lähettänyt sananjulistajansa tuomaan opastuksen ja totuuden uskonnon, jotta Hän saattaisi sen voittoon kaikkien muiden uskontojen rinnalla, vaikka monijumalaiset ovatkin sitä vastaan.",
                            "verse 61:10": "Te uskovaiset, osoitanko teille tien, jolla voitte pelastua tuskallisesta kurituksesta?",
                            "verse 61:11": "Uskokaa Jumalaan ja Hänen sananjulistajaansa ja asettakaa voimanne, rikkautenne ja henkenne Jumalan asian palvelukseen; näin on teille parasta, jospa sen ymmärtäisitte.",
                            "verse 61:12": "Hän antaa teille syntinne anteeksi ja sallii teidän astua puutarhoihin, joiden kautta joet virtaavat, ja ihaniin asuntoihin autuuden puutarhoissa; tämä on ylin autuus.",
                            "verse 61:13": "Ja vielä toinen asia, joka on teille mieluinen, teitä odottaa: apu Jumalalta ja lähellä oleva voitto.",
                            "verse 61:14": "Te uskovaiset, tukekaa Jumalan asiaa, niinkuin Jeesus, Marian poika, sanoi opetuslapsilleen: »Ketkä tahtovat olla auttajiani Jumalan asiassa?» Opetuslapset vastasivat: »Me olemme Jumalan auttajia."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 61:1": "Ce qui est dans les cieux et ce qui est sur la terre glorifie Dieu.",
                            "verse 61:2": "O vous qui croyez, pourquoi dites-vous ce que vous ne faites pas ?",
                            "verse 61:3": "C'est une grande félonie, auprès de Dieu, que de parler et de ne pas agir.",
                            "verse 61:4": "En vérité, Dieu aime ceux qui combattent dans Son chemin en rangs serrés, comme s'ils formaient un édifice bien scellé.",
                            "verse 61:5": "Moïse parla ainsi à son peuple : \" O mon peuple ! Pourquoi me maltraitez-vous, alors que vous savez que je suis vraiment le messager de Dieu envoyé vers vous ? \" Lorsqu'ils dévièrent, Dieu fit dévier leurs cœurs.",
                            "verse 61:6": "Et Jésus, fils de Marie, parla ainsi : \" O fils d'Israël ! Je suis, en vérité, l'Envoyé de Dieu vers vous, venu pour confirmer ce qui, de la Tora, existait avant moi, et pour vous annoncer le bonne nouvelle d'un envoyé qui viendra après moi et dont le nom sera : Ahmad \".",
                            "verse 61:7": "Qui donc est plus inique que celui qui forge un mensonge contre Dieu alors qu'il est appelé à la soumission (al-islâm) ? Mais Dieu ne dirige pas les iniques.",
                            "verse 61:8": "Ils veulent étouffer la lumière de Dieu avec leurs bouches, mais Dieu parachèvera Sa lumière, dussent les mécréants en concevoir du dépit.",
                            "verse 61:9": "C'est Lui qui a dépêché Son Envoyé avec la bonne guidance et la religion de Vérité pour la faire prévaloir sur la religion toute entière, dussent les associateurs en concevoir du dépit.",
                            "verse 61:10": "O vous qui croyez ! Vous indiquerai-je un négoce qui vous sauvera d'un châtiment douloureux :",
                            "verse 61:11": "croyez en Dieu et en Son Envoyé, et combattez dans le chemin de Dieu avec vos biens et vos personnes.",
                            "verse 61:12": "Il vous pardonnera vos péchés et Il vous fera entrer dans les Jardins sous lesquels coulent les fleuves et dans de plaisantes demeures situées dans les jardins d'Eden.",
                            "verse 61:13": "Il y a autre chose que vous aimerez : un secours venant de Dieu et une victoire proche.",
                            "verse 61:14": "O vous qui croyez ! Soyez les auxiliaires de Dieu, comme l'a dit Jésus, fils de Marie, en s'adressant aux Apôtres : \" Qui seront mes auxiliaires dans la voie de Dieu ? \" Les Apôtres ont répondu : \" Nous sommes les auxiliaires de Dieu ! \" Un groupe des fils d'Israël crut, tandis qu'un groupe mécrut."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 61:1": "Ce qui est dans les cieux et ce qui est sur la terre glorifient Dieu, et Il est le Puissant, le Sage.",
                            "verse 61:2": "ô vous qui avez cru ! Pourquoi dites-vous ce que vous ne faites pas ?",
                            "verse 61:3": "C’est une grande abomination auprès de Dieu que de dire ce que vous ne faites pas.",
                            "verse 61:4": "Dieu aime ceux qui combattent dans Son chemin en rang serré pareils à un édifice renforcé.",
                            "verse 61:5": "Et quand Moïse dit à son peuple : «ô mon peuple ! Pourquoi me maltraitez-vous alors que vous savez que je suis vraiment le Messager de Dieu",
                            "verse 61:6": "à vous ? » Puis quand ils dévièrent, Dieu fit dévier leurs coeurs, car Dieu ne guide pas les gens pervers.",
                            "verse 61:7": "Et quand Jésus fils de Marie dit : «ô Enfants d’Israël, je suis vraiment le Messager de Dieu",
                            "verse 61:8": "à vous, confirmateur de ce qui, dans la Thora, est antérieur à moi, et annonciateur d’un Messager à venir après moi, dont le nom sera «Ahmad» .",
                            "verse 61:9": "Et qui est plus injuste que celui qui invente un mensonge contre Dieu, alors qu’il est appelé à l’Islam ? Et Dieu ne guide pas les gens injustes.",
                            "verse 61:10": "Ils veulent éteindre de leurs bouches la lumière de Dieu, alors que Dieu parachèvera Sa lumière en dépit de l’aversion des mécréants.",
                            "verse 61:11": "C’est Lui qui a envoyé Son messager avec la guidée et la Religion de Vérité, pour la placer au-dessus de toute autre religion, en dépit de l’aversion des associateurs.",
                            "verse 61:12": "ô vous qui avez cru ! Vous indiquerai-je un commerce qui vous sauvera d’un châtiment douloureux ?",
                            "verse 61:13": "Vous croyez en Dieu et en Son messager et vous combattez avec vos biens et vos personnes dans le chemin de Dieu, et cela vous est bien meilleur, si vous saviez !",
                            "verse 61:14": "Il vous pardonnera vos péchés et vous fera entrer dans des Jardins sous lesquels coulent les ruisseaux, et dans des demeures agréables dans les jardins d’Eden ? Voilà l’énorme succès",
                            "verse 61:15": "et il vous accordera d’autres choses encore que vous aimez bien : un secours",
                            "verse 61:16": "de Dieu et une victoire prochaine.",
                            "verse 61:17": "ô vous qui avez cru ! Soyez les alliés de Dieu, à l’instar de ce que Jésus fils de Marie a dit aux apôtres : « Qui sont mes alliés (pour la cause) de Dieu ? » - Les apôtres dirent : «Nous sommes les alliés de Dieu»."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Was in den Himmeln und was auf Erden ist, preist Allah; und Er ist der Allmächtige, der Allweise.",
                            "verse 61:2": "O die ihr glaubt, warum sagt ihr, was ihr nicht tut?",
                            "verse 61:3": "Höchst hassenswert ist es vor Allah, daß ihr sagt, was ihr nicht tut.",
                            "verse 61:4": "Allah liebt diejenigen, die für Seine Sache kämpfen, (in Schlachtordnung) gereiht, als wären sie ein mit Blei gelöteter, festgefügter Bau.",
                            "verse 61:5": "Und (gedenke der Zeit) da Moses zu seinem Volke sprach: «O mein Volk, warum kränkt ihr mich, da ihr doch wisset, daß ich Allahs Gesandter an euch bin?» Wie sie nun eine krumme Richtung nahmen, da ließ Allah ihre Herzen krumm werden, denn Allah weist nicht dem widerspenstigen Volk den Weg.",
                            "verse 61:6": "Und (gedenke der Zeit) da Jesus, Sohn der Maria, sprach: «O ihr Kinder Israels, ich bin Allahs Gesandter an euch, Erfüller dessen, was von der Thora vor mir ist, und Bringer der frohen Botschaft von einem Gesandten, der nach mir kommen wird.",
                            "verse 61:7": "Wer aber könnte ärgeren Frevel begehn, als wer wider Allah die Lüge erdichtet, und er selbst zum Islam aufgefordert wird? Allah weist nicht dem Volk der Frevler den Weg.",
                            "verse 61:8": "Sie möchten Allahs Licht auslöschen mit ihren Mündern, doch Allah wird Sein Licht vollkommen machen, auch wenn die Ungläubigen es hassen.",
                            "verse 61:9": "Er ist es, Der Seinen Gesandten geschickt hat mit der Führung und der Religion der Wahrheit, auf daß Er sie obsiegen lasse über alle Religionen, auch wenn die Götzendiener es hassen.",
                            "verse 61:10": "O die ihr glaubt, soll Ich euch einen Handel ansagen, der euch vor qualvoller Strafe retten wird?",
                            "verse 61:11": "Ihr sollt an Allah glauben und an Seinen Gesandten und sollt streiten für Allahs Sache mit eurem Gut und eurem Blut.",
                            "verse 61:12": "Er wird euch eure Sünden vergeben und euch in Gärten führen, durch die Ströme fließen, und in entzückende Wohnungen in den Gärten der Ewigkeit.",
                            "verse 61:13": "Und (Er wird) noch eine andere (Huld bescheren), die ihr liebt: Hilfe von Allah und nahen Sieg.",
                            "verse 61:14": "O die ihr glaubt, seid Allahs Helfer, wie Jesus, Sohn der Maria, zu den Jüngern sprach: «Wer sind meine Helfer für Allah?» Die Jünger sprachen: «Wir sind Allahs Helfer."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "tks pht+s vklekuksa esa gS vkSj tks pht+s t+ehu esa gSa ¼lc½ [+kqnk dh rLchg djrh gSa vkSj og x+kfyc fgder okyk gS",
                            "verse 61:2": ",s bZekunkjksa rqe ,slh ckrsa D;ksa dgk djrs gks tks fd;k ugha djrs",
                            "verse 61:3": "[+kqnk ds ut+nhd ;s x+t+c dh ckr gS fd rqe ,slh ckr dks tks djks ugha",
                            "verse 61:4": "[+kqnk rks mu yksxksa ls myQ+r j[krk gS tks mldh jkg esa bl rjg ijk ck¡/k ds yM+rs gSa fd xks;k og lhlk fiykbZ gq;h nhokjsa gSa",
                            "verse 61:5": "vkSj tc ewlk us viuh d+kSe ls dgk fd Hkkb;ksa rqe eq>s D;ksa vt+h;r nsrs gks gkykWfd rqe rks tkurs gks fd eSa rqEgkjs ikl [+kqnk dk ¼Hkstk gqvk½ jlwy gw¡ rks tc og Vs<+s gq, rks [+kqnk us Hkh muds fnyksa dks Vs<+k gh jgus fn;k vkSj [+kqnk cndkj yksxksa dks eaft+ys ed+lwn rd ugha igq¡pk;k djrk",
                            "verse 61:6": "vkSj ¼;kn djks½ tc efj;e ds csVs bZlk us dgk ,s cuh bljkby eSa rqEgkjs ikl [+kqnk dk Hkstk gqvk ¼vk;k½ gw¡ ¼vkSj tks fdrkc rkSjsr esjs lkeus ekStwn gS mldh rlnhd+ djrk gw¡ vkSj ,d iSx+Ecj ftudk uke vgen gksxk ¼vkSj½ esjs ckn vk,¡xs mudh [+kq’k[+kcjh lqukrk gw¡ tks tc og ¼iSx+Ecj vgen½ muds ikl okt+s, o jkS’ku ekSftt+s ysdj vk;k rks dgus yxs ;s rks [kqyk gqvk tknw gS",
                            "verse 61:7": "vkSj tks Ó[+l bLyke dh rjQ cqyk;k tk, ¼vkSj½ og dq+cwy ds cnys myVk [+kqnk ij >wB ¼rwQku½ tksM+s mlls c<+ dj t+kfye vkSj dkSu gksxk vkSj [+kqnk t+kfye yksxksa dks eaft+ys ed+lwn rd ugha igq¡pk;k djrk",
                            "verse 61:8": ";s yksx vius eq¡g ls ¼Qw¡d ekjdj½ [+kqnk ds uwj dks cq>kuk pkgrs gSa gkykWfd [+kqnk vius uwj dks iwjk djds jgsxk vxjps dq¶+Q+kj cqjk gh ¼D;ksa u½ ekusa",
                            "verse 61:9": "og ogh gS ftlus vius jlwy dks fgnk;r vkSj lPps nhu ds lkFk Hkstk rkfd mls vkSj reke nhuksa ij x+kfyc djs vxjps eq’kjsdhu cqjk gh ¼D;ksa u½ ekus",
                            "verse 61:10": ",s bZekunkjksa D;k eSa ugha ,slh frtkjr crk nw¡ tks rqedks ¼vk[+ksjr ds½ nnZukd vt+kc ls futkr ns",
                            "verse 61:11": "¼og ;s gS fd½ [+kqnk vkSj mlds jlwy ij bZeku ykvks vkSj vius eky o tku ls [+kqnk dh jkg esa tsgkn djks vxj rqe le>ks rks ;gh rqEgkjs gd+ essa csgrj gS",
                            "verse 61:12": "¼,slk djksxs½ rks og Hkh blds ,sot+ esa rqEgkjs xqukg c[+’k nsxk vkSj rqEgsa mu ckx+ksa esa nkf[k+y djsxk ftuds uhps ugjsa tkjh gSa vkSj ikdhtk+ edkukr esa ¼txg nsxk½ tks tkosnkuh csfg’r esa gSa ;gh rks cM+h dke;kch gS",
                            "verse 61:13": "vkSj ,d pht+ ftlds rqe fny nknk gks ¼;kfu rqedks½ [+kqnk dh rjQ ls enn ¼feysxh vkSj vud+jhc Qrsg ¼gksxh½ vkSj ¼,s jlwy½ eksfeuhu dks [+kq’k[+kcjh ¼bldh½ ns nks",
                            "verse 61:14": ",s bZekunkjksa [+kqnk ds ennxkj cu tkvks ftl rjg efj;e ds csVs bZlk us gokfj;ksa ls dgk Fkk fd ¼Hkyk½ [+kqnk dh rjQ ¼cqykus esa½ esjs ennxkj dkSu yksx gSa rks gokjhu cksy mBs Fks fd ge [+kqnk ds vulkj gSa rks cuh bljkbZy esa ls ,d fxjksg ¼mu ij½ bZeku yk;k vkSj ,d fxjksg dkfQj jgk] rks tks yksx bZeku yk, geus mudks muds nq’keuksa ds eqd+kcys esa enn nh rks vkf[+kj ogh x+kfyc jgs lwj, vy lQ+ [+kRe"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Bertasbih kepada Allah apa saja yang ada di langit dan apa saja yang ada di bumi; dan Dia-lah Yang Maha Perkasa lagi Maha Bijaksana.",
                            "verse 61:2": "Hai orang-orang yang beriman, mengapa kamu mengatakan apa yang tidak kamu perbuat?",
                            "verse 61:3": "Amat besar kebencian di sisi Allah bahwa kamu mengatakan apa-apa yang tiada kamu kerjakan.",
                            "verse 61:4": "Sesungguhnya Allah menyukai orang-orang yang berperang di jalan-Nya dalam barisan yang teratur seakan-akan mereka seperti suatu bangunan yang tersusun kokoh.",
                            "verse 61:5": "Dan (ingatlah) ketika Musa berkata kepada kaumnya: \"Hai kaumku, mengapa kamu menyakitiku, sedangkan kamu mengetahui bahwa sesungguhnya aku adalah utusan Allah kepadamu?\" Maka tatkala mereka berpaling (dari kebenaran), Allah memalingkan hati mereka dan Allah tiada memberi petunjuk kepada kaum yang fasik.",
                            "verse 61:6": "Dan (ingatlah) ketika ’Isa Putera Maryam berkata: \"Hai Bani Israil, sesungguhnya aku adalah utusan Allah kepadamu, membenarkan kitab (yang turun) sebelumku, yaitu Taurat dan memberi kabar gembira dengan (datangnya) seorang Rasul yang akan datang sesudahku, yang namanya Ahmad (Muhammad)\" Maka tatkala rasul itu datang kepada mereka dengan membawa bukti-bukti yang nyata, mereka berkata: \"Ini adalah sihir yang nyata\".",
                            "verse 61:7": "Dan siapakah yang lebih zalim daripada orang yang mengada-adakan dusta terhadap Allah sedang dia diajak kepada agama Islam? Dan Allah tiada memberi petunjuk kepada orang-orang yang zalim.",
                            "verse 61:8": "Mereka ingin hendak memadamkan cahaya (agama) Allah dengan mulut (ucapan-ucapan) mereka, dan Allah tetap menyempurnakan cahaya-Nya meskipun orang-orang kafir benci.",
                            "verse 61:9": "Dia-lah yang mengutus Rasul-Nya dengan membawa petunjuk dan agama yang benar agar Dia memenangkannya di atas segala agama-agama meskipun orang-orang musyrik benci.",
                            "verse 61:10": "Hai orang-orang yang beriman, sukakah kamu Aku tunjukkan suatu perniagaan yang dapat menyelamatkan kamu dari azab yang pedih?",
                            "verse 61:11": "(yaitu) kamu beriman kepada Allah dan Rasul-Nya dan berjihad di jalan Allah dengan harta dan jiwamu.",
                            "verse 61:12": "niscaya Allah akan mengampuni dosa-dosamu dan memasukkan kamu ke dalam surga yang mengalir di bawahnya sungai-sungai, dan (memasukkan kamu) ke tempat tinggal yang baik di dalam surga Adn.",
                            "verse 61:13": "Dan (ada lagi) karunia yang lain yang kamu sukai (yaitu) pertolongan dari Allah dan kemenangan yang dekat (waktunya).",
                            "verse 61:14": "Hai orang-orang yang beriman, jadilah kamu penolong-penolong (agama) Allah sebagaimana ’Isa putera Maryam telah berkata kepada pengikut-pengikutnya yang setia: \"Siapakah yang akan menjadi penolong-penolongku (untuk menegakkan agama) Allah?\" Pengikut-pengikut yang setia itu berkata: \"Kamilah penolong-penolong agama Allah\", lalu segolongan dari Bani Israil beriman dan segolongan (yang lain) kafir; maka kami berikan kekuatan kepada orang-orang yang beriman terhadap musuh-musuh mereka, lalu mereka menjadi orang-orang yang menang."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Glorifica Allah ciò che è nei cieli e sulla terra.",
                            "verse 61:2": "O credenti, perché dite quel che non fate?",
                            "verse 61:3": "Presso Allah è grandemente odioso che diciate quel che non fate.",
                            "verse 61:4": "In verità Allah ama coloro che combattono per la Sua causa in ranghi serrati come fossero un solido edificio.",
                            "verse 61:5": "",
                            "verse 61:6": "quando Mosè disse al suo popolo: « O popol mio, perché mi tormentate nonostante sappiate che sono veramente il Messaggero di Allah a voi ?».",
                            "verse 61:7": "Quando poi deviarono, Allah fece deviare i loro cuori.",
                            "verse 61:8": "E quando Gesù figlio di Maria disse: « O Figli di Israele, io sono veramente un Messaggero di Allah a voi ,",
                            "verse 61:9": "per confermare la Torâh che mi ha preceduto, e per annunciarvi un Messaggero che verrà dopo di me, il cui nome sarà \"Ahmad\" » .",
                            "verse 61:10": "Chi è più iniquo di colui che inventa menzogne contro Allah, nonostante venga chiamato all'Islàm? Allah non guida gli ingiusti.",
                            "verse 61:11": "Vogliono spegnere la luce di Allah con le loro bocche, ma Allah completerà la Sua luce a dispetto dei miscredenti .",
                            "verse 61:12": "Egli è Colui che ha inviato il Suo Messaggero con la Guida e la Religione della verità, affinché essa prevalga su ogni religione a dispetto degli associatori.",
                            "verse 61:13": "O voi che credete, [volete che] vi indichi una transazione che vi salverà da un doloroso castigo?",
                            "verse 61:14": "Credete in Allah e nel Suo Inviato e lottate con i vostri beni e le vostre persone sulla Via di Allah.",
                            "verse 61:15": "",
                            "verse 61:16": "perdonerà i vostri peccati e vi farà entrare nei Giardini dove scorrono i ruscelli e nelle piacevoli dimore dei Giardini di Eden.",
                            "verse 61:17": "E [vi darà] un'altra cosa che desidererete: l'aiuto di Allah e una rapida vittoria.",
                            "verse 61:18": "O credenti, siate gli ausiliari di Allah, così come Gesù figlio di Maria chiedeva agli apostoli: «Chi sono i miei ausiliari [nella causa di] Allah?»."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "天にあり地にある凡ての有は，アッラーを讃える。本当にかれは偉力ならびなく英明であられる。",
                            "verse 61:2": "信仰する者よ，あなたがたはどうして（自ら）行わないことを口にするのか。",
                            "verse 61:3": "あなたがたが行わないことを口にするのは，アッラーが最も憎まれるところである。",
                            "verse 61:4": "本当にアッラーの御好みになられる者は，堅田な建造物のように，戦列を組んでかれの道のために戦う者たちである。",
                            "verse 61:5": "ムーサーがかれの人びとに言った時を思い起せ。「人びとよ，どうしてあなたがたはわたしを苦しめるのか。わたしが，あなたがたに（遣わされた）アッラーの使徒であることを，知っているではないか。」それでかれらが常規を踏みはずした時，アッラーはかれらの心を曲げられた。本当にアッラーは，（アッラーの）� に背く者を御導きになられない。",
                            "verse 61:6": "マルヤムの子イーサーが，こう言った時を思い起せ。「イスラエルの子孫たちよ，本当にわたしは，あなたがたに（遣わされた）アッラーの使徒で，わたしより以前に，（下されている）律法を確証し，またわたしの後に来る使徒の吉報を与える。その名前は，アハマドである。」だがかれが明証をもって現れた時，かれらは，「これは明らかに魔術である。」と言った。",
                            "verse 61:7": "イスラームに招かれていながら，アッラーに就いて虚偽を捏造する者以上に悪を行う者があろうか。アッラーは不義を行う民を御導きになられない。",
                            "verse 61:8": "かれらはアッラーの御光を，口先で消そうと望んでいる。だがアッラーは例え不信心者たちが忌み嫌おうとも御自分の光（イスラーム）を現わした。",
                            "verse 61:9": "かれこそは，導きと真実の宗教を持たせて，御自分の使徒を遺わされた方で，例え多神教徒たちが忌み嫌おうとも，それ（イスラーム）を凡ての宗教の上に高く掲げさせられる。",
                            "verse 61:10": "あなたがた信仰する者よ，われは痛苦の懲罰から救われる一つの取引を，あなたがたに示そう。",
                            "verse 61:11": "それはあなたがたがアッラーとその使徒を信じ，あなたがたの財産と生命をもってアッラーの道に奮闘努力することである。もし分るならば，それはあなたがたのために最も善い。",
                            "verse 61:12": "かれはあなたがたの様々な罪は赦して，川が（木々の）下を流れる楽園に入らせ，アドン（エデン）の楽園における美しい邸宅に住まわせる。それは至福の成就である。",
                            "verse 61:13": "またあなたがたが好む，外（の恩恵）を与えられる。アッラーの御助けと，速かな勝利である。だからこの吉報を信者たちに伝えなさい。",
                            "verse 61:14": "信仰する者よ，あなたがたはアッラーの助力者になれ。マルヤムの子イーサーが，その弟子たちに次のように言った。「アッラーの（道の）ために，誰がわたしの助力者であるのか。」弟子たちは（答えて），「わたしたちがアッラーの助力者です。」と言った。そのさいイスラエルの子孫たちの一団は信仰し，一団は背を向けた。それでわれは，信仰した者たちを助けて，かれらの敵に立ち向かわせた。こうしてかれらは勝利者となったのである。 またあなたがたが好む，外（の恩恵）を与えられる。アッラーの御助けと，速かな勝利である。だからこの吉報を信者たちに伝えなさい。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "하늘과 대지에 있는 모든 것들로 하여금 하나님을 찬미하도록하랴 실로 하나님은 권능과 지혜 로 충만하시니라",
                            "verse 61:2": "믿는 사람들이여 너희가 행하지 아니하면서 입으로만 말하느뇨",
                            "verse 61:3": "너희가 말하고 행하지 아니한것이 하나님께서는 가장 증오스러운 것이라",
                            "verse 61:4": "실로 하나님은 하나님의 명분을 위하여 대열에 서서 견고한 건물처럼 자리를 지키며 성전에 임 하는 자들을 사랑하시니라",
                            "verse 61:5": "모세가 백성들이여 너희는 왜나를 해치려 하느뇨 내가 너희에 게 보내어진 하나님의 선지자임을너희는 알지 않느뇨 라고 그의 백성에게 말하였으나 그들은 외면하였나니 하나님께서 그들의 마음을벗어나게 하였도다 실로 하나님은사악한 백성들을 인도하지 아니 하시니라",
                            "verse 61:6": "마리아의 아들 예수가 이스 라엘 자손들이여 실로 나는 너희 에게 보내어진 선지자로써 내 앞 에 온 구약과 내 후에 올 아흐맏 이란 이름을 가진 한 선지자의 복음을 확증하노라 그러나 그가 분명한 예증으로 그들에게 임하 였을 때 이것은 분명한 마술이라 하였더라",
                            "verse 61:7": "이슬람에 초대받았음에도 불 구하고 하나님을 거역하며 거짓하는 자보다 더 사악한 자 누구이뇨실로 하나님은 사악한 백성들을 사랑하지 않으시니라",
                            "verse 61:8": "그들은 그들의 입으로 하나님의 빛을 끄려하고 불신자들이 그 것을 혐오하려 하여도 하나님은 그분의 빛을 완성케 하시니라",
                            "verse 61:9": "복음과 진리의 종교를 선지자를 통하여 보내시고 그것이 다른 모든 종교 위에 두신 분이 하나님이시라 그러나 불신자들은 그것을싫어하더라",
                            "verse 61:10": "믿는 사람들이여 상업을 가르켜 주리라 그것이 고통스러운 응벌로부터 너희를 구하리라",
                            "verse 61:11": "그것은 너희가 하나님과 그분의 선지자를 믿으며 하나님 사 업을 위해 너희 재산과 너희 생명으로 성전하는 것으로 너희가 알 고 있다면 그것이 너희를 위한 복이라",
                            "verse 61:12": "하나님께서 너희의 과오를 용서하사 강물이 흐르는 에덴의 천국 안에 있는 아름다운 거주지 로 인도하시나니 그것이 위대한 숭리라",
                            "verse 61:13": "너희가 좋아하는 다른 축복들도 있나니 하나님의 원조와 신속한 승리라 그러므로 믿음을 가진 자 들에게 기쁜 소식을 전하라",
                            "verse 61:14": "믿는 사람들이여 하나님의 길에서 돕는 자가 되라 마리아의 아들 예수가 그의 제자들에게 하나님의 길에서 누가 나를 돕겠 느뇨 라고 했을 때 저희가 하나님 의 길에서 돕는 자가 되겠습니다 라고 제자들은 대답했노라 그리하 여 이스라엘 자손의 무리는 믿음 을 가졌고 다른 무리는 불신하였 더라 그래서 하나님은 그들의 적에대항하여 믿음을 가진 자들을 도왔으니 그들이 승리자가 되었노라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "هه‌رچی له ئاسمانه‌کان و زه‌ویدا هه‌یه به‌پاکی و بێگه‌ردی یادی خوایان کردووه‌، هه‌ر ئه‌ویش باڵاده‌ست و دانایه‌.",
                            "verse 61:2": "ئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه بۆچی شتێک ده‌ڵێن و ئه‌نجامی ناده‌ن؟ بۆچی گوفتارتان دژی کردارتانه‌؟",
                            "verse 61:3": "خه‌شم و ڕقێکی گه‌وره‌یه لای خوا ئه‌وه‌ی که ده‌یڵێن و نایکه‌ن.",
                            "verse 61:4": "به‌ڕاستی خوا ئه‌و که‌سانه‌ی خۆس ده‌وێت که ده‌جه‌نگن له‌پێناو ڕێبازی خوادا به‌یه‌ك ڕیزو یه‌ك پارچه و یه‌ك دڵ، چونکه هه‌روه‌ك کۆشکێکی به‌رزی قایمی داڕێژراون به قوڕقوشم.",
                            "verse 61:5": "بیریان نخه‌ره‌وه‌، کاتێك که موسا به قه‌ومه‌که‌ی وت: ئه‌ی قه‌وم و هۆزم ئێوه بۆچی ئازاری ڕۆح و دڵم ده‌ده‌ن، له کاتێکدا بێگومان ده‌زانن که من پێغه‌مبه‌ر و ڕه‌وانه‌کراوی خوام بۆتان، جا کاتێك ئه‌وان گوێیان بۆ ڕاستی نه‌گرت و له‌حه‌ق لایاندا، خوایش دڵه‌کانیانی له‌خشته بردو مۆری پێدا نا، چونکه خوا ڕێنموویی قه‌وم و هۆزی تاوانکارو تاوانبارو له‌سنوور ده‌رچوو ناکات.",
                            "verse 61:6": "بیریان بخه‌ره‌وه‌، کاتێك عیسای کوری مه‌ریه‌م به‌نه‌وه‌ی ئیسرائیلی وت: منیش به‌ڕاستی پێغه‌مبه‌ری خوام بۆ سه‌ر ئێوه‌، ڕاستی ته‌وراتیش ده‌سه‌لمێنم که‌له پێش مندا هاتووه‌، هه‌روه‌ها مژده‌ده‌ریشم به‌پێغه‌مبه‌رێك که دوای من دێت و ناوی - ئه‌حمه‌د - ه‌، که‌چی کاتێك به به‌ڵگه و نیشانه‌ی تێر و ته‌واوو موعجیزه‌ی ئاشکراوه پێی ڕاگه‌یاندن، وتیان: ئه‌مه جادوویه‌کی ئاشکرایه‌.",
                            "verse 61:7": "جا کێ له‌و که‌سه سته‌مکارتره که درۆی بۆ خوا هه‌ڵبه‌ستووه‌، له‌کاتێکدا ئه‌و بانگ ده‌کرێت بۆ لای ئیسلام و موسڵمان بوون، خوایش هیدایه‌ت و ڕێنموویی قه‌ومی سته‌مکار ناکات.",
                            "verse 61:8": "ئه‌وانه ده‌یانه‌وێت به‌فوو، به‌قه‌ڵه‌ی ده‌م، نووری خوا بکوژێننه‌وه‌!! (خه‌یاڵیان خاوه‌) خوا نووری خۆی، ئاینی خۆی، ته‌واو ده‌کات و ده‌یچه‌سپێنێت هه‌رجه‌نده کافرو بێ بڕواکان پێی سه‌غڵه‌ت بن و پێیان ناخۆش بێت.",
                            "verse 61:9": "هه‌ر ئه‌و خوایه پێغه‌مبه‌ره‌که‌ی خۆی ڕه‌وانه کردووه هاوڕێ له‌گه‌ڵ هیدایه‌ت و ڕێنموویی و ئاینی حه‌ق و ڕاستیدا، تا سه‌ری بخات به‌سه‌ر هه‌موو ئاین و به‌رنامه‌کاندا، هه‌رجه‌نده موشریك و هاوه‌ڵگه‌ڕان پێیان ناخۆش بێت.",
                            "verse 61:10": "ئه‌ی ئه‌و که‌سانه‌ی باوه‌ڕتان هێناوه‌، ده‌ستنیشانی بازرگانیه‌کتان بۆ بکه‌م، که له سزایه‌کی به ئێش ڕزگارتان بکات؟!",
                            "verse 61:11": "سه‌ره‌تا باوه‌ڕهێنانتانه به خواو پێغه‌مبه‌ره‌که‌ی، ئینجا هه‌وڵ و تێکۆشانتانه له‌ڕێگه‌ی خوادا به به‌خشینی ماڵ و سامانتان، وه به‌خشینی خۆتان (واته‌: ماندووکردنی جه‌سته و بیروهۆشتان، تا به‌خت کردنیان له‌پێناوی خوادا) بێگومان ئه‌و کاره‌تان چاکتر و به‌فڕتره بۆتان ئه‌گه‌ر بزانن و تێبگه‌ن.",
                            "verse 61:12": "ئه‌وسا خوا له گوناهو هه‌ڵه‌کانتان خۆش ده‌بێت و ده‌تانخاته باخه‌کانی به‌هه‌شته‌وه له چه‌نده‌ها ڕوبار به‌ژێر دره‌خته‌کانیدا تێ ده‌په‌ڕێت و جاریه‌، هه‌روه‌ها کۆشک و ته‌لاری خۆش و ڕازاوه و پاك و خاوێن له باخه‌کانی به‌هه‌شتی عه‌دندا، به‌ڕاستی ئا ئه‌وه‌یه سه‌رکه‌وتن و سه‌رفرازی و ده‌ستکه‌وتی گه‌وره و بێسنوور.",
                            "verse 61:13": "جا شتێکی تریش هه‌یه که حه‌زی لێ ده‌که‌ن، ئه‌ویش به‌خشینی سه‌رکه‌وتنه له‌لایه‌ن خواوه و کردنه‌وه‌ی وڵاتان و دڵه‌کانه، ئه‌و مژده‌یه‌ش بده به ئیمانداران (له هه‌موو سه‌رده‌مێک، گه‌ر ئیمانداران لێ ببڕێن بۆ ئاینی خوای مه‌زن).",
                            "verse 61:14": "ئه‌ی ئه‌و که‌سانه‌ی که ئیمان و باوه‌ڕتان هێنه‌وه ببنه پشتیوانی به‌رنامه و دینی خوا ببینه لایه‌نگری په‌روه‌ردگار، هه‌روه‌کو عیسای کوڕی مه‌ریه‌م به حه‌واریه‌کانی هاوه‌ڵی وت: کێ پشتیوان و یارو یاوه‌رمه بۆ ڕێبازی خوا، حه‌واری و هاوه‌ڵه‌کانی وتیان: ئێمه ئاماده‌ین ببینه پشتیوان و لایه‌نگیری خوا، ئه‌وسا ئیتر خه‌ڵکی بوون به دوو ده‌سته‌وه‌، ده‌سته‌یه‌ک له نه‌وه‌ی ئیسرائیل باوه‌ڕی هێناو شوین به‌رنامه‌ی خوا که‌وت، ده‌سته‌یه‌کیش ڕێبازی کوفری گرته‌به‌ر، جا ئێمه‌ش پشتیوانیمان له ئیمانداران کردو به‌و هۆیه‌وه سه‌رکه‌وتنمان به‌سه‌ر دوژمنه‌کانیاندا پێبه‌خسین و زاڵ بوون."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Segala yang ada di langit dan yang ada di bumi, tetap mengucap tasbih kepada Allah dan Dialah Yang Maha Kuasa, lagi Maha Bijaksana.",
                            "verse 61:2": "Wahai orang-orang yang beriman! Mengapa kamu memperkatakan apa yang kamu tidak melakukannya!",
                            "verse 61:3": "Amat besar kebenciannya di sisi Allah kamu memperkatakan sesuatu yang kamu tidak melakukannya.",
                            "verse 61:4": "Sesungguhnya Allah mengasihi orang-orang yang berperang untuk membela agamaNya, dalam barisan yang teratur rapi, seolah-olah mereka sebuah bangunan yang tersusun kukuh.",
                            "verse 61:5": "Dan (ingatlah peristiwa) ketika Nabi Musa berkata kepada kaumnya: Wahai kaumku! Mengapa kamu menyakiti daku, sedang kamu mengetahui bahawa sesungguhnya aku ini Pesuruh Allah kepada kamu? Maka ketika mereka menyeleweng (dari kebenaran yang mereka sedia mengetahuinya), Allah selewengkan hati mereka (dari mendapat hidayat petunjuk) dan sememangnya Allah tidak memberi hidayat petunjuk kepada kaum yang fasik (derhaka).",
                            "verse 61:6": "Dan (ingatlah juga peristiwa) ketika Nabi Isa Ibni Mariam berkata: Wahai Bani Israil, sesungguhnya aku ini Pesuruh Allah kepada kamu, mengesahkan kebenaran Kitab yang diturunkan sebelumku, iaitu Kitab Taurat dan memberikan berita gembira dengan kedatangan seorang Rasul yang akan datang kemudian daripadaku bernama: Ahmad.",
                            "verse 61:7": "Dan tidak ada yang lebih zalim daripada orang yang mengada-adakan perkara dusta terhadap Allah, sedang dia diajak kepada memeluk Islam dan (ingatlah), Allah tidak memberi hidayat petunjuk kepada orang-orang yang zalim.",
                            "verse 61:8": "Mereka sentiasa berusaha hendak memadamkan cahaya Allah (agama Islam) dengan mulut mereka, sedang Allah tetap menyempurnakan cahayaNya, sekalipun orang-orang kafir tidak suka (akan yang demikian).",
                            "verse 61:9": "Dialah yang telah mengutus RasulNya (Muhammad s.",
                            "verse 61:10": "Wahai orang-orang yang beriman! Mahukah Aku tunjukkan sesuatu perniagaan yang boleh menyelamatkan kamu dari azab seksa yang tidak terperi sakitnya?",
                            "verse 61:11": "Iaitu, kamu beriman kepada Allah dan rasulNya, serta kamu berjuang membela dan menegakkan agama Allah dengan harta benda dan diri kamu; yang demikian itulah yang lebih baik bagi kamu, jika kamu hendak mengetahui (hakikat yang sebenarnya).",
                            "verse 61:12": "(Dengan itu) Allah akan mengampunkan dosa-dosa kamu dan memasukkan kamu ke dalam taman-taman yang mengalir di bawahnya beberapa sungai, serta ditempatkan kamu di tempat-tempat tinggal yang baik dalam Syurga \"Adn\".",
                            "verse 61:13": "Dan ada lagi limpah kurnia yang kamu sukai, iaitu pertolongan dari Allah dan kemenangan yang cepat (masa berlakunya) dan sampaikanlah berita yang menggembirakan itu kepada orang-orang yang beriman.",
                            "verse 61:14": "Wahai orang-orang yang beriman! Jadikanlah diri kamu pembela-pembela (agama) Allah sebagaimana (keadaan penyokong-penyokong) Nabi Isa Ibni Mariam (ketika ia) berkata kepada penyokong-penyokongnya itu: Siapakah penolong-penolongku (dalam perjalananku) kepada Allah (dengan menegakkan agamaNya)? Mereka menjawab: Kamilah pembela-pembela (agama) Allah! (Setelah Nabi Isa tidak berada di antara mereka) maka sepuak dari kaum Bani Israil beriman dan sepuak lagi (tetap) kafir."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "آنچه در آسمانها و آنچه در زمين است همه تسبيح خدا مى‏گويند; و او شكست‏ناپذير و حكيم است!",
                            "verse 61:2": "اى كسانى كه ايمان آورده‏ايد! چرا سخنى مى‏گوييد كه عمل نمى‏كنيد؟!",
                            "verse 61:3": "نزد خدا بسيار موجب خشم است كه سخنى بگوييد كه عمل نمى‏كنيد!",
                            "verse 61:4": "خداوند كسانى را دوست مى‏دارد كه در راه او پيكار مى‏كنند گوئى بنايى آهنين‏اند!",
                            "verse 61:5": "(به ياد آوريد) هنگامى را كه موسى به قومش گفت: «اى قوم من! چرا مرا آزار مى‏دهيد با اينكه مى‏دانيد من فرستاده خدا به سوى شما هستم؟!» هنگامى كه آنها از حق منحرف شدند، خداوند قلوبشان را منحرف ساخت; و خدا فاسقان را هدايت نمى‏كند!",
                            "verse 61:6": "و (به ياد آوريد) هنگامى را كه عيسى بن مريم گفت: «اى بنى اسرائيل! من فرستاده خدا به سوى شما هستم در حالى كه تصديق‏كننده كتابى كه قبل از من فرستاده شده ( تورات) مى‏باشم، و بشارت‏دهنده به رسولى كه بعد از من مى‏آيد و نام او احمد است!» هنگامى كه او ( احمد) با معجزات و دلايل روشن به سراغ آنان آمد، گفتند: «اين سحرى است آشكار»!",
                            "verse 61:7": "چه كسى ظالمتر است از آن كس كه بر خدا دروغ بسته در حالى كه دعوت به اسلام مى‏شود؟! خداوند گروه ستمكاران را هدايت نمى‏كند!",
                            "verse 61:8": "آنان مى‏خواهند نور خدا را با دهان خود خاموش سازند; ولى خدا نور خود را كامل مى‏كند هر چند كافران خوش نداشته باشند!",
                            "verse 61:9": "او كسى است كه رسول خود را با هدايت و دين حق فرستاد تا او را بر همه اديان غالب سازد، هر چند مشركان كراهت داشته باشند!",
                            "verse 61:10": "اى كسانى كه ايمان آورده‏ايد! آيا شما را به تجارتى راهنمائى كنم كه شما را از عذاب دردناك رهايى مى‏بخشد؟!",
                            "verse 61:11": "به خدا و رسولش ايمان بياوريد و با اموال و جانهايتان در راه خدا جهاد كنيد; اين براى شما (از هر چيز) بهتر است اگر بدانيد!",
                            "verse 61:12": "(اگر چنين كنيد) گناهانتان را مى‏بخشد و شما را در باغهايى از بهشت داخل مى‏كند كه نهرها از زير درختانش جارى است و در مسكنهاى پاكيزه در بهشت جاويدان جاى مى‏دهد; و اين پيروزى عظيم است!",
                            "verse 61:13": "و (نعمت) ديگرى كه آن را دوست داريد به شما مى‏بخشد، و آن يارى خداوند و پيروزى نزديك است; و مؤمنان را بشارت ده (به اين پيروزى بزرگ)!",
                            "verse 61:14": "اى كسانى كه ايمان آورده‏ايد! ياوران خدا باشيد همان‏گونه كه عيسى بن مريم به حواريون گفت: «چه كسانى در راه خدا ياوران من هستند؟!» حواريون گفتند: «ما ياوران خدائيم‏» در اين هنگام گروهى از بنى اسرائيل ايمان آوردند و گروهى كافر شدند; ما كسانى را كه ايمان آورده بودند در برابر دشمنانشان تاييد كرديم و سرانجام بر آنان پيروز شدند!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Tudo quanto existe nos céus e na terra glorifica Deus, porque Ele é o Poderoso, o Prudentíssimo.",
                            "verse 61:2": "Ó fiéis, por que dizeis o que não fazeis?",
                            "verse 61:3": "É enormemente odioso, perante Deus, dizerdes o que não fazeis.",
                            "verse 61:4": "Em verdade, Deus aprecia aqueles que combatem, em fileiras, por Sua causa, como se fossem uma sólida muralha.",
                            "verse 61:5": "Recorda-te (ó Mensageiro) de quando Moisés disse ao seu povo: Ó povo meu, porque me injuriais, quando sabeis que sou o mensageiro de Deus, enviado a vós? Porém, quando se desviaram, Deus desviou os seus corações, porque Deus não encaminha os depravados.",
                            "verse 61:6": "E de quando Jesus, filho de Maria, disse: Ó israelitas, em verdade, sou o mensageiro de Deus, enviado a vós, corroborante de tudo quanto a Tora antecipou no tocante às predições, e alvissareiro de um Mensageiro que virá depois de mim, cujo nome será Ahmad! Entretanto, quando lhes foram apresentadas as evidências, disseram: Isto é pura magia!",
                            "verse 61:7": "Haverá alguém mais iníquo do que quem forja mentiras acerca de Deus, apesar de ter sido convocado ao Islam? Sabei que Deus não encaminha os iníquos.",
                            "verse 61:8": "Pretendem extinguir a Luz de Deus com as suas (infames) bocas; porém, Deus completará a (revelação de) Sua Luz, embora isso desgoste os incrédulos.",
                            "verse 61:9": "Foi Ele Quem enviou o Seu Mensageiro, com a orientação e com a verdadeira religião, para fazê-las prevalecer sobre toda a religião, ainda que isso desgoste os idólatras.",
                            "verse 61:10": "Ó fiéis, quereis que vos indique uma troca que vos livre de um castigo doloroso?",
                            "verse 61:11": "É que creiais em Deus e em Seu Mensageiro, e que sacrifiqueis os vossos bens e pessoas pela Sua causa.",
                            "verse 61:12": "Ele vos perdoará os pecados e vos introduzirá em jardins, abaixo dos quais correm os rios, bem como nas prazerosas moradas do Jardim do Éden.",
                            "verse 61:13": "E, ademais, conceder-vos-á outra coisa que anelais, ou seja: o socorro de Deus e o triunfo imediato.",
                            "verse 61:14": "Ó fiéis, sede os auxiliadores de Deus, como disse Jesus, filho de Maria, aos discípulos: Quem são os meus auxiliadores, na causa de Deus? Responderam: Nós somos os auxiliadores de Deus! Acreditou, então, uma parte dos israelitas, e outra desacreditou; então, socorremos os fiéis contra seus inimigos, e eles saíram vitoriosos."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 61:1": "Cele din ceruri și cele de pre pãmânt Îi aduc laudã lui Allah, cãciEl este Cel Puternic",
                            "verse 61:2": "Înțelept [Al-'Aziz, Al-Hakim].",
                            "verse 61:3": "O, voi cei care credeți! De ce spuneți voi ceea ce nu faceți?",
                            "verse 61:4": "Este [o pricinã de] mare mânie pentru Allah sã spuneți ceea ce nu faceți!",
                            "verse 61:5": "Allah îi iubește pe aceia care luptã pe calea Sa într-o linie [de luptã], de parcã ei ar fi o zidire întãritã.",
                            "verse 61:6": "[Adu-ți aminte] când Moise a zis cãtre neamul sãu: \"O, neam al meu, pentru ce mã necãjiți, când știți cã eu sunt Trimisul lui Allah lavoi?\" Și când ei s-au abãtut, Al",
                            "verse 61:7": "Și [adu-ți aminte] când Isus, fiul Mariei, a zis: \"O, fii ai lui Israel! Eu sunt trimisul lui Allah la voi, întãrind Tora de dinainte de mine și vestind un Trimis ce va veni dupã mine și al cãrui nume este Ahmad!",
                            "verse 61:8": "Și cine este mai nelegiuit decât acela care nãscocește minciunãdespre Allah, atunci când este chemat la Islam? Iar Allah nu cãlãuzește neamul de nelegiuiți.",
                            "verse 61:9": "Ei voiesc sã stingã lumina lui Allah cu gurile lor, însã Allah întregește lumina Sa, chiar dacã necredincioșii nu voiesc.",
                            "verse 61:10": "El este Cel care l-a trimis pe Trimisul Sãu cu cãlãuzirea și religiaAdevãrului, ca sã o facã pe ea deasupra întregii religii, chiar dacã politeiștii nu voiesc.",
                            "verse 61:11": "O, voi cei care credeți! Sã vã îndrum Eu cãtre un negoț care vã va mântui pe voi de un chin dureros?",
                            "verse 61:12": "Credeți voi în Allah și în Trimisul Sãu și luptați pe calea lui Allah, cu averile voastre și cu sufletele voastre, cãci acest lucru este mai bun pentru voi, dacã [voiți sã] știți!",
                            "verse 61:13": "",
                            "verse 61:14": "El vã va ierta pãcatele voastre și vã va lãsa sã intrați în Grã-dini pe sub care curg pâraie și în locuințe bune din grãdinileEdenului .",
                            "verse 61:15": "Și [vã va da vouã și] alte",
                            "verse 61:16": "care vã sunt dragi: ajutor de laAllah și o biruințã apropiatã .",
                            "verse 61:17": "O, voi cei care credeți! Fiți ajutoare pe calea lui Allah, așa cum a fost când a zis Isus, fiul Mariei, cãtre apostoli: \"Cine sunt ajutoarele mele în chemarea la Allah?\" Și i-au rãspuns apostolii: \"Noi suntem dreptcredincioșilor!"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 61:1": "Cele din ceruri şi de pe pământ îl preamăresc pe Dumnezeu.",
                            "verse 61:2": "O, voi cei ce credeţi! De ce spuneţi ceea ce nu faceţi?",
                            "verse 61:3": "Mare urâciune este pentru Dumnezeu să spuneţi ceea ce nu faceţi!",
                            "verse 61:4": "Dumnezeu îi iubeşte pe cei care luptă pe calea Sa în rânduri strânse de parcă ar fi o zidire turnată în plumb.",
                            "verse 61:5": "Moise spuse poporului său: “O, popor al meu! De ce mă chinuiţi, când ştiţi că eu sunt într-adevăr trimisul lui Dumnezeu la voi?” Atunci când s-au abătut, Dumnezeu a făcut ca inimile lor să se abată.",
                            "verse 61:6": "Iisus, fiul Mariei, spuse: “O, fii ai lui Israel! Eu sunt, într-adevăr, trimisul lui Dumnezeu la voi ca să întăresc cele în Tora de dinaintea mea şi ca să vă vestesc un trimis ce va veni după mine şi al cărui nume va fi Ahmad.",
                            "verse 61:7": "Cine este mai nedrept decât cel care Îl huleşte pe Dumnezeu, când este chemat la Supunere? Dumnezeu nu călăuzeşte poporul nedrept.",
                            "verse 61:8": "Aceştia vor să stingă cu gurile lor lumina lui Dumnezeu, însă Dumnezeu împlineşte Lumina în ciuda tăgăduitorilor.",
                            "verse 61:9": "El este Cel ce l-a trimis pe profetul Său cu călăuzirea Sa, adevărata Lege, ca să o aşeze deasupra tuturor legilor în ciuda închinătorilor la idoli.",
                            "verse 61:10": "O, voi cei ce credeţi! Vă pot arăta un negoţ care să vă mântuiască de o dureroasă osândă?",
                            "verse 61:11": "Credeţi în Dumnezeu şi în trimisul Său! Luptaţi-vă pe calea lui Dumnezeu cu averile şi făpturile voastre.",
                            "verse 61:12": "Dumnezeu vă va ierta vouă păcatele voastre şi vă va lăsa să intraţi în Grădinile pe sub care curg râuri, cu locuinţe bune, în Grădinile Edenului.",
                            "verse 61:13": "Şi vă va da ceea ce vă place: un ajutor de la Dumnezeu şi o victorie grabnică.",
                            "verse 61:14": "“O, voi cei ce credeţi! Fiţi ajutoarele lui Dumnezeu, aşa cum odinioară, Iisus, fiul Mariei a spus apostolilor: “Cine sunt ajutoarele mele pe calea lui Dumnezeu?” Apostolii au spus: “Noi suntem ajutoarele lui Dumnezeu!” Unii dintre fiii lui Israel au crezut, alţii au tăgăduit."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Все в небесах и на землеХвалу и славу воздает Аллаху,Кто мудрости и мощи преисполнен!",
                            "verse 61:2": "О вы, кто верует!Зачем вам говорить о том,Чего не делаете вы?",
                            "verse 61:3": "Аллаху крайне ненавистны те,Кто говорит о том,Чего не совершает.",
                            "verse 61:4": "Поистине, любовь Аллаха с теми,Кто на пути Его сражается единымрядом2230,Сплоченным в прочное строенье.",
                            "verse 61:5": "И (вспомните), как Мусанароду своему сказал:«Зачем обидно оскорбляете меня,Когда вы знаете,Что я, поистине, посланник от Аллахак вам?»И вот когда они от Истины Господнейуклонились,Аллах сердца их уклонил от верногопути, —Поистине, Аллах не направляетНадменных грешников по верномупути.",
                            "verse 61:6": "И (вспомните), как Иса, сын Марйам,сказал:«Сыны Исраиля!Я к вам посланник от Аллаха,Чтоб истину Закона — (Торы) —утвердить,Ниспосланного вам до моего прихода,И сообщить вам благостную Весть,Что вслед за мной придет посланник,Имя которому — Ахмад»2231.",
                            "verse 61:7": "И есть ли нечестивее того,Кто ложь возводит на Аллаха,Когда его зовут к исламу?Поистине, по верному путиАллах неправедных не направляет.",
                            "verse 61:8": "Они хотели б Свет ГосподеньСвоими (лживыми) устами погасить.",
                            "verse 61:9": "Он — Тот, Кто Своего посланникапослалИ с ним — (вам) руководство(в жизни),Религию, (что Свет Господней)Истины (несет),Чтобы явить ее превышепрочей (веры)2232,Хоть многобожникам и ненавистноэто.",
                            "verse 61:10": "О вы, кто верует!Не предложить ли вам обменный торг,Который от тяжелой кары вас избавит?",
                            "verse 61:11": "Вам — веровать в Аллахаи посланника ЕгоИ, на пути Его сражаясь,Отдать все средства и всю душу.",
                            "verse 61:12": "А Он простит вам ваши прегрешенья,В Сады введет, реками омовенны,В прекрасные дворцы садов Эдема.",
                            "verse 61:13": "А также то, что вам так мило, —Господня помощь и скорейшаяпобеда.",
                            "verse 61:14": "О вы, кто верует!Станьте помощниками (мне)на промысле Аллаха, —Как Иса, сын Марйам, сказалапостолам своим:«Кто будет мне помощникомв Господнем деле?»Апостолы сказали: «Помощникив деле Аллаха — мы!»И вот тогдаЧасть сыновей Исраиля уверовали(в Бога),Другие же — в неверии осталась."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Lo que está en los cielos y en la tierra glorifica a Alá.",
                            "verse 61:2": "¡Creyentes! ¿Por qué decís lo que no hacéis?",
                            "verse 61:3": "Alá aborrece mucho que digáis lo que no hacéis.",
                            "verse 61:4": "Alá ama a los que luchan en fila por Su causa, como si fueran un sólido edificio.",
                            "verse 61:5": "Y cuando Moisés dijo a su pueblo: «¡Pueblo! ¿Por qué me molestáis sabiendo que soy el que Alá os ha enviado?» Y, cuando se desviaron, Alá desvió sus corazones.",
                            "verse 61:6": "Y cuando Jesús, hijo de María, dijo: «¡Hijos de Israel! Yo soy el que Alá os ha enviado, en confirmación de la Tora anterior a mí, y como nuncio de un Enviado que vendrá después de mí, llamado Ahmad».",
                            "verse 61:7": "¿Hay alguien más impío que quien inventa la mentira contra Alá, siendo llamado al islam? Alá no dirige al pueblo impío.",
                            "verse 61:8": "Quisiera apagar de un soplo la Luz de Alá, pero Alá hará que resplandezca, a despecho de los infieles.",
                            "verse 61:9": "Él es Quien ha mandado a Su Enviado con la Dirección y con la religión verdadera para que prevalezca sobre toda otra religión, a despecho de los asociadores.",
                            "verse 61:10": "¡Creyentes! ¿Queréis que os indique un negocio que os librará de un castigo doloroso?:",
                            "verse 61:11": "¡Creed en Alá y en Su Enviado y combatid por Alá con vuestra hacienda y vuestras personas! Es mejor para vosotros.",
                            "verse 61:12": "Así, os perdonará vuestros pecados y os introducirá en jardines por cuyos bajos fluyen arroyos y en viviendas agradables en los jardines del edén.",
                            "verse 61:13": "Y otra cosa, que amaréis: el auxilio de Alá y un éxito cercano.",
                            "verse 61:14": "¡Creyentes! Sed los auxiliares de Alá como cuando Jesús, hijo de María, dijo a los apóstoles: «¿Quiénes son mis auxiliares en la vía que lleva a Alá?» Los apóstoles dijeron: «Nosotros somos los auxiliares de Alá»."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "வானங்களிலுள்ளவையும், பூமியிலுள்ளவையும் அல்லாஹ்வை தஸ்பீஹு (துதி) செய்து கொண்டிருக்கின்றன அவன் யாவரையும் மிகைத்தவன், ஞானம் மிக்கவன்.",
                            "verse 61:2": "ஈமான் கொண்டவர்களே! நீங்கள் செய்யாததை ஏன் சொல்கிறீர்கள்?",
                            "verse 61:3": "நீங்கள் செய்யாததை நீங்கள் கூறுவது அல்லாஹ்விடம் பெரிதும் வெறுப்புடையதாக இருக்கிறது.",
                            "verse 61:4": "எவர்கள் ஈயத்தால் வார்க்கப்பட்ட கெட்டியான கட்டடத்தைப் போல் அணியில் நின்று, அல்லாஹ்வுடைய பாதையை போரிடுகிறார்களோ, அவர்களை நிச்சயமாக (அல்லாஹ்) நேசிக்கின்றான்.",
                            "verse 61:5": "மேலும், மூஸா தம் சமூகத்தாரிடம்; \"என் சமூகத்தாரே! நிச்சயமாக நான், உங்களிடம் அனுப்பப்பட்ட அல்லாஹ்வின் தூதன் என்பதை நீங்கள் திடமாக அறிந்து கொண்டே, ஏன் என்னை துன்புறுத்துகிறீர்கள்?\" என்று கூறிய வேளையை (நபியே! நீர் நினைவு கூர்வீராக); ஆகவே ஆவர்கள் (நேர்வழியிலிருந்து) சருகிய பொழுது, அல்லாஹ் அவர்களுடைய இருதயங்களை (நேர்வழியிலிருந்து) சருகச் செய்தான்.",
                            "verse 61:6": "மேலும், மர்யமின் குமாரர் ஈஸா, \"இஸ்ராயீல் மக்களே! எனக்கு முன்னுள்ள தவ்ராத்தை மெய்ப்பிப்பவனாகவும்; எனக்குப் பின்னர் வரவிருக்கும் 'அஹமது' என்னும் பெயருடைய தூதரைப் பற்றி நன்மாராயம் கூறுபவனாகவும் இருக்கும் நிலையில் அல்லாஹ்வின் தூதனாக உங்களிடம் வந்துள்ளேன்\" என்று கூறிய வேளையை (நபியே! நீர் நினைவு கூர்வீராக!) எனினும், அவர்களிடம் தெளிவான அத்தாட்சிகளை அவர் கொண்டு வந்த போது, அவர்கள் \"இது தெளிவான சூனியமாகும்\" என்று கூறினார்கள்.",
                            "verse 61:7": "மேலும், எவன் இஸ்லாத்தின் பால் அழைக்கப்பட்ட நிலையில், அல்லாஹ்வின் மீது பொய்யை இட்டுக் கட்டுகிறானோ அவனைவிட அநியாயக்காரன் யார்? அன்றியும், அநியாயக்கார சமூகத்தாரை அல்லாஹ் நேர்வழியில் செலுத்த மாட்டான்.",
                            "verse 61:8": "அவர்கள் அல்லாஹ்வின் ஒளியைத் தம் வாய்களைக் கொண்டு (ஊதி) அணைத்து விட நாடுகின்றனர், ஆனால் காஃபிர்கள் வெறுத்த போதிலும், அல்லாஹ் தன் ஒளியைப் பூரணமாக்கியே வைப்பான்.",
                            "verse 61:9": "(இணை வைத்து வணங்கும்) முஷ்ரிக்குகள் வெறுத்த போதிலும், மற்ற எல்லா மார்க்கங்களையும் மிகைக்கும் பொருட்டு, அவனே தன் தூதரை நேர்வழியுடனும், சத்திய மார்க்கத்துடனும் அனுப்பினான்.",
                            "verse 61:10": "ஈமான் கொண்டவர்களே! நோவினை செய்யும் வேதனையிலிருந்து உங்களை ஈடேற்றவல்ல ஒரு வியாபாரத்தை நான் உங்களுக்கு அறிவிக்கட்டுமா?",
                            "verse 61:11": "(அது) நீங்கள் அல்லாஹ்வின் மீதும் அவன் தூதர் மீதும் ஈமான் கொண்டு, உங்கள் பொருள்களையும், உங்கள் உயிர்களையும் கொண்டு அல்லாஹ்வின் பதையில் ஜிஹாது (அறப்போர்) செய்வதாகும்; நீங்கள் அறிபவர்களா இருப்பின், இதுவே உங்களுக்கு மிக மேலான நன்மையுடையதாகும்.",
                            "verse 61:12": "அவன் உங்களுக்கு உங்கள் பாவங்களை மன்னிப்பான், சுவனபதிகளில் உங்களை பிரவேசிக்கச் செய்வான்; அவற்றின் கீழே ஆறுகள் ஓடிக்கொண்டிருக்கும், அன்றியும், நிலையான அத்னு என்னும் சுவர்க்கச் சோலைகளின் மணம் பொருந்திய இருப்பிடங்களும் (உங்களுக்கு) உண்டு; இதுவே மகத்தான பாக்கியமாகும்.",
                            "verse 61:13": "அன்றியும் நீங்கள் நேசிக்கும் வேறொன்றும் உண்டு, (அதுதான்) அல்லாஹ்விடமிருந்து உதவியும், நெருங்கி வரும் வெற்றியுமாகும், எனவே ஈமான் கொண்டவர்களுக்கு (இதைக் கொண்டு) நன்மாராயம் கூறுவீராக!",
                            "verse 61:14": "ஈமான் கொண்டவர்களே! மர்யமின் குமாரர் ஈஸா (தம்) சீடர்களை நோக்கி, \"அல்லாஹ்வுக்காக எனக்கு உதவி செய்வோர் யார்?\" எனக் கேட்க, சீடர்கள், \"நாங்கள் அல்லாஹ்வின் உதவியாளர்களாக இருக்கின்றோம்\" என்று கூறியதுபோல், நீங்கள் அல்லாஹ்வின் உதவியாளர்களாக ஆகிவிடுங்கள் - எனினும், இஸ்ராயீல் மக்களில் ஒரு கூட்டம் ஈமான் கொண்டது, பிறிதொரு கூட்டமோ நிராகரித்தது, ஆகவே ஈமான் கொண்டவர்களுக்கு, அவர்களுடைய பகைவர்களுக்கு எதிராக உதவி அளித்தோம் - அதனால் அவர்கள் வெற்றியாளராய் ஆகிவிட்டார்கள்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "สิ่งที่อยู่ในชั้นฟ้าทั้งหลายและสิ่งที่อยู่ในแผ่นดินจ่างแซ่ซ้องสดุดีแด่อัลลอฮ์ และพระองค์เป็นผู้ทรงอำนาจ ผู้ทรงปรีชาญาณ",
                            "verse 61:2": "โอ้บรรดาผู้ศรัทธาเอ๋ย ทำไมพวกเจ้าจึงกล้าพูดในสิ่งที่พวกเจ้าไม่ปฏิบัติ",
                            "verse 61:3": "เป็นที่น่าเกลียดยิ่งที่อัลลอฮ์ การที่พวกเจ้าพูดในสิ่งที่พวกเจ้าไม่ปฏิบัติ",
                            "verse 61:4": "แท้จริงอัลลอฮ์ทรงรักบรรดาผู้ที่ต่อสู้ในทางของพระองค์เป็นแถวเดียวกัน ประหนึ่งพวกเขาเป็นอาคารที่ยึดมั่นแข็งแรง",
                            "verse 61:5": "และจงรำลึกเมื่อมูซาได้กล่าวแก่หมู่ชนของเขาว่า โอ้หมู่ชนของฉันเอ๋ย ทำไมพวกท่านจึงทำร้ายฉัน และแน่นอนพวกท่านรู้แล้วมิใช่หรือว่า แท้จริงฉันเป็นร่อซู้ลของอัลลอฮ์มายังพวกท่าน ดังนั้น เมื่อพวกเขาหันเหไป (จากแนวทางที่เที่ยงตรง) อัลลอฮ์ก็ทรงทำให้หัวใจของพวกเขาหันเหออกไป และอัลลอฮ์นั้นจะไม่ชี้แนะทางที่ถูกต้องแก่หมู่ชนผู้ฝ่าฝืน",
                            "verse 61:6": "และจงรำลึก เมื่ออีซา อิบนิมัรยัม ได้กล่าวว่า โอ้วงศ์วานอิสรออีลเอ๋ย แท้จริงฉันเป็นร่อซู้ลของอัลลอฮ์มายังพวกท่าน เป็นผู้ยืนยันสิ่งที่มีอยู่ในเตารอฮ์ก่อนหน้าฉัน และเป็นผู้แจ้งข่าวดีถึงร่อซู้ลคนหนึ่ง ผู้จะมาภายหลังฉัน ชื่อของเขาคือ อะหมัด ครั้นเมื่อเขา (อะหมัด) ได้มายังพวกเขาพร้อมด้วยหลักฐานอันชัดแจ้งแล้ว พวกเขากล่าวว่า นี่คือมายากลแท้ ๆ",
                            "verse 61:7": "และผู้ใดเล่าจะอธรรมยิ่งกว่าผู้กล่าวเท็จต่ออัลลอฮ์ด้วยปากของพวกเขา ขณะที่เขาถูกเชิญชวนสู่อิสลาม และอัลลอฮ์นั้นจะไม่ชี้แนะทางที่ถูกต้องแก่หมู่ชนผู้อธรรม",
                            "verse 61:8": "พวกเขาปรารถนาที่จะดับรัศมีของอัลลอฮ์ด้วยปากของพวกเขา แต่อัลลอฮ์เป็นผู้ทำให้รัศมีของพระองค์สมบูรณ์ แม้ว่าพวกปฏิเสธศณัทธาจะเกลียดชังก็ตาม",
                            "verse 61:9": "พระองค์คือผู้ทรงส่งร่อซู้ลของพระองค์ด้วยการชี้นำทางและศาสนาแห่งสัจธรรม เพื่อพระองค์จะทรงให้ศาสนาอิสลามอยู่เหนือศาสนาทั้งมวล ถึงแม้พวกตั้งภาคีจะเกลียดชังก็ตาม",
                            "verse 61:10": "โอ้บรรดาผู้ศรัทธาเอ๋ย ข้าจะชี้แนะแนวทางแก่พวกเจ้าไหมเล่า ถึงการค้าที่จะช่วยพวกเจ้าให้พ้นจากการลงโทษอันเจ็บปวด",
                            "verse 61:11": "นั่นคือ พวกเจ้าต้องศรัทธาต่ออัลลอฮ์และร่อซู้ลของพระองค์ และต่อสู้ดิ้นรนในทางอัลลอฮ์ ด้วยทรัพย์สินของพวกเจ้าและชีวิตของพวกเจ้า นั่นเป็นการดียิ่งสำหรับพวกเจ้าหากพวกเจ้ารู้",
                            "verse 61:12": "พระองค์จะทรงอภัยให้แก่พวกเจ้า ซึ่งการทำบาปของพวกเจ้า และจะทรงให้พวกเจ้าเข้าในสวนสวรรค์หลากหลาย มีลำน้ำหลายสายไหลผ่าน ณ เบื้องล่างของสวนสวรรค์ และที่พำนักอันบรมสุขในสวนสวรรค์หลากหลายอันสถาพร นั่นคือชัยชนะอันใหญ่หลวง",
                            "verse 61:13": "และสิ่งอื่น ๆ อีกที่พวกเจ้ารักชอบมัน การช่วยเหลือจากอัลลอฮ์ และการพิชิตอันใกล้นี้ และจงแจ้งข่าวดีแด่บรรดาผู้ศรัทธาเถิด",
                            "verse 61:14": "โอ้บรรดาผู้ศรัทธาเอ๋ย! จงเป็นผู้ช่วยเหลือในทางของอัลลอฮ์ ดังเช่นอีซา อิบน มัรยัม ได้กล่าวแก่บรรดาสาวกว่า ผู้ใดจะเป็นผู้ช่วยเหลือฉันไปยังอัลลอฮ์บ้าง? บรรดาสาวกได้กล่าวว่า พวกเราเป็นผู้ช่วยเหลือในทางของอัลลอฮ์ ดังนั้น กลุ่มหนึ่งจากวาศวานของอิสรออีลได้ศรัทธา และอีกกลุ่มหนึ่งได้ปฏิเสธศรัทธา แต่เราได้ช่วยเสริมกำลังแก่บรรดาผู้ศรัทธาให้เหนือกว่าศัตรูของพวกเขา แล้วพวกเขาก็กลายเป็นผู้มีชัยชนะ"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Göklerde ve yerdekilerin hepsi Allah'ı tesbih eder.",
                            "verse 61:2": "Ey iman edenler! Yapmayacağınız şeyleri niçin söylüyorsunuz?",
                            "verse 61:3": "Yapmayacağınız şeyleri söylemeniz, Allah katında büyük bir nefretle karşılanır.",
                            "verse 61:4": "Allah, kendi yolunda kenetlenmiş bir yapı gibi saf bağlayarak savaşanları sever.",
                            "verse 61:5": "Bir zaman Musa kavmine: Ey kavmim! Benim, Allah'ın size gönderdiği elçisi olduğumu bildiğiniz halde niçin beni incitiyorsunuz? demişti.",
                            "verse 61:6": "Hatırla ki, Meryem oğlu İsa: Ey İsrailoğulları! Ben size Allah'ın elçisiyim, benden önce gelen Tevrat'ı doğrulayıcı ve benden sonra gelecek Ahmed adında bir peygamberi de müjdeleyici olarak geldim, demişti.",
                            "verse 61:7": "İslâm'a çağırıldığı halde Allah'a karşı yalan uydurandan daha zalim kim olabilir! Allah, zalimler topluluğunu doğru yola erdirmez.",
                            "verse 61:8": "Onlar ağızlarıyla Allah'ın nûrunu söndürmek istiyorlar.",
                            "verse 61:9": "Müşrikler istemeseler de dinini bütün dinlere üstün kılmak için Peygamberini hidayet ve hak ile gönderen O'dur.",
                            "verse 61:10": "Ey iman edenler! Sizi acı bir azaptan kurtaracak ticareti size göstereyim mi?",
                            "verse 61:11": "Allah'a ve Resûlüne inanır, mallarınızla ve canlarınızla Allah yolunda cihad edersiniz.",
                            "verse 61:12": "İşte bu takdirde O, sizin günahlarınızı bağışlar, sizi zemininden ırmaklar akan cennetlere, Adn cennetlerindeki güzel meskenlere koyar.",
                            "verse 61:13": "Seveceğiniz başka bir şey daha var: Allah'tan yardım ve yakın bir fetih.",
                            "verse 61:14": "Ey iman edenler! Allah'ın yardımcıları olun."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "جو چیز آسمانوں میں ہے اور زمین میں ہے سب خدا کی تنزیہ کرتی ہے اور وہ غالب حکمت والا ہے",
                            "verse 61:2": "جو کچھ آسمانوں ميں ہے اور جو کچھ زمين ميں ہے (سب) اللہ کي تسبيح کرتے ہيں، اور وہ بڑي عزت و غلبہ والا بڑي حکمت والا ہےo",
                            "verse 61:3": "اے ايمان والو! تم وہ باتيں کيوں کہتے ہو جو تم کرتے نہيں ہوo",
                            "verse 61:4": "مومنو! تم ایسی باتیں کیوں کہا کرتے ہو جو کیا نہیں کرتے",
                            "verse 61:5": "خدا اس بات سے سخت بیزار ہے کہ ایسی بات کہو جو کرو نہیں",
                            "verse 61:6": "اللہ کے نزديک بہت سخت ناپسنديدہ بات يہ ہے کہ تم وہ بات کہو جو خود نہيں کرتےo",
                            "verse 61:7": "بيشک اللہ ان لوگوں کو پسند فرماتا ہے جو (دہشت گردي اور بربريت کے خاتمے، قيام امن اور تکريم انسانيت کے لئے) اُس کي راہ ميں (يوں) صف بستہ ہو کر لڑتے ہيں گويا وہ سيسہ پلائي ہوئي ديوار ہوںo",
                            "verse 61:8": "جو لوگ خدا کی راہ میں (ایسے طور پر) پرے جما کر لڑتے کہ گویا سیسہ پلائی دیوار ہیں وہ بیشک محبوب کردگار ہیں",
                            "verse 61:9": "اور وہ وقت یاد کرنے کے لائق ہے جب موسیٰ نے اپنی قوم سے کہا کہ اے قوم! تم مجھے کیوں ایذا دیتے ہو حالانکہ تم جانتے ہو کہ میں تمہارے پاس خدا کا بھیجا ہوا آیا ہوں۔ تو جب ان لوگوں نے کج روی کی خدا نے بھی ان کے دل ٹیڑھے کردیئے۔ اور خدا نافرمانوں کو ہدایت نہیں دیتا",
                            "verse 61:10": "اور (اے حبيب! وہ وقت ياد کيجئے) جب موس?ي (عليہ السلام) نے اپني قوم سے کہا: اے ميري قوم! تم مجھے اذيت کيوں ديتے ہو حالانکہ تم جانتے ہو کہ ميں تمہاري طرف اللہ کا بھيجا ہوا (رسول) ہوں? پھر جب انہوں نے کج روي جاري رکھي تو اللہ نے اُن کے دلوں کو ٹيڑھا کر ديا، اور اللہ نافرمان لوگوں کو ہدايت نہيں فرماتاo",
                            "verse 61:11": "اور (وہ وقت بھي ياد کيجئے) جب عيس?ي بن مريم (عليہما السلام) نے کہا: اے بني اسرائيل! بيشک ميں تمہاري طرف اللہ کا بھيجا ہوا (رسول) ہوں، اپنے سے پہلي کتاب تورات کي تصديق کرنے والا ہوں اور اُس رسولِ (معظّم صلي اللہ عليہ وآلہ وسلم کي آمد آمد) کي بشارت سنانے والا ہوں جو ميرے بعد تشريف لا رہے ہيں جن کا نام (آسمانوں ميں اس وقت) احمد (صلي اللہ عليہ وآلہ وسلم) ہے، پھر جب وہ (رسولِ آخر الزماں صلي اللہ عليہ وآلہ وسلم) واضح نشانياں لے کر اُن کے پاس تشريف لے آئے تو وہ کہنے لگے: يہ تو کھلا جادو ہےo",
                            "verse 61:12": "اور (وہ وقت بھی یاد کرو) جب مریم کے بیٹے عیسیٰ نے کہا کے اے بنی اسرائیل میں تمہارے پاس خدا کا بھیجا ہوا آیا ہوں (اور) جو (کتاب) مجھ سے پہلے آچکی ہے (یعنی) تورات اس کی تصدیق کرتا ہوں اور ایک پیغمبر جو میرے بعد آئیں گے جن کا نام احمد ہوگا ان کی بشارت سناتا ہوں۔ (پھر) جب وہ ان لوگوں کے پاس کھلی نشانیاں لے کر آئے تو کہنے لگے کہ یہ تو صریح جادو ہے",
                            "verse 61:13": "اور اس سے ظالم کون کہ بلایا تو جائے اسلام کی طرف اور وہ خدا پر جھوٹ بہتان باندھے۔ اور خدا ظالم لوگوں کو ہدایت نہیں دیا کرتا",
                            "verse 61:14": "اور اس شخص سے بڑھ کر ظالم کون ہو سکتا ہے جو اللہ پر جھوٹا بہتان باندھے حالانکہ اسے اسلام کي طرف بلايا جا رہا ہو، اور اللہ ظالم لوگوں کو ہدايت نہيں فرماتاo",
                            "verse 61:15": "يہ (منکرينِ حق) چاہتے ہيں کہ وہ اللہ کے نور کو اپنے منہ (کي پھونکوں) سے بجھا ديں، جبکہ اللہ اپنے نور کو پورا فرمانے والا ہے اگرچہ کافر کتنا ہي ناپسند کريںo",
                            "verse 61:16": "یہ چاہتے ہیں کہ خدا کے (چراغ) کی روشنی کو منہ سے (پھونک مار کر) بجھا دیں۔ حالانکہ خدا اپنی روشنی کو پورا کرکے رہے گا خواہ کافر ناخوش ہی ہوں",
                            "verse 61:17": "وہی تو ہے جس نے اپنے پیغمبر کو ہدایت اور دین حق دے کر بھیجا تاکہ اسے اور سب دینوں پر غالب کرے خواہ مشرکوں کو برا ہی لگے",
                            "verse 61:18": "وہي ہے جس نے اپنے رسول (صلي اللہ عليہ وآلہ وسلم) کو ہدايت اور دينِ حق دے کر بھيجا تاکہ اسے سب اديان پر غالب و سربلند کردے خواہ مشرک کتنا ہي ناپسند کريںo",
                            "verse 61:19": "اے ايمان والو! کيا ميں تمہيں ايک ايسي تجارت بتا دوں جو تم کو دردناک عذاب سے بچا لے؟o",
                            "verse 61:20": "مومنو! میں تم کو ایسی تجارت بتاؤں جو تمہیں عذاب الیم سے مخلصی دے",
                            "verse 61:21": "(وہ یہ کہ) خدا پر اور اس کے رسول پر ایمان لاؤ اور خدا کی راہ میں اپنے مال اور جان سے جہاد کرو۔ اگر سمجھو تو یہ تمہارے حق میں بہتر ہے",
                            "verse 61:22": "(وہ يہ ہے کہ) تم اللہ پر اور اُس کے رسول (صلي اللہ عليہ وآلہ وسلم) پر (کامل) ايمان رکھو اور اللہ کي راہ ميں اپنے مال و جان سے جہاد کرو، يہي تمہارے حق ميں بہتر ہے اگر تم جانتے ہوo",
                            "verse 61:23": "وہ تمہارے گناہوں کو بخش دے گا اور تمہيں جنتوں ميں داخل فرمائے گا جن کے نيچے سے نہريں جاري ہوں گي اور نہايت عمدہ رہائش گاہوں ميں (ٹھہرائے گا) جو جناتِ عدن (يعني ہميشہ رہنے کي جنتوں) ميں ہيں، يہي زبردست کاميابي ہےo",
                            "verse 61:24": "وہ تمہارے گناہ بخش دے گا اور تم کو باغہائے جنت میں جن میں نہریں بہہ رہیں ہیں اور پاکیزہ مکانات میں جو بہشت ہائے جاودانی میں (تیار) ہیں داخل کرے گا۔ یہ بڑی کامیابی ہے",
                            "verse 61:25": "اور ایک اور چیز جس کو تم بہت چاہتے ہو (یعنی تمہیں) خدا کی طرف سے مدد (نصیب ہوگی) اور فتح عنقریب ہوگی اور مومنوں کو (اس کی) خوشخبری سنا دو",
                            "verse 61:26": "اور (اس اُخروي نعمت کے علاوہ) ايک دوسري (دنيوي نعمت بھي عطا فرمائے گا) جسے تم بہت چاہتے ہو، (وہ) اللہ کي جانب سے مدد اور جلد ملنے والي فتح ہے، اور (اے نبئ مکرّم!) آپ مومنوں کو خوشخبري سنا ديں (يہ فتحِ مکہ اور فارس و روم کي فتوحات کي شکل ميں ظاہر ہوئي)o",
                            "verse 61:27": "اے ايمان والو! تم اللہ کے مددگار بن جاؤ جيسا کہ عيس?ي ابن مريم (عليہما السلام) نے (اپنے) حواريوں سے کہا تھا: اللہ کي (راہ کي) طرف ميرے مددگار کون ہيں؟ حواريوں نے کہا: ہم اللہ کے مددگار ہيں? پس بني اسرائيل کا ايک گروہ ايمان لے آيا اور دوسرا گروہ کافر ہوگيا، سو ہم نے اُن لوگوں کي جو ايمان لے آئے تھے اُن کے دشمنوں پر مدد فرمائي پس وہ غالب ہوگئےo",
                            "verse 61:28": "مومنو! خدا کے مددگار بن جاؤ جیسے عیسیٰ ابن مریم نے حواریوں سے کہا کہ بھلا کون ہیں جو خدا کی طرف (بلانے میں) میرے مددگار ہوں۔ حواریوں نے کہا کہ ہم خدا کے مددگار ہیں۔ تو بنی اسرائیل میں سے ایک گروہ تو ایمان لے آیا اور ایک گروہ کافر رہا۔ آخر الامر ہم نے ایمان لانے والوں کو ان کے دشمنوں کے مقابلے میں مدد دی اور وہ غالب ہوگئے ہوگئےo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 61:1": "Осмонлару ердаги барча нарсалар Аллоҳга тасбиҳ айтадир.",
                            "verse 61:2": "Эй иймон келтирганлар! Нима учун қилмаган нарсангизни гапирасиз.",
                            "verse 61:3": "Қилмаган нарсангизни гапиришингиз Аллоҳнинг наздида қаттиқ ёмон кўрилгандир.",
                            "verse 61:4": "Албатта, Аллоҳ Ўз йўлида худди жипс бинодек бўлиб, сафда туриб уруш қиладиганларни яхши кўрадир.",
                            "verse 61:5": "Мусо ўз қавмига: «Эй қавмим, Аллоҳнинг Расули эканимни билиб туриб, яна нима учун менга озор берасиз», деганини эсла.",
                            "verse 61:6": "Ийсо ибн Мариям: «Эй Бани Исроил, албатта, мен ўзимдан олдин келган Тавротни тасдиқловчи ва мендан кейин келувчи Аҳмад исмли Расулнинг башоратини берувчи, Аллоҳ сизларга юборган Пайғамбарман», деганини эсла.",
                            "verse 61:7": "Исломга даъват қилиниб турганда Аллоҳга нисбатан ёлғон тўқиган кимсадан ҳам золимроқ киши борми? Ҳолбуки.",
                            "verse 61:8": "Оғизлари билан Аллоҳнинг нурини ўчирмоқчи бўлурлар.",
                            "verse 61:9": "У зот, Ўз Расулини ҳидоят ва ҳақ дин билан барча динлардан устун қилиш учун юборган зотдир.",
                            "verse 61:10": "Эй иймон келтирганлар! Сизларни аламли азобдан нажот топтирувчи тижоратга далолат қилайми?",
                            "verse 61:11": "Аллоҳга ва Унинг Расулига иймон келтирасизлар ҳамда Унинг йўлида молингиз ва жонингиз билан жиҳод қиласизлар.",
                            "verse 61:12": "Ана шунда, У зот гуноҳларингизни кечирур ва сизларни адн жаннатидаги остидан анҳорлар оқиб турган боғларга ва яхши масканларга киритур.",
                            "verse 61:13": "Ва сизлар яхши кўрадиган бошқаси ҳам бор.",
                            "verse 61:14": "Эй иймон келтирганлар! Аллоҳнинг ёрдамчилари бўлинг! Худди Ийсо ибн Марям ҳаворийларга: «Ким Аллоҳ учун менинг ёрдамчим» деганида, ҳаворийлар: «Биз Аллоҳнинг ёрдамчиларимиз», деганларидек."
                        }
                    }
                }
            }
        }
    }
}