{
    "surah_name": "At-Talâq",
    "surah_name_ar": "الطلاق",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 65:1": "O profet! Kur t’i lëshoni gratë, lëshoni në kohën e tyre të caktuar (Id-detit) dhe llogaritni kohën e pritjes dhe durajuni Perëndisë, Zotit tuaj.",
                            "verse 65:2": "Dhe, deri sa të arrijë afati i caktuar, ju mbani ato në mënyrë të arsyeshme, ose ndahuni me to në mënyrë të pëlqyeshme dhe merrni dy dëshmitarë të drejtë prej jush dhe zbatoni dëshminë (e plotë) për Zotin e Madhërueshëm! Kjo është këshillë për ata që i besojnë Perëndisë dhe Ditës së Kijametit, e kush i dron Perëndisë, Ai i bënë rrugëdalje atij,",
                            "verse 65:3": "dhe e furnizon atë prej nga nuk e pret; kushdo që mbështetet te Perëndia, Ai i mjafton atij.",
                            "verse 65:4": "E ato gra tuaja, të cilat kanë humbur shpresën për ciklin e tyre (të grave), nëse dyshoni (për këtë): koha e tyre e pritjes është tre muaj, si dhe tek ato që nuk kanë pasur ciklin mujor të femrave.",
                            "verse 65:5": "Ja, këto janë dispozitat e Perëndisë që u ka shpallur juve, e ai që i druan Perëndisë, Ai (Perëndia) ia shlyen atij veprat e këqia dhe ia rritë atij shpërblimin.",
                            "verse 65:6": "Leni ato të banojnë aty ku banoni edhe ju, sipas mundësive tuaja, dhe mos ju bëni vështirësi atyre, për t’i detyruar (që të dalin).",
                            "verse 65:7": "Le të shpenzojë pasaniku sipas pasurisë që ka, por ai që ekonomikisht ka mungesa, le të shpenzojë nga e dhëna e Perëndisë; Perëndia nuk e ngarkon askë (më tepër) se sa i ka dhënë.",
                            "verse 65:8": "Shumë vendbanime u janë larguar urdhërave të Zotit të vet dhe profetëve të Tij; Ne, do të kërkojmë prej tyre llogari precize dhe do t’i dënojmë me dënim të ashpër.",
                            "verse 65:9": "Ata e kanë shijuar dënimin e veprave të tyre, dhe fundi i tyre ka qenë shkatërrim.",
                            "verse 65:10": "Perëndia ka përgatitë për ta dënim të rëndë, prandaj druajuni Perëndisë (mos e kundërshtoni), o njerëz mentarë, ju që keni besuar.",
                            "verse 65:11": "një Profet, i cili ju shpjegon argumentet e qarta, për t’i nxjerrë ata që besojnë dhe punojnë vepra të mira, nga errësira në dritë.",
                            "verse 65:12": "Perëndia është Ai, i cili ka krijuar shtatë qiej dhe aq pjesë të tokës; në to zbatohen urdhërat e Tij, për ta ditur ju, që Perëndia është i Plotëfuqishëm dhe se, me të vërtetë, dijenia e Perëndisë i ka përfshirë të gjitha! mrekullueshëm."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "(Ya Peyğəmbər!) ?vrətləri boşadığınız zaman onları gözləmə müddətlərində (heyzdən pak olduqdan sonra) boşayın.",
                            "verse 65:2": "Bunların (bu qadınların) gözləmə müddəti başa çatdıqda (barışmaq istəsəniz) onları yaxşılıqla (mehrlərini verib) yola salın.",
                            "verse 65:3": "Və ona gözləmədiyi yerdən ruzi verər.",
                            "verse 65:4": "(Yaşa dolmaqla) heyzdən kəsilmiş qadınlarınız (onların gözləmə müddəti) barədə şübhə etsəniz, (bilin ki) onların və həmçinin (yaşları müsaid olmadığı üçün) hələ heyz görməmiş olanların (heyz görməmiş gənc övrətlərinizin) gözləmə müddəti üç aydır (bu müddət başa çatdıqdan sonra başqası ilə evlənə bilərlər).",
                            "verse 65:5": "Bu, Allahın sizə nazil etdiyi buyuruğudur.",
                            "verse 65:6": "Onları (boşadığınız, lakin gözləmə müddətləri sona yetməmiş qadınları) imkanınız çatdığı qədər öz yaşadığınız yerdə sakin edin.",
                            "verse 65:7": "Varlı-karlı olan öz varına görə (süd haqqı) versin.",
                            "verse 65:8": "Neçə-neçə məmləkət (əhli) öz Rəbbinin və Onun peyğəmbərinin əmrindən çıxdı.",
                            "verse 65:9": "Onlar əməllərinin cəzasını aldılar və axırda işləri ziyana uğramaq oldu.",
                            "verse 65:10": "Allah onlar üçün şiddətli əzab hazırladı.",
                            "verse 65:11": "Və iman gətirib yaxşı işlər görənləri zülmətdən nura (küfrdən imana) çıxartmaq üçün Allahın açıq-aşkar (halal-haramı bəyan edən) ayələrini sizə oxuyan bir peyğəmbər göndərmişdir.",
                            "verse 65:12": "Yeddi (qat) göyü və bir o qədər də yeri yaradan Allahdır."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "O Vjerovjesniče, kada htjednete žene pustiti, vi ih u vrijeme kada su čiste pustite, a onda vrijeme koje treba proći brojte i Allaha, Gospodara svoga, bojte se.",
                            "verse 65:2": "I dok traje vrijeme određeno za čekanje, vi ih ili na lijep način zadržite ili se velikodušno od njih konačno rastavite i kao svjedoke dvojicu vaših pravednih ljudi uzmite, i svjedočenje Allaha radi obavite! To je s",
                            "verse 65:3": "i opskrbiće ga odakle se i ne nada; onome koji se u Allaha uzda, On mu je dosta.",
                            "verse 65:4": "A one žene vaše koje su nadu u mjesečno pranje izgubile i one koje ga nisu ni dobile, one trebaju čekati tri mjeseca,",
                            "verse 65:5": "To su, eto, Allahovi propisi, koje vam On objavljuje.",
                            "verse 65:6": "Njih ostavite da stanuju tamo gdje i vi stanujete, prema svojim mogućnostima, i ne činite im teškoće zato da biste ih stijesnili.",
                            "verse 65:7": "Neka imućan prema bogatstvu svome troši, a onaj koji je u oskudici - prema tome koliko mu je Allah dao, jer Allah nikoga ne zadužuje više nego što mu je dao; Allah će, sigurno, poslije tegobe last dati.",
                            "verse 65:8": "A koliko se sela i gradova oglušilo o naređenje Gospodara njihova i poslanika Njegovih; Mi ćemo od njih zatražiti da nam potanko račun polože i užasnom kaznom ćemo ih kazniti;",
                            "verse 65:9": "oni će pogubnost postupaka svojih iskusiti i propast će njihov kraj biti.",
                            "verse 65:10": "Allah je za njih neizdržljivu patnju pripremio, zato se bojte Allaha, o vi koji ste razumom obdareni, vi koji vjerujete! Allah vam je već poslao slavu,",
                            "verse 65:11": "Poslanika, koji vam Allahove ajete jasne kazuje, da bi iz tmina na svjetlo izveo one koji vjeruju i dobra djela čine.",
                            "verse 65:12": "Allah je sedam nebesa i isto toliko zemalja stvorio; Njegovo naređenje na sve se njih odnosi, a nek znate da je Allah kadar sve i da Allah znanjem Svojim sve obuhvaća! rijek"
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "হে নবী, তোমরা যখন স্ত্রীদেরকে তালাক দিতে চাও, তখন তাদেরকে তালাক দিয়ো ইদ্দতের প্রতি লক্ষ্য রেখে এবং ইদ্দত গণনা করো। তোমরা তোমাদের পালনকর্তা আল্লাহকে ভয় করো। তাদেরকে তাদের গৃহ থেকে বহিস্কার করো না এবং তারাও যেন বের না হয় যদি না তারা কোন সুস্পষ্ট নির্লজ্জ কাজে লিপ্ত হয়। এগুলো আল্লাহর নির্ধারিত সীমা। যে ব্যক্তি আল্লাহর সীমালংঘন করে, সে নিজেরই অনিষ্ট করে। সে জানে না, হয়তো আল্লাহ এই তালাকের পর কোন নতুন উপায় করে দেবেন।",
                            "verse 65:2": "অতঃপর তারা যখন তাদের ইদ্দতকালে পৌঁছে, তখন তাদেরকে যথোপযুক্ত পন্থায় রেখে দেবে অথবা যথোপযুক্ত পন্থায় ছেড়ে দেবে এবং তোমাদের মধ্য থেকে দু’জন নির্ভরযোগ্য লোককে সাক্ষী রাখবে। তোমরা আল্লাহর উদ্দেশ্যে সাক্ষ্য দিবে। এতদ্দ্বারা যে ব্যক্তি আল্লাহ ও পরকালে বিশ্বাস করে, তাকে উপদেশ দেয়া হচ্ছে। আর যে আল্লাহকে ভয় করে, আল্লাহ তার জন্যে নিস্কৃতির পথ করে দেবেন।",
                            "verse 65:3": "এবং তাকে তার ধারণাতীত জায়গা থেকে রিযিক দেবেন। যে ব্যক্তি আল্লাহর উপর ভরসা করে তার জন্যে তিনিই যথেষ্ট। আল্লাহ তার কাজ পূর্ণ করবেন। আল্লাহ সবকিছুর জন্যে একটি পরিমাণ স্থির করে রেখেছেন।",
                            "verse 65:4": "তোমাদের স্ত্রীদের মধ্যে যাদের ঋতুবর্তী হওয়ার আশা নেই, তাদের ব্যাপারে সন্দেহ হলে তাদের ইদ্দত হবে তিন মাস। আর যারা এখনও ঋতুর বয়সে পৌঁছেনি, তাদেরও অনুরূপ ইদ্দতকাল হবে। গর্ভবর্তী নারীদের ইদ্দতকাল সন্তানপ্রসব পর্যন্ত। যে আল্লাহকে ভয় করে, আল্লাহ তার কাজ সহজ করে দেন।",
                            "verse 65:5": "এটা আল্লাহর নির্দেশ, যা তিনি তোমাদের প্রতি নাযিল করেছেন। যে আল্লাহকে ভয় করে, আল্লাহ তার পাপ মোচন করেন এবং তাকে মহাপুরস্কার দেন।",
                            "verse 65:6": "তোমরা তোমাদের সামর্থ? অনুযায়ী যেরূপ গৃহে বাস কর, তাদেরকেও বসবাসের জন্যে সেরূপ গৃহ দাও। তাদেরকে কষ্ট দিয়ে সংকটাপন্ন করো না। যদি তারা গর্ভবতী হয়, তবে সন্তানপ্রসব পর্যন্ত তাদের ব্যয়ভার বহন করবে। যদি তারা তোমাদের সন্তানদেরকে স্তন্যদান করে, তবে তাদেরকে প্রাপ্য পারিশ্রমিক দেবে এবং এ সম্পর্কে পরস্পর সংযতভাবে পরামর্শ করবে। তোমরা যদি পরস্পর জেদ কর, তবে অন্য নারী স্তন্যদান করবে।",
                            "verse 65:7": "বিত্তশালী ব্যক্তি তার বিত্ত অনুযায়ী ব্যয় করবে। যে ব্যক্তি সীমিত পরিমাণে রিযিকপ্রাপ্ত, সে আল্লাহ যা দিয়েছেন, তা থেকে ব্যয় করবে। আল্লাহ যাকে যা দিয়েছেন, তদপেক্ষা বেশী ব্যয় করার আদেশ কাউকে করেন না। আল্লাহ কষ্টের পর সুখ দেবেন।",
                            "verse 65:8": "অনেক জনপদ তাদের পালনকর্তা ও তাঁর রসূলগণের আদেশ অমান্য করেছিল, অতঃপর আমি তাদেরকে কঠোর হিসাবে ধৃত করেছিলাম এবং তাদেরকে ভীষণ শাস্তি দিয়েছিলাম।",
                            "verse 65:9": "অতঃপর তাদের কর্মের শাস্তি আস্বাদন করল এবং তাদের কর্মের পরিণাম ক্ষতিই ছিল।",
                            "verse 65:10": "আল্লাহ তাদের জন্যে যন্ত্রণাদায়ক শাস্তি প্রস্তত রেখেছেন অতএব, হে বুদ্ধিমানগণ, যারা ঈমান এনেছ, তোমরা আল্লাহকে ভয় কর। আল্লাহ তোমাদের প্রতি উপদেশ নাযিল করেছেন।",
                            "verse 65:11": "একজন রসূল, যিনি তোমাদের কাছে আল্লাহর সুস্পষ্ট আয়াতসমূহ পাঠ করেন, যাতে বিশ্বাসী ও সৎকর্মপরায়ণদের অন্ধকার থেকে আলোতে আনয়ন করেন। যে আল্লাহর প্রতি বিশ্বাস স্থাপন করে ও সৎকর্ম সম্পাদন করে, তিনি তাকে দাখিল করবেন জান্নাতে, যার তলদেশে নদী প্রবাহিত, তথায় তারা চিরকাল থাকবে। আল্লাহ তাকে উত্তম রিযিক দেবেন।",
                            "verse 65:12": "আল্লাহ সপ্তাকাশ সৃষ্টি করেছেন এবং পৃথিবীও সেই পরিমাণে, এসবের মধ্যে তাঁর আদেশ অবতীর্ণ হয়, যাতে তোমরা জানতে পার যে, আল্লাহ সর্বশক্তিমান এবং সবকিছু তাঁর গোচরীভূত। দেবেন।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 65:1": "О, Пророче, ако се развеждате с жените, развеждайте се с тях в срока, затова и пресмятайте срока, и бойте се от Аллах, вашия Господ! Не ги пропъждайте от домовете им, а и те да не излизат, освен ако са сторили явна скверност.",
                            "verse 65:2": "И когато жените изпълнят своя срок, задръжте ги с добро или ги напуснете с добро! И вземете за свидетели двама справедливи мъже измежду вас! И свидетелствайте в името на Аллах! Това е наставление за онзи, който вярва в Аллах и в Сетния ден.",
                            "verse 65:3": "и ще му даде препитание оттам, откъдето не е предполагал.",
                            "verse 65:4": "А за онези от жените ви, които изгубят надежда за месечното кръвотечение, ако се съмнявате, срокът им е три месеца,",
                            "verse 65:5": "и за онези, които все още нямат кръвотечение.",
                            "verse 65:6": "Това е повелята на Аллах.",
                            "verse 65:7": "И ги настанявайте [жените в развод], където и вие живеете, според своите възможности, и не им навреждайте, за да ги притесните! А ако са бременни, харчете за тях, докато родят! А ако кърмят децата ви, дайте им тяхната отплата и се разберете с добро! А ако",
                            "verse 65:8": "Заможният да даде [за жената и детето] според своите възможности! И комуто препитанието е ограничено, да даде от онова, което Аллах му е дарил! Аллах възлага на всяка душа само според онова, което й е дал.",
                            "verse 65:9": "И колко селища се възпротивиха на повелята на своя Господ и на Неговите пратеници, и затова им подирихме строга сметка, и ги мъчихме с ужасно мъчение!",
                            "verse 65:10": "И вкусиха те пагубността на своето дело.",
                            "verse 65:11": "Аллах приготви за тях сурово мъчение.",
                            "verse 65:12": "",
                            "verse 65:13": "Пратеник, който ви чете знаменията на Аллах - разясняващи, за да изведе от тъмнините към светлината онези, които вярват и вършат праведни дела.",
                            "verse 65:14": "Аллах е, Който сътвори седем небеса, и от земята - също толкова."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "先知啊！當你們休妻的時候，你們當在她們的待婚期之前休她們，你們當計算待婚期，當敬畏真主——你們的主。你們不要把她們從她們的房裏驅逐出門，她們也不得自己出門，除非她們做了明顯的醜事。這是真主的法度，誰超越真主的法度，誰確是不義者。你們不知道，此後，真主或許創造一件事情。",
                            "verse 65:2": "當她們滿期的時候，你們當善意地挽留她們，或善意地離別她們。你們當以你們的兩個公正人為見証，你們當為真主而作証。這是用來教訓信仰真主和末日者的。誰敬畏真主，他將為誰辟一條出路，",
                            "verse 65:3": "而且從他料想不到的地方供給他。誰信托真主，他將使誰滿足。真主確是能達到自己的目的的，真主碓已使萬物各有定數。",
                            "verse 65:4": "你們的婦女中對月經已絕望的，如果你們懷疑，就以三個月為她們的待婚期；還沒有月經的，也是這樣；懷孕的，以分娩為滿期。誰敬畏真主，他將使誰順利。",
                            "verse 65:5": "這是真主所降示你們的法令，誰敬畏真主，他將免除誰的罪惡，而且賞賜他重大的報酬。",
                            "verse 65:6": "你們當依自己的能力而使她們住在你們所住的地方，你們不要妨害她們，而使她們煩悶。如果她們有孕，你們就應當供給她們，直到她們分娩。如果她們為你們哺乳，你們應當報酬她們，並且應當依正義而相商。如果你們的意見不合，就讓別的婦人為他哺乳。",
                            "verse 65:7": "教富裕的人用他的富裕的財產去供給，教窘迫的人用真主所賞賜他的去供給。真主只依他所賦予人的能力而加以責成。在窘迫之後，真主將給寬裕。",
                            "verse 65:8": "有許多城市的居民，曾違抗他們的主和眾使者的命令，我將嚴格地審訊他們，嚴厲地懲罰他們。",
                            "verse 65:9": "他們將嘗試他們行為的惡果，他們的行為的結局是虧折的。",
                            "verse 65:10": "真主已為他們預備了嚴厲的刑罰。信道的有理智的人們啊！你們當敬畏真主。真主確已降示你們一種教訓，",
                            "verse 65:11": "並且派遣一位使者，對你們宣讀真主的許多明顯的跡象，以便他使信道而且行善的人們，脫離重重黑暗，走入光明。誰信道而且行善，真主將使誰入下臨諸河的樂園，而永居其中。真主必定賞賜他們優美的給養。",
                            "verse 65:12": "真主創造了七層天，和同樣層數的大地，天命通過七層天而下降，以便你們知道，真主對於萬事是全能的，真主是周知萬物的。 並且派遣一位使者，對你們宣讀真主的許多明顯的跡象，以便他使信道而且行善的人們，脫離重重黑暗，走入光明。誰信道而且行善，真主將使誰入下臨諸河的樂園，而永居其中。真主必定賞賜他們優美的給養。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "Proroku! Rozvádíte-li se svými ženami, tedy se s nimi rozveďte v ustanovené pro ně lhůtě a počítejte přesně dny čekací lhůty a bojte se Boha, Pána svého! Nevyhánějte je z jejich domů a nechť z nich neodcházejí, leda kdyby se dopustily hanebnosti zjevné.",
                            "verse 65:2": "A když ženy dosáhnou lhůty své, pak je buď podržte podle zvyklosti vhodné, anebo se od nich odlučte také podle zvyklosti vhodné.",
                            "verse 65:3": "a uštědří mu obživu z místa, odkud s tím ani nepočítal.",
                            "verse 65:4": "Pro ty z vašich žen, jež již nemají naději na menstruaci, ale jste-li přesto na pochybách, nechť jsou čekací lhůtou tři měsíce; a stejně platí i pro ty, které ještě menstruaci neměly.",
                            "verse 65:5": "Toto je nařízení Boží, které vám sesílá.",
                            "verse 65:6": "Ubytujte ženy své po rozvodu tam, kde sami bydlíte, podle možností svých.",
                            "verse 65:7": "Nechť ten, kdo je blahobytný, dává úměrně k blahobytu svému a nechť ten, jehož obživa je odměřena, dává z toho, co Bůh mu uštědřil.",
                            "verse 65:8": "Ať se již kolik chtělo z měst vzepřelo rozkazu Pána svého a posla Jeho, zúčtovali jsme s nimi účtem přísným a potrestali jsme je trestem odporným!",
                            "verse 65:9": "A okusila následky počínání svého a konec počínání jejich byla ztráta jejich.",
                            "verse 65:10": "A Bůh připravil pro obyvatele jejich trest strašný, bojte se tedy Boha vy, kdož nadáni jste rozmyslem a kteří jste uvěřili! Bůh seslal vám již připomenutí",
                            "verse 65:11": "posla, který vám přednáší zřetelná znamení Boží, aby vyvedl ty, kdož uvěřili a zbožné skutky konali, z temnot k světlu.",
                            "verse 65:12": "Bůh je ten, jenž stvořil sedm nebes a podobný počet zemí."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "O, profeet, indien gij van de vrouwen scheidt, scheidt dan van haar voor de vastgestelde periode en berekent de periode, en vreest God uw Heer.",
                            "verse 65:2": "Als zij dan haar termijn bereikt hebben, neemt haar op een vriendelijke manier terug, of scheidt van haar op een behoorlijke wijze en roept twee rechtvaardigen vanuit uw midden tot getuigen en laat dit een ware getuigenis zijn voor God.",
                            "verse 65:3": "En Hij zal hem onderhouden vanwaar gij het niet verwacht.",
                            "verse 65:4": "En indien gij twijfelt aangaande diegenen uwer vrouwen, die geen menstruatie meer verwachten, haar (wacht) periode is drie maanden, hetzelfde geldt ook voor degenen die haar menstruatie nog niet hebben gehad.",
                            "verse 65:5": "Dat is het bevel van God dat Hij u heeft geopenbaard.",
                            "verse 65:6": "Herbergt haar (van wie gij scheidt) in de huizen waar gij vertoeft, overeenkomstig uw middelen; en doet haar geen kwaad om het haar moeilijk te maken.",
                            "verse 65:7": "Laat hij die overvloed heeft geven uit zijn overvloed.",
                            "verse 65:8": "Hoe vele steden kwamen niet in opstand tegen het gebod van hun Heer en van Zijn boodschappers! Wij riepen ze dan tot een strenge verantwoording en kastijdden haar met strenge kastijding.",
                            "verse 65:9": "Zo ondervonden zij het kwade gevolg van hun gedrag en het einde (hiervan) was de ondergang.",
                            "verse 65:10": "God heeft hun een strenge straf bereid; vreest daarom God, o gij mensen van verstand, die gelooft! God heeft inderdaad een vermaning tot u nedergezonden.",
                            "verse 65:11": "Een boodschapper, die aan u de duidelijke woorden van God voordraagt, opdat hij degenen die geloven en goede daden verrichten uit de duisternis in het licht moge brengen; en wie in God gelooft en goed doet, hem zal Hij in tuinen toelaten waar doorheen rivieren stromen om daarin voor eeuwig te vertoeven.",
                            "verse 65:12": "God is Hij Die de zeven hemelen schiep, en van de aarde desgelijks."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 65:1": "O Prophet! When ye (men) put away women, put them away for their (legal) period and reckon the period, and keep your duty to Allah, your Lord.",
                            "verse 65:2": "Then, when they have reached their term, take them back in kindness or part from them in kindness, and call to witness two just men among you, and keep your testimony upright for Allah.",
                            "verse 65:3": "And will provide for him from (a quarter) whence he hath no expectation.",
                            "verse 65:4": "And for such of your women as despair of menstruation, if ye doubt, their period (of waiting) shall be three months, along with those who have it not.",
                            "verse 65:5": "That is the commandment of Allah which He revealeth unto you.",
                            "verse 65:6": "Lodge them where ye dwell, according to your wealth, and harass them not so as to straiten life for them.",
                            "verse 65:7": "Let him who hath abundance spend of his abundance, and he whose provision is measured, let him spend of that which Allah hath given him.",
                            "verse 65:8": "And how many a community revolted against the ordinance of its Lord and His messengers, and We called it to a stern account and punished it with dire punishment,",
                            "verse 65:9": "So that it tasted the ill-effects of its conduct, and the consequence of its conduct was loss.",
                            "verse 65:10": "Allah hath prepared for them stern punishment; so keep your duty to Allah, O men of understanding! O ye who believe! Now Allah hath sent down unto you a reminder,",
                            "verse 65:11": "A messenger reciting unto you the revelations of Allah made plain, that He may bring forth those who believe and do good works from darkness unto light.",
                            "verse 65:12": "Allah it is who hath created seven heavens, and of the earth the like thereof."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 65:1": "O Prophet! When ye do divorce women, divorce them at their prescribed periods, and count (accurately), their prescribed periods: And fear God your Lord: and turn them not out of their houses, nor shall they (themselves) leave, except in case they are guilty of some open lewdness, those are limits set by God: and any who transgresses the limits of God, does verily wrong his (own) soul: thou knowest not if perchance God will bring about thereafter some new situation.",
                            "verse 65:2": "Thus when they fulfil their term appointed, either take them back on equitable terms or part with them on equitable terms; and take for witness two persons from among you, endued with justice, and establish the evidence (as) before God.",
                            "verse 65:3": "And He provides for him from (sources) he never could imagine.",
                            "verse 65:4": "Such of your women as have passed the age of monthly courses, for them the prescribed period, if ye have any doubts, is three months, and for those who have no courses (it is the same): for those who carry (life within their wombs), their period is until they deliver their burdens: and for those who fear God, He will make their path easy.",
                            "verse 65:5": "That is the Command of God, which He has sent down to you: and if any one fears God, He will remove his ills, from him, and will enlarge his reward.",
                            "verse 65:6": "Let the women live (in ’iddat) in the same style as ye live, according to your means: Annoy them not, so as to restrict them.",
                            "verse 65:7": "Let the man of means spend according to his means: and the man whose resources are restricted, let him spend according to what God has given him.",
                            "verse 65:8": "How many populations that insolently opposed the Command of their Lord and of His apostles, did We not then call to account,- to severe account?- and We imposed on them an exemplary Punishment.",
                            "verse 65:9": "Then did they taste the evil result of their conduct, and the End of their conduct was Perdition.",
                            "verse 65:10": "God has prepared for them a severe Punishment (in the Hereafter).",
                            "verse 65:11": "An Apostle, who rehearses to you the Signs of God containing clear explanations, that he may lead forth those who believe and do righteous deeds from the depths of Darkness into Light.",
                            "verse 65:12": "God is He Who created seven Firmaments and of the earth a similar number."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 65:1": "O Prophet, when you divorce women, divorce them when they have reached their period.",
                            "verse 65:2": "Then, when they have reached their term, retain them honourably, or part from them honourably.",
                            "verse 65:3": "and He will provide for him from whence he never reckoned.",
                            "verse 65:4": "As for your women who have despaired of further menstruating, if you are in doubt, their period shall be three months; and those who have not menstruated as yet.",
                            "verse 65:5": "That is God’s command, that He has sent down unto you.",
                            "verse 65:6": "Lodge them where you are lodging, according to your means, and do not press them, so as to straiten their circumstances.",
                            "verse 65:7": "Let the man of plenty expend out of his plenty.",
                            "verse 65:8": "How many a city turned in disdain from the commandment of its Lord and His Messengers; and then We made with it a terrible reckoning and chastised it with a horrible chastisement.",
                            "verse 65:9": "So it tasted the mischief of its action, and the end of its affair was loss.",
                            "verse 65:10": "God prepared for them a terrible chastisement.",
                            "verse 65:11": "a Messenger reciting to you the signs of God, clear signs, that He may bring forth those who believe and do righteous deeds from the shadows into the light.",
                            "verse 65:12": "It is God who created seven heavens, and of earth their like, between them the Command descending, that you may know that God is powerful over everything and that God encompasses everything in knowledge."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 65:1": "O PROPHET! When you [intend to] divorce women, divorce them with a view to the waiting-period appointed for them, and reckon the period ,",
                            "verse 65:2": "and be conscious of God, your Sustainer.",
                            "verse 65:3": "And so, when they are about to reach the end of their waiting-term, either retain them in a fair manner or part with them in a fair manner.",
                            "verse 65:4": "probity from among your own community witness [what you have decided]; and do yourselves bear true witness before God: thus are admonished all who believe in God and the Last Day.",
                            "verse 65:5": "grants a way out [of unhappiness],",
                            "verse 65:6": "and provides for him in a manner beyond all expectation; and for everyone who places his trust in God, He",
                            "verse 65:7": "is enough.",
                            "verse 65:8": "indeed, unto everything has God appointed its [term and] measure.",
                            "verse 65:9": "Now as for such of your women as are beyond the age of monthly courses, as well as for such as do not have any courses, their waiting-period – if you have any doubt [about it] – shall be three",
                            "verse 65:10": "months; and as for those who are with child, the end of their waiting-term shall come when they deliver their burden.",
                            "verse 65:11": "",
                            "verse 65:12": "all this is God’s commandment, which He has bestowed upon you from on high.",
                            "verse 65:13": "",
                            "verse 65:14": "let the women [who are undergoing a waiting-period] live in the same manner as you live yourselves, in accordance with your means; and do not harass them with a view to making their lives a misery.",
                            "verse 65:15": "recompense; and take counsel with one another in a fair manner [about the child’s future].",
                            "verse 65:16": "[In all these respects,] let him who has ample means spend in accordance with his amplitude; and let him whose means of subsistence are scanty spend in accordance with what God has given him: God does not burden any human being with more than He has given him – [and it may well be that] God will grant, after hardship, ease.",
                            "verse 65:17": "AND HOW MANY a community has turned with disdain from the commandment of its Sustainer and His apostles! – whereupon We called them all to account with an accounting severe, and caused them to suffer with a suffering unnameable:",
                            "verse 65:18": "and thus they had to taste the evil outcome of their own doing: for, [in this world,] the end of their doings was ruin,",
                            "verse 65:19": "[the while] God has readied for them [yet more] suffering severe [in the life to come].",
                            "verse 65:20": "who have attained to faith! God has indeed bestowed on you reminder from on high:",
                            "verse 65:21": "[He has sent] an apostle who conveys unto you God’s clear messages, so that He might lead those who have attained to faith and do righteous deeds out of the depths of darkness into the light.",
                            "verse 65:22": "GOD is He who has created seven heavens, and, like them, [the many aspects] of the earth.",
                            "verse 65:23": "will, so that you might come to know that God has the power to will anything, and that God encompasses all things with His knowledge."
                        }
                    },
                    "5": {
                        "Martin Lings": {}
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 65:1": "O prophet, when you people divorce women, divorce them at a time when the period of ‘Iddah may start.",
                            "verse 65:2": "So, when they (the divorced women) have (almost) reached their term, then either retain them with fairness, or part with them with fairness.",
                            "verse 65:3": "and provides him (with what he needs) from where he does not even imagine.",
                            "verse 65:4": "And those women from among you who have despaired of (further) menstruation, if you are in doubt, their ‘Iddah is three months, as well as of those who have not yet menstruated.",
                            "verse 65:5": "This is the command of Allah that He has sent down to you.",
                            "verse 65:6": "Provide to them (the divorced women) residence where you reside according to your means, and do not hurt them to straiten (life) for them.",
                            "verse 65:7": "A man of vast means should spend according to his vast means.",
                            "verse 65:8": "And how many a township rebelled against the command of its Lord, and against His messengers, so We called them to a severe account, and punished them with a punishment that was unimagined by them.",
                            "verse 65:9": "Thus they tasted the evil consequence of their acts, and the end of their conduct was loss.",
                            "verse 65:10": "Allah has prepared for them a severe punishment; so fear Allah O men of understanding who have believed! Allah has sent down to you a Reminder,",
                            "verse 65:11": "a messenger who recites to you the verses of Allah, making (the truth) clear, so that He may bring forth those who believe and do righteous deeds from the layers of darkness into the light.",
                            "verse 65:12": "Allah is the One who has created seven skies, and their like from earth."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 65:1": "O Prophet, when you",
                            "verse 65:2": "divorce women, divorce them by their prescribed period.",
                            "verse 65:3": "Then, when they have reached their term, retain them honourably, or separate from them honourably.",
                            "verse 65:4": "and He will provide for him from whence he never expected.",
                            "verse 65:5": "And [as for] those of your women who no longer expect to menstruate, if you have any doubts, their prescribed",
                            "verse 65:6": "period shall be three months, and [also for] those who have not yet menstruated.",
                            "verse 65:7": "That is God’s command which He has revealed to you.",
                            "verse 65:8": "Lodge them where you dwell in accordance with your means and do not harass them so as to put them in straits.",
                            "verse 65:9": "Let the affluent man expend out of his affluence.",
                            "verse 65:10": "And how many a town disobeyed the command of its Lord and His messengers, then We called it to a severe reckoning and chastised it with a dire chastisement.",
                            "verse 65:11": "So it tasted the evil consequences of its conduct, and the consequence of its conduct was",
                            "verse 65:12": "loss.",
                            "verse 65:13": "God has prepared for them a severe chastisement.",
                            "verse 65:14": "who believe! God has certainly revealed to you a [source of] remembrance,",
                            "verse 65:15": "a messenger, reciting to you the clear signs of God that He may bring forth those who believe and perform righteous deeds from darkness to light.",
                            "verse 65:16": "God it is Who created seven heavens, and of earth the like thereof."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 65:1": "O Prophet! (Say to the Muslims:) ‘When you seek to divorce your women, divorce them during their period of purity and count their prescribed period.",
                            "verse 65:2": "Then when they reach closer to (the end of) their appointed term, retain them with kindness or separate from them with kindness.",
                            "verse 65:3": "And He gives him sustenance from a source which he can never think of.",
                            "verse 65:4": "And those of your women who have no hope of menstruation, if you doubt (as to what will be their prescribed period), then their prescribed period is three months.",
                            "verse 65:5": "This is the command of Allah which He has sent down to you.",
                            "verse 65:6": "Keep the (divorced) women where you live according to your means.",
                            "verse 65:7": "The affluent one should spend (according to) his means.",
                            "verse 65:8": "And how many towns there were (the inhabitants of) which disobeyed and revolted against the command of their Lord and His Messengers! So We called them to account in the shape of fierce accountability, and seized them with such a severe torment as was never seen or even heard of.",
                            "verse 65:9": "So they tasted the evil consequence of their doings and their affair ended up in total loss.",
                            "verse 65:10": "Allah has prepared for them severe torment (in the Hereafter as well).",
                            "verse 65:11": "(And has also sent) the Messenger (blessings and peace be upon him), who recites to you clear Verses so that he may take those who have believed and do pious deeds from darkness to light.",
                            "verse 65:12": "Allah (alone) has created seven heavens and (brought about seven strata layer upon layer also whilst creating) the earth like them."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "Profeetta, kun eroatte vaimoistanne, erotkaa heistä ensin määrätyksi ajaksi, laskekaa heille määrätty päivien luku ja noudattakaa velvollisuuttanne Jumalaa, Herraanne, kohtaan.",
                            "verse 65:2": "Ja kun vaimojenne koeaika on päättynyt, pitäkää heidät luonanne tai erotkaa heistä ystävällisesti.",
                            "verse 65:3": "ja antaa hänelle elatuksen sieltä, mistä hän ei voi sitä odottaakaan.",
                            "verse 65:4": "Niille vaimoistanne, joiden kuukautiset ovat keskeytyneet, tai jos olette tästä epävarmoja, olkoon koekautensa, kolme kuukautta, samoin niille, joille kuukautiset eivät ole alkaneet; mutta raskailla vaimoilla tämä aika kestäköön aina siihen asti, kunnes he ovat synnyttäneet.",
                            "verse 65:5": "Tämä on Jumalan käsky, jonka Hän on ilmaissut teille, ja sen, joka pelkää Jumalaa, Hän vapahtaa pahoista teoista ja suo hänelle suuren palkinnon.",
                            "verse 65:6": "Antakaa eroavien vaimojenne asua siellä, missä itsekin asutte, varojenne mukaan, älkääkä kohdelko heitä kovasti, etteivät he joudu ahdistukseen.",
                            "verse 65:7": "Rikas mies uhratkoon varojensa runsaudesta, ja se, jonka osa on niukempi, jakakoon siitä, mitä Jumala on hänelle antanut; Jumala ei sälytä kenenkään kannettavaksi raskaampaa kuormaa, kuin minkä Hän on hyväksi nähnyt; vaikeuksien jälkeen Jumala suo huojennuksen.",
                            "verse 65:8": "Miten moni kaupunki kapinoitsikaan Herransa ja Hänen sananjulistajansa käskyä vastaan! Siitä syystä Me ankarasti vaadimme sen tilinteolle ja ojensimme sitä kovalla kurituksella.",
                            "verse 65:9": "Se sai kokea tekojensa onnettomat seuraukset, ja kaiken lopuksi se joutui perikatoon.",
                            "verse 65:10": "Jumala on valmistanut heille ankaran kurituksen.",
                            "verse 65:11": "sananjulistajan, joka ilmoittaa teille Jumalan selvät tunnusmerkit, jotta ne, jotka uskovat ja hyvää tekevät, saisivat johdatuksen pimeydestä valkeuteen.",
                            "verse 65:12": "Jumala on luonut seitsemän taivasta ja yhtä monta maata."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 65:1": "O Prophète ! Lorsque vous répudiez vos femmes, faites-le à l'issue de leur délai d'attente, et calculez bien le délai.",
                            "verse 65:2": "Lorsqu'elles ont atteint le terme prescrit, retenez-les avec bienséance, ou séparez-vous d'elles avec bienséance.",
                            "verse 65:3": "et lui accordera des bienfaits d'une provenance inattendue.",
                            "verse 65:4": "Pour celles de vos femmes qui n'espèrent plus la menstruation, si vous avez quelque doute à ce sujet, le délai d'attente sera de trois mois, et il en sera de même pour celles qui n'ont pas encore leurs menstrues.",
                            "verse 65:5": "Tel est l'ordre de Dieu, qu'Il a fait descendre sur vous.",
                            "verse 65:6": "Logez ces femmes, là où vous demeurez, suivant vos moyens, et ne les molestez pas pour leur rendre la vie difficile.",
                            "verse 65:7": "Que celui qui se trouve dans l'aisance dépense largement, et que celui dont les moyens sont restreints dépense selon ce que Dieu lui a accordé.",
                            "verse 65:8": "Que de cités ont été rebelles à l'ordre de leur Seigneur et de Ses envoyés ! Nous avons tenu pour elles un compte sévère, et Nous leur avons infligé un rude châtiment.",
                            "verse 65:9": "Elles ont goûté les fruits amers de leur conduite, et leur comportement a fini par causer leur perte.",
                            "verse 65:10": "Dieu leur a préparé un châtiment sévère.",
                            "verse 65:11": "un Envoyé qui vous récite les clairs versets de Dieu, pour faire sortir des ténèbres vers la lumière ceux qui croient et qui font des œuvres pies.",
                            "verse 65:12": "Dieu est Celui qui a créé sept cieux et, pour la terre, en a fait des répliques."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 65:1": "ô Prophète ! Quand vous répudier les femmes, répudiez-les conformément à leur période d’attente prescrite; et comptez la période; et craignez Dieu votre Seigneur.",
                            "verse 65:2": "Puis quand elles atteignent le terme prescrit, retenez-les de façon convenable, ou séparez-vous d’elles de façon convenable; et prenez deux hommes intègres parmi vous comme témoins.",
                            "verse 65:3": "et lui accordera Ses dons par [des moyens] sur lesquels il ne comptait pas.",
                            "verse 65:4": "lui suffit.",
                            "verse 65:5": "Si vous avez des doutes à propos (de la période d’attente) de vos femmes qui n’espèrent plus avoir de règles, leur délai est de trois mois.",
                            "verse 65:6": "Tel est le commandement de Dieu qu’Il a fait descendre vers vous.",
                            "verse 65:7": "Et faites que ces femmes habitent où vous habitez, et suivant vos moyens.",
                            "verse 65:8": "Que celui qui est aisé dépense de sa fortune; et que celui dont les biens sont restreints dépense selon ce que Dieu lui a accordé.",
                            "verse 65:9": "Que de cités ont refusé avec insolence le commandement de leur Seigneur et de Ses messagers ! Nous leur en demandâmes compte avec sévérité, et les châtiâmes d’un châtiment inouï.",
                            "verse 65:10": "Elles goûtèrent donc la conséquence de leur comportement.",
                            "verse 65:11": "perdition.",
                            "verse 65:12": "Dieu a préparé pour eux un dur châtiment.",
                            "verse 65:13": "un Messager qui vous récite les versets de Dieu comme preuves claires, afin de faire sortir ceux qui croient et accomplissent les bonnes oeuvres des ténèbres à la lumière.",
                            "verse 65:14": "Dieu qui a créé sept cieux et autant de terres.",
                            "verse 65:15": "commandement descend, afin que vous sachiez que Dieu est en vérité Omnipotent et que Dieu a embrassé toute chose de",
                            "verse 65:16": "savoir."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "O Prophet! wenn ihr euch von Frauen trennt, so trennt euch von ihnen für ihre vorgeschriebene Frist, und berechnet die Frist; und fürchtet Allah, euren Herrn.",
                            "verse 65:2": "Dann, wenn ihre Frist um ist, nehmt sie in Güte zurück oder trennt euch in Güte von ihnen und rufet zwei rechtliche Leute aus eurer Mitte zu Zeugen; und laßt es ein wahrhaftiges Zeugnis vor Allah sein.",
                            "verse 65:3": "Und wird ihn versorgen, von wannen er es nicht erwartet.",
                            "verse 65:4": "Wenn ihr im Zweifel seid (über) jene eurer Frauen, die keine monatliche Reinigung mehr erhoffen, (dann wisset, daß) ihre Frist drei Monate ist, und (das gleiche gilt für) die, die noch keine Reinigung hatten.",
                            "verse 65:5": "Das ist Allahs Gebot, das Er euch herabgesandt hat.",
                            "verse 65:6": "Lasset sie (während der Frist) in den Häusern wohnen, in denen ihr wohnt, gemäß euren Mitteln; und tut ihnen nichts zuleide in der Absicht, es ihnen schwer zu machen.",
                            "verse 65:7": "Jener, der Fülle hat, soll aus seiner Fülle aufwenden; Und der, dessen Mittel beschränkt sind, soll aufwenden gemäß dem, was ihm Allah gegeben hat.",
                            "verse 65:8": "Wie so manche Stadt widersetzte sich dem Befehl ihres Herrn und Seiner Gesandten, und Wir zogen sie streng zur Rechenschaft und straften sie mit harter Strafe!",
                            "verse 65:9": "So kostete sie die bösen Folgen ihres Betragens, und das Ende ihres Betragens war Untergang.",
                            "verse 65:10": "Allah hat für sie eine strenge Strafe bereitet; so fürchtet Allah, o ihr Leute von Verstand, die ihr glaubt.",
                            "verse 65:11": "Einen Gesandten, der euch die deutlichen Zeichen Allahs vorträgt, auf daß er jene, die glauben und gute Werke tun, aus den Finsternissen ans Licht führe.",
                            "verse 65:12": "Allah ist es, Der sieben Himmel erschuf und von der Erde eine gleiche Zahl."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": ",s jlwy ¼eqlyekuksa ls dg nks½ tc rqe viuh chfo;ksa dks rykd+ nks rks mudh bn~nr ¼ikdh½ ds oD+r rykd+ nks vkSj bn~nk dk Óqekj j[kks vkSj vius ijojfnxkj [+kqnk ls Mjks vkSj ¼bn~ns ds vUnj½ muds ?kj ls mUgsa u fudkyks vkSj og [+kqn Hkh ?kj ls u fudysa exj tc og dksbZ ljhgh csg;kbZ dk dke dj cSBsa ¼rks fudky nsus esa eqt+k;dk ugha½ vkSj ;s [+kqnk dh ¼eqd+jZj dh gq;h½ gnsa gSa vkSj tks [+kqnk dh gnksa ls rtkmt+ djsxk rks mlus vius Åij vki t+qYe fd;k rks rw ugha tkurk Ók;n [+kqnk mlds ckn dksbZ ckr iSnk djs ¼ftlls enZ iNrk, vkSj esy gks tk,½",
                            "verse 65:2": "rks tc ;s viuk bn~nk iwjk djus ds djhc igq¡ps rks ;k rqe mUgsa mUkokus ÓkbLrk ls jksd yks ;k vPNh rjg :[+klr gh dj nks vkSj ¼rykd+ ds oD+r½ vius yksxksa esa ls nks vkfnyksa dks xokg d+jkj ns yks vkSj xokgksa rqe [+kqnk ds okLrs Bhd Bhd xokgh nsuk bu ckrksa ls ml Ó[+l dks ulhgr dh tkrh gS tks [+kqnk vkSj jksts+ vk[+ksjr ij bZeku j[krk gks vkSj tks [+kqnk ls Mjsxk rks [+kqnk mlds fy, utkr dh lwjr fudky nsxk",
                            "verse 65:3": "vkSj mldks ,slh txg ls fjT+kd+ nsxk tgk¡ ls oge Hkh u gks vkSj ftlus [+kqnk ij Hkjkslk fd;k rks og mlds fy, dkQh gS cs’kd [+kqnk vius dke dks iwjk djds jgrk gS [+kqnk us gj pht+ dk ,d vUnkt+k eqd+jZj dj j[kk gS",
                            "verse 65:4": "vkSj tks vkSjrsa gSt+ ls ek;wl gks pqdh vxj rqe dks muds bn~ns esa Ód gksoss rks mudk bn~nk rhu eghus gS vkSj ¼vyk gkt+y d+;kl½ og vkSjrsa ftudks gSt+ gqvk gh ugha vkSj gkesyk vkSjrksa dk bn~nk mudk cPpk tuuk gS vkSj tks [+kqnk ls Mjrk gS [+kqnk mlds dke es lgwfyr iSnk djsxk",
                            "verse 65:5": ";s [+kqnk dk gqD+e gS tks [+kqnk us rqe ij ukft+y fd;k gS vkSj tks [+kqnk Mjrk jgsxk rks og mlds xqukg mlls nwj dj nsxk vkSj mls cM+k njtk nsxk",
                            "verse 65:6": "eqryd+k vkSjrksa dks ¼bn~ns rd½ vius ed+nwj eqrkfcd ns j[kks tgk¡ rqe [+kqn jgrs gks vkSj mudks rax djus ds fy, mudks rdyhQ u igq¡pkvks vkSj vxj og gkesyk gks rks cPpk tuus rd mudk [kpZ nsrs jgks fQj ¼tuus ds ckn½ vxj og cPps dks rqEgkjh [k+kfrj nw/k fiyk, rks mUgsa mudh ¼equkflc½ mtjr ns nks vkSj ckge lykfg;r ls nLrwj ds eqrkfcd ckr phr djks vkSj vxj rqe ckge d’k e d’k djks rks cPps dks mlds ¼cki dh½ [k+kfrj ls dksbZ vkSj vkSjr nw/k fiyk nsxh",
                            "verse 65:7": "xqUtkb’k okys dks viuh xqUtkb’k ds eqrkfcd+ [+kpZ djuk pkfg, vkSj ftldh jkst+h rax gks og ftruk [+kqnk us mls fn;k gS mlesa ls [kpZ djs [+kqnk us ftldks ftruk fn;k gS cl mlh ds eqrkfcd+ rdyhQ+ fn;k djrk gS [+kqnk vudjhc gh raxh ds ckn Q+jk[+kh vrk djsxk",
                            "verse 65:8": "vkSj cgqr lh cfLr;ksa ¼okys½ us vius ijojfnxkj vkSj mlds jlwyksa ds gqD+e ls ljd’kh dh rks geus mudk cM+h l[+rh ls fglkc fy;k vkSj mUgsa cqjs vt+kc dh lt+k nh",
                            "verse 65:9": "rks mUgksus vius dke dh lt+k dk et+k p[k fy;k vkSj muds dke dk vUtke ?kkVk gh Fkk",
                            "verse 65:10": "[+kqnk us muds fy, l[+r vt+kc rS;kj dj j[kk gS rks ,s vD+yeUnksa tks beku yk pqds gks [+kqnk ls Mjrs jgks [+kqnk us rqEgkjs ikl ¼viuh½ ;kn d+qjku vkSj viuk jlwy Hkst fn;k gS",
                            "verse 65:11": "tks rqEgkjs lkeus okt+s, vk;rsa i<+rk gS rkfd tks yksx bZeku yk, vkSj vPNs vPNs dke djrs jgs mudks ¼dqÝ+ dh½ rkfjfd+;ksa ls bZeku dh jkS’kuh dh rjQ+ fudky yk, vkSj tks [+kqnk ij bZeku yk, vkSj vPNs vPNs dke djs rks [+kqnk mldks ¼csfg’r ds½ mu ckx+ksa esa nkf[ky djsxk ftuds uhps ugjsa tkjh gSa vkSj og mlesa vcknqy vkckn rd jgsaxs [+kqnk us mudks vPNh vPNh jkst+h nh gS",
                            "verse 65:12": "[+kqnk gh rks gS ftlus lkr vkleku iSnk fd, vkSj mUgha ds cjkcj t+ehu dks Hkh muesa [+kqnk dk gqD+e ukft+y gksrk jgrk gS & rkfd rqe yksx tku yks fd [+kqnk gj pht+ ij dkfnj gS vkSj cs’kd [+kqnk vius bYe ls gj pht+ ij gkoh gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "Hai Nabi, apabila kamu menceraikan isteri-isterimu maka hendaklah kamu ceraikan mereka pada waktu mereka dapat (menghadapi) idahnya (yang wajar) dan hitunglah waktu idah itu serta bertakwalah kepada Allah Tuhanmu.",
                            "verse 65:2": "Apabila mereka telah mendekati akhir iddahnya, maka rujukilah mereka dengan baik atau lepaskanlah mereka dengan baik dan persaksikanlah dengan dua orang saksi yang adil di antara kamu dan hendaklah kamu tegakkan kesaksian itu karena Allah.",
                            "verse 65:3": "Dan memberinya rezki dari arah yang tiada disangka-sangkanya.",
                            "verse 65:4": "Dan perempuan-perempuan yang tidak haidh lagi (monopause) di antara perempuan-perempuanmu jika kamu ragu-ragu (tentang masa idahnya) maka idah mereka adalah tiga bulan; dan begitu (pula) perempuan-perempuan yang tidak haidh.",
                            "verse 65:5": "Itulah perintah Allah yang diturunkan-Nya kepada kamu; dan barangsiapa yang bertakwa kepada Allah niscaya Dia akan menghapus kesalahan-kesalahannya dan akan melipat gandakan pahala baginya.",
                            "verse 65:6": "Tempatkanlah mereka (para isteri) di mana kamu bertempat tinggal menurut kemampuanmu dan janganlah kamu menyusahkan mereka untuk menyempitkan (hati) mereka.",
                            "verse 65:7": "Hendaklah orang yang mampu memberi nafkah menurut kemampuannya.",
                            "verse 65:8": "Dan berapalah banyaknya (penduduk) negeri yang mendurhakai perintah Tuhan mereka dan rasul-rasul-Nya, maka Kami hisab penduduk negeri itu dengan hisab yang keras, dan Kami azab mereka dengan azab yang mengerikan.",
                            "verse 65:9": "Maka mereka merasakan akibat yang buruk dari perbuatannya, dan adalah akibat perbuatan mereka kerugian yang besar.",
                            "verse 65:10": "Allah menyediakan bagi mereka azab yang keras, maka bertakwalah kepada Allah hai orang-orang yang mempunyai akal, (yaitu) orang-orang yang beriman.",
                            "verse 65:11": "(dan mengutus) seorang Rasul yang membacakan kepadamu ayat-ayat Allah yang menerangkan (bermacam-macam hukum) supaya Dia mengeluarkan orang-orang yang beriman dan mengerjakan amal-amal yang saleh dari kegelapan kepada cahaya.",
                            "verse 65:12": "Allah-lah yang menciptakan tujuh langit dan seperti itu pula bumi."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "O Profeta, quando ripudiate le vostre donne, ripudiatele allo scadere del termine prescritto e contate bene il termine.",
                            "verse 65:2": "Quando poi siano giunte al loro termine, trattenetele convenientemente o separatevi da esse convenientemente.",
                            "verse 65:3": "e gli concede provvidenze da dove non ne attendeva.",
                            "verse 65:4": "Se avete qualche dubbio a proposito di quelle delle vostre donne che non sperano più nel mestruo, il loro termine sia di tre lunazioni.",
                            "verse 65:5": "Questo è l'Ordine che Allah ha fatto scendere su di voi.",
                            "verse 65:6": "Fatele abitare dove voi stessi abitate, secondo i vostri mezzi.",
                            "verse 65:7": "L'agiato spenda della sua agiatezza, colui che ha scarse risorse spenda di quello che Allah gli ha concesso.",
                            "verse 65:8": "Quante città si mostrarono orgogliose di fronte all'ordine del loro Signore e dei Suoi messaggeri! Le costringemmo ad un rendiconto rigoroso, e le castigammo di un orribile castigo.",
                            "verse 65:9": "Gustarono le conseguenze della loro condotta e l'esito della loro condotta fu la dannazione.",
                            "verse 65:10": "Allah ha preparato loro un severo castigo.",
                            "verse 65:11": "un Messaggero che vi recita i versetti espliciti di Allah, per trarre dalle tenebre alla luce coloro che credono e compiono il bene.",
                            "verse 65:12": "Allah è Colui che ha creato sette cieli e altrettante terre."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "預言者よ，あなたがたが妻と離婚する時は，定められた期限に離別しその期間を（正確に）計算しなさい。あなたがたの主アッラーを畏れなさい。かの女らに明白な不貞がない限り，（期限満了以前に）家から追い出してはならない。また（かの女らを）出て行かせてはならない。これらはアッラーの� である。アッラーの� に背く者は，確かに自分の魂を損う者である。あなたは知らないが，アッラーはこの後で，新しい事態を引き起こされるかも知れない。",
                            "verse 65:2": "その期限が満了した時は，立派に留めるか，または立派に別れなさい。そしてあなたがたの中から公正な2人の証人を立て，アッラーに向い証言させなさい。これは，アッラーと最後の日を信じる者に与えられた訓戒である。またアッラーを畏れる者には，かれは（解決の）出ロを備えられる。",
                            "verse 65:3": "かれが考えつかないところから，恵みを与えられる。アッラーを信頼する者には，かれは万全であられる。本当にアッラーは，必ず御意を完遂なされる。アッラーは凡てのことに，一定の期限を定められる。",
                            "verse 65:4": "あなたがたの妻の中，月経の望みの無い者に就いてもし疑いを抱くならば，（命じられた）定めの期間は3ヶ月である。（まだ）月経の無い者に就いても（同様である）。妊娠している者の場合，その期間はかの女が重荷をおろすまでである。本当にアッラーを畏れる者には，かれは事を容易になされる。",
                            "verse 65:5": "これはアッラーが，あなたがたに下された命令である。アッラーを畏れる者には，かれはその諸悪を払われ，かれに対する報奨を増大されるであろう。",
                            "verse 65:6": "かの女たちを，あなたがたの暮している所であなたがたの力に応じて住まわせなさい。かの女らを窮屈にして，困らせてはならない。もし妊娠しているならば，出産するまでの費用を，かの女たちに与えなさい。もしかの女たちがあなたがたのため（子）に授乳する場合は，その報酬を与え，あなたがたの間で，正しく相談しなさい。あなたがた（夫婦）がもし話がまとまらなければ，外の女が授乳してもよい。",
                            "verse 65:7": "裕福な者には，その裕福さに応じて支払わせなさい。また資力の乏しい者には，アッラーがかれに与えたものの中から支払わせなさい。アッラーは，誰にもかれが与えられた以上のものを課されない。アッラーは，困難の後に安易を授けられる。",
                            "verse 65:8": "どんなに多くの町が，主とかれの使徒たちの命令に背いたことであろう。それでわれは厳しく清算し，みせしめの懲罰でかれらを罰した。",
                            "verse 65:9": "こうしてかれらは，その行いの悪い結果を味わい，最後には結局滅亡した。",
                            "verse 65:10": "アッラーはかれらのために，厳しい懲罰を準備なされる。だから信仰し，思慮ある人びとよ，アッラーを畏れなさい。アッラーは，確にあなたがたに教訓を下され，",
                            "verse 65:11": "使徒を遣わした。かれがアッラーの印をあなたがたに読誦し，明白に解明するのは，信仰して善行をなす者を，暗黒の深みから光明の中に導き出すためである。凡そアッラーを信仰して善行に勤しむ者は，下に川が流れる楽園に入らされ，永遠にその中に住むのであろ。本当にアッラーは，かれらのために善い御恵みを下される。",
                            "verse 65:12": "アッラーこそは，7層の天と同様に（7層の）大地を，創造なされた方である。（アッラーの）御命令はそれらの間から下って来る。それで，本当にアッラーは，凡てのことに全能であり，またアッラーの御知識が，凡ての事物を確かに包囲なされることを，あなたに分からせるためである。 使徒を遣わした。かれがアッラーの印をあなたがたに読誦し，明白に解明するのは，信仰して善行をなす者を，暗黒の深みから光明の中に導き出すためである。凡そアッラーを信仰して善行に勤しむ者は，下に川が流れる楽園に入らされ，永遠にその中に住むのであろ。本当にアッラーは，かれらのために善い御恵みを下される。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "선지자여 너희가 여성과 이 혼 하고자 할 경우 정하여진 기간 을 두고 이혼하되 그 정하여진 기간을 헤아릴 것이며 너희 주님 을 두려워 할 것이라 그녀들을 가 정으로부터 내보지말며 그녀들 스 스로 나가서도 아니되나니 이는 그녀들이 간음하지 않도록 함이라 이것들이 하나님의 법이거늘 누구 든 이 법을 벗어난 자는 자기 스스로를 욕되게 한 자라 그후 하나님 께서 다시 재결합하게 하려 하시 는 지를 너희는 모르기 때문이라",
                            "verse 65:2": "그녀들이 정하여진 기간을 채 웠을 때 정당히 재결합을 하던지 아니면 정당히 혜어지되 너희 중 에 건전한 두명의 남자 증인을 불러 하나님을 위해 증언하라 그 러함이 하나님과 내세를 믿는 자 에게 주어진 교훈이라 하나님을 두려워 한 자를 위해 하나님은 항 상 하나의 길을 준비하시니라",
                            "verse 65:3": "그분은 생각지 아니했던 일용할 양식을 주시니라 하나님께 의 탁하는 자 누구든 하나님으로써 충분하니라 실로 하나님은 그분의 목적을 온전히 달성하시나니 하나 님은 모든 것에 일정한 한계를 두 셨노라",
                            "verse 65:4": "생리 기간이 끝나버린 여성이라도 너희가 의심할 경우는 그녀 들을 위해 정해진 기간은 석달이 며 생리에 이르지 아니한 여성도 마찬가지라 또한 임신한 여성의 기간은 출산할 때까지로 하나님을 두려워 한자 하나님은 그의 일을 편하게 하여 주시니라",
                            "verse 65:5": "그것이 하나님께서 너희에게 계시한 명령이라 하나님을 두려워 하는 자 하나님은 그의 잘못을 거 두어 주시고 그에게 큰 보상을 주 시니라",
                            "verse 65:6": "너희 생활 수단에 따라 너희 가 사는 것처럼 이혼될 여성도 살 게 하라 그리고 그녀들을 해치지 말라 너희가 그녀들을 곤경에 빠 뜨리게 하지 않도록 하기위해서라 그녀들이 임신중이라면 출산을 할 때까지 비용을 지불할 것이며 그 녀들이 젖을 먹인다면 그녀들에게 보상을 지불하고 서로가 의무를 다하도록 할 것이며 그렇게 할 수 없을 경우 유모로 하여금 젖을 먹이도록 하라",
                            "verse 65:7": "능력에 따라 지불하되 그의 능력이 한정된 자는 하나님께서 그에게 베풀 것 중에서 지불하도 록 하라 하나님은 그분께서 베푸 신 것 이상의 무거운 짐을 어느 누구에게도 부과하지 아니 하시니 하나님은 고난을 쉬움으로 거두어 주시니라",
                            "verse 65:8": "얼마나 많은 백성들이 주님의 명령과 선지자에게 거역하였더뇨 그래서 하나님은 그들을 엄격한 계산으로 가혹한 응벌을 내리시니라",
                            "verse 65:9": "그리하여 그들은 그들 행위의 사악한 결과를 맛보았으며 그들 행위의 결과는 멸망이었노라",
                            "verse 65:10": "하나님은 그들을 위하여 가 혹한 응벌을 준비하셨나니 하나님 을 두려워 하라 믿음으로 이해하 는 사람들이여 하나님에서 너희에게 교훈을 계시하였노라",
                            "verse 65:11": "그는 하나님의 분명한 말씀을 낭송할 한 선지자로 믿음으로 선을 행하는 자를 암흑에서 광명 으로 인도하리라 하나님을 믿고 선을 행하는 자 하나님은 그로 하여 강물이 흐르는 천국으로 들게 하여 그곳에서 영생케 하리라 하 나님은 그를 위해 가장 훌륭한 보상을 베푸시노라",
                            "verse 65:12": "하나님께서 철천을 창조하 사 대지도 그와 같이 창조하신 분이시라 그 사이를 통하여 그분의 계시가 계속되었나니 하나님은 모든 일에 전지전능하시고 모든 것 이 그분의 지혜안에 있다는 것을 너희가 알도록 함이라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "ئه‌ی پێغه‌مبه‌ر (صلی الله علیه وسلم) (به ئوممه‌تت ڕابگه‌یه‌نه‌) کاتێك ژنانتان ته‌ڵاق ده‌ده‌ن له‌تاتی دیاری کراویاندا ته‌ڵاقیان بده‌ن (که بریتیه له‌و کاته‌ی که ئافره‌ت له عاده‌ی مانگانه پاك بۆته‌وه‌)، حسابی ئه‌وکاته‌ش به وردی ڕابگرن، له په‌روه‌ردگاریشتان بترسن و ماوه‌که‌یان بۆ درێژ مه‌که‌نه‌وه (ئه‌گه‌ر له‌و کاته دیاریکراوانه‌دا یه‌کجار ته‌ڵاقتان دان، ئه‌وه با ئه‌و ئافره‌ته له ماڵه‌که‌ی خۆیدا بمینێته‌وه و) ده‌ریان مه‌که‌ن له‌ماڵه‌کانی خۆیاندا، ئافره‌ته‌کانیش با له ماڵ ده‌رنه‌چن، مه‌گه‌ر کارێکی ناشیرین و ناڕه‌وای ئاشکرا ئه‌نجام بده‌ن، (ئه‌وکاته با له ماڵ نه‌مێنن و بچن بۆ ماڵی مه‌حره‌مێکیان)، ئا ئه‌وه‌یه سنووری خوا له باره‌ی ته‌ڵاقه‌وه‌، ئه‌وه‌ی له سنووری خوا بترازێت ئه‌وه سته‌م له خۆی ده‌کات، ئه‌ی ئیماندار: تۆ نازانیت له‌وانه‌یه دوای ئه‌و (تێکچوون و ساردییه‌) خوای گه‌وره بارودۆخێك پێش بهێنێت (که ئاشت ببنه‌وه و ڕێك بکه‌ونه‌وه و بۆیه نابێت له ماڵ ده‌رچن).",
                            "verse 65:2": "کاتێك گه‌یشتنه ماوه‌ی دیاریکراوی خۆیان (دوای یه‌ك، یان ئه‌و دوو ته‌ڵاقه که خواردو‌یانه‌)، ئینجا یان بیانهێڵنه‌وه لای خۆتان هاوڕێ له‌گاڵ ڕه‌فتارو هه‌ڵسوکه‌وتی چاکدا، یاخود وازیان لێبهێنن و لێیان جیاببنه‌وه (له سێهه‌م جاردا که ته‌ڵاقتان خوارد) به‌شێوه‌یه‌کی جوان که مافیان پارێزراو بێت، له کاتی جیابوونه‌وه‌ی یه‌کجاریدا با دوو شایه‌تی دادپه‌روه‌رو خواناس له خۆتان له نێواندا هه‌بێت و ئاماده‌ی شایه‌تی ببن و بیپارێزن بۆ خواو له‌به‌ر خوا، به‌وه‌ی که‌باسکرا ئامۆژگاری ده‌کرێت ئه‌و که‌سه‌ی باوه‌ڕ به خواو ڕۆژی دوایی ده‌هێنیت، جا ئه‌وه‌ی له خوا بترسێت و پارێزکار بێت، ئه‌وه خوا ده‌رووی لێ ده‌کاته‌وه‌.",
                            "verse 65:3": "له شوێنێکه‌وه ڕزق و ڕۆزی پێ ده‌به‌خشێت که حسابی بۆ نه‌کردبێت و خۆی پێی نازانێت، جا ئه‌وه‌ی پشت به خوا ببه‌ستێت، ئه‌و زاته‌ی به‌سه‌، بۆ ئه‌وه‌ی یاریده‌ده‌ری بێت، چونکه به‌ڕاستی خوا کارو فه‌رمانی خۆی به ئه‌نجام ده‌گه‌یه‌نێت، بێگومان خوا بۆ هه‌موو شتێک نه‌خشه‌یه‌کی دیاریکراوی بڕیارداوه (که ده‌بێت په‌یڕه‌وی بکرێت).",
                            "verse 65:4": "ئه‌و ئافره‌تانه‌ی که نائومێد بوون له عاده‌تی مانگانه له هاوسه‌ره‌کانتان، ئه‌گه‌ر که‌وتنه گوناهه‌وه که ئاخۆ عاده‌تی مانگانه‌یان مابێت یان نا، ئه‌وه سێ مانگ چاوه‌ڕێ بکه‌ن، هه‌روه‌ها ئه‌وانه‌ش که به‌هۆی که‌م ته‌مه‌نیوه هێشتا نه‌که‌وتونه‌ته عاده‌وه‌، ئه‌وانیش سێ مانگ چاوه‌ڕێ بکه‌ن، ئه‌و ئافره‌تانه‌ش که سکیان هه‌یه ماوه‌که‌یان ئه‌وه‌نده‌یه تا سکه‌که‌یان داده‌نێن، جا ئه‌وه‌ی که له خوا بترسێت و پارێزکار بێت، ئه‌وه خوا کاری بۆ ئاسان ده‌کات.",
                            "verse 65:5": "ئا ئه‌وه فه‌رمان و سنووری خوایه که ناردوویه‌تییه خواره‌وه بۆتان، ئه‌وه‌ی له خوا بترسێت و پارێزکار بێت، خوا گوناهه‌کانی ده‌سڕێته‌وه و چاوپۆشی لێ ده‌کات و پاداشته‌که‌ی بۆ گه‌وره‌و بێ سنوور ده‌کات.",
                            "verse 65:6": "ئه‌و ئافره‌تانه‌ی که ته‌ڵاقێک یان دووانیان ماوه‌، به‌گوێره‌ی تواناتان جێگه و ڕێگه‌یان بۆ دا‌بین بکه‌ن له‌لای خۆتان، نه‌که‌ن ئازاریان بده‌ن و ته‌نگه‌تاویان بکه‌ن و زۆریان بۆ بهێنن، خۆ ئه‌گه‌ر سکیان هه‌بوو، (ئه‌گه‌ر سێ ته‌ڵاقه‌ش درابوون) هه‌ر به‌خێوان بکه‌ن و مه‌سره‌فیان بکێشن هه‌تا سکه‌که‌یان داده‌نێن، خۆ ئه‌گه‌ر هاتوو منداڵه‌که‌یان به‌شیر گۆشکردو به‌خێویان کرد ئه‌وه حه‌قی خۆیان بده‌نێ، ده‌کرێت به‌شێوه‌یه‌کی جوان و چاك ڕاوێژ له‌ناویه‌کدا بکه‌ن بۆ به‌خێو کردنی منداڵه‌که‌، خۆ ئه‌گه‌ر پێك نه‌هاتن و ناکۆك بوون، ئه‌وه ده‌کرێت ئافره‌تێکی تر منداڵه‌که‌ی بۆ به‌خێو بکات و شیری پێ بدات.",
                            "verse 65:7": "جا ئه‌وه‌ی ده‌وڵه‌مه‌نده با به‌گوێره‌ی ده‌وڵه‌مه‌ندیه‌که‌ی به‌خشنده‌بێت، ئه‌وه‌یش که که‌م ده‌سته‌و هه‌ژاره‌، با له‌وه ببه‌خشێت که خوا پێی به‌خشیووه‌، چونکه خوا به گوێره‌ی دارایی هه‌ر که‌سێک داوی به‌خشین ده‌کات، دڵنیاس بن که خوا دوای ته‌نگانه هه‌رزانی ده‌هێنێت، دوای ناخۆشی خۆشی ده‌هێنێت.",
                            "verse 65:8": "له سه‌ده‌کانی پێشوودا چه‌نداها شارو شارۆچکه یاخی بوون له فه‌رمانی په‌روه‌ردگاریان و فرستاده‌کانی، ئێمه زۆر به‌توندیی حسابمان بۆ کردن و سزایه‌کی توندو پڕئێشمان بۆ پێشهێنان.",
                            "verse 65:9": "ئیتر گیرۆده‌ی به‌ڵای خۆیان بوون و ئه‌و سزایه‌یان چه‌شت که خۆیان ده‌ست پێشکه‌ریان بۆ کردبوو، سه‌رئه‌نجامی کارو کرده‌وه‌ی خه‌ڵکی ئه‌و شوێنانه‌ش زیانێکی گه‌وره بوو.",
                            "verse 65:10": "له قیامه‌تیشدا خوا سزای به‌ئێش له‌ناو دۆزه‌خدا بۆ ئاماده‌کردوون، ده‌ی کاواته ئه‌ی ڕۆشنبیره‌کان، ئه‌ی ئه‌وانه‌ی باوه‌ڕتان هێناوه‌؛ له خوا بترسن پارێزکار بن دڵنیابن خوای گه‌وره قورئانی بۆ ئێوه دابه‌زاندووه‌.",
                            "verse 65:11": "هه‌روه‌ها پێغه‌مبه‌رێك که ئایه‌ته ڕوونه‌کانی خواتان به‌سه‌ردا ده‌خوێنێته‌وه‌، تا ئه‌وانه‌ی که باوه‌ڕیان هێناوه و کرده‌وه چاکه‌کانیان ئه‌نجام داوه له تاریکیه‌کان ده‌ریان بهێنێت و ڕزگاریان بکات و بیانخاته ناو نوورو ڕوناکیه‌وه‌، جا ئه‌وه‌ی باوه‌ڕ بهێنێت به خواو کرده‌وه‌ی چاك ئه‌نجام بدات، ئه‌وه ده‌یخاته باخه‌کانی به‌هه‌شته‌وه که چه‌نده‌ها ڕوبار به ژێر دره‌خت و به‌رده‌م کۆشکه‌کانیدا ده‌ڕوات و له‌وێ ژیانی هه‌میشه‌یی و هه‌تاهه‌تایی ده‌بنه سه‌ر، بێگومان خوا ڕزق و ڕۆزی چاك و پاك و فره‌و فراوانی بۆ ئاماده کردوون.",
                            "verse 65:12": "خوا ئه‌و زاته‌یه که حه‌وت چین ئاسمانی دروست کردووه و فه‌رمانی خوا له نێوانیاندا داده‌به‌زێت، هه‌روه‌ها به‌وینه‌ی ئه‌وان فه‌رمانی خوا بۆ زه‌ویش داده‌به‌زێت و جێ به جێ ده‌کرێت، بۆ ئه‌وه‌ی بزانن که به‌ڕاست خوا ده‌سه‌ڵاتی به‌سه‌ر هه‌موو شتێکدا هه‌یه‌، بێگومان خوا به زانستی و زانیاری خۆی گه‌مارۆی هه‌موو شتێکی داوه‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "Wahai Nabi! Apabila kamu (engkau dan umatmu) hendak menceraikan isteri-isteri (kamu), maka ceraikanlah mereka pada masa mereka dapat memulakan idahnya dan hitunglah masa idah itu (dengan betul), serta bertakwalah kepada Allah, Tuhan kamu.",
                            "verse 65:2": "Kemudian, apabila mereka (hampir) habis tempoh idahnya, maka bolehlah kamu pegang mereka (rujuk) dengan cara yang baik atau lepaskan mereka dengan cara yang baik dan adakanlah dua orang saksi yang adil di antara kamu (semasa kamu merujukkan atau melepaskannya) dan hendaklah kamu (yang menjadi saksi) menyempurnakan persaksian itu kerana Allah semata-mata.",
                            "verse 65:3": "Serta memberinya rezeki dari jalan yang tidak terlintas di hatinya dan (Ingatlah), sesiapa berserah diri bulat-bulat kepada Allah, maka Allah cukuplah baginya (untuk menolong dan menyelamatkannya).",
                            "verse 65:4": "Dan perempuan-perempuan dari kalangan kamu yang putus asa dari kedatangan haid, jika kamu menaruh syak (terhadap tempoh idah mereka) maka idahnya ialah tiga bulan dan (demikian) juga idah perempuan-perempuan yang tidak berhaid.",
                            "verse 65:5": "Peraturan-peraturan yang demikian adalah hukum-hukum Allah yang diturunkan dan diterangkanNya kepada kamu dan (ingatlah), sesiapa yang bertakwa kepada Allah, nescaya Allah menghapuskan kesalahan-kesalahannya dan akan membesarkan pahala balasannya.",
                            "verse 65:6": "Tempatkanlah isteri-isteri (yang menjalani idahnya) itu di tempat kediaman kamu sesuai dengan kemampuan kamu dan janganlah kamu adakan sesuatu yang menyakiti mereka (di tempat tinggal itu) dengan tujuan hendak menyusahkan kedudukan mereka (supaya mereka keluar meninggalkan tempat itu) dan jika mereka berkeadaan sedang mengandung, maka berikanlah kepada mereka nafkahnya sehingga mereka melahirkan anak yang dikandungnya; kemudian jika mereka menyusukan anak untuk kamu, maka berikanlah kepada mereka upahnya dan berundinglah di antara kamu (dalam hal menyusunya) dengan cara yang baik dan (sebaliknya) jika kamu (dari kedua pihak) mengalami kesulitan, maka bolehlah perempuan lain menyusukannya.",
                            "verse 65:7": "Hendaklah orang yang mampu memberi nafkah menurut kemampuannya dan sesiapa yang di sempitkan rezekinya, maka hendaklah dia memberi nafkah dari apa yang diberikan Allah kepadanya (sekadar yang mampu); Allah tidak memberati seseorang melainkan (sekadar kemampuan) yang diberikan Allah kepadanya.",
                            "verse 65:8": "Dan bukan sedikit negeri-negeri yang penduduknya menderhaka terhadap perintah Tuhan mereka dan Rasul-rasulNya, maka Kami hitung amal mereka satu persatu dengan hitungan yang keras rapi, serta Kami seksakan mereka dengan azab yang tidak pernah dikenal dahsyatnya.",
                            "verse 65:9": "Lalu mereka merasai kesan yang buruk dari perbuatan derhakanya dan menjadilah akibat perbuatan mereka satu kerugian yang besar.",
                            "verse 65:10": "Allah menyediakan bagi mereka azab seksa yang seberat-beratnya.",
                            "verse 65:11": "(Dengan mengutuskan) seorang Rasul (Nabi Muhammad s.",
                            "verse 65:12": "Allah yang menciptakan tujuh petala langit dan (Dia menciptakan) bumi seperti itu; perintah Allah berlaku terus menerus di antara alam langit dan bumi."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "اى پيامبر! هر زمان خواستيد زنان را طلاق دهيد، در زمان عده، آنها را طلاق گوييد ( زمانى كه از عادت ماهانه پاك شده و با همسرشان نزديكى نكرده باشند )، و حساب عده را نگه داريد; و از خدايى كه پروردگار شماست بپرهيزيد; نه شما آنها را از خانه‏هايشان بيرون كنيد و نه آنها (در دوران عده) بيرون روند، مگر آنكه كار زشت آشكارى انجام دهند; اين حدود خداست، و هر كس از حدود الهى تجاوز كند به خويشتن ستم كرده; تو نمى‏دانى شايد خداوند بعد از اين، وضع تازه (و وسيله اصلاحى) فراهم كند!",
                            "verse 65:2": "و چون عده آنها سرآمد، آنها را بطرز شايسته‏اى نگه داريد يا بطرز شايسته‏اى از آنان جدا شويد; و دو مرد عادل از خودتان را گواه گيريد; و شهادت را براى خدا برپا داريد; اين چيزى است كه مؤمنان به خدا و روز قيامت به آن اندرز داده مى‏شوند! و هر كس تقواى الهى پيشه كند، خداوند راه نجاتى براى او فراهم مى‏كند،",
                            "verse 65:3": "و او را از جايى كه گمان ندارد روزى مى‏دهد; و هر كس بر خدا توكل كند، كفايت امرش را مى‏كند; خداوند فرمان خود را به انجام مى‏رساند; و خدا براى هر چيزى اندازه‏اى قرار داده است!",
                            "verse 65:4": "و از زنانتان، آنان كه از عادت ماهانه مايوسند، اگر در وضع آنها (از نظر باردارى) شك كنيد، عده آنان سه ماه است، و همچنين آنها كه عادت ماهانه نديده‏اند; و عده زنان باردار اين است كه بار خود را بر زمين بگذارند; و هر كس تقواى الهى پيشه كند، خداوند كار را بر او آسان مى‏سازد!",
                            "verse 65:5": "اين فرمان خداست كه بر شما نازل كرده; و هر كس تقواى الهى پيشه كند، خداوند گناهانش را مى‏بخشد و پاداش او را بزرگ مى‏دارد!",
                            "verse 65:6": "آنها ( زنان مطلقه) را هر جا خودتان سكونت داريد و در توانايى شماست سكونت دهيد; و به آنها زيان نرسانيد تا كار را بر آنان تنگ كنيد (و مجبور به ترك منزل شوند); و اگر باردار باشند، نفقه آنها را بپردازيد تا وضع حمل كنند; و اگر براى شما (فرزند را) شير مى‏دهند، پاداش آنها را بپردازيد; و (درباره فرزندان، كار را) با مشاوره شايسته انجام دهيد; و اگر به توافق نرسيديد، آن ديگرى شيردادن آن بچه را بر عهده مى‏گيرد",
                            "verse 65:7": "آنان كه امكانات وسيعى دارند، بايد از امكانات وسيع خود انفاق كنند و آنها كه تنگدستند، از آنچه كه خدا به آنها داده انفاق نمايند; خداوند هيچ كس را جز به مقدار توانايى كه به او داده تكليف نمى‏كند; خداوند بزودى بعد از سختيها آسانى قرار مى‏دهد!",
                            "verse 65:8": "چه بسيار شهرها و آباديها كه اهل آن از فرمان خدا و رسولانش سرپيچى كردند و ما بشدت به حسابشان رسيديم و به مجازات كم‏نظيرى گرفتار ساختيم!",
                            "verse 65:9": "آنها آثار سوء كار خود را چشيدند; و عاقبت كارشان خسران بود!",
                            "verse 65:10": "خداوند عذاب سختى براى آنها فراهم ساخته; پس از (مخالفت فرمان) خدا بپرهيزيد اى خردمندانى كه ايمان آورده‏ايد! (زيرا) خداوند چيزى كه مايه تذكر است بر شما نازل كرده;",
                            "verse 65:11": "رسولى به سوى شما فرستاده كه آيات روشن خدا را بر شما تلاوت مى‏كند تا كسانى را كه ايمان آورده و كارهاى شايسته انجام داده‏اند، از تاريكيها بسوى نور خارج سازد! و هر كس به خدا ايمان آورده و اعمال صالح انجام دهد، او را در باغهايى از بهشت وارد سازد كه از زير (درختانش) نهرها جارى است، جاودانه در آن مى‏مانند، و خداوند روزى نيكويى براى او قرار داده است!",
                            "verse 65:12": "خداوند همان كسى است كه هفت آسمان را آفريد، و از زمين نيز همانند آنها را; فرمان او در ميان آنها پيوسته فرود مى‏آيد تا بدانيد خداوند بر هر چيز تواناست و اينكه علم او به همه چيز احاطه دارد!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "Ó Profeta, quando vos divorciardes das vossas mulheres, divorciai-vos delas em seus períodos prescritos e contai exatamente tais períodos e temei a Deus, vosso Senhor.",
                            "verse 65:2": "Todavia, quando tiverem cumprido o seu término prefixado, tomai-as em termos eqüitativos ou separai-vos delas, em termos eqüitativos.",
                            "verse 65:3": "E o agraciará, de onde menos esperar.",
                            "verse 65:4": "Quanto àquelas, das vossas mulheres, que tiverem chegado à menopausa, se tiverdes dúvida quanto a isso, o seu período prescrito será de três meses; o mesmo se diga, com respeito àquelas que ainda não tiverem chegado a tal condição; e, quanto às grávidas, o seu período estará terminado quando derem à luz.",
                            "verse 65:5": "Tal é o mandamento que Deus vos revelou.",
                            "verse 65:6": "Instalai-as (as divorciadas) onde habitais, segundo os vossos recursos, e não as molesteis, para criar-lhes dificuldades.",
                            "verse 65:7": "Que o abastado retribua isso, segundo as suas posses; quanto àquele, cujos recursos forem parcos, que retribua com aquilo com que Deus lhe agraciou.",
                            "verse 65:8": "Quantas cidades descartaram a autoridade do seu Senhor e dos Seus mensageiros! Saldamo-lhes as contas rigorosamente e lhes infligimos um castigo exemplar.",
                            "verse 65:9": "Sofreram, então, a dura conseqüência da sua conduta, e o resultado da sua conduta foi a perdição.",
                            "verse 65:10": "Deus lhes preparou um severo castigo.",
                            "verse 65:11": "Por um Mensageiro, que vos recita os lúcidos versículos de Deus, para tirar os que crêem e praticam o bem, das trevas, para os levar à luz.",
                            "verse 65:12": "Deus foi Quem criou sete firmamentos e outro tanto de terras; e Seus desígnios se cumprem, entre eles, para que saibais que Deus é Onipotente e que Deus tudo abrange, com a Sua onisciência."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 65:1": "O, Profetule! Dacã divorțați de muieri, atunci despãrțiți-vã de ele dupã timpul de așteptare prescris pentru ele și socotiți timpul și fiți cu fricã de Allah - St&atil",
                            "verse 65:2": "Apoi când ele ajung la timpul prescris, atunci sau țineți-le, dupãcuviințã, sau despãrțiți-vã de ele, dupã cuviințã! Și luați ca martoridoi oameni drepți d",
                            "verse 65:3": "Și-l va înzestra pe el de unde el nici nu se așteaptã.",
                            "verse 65:4": "Și dacã aveți îndoieli în privința perioadei de așteptare pentru muierile care nu mai nãdãjduiesc sã aibã ciclu, aceasta este pentru ele de trei luni și asemenea pentru cele ce nu au",
                            "verse 65:5": "Aceasta este porunca lui Allah, pe care El v-o trimite vouã.",
                            "verse 65:6": "Lãsați-le sã locuiascã acolo unde locuiți voi, dupã mijloacelevoastre , și nu le faceți nici o daunã, ca sã le faceți sã trãiascã strâmtorat",
                            "verse 65:7": "Cel care este înstãrit sã cheltuiascã dupã averea sa, iar cel a cãrui înzestrare este mãsuratã sã cheltuiascã din ceea ce i-a dat Allah.",
                            "verse 65:8": "Și câte cetãți s-au rãzvrãtit împotriva poruncii Domnului lor șiîmpotriva trimișilor Sãi! Și Noi le-am cerut lor socotealã cu asprime și le-am chinuit pe ele cu chin greu.",
                            "verse 65:9": "Și au gustat ele urmarea purtãrii lor și urmarea purtãrii lor a fostpierderea.",
                            "verse 65:10": "Allah a pregãtit pentru ei chin aspru .",
                            "verse 65:11": "",
                            "verse 65:12": "un Trimis , care sã vã recite vouã versetele lui Allah cele deslușite, ca sã-i scoatã pe cei care cred și împlinesc fapte bune din întunecimi la luminã .",
                            "verse 65:13": "Allah este Cel ce a creat șapte ceruri și tot atâtea pãmânturi.",
                            "verse 65:14": "pentru ca sã știți cã Allah este cu putere peste toate și cã Allah c ,"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 65:1": "O, Profetule! Atunci când vă lepădaţi de femeile voastre, faceţi-o după răstimpul de aşteptare.",
                            "verse 65:2": "Când s-a întâmplinit sorocul hotărât, ţineţi-le cum se cuvine ori despărţiţi-vă de ele cum se cuvine.",
                            "verse 65:3": "şi îi va dărui ceea ce nici nu socoate.",
                            "verse 65:4": "Răstimpul de aşteptare va fi de trei luni, chiar şi pentru acelea dintre femeile voastre care nu mai nădăjduiesc la cele femeieşti — dacă aveţi vreo îndoială — precum şi pentru cele care nu au încă cele femeieşti.",
                            "verse 65:5": "Aceasta este Porunca lui Dumnezeu pe care El a pogorât-o asupra voastră.",
                            "verse 65:6": "Lăsaţi-le pe aceste femei să locuiască acolo unde locuiţi şi voi, după putinţa voastră.",
                            "verse 65:7": "Cel care trăieşte în îndestulare, să plătească după puterea sa.",
                            "verse 65:8": "Câte cetăţi n-au dat ascultare Poruncilor Domnului lor şi ale trimişilor Săi! Noi le-am judecat cu asprime şi le-am osândit la o osândă fără seamăn.",
                            "verse 65:9": "Ele au gustat urmarea faptelor lor, iar sfârşitul faptelor lor a fost pierirea!",
                            "verse 65:10": "Dumnezeu le-a pregătit osândă aspră.",
                            "verse 65:11": "Un trimis vă recită versetele desluşite ale lui Dumnezeu ca să vă scoată din întunecimi către lumină, pe voi, cei care credeţi şi făptuiţi binele.",
                            "verse 65:12": "Dumnezeu este Cel ce a creat şapte ceruri şi pământul deopotrivă cu ele."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "О пророк! Когда даете вы разводсвоим супругам,То разводитесь в срок, для нихопределенный2245,И срок отсчитывайте верно.",
                            "verse 65:2": "Когда же истечет назначенный имсрок,Верните их с достоинством обратноИли с достоинством расстаньтесьс нимиИ призовите двух свидетелей из вас,(Известных) справедливостью своею.",
                            "verse 65:3": "И даст ему потребное (для жизни),Откуда он не ведает совсем.",
                            "verse 65:4": "Для женщин, у которых по годамуж завершен их ре’гул,Но если все ж у вас сомненья есть2248,Срок (ожидания развода) — тримесяца,Как равно и для тех, у коих ещене было регула.",
                            "verse 65:5": "Сие есть повеление Аллаха,Которое для вас Он ниспослал,И тем, кто гнева Господа страшится,Награду увеличит Он и снимет всегрехи.",
                            "verse 65:6": "И пусть (за время прохожденияиддата)Живут они в условиях таких же,как и вы,Согласно вашему достатку.",
                            "verse 65:7": "И пусть богатый человекСогласно своему достатку тратит.",
                            "verse 65:8": "Ведь сколько поселений (на земле)От повелений Господа надменноотреклись,Ослушались посланников Его!Расчетом сильным Мы их рассчиталиИ предали их тяжким наказаньям(на земле)2250.",
                            "verse 65:9": "Тогда они сполна вкусили от плодовсвоих поступков,И их концом была (всеобщая)погибель.",
                            "verse 65:10": "Аллах для них суровую расплатууготовил,А потому страшитесь Его гневаВсе, кто уверовал (в Него),И те, кто обладает разуменьем, —Аллах, поистине, послал напоминаньевам —",
                            "verse 65:11": "Посланника, который вам знаменияГосподниТолкует ясным языком,Чтобы из мрака к свету повестиБлаготворящих и уверовавших(в Истину Его).",
                            "verse 65:12": "Аллах есть Тот, Кто создал семь небеси столько же земель."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "¡Profeta! Cuando repudiáis a las mujeres, ¡hacedlo al terminar su período de espera! ¡Contad bien los días de ese período y temed a Alá, vuestro Señor! ¡No las expulséis de sus casas ni ellas salgan, a menos que sean culpables de deshonestidad manifiesta! Ésas son las leyes de Alá.",
                            "verse 65:2": "Cuando lleguen a su término, retenedlas decorosamente o separaos de ellas decorosamente.",
                            "verse 65:3": "y le provee de un modo insospechado por él.",
                            "verse 65:4": "Para aquéllas de vuestras mujeres que ya no esperan tener la menstruación, si tenéis dudas, su período de espera será de tres meses; lo mismo para las impúberes.",
                            "verse 65:5": "Ésta es la orden que Alá os ha revelado.",
                            "verse 65:6": "¡Alojadlas, según vuestros medios, en vuestra misma vivienda! ¡No les hagáis daño con ánimo de molestarlas! Si están embarazadas, proveedles de lo necesario hasta que den a luz.",
                            "verse 65:7": "¡Que el acomodado gaste según sus medios! Quien disponga de medios limitados ¡que gaste según lo que Alá le haya dado! Alá no pide a nadie sino lo que le ha dado.",
                            "verse 65:8": "¡A cuántas ciudades, que desdeñaron la orden de su Señor y de Sus enviados, pedimos cuenta rigurosa e infligimos un castigo horroroso!",
                            "verse 65:9": "Gustaron la gravedad de su conducta, que acabó por perderles.",
                            "verse 65:10": "Alá ha preparado para ellos un castigo severo.",
                            "verse 65:11": "un Enviado que os recita aleyas aclaratorias de Alá, para sacar de las tinieblas a la luz a quienes creen y obran bien.",
                            "verse 65:12": "Alá es Quien ha creado siete cielos y otras tantas tierras."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "நபியே! நீங்கள் பெண்களைத் 'தலாக்' சொல்வீர்களானால் அவர்களின் 'இத்தா'வைக் கணக்கிட ஏற்ற வகையில் (மாதவிடாய் அல்லாத காலங்களில்) தலாக் கூறுங்கள்.",
                            "verse 65:2": "ஆகவே, அவர்கள் தங்கள் (இத்தாவின்) தவணையை நெருங்கினால், அப்பொழுது முறைப்படி (மனைவியராக) அவர்களை நிறுத்தி வைத்துக் கொள்ளுங்கள்; அல்லது முறைப்படி அவர்களைப் பிரித்து (விட்டு) விடுங்கள், அன்றியும், உங்களில் நியாயமுடைய இருவரைச் சாட்சியாக வைத்துக் கொள்ளுங்கள், மேலும், சாட்சியத்தை அல்லாஹ்வுக்காக (நேர்மையாக) நிலைப்படுத்துங்கள்; அல்லாஹ்வையும், மறுமை நாளையும் விசுவாசம் கொண்டிருப்போருக்கு இந்த நற்போதனை செய்யப்படுகிறது - தவிர, எவர் அல்லாஹ்வுக்கு அஞ்சி நடக்கின்றாரோ, அவருக்கு அவன் (தக்க ஒரு) வழியை உண்டாக்குவான்.",
                            "verse 65:3": "அ(த்தகைய)வருக்கு, அவர் எண்ணியிராத புறத்திலிருந்து, அவன் உணவு (வசதி)களை அளிக்கிறான், மேலும், எவர், அல்லாஹ்வின் மீது நம்பிக்கை கொண்டு அவனை முற்றிலும் சார்ந்திருக்கிறாரோ, அவருக்கு அவன் போதுமானவன், நிச்சயமாக அல்லாஹ் தன் காரியத்தை நிறைவாக்குபவன் - திண்ணமாக அல்லாஹ் ஒவ்வொரு பொருளுக்கும் ஓர் அளவை உண்டாக்கி வைத்திருக்கின்றான்.",
                            "verse 65:4": "மேலும், உங்கள் பெண்களில், எவரும் மாதவிடாயின் நம்பிக்கையிழந்து (அவர்களுடைய இத்தாவை கணக்கிடுவது பற்றி) நீங்கள் சந்தேகப்பட்டால், அப்பெண்களுக்கும், மாதவிடாயே ஏற்படாப் பெண்களுக்கும், 'இத்தா'(வின் தவணை) மூன்று மாதங்களாகவும், தவிர கர்ப்பமுடைய பெண்களுக்கு அவர்களுடைய ('இத்தா'வின்) தவணை அவர்கள் பிரசவிக்கும் வரையாகும், மேலும், எவர் அல்லாஹ்வுக்கு அஞ்சி நடக்கிறாரோ அவருடைய காரியத்தை அவன் எளிதாக்குகிறான்.",
                            "verse 65:5": "இதுவே அல்லாஹ்வின் கட்டளையாகும் - இதை அவன் உங்களுக்கு இறக்கியருளினான்.",
                            "verse 65:6": "உங்கள் சக்திக்கேற்ப நீங்கள் குடியிருக்கும் இடத்தில் ('இத்தா'விலிருக்கும்) பெண்களை நீங்கள் குடியிருக்கச் செய்யுங்கள், அவர்களுக்கு நெருக்கடியுண்டாக்குவதற்காக அவர்களுக்குத் தொல்லை கொடுக்காதீர்கள், அவர்கள் கர்ப்பமுடையவர்களாக இருந்தால், அவர்கள் பிரசவிக்கும் வரை, அவர்களுக்காகச் செலவு செய்யுங்கள்; அன்றியும் அவர்கள் உங்களுக்காக (உங்கள் குழந்தைகளுக்குப்) பாலூட்டினால், அதற்கான கூலியை அவர்களுக்குக் கொடுத்து விடுங்கள்.",
                            "verse 65:7": "தக்க வசதியுடையவர்கள், தம் வசதிக்கேற்ப (இவ்விஷயத்தில்) செலவு செய்து கொள்ளவும், ஆனால், எவர் மீது அவருடைய உணவு (வசதி) நெருக்கடியாக்கப் பட்டுள்ளதோ, அவர் தமக்கு அல்லாஹ் கொடுத்ததிலிருந்து செலவு செய்து கொள்ளவும், எந்த ஆத்மாவையும் அல்லாஹ் அதற்குக் கொடுத்திருப்பதேயல்லாமல் (மிகையாக செலவு செய்யும் படி) சிரமப்படுத்த மாட்டான், கஷ்டத்திற்குப் பின்னர், அல்லாஹ் அதி சீக்கரத்தில் இலகுவை (சுகத்தை) உண்டாக்கியருள்வான்.",
                            "verse 65:8": "எத்தனையோ ஊர்கள் தம் இறைவனுடையவும் அவனுடைய தூதர்களுடையவும் கட்டளைக்கு மாறு செய்தனர், ஆதலால், நாம் வெகு கடுமையாக அவற்றைக் கணக்குக் கேட்டு, அவர்களைக் கொடிய வேதனையாகவும் வேதனை செய்தோம்.",
                            "verse 65:9": "இவ்வாறு அவை தம் செயலுக்குரிய தண்டனையை அனுபவித்துக் கொண்டன, அன்றியும், அவர்களுடைய செயல்களின் முடிவும் நஷ்டமாகவே ஆயிற்று.",
                            "verse 65:10": "அல்லாஹ் (அவர்களுக்குக்) கடினமான வேதனையை (மறுமையில்) சித்தம் செய்திருக்கின்றான், ஆகவே, ஈமான் கொண்டுள்ள அறிவுடையோரே! அல்லாஹ்வை நீங்கள் அஞ்சி நடந்து கொள்ளுங்கள் - திட்டமாக அல்லாஹ் உங்களுக்கு நினைவுறுத்தும் இவ்வுபதேசத்தை இறக்கி வைத்திருக்கின்றான்.",
                            "verse 65:11": "அன்றியும், ஒரு தூதரையும் அவன் (அனுப்பி வைத்தான்); அவர் அல்லாஹ்வுடைய தெளிவான வசனங்களை உங்களுக்கு ஓதிக் காண்பிக்கிறார், ஈமான் கொண்டு ஸாலிஹான (நல்ல) அமல்கள் செய்பவர்களை இருள்களிலிருந்து, ஒளியின் பக்கம் கொண்டு வருவதற்காக, மேலும் எவர் அல்லாஹ்வின் மீது ஈமான் கொண்டு ஸாலிஹான (நல்ல) அமல் செய்கின்றாரோ அவரை அல்லாஹ் சுவனச் சோலைகளில் பிரவேசிக்கச் செய்கிறான் - அவற்றின் கீழே ஆறுகள் ஓடிக் கொண்டிருக்கின்றன.",
                            "verse 65:12": "அல்லாஹ் தான் ஏழு வானங்களையும் இன்னும் பூமியிலிருந்து அவற்றைப் போலவும் படைத்தான், நிச்சமயாக அல்லாஹ் எல்லாப் பொருட்கள் மீதும் சக்தியுடையவன் என்பதையும், மேலும் நிச்சயமாக அல்லாஹ் தன் ஞானத்தால் எல்லாப் பொருளையும் சூழ்ந்தறிகிறான் என்பதையும் நீங்கள் அறிந்து கொள்வதற்காக, அவற்றின் (வானங்கள், பூமியின்) இடையே அவன் கட்டளையிறங்கிக் கொண்டேயிருக்கிறது."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "โอ้นบีเอ๋ย เมื่อพวกเจ้าหย่าภริยา ก็จงหย่าพวกนางตามกำหนด (อิดดะฮ์) ของพวกนาง และจงนับกำหนดอิดดะฮ์ให้ครบ พวกเจ้าจงยำเกรงอัลลอฮ์ พระเจ้าของพวกเจ้าเถิด อย่าขับไล่พวกนางออกจากบ้านของพวกนาง และพวกนางก็อย่าออกจากบ้านเว้นแต่พวกนางจะกระทำลามกอย่างชัดแจ้ง และเหล่านี้คือข้อกำหนดของอัลลอฮ์ และผู้ใดละเมิดข้อกำหนดของอัลลอฮ์ แน่นอนเขาก็ได้อธรรมแก่ตัวของเขาเอง เจ้าไม่รู้ดอกว่าบางทีอัลลอฮ์จะทรงปรับปรุงกิจการ (ของเขา) หลังจากนั้น",
                            "verse 65:2": "ต่อเมื่อพวกนางได้อยู่จนครบกำหนดของพวกนางแล้ว ก็จงยับยั้งพวกนางให้อยู่โดยดี หรือให้พวกนางจากไปโดยดี และจงให้มีพยานสองคนเป็นผู้เที่ยงธรรมในหมู่พวกเจ้า และจงให้การเป็นพยานนั้นเป็นไปเพื่ออัลลอฮ์ ดังกล่าวมานั้น ผู้ที่ศรัทธาต่ออัลลอฮ์และวันอาคิเราะฮ์จะถูกตักเตือนให้ถือปฏิบัติ และผู้ใดยำเกรงอัลลอฮ์ พระองค์ก็จะทรงหาทางออกให้แก่เขา",
                            "verse 65:3": "และจะทรงประทานปัจจัยยังชีพแก่เขาจากที่ที่เขามิได้คาดคิด และผู้ใดมอบหมายแด่อัลลอฮ์ พระองค์ก็จะทรงเป็นผู้พอเพียงแก่เขา แท้จริงอัลลอฮ์เป็นผู้ทรงบรรลุในกิจการของพระองค์ โดยแน่นอนสำหรับทุกสิ่งทุกอย่างนั้น อัลลอฮ์ทรงกำหนดกฎสภาวะไว้แล้ว",
                            "verse 65:4": "สำหรับผู้หญิงในหมู่ภริยาของพวกเจ้าที่หมดหวังในการมีระดู หากพวกเจ้ายังสงสัย (ในเรื่องอิดดะฮ์ของนาง) ดังนั้น พึงรู้เถิดว่า อิดดะฮ์ของพวกนางคือสามเดือน และบรรดาผู้หญิงที่มิได้มีระดูก็เช่นกัน ส่วนบรรดาผู้มีครรภ์ กำหนดของพวกนางก็คือ พวกนางจะคลอดทารถที่อยู่ครรภ์ของพวกนาง และผู้ใดยำเกรงต่ออัลลอฮ์ พระองค์จะทรงทำให้กิจการของเขาสะดวกง่ายดายแก่เขา",
                            "verse 65:5": "นั่นคือพระบัญชาของอัลลอฮ์ ซึ่งพระองค์ได้ทรงประทานพระบัญชานั้นแก่พวกเจ้า และผู้ใดยำเกรงอัลลอฮ์ พระองค์จะทรงลบล้างความชั่วทั้งหลายของเขาออกไปจากเขา และจะทรงเพิ่มรางวัลให้มากขึ้นแก่เขา",
                            "verse 65:6": "จงให้พวกนางพำนักอยู่ ณ ที่พวกเจ้าพำนักอยู่ตามฐานะของพวกเจ้า และอย่าทำอันตรายพวกนางเพื่อให้เกิดการคับแค้นแก่พวกนาง และหากพวกนางตั้งครรภ์ก็จงเลี้ยงดูพวกนางจนกว่าพวกนางจะคลอดทารกที่อยู่ในครรภ์ของพวกนาง ครั้นเมื่อพวกนางได้ให้นมแก่ทารกของพวกเจ้า ก็จงให้พวกนางซึ่งค่าตอบแทนของพวกนาง และจงปรึกษาหารือระหว่างพวกเจ้าด้วยกันโดยดี และเมื่อพวกเจ้าตกลงกันไม่ได้ ก็จงให้หญิงอื่นให้นมแก่เด็กนั้น",
                            "verse 65:7": "ควรให้ผู้มีฐานะร่ำรวยจ่ายตามฐานะของเขา ส่วนผู้ที่การยังชีพของเขาเป็นที่คับแค้นแก่เขา ก็ให้เขาจ่ายตามที่อัลลอฮ์ทรงประทานมาให้แก่เขา อัลลอฮ์มิได้ทรงให้เป็นที่ลำบากแก่ชีวิตใด เว้นแต่ตามที่พระองค์ทรงประทานมาแก่ชีวิตนั้น หลังจากความยากลำบากอัลลอฮ์จะทรงทำให้เกิดความสะดวกสบาย",
                            "verse 65:8": "มีชาวเมืองกี่มากน้อยแล้วที่ฝ่าฝืนพระบัญชาของพระเจ้าของพวกเขาและบรรดาร่อซู้ลของพระองค์ เราได้ชำระพวกเขาด้วยการชำระอย่างเข้มงวด และเราได้ลงโทษพวกเขาด้วยการลงโทษอย่างหนัก",
                            "verse 65:9": "ดังนั้น พวกเขาจึงได้ลิ้มรสผลร้ายแห่งกิจกรรมของพวกเขา และบั้นปลายแห่งกิจกรรมของพวกเขา คือการขาดทุน ความหายนะ",
                            "verse 65:10": "อัลลอฮ์ทรงเตรียมการลงโทษอย่างหนักไว้สำรหับพวกเขาแล้ว ดังนั้นจงยำเกรงอัลลอฮ์เถิด โอ้บรรดาผู้มีสติปัญญาที่ศรัทธาเอ๋ย เพราะแน่นอนอัลลอฮ์ได้ทรงประทานข้อเตือนสติ (อัลกุรอาน) ลงมาให้แก่พวกเจ้าแล้ว",
                            "verse 65:11": "(และ) ร่อซู้ลท่านหนึ่ง (มุฮัมมัด) มาสาธยายอายาตต่าง ๆ อันชัดแจ้งของอัลลอฮ์แก่พวกเจ้า เพื่อจะได้นำบรรดาผู้ศรัทธาและกระทำความดีทั้งหลายออกจากความมืดทึบทั้งมวลสู่แสงสว่าง ส่วนผู้ใดศรัทธาต่ออัลลอฮ์และกระทำความดี พระองค์จะทรงให้เขาเข้าสวนสวรรค์หลากหลาย ณ เบื้องล่างสวนสวรรค์นั้นมีลำน้ำหลายสายไหลผ่าน พวกเขาเป็นผู้พำนักอยู่ในนั้นตลอดกาล แน่นอนได้ทรงจัดปัจจัยยังชีพอย่างดีเลิศไว้ให้แก่เขาแล้ว",
                            "verse 65:12": "อัลลอฮ์ผู้ทรงสร้างชั้นฟ้าทั้งเจ็ด และทรงสร้างแผ่นดินก็เยี่ยงนั้น พระบัญชาจะลงมาท่ามกลางมันทั้งหลาย (ชั้นฟ้าและแผ่นดิน) เพื่อพวกเจ้าจะได้รู้ว่า แท้จริงอัลลอฮ์นั้นเป็นผู้ทรงอานุภาพเหนือทุกสิ่งอย่าง และแท้จริงอัลลอฮ์นั้นทรงห้อมล้อมทุกสิ่งอย่างไว้ด้วยความรอบรู้ (ของพระองค์)"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "Ey Peygamber! Kadınları boşayacağınızda, onları iddetlerini gözeterek boşayın ve iddeti de sayın.",
                            "verse 65:2": "İddet müddetlerini doldurduklarında onları ya meşru ölçüler içerisinde (nikâhınız altında) tutun veya onlardan meşru ölçülere göre ayrılın.",
                            "verse 65:3": "Ve",
                            "verse 65:4": "ona beklemediği yerden rızık verir.",
                            "verse 65:5": "Kadınlarınız içinden âdetten kesilmiş olanlarla, âdet görmeyenler hususunda tereddüt ederseniz, onların bekleme süresi üç aydır.",
                            "verse 65:6": "İşte bu, Allah'ın size indirdiği buyruğudur.",
                            "verse 65:7": "Onları gücünüz ölçüsünde oturduğunuz yerin bir bölümünde oturtun, onları sıkıştırıp (gitmelerini sağlamak için) kendilerine zarar vermeye kalkışmayın.",
                            "verse 65:8": "İmkânı geniş olan, nafakayı imkânlarına göre versin; rızkı daralmış bulunan da Allah'ın kendisine verdiği kadarından nafaka ödesin.",
                            "verse 65:9": "Rabbinin ve O'nun elçilerinin emrinden uzaklaşıp azmış nice memleketler vardır ki, biz onları (ahalisini) çetin bir hesaba çekmiş ve onları görülmemiş azaba çarptırmışızdır.",
                            "verse 65:10": "Böylece onlar da yaptıklarının karşılığını tatmışlar ve işlerinin sonu tam bir hüsran olmuştur.",
                            "verse 65:11": "Allah onlara şiddetli bir azap hazırlamıştır.",
                            "verse 65:12": "İman edip sâlih amel işleyenleri, karanlıklardan aydınlığa çıkarmak için size Allah'ın apaçık âyetlerini okuyan bir Peygamber göndermiştir.",
                            "verse 65:13": "Allah, yedi kat göğü ve yerden bir o kadarını yaratandır."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "اے پیغمبر (مسلمانوں سے کہہ دو کہ) جب تم عورتوں کو طلاق دینے لگو تو عدت کے شروع میں طلاق دو اور عدت کا شمار رکھو۔ اور خدا سے جو تمہارا پروردگار ہے ڈرو۔ (نہ تو تم ہی) ان کو (ایام عدت میں) ان کے گھروں سے نکالو اور نہ وہ (خود ہی) نکلیں۔ ہاں اگر وہ صریح بیحیائی کریں (تو نکال دینا چاہیئے) اور یہ خدا کی حدیں ہیں۔ جو خدا کی حدوں سے تجاوز کرے گا وہ اپنے آپ پر ظلم کرے گا۔ (اے طلاق دینے والے) تجھے کیا معلوم شاید خدا اس کے بعد کوئی (رجعت کی) سبیل پیدا کردے",
                            "verse 65:2": "اے نبي! (مسلمانوں سے فرما ديں:) جب تم عورتوں کو طلاق دينا چاہو تو اُن کے طُہر کے زمانہ ميں انہيں طلاق دو اور عِدّت کو شمار کرو، اور اللہ سے ڈرتے رہو جو تمہارا رب ہے، اور انہيں اُن کے گھروں سے باہر مت نکالو اور نہ وہ خود باہر نکليں سوائے اس کے کہ وہ کھلي بے حيائي کر بيٹھيں، اور يہ اللہ کي (مقررّہ) حديں ہيں، اور جو شخص اللہ کي حدود سے تجاوز کرے تو بيشک اُس نے اپني جان پر ظلم کيا ہے، (اے شخص!) تو نہيں جانتا شايد اللہ اِس کے (طلاق دينے کے) بعد (رجوع کي) کوئي نئي صورت پيدا فرما دےo",
                            "verse 65:3": "پھر جب وہ اپني مقررہ ميعاد (کے ختم ہونے) کے قريب پہنچ جائيں تو انہيں بھلائي کے ساتھ (اپني زوجيت ميں) روک لو يا انہيں بھلائي کے ساتھ جدا کردو? اور اپنوں ميں سے دو عادل مَردوں کو گواہ بنا لو اور گواہي اللہ کے لئے قائم کيا کرو، اِن (باتوں) سے اسي شخص کو نصيحت کي جاتي ہے جو اللہ اور يومِ آخرت پر ايمان رکھتا ہے، اور جو اللہ سے ڈرتا ہے وہ اس کے لئے (دنيا و آخرت کے رنج و غم سے) نکلنے کي راہ پيدا فرما ديتا ہےo",
                            "verse 65:4": "پھر جب وہ اپنی میعاد (یعنی انقضائے عدت) کے قریب پہنچ جائیں تو یا تو ان کو اچھی طرح (زوجیت میں) رہنے دو یا اچھی طرح سے علیحدہ کردو اور اپنے میں سے دو منصف مردوں کو گواہ کرلو اور (گواہ ہو!) خدا کے لئے درست گواہی دینا۔ ان باتوں سے اس شخص کو نصیحت کی جاتی ہے جو خدا پر اور روز آخرت پر ایمان رکھتا ہے۔ اور جو کوئی خدا سے ڈرے گا وہ اس کے لئے (رنج ومحن سے) مخلصی (کی صورت) پیدا کرے گا",
                            "verse 65:5": "اور اس کو ایسی جگہ سے رزق دے گا جہاں سے (وہم و) گمان بھی نہ ہو۔ اور جو خدا پر بھروسہ رکھے گا تو وہ اس کو کفایت کرے گا۔ خدا اپنے کام کو (جو وہ کرنا چاہتا ہے) پورا کردیتا ہے۔ خدا نے ہر چیز کا اندازہ مقرر کر رکھا ہے",
                            "verse 65:6": "اور اسے ايسي جگہ سے رِزق عطا فرماتا ہے جہاں سے اس کا گمان بھي نہيں ہوتا، اور جو شخص اللہ پر توکل کرتا ہے تو وہ (اللہ) اسے کافي ہے، بيشک اللہ اپنا کام پورا کرلينے والا ہے، بيشک اللہ نے ہر شے کے لئے اندازہ مقرر فرما رکھا ہےo",
                            "verse 65:7": "اور تمہاري عورتوں ميں سے جو حيض سے مايوس ہو چکي ہوں اگر تمہيں شک ہو (کہ اُن کي عدّت کيا ہوگي) تو اُن کي عدّت تين مہينے ہے اور وہ عورتيں جنہيں (ابھي) حيض نہيں آيا (ان کي بھي يہي عدّت ہے)، اور حاملہ عورتيں (تو) اُن کي عدّت اُن کا وضعِ حمل ہے، اور جو شخص اللہ سے ڈرتا ہے (تو) وہ اس کے کام ميں آساني فرما ديتا ہےo",
                            "verse 65:8": "اور تمہاری (مطلقہ) عورتیں جو حیض سے ناامید ہوچکی ہوں اگر تم کو (ان کی عدت کے بارے میں) شبہ ہو تو ان کی عدت تین مہینے ہے اور جن کو ابھی حیض نہیں آنے لگا (ان کی عدت بھی یہی ہے) اور حمل والی عورتوں کی عدت وضع حمل (یعنی بچّہ جننے) تک ہے۔ اور جو خدا سے ڈرے گا خدا اس کے کام میں سہولت پیدا کردے گا",
                            "verse 65:9": "یہ خدا کے حکم ہیں جو خدا نے تم پر نازل کئے ہیں۔ اور جو خدا سے ڈرے گا وہ اس سے اس کے گناہ دور کر دے گا اور اسے اجر عظیم بخشے گا",
                            "verse 65:10": "يہ اللہ کا امر ہے جو اس نے تمہاري طرف نازل فرمايا ہے? اور جو شخص اللہ سے ڈرتا ہے وہ اُس کے چھوٹے گناہوں کو اس (کے نام? اعمال) سے مٹا ديتا ہے اور اَجر و ثواب کو اُس کے لئے بڑا کر ديتا ہےo",
                            "verse 65:11": "تم اُن (مطلّقہ) عورتوں کو وہيں رکھو جہاں تم اپني وسعت کے مطابق رہتے ہو اور انہيں تکليف مت پہنچاؤ کہ اُن پر (رہنے کا ٹھکانا) تنگ کر دو، اور اگر وہ حاملہ ہوں تو اُن پر خرچ کرتے رہو يہاں تک کہ وہ اپنا بچہ جَن ليں، پھر اگر وہ تمہاري خاطر (بچے کو) دودھ پلائيں تو انہيں اُن کا معاوضہ ادا کرتے رہو، اور آپس ميں (ايک دوسرے سے) نيک بات کا مشورہ (حسبِ دستور) کر ليا کرو، اور اگر تم باہم دشواري محسوس کرو تو اسے (اب کوئي) دوسري عورت دودھ پلائے گيo",
                            "verse 65:12": "(مطلقہ) عورتوں کو (ایام عدت میں) اپنے مقدور کے مطابق وہیں رکھو جہاں خود رہتے ہو اور ان کو تنگ کرنے کے لئے تکلیف نہ دو اور اگر حمل سے ہوں تو بچّہ جننے تک ان کا خرچ دیتے رہو۔ پھر اگر وہ بچّے کو تمہارے کہنے سے دودھ پلائیں تو ان کو ان کی اجرت دو۔ اور (بچّے کے بارے میں) پسندیدہ طریق سے مواقفت رکھو۔ اور اگر باہم ضد (اور نااتفاقی) کرو گے تو (بچّے کو) اس کے (باپ کے) کہنے سے کوئی اور عورت دودھ پلائے گی",
                            "verse 65:13": "صاحب وسعت کو اپنی وسعت کے مطابق خرچ کرنا چاہیئے۔ اور جس کے رزق میں تنگی ہو وہ جتنا خدا نے اس کو دیا ہے اس کے موافق خرچ کرے۔ خدا کسی کو تکلیف نہیں دیتا مگر اسی کے مطابق جو اس کو دیا ہے۔ اور خدا عنقریب تنگی کے بعد کشائش بخشے گا",
                            "verse 65:14": "صاحبِ وسعت کو اپني وسعت (کے لحاظ) سے خرچ کرنا چاہئے، اور جس شخص پر اُس کا رِزق تنگ کر ديا گيا ہو تو وہ اُسي (روزي) ميں سے (بطورِ نفقہ) خرچ کرے جو اُسے اللہ نے عطا فرمائي ہے? اللہ کسي شخص کو مکلّف نہيں ٹھہراتا مگر اسي قدر جتنا کہ اُس نے اسے عطا فرما رکھا ہے، اللہ عنقريب تنگي کے بعد کشائش پيدا فرما دے گاo",
                            "verse 65:15": "اور کتني ہي بستياں ايسي تھيں جن (کے رہنے والوں) نے اپنے رب کے حکم اور اُس کے رسولوں سے سرکشي و سرتابي کي تو ہم نے اُن کا سخت حساب کي صورت ميں محاسبہ کيا اور انہيں ايسے سخت عذاب ميں مبتلا کيا جو نہ ديکھا نہ سنا گيا تھاo",
                            "verse 65:16": "اور بہت سی بستیوں (کے رہنے والوں)نے اپنے پروردگار اور اس کے پیغمبروں کے احکام سے سرکشی کی تو ہم نے ان کو سخت حساب میں پکڑ لیا اور ان پر (ایسا) عذاب نازل کیا جو نہ دیکھا تھا نہ سنا",
                            "verse 65:17": "سو انہوں نے اپنے کاموں کی سزا کا مزہ چکھ لیا اور ان کا انجام نقصان ہی تو تھا",
                            "verse 65:18": "سو انہوں نے اپنے کئے کا وبال چکھ ليا اور اُن کے کام کا انجام خسارہ ہي ہواo",
                            "verse 65:19": "اللہ نے اُن کے لئے (آخرت ميں بھي) سخت عذاب تيار کر رکھا ہے? سو اللہ سے ڈرتے رہا کرو اے عقل والو! جو ايمان لے آئے ہو، بيشک اللہ نے تمہاري (ہي) طرف نصيحتِ (قرآن) کو نازل فرمايا ہےo",
                            "verse 65:20": "خدا نے ان کے لئے سخت عذاب تیار کر رکھا ہے۔ تو اے ارباب دانش جو ایمان لائے ہو خدا سے ڈرو۔ خدا نے تمہارے پاس نصیحت (کی کتاب) بھیجی ہے",
                            "verse 65:21": "(اور اپنے) پیغمبر (بھی بھیجے ہیں) جو تمہارے سامنے خدا کی واضح المطالب آیتیں پڑھتے ہیں تاکہ جو لوگ ایمان لائے اور عمل نیک کرتے رہے ہیں ان کو اندھیرے سے نکال کر روشنی میں لے آئیں اور جو شخص ایمان لائے گا اور عمل نیک کرے گا ان کو باغہائے بہشت میں داخل کرے گا جن کے نیچے نہریں بہہ رہیں ہیں ابد الاآباد ان میں رہیں گے۔ خدا نے ان کو خوب رزق دیا ہے",
                            "verse 65:22": "(اور) رسول (صلي اللہ عليہ وآلہ وسلم) کو (بھي بھيجا ہے) جو تم پر اللہ کي واضح آيات پڑھ کر سناتے ہيں تاکہ اُن لوگوں کو جو ايمان لائے ہيں اور نيک اعمال کرتے ہيں تاريکيوں سے نکال کر روشني کي طرف لے جائے، اور جو شخص اللہ پر ايمان رکھتا ہے اور نيک عمل کرتا ہے وہ اسے ان جنتوں ميں داخل فرمائے گا جن کے نيچے سے نہريں رواں ہيں وہ ان ميں ہميشہ رہنے والے ہيں، بيشک اللہ نے اُس کے لئے نہايت عمدہ رزق (تيار کر) رکھا ہےo",
                            "verse 65:23": "اللہ (ہي) ہے جس نے سات آسمان پيدا فرمائے اور زمين (کي تشکيل) ميں بھي انہي کي مِثل (تہ بہ تہ سات طبقات بنائے)، ان کے درميان (نظامِ قدرت کي تدبير کا) امر اترتا رہتا ہے تاکہ تم جان لو کہ اللہ ہر چيز پر بڑا قادر ہے، اور يہ کہ اللہ نے ہر چيز کا اپنے علم سے احاطہ فرما رکھا ہے (يعني آنے والے زمانوں ميں جب سائنسي اکتشافات کامل ہوں گے تو تمہيں اللہ کي قدرت اور علمِ محيط کي عظمت کا اندازہ ہو جائے گا کہ کس طرح اُس نے صديوں قبل ان حقائق کو تمہارے لئے بيان فرما رکھا ہے)o",
                            "verse 65:24": "خدا ہی تو ہے جس نے سات آسمان پیدا کئے اور ایسی ہی زمینیں۔ ان میں (خدا کے) حکم اُترتے رہتے ہیں تاکہ تم لوگ جان لو کہ خدا چیز پر قادر ہے۔ اور یہ کہ خدا اپنے علم سے ہر چیز پر احاطہ کئے ہوئے ہے ہے)o"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 65:1": "Эй Набий! Агар аёлларни талоқ қиладиган бўлсангиз, иддалари учун қилинг ва иддани ҳисобланг ва Алоҳга тақво қилинг.",
                            "verse 65:2": "Бас, улар муддатларига етсалар, яхшилик билан ушланглар, ёки яхшилик билан ажралинглар ва сиздан икки адолатли кишини гувоҳ қилинглар.",
                            "verse 65:3": "Ва унга ўзи ўйламаган тарафдан ризқ берур.",
                            "verse 65:4": "Аёлларингиздан ҳайздан ноумид бўлганларининг иддаси, агар шубҳангиз бўлса, уч ойдир.",
                            "verse 65:5": "Булар Аллоҳнинг сизга туширган амридир.",
                            "verse 65:6": "У(аёл)ларга имконингиз борича ўзингиз яшаб турган жойдан жой беринг.",
                            "verse 65:7": "Ризқи кенг кенглигидан нафақа қилсин.",
                            "verse 65:8": "Кўпгина қишлоқлар ўз Роббисин амрига саркашлик қилди.",
                            "verse 65:9": "Бас, улар ўз ишларининг ёмонлигини тотиб кўрдилар ва ишларининг оқибати ютқизиқ бўлди.",
                            "verse 65:10": "Аллоҳ уларга қаттиқ азобни тайёрлаб қўйди.",
                            "verse 65:11": "Пайғабарники, у иймон келтириб ва яхши амалларни қилганларни зулматлардан нурга чиқариш учун, сизларга Аллоҳнинг равшан оятларини тиловат қилиб берур.",
                            "verse 65:12": "Аллоҳ етти осмонни ва улар мислидек ерни яратган зотдир."
                        }
                    }
                }
            }
        }
    }
}