{
    "id": 70,
    "name_simple": "Al-Ma'arij",
    "revelation_place": "makkah",
    "revelation_order": 79,
    "bismillah_pre": true,
    "verses_count": 44,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah takes its name from the word dhil Ma'arij in verse 3.",
    "text": [
        "\n",
        "The Surah takes its name from the word dhil Ma'arij in verse 3.",
        "\n",
        "Period of Revelation",
        "\n",
        "The subject matter bears evidence that this Surah too was sent down in conditions closely resembling those under which Surah Al Haaqqah was sent down.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "It admonishes and gives warning to the disbelievers who made fun of the news about Resurrection and the Hereafter, and Hell and Heaven, and challenged the Holy Prophet (upon whom be peace) to cause Resurrection with which he threatened them to take place if what he said was true and they had become worthy of the punishment in Hell by denying it. The whole Surah is meant to answer this denial.",
        "\n",
        "The Surah opens with words to the effect:\"A demander has demanded a torment, the torment which must befall the deniers; and when it takes place, there will be none to prevent it, but it will take place at its own appointed time. Allah has His own way of doing things, but He is not unjust. Therefore, have patience, O Prophet, at what they say. They think it is far off, but We see it as near at hand.\"",
        "\n",
        "Then it is said:\"Resurrection, which they desire to be hastened out of jest and fun, is terrible, and when it comes, it will cause great distress to the culprits. At that time they will even be prepared to give away their wives and children and their nearest kinsfolk in ransom to escape the punishment, but they will not be able to escape it.",
        "\n",
        "Then the people have been warned to the effect; \"On that Day the destinies of men will be decided strictly on the basis of their belief and their conduct. Those who turn away from the Truth in the world and amass wealth and withhold it from the needy, will be doomed to Hell; and those who fear the punishment of God here, believe in the Hereafter, keep up the Prayer, discharge the rights of the needy out of their wealth, strictly avoid immoral and wicked deeds, practice honesty in all their dealings, fulfill their pledges and trust and bear true witness, will have a place of honor in Paradise\"",
        "\n",
        "In conclusion, the disbelievers of Makkah who rushed in upon the Holy Prophet (upon whom be peace) from every side as soon as they saw him, in order to make fun of him, have been warned to the effect: \"If you do not believe, Allah will replace you by other people who will be better than you\", and the Holy Prophet (upon whom be peace) has been consoled, so as to say: \"Do not take to heart their mockery and jesting; leave them to indulge in their idle talk and foolish conduct if they are bent upon experiencing the disgrace and humiliation of the Resurrection; they will themselves see their evil end.\"'",
        "\n"
    ],
    "description": "The surah that proclaims God to be the Lord of the heavenly ascents, Lofty Stations, the points of rising from which the angels ascend to God. It takes is named after the phrase “of lofty stations” (dhi al-maʿārij) in verse 3. The surah describes the Day of Judgement (verse 8 .). One of the opponents of the Prophet challenged him to hasten the punishment they had been threatened with (verse 1), so the foolishness of the disbelievers in denying the Resurrection (verse 6) is exposed (verse 36 .). The people who will be granted the Garden are described (verse 22 .).The surah is also known as: Elevations, Staircases Upward, The Ascending Steps, The Heavenly Ascents, The Ladders, The Stairways, The Steps, The Ways of Ascent.",
    "name_complex": "Al-Ma‘ârij",
    "surah_name_ar": "المعارج",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 70:1": "Një kurreshtar ka pyetur për dënimin që do të ngjajë,",
                            "verse 70:2": "ndaj jobesimtarëve, - për të cilin dënim s’ka pengues,",
                            "verse 70:3": "(ai dënim është) prej Perëndisë, Zotit të shkallëve të larta (të mirësisë),",
                            "verse 70:4": "ngjiten (hipin) tek Ai engjëjt dhe Shpirti (Xhebraili) në një ditë që zgjatë sa pesëdhjetë mijë vjet (sipas llogarisë së kohës sonë në Tokë),",
                            "verse 70:5": "andaj, bëhu i durueshëm, me durim të bukur.",
                            "verse 70:6": "Ata, me të vërtetë, (dënimin) e mendojnë të largët (të pamundshëm),",
                            "verse 70:7": "kurse Ne, e dimë të afërt,",
                            "verse 70:8": "atë Ditë kur qielli do të bëhet si llom i vajit,",
                            "verse 70:9": "e malet do të bëhen si lesh (i shprishur) llojlloj ngjyrash;",
                            "verse 70:10": "kur i afërmi nuk pyet asgjë për të afërmin,",
                            "verse 70:11": "e, njëri-tjetrin do ta shohin.",
                            "verse 70:12": "me gruan e vet dhe vëllain e vet,",
                            "verse 70:13": "dhe me farefisin e tij të ngushtë,",
                            "verse 70:14": "si dhe me të gjithë ata që gjenden në faqe të Tokës – vetëm për të shpëtuar.",
                            "verse 70:15": "Jo, kurrsesi! Ai është zjarri,",
                            "verse 70:16": "që duke e kapur për kokë,",
                            "verse 70:17": "e tërheq kah veti atë (njeri) që ia ka kthyer shpinën dhe i është shmangur të vërtetës!",
                            "verse 70:18": "Dhe ka grumbulluar (pasuri) dhe ka depozituar (duke mos dhënë asgjë).",
                            "verse 70:19": "Njeriu, me të vërtetë, është krijuar lakmus vetjak:",
                            "verse 70:20": "kur e goditë e liga – dëshpërohet",
                            "verse 70:21": "e kur t’i bie e mira – bëhet koprrac (nuk jep – refuzon),",
                            "verse 70:22": "pos besimtarëve,",
                            "verse 70:23": "të cilët në lutjet e veta (namaz) janë të qëndrueshëm;",
                            "verse 70:24": "dhe që në pasurinë e tyre ka të caktuar një pjesë,",
                            "verse 70:25": "për lypësin dhe për të varfërin (që nuk e zgjatë dorën),",
                            "verse 70:26": "dhe ata që besojnë Ditën e Kijametit",
                            "verse 70:27": "dhe ata që druajnë nga dënimi i Zotit të tyre, -",
                            "verse 70:28": "e, me të vërtetë, (askush) nuk është i sigurtë prej dënimit të Zotit të vet –",
                            "verse 70:29": "dhe ata që i ruajnë pjesët e turpshme të organizmit të vet,",
                            "verse 70:30": "përveç ndaj bashkëshorteve të tyre dhe ato që i kanë në pronësi – at, a me të vërtetë, nuk meritojnë qortim, -",
                            "verse 70:31": "e kush kërkon jashtë këtyre caqeve, është kundërvajtës,",
                            "verse 70:32": "edhe ata që i ruajnë amanetet dhe i plotësojnë obligimet e tyre,",
                            "verse 70:33": "edhe ata që dëshminë e tyre e zbatojnë",
                            "verse 70:34": "edhe ata të cilët e kryejnë namazin (në kohën) e rregullt,",
                            "verse 70:35": "ata në kopshtie të xhennetit do të nderohen.",
                            "verse 70:36": "Përse jobesimtarët nxitojnë kah ti;",
                            "verse 70:37": "djathtas e majtas, tuba-tuba?!",
                            "verse 70:38": "E që çdonjëri prej tyre dëshiron të hyjë në xhennetin e dhuntive (pa merita)? –",
                            "verse 70:39": "Kurrsesi! Ne, me të vërtetë, i kemi krijuar ata, prej asaj që e dinë!",
                            "verse 70:40": "Dhe, Unë betohem me Zotin e lindjes dhe të perëndimit, që ne mundemi",
                            "verse 70:41": "t’i ndërrojmë ata me më të mirë prej tyre dhe Ne nuk jeni të penguar.",
                            "verse 70:42": "Andaj, lëri ti ata le të zbaviten me gjëra të kota dhe të luajnë përderisa të hasin në Ditën e tyre të caktuar,",
                            "verse 70:43": "Dita në të cilën dalin nga varrezat duke vrapuar, thuajse po nxitojnë te idolet e tyre,",
                            "verse 70:44": "me sy të varur që i ka kapluar poshtërimi."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "(Kafirlərdən) biri vaqe olacaq əzab (qiyamət əzabının nə vaxt və kimə üz verəcəyi) barədə soruşdu.",
                            "verse 70:2": "(O əzabı) kafirlərdən dəf edə biləcək bir kimsə yoxdur!",
                            "verse 70:3": "(O əzab yüksək) dərəcələr sahibi olan Allahdandır!",
                            "verse 70:4": "Mələklər və ruh (Cəbrail) Onun dərgahına (dünya ilə müqayisədə) müddəti əlli min il olan bir gündə qalxarlar.",
                            "verse 70:5": "(Ya Peyğəmbər! Kafirlərin əziyyətlərinə) mətanətlə (heç bir təlaş, narahatlıq keçirmədən) səbr et!",
                            "verse 70:6": "Şübhəsiz ki, onlar (müşriklər) onu (o əzabı) uzaq görürlər (ona inanmırlar).",
                            "verse 70:7": "Biz isə onu yaxın görürük (ona inanırıq).",
                            "verse 70:8": "O gün göy göyərmiş mis kimi olacaq;",
                            "verse 70:9": "Dağlar da didilmiş (rəngbərəng) yun kimi olacaqdır.",
                            "verse 70:10": "Və dost dostu arayıb axtarmayacaqdır (hərə öz hayına qalacaqdır).",
                            "verse 70:11": "Onlar bir-birinə göstəriləcəklər (lakin bir-birini tanısalar da, özlərini tanımamazlığa vurub bir-birindən qaçacaqlar).",
                            "verse 70:12": "?vrətini və qardaşını;",
                            "verse 70:13": "(Cətin günlərdə) ona sığınacaq verən əşirətini (qohum-əqrabasını);",
                            "verse 70:14": "Və yer üzündə olanların hamısını - təki özünü (Allahın əzabından) qurtarsın!",
                            "verse 70:15": "Xeyr (bu mümkün deyildir).",
                            "verse 70:16": "(Elə bir atəş ki) başın dərisini sıyırıb çıxardır (dərini sümükdən ayırır).",
                            "verse 70:17": "Cağırır (o Cəhənnəm itaətdən) çıxanı, (imandan) üz döndərəni",
                            "verse 70:18": "Və (mal-dövlət) yığıb saxlayanı! (Allahın payını verməyəni; acizə, yoxsula əl tutmayanı!)",
                            "verse 70:19": "Həqiqətən, insan (sərvətə) çox həris (tamahkar və kəmhövsələ) yaradılmışdır!",
                            "verse 70:20": "Ona bir pislik üz verdikdə fəryad qoparar.",
                            "verse 70:21": "Ona bir xeyir nəsib olduqda isə xəsis olar.",
                            "verse 70:22": "Namaz qılanlar istisnadır!",
                            "verse 70:23": "O kəslər ki, daim namaz qılarlar;",
                            "verse 70:24": "O kəslər ki, onların mallarında müəyyən bir haqq (pay) vardır -",
                            "verse 70:25": "Dilənən və (hər şeydən) məhrum olan (lakin abrına qısılıb dilənməyən) kimsə üçün;",
                            "verse 70:26": "O kəslər ki, haqq-hesab gününü təsdiq edərlər;",
                            "verse 70:27": "O kəslər ki, Rəbbinin əzabından qorxub tir-tir əsərlər;",
                            "verse 70:28": "Cünki onların Rəbbinin əzabından (bu əzabın kiməsə toxunub-toxunmayacağından) arxayın olmaq olmaz;",
                            "verse 70:29": "O kəslər ki, ayıb yerlərini qoruyub saxlayarlar (zina etməzlər);",
                            "verse 70:30": "?vrətləri və cariyələri istisna olmaqla.",
                            "verse 70:31": "Bundan artığını istəyənlər isə həddi aşanlardır;",
                            "verse 70:32": "O kəslər ki, əmanətə xəyanət etməz, verdikləri sözü yerinə yetirərlər;",
                            "verse 70:33": "O kəslər ki, düzgün şəhadət verərlər",
                            "verse 70:34": "Və o kəslər ki, namazlarını (layiqincə) hifz edərlər-",
                            "verse 70:35": "Məhz onlar cənnətlərdə ehtiram olunacaq (əzizlənəcək) kimsələrdir!",
                            "verse 70:36": "(Ya Peyğəmbər!) Kafirlərə nə olub ki, (boyunlarını qabağa uzadıb) sənə tərəf tələsirlər?",
                            "verse 70:37": "Sağdan və soldan dəstə-dəstə gəlirlər?",
                            "verse 70:38": "Məgər onların hər biri Nəim cənnətlərinəmi daxil olacağına ümid edir?",
                            "verse 70:39": "Xeyr! (Bu ola bilməz).",
                            "verse 70:40": "Məşriqlərin və məğriblərin Rəbbinə and olsun ki, Biz, həqiqətən, qadirik.",
                            "verse 70:41": "Onları özlərindən daha yaxşısı ilə əvəz etməyə (onları məhv edib yerlərinə Allaha müt'i olan başqa bir məxluq gətirməyə).",
                            "verse 70:42": "Elə isə (ya Peyğəmbər!) qoy onlar və'd olunduqları günə qovuşanadək (batil əməllərinə) dalsınlar və oynayıb-əylənsinlər!",
                            "verse 70:43": "O gün onlar (dünyada ibadət etdikləri) bütlərin yanına tələsirmişlər kimi qəbirlərdən tez-tələsik çıxacaqlar.",
                            "verse 70:44": "Onların gözləri zəlilcəsinə yerə dikiləcək, özlərini də zillət bürüyəcəkdir."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "Neko je zatražio da se kazna izvrši",
                            "verse 70:2": "nad nevjernicima - niko ne može spriječiti",
                            "verse 70:3": "da to Allah, Gospodar nebesa, ne učini,",
                            "verse 70:4": "k Njemu se penju meleki i Džibril u danu koji pedeset hiljada godina traje,",
                            "verse 70:5": "zato ti budi strpljiv ne jadikujući,",
                            "verse 70:6": "Oni misle da se dogoditi neće,",
                            "verse 70:7": "a Mi znamo da sigurno hoće,",
                            "verse 70:8": "onoga Dana kada nebo bude kao talog od zejtina,",
                            "verse 70:9": "a brda kao vuna šarena,",
                            "verse 70:10": "kada bližnji neće bližnjega ništa pitati,",
                            "verse 70:11": "iako će jedni druge vidjeti.",
                            "verse 70:12": "i ženom svojom, i bratom svojim,",
                            "verse 70:13": "i porodicim svojom koja ga štiti,",
                            "verse 70:14": "i svima ostalima na Zemlji - samo da se izbavi.",
                            "verse 70:15": "Nikada! Ona će buktinja sama biti",
                            "verse 70:16": "koja će udove čupati,",
                            "verse 70:17": "zvaće onoga ko je glavu okretao i izbjegavao",
                            "verse 70:18": "i zgrtao i skrivao.",
                            "verse 70:19": "Čovjek je, uistinu, stvoren malodušan:",
                            "verse 70:20": "kada ga nevolja snađe - brižan je,",
                            "verse 70:21": "a kada mu je dobro - nepristupačan je,",
                            "verse 70:22": "osim vjernika,",
                            "verse 70:23": "koji molitve svoje budu na vrijeme obavljali,",
                            "verse 70:24": "i oni u čijim imecima bude određen dio",
                            "verse 70:25": "za onoga koji prosi i za onoga koji ne prosi,",
                            "verse 70:26": "i oni koji u onaj svijet budu vjerovali,",
                            "verse 70:27": "i oni koji od kazne Gospodara svoga budu strahovali -",
                            "verse 70:28": "a od kazne Gospodara svoga niko nije siguran -",
                            "verse 70:29": "i oni koji stidna mjesta svoja budu čuvali",
                            "verse 70:30": "i živjeli jedino sa ženama svojim ili sa onima koje su u vlasništvu njihovu - oni, doista, prijekor ne zaslužuju -",
                            "verse 70:31": "a oni koji traže izvan toga, oni u grijeh upadaju,",
                            "verse 70:32": "i oni koji povjerene im amanete budu čuvali i obaveze svoje ispunjavali,",
                            "verse 70:33": "i oni koji dug svjedočenja svoga budu izvršavali,",
                            "verse 70:34": "i oni koji molitve svoje budu revnosno obavljali -",
                            "verse 70:35": "oni će u džennetskim baščama biti počašćeni.",
                            "verse 70:36": "Zašto se nevjernici prema tebi žure,",
                            "verse 70:37": "zdesna i slijeva, u gomilama?!",
                            "verse 70:38": "Kako svaki od njih žudi da u Džennet uživanja uđe?",
                            "verse 70:39": "Nikada! Mi ih stvaramo, od čega - oni znaju!",
                            "verse 70:40": "I Ja se kunem Gospodarom istoka i zapada da ih možemo",
                            "verse 70:41": "boljim od njih zamijeniti i niko nas u tome ne može spriječiti.",
                            "verse 70:42": "Zato ih ostavi neka se napričaju i nazabavljaju dok Dan kojim im se prijeti ne dočekaju,",
                            "verse 70:43": "Dan u kome će žurno kao da kumirima hrle iz grobova izići,",
                            "verse 70:44": "oborenih pogleda i poniženjem oprhvani."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "একব্যক্তি চাইল, সেই আযাব সংঘটিত হোক যা অবধারিত-",
                            "verse 70:2": "কাফেরদের জন্যে, যার প্রতিরোধকারী কেউ নেই।",
                            "verse 70:3": "তা আসবে আল্লাহ তা’আলার পক্ষ থেকে, যিনি সমুন্নত মর্তবার অধিকারী।",
                            "verse 70:4": "ফেরেশতাগণ এবং রূহ আল্লাহ তা’আলার দিকে উর্ধ্বগামী হয় এমন একদিনে, যার পরিমাণ পঞ্চাশ হাজার বছর।",
                            "verse 70:5": "অতএব, আপনি উত্তম সবর করুন।",
                            "verse 70:6": "তারা এই আযাবকে সুদূরপরাহত মনে করে,",
                            "verse 70:7": "আর আমি একে আসন্ন দেখছি।",
                            "verse 70:8": "সেদিন আকাশ হবে গলিত তামার মত।",
                            "verse 70:9": "এবং পর্বতসমূহ হবে রঙ্গীন পশমের মত,",
                            "verse 70:10": "বন্ধু বন্ধুর খবর নিবে না।",
                            "verse 70:11": "যদিও একে অপরকে দেখতে পাবে। সেদিন গোনাহগার ব্যক্তি পনস্বরূপ দিতে চাইবে তার সন্তান-সন্ততিকে,",
                            "verse 70:12": "তার স্ত্রীকে, তার ভ্রাতাকে,",
                            "verse 70:13": "তার গোষ্ঠীকে, যারা তাকে আশ্রয় দিত।",
                            "verse 70:14": "এবং পৃথিবীর সবকিছুকে, অতঃপর নিজেকে রক্ষা করতে চাইবে।",
                            "verse 70:15": "কখনই নয়। নিশ্চয় এটা লেলিহান অগ্নি।",
                            "verse 70:16": "যা চামড়া তুলে দিবে।",
                            "verse 70:17": "সে সেই ব্যক্তিকে ডাকবে যে সত্যের প্রতি পৃষ্ঠপ্রদর্শন করেছিল ও বিমুখ হয়েছিল।",
                            "verse 70:18": "সম্পদ পুঞ্জীভূত করেছিল, অতঃপর আগলিয়ে রেখেছিল।",
                            "verse 70:19": "মানুষ তো সৃজিত হয়েছে ভীরুরূপে।",
                            "verse 70:20": "যখন তাকে অনিষ্ট স্পর্শ করে, তখন সে হা-হুতাশ করে।",
                            "verse 70:21": "আর যখন কল্যাণপ্রাপ্ত হয়, তখন কৃপণ হয়ে যায়।",
                            "verse 70:22": "তবে তারা স্বতন্ত্র, যারা নামায আদায় কারী।",
                            "verse 70:23": "যারা তাদের নামাযে সার্বক্ষণিক কায়েম থাকে।",
                            "verse 70:24": "এবং যাদের ধন-সম্পদে নির্ধারিত হক আছে",
                            "verse 70:25": "যাঞ্ছাকারী ও বঞ্চিতের",
                            "verse 70:26": "এবং যারা প্রতিফল দিবসকে সত্য বলে বিশ্বাস করে।",
                            "verse 70:27": "এবং যারা তাদের পালনকর্তার শাস্তির সম্পর্কে ভীত-কম্পিত।",
                            "verse 70:28": "নিশ্চয় তাদের পালনকর্তার শাস্তি থেকে নিঃশঙ্কা থাকা যায় না।",
                            "verse 70:29": "এবং যারা তাদের যৌন-অঙ্গকে সংযত রাখে",
                            "verse 70:30": "কিন্তু তাদের স্ত্রী অথবা মালিকানাভূক্ত দাসীদের বেলায় তিরস্কৃত হবে না।",
                            "verse 70:31": "অতএব, যারা এদের ছাড়া অন্যকে কামনা করে, তারাই সীমালংঘনকারী।",
                            "verse 70:32": "এবং যারা তাদের আমানত ও অঙ্গীকার রক্ষা করে",
                            "verse 70:33": "এবং যারা তাদের সাক্ষ্যদানে সরল-নিষ্ঠাবান",
                            "verse 70:34": "এবং যারা তাদের নামাযে যত্নবান,",
                            "verse 70:35": "তারাই জান্নাতে সম্মানিত হবে।",
                            "verse 70:36": "অতএব, কাফেরদের কি হল যে, তারা আপনার দিকে উর্ধ্বশ্বাসে ছুটে আসছে।",
                            "verse 70:37": "ডান ও বামদিক থেকে দলে দলে।",
                            "verse 70:38": "তাদের প্রত্যেকেই কি আশা করে যে, তাকে নেয়ামতের জান্নাতে দাখিল করা হবে?",
                            "verse 70:39": "কখনই নয়, আমি তাদেরকে এমন বস্তু দ্বারা সৃষ্টি করেছি, যা তারা জানে।",
                            "verse 70:40": "আমি শপথ করছি উদয়াচল ও অস্তাচলসমূহের পালনকর্তার, নিশ্চয়ই আমি সক্ষম!",
                            "verse 70:41": "তাদের পরিবর্তে উৎকৃষ্টতর মানুষ সৃষ্টি করতে এবং এটা আমার সাধ্যের অতীত নয়।",
                            "verse 70:42": "অতএব, আপনি তাদেরকে ছেড়ে দিন, তারা বাকবিতন্ডা ও ক্রীড়া-কৌতুক করুক সেই দিবসের সম্মুখীন হওয়া পর্যন্ত, যে দিবসের ওয়াদা তাদের সাথে করা হচ্ছে।",
                            "verse 70:43": "সে দিন তারা কবর থেকে দ্রুতবেগে বের হবে, যেন তারা কোন এক লক্ষ্যস্থলের দিকে ছুটে যাচ্ছে।",
                            "verse 70:44": "তাদের দৃষ্টি থাকবে অবনমিত; তারা হবে হীনতাগ্রস্ত। এটাই সেইদিন, যার ওয়াদা তাদেরকে দেয়া হত। যাচ্ছে।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 70:1": "Един човек попита за неизбежното мъчение.",
                            "verse 70:2": "Никой не ще го отблъсне от неверниците.",
                            "verse 70:3": "То е от Аллах, Владетеля на небесните стъпала.",
                            "verse 70:4": "Ще се въздигнат към Него ангелите и Духът",
                            "verse 70:5": "в Ден, колкото петдесет хиляди години,",
                            "verse 70:6": "затова търпи с добро търпение [о, Мухаммад]!",
                            "verse 70:7": "Те го виждат далечен.",
                            "verse 70:8": "А Ние го виждаме близък.",
                            "verse 70:9": "В този Ден небето ще е като разтопена мед",
                            "verse 70:10": "и планините ще са като вълна,",
                            "verse 70:11": "и не ще пита приятел за приятеля,",
                            "verse 70:12": "въпреки че ще се виждат.",
                            "verse 70:13": "и съпругата си, и брат си,",
                            "verse 70:14": "и рода си, който го подслонява,",
                            "verse 70:15": "и всички, които са на земята, само за да се спаси.",
                            "verse 70:16": "Ала не! Това е лумнал Огън,",
                            "verse 70:17": "смъкващ кожата,",
                            "verse 70:18": "зове той всеки, който обръща гръб на вярата и се отвръща,",
                            "verse 70:19": "и трупа, и не раздава.",
                            "verse 70:20": "Човекът бе създаден колеблив -",
                            "verse 70:21": "щом го настигне злото - страхлив,",
                            "verse 70:22": "а щом го настигне доброто - скъперник,",
                            "verse 70:23": "освен отслужващите молитвата,",
                            "verse 70:24": "които в своята молитва са постоянни",
                            "verse 70:25": "и в чиито имоти е заделен дял",
                            "verse 70:26": "за просяка и бедняка,",
                            "verse 70:27": "и които смятат за истина Съдния ден,",
                            "verse 70:28": "и които се страхуват от мъчението на своя Господ -",
                            "verse 70:29": "мъчението на техния Господ не е безопасно,-",
                            "verse 70:30": "и които целомъдрието си пазят,",
                            "verse 70:31": "освен за техните съпруги или за владените от техните десници.",
                            "verse 70:32": "А които се стремят към друго освен това - тези са престъпващите.",
                            "verse 70:33": "И които повереното на тях, и техния обет съблюдават,",
                            "verse 70:34": "и които в своите свидетелства са правдиви,",
                            "verse 70:35": "и които молитвите си усърдно отслужват,",
                            "verse 70:36": "те ще бъдат на почит в Градините.",
                            "verse 70:37": "Какво им е на неверниците, втренчили в теб погледи",
                            "verse 70:38": "отдясно и отляво на тълпи?",
                            "verse 70:39": "Нима всеки от тях копнее да влезе в Градината на блаженството?",
                            "verse 70:40": "Ала не! Сътворихме ги от онова, което знаят.",
                            "verse 70:41": "И не! Кълна се в Господа на изгревите и на залезите, Ние сме способни",
                            "verse 70:42": "да ги заменим с по-добри от тях.",
                            "verse 70:43": "Остави ги да тънат и да се забавляват, додето срещнат своя Ден, който им е обещан!",
                            "verse 70:44": "Деня, в който ще излязат забързани от гробовете, сякаш се устремяват към идолите,",
                            "verse 70:45": "със сведен поглед, покрити с унижение."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "有人曾請求一種將發生的刑罰。",
                            "verse 70:2": "那是為不信的人們而預定的，沒有任何人能加以抵抗。",
                            "verse 70:3": "那是真主——天梯的主宰——發出的，",
                            "verse 70:4": "眾天神和精神在一日之內升到他那裡。那一日的長度是五萬年。",
                            "verse 70:5": "你安然地忍受吧。",
                            "verse 70:6": "他們以為那刑罰是很遠的，",
                            "verse 70:7": "我卻以為那是很近的。",
                            "verse 70:8": "在那日天像熔銅，",
                            "verse 70:9": "山像彩絨。",
                            "verse 70:10": "親戚相見不相同。",
                            "verse 70:11": "罪人願意贖取那日的刑罰，即使犧牲他的兒女、",
                            "verse 70:12": "他的妻子、他的弟兄，",
                            "verse 70:13": "和那收容他的血族，",
                            "verse 70:14": "以及大地上所有的人，但願那能拯救自己。",
                            "verse 70:15": "絕不然，那確是發焰的烈火，",
                            "verse 70:16": "能揭去頭皮，",
                            "verse 70:17": "能召喚轉身而逃避的人。",
                            "verse 70:18": "他曾聚積財產而加以保藏，",
                            "verse 70:19": "人確是被造成浮躁的，",
                            "verse 70:20": "遭遇災殃的時候是煩惱的，",
                            "verse 70:21": "獲得財富的時候是吝嗇的。",
                            "verse 70:22": "只有禮拜的人們，不是那樣，",
                            "verse 70:23": "他們是常守拜功的；",
                            "verse 70:24": "他們的財產中有一個定份，",
                            "verse 70:25": "是用於施濟乞丐和貧民的；",
                            "verse 70:26": "他們是承認報應之日的；",
                            "verse 70:27": "他們是畏懼他們的主的刑罰的。",
                            "verse 70:28": "他們的主的刑罰，確是難保不降臨的。",
                            "verse 70:29": "他們是保守貞操的，",
                            "verse 70:30": "除非對自己的妻子和奴婢，他們確是不因此而受責備的；",
                            "verse 70:31": "凡在這個範圍之外有所要求的人，都是過份的。",
                            "verse 70:32": "他們是尊重自己所受的信托，和自己所締的盟約的；",
                            "verse 70:33": "他們是秉公作証的；",
                            "verse 70:34": "他們是謹守拜功的。",
                            "verse 70:35": "這等人，是在樂園中受優待的。",
                            "verse 70:36": "不信道的人們，怎麼注視著你，三五成群的分列",
                            "verse 70:37": "在你的左右呢？",
                            "verse 70:38": "難道他們每個人都希望入恩澤的樂園嗎？",
                            "verse 70:39": "絕不然！我確已用他們所知道的物質創造了他們。",
                            "verse 70:40": "不然，我以一切東方和西方的主盟誓，我確是全能的，",
                            "verse 70:41": "我能以比他們更好的人代替他們，我不是無能的。",
                            "verse 70:42": "你應當任他們妄談，任他們遊戲，直到他們看到他們所被警告的日子。",
                            "verse 70:43": "在那日，他們將從墳中出來奔走，他們好像奔到牌位一樣，",
                            "verse 70:44": "同時，他們身遭凌辱，不敢仰視。那是他們被警告的日子。 在那日，他們將從墳中出來奔走，他們好像奔到牌位一樣，"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "Ptal se tázající na trest, jenž dopadne",
                            "verse 70:2": "na nevěřící: není nikoho, kdo jej odrazí,",
                            "verse 70:3": "vždyť od Boha, Pána stupňů, přichází!",
                            "verse 70:4": "Stoupají k němu po nich andělé i duch v den, jehož délka let padesát tisíc měří.",
                            "verse 70:5": "Neochvějný buď a pěkně jen vytrvej!",
                            "verse 70:6": "Nevěřící daleko vidí ten den,",
                            "verse 70:7": "zatímco my nablízku jej vidíme.",
                            "verse 70:8": "V ten den nebe bude roztavené mosazi podobné",
                            "verse 70:9": "a hory budou jak vločky vlny barevné",
                            "verse 70:10": "a nebude se ptát přítel vřelý na přítele,",
                            "verse 70:11": "ačkoliv budou na dohled.",
                            "verse 70:12": "i bratrem svým a družkou svou",
                            "verse 70:13": "a klanem vlastním, jenž mu je ochranou,",
                            "verse 70:14": "ba všemi, kdož na zemi jsou, aby se to stalo jeho záchranou.",
                            "verse 70:15": "Však pozor! Toto věru je oheň šlehající,",
                            "verse 70:16": "kůži na lebce spalující,",
                            "verse 70:17": "jenž svolává toho, kdo zády se otočil a odvrátil",
                            "verse 70:18": "a majetek shromažďoval a nakupil.",
                            "verse 70:19": "Člověk byl věru stvořen vrtkavý:",
                            "verse 70:20": "když dotkne se ho neštěstí, je ustrašený,",
                            "verse 70:21": "když dotkne se jej dobré, je odmítavý.",
                            "verse 70:22": "Ne tak ti, kdo se modlí,",
                            "verse 70:23": "kdo v modlitbách jsou vytrvalí,",
                            "verse 70:24": "kdo stanovili podíl z jmění svého",
                            "verse 70:25": "pro žebráka i nešťastníka nemajetného",
                            "verse 70:26": "a kdo den soudný za pravdivý uznávají",
                            "verse 70:27": "a trestu Pána svého se obávají",
                            "verse 70:28": "- vždyť před trestem Pána tvého nikdo jist si není -",
                            "verse 70:29": "a kdo svá pohlaví chrání",
                            "verse 70:30": "jen pro manželky své či otrokyně; a nebudou za to pokáráni -",
                            "verse 70:31": "kdož však více než po tomto touží, to věru jsou přestupníci;",
                            "verse 70:32": "a kdo svěřené opatrují a úmluvy své pevně dodržují",
                            "verse 70:33": "a kdo při svědectvích svých v pravdě stojí",
                            "verse 70:34": "a o modlitby své pilně dbají -",
                            "verse 70:35": "takoví v zahradách rajských se s poctami setkají!",
                            "verse 70:36": "Co děje se s nevěřícími, že k tobě krky natahují",
                            "verse 70:37": "a zprava i zleva se shlukují?",
                            "verse 70:38": "Žádá snad každý z nich, aby uveden byl do zahrad slastí?",
                            "verse 70:39": "Však pozor! Stvořili jsme je věru z toho, co sami dobře znají.",
                            "verse 70:40": "Však pozor! Přísahám při Pánu východů i západů, že vskutku schopni jsme",
                            "verse 70:41": "lepšími, než oni jsou, je vystřídat, a předejít se v tom nedáme.",
                            "verse 70:42": "Nech je být, ať si tlachají a hrají, až se setkají se svým dnem, jenž byl jim přislíben,",
                            "verse 70:43": "se dnem, kdy z hrobů jako by k obětištím chvátali vystoupí se spěchem,",
                            "verse 70:44": "se zrakem zahanbeným, pokryti ponížením."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "Men vraagt naar de straf, die straks zal vallen",
                            "verse 70:2": "Over de ongelovigen, die niemand kan weerhouden,",
                            "verse 70:3": "Van God, de Heer der wegen die omhoog leiden.",
                            "verse 70:4": "De engelen en de geest gaan tot Hem op, in een Dag waarvan de maat vijftig duizend jaren is.",
                            "verse 70:5": "Heb daarom gepast geduld.",
                            "verse 70:6": "Zij (de ongelovigen) zien (de straf) ver weg.",
                            "verse 70:7": "Maar Wij zien die nabij.",
                            "verse 70:8": "De Dag waarop de hemelen als gesmolten koper zullen worden",
                            "verse 70:9": "En de bergen als zachte, gekleurde wol,",
                            "verse 70:10": "En een vriend zal een vriend niet vragen,",
                            "verse 70:11": "Hoewel zij elkander kunnen zien.",
                            "verse 70:12": "En zijn vrouw en zijn broeder,",
                            "verse 70:13": "En zijn familieleden die hem een toevlucht waren,",
                            "verse 70:14": "En allen die op aarde zijn, om zich te redden.",
                            "verse 70:15": "Stellig niet! Waarlijk het is een laaiend Vuur.",
                            "verse 70:16": "Het zal zijn huid afschroeien.",
                            "verse 70:17": "Het zal hem opeisen, die zich afwendt en wegloopt",
                            "verse 70:18": "En rijkdommen verzamelt, en deze (gierig) terughoudt.",
                            "verse 70:19": "Voorwaar, de mens is geschapen met een ongeduldige aard.",
                            "verse 70:20": "Als hem kwaad overkomt, is hij vol weeklagen,",
                            "verse 70:21": "Maar als hem goed wedervaart, is hij inhalig,",
                            "verse 70:22": "Behalve degenen die bidden",
                            "verse 70:23": "En in hun gebeden volharden",
                            "verse 70:24": "En degenen in wier rijkdommen een vastgesteld deel is",
                            "verse 70:25": "Voor de bedelaar en voor hem die niet bedelen kan",
                            "verse 70:26": "En degenen die de Dag des Oordeels aannemen.",
                            "verse 70:27": "En degenen die de straf van hun Heer vrezen",
                            "verse 70:28": "Voorwaar, er is geen beveiliging voor de straf van hun Heer -",
                            "verse 70:29": "En degenen die onthouding betrachten.",
                            "verse 70:30": "- Uitgezonderd met hun vrouwen en degenen die zij bezitten, waarvoor hen geen blaam treft.",
                            "verse 70:31": "Maar degenen die buiten deze (voorschriften) handelen zijn overtreders -",
                            "verse 70:32": "En degenen die het hun toevertrouwde bewaren en hun verdragen nakomen,",
                            "verse 70:33": "En degenen die oprecht zijn in hun getuigenissen,",
                            "verse 70:34": "En degenen die hun gebeden naleven,",
                            "verse 70:35": "Zij zijn het die in de tuinen zullen worden geëerd.",
                            "verse 70:36": "Maar wat scheelt de ongelovigen die zich naar u toe spoeden",
                            "verse 70:37": "Van rechts en links in groepen?",
                            "verse 70:38": "Verwacht elk hunner de tuin van verrukking binnen te gaan?",
                            "verse 70:39": "Stellig niet! Wij zijn het Die hen hebben geschapen uit hetgeen zij weten.",
                            "verse 70:40": "Maar neen! Ik zweer als Heer van het Oosten en het westen dat Wij macht hebben,",
                            "verse 70:41": "In hun plaats betere (volkeren) dan zij voort te brengen en Wij kunnen (daarin) niet worden verhinderd.",
                            "verse 70:42": "Laten zij zich aan ijdele gesprekken overgeven en zich vermaken tot zij de Dag tegemoet gaan welke hun beloofd is,",
                            "verse 70:43": "De Dag waarop zij zich uit hun graven zullen haasten alsof zij zich naar een bepaald doel spoeden,",
                            "verse 70:44": "Met hun ogen nedergeslagen; schande zal hen bedekken."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 70:1": "A questioner questioned concerning the doom about to fall",
                            "verse 70:2": "Upon the disbelievers, which none can repel,",
                            "verse 70:3": "From Allah, Lord of the Ascending Stairways",
                            "verse 70:4": "(Whereby) the angels and the Spirit ascend unto Him in a Day whereof the span is fifty thousand years.",
                            "verse 70:5": "But be patient (O Muhammad) with a patience fair to see.",
                            "verse 70:6": "Lo! they behold it afar off",
                            "verse 70:7": "While we behold it nigh:",
                            "verse 70:8": "The day when the sky will become as molten copper,",
                            "verse 70:9": "And the hills become as flakes of wool,",
                            "verse 70:10": "And no familiar friend will ask a question of his friend",
                            "verse 70:11": "Though they will be given sight of them.",
                            "verse 70:12": "And his spouse and his brother",
                            "verse 70:13": "And his kin that harboured him",
                            "verse 70:14": "And all that are in the earth, if then it might deliver him.",
                            "verse 70:15": "But nay! for lo! it is the fire of hell",
                            "verse 70:16": "Eager to roast;",
                            "verse 70:17": "It calleth him who turned and fled (from truth),",
                            "verse 70:18": "And hoarded (wealth) and withheld it.",
                            "verse 70:19": "Lo! man was created anxious,",
                            "verse 70:20": "Fretful when evil befalleth him",
                            "verse 70:21": "And, when good befalleth him, grudging;",
                            "verse 70:22": "Save worshippers.",
                            "verse 70:23": "Who are constant at their worship",
                            "verse 70:24": "And in whose wealth there is a right acknowledged",
                            "verse 70:25": "For the beggar and the destitute;",
                            "verse 70:26": "And those who believe in the Day of Judgment,",
                            "verse 70:27": "And those who are fearful of their Lord’s doom -",
                            "verse 70:28": "Lo! the doom of their Lord is that before which none can feel secure -",
                            "verse 70:29": "And those who preserve their chastity",
                            "verse 70:30": "Save with their wives and those whom their right hands possess, for thus they are not blameworthy;",
                            "verse 70:31": "But whoso seeketh more than that, those are they who are transgressors;",
                            "verse 70:32": "And those who keep their pledges and their covenant,",
                            "verse 70:33": "And those who stand by their testimony",
                            "verse 70:34": "And those who are attentive at their worship.",
                            "verse 70:35": "These will dwell in Gardens, honoured.",
                            "verse 70:36": "What aileth those who disbelieve, that they keep staring toward thee (O Muhammad), open-eyed,",
                            "verse 70:37": "On the right and on the left, in groups ?",
                            "verse 70:38": "Doth every man among them hope to enter the Garden of Delight ?",
                            "verse 70:39": "Nay, verily.",
                            "verse 70:40": "But nay! I swear by the Lord of the rising-places and the setting-places of the planets that We verily are Able",
                            "verse 70:41": "To replace them by (others) better than them.",
                            "verse 70:42": "So let them chat and play until they meet their Day which they are promised,",
                            "verse 70:43": "The day when they come forth from the graves in haste, as racing to a goal,",
                            "verse 70:44": "With eyes aghast, abasement stupefying them: Such is the Day which they are promised."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 70:1": "A questioner asked about a Penalty to befall-",
                            "verse 70:2": "The Unbelievers, the which there is none to ward off,-",
                            "verse 70:3": "(A Penalty) from God, Lord of the Ways of Ascent.",
                            "verse 70:4": "The angels and the spirit ascend unto him in a Day the measure whereof is (as) fifty thousand years:",
                            "verse 70:5": "Therefore do thou hold Patience,- a Patience of beautiful (contentment).",
                            "verse 70:6": "They see the (Day) indeed as a far-off (event):",
                            "verse 70:7": "But We see it (quite) near.",
                            "verse 70:8": "The Day that the sky will be like molten brass,",
                            "verse 70:9": "And the mountains will be like wool,",
                            "verse 70:10": "And no friend will ask after a friend,",
                            "verse 70:11": "Though they will be put in sight of each other,- the sinner’s desire will be: Would that he could redeem himself from the Penalty of that Day by (sacrificing) his children,",
                            "verse 70:12": "His wife and his brother,",
                            "verse 70:13": "His kindred who sheltered him,",
                            "verse 70:14": "And all, all that is on earth,- so it could deliver him:",
                            "verse 70:15": "By no means! for it would be the Fire of Hell!-",
                            "verse 70:16": "Plucking out (his being) right to the skull!-",
                            "verse 70:17": "Inviting (all) such as turn their backs and turn away their faces (from the Right).",
                            "verse 70:18": "And collect (wealth) and hide it (from use)!",
                            "verse 70:19": "Truly man was created very impatient;-",
                            "verse 70:20": "Fretful when evil touches him;",
                            "verse 70:21": "And niggardly when good reaches him;-",
                            "verse 70:22": "Not so those devoted to Prayer;-",
                            "verse 70:23": "Those who remain steadfast to their prayer;",
                            "verse 70:24": "And those in whose wealth is a recognised right.",
                            "verse 70:25": "For the (needy) who asks and him who is prevented (for some reason from asking);",
                            "verse 70:26": "And those who hold to the truth of the Day of Judgment;",
                            "verse 70:27": "And those who fear the displeasure of their Lord,-",
                            "verse 70:28": "For their Lord’s displeasure is the opposite of Peace and Tranquillity;-",
                            "verse 70:29": "And those who guard their chastity,",
                            "verse 70:30": "Except with their wives and the (captives) whom their right hands possess,- for (then) they are not to be blamed,",
                            "verse 70:31": "But those who trespass beyond this are transgressors;-",
                            "verse 70:32": "And those who respect their trusts and covenants;",
                            "verse 70:33": "And those who stand firm in their testimonies;",
                            "verse 70:34": "And those who guard (the sacredness) of their worship;-",
                            "verse 70:35": "Such will be the honoured ones in the Gardens (of Bliss).",
                            "verse 70:36": "Now what is the matter with the Unbelievers that they rush madly before thee-",
                            "verse 70:37": "From the right and from the left, in crowds?",
                            "verse 70:38": "Does every man of them long to enter the Garden of Bliss?",
                            "verse 70:39": "By no means! For We have created them out of the (base matter) they know!",
                            "verse 70:40": "Now I do call to witness the Lord of all points in the East and the West that We can certainly-",
                            "verse 70:41": "Substitute for them better (men) than they; And We are not to be defeated (in Our Plan).",
                            "verse 70:42": "So leave them to plunge in vain talk and play about, until they encounter that Day of theirs which they have been promised!-",
                            "verse 70:43": "The Day whereon they will issue from their sepulchres in sudden haste as if they were rushing to a goal-post (fixed for them),-",
                            "verse 70:44": "Their eyes lowered in dejection,- ignominy covering them (all over)! such is the Day the which they are promised!"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 70:1": "A questioner asked of a chastisement about to fall",
                            "verse 70:2": "for the unbelievers, which none may avert,",
                            "verse 70:3": "from God, the Lord of the Stairways.",
                            "verse 70:4": "To Him the angels and the Spirit mount up, in a day whereof the measure is fifty thousand years.",
                            "verse 70:5": "So be thou patient with a sweet patience;",
                            "verse 70:6": "behold, they see it as if far off;",
                            "verse 70:7": "but We see it is nigh.",
                            "verse 70:8": "Upon the day when heaven shall be as molten copper",
                            "verse 70:9": "and the mountains shall be as plucked wool-tufts,",
                            "verse 70:10": "no loyal friend shall question loyal friend,",
                            "verse 70:11": "as they are given sight of them.",
                            "verse 70:12": "his companion wife, his brother,",
                            "verse 70:13": "his kin who sheltered him,",
                            "verse 70:14": "and whosoever is in the earth, all together, so that then it might deliver him.",
                            "verse 70:15": "Nay, verily it is a furnace",
                            "verse 70:16": "snatching away the scalp,",
                            "verse 70:17": "calling him who drew back and turned away,",
                            "verse 70:18": "who amassed and hoarded.",
                            "verse 70:19": "Surely man was created fretful,",
                            "verse 70:20": "when evil visits him, impatient,",
                            "verse 70:21": "when good visits him, grudging,",
                            "verse 70:22": "save those that pray",
                            "verse 70:23": "and continue at their prayers,",
                            "verse 70:24": "those in whose wealth is a right known",
                            "verse 70:25": "for the beggar and the outcast,",
                            "verse 70:26": "who confirm the Day of Doom",
                            "verse 70:27": "and go in fear of the chastisement of their Lord",
                            "verse 70:28": "(from their Lord’s chastisement none feels secure)",
                            "verse 70:29": "and guard their private parts",
                            "verse 70:30": "save from their wives and what their right hands own, then not being blameworthy",
                            "verse 70:31": "(but whoso seeks after more than that, they are the transgressors),",
                            "verse 70:32": "and who preserve their trusts and their covenant,",
                            "verse 70:33": "and perform their witnessings,",
                            "verse 70:34": "and who observe their prayers.",
                            "verse 70:35": "Those shall be in Gardens, high-honoured.",
                            "verse 70:36": "What ails the unbelievers, running with outstretched necks",
                            "verse 70:37": "towards thee on the right hand and on the left hand in knots?",
                            "verse 70:38": "What, is every man of them eager to be admitted to a Garden of Bliss?",
                            "verse 70:39": "Not so; for We have created them of what they know.",
                            "verse 70:40": "No! I swear by the Lord of the Easts and Wests, surely We are able",
                            "verse 70:41": "to substitute a better than they; We shall not be outstripped.",
                            "verse 70:42": "Then leave them alone to plunge and play until they encounter that day of theirs which they are promised,",
                            "verse 70:43": "the day they shall come forth from the tombs hastily, as if they were hurrying unto a waymark,",
                            "verse 70:44": "humbled their eyes, overspreading them abasement."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 70:1": "ONE who is minded to ask might ask about the suffering which [in the hereafter] is bound to befall",
                            "verse 70:2": "those who deny the truth.",
                            "verse 70:3": "[since it will come] from God, unto whom there are many ways of ascent:",
                            "verse 70:4": "all the angels and all the inspiration [ever granted to man] ascend unto Him",
                            "verse 70:5": "in a day the length whereof is",
                            "verse 70:6": "fifty thousand years.",
                            "verse 70:7": "Therefore, [O believer,] endure all adversity with goodly patience:",
                            "verse 70:8": "behold, men look upon that",
                            "verse 70:9": "as something far away",
                            "verse 70:10": "but We see it as near!",
                            "verse 70:11": "[It will take place] on a Day when the sky will be like molten lead,",
                            "verse 70:12": "and the mountains will be like tufts of wool,",
                            "verse 70:13": "and",
                            "verse 70:14": "no friend will ask about his friend,",
                            "verse 70:15": "though they may be in one another’s sight:",
                            "verse 70:16": "everyone who was lost in sin will on that Day but desire to ransom himself from suffering at the price of his own children,",
                            "verse 70:17": "and of his spouse, and of his brother,",
                            "verse 70:18": "and of all the kinsfolk who ever sheltered him,",
                            "verse 70:19": "and of whoever",
                            "verse 70:20": "lives on earth, all of them – so that he could but save himself.",
                            "verse 70:21": "But nay! Verily, all [that awaits him] is a raging flame,",
                            "verse 70:22": "tearing away his skin!",
                            "verse 70:23": "It will claim all such as turn their backs [on what is right], and turn away [from the truth],",
                            "verse 70:24": "and amass",
                            "verse 70:25": "and thereupon withhold [it from their fellow-men].",
                            "verse 70:26": "VERILY, man is born with a restless disposition.",
                            "verse 70:27": "[As a rule,] whenever misfortune touches him, he is filled with self-pity;",
                            "verse 70:28": "and whenever good fortune comes to him, he selfishly withholds it [from others].",
                            "verse 70:29": "Not so, however, those who consciously turn towards God in prayer,",
                            "verse 70:30": "",
                            "verse 70:31": "who incessantly persevere in their prayer;",
                            "verse 70:32": "and in whose possessions there is a due share, acknowledged [by them],",
                            "verse 70:33": "for such as ask [for help] and such as are deprived [of what is good in life];",
                            "verse 70:34": "and who accept as true the [coming of the] Day of Judgment;",
                            "verse 70:35": "and who stand in dread of their Sustainer’s chastisement",
                            "verse 70:36": "for, behold, of their Sustainer’s chastisement none may ever feel",
                            "verse 70:37": "secure;",
                            "verse 70:38": "and who are mindful of their chastity,",
                            "verse 70:39": "[not giving way to their desires] with any but their spouses – that is, those whom they rightfully possess [through wedlock] – for then, behold, they are free of all blame,",
                            "verse 70:40": "whereas such as seek to go beyond that",
                            "verse 70:41": "are truly transgressors;",
                            "verse 70:42": "and who are faithful to their trusts and to their pledges;",
                            "verse 70:43": "and who stand firm whenever they bear witness;",
                            "verse 70:44": "and who guard their prayers [from all worldly intent].",
                            "verse 70:45": "These it is who in the gardens [of paradise] shall be honoured!",
                            "verse 70:46": "WHAT, THEN, is amiss with such as are bent on denying the truth, that they run about confusedly to and fro before thee,",
                            "verse 70:47": "[coming upon thee] from the right and from the left, in crowds?",
                            "verse 70:48": "Does every one of them hope to enter [by this means] a garden of bliss?",
                            "verse 70:49": "Never! For, behold, We have created them out of something that they know [only too well]!",
                            "verse 70:50": "But nay! I call to witness [Our being] the Sustainer of all the points of sunrise and sunset: verily, well able are We",
                            "verse 70:51": "to replace them with",
                            "verse 70:52": "better than they are; for there is nothing to prevent Us [from doing what We will].",
                            "verse 70:53": "Hence, leave them to indulge in idle talk and play [with words] until they face that",
                            "verse 70:54": "Day of theirs which they have been promised",
                            "verse 70:55": "the Day when they shall come forth in haste from their graves, as if racing towards a goal-post,",
                            "verse 70:56": "with downcast eyes, with ignominy overwhelming them: that Day which they were promised again and again.",
                            "verse 70:57": "ascents”: a metonymical phrase implying that there are many ways by which man can “ascend” to a comprehension of God’s existence, and thus to spiritual “nearness” to Him – and that, therefore, it is up to each human being to avail himself of any of the ways leading towards Him (cf."
                        }
                    },
                    "5": {
                        "Martin Lings": {}
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 70:1": "A demanding person has asked for the punishment that is going to befall",
                            "verse 70:2": "the disbelievers; there is no one to avert it,",
                            "verse 70:3": "(and it will come) from Allah, the Lord of the stairways,",
                            "verse 70:4": "to whom ascend the angels and the Spirit in a day the length of which is fifty thousand years.",
                            "verse 70:5": "So, observe patience, a good patience.",
                            "verse 70:6": "They see it far off,",
                            "verse 70:7": "and We see it near.",
                            "verse 70:8": "(This punishment will befall) on the Day when the sky will be like dregs of oil,",
                            "verse 70:9": "and the mountains will be like dyed wool,",
                            "verse 70:10": "and no friend will ask about any friend,",
                            "verse 70:11": "(though) they will be made to see each other.",
                            "verse 70:12": "and his wife and his brother,",
                            "verse 70:13": "and his kindred that sheltered him,",
                            "verse 70:14": "and all those on earth, then he may redeem himself.",
                            "verse 70:15": "By no means! It is the flaming fire",
                            "verse 70:16": "that will pull out the skin of the scalp.",
                            "verse 70:17": "It will call him who had turned his back and fled away (from the truth)",
                            "verse 70:18": "and accumulated (wealth) and hoarded (it).",
                            "verse 70:19": "Indeed man is created weak in courage,",
                            "verse 70:20": "very upset when touched by evil,",
                            "verse 70:21": "and very niggard when visited by good (fortune),",
                            "verse 70:22": "except the performers of Salāh,",
                            "verse 70:23": "who are regular in their Salāh,",
                            "verse 70:24": "and those in whose riches there is a specified right",
                            "verse 70:25": "for the one who asks and the one who is deprived,",
                            "verse 70:26": "and those who believe in the Day of Judgment as true,",
                            "verse 70:27": "and those who are fearful of the torment of their Lord-",
                            "verse 70:28": "-Indeed the torment of their Lord is not something to be fearless from.",
                            "verse 70:29": "and those who guard their private parts,",
                            "verse 70:30": "except from their wives and those (slave-girls) owned by their hands,- because they are not to be blamed,",
                            "verse 70:31": "but the one who seeks (sexual gratification) beyond that, then such people are the transgressors,-",
                            "verse 70:32": "and those who are careful about their trusts and covenants,",
                            "verse 70:33": "and those who are upright in their testimonies,",
                            "verse 70:34": "and those who take due care of their Salāh .",
                            "verse 70:35": "Those will be honoured in gardens (of Jannah ).",
                            "verse 70:36": "So what has happened to those who disbelieve that they are rushing towards you",
                            "verse 70:37": "from the right and from the left, in groups?",
                            "verse 70:38": "Does every one of them aspire to be admitted to the garden of bliss?",
                            "verse 70:39": "By no means! We have created them from what they know.",
                            "verse 70:40": "So, I swear by the Lord of the points of sunrise and those of sunset, We are powerful",
                            "verse 70:41": "to bring those better than them in their place, and We are not to be frustrated.",
                            "verse 70:42": "So, leave them involved in pastime and play until they encounter their Day, which they are promised,",
                            "verse 70:43": "the Day they will come out of the graves quickly, as if they were rushing toward idols,",
                            "verse 70:44": "with their eyes downcast, enveloped by ignominy."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 70:1": "A petitioner petitioned an impending chastisement",
                            "verse 70:2": "— which in the case of the disbelievers none can avert —",
                            "verse 70:3": "from God, Lord of the Ascensions.",
                            "verse 70:4": "To Him ascend the angels and the Spirit in a day whose span is fifty thousand years.",
                            "verse 70:5": "So be patient with a graceful patience.",
                            "verse 70:6": "Lo! they see it as",
                            "verse 70:7": "far off,",
                            "verse 70:8": "while We see it [to be] near.",
                            "verse 70:9": "The day when the heaven will be as molten silver,",
                            "verse 70:10": "and the mountains will be as flakes of wool.",
                            "verse 70:11": "And no friend will inquire about his friend.",
                            "verse 70:12": "They will",
                            "verse 70:13": "be made to see them.",
                            "verse 70:14": "and his companion, and his brother,",
                            "verse 70:15": "and his kin that had sheltered him,",
                            "verse 70:16": "and all who are on earth, if it might then deliver him.",
                            "verse 70:17": "Nay! Lo! [for him] it will be the Churning Fire",
                            "verse 70:18": "ripping out the scalp;",
                            "verse 70:19": "it will call him who turned his back and ignored,",
                            "verse 70:20": "and amassed ,",
                            "verse 70:21": "then hoarded .",
                            "verse 70:22": "Indeed man was created restless:",
                            "verse 70:23": "when evil befalls him, [he is] anxious,",
                            "verse 70:24": "and when good befalls him, [he is] grudging,",
                            "verse 70:25": "except those who perform prayers,",
                            "verse 70:26": "those who maintain their prayers,",
                            "verse 70:27": "and in whose wealth there is an acknowledged due,",
                            "verse 70:28": "for the beggar and the deprived,",
                            "verse 70:29": "and who affirm the truth of the Day of Judgement,",
                            "verse 70:30": "and who are apprehensive of the chastisement of their Lord —",
                            "verse 70:31": "lo! there is no security from the chastisement of their Lord —",
                            "verse 70:32": "and those who guard their private parts,",
                            "verse 70:33": "except from their wives and those whom their right hands own, for in that case they are not blameworthy;",
                            "verse 70:34": "but whoever seeks beyond that, those are the infringers,",
                            "verse 70:35": "and those who are keepers, of their trusts and their covenant,",
                            "verse 70:36": "and who stand firm in their testimony,",
                            "verse 70:37": "and who preserve their prayers.",
                            "verse 70:38": "Those will be in Gardens, honoured.",
                            "verse 70:39": "So what is wrong with those who disbelieve that they keep staring towards you",
                            "verse 70:40": "to the right and to the left in droves?",
                            "verse 70:41": "Does each one of them hope to be admitted into a Garden of Bliss?",
                            "verse 70:42": "Nay! Indeed We created them from what they know.",
                            "verse 70:43": "For verily I swear by the Lord of the rising-places and the setting-places, that We are able",
                            "verse 70:44": "to replace",
                            "verse 70:45": "with",
                            "verse 70:46": "better than them, and We are not to be outmanoeuvred.",
                            "verse 70:47": "So leave them to indulge and to play, until they encounter that day of theirs, which they are promised;",
                            "verse 70:48": "the day when they will come forth from the graves hastening, as if racing to a",
                            "verse 70:49": "target",
                            "verse 70:50": "with their eyes humbled, overcast by abasement."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 70:1": "A questioner asked for the torment which is sure to come about,",
                            "verse 70:2": "Upon the disbelievers, which no one can repel.",
                            "verse 70:3": "(That will befall) from Allah, Who is the Lord of the Ascending Steps to Heaven (and of the higher ranks and grades of spiritual hierarchy).",
                            "verse 70:4": "The angels and al-Ruh al-Amin (the Spirit) rise towards His (Throne) in a Day which measures fifty thousand years (according to the worldly scale).",
                            "verse 70:5": "So, (O Beloved,) observe patience (on the assertions of the disbelievers) without regrets.",
                            "verse 70:6": "Surely, they imagine that (Day) to be far off,",
                            "verse 70:7": "But We see it very near.",
                            "verse 70:8": "On that Day the sky will become like molten copper,",
                            "verse 70:9": "And the mountains like (flakes of) coloured wool,",
                            "verse 70:10": "And no friend will enquire after his friend,",
                            "verse 70:11": "(Though) they will be shown (to one another).",
                            "verse 70:12": "And (by giving) his wife and his brother,",
                            "verse 70:13": "And (all) his family who used to provide him shelter,",
                            "verse 70:14": "And all the people on earth (as recompense for himself), so that this (atonement) may save him from (Allah’s torment).",
                            "verse 70:15": "But no! By no means! Surely, that is a Flaming Fire,",
                            "verse 70:16": "Stripping off the skin of all the limbs and the scalp.",
                            "verse 70:17": "It is calling him who turned his back (on the truth) and turned away,",
                            "verse 70:18": "And (he who) accumulated wealth and then held it (from distribution).",
                            "verse 70:19": "Surely, man has been created impatient and greedy.",
                            "verse 70:20": "He gets upset and worried when some hardship (or financial loss) afflicts him,",
                            "verse 70:21": "But becomes miserly when he receives good fortune (or affluence),",
                            "verse 70:22": "Except for those who offer Prayer,",
                            "verse 70:23": "And are constant in their Prayer,",
                            "verse 70:24": "And those (who are committed to sacrifice and) in whose wealth there is a fixed share,",
                            "verse 70:25": "Of one who begs and of one who is needy but does not beg,",
                            "verse 70:26": "And those who affirm the Day of Requital,",
                            "verse 70:27": "And those who fear the torment of their Lord;",
                            "verse 70:28": "Surely, the torment of their Lord is not a thing which should not be feared;",
                            "verse 70:29": "And those who safeguard their private parts,",
                            "verse 70:30": "Except from their wives or the female slaves they possess.",
                            "verse 70:31": "But he who looks for more than that, then it is they who transgress the limits.",
                            "verse 70:32": "And those who safeguard their trusts and promises,",
                            "verse 70:33": "And those who stand firm on their testimonies,",
                            "verse 70:34": "And those who safeguard their Prayers,",
                            "verse 70:35": "It is they who will enjoy great honour and respect in the Gardens.",
                            "verse 70:36": "So what is the matter with the disbelievers that they are coming towards you running,",
                            "verse 70:37": "From the right as well as the left, in groups?",
                            "verse 70:38": "Does every one of them hope that he may be admitted to the Garden of Bliss (without faith and deeds)?",
                            "verse 70:39": "Certainly not! Surely, We have created them from a substance which they (also) know.",
                            "verse 70:40": "So I swear by the Lord of the easts and the wests that surely We have Absolute Power,",
                            "verse 70:41": "To replace them with people better than them and We are not at all incapable (of doing it).",
                            "verse 70:42": "So leave them occupied with their absurd talk and pastime until they meet that Day of theirs which they have been promised.",
                            "verse 70:43": "The Day when they will come forth from their graves in haste as if they are running towards the temples of their idols.",
                            "verse 70:44": "(Their plight) will be that their eyes will be cast down (with shame and fear) and disgrace enveloping them."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "Eräs tiedonhaluinen kyseli, millainen on kuritus, joka on tuleva",
                            "verse 70:2": "epäuskoisten osaksi.",
                            "verse 70:3": "Se tulee Jumalalta, nousevain portaitten Herralta.",
                            "verse 70:4": "Enkelit ja henki nousevat Hänen tykönsä päivänä, jonka pituus on viisikymmentä tuhatta vuotta.",
                            "verse 70:5": "Osoita siis jaloa kestävyyttä!",
                            "verse 70:6": "He kuvittelevat sen olevan kaukana,",
                            "verse 70:7": "mutta Me näemme sen läheltä.",
                            "verse 70:8": "Sinä päivänä, jolloin taivas on oleva kuin sulaa kuparia",
                            "verse 70:9": "ja vuoret kuin villaa,",
                            "verse 70:10": "jolloin ystävä ei kysy ystävää,",
                            "verse 70:11": "vaikka he näkevät toisensa.",
                            "verse 70:12": "vaimonsa ja veljensä,",
                            "verse 70:13": "sukulaisensa, jotka antoivat hänelle suojaa,",
                            "verse 70:14": "jopa kaikki, jotka maan päälle on luotu, kunhan hän niiden avulla lunastaisi itsensä.",
                            "verse 70:15": "Ei mitenkään! Sillä katso, tämä on leimuava liekki,",
                            "verse 70:16": "joka raastaa pois ihon",
                            "verse 70:17": "ja vaatii omakseen sen, joka kääntyi pois ja pakeni",
                            "verse 70:18": "ja joka ahnaasti kokosi rikkautta.",
                            "verse 70:19": "Totisesti on ihminen luotu epävakaiseksi mieleltään:",
                            "verse 70:20": "Kun jokin paha kohtaa häntä, hän on kärkäs valittamaan,",
                            "verse 70:21": "mutta kun jotakin hyvää annetaan hänen osalleen, hän on kiittämätön,",
                            "verse 70:22": "lukuunottomatta niitä, jotka rukoilevat,",
                            "verse 70:23": "jotka uskollisesti suorittavat rukouksensa,",
                            "verse 70:24": "niitä, joiden rikkaudessa on määrätty osa",
                            "verse 70:25": "kerjäläistä ja osatonta varten;",
                            "verse 70:26": "niitä, jotka uskovat tuomion päivään,",
                            "verse 70:27": "ja jotka pelkäävät Herransa kuritusta",
                            "verse 70:28": "ei kukaan, totisesti, saata säästyä kuritukselta, joka on heidän Herraltansa tuleva,",
                            "verse 70:29": "sekä lukuunottamatta niitä, jotka hillitsevät halujaan",
                            "verse 70:30": "paitsi vaimojensa ja orjattariensa suhteen, koska heissä silloin ei ole moittimista.",
                            "verse 70:31": "Toisin on niiden, jotka pyrkivät ylittämään tämän, sillä ne ovat lain rikkojia.",
                            "verse 70:32": "Ne, jotka ovat rehellisiä sopimuksissaan ja siinä, mitä heidän huostaansa on uskottu,",
                            "verse 70:33": "jotka ovat vilpittömiä todistaessaan",
                            "verse 70:34": "ja jotka ahkeroivat hartauden harjoituksissa,",
                            "verse 70:35": "saavat elää paratiisin kunniassa.",
                            "verse 70:36": "Mutta mitä ajattelevat uskottomat, jotka avosilmin rientävät sinun edelläsi,",
                            "verse 70:37": "oikealta ja vasemmalta, ryhmä toisensa jälkeen?",
                            "verse 70:38": "Kuvitteleeko heistä kukin pääsevänsä autuuden puutarhaan?",
                            "verse 70:39": "Totisesti ei! Totisesti he tietävät, mistä Me olemme luonut heidät.",
                            "verse 70:40": "Mutta ei! Vannon idän ja lännen Herran nimessä: »Totisesti Me voimme",
                            "verse 70:41": "nostaa heidän sijalleen ne, jotka ovat heitä paremmat, eikä Meitä voi tästä mikään estää.",
                            "verse 70:42": "Anna siis heidän jäädä turhien puheittensa varaan ja laskea leikkiä, kunnes heitä katsoo silmästä silmään se päivä, joka on heille ennustettu.",
                            "verse 70:43": "Sinä päivänä he tulevat esiin haudoistaan kiirehtien, aivan kuin maalia kohti kiitäen,",
                            "verse 70:44": "silmät maahan luotuina, häpeän valtaamina."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 70:1": "Un questionneur a questionné sur le châtiment qui échoira",
                            "verse 70:2": "aux mécréants, que nul ne peut repousser,",
                            "verse 70:3": "qui vient de Dieu, le Maître des degrés ascendants.",
                            "verse 70:4": "Les anges et l'Esprit montent vers Lui en un jour dont la durée est de cinquante mille ans.",
                            "verse 70:5": "Patiente avec une belle constance !",
                            "verse 70:6": "Ils le voient comme lointain,",
                            "verse 70:7": "alors que Nous le voyons tout proche.",
                            "verse 70:8": "Ce Jour-là, le ciel sera comme du métal fondu",
                            "verse 70:9": "et les montagnes comme des flocons de laine.",
                            "verse 70:10": "Nul ami dévoué ne s'enquerra de son ami",
                            "verse 70:11": "quand ils s'apercevront.",
                            "verse 70:12": "sa compagne, son frère,",
                            "verse 70:13": "son clan qui lui donnait l'asile",
                            "verse 70:14": "et tout ceux qui sont sur la terre, afin d'être sauvé.",
                            "verse 70:15": "Mais non !.",
                            "verse 70:16": "avide de faire rôtir",
                            "verse 70:17": "il appelle celui qui s'est retourné et s'est enfui,",
                            "verse 70:18": "celui qui amassait et thésaurisait.",
                            "verse 70:19": "Certes, l'homme a été créé inquiet,",
                            "verse 70:20": "agité lorsque le malheur l'atteint,",
                            "verse 70:21": "cupide lorsqu'il est heureux ;",
                            "verse 70:22": "à l'exception de ceux qui prient,",
                            "verse 70:23": "de ceux qui sont constants dans leur prière,",
                            "verse 70:24": "de ceux sur les biens desquels il existe un droit reconnu",
                            "verse 70:25": "en faveur du mendiant et de l'indigent,",
                            "verse 70:26": "de ceux qui déclarent véridique le Jour du Jugement,",
                            "verse 70:27": "de ceux qui redoutent le châtiment de leur Seigneur",
                            "verse 70:28": "ne se sachant pas à l'abri du châtiment de leur Seigneur ;",
                            "verse 70:29": "à l'exception de ceux qui préservent leur chasteté,",
                            "verse 70:30": "sauf avec leurs épouses et avec celles que possède leur main droite, car alors ils ne sont pas blâmables,",
                            "verse 70:31": "tandis que ceux qui en convoitent d'autres sont transgresseurs ;",
                            "verse 70:32": "à l'exception de ceux qui gardent les dépôts qu'on leur a confiés et qui remplissent leurs engagements,",
                            "verse 70:33": "de ceux dont le témoignage est sûr,",
                            "verse 70:34": "de ceux qui s'acquittent de la prière :",
                            "verse 70:35": "ceux-là auront une place d'honneur dans des Jardins.",
                            "verse 70:36": "Qu'ont donc ceux qui mécroient à se tenir devant toi les yeux écarquillés,",
                            "verse 70:37": "venant par groupes de droite et de gauche ?",
                            "verse 70:38": "Chacun d'eux voudrait-il être introduit dans le Jardin du délice ?",
                            "verse 70:39": "Que non !.",
                            "verse 70:40": "J'en jure par le Seigneur des Orients et des Occidents : Nous avons le pouvoir",
                            "verse 70:41": "de les remplacer par des hommes meilleurs qu'eux, et nul ne peut Nous devancer.",
                            "verse 70:42": "Laisse-les donc ergoter et jouer jusqu'au moment où ils rencontreront le Jour qui leur a été promis ;",
                            "verse 70:43": "le Jour où ils sortiront des tombeaux, rapides comme s'ils couraient vers des bornes d'arrivée,",
                            "verse 70:44": "les yeux hagards, pétris d'humiliation."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 70:1": "Un demandeur a réclamé un châtiment inéluctable,",
                            "verse 70:2": "pour les mécréants, que nul ne pourrait repousser,",
                            "verse 70:3": "et qui vient de Dieu, le Maître des voies d’ascension.",
                            "verse 70:4": "Les Anges ainsi que l’Esprit montent vers Lui en un jour dont la durée est de cinquante mille ans.",
                            "verse 70:5": "Supporte donc, d’une belle patience.",
                            "verse 70:6": "Ils le (le châtiment) voient bien loin,",
                            "verse 70:7": "alors que Nous le voyons bien proche,",
                            "verse 70:8": "le jour où le ciel sera comme du métal en fusion",
                            "verse 70:9": "et les montagnes comme de la laine,",
                            "verse 70:10": "où nul ami dévoué ne s’enquerra d’un ami,",
                            "verse 70:11": "bien qu’ils se voient l’un l’autre.",
                            "verse 70:12": "sa compagne, son frère,",
                            "verse 70:13": "même son clan qui lui donnait asile,",
                            "verse 70:14": "et tout ce qui est sur la terre, tout, qui pourrait le sauver.",
                            "verse 70:15": "Mais rien [ne le sauvera].",
                            "verse 70:16": "est un brasier",
                            "verse 70:17": "arrachant brutalement la peau du crâne.",
                            "verse 70:18": "Il appellera celui qui tournait le dos et s’en allait,",
                            "verse 70:19": "amassait et thésaurisait.",
                            "verse 70:20": "Oui, l’homme a été créé instable [très inquiet];",
                            "verse 70:21": "quand le malheur le touche, il est abattu;",
                            "verse 70:22": "et quand le bonheur le touche, il est refuseur.",
                            "verse 70:23": "Sauf ceux qui pratiquent la Salat",
                            "verse 70:24": "qui sont assidu à leurs Salats,",
                            "verse 70:25": "et sur les bien desquels il y a un droit bien déterminé [la Zakat]",
                            "verse 70:26": "pour le mendiant et le déshérité;",
                            "verse 70:27": "et qui déclarent véridique le Jour de la Rétribution,",
                            "verse 70:28": "et ceux qui craignent le châtiment de leur Seigneur",
                            "verse 70:29": "car vraiment, il n’y a nulle assurance contre le châtiment de leur Seigneur;",
                            "verse 70:30": "et qui se maintiennent dans la chasteté",
                            "verse 70:31": "et n’ont pas de rapports qu’avec leurs épouses ou les esclaves qu’ils possèdent car dans ce cas, ils ne sont pas blâmables,",
                            "verse 70:32": "mais ceux qui cherchent [leur plaisir] en dehors de cela, sont des transgresseurs;",
                            "verse 70:33": "et qui gardent les dépôts confiés à eux, et respectent leurs engagements scrupuleusement.",
                            "verse 70:34": "et qui témoignent de la stricte vérité,",
                            "verse 70:35": "et qui sont régulier dans leur Salat.",
                            "verse 70:36": "Ceux-là seront honorés dans des Jardins.",
                            "verse 70:37": "Qu’ont donc, ceux qui ont mécru, à courir vers toi, le cou tendu,",
                            "verse 70:38": "de droite et de gauche,",
                            "verse 70:39": "par bandes ?",
                            "verse 70:40": "Chacun d’eux convoite-t-il qu’on le laisse entrer au Jardin des délices ?",
                            "verse 70:41": "Mais non ! Nous les avons créés de ce qu’ils savent .",
                            "verse 70:42": "Eh Non ! .",
                            "verse 70:43": "De les remplacer par de meilleurs qu’eux, et nul ne peut Nous en empêcher.",
                            "verse 70:44": "Laisse-les donc s’enfoncer (dans leur mécréance) et se divertir jusqu’à ce qu’ils rencontrent leur jour dont on les menaçait,",
                            "verse 70:45": "le jour où ils sortiront des tombes, rapides comme s’ils couraient vers des pierres dressées;",
                            "verse 70:46": "leurs yeux seront abaissés, l’avilissement les couvrira."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "Ein Fragender fragt nach der Strafe, die da treffen wird",
                            "verse 70:2": "Die Ungläubigen - es kann sie keiner abwehren -",
                            "verse 70:3": "Von Allah, dem Hohen.",
                            "verse 70:4": "Die Engel und der Geist steigen zu Ihm in einem Tage, dessen Maß fünfzigtausend Jahre sind.",
                            "verse 70:5": "Gedulde dich drum in geziemender Geduld.",
                            "verse 70:6": "Sie wähnen, er sei ferne;",
                            "verse 70:7": "Aber Wir sehen, er ist nahe.",
                            "verse 70:8": "Am Tage, da der Himmel wie geschmolzenes Erz sein wird",
                            "verse 70:9": "Und die Berge wie farbige Wollflocken,",
                            "verse 70:10": "Und ein Freund nicht nach einem Freunde fragen wird.",
                            "verse 70:11": "Sie werden in Sehweite zueinander gebracht werden, und der Schuldige würde sich wohl loskaufen von der Strafe jenes Tages mit seinen Kindern",
                            "verse 70:12": "Und seiner Gattin und seinem Bruder",
                            "verse 70:13": "Und seiner Verwandtschaft, die ihn beherbergt hat,",
                            "verse 70:14": "Und allen, die auf Erden sind insgesamt, ob es ihn nur retten wollte.",
                            "verse 70:15": "Doch nein! wahrlich, es ist eine Feuerflamme -",
                            "verse 70:16": "Die Kopfhaut gänzlich abziehend.",
                            "verse 70:17": "Den wird sie rufen, der den Rücken kehrt und sich abwendet",
                            "verse 70:18": "Und (Reichtum) aufhäuft und (damit) geizt.",
                            "verse 70:19": "Wahrlich, der Mensch ist aus Ungeduld geschaffen;",
                            "verse 70:20": "Wenn ihn Schlimmes trifft, ist er voller Klage,",
                            "verse 70:21": "Doch wenn ihm Gutes widerfährt, ist er knausrig.",
                            "verse 70:22": "Nicht so sind die, die beten",
                            "verse 70:23": "Und bei ihrem Gebet verharren,",
                            "verse 70:24": "Und die, in deren Reichtum ein bestimmter Anteil ist",
                            "verse 70:25": "Für den Bittenden sowohl wie für den, der es nicht kann.",
                            "verse 70:26": "Und die, die den Tag des Gerichts für wahr und wirklich erklären,",
                            "verse 70:27": "Und die, die vor der Strafe ihres Herrn zagen -",
                            "verse 70:28": "Wahrlich, die Strafe ihres Herrn ist nicht, wovor man sicher sein könnte -,",
                            "verse 70:29": "Und die, die ihre Sinnlichkeit im Zaum halten,",
                            "verse 70:30": "Es sei denn mit ihren Gattinnen oder denen, die ihre Rechte besitzt, denn da sind sie nicht zu tadeln,",
                            "verse 70:31": "Die aber mehr als das suchen, sind Übertreter.",
                            "verse 70:32": "Und die, die das ihnen Anvertraute und ihren Vertrag halten,",
                            "verse 70:33": "Und die, die aufrichtig sind in ihrem Zeugnis,",
                            "verse 70:34": "Und die, die ihr Gebet getreulich verrichten;",
                            "verse 70:35": "Diese sind es, die in den Gärten sein werden, hochgeehrt.",
                            "verse 70:36": "Was aber ist denen, die ungläubig sind, daß sie auf dich zugelaufen kommen",
                            "verse 70:37": "Von rechts und links, gruppenweise gesondert?",
                            "verse 70:38": "Hofft jeder einzelne von ihnen wohl, den Garten der Wonne zu betreten?",
                            "verse 70:39": "Nimmermehr! Wir erschufen sie aus dem, was sie wissen.",
                            "verse 70:40": "Aber nein! Ich schwöre beim Herrn des Ostens und des Westens, daß Wir imstande sind,",
                            "verse 70:41": "Bessere als sie an ihre Stelle zu setzen, und keiner kann Uns hindern.",
                            "verse 70:42": "So laß sie nur in eitler Rede sich ergehen und sich vergnügen, bis sie ihrem Tag begegnen, der ihnen angedroht ward,",
                            "verse 70:43": "Dem Tag, da sie aus ihren Gräbern hervorkommen werden in Hast, als eilten sie zu einem Ziel.",
                            "verse 70:44": "Ihre Augen werden niedergeschlagen sein; Schmach wird sie bedecken."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": ",d ek¡xus okys us dkfQjksa ds fy, gksdj jgus okys vt+kc dks ek¡xk",
                            "verse 70:2": "ftldks dksbZ Vky ugha ldrk",
                            "verse 70:3": "tks ntsZ okys [+kqnk dh rjQ ls ¼gksus okyk½ Fkk",
                            "verse 70:4": "ftldh rjQ Q+fj’rs vkSj :gqy vehu p<+rs gSa ¼vkSj ;s½ ,d fnu esa bruh eqlkQ+r r; djrs gSa ftldk vUnkt+k ipkl gt+kj cjl dk gksxk",
                            "verse 70:5": "rks rqe vPNh rjg bu rd+yhQksa dks cjnk’r djrs jgks",
                            "verse 70:6": "og ¼d+;ker½ mudh fuxkg esa cgqr nwj gS",
                            "verse 70:7": "vkSj gekjh ut+j esa ut+nhd gS",
                            "verse 70:8": "ftl fnu vkleku fi?kys gq, rk¡cs dk lk gks tk,xk",
                            "verse 70:9": "vkSj igkM+ /kquds gq, Åu dk lk",
                            "verse 70:10": "ckotwn fd ,d nwljs dks ns[krs gksaxs",
                            "verse 70:11": "dksbZ fdlh nksLr dks u iwNsxk xqusgxkj rks vkjt+w djsxk fd dk’k ml fnu ds vt+kc ds cnys mlds csVksa",
                            "verse 70:12": "vkSj mldh choh vkSj mlds HkkbZ",
                            "verse 70:13": "vkSj mlds dqucs dks ftlesa og jgrk Fkk",
                            "verse 70:14": "vkSj ftrus vkneh t+ehu ij gSa lc dks ys ys vkSj mldks NqVdkjk ns nsa",
                            "verse 70:15": "¼exj½ ;s gjfxt+ u gksxk",
                            "verse 70:16": "tgUuqe dh og HkM+drh vkx gS fd [kky m/ksM+ dj j[k nsxh",
                            "verse 70:17": "¼vkSj½ mu yksxksa dks viuh rjQ cqykrh gksxh",
                            "verse 70:18": "ftUgksaus ¼nhu ls½ ihB Qsjh vkSj eq¡g eksM+k vkSj ¼eky tek fd;k½",
                            "verse 70:19": "vkSj cUn dj j[kk cs’kd bUlku cM+k ykyph iSnk gqvk gS",
                            "verse 70:20": "tc mls rd+yhQ Nw Hkh x;h rks ?kcjk x;k",
                            "verse 70:21": "vkSj tc mls t+jk Qjkx+h gkfly gq;h rks c[+khy cu cSBk",
                            "verse 70:22": "exj tks yksx uekt+ i<+rs gSa",
                            "verse 70:23": "tks viuh uekt+ dk bYrt+ke j[krs gSa",
                            "verse 70:24": "vkSj ftuds eky esa ek¡xus okys vkSj u ek¡xus okys ds",
                            "verse 70:25": "fy, ,d eqd+jZj fgLlk gS",
                            "verse 70:26": "vkSj tks yksx jkst+s tt+k dh rLnhd+ djrs gSa",
                            "verse 70:27": "vkSj tks yksx vius ijojfnxkj ds vt+kc ls Mjrs jgrs gSa",
                            "verse 70:28": "cs’kd mudks ijojfnxkj ds vt+kc ls cs[k+kSQ u gksuk pkfg,",
                            "verse 70:29": "vkSj tks yksx viuh ÓeZxkgksa dks viuh chfo;ksa vkSj viuh ykSfUM;ksa ds flok ls fgQkt+r djrs gSa",
                            "verse 70:30": "rks bu yksxksa dh gjfxt+ eyker u dh tk,xh",
                            "verse 70:31": "rks tks yksx muds flok vkSj ds [+kkLrxkj gksa rks ;gh yksx gn ls c<+ tkus okys gSa",
                            "verse 70:32": "vkSj tks yksx viuh vekurksa vkSj vgnksa dk ysgkt+ j[krs gSa",
                            "verse 70:33": "vkSj tks yksx viuh Ógknrksa ij d+k;e jgrs gSa",
                            "verse 70:34": "vkSj tks yksx viuh uekt+ks dk [+;ky j[krs gSa",
                            "verse 70:35": ";gh yksx csfg’r ds ckx+ksa esa bT+t+r ls jgsaxs",
                            "verse 70:36": "rks ¼,s jlwy½ dkfQjksa dks D;k gks x;k gS",
                            "verse 70:37": "fd rqEgkjs ikl fxjksg fxjksg nkfgus ls ck,¡ ls nkSM+s pys vk jgs gSa",
                            "verse 70:38": "D;k buesa ls gj Ó[+l bl dk eqrebuh gS fd pSu ds ckx+ ¼csfg’r½ esa nkf[+ky gksxk",
                            "verse 70:39": "gjfxt+ ugha geus mudks ftl ¼xUnh½ pht+ ls iSnk fd;k ;s yksx tkurs gSa",
                            "verse 70:40": "rks eSa e’kfjdksa vkSj ex+fjcksa ds ijojfnxkj dh d+le [kkrk gw¡ fd ge t+:j bl ckr dh dq+njr j[krs gSa",
                            "verse 70:41": "fd muds cnys muls csgrj yksx yk ¼clk,¡½ vkSj ge vkftt+ ugha gSa",
                            "verse 70:42": "rks rqe mudks NksM+ nks fd ckfry esa iM+s [ksyrs jgsa ;gk¡ rd fd ftl fnu dk muls ok;nk fd;k tkrk gS muds lkeus vk ekStwn gks",
                            "verse 70:43": "mlh fnu ;s yksx dczksa ls fudy dj bl rjg nkSM+saxs xks;k og fdlh >UMs dh rjQ nkSM+s pys tkrs gSa",
                            "verse 70:44": "¼funker ls½ mudh vk¡[ksa >qdh gksaxh mu ij :lokbZ NkbZ gq;h gksxh ;s ogh fnu gS ftldk muls ok;nk fd;k tkrk Fkk lwj, vy evkfjt [+kRe"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "Seseorang peminta telah meminta kedatangan azab yang bakal terjadi,",
                            "verse 70:2": "Untuk orang-orang kafir, yang tidak seorang pun dapat menolaknya,",
                            "verse 70:3": "(Yang datang) dari Allah, Yang mempunyai tempat-tempat naik.",
                            "verse 70:4": "Malaikat-malaikat dan Jibril naik (menghadap) kepada Tuhan dalam sehari yang kadarnya lima puluh ribu tahun.",
                            "verse 70:5": "Maka bersabarlah kamu dengan sabar yang baik.",
                            "verse 70:6": "Sesungguhnya mereka memandang siksaan itu jauh (mustahil).",
                            "verse 70:7": "Sedangkan kami memandangnya dekat (pasti terjadi).",
                            "verse 70:8": "Pada hari ketika langit menjadi seperti luluhan perak.",
                            "verse 70:9": "Dan gunung-gunung menjadi seperti bulu (yang beterbangan),",
                            "verse 70:10": "Dan tidak ada seorang teman akrab pun menanyakan temannya,",
                            "verse 70:11": "Sedang mereka saling melihat.",
                            "verse 70:12": "Dan istrinya dan saudaranya,",
                            "verse 70:13": "Dan kaum familinya yang melindunginya (di dunia).",
                            "verse 70:14": "Dan orang-orang di atas bumi seluruhnya, kemudian (mengharapkan) tebusan itu dapat menyelamatkannya.",
                            "verse 70:15": "Sekali-kali tidak dapat.",
                            "verse 70:16": "Yang mengelupaskan kulit kepala,",
                            "verse 70:17": "Yang memanggil orang yang membelakang dan yang berpaling (dari agama).",
                            "verse 70:18": "Serta mengumpulkan (harta benda) lalu menyimpannya.",
                            "verse 70:19": "Sesungguhnya manusia diciptakan bersifat keluh kesah lagi kikir.",
                            "verse 70:20": "Apabila ia ditimpa kesusahan ia berkeluh kesah,",
                            "verse 70:21": "dan apabila ia mendapat kebaikan ia amat kikir,",
                            "verse 70:22": "kecuali orang-orang yang mengerjakan shalat,",
                            "verse 70:23": "yang mereka itu tetap mengerjakan salatnya,",
                            "verse 70:24": "dan orang-orang yang dalam hartanya tersedia bagian tertentu,",
                            "verse 70:25": "bagi orang (miskin) yang meminta dan orang yang tidak mempunyai apa-apa (yang tidak mau meminta),",
                            "verse 70:26": "dan orang-orang yang mempercayai hari pembalasan,",
                            "verse 70:27": "dan orang-orang yang takut terhadap azab Tuhannya.",
                            "verse 70:28": "Karena sesungguhnya azab Tuhan mereka tidak dapat orang merasa aman (dari kedatangannya).",
                            "verse 70:29": "Dan orang-orang yang memelihara kemaluannya,",
                            "verse 70:30": "kecuali terhadap istri-istri mereka atau budak-budak yang mereka miliki maka sesungguhnya mereka dalam hal ini tiada tercela.",
                            "verse 70:31": "Barangsiapa mencari yang di balik itu, maka mereka itulah orang-orang yang melampaui batas.",
                            "verse 70:32": "Dan orang-orang yang memelihara amanat-amanat (yang dipikulnya) dan janjinya.",
                            "verse 70:33": "Dan orang-orang yang memberikan kesaksiannya.",
                            "verse 70:34": "Dan orang-orang yang memelihara salatnya.",
                            "verse 70:35": "Mereka itu (kekal) di surga lagi dimuliakan.",
                            "verse 70:36": "Mengapakah orang-orang kafir itu bersegera datang ke arahmu,",
                            "verse 70:37": "Dari kanan dan dari kiri dengan berkelompok-kelompok?",
                            "verse 70:38": "Adakah setiap orang dari orang-orang kafir itu ingin masuk ke dalam surga yang penuh keni’matan?,",
                            "verse 70:39": "Sekali-kali tidak! Sesungguhnya Kami ciptakan mereka dari apa yang mereka ketahui (air mani).",
                            "verse 70:40": "Maka Aku bersumpah dengan Tuhan Yang Mengatur tempat terbit dan terbenamnya matahari, bulan dan bintang; sesungguhnya Kami benar-benar Maha Kuasa.",
                            "verse 70:41": "Untuk mengganti (mereka) dengan kaum yang lebih baik dari mereka, dan kami sekali-kali tidak dapat dikalahkan.",
                            "verse 70:42": "Maka biarkanlah mereka tenggelam (dalam kebatilan) dan bermain-main sampai mereka menjumpai hari yang diancamkan kepada mereka,",
                            "verse 70:43": "(yaitu) pada hari mereka keluar dari kubur dengan cepat seakan-akan mereka pergi dengan segera kepada berhala-berhala (sewaktu di dunia),",
                            "verse 70:44": "dalam keadaan mereka menekurkan pandangannya (serta) diliputi kehinaan."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "Un tale ha chiesto un castigo immediato .",
                            "verse 70:2": "Per i miscredenti nessuno potrà impedirlo",
                            "verse 70:3": "[poiché proviene] da Allah, il Signore delle Vie dell'Ascesa .",
                            "verse 70:4": "Gli angeli e lo Spirito ascendono a Lui in un Giorno la cui durata è di cinquantamila anni .",
                            "verse 70:5": "Pazienta dunque di bella pazienza .",
                            "verse 70:6": "Essi lo considerano come fosse lontano,",
                            "verse 70:7": "mentre Noi lo vediamo vicino.",
                            "verse 70:8": "Il Giorno in cui il cielo sarà come metallo fuso",
                            "verse 70:9": "e le montagne come",
                            "verse 70:10": "di lana,",
                            "verse 70:11": "nessun amico sollecito chiederà dell'amico,",
                            "verse 70:12": "anche se sarà dato loro di vedersi.",
                            "verse 70:13": "la sua sposa e suo fratello,",
                            "verse 70:14": "e la sua gente che lo ospitava,",
                            "verse 70:15": "e tutto quel che è sulla terra, ogni cosa che potesse salvarlo.",
                            "verse 70:16": "Niente [lo salverà]: sarà una fiammata",
                            "verse 70:17": "a strappargli brutalmente la pelle del cranio.",
                            "verse 70:18": "Essa chiamerà chi avrà volto le spalle e se ne sarà andato",
                            "verse 70:19": "",
                            "verse 70:20": "accumulava e tesaurizzava.",
                            "verse 70:21": "In verità l'uomo è stato creato instabile;",
                            "verse 70:22": "prostrato quando lo coglie sventura,",
                            "verse 70:23": "arrogante nel benessere ;",
                            "verse 70:24": "eccetto coloro che eseguono l'orazione,",
                            "verse 70:25": "e sono costanti nella loro l'orazione,",
                            "verse 70:26": "e sui cui beni c'è un riconosciuto diritto ,",
                            "verse 70:27": "per il mendicante e il diseredato;",
                            "verse 70:28": "coloro che attestano la verità del Giorno del Giudizio",
                            "verse 70:29": "e coloro che temono il castigo del loro Signore -",
                            "verse 70:30": "ché in verità il castigo del loro Signore non è cosa da cui si possa trovare riparo -",
                            "verse 70:31": "e che si mantengono casti",
                            "verse 70:32": "eccetto che con le loro spose e con le schiave che possiedono - e in questo non sono biasimevoli,",
                            "verse 70:33": "mentre coloro che desiderano altro sono i trasgressori -;",
                            "verse 70:34": "coloro che rispettano ciò che è loro stato affidato e i loro impegni,",
                            "verse 70:35": "che rendono testimonianza sincera,",
                            "verse 70:36": "e hanno cura della loro orazione .",
                            "verse 70:37": "Costoro saranno onorati nei Giardini.",
                            "verse 70:38": "Cos'hanno mai da affrettarsi verso di te coloro che non credono ,",
                            "verse 70:39": "",
                            "verse 70:40": "in gruppi da destra e da sinistra?",
                            "verse 70:41": "Ciascuno di loro desidera che lo si lasci entrare nel Giardino della Delizia?",
                            "verse 70:42": "No, mai! Invero li creammo di quello che già sanno.",
                            "verse 70:43": "Lo giuro per il Signore degli Orienti e degli Occidenti , in verità abbiamo il potere",
                            "verse 70:44": "di sostituirli con",
                            "verse 70:45": "migliori di loro e nessuno potrebbe precederCi.",
                            "verse 70:46": "Lascia dunque che disputino e giochino finché non incontreranno il Giorno che è stato loro promesso;",
                            "verse 70:47": "il Giorno in cui usciranno dalle tombe in fretta, come se corressero verso pietre drizzate ,",
                            "verse 70:48": "con gli sguardi umili, coperti di vergogna: questo è il Giorno che è stato loro promesso."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "或る者が，下るべき懲罰に就いて問う。",
                            "verse 70:2": "不信心者は，それを防ぐことは出来ない。",
                            "verse 70:3": "階段の主，アッラーから（の懲罰）である。",
                            "verse 70:4": "天使たちや聖霊（大天使ジブリール）は，一日にして，かれの許に登る，その（一日の）長さは，5万年である。",
                            "verse 70:5": "だからあなたは，立派に耐え忍べ。",
                            "verse 70:6": "本当にかれらは，それ（日）を遠いと思う。",
                            "verse 70:7": "しかしわれは，それを近いと見る。",
                            "verse 70:8": "天が溶けた銅のようになる日，",
                            "verse 70:9": "山々は，梳いた羊毛のようになり，",
                            "verse 70:10": "誰も友（の安否）を問うことはない。",
                            "verse 70:11": "かれらは互いに顔を合わせることが出来ない程恐れる。罪ある者はその日，自分の罪を贖うために自分の子供たちを差し出そうと願うであろう。",
                            "verse 70:12": "かれの妻や兄弟，",
                            "verse 70:13": "かれを庇った近親，",
                            "verse 70:14": "自分を救えるならば，地上の凡てのものを挙げて贖うことを請い願うであろう。",
                            "verse 70:15": "断じて出来ない。本当にかの（地獄の）炎は，",
                            "verse 70:16": "頭の皮まで剣ぎ取る。",
                            "verse 70:17": "（正義に）背を見せて，背き去った者を召喚するであろう。",
                            "verse 70:18": "また蓄積し，隠匿の金を持つ者をも。",
                            "verse 70:19": "人間は本当に忙しなく創られている。",
                            "verse 70:20": "災厄に会えば歎き悲しみ，",
                            "verse 70:21": "好運に会えば物惜しみになる。",
                            "verse 70:22": "だが礼拝に精進する者は，そうではない。",
                            "verse 70:23": "礼拝を厳守している者，",
                            "verse 70:24": "またかれらの富が，公正であると認められている者，",
                            "verse 70:25": "物乞いする者や耐乏する者のために（施す者），",
                            "verse 70:26": "また審判の日の真実を確認している者，",
                            "verse 70:27": "またかれらの主の懲罰を恐れる者も。",
                            "verse 70:28": "本当に主の懲罰から，安全であると考えるべきではない。",
                            "verse 70:29": "また隠れたところ（貞節）を守る者，",
                            "verse 70:30": "かれらの妻や右手の所有する者に限っている場合は別で，罪にはならない。",
                            "verse 70:31": "しかしこれ以外に求める者は法を越えた者である。",
                            "verse 70:32": "付託されたことや約束に忠実な渚，",
                            "verse 70:33": "証言に公正な者，",
                            "verse 70:34": "また礼拝を厳守する者。",
                            "verse 70:35": "これらの者は栄誉を得て楽園の中に（住む）。",
                            "verse 70:36": "今不信心者たちが，あなたの方に急いでいるのは何事か。",
                            "verse 70:37": "右からまた左から，群になって。",
                            "verse 70:38": "かれらは皆至福の楽園に入ることを望むのか。",
                            "verse 70:39": "いや，断じて出来ないことである。本当にわれは，かれらが知るものから，かれらを創ったのである。",
                            "verse 70:40": "いや，われは東と西の主によって誓う。われにとっては可能である。",
                            "verse 70:41": "かれらよりも優れた（外の）者をもって，かれらに替えてやろう。われは，失敗することはないのである。",
                            "verse 70:42": "だからあなたは，かれらを（虚栄に）浸らせ，戯れに任せるがよい。かれらが約束されている，その日の会見まで。",
                            "verse 70:43": "かれらが墓から慌ただしく出て来る日。それはまるで（現世で）かれらが偶像神へと急いだように。",
                            "verse 70:44": "かれらは目を伏せ，屈辱を被るであろう。これがかれらに約束されていた，その日である。 かれらが墓から慌ただしく出て来る日。それはまるで（現世で）かれらが偶像神へと急いだように。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "한 질문자가 있을 응벌에 관하여 질문하였나니",
                            "verse 70:2": "그것은 아무도 제지할 수 없 는 불신자들을 위한 응벌에 관한 것으로",
                            "verse 70:3": "승천의 길 의 주님 하나님으 로부터의 응벌이라",
                            "verse 70:4": "오만년과도 같은 하루 동안에천사들과 가브리엘 천사가 그분 께로 을라가니라",
                            "verse 70:5": "그러므로 그대는 아름답게 인내하라",
                            "verse 70:6": "실로 그들은 그것이 멀리 있 다 생각하고 있노라",
                            "verse 70:7": "그러나 하나님은 그것이 가까 이 있음을 알고 계시니라",
                            "verse 70:8": "그날에는 하늘이 용해된 구리 처럼 될 것이며",
                            "verse 70:9": "산들이 양털처럼 될 것이며",
                            "verse 70:10": "친구가 친구의 안부를 물을 수 없으며",
                            "verse 70:11": "비록 그들이 서로가 서로를 안다하여도 그러할 것이며 죄인 들은 그날의 응벌을 피하기 위하 여 그의 자손이나",
                            "verse 70:12": "그의 아내와 형제나",
                            "verse 70:13": "그를 보호한 친척이나",
                            "verse 70:14": "대지에 있는 모든 것을 바쳐그 응벌을 피하려 하도다",
                            "verse 70:15": "그러나 결코 그렇게 될 수 없으며 불지옥이 있을 뿐으로",
                            "verse 70:16": "머리부터 불태워지고",
                            "verse 70:17": "외면하고 거역했던 자들을 부르며",
                            "verse 70:18": "재물을 축적하여 감추었던 자들을 부르니라",
                            "verse 70:19": "실로 인간은 창조되었으되 침착하지 못하고",
                            "verse 70:20": "재앙이 이를 때면 크게 슬퍼 하며",
                            "verse 70:21": "행운이 찾아들 때는 인색해 하더라",
                            "verse 70:22": "그러나 예배에 충실한 자들 은 그렇지 아니하니",
                            "verse 70:23": "항상 예배하는 그들이라",
                            "verse 70:24": "그들의 재물은 정당한 것으로",
                            "verse 70:25": "구하는 자들이나 구하지 아 니한 자들을 위해 사용하고",
                            "verse 70:26": "심판의 날의 진리를 받으들 이며",
                            "verse 70:27": "주님의 응벌을 두려워 하는 자들이라",
                            "verse 70:28": "실로 하나님의 응벌은 불가 피한 것이되",
                            "verse 70:29": "순결을 지키는 자들은 제외 라",
                            "verse 70:30": "그러나 아내들과 그들의 오 른 손이 소유한 자들은 허락된 것이되",
                            "verse 70:31": "그러나 이를 위반한 것은 불의한 자들이라",
                            "verse 70:32": "신용을 지키고 약속을 이행 하는 자들과",
                            "verse 70:33": "증언을 함에 정직한 자들과",
                            "verse 70:34": "예배생활에 충실한 자들은",
                            "verse 70:35": "축복받은 천국에 있게 되리라",
                            "verse 70:36": "그러나 그대 주위를 급히 서둘러 돌진하는 불신자들에게는 어떤 일이 있겠느뇨",
                            "verse 70:37": "오른쪽과 왼쪽에서 왜 떼지 어 앉아 있느뇨",
                            "verse 70:38": "그들 각자는 축복받은 천국 으로 들어가려 갈망하느뇨",
                            "verse 70:39": "결코 그렇게 될 수 없나니 하나님은 그들이 알고 있는 것으 로 창조하였노라",
                            "verse 70:40": "동쪽과 서쪽의 주님께 맹세 하사 권세는 그분께 있노라",
                            "verse 70:41": "그들보다 나은 다른 백성들 로 그들을 대체할 수 있으며 하나님은 그렇게 함에 부족함이 없노 라",
                            "verse 70:42": "그러므로 그들이 무익한 대 화에 빠져 그들이 약속받은 그날 에 직면할 때까지 만끽하도록 버 려두라",
                            "verse 70:43": "그들이 그들의 무덤으로 부 터 서들러 나오는 그날 그들은 마치 서둘러 우상에게로 가는 것 같더라",
                            "verse 70:44": "실의에 빠진 그들의 눈들은 아래로 내려져 있으며 수치가 그 들을 에워싸니 그러함이 그들이 약속받은 날이라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "داواکارێك پرسیاری کرد ده‌رباره‌ی سزایه‌ك که هه‌ر پێش دێت.",
                            "verse 70:2": "جا ئه‌و سزایه‌؛ یه‌خه‌ی هه‌موو بێ باوه‌ڕان ده‌گرێت و هیچ هێزێك ناتوانێت په‌نایان بدات و لێیان دوور بخاته‌وه‌.",
                            "verse 70:3": "ئه‌و سزاو تۆڵه‌یه له‌لایه‌ن خوای خاوه‌نی گه‌وره‌یی و پله‌و پایه‌و جێ به‌رزه‌کان.",
                            "verse 70:4": "فریشته‌کان و جوبره‌ئیل به‌رز ده‌بنه‌وه بۆ لای په‌روه‌ردگار له‌ڕۆژێکدا که ماوه‌که‌ی په‌نجا هه‌زار ساڵه (به‌حسابی ئاده‌میزاد) یاخود مه‌به‌ست درێژی ڕۆژی قیامه‌ته که په‌نجا هه‌زار ساڵ ده‌خایه‌نێت به نیسبه‌ت خوانه‌ناسانه‌وه‌.",
                            "verse 70:5": "که‌واته خۆگرو ئارامگربه به شێوه‌یه‌کی جوان و چاك (له به‌رامبه‌ر هه‌ڵوێستی نادروستی خوا نه‌ناسانه‌وه‌).",
                            "verse 70:6": "به‌ڕاستی ئه‌و بێ باوه‌ڕانه‌، قیامه‌ت به‌دوور ده‌بینن، به‌دووری ده‌زانن.",
                            "verse 70:7": "ئێمه‌ش، زۆر به‌نزیکی ده‌زانین (چونکه خوا خۆی به‌دیهێنه‌ری کاته‌).",
                            "verse 70:8": "ڕۆژێك دێت، ئاسمان وه‌ك کانزایه‌کی تواوه‌ی لێ دێت (یه‌کێکه له قۆناغه‌کانی هه‌ڵوه‌شاندنه‌وه‌ی بوونه‌وه‌ر).",
                            "verse 70:9": "کێوه‌کانیش وه‌کو خوری شی کراوه (فشۆڵ ده‌بن).",
                            "verse 70:10": "دۆستی گیانی به‌گیانی له یه‌کدی ناپرسنه‌وه‌، که‌س نایپه‌رژێته سه‌رکه‌س، به‌ڵکو هه‌رکه‌س خه‌می خۆیه‌تی.",
                            "verse 70:11": "ئه‌وانه پیشانی یه‌کتر ده‌درێن، تاوانبارو گوناهکار ئاوات ده‌خوازێت که ئه‌گه‌ر بکرێت بۆ ده‌رباز بوونی خۆی له سزای ئه‌و ڕۆژه هه‌موو کوڕه‌کانی بکاته قوربانی خۆی!!",
                            "verse 70:12": "هاوسه‌رو براکه‌ی!!",
                            "verse 70:13": "خزم و عه‌شره‌تی که له دنیادا په‌نایان ده‌دا.",
                            "verse 70:14": "به‌هه‌رچی دانیشتوانی سه‌ر زه‌ویش هه‌یه ئه‌گه‌ر بۆی بکرێت بیکاته قوربانی خۆی، پاشان خوا ڕزگاری بکات.",
                            "verse 70:15": "نه‌خێر.",
                            "verse 70:16": "له کاتێکدا داماڵێنه‌ری پێستی سه‌رو هه‌موو ئه‌ندامه‌کانه‌.",
                            "verse 70:17": "دۆزه‌خ بانگی ئه‌وانه ده‌کات که له دنیادا پشتیان له حه‌ق و ڕاستی هه‌ڵده‌کردو گوێیان پێ نه‌ده‌دا.",
                            "verse 70:18": "ماڵ و سامانیان کۆ ده‌کرده‌وه‌و ده‌یانشارده‌وه (گوێیان نه‌ده‌دا به حه‌ڵاڵ و حه‌رام).",
                            "verse 70:19": "به‌ڕاستی ئینسان به شپرزه‌یی و ته‌نگه‌تاوی دروستکراون.",
                            "verse 70:20": "کاتێك ناخۆشی تووش بێت بێزارو ده‌م به هاواره‌.",
                            "verse 70:21": "کاتێکیش خێرو به‌ره‌که‌تی تووش بوو، ده‌ستی ده‌نوقێنێت و قه‌ده‌غه‌ی چاکه ده‌کات.",
                            "verse 70:22": "ته‌نها ئه‌و نوێژکه‌رانه نه‌بێت.",
                            "verse 70:23": "ئه‌وانه‌ی که له‌سه‌ر نوێژه‌کانیان به‌رده‌وامن.",
                            "verse 70:24": "هه‌روه‌ها ئه‌وانه‌ی که به‌شێکی دیاریکراو له سامانیاندا هه‌یه (بۆ جیهاد و تێکۆشان).",
                            "verse 70:25": "بۆ هه‌ژاری داواکارو بێ نه‌وای داوانه‌که‌ر.",
                            "verse 70:26": "ئه‌وانه‌ی که باوه‌ڕی ڕاست و ڕه‌وان ده‌هێنن به ڕۆژی پاداشت.",
                            "verse 70:27": "ئه‌و که‌سانه‌ی که دڵه له‌رزه‌یان هه‌یه له تۆڵه‌ی په‌روه‌ردگاریان.",
                            "verse 70:28": "به‌ڕاستی سزای په‌روه‌ردگاریان که‌س لێی ئه‌مین نابێت.",
                            "verse 70:29": "ئه‌وانه‌ی داوێنی خۆیان ده‌پارێزن.",
                            "verse 70:30": "مه‌گه‌ر له‌گه‌ڵ هاوسه‌ره‌کانیاندا یاخود که‌نیزه‌که‌کانیان (که به‌هۆی بارو دۆخی تایبه‌ته‌وه هه‌بوو)، ئه‌وانه به‌ڕاستی لۆمه‌کراو نابن.",
                            "verse 70:31": "جا ئه‌وه‌ی بێجگه له‌و حاڵه‌تانه ڕێگه‌ی تر بگرێت (بۆ تێر کردنی ئاره‌زووه‌کانی)، ئه‌وانه له سنوور ترازاوو ده‌ستدرێژکه‌رن.",
                            "verse 70:32": "هه‌روه‌ها ئه‌وانه‌ی که ئه‌مانه‌ت ده‌پارێزن و په‌یمان ده‌به سه‌ر.",
                            "verse 70:33": "ئه‌وانه‌ی که هه‌ڵده‌ستن به‌و شایه‌تیه‌ی که له لایانه‌.",
                            "verse 70:34": "ئه‌وانه‌ی که پارێزگاری نوێژه‌کانیان ده‌که‌ن و (له کاتی خۆیدا ئه‌نجامی ده‌ده‌ن).",
                            "verse 70:35": "ئا ئه‌وانه له باخه‌کانی به‌هه‌شتدا ڕێز لێنراون.",
                            "verse 70:36": "ئاخۆ ئه‌وانه‌ی بێ بڕوا بوون چیانه که تۆ ده‌رکه‌وتیت به په‌له دێن بۆ لات.",
                            "verse 70:37": "به‌لای ڕاست و چه‌پدا خۆیان ون ده‌که‌ن و له دووره‌وه پۆل پۆل به‌ده‌وری یه‌کدا کۆده‌بنه‌وه‌.",
                            "verse 70:38": "ئا به‌و حاڵه‌وه‌، هه‌ریه‌که‌یان به‌ته‌مایه بخرێته ناو به‌هه‌شتی پڕ له نازو نیعمه‌ته‌وه‌؟!",
                            "verse 70:39": "نه‌خێر، وانی یه‌، به‌ڕاستی خۆشیان ده‌زانن له چی دروستمان کردوون (بۆ ئه‌وه‌نده له خۆیان بایی بوون).",
                            "verse 70:40": "جا سوێند به په‌روه‌ردگاری خۆرهه‌ڵاته‌کان و خۆرئاواکان، به‌ڕاستی ئێمه هه‌میشه به‌ده‌سه‌ڵاتین له‌سه‌ر:.",
                            "verse 70:41": "ئه‌مانه له‌ناوبه‌رین و که‌سانی چاکتر بهێنینه کایه‌وه‌، ئێمه بۆ ئه‌و مه‌به‌سته بێ توانا نین.",
                            "verse 70:42": "جا وازیان لێ بهێنه با هه‌ر ڕۆبچن له بێ باوه‌ڕیدا، با هه‌ر گه‌مه‌و گاڵته بکه‌ن، هه‌تا دووچاری ڕۆژی خۆیان ده‌بن که هه‌ڕه‌شه‌یان پێ لێ ده‌کرێت.",
                            "verse 70:43": "ئه‌و ڕۆژه‌ی به په‌له له گۆڕه‌کانیان دێنه ده‌ره‌وه‌، ده‌ڵێی بۆ لای بت و په‌رستراوه‌کانیان ڕاده‌که‌ن!!",
                            "verse 70:44": "چاویان شۆڕه‌و (شه‌رمه‌زارو خه‌جاڵه‌تن) زه‌لیلی و سه‌رشۆڕی ماندووی کردوون، جا ئه‌مه ئه‌و ڕۆژه‌یه که کاتی خۆی به‌ڵێنیان پێ ده‌دراو ئه‌وان بڕوایان پێی نه‌بوو."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "Salah seorang (dari kalangan orang-orang kafir Mekah, secara mengejek-ejek) meminta kedatangan azab yang (dijanjikan) akan berlaku,",
                            "verse 70:2": "Azab yang disediakan untuk orang-orang yang kafir, yang tidak ada sesiapapun dapat menolak kedatangannya -",
                            "verse 70:3": "Dari Allah yang menguasai tempat-tempat turun naik -",
                            "verse 70:4": "Yang dilalui oleh malaikat-malaikat dan Jibril ke pusat pemerintahanNya (untuk menerima dan menyempurnakan tugas masing-masing, terutama) pada satu masa yang adalah tempohnya (dirasai oleh orang-orang yang bersalah) sungguh panjang, (kerana banyak hitungan hisab dan berat soal jawabnya).",
                            "verse 70:5": "Maka bersabarlah (wahai Muhammad terhadap ejekan golongan yang kafir itu), dengan cara kesabaran yang sebaik-baiknya.",
                            "verse 70:6": "Sebenarnya mereka memandang azab itu jauh (daripada berlaku),",
                            "verse 70:7": "Sedang Kami memandangnya dekat, (tetap akan berlaku),",
                            "verse 70:8": "(Iaitu) pada hari langit menjadi seperti tembaga cair,",
                            "verse 70:9": "Dan gunung-ganang pula menjadi seperti bulu (yang berterbangan)",
                            "verse 70:10": "Dan sahabat karib tidak bertanyakan hal sahabat karibnya, (kerana tiap-tiap seorang sibuk memikirkan hal keadaannya sendiri),",
                            "verse 70:11": "Padahal masing-masing diberi melihat setengahnya yang lain; (pada saat yang demikian) orang yang kafir suka kiranya dapat menebus dirinya dari azab itu dengan anak-anaknya sendiri,",
                            "verse 70:12": "Dan isteri serta saudaranya,",
                            "verse 70:13": "Dan kaum kerabatnya yang melindunginya,",
                            "verse 70:14": "Dan juga sekalian makhluk yang ada di bumi - kemudian (diharapkannya) tebusan itu dapat menyelamatkannya.",
                            "verse 70:15": "Tidak sekali-kali (sebagaimana yang diharapkannya)! Sesungguhnya Neraka (yang disediakan baginya) tetap menjulang-julang apinya,",
                            "verse 70:16": "(Membakar serta) menggugurkan kulit ubun-ubun dan anggota anggota tubuh badan,",
                            "verse 70:17": "Neraka itu juga memanggil dan menarik orang yang membelakangi serta berpaling (dari kebenaran),",
                            "verse 70:18": "Dan yang mengumpulkan harta kekayaan lalu menyimpannya (dengan tidak membayar zakatnya).",
                            "verse 70:19": "Sesungguhnya manusia itu dijadikan bertabiat resah gelisah (lagi bakhil kedekut); -",
                            "verse 70:20": "Apabila dia ditimpa kesusahan, dia sangat resah gelisah;",
                            "verse 70:21": "Dan apabila dia beroleh kesenangan, dia sangat bakhil kedekut;",
                            "verse 70:22": "Kecuali orang-orang yang mengerjakan sembahyang -",
                            "verse 70:23": "Iaitu mereka yang tetap mengerjakan sembahyangnya;",
                            "verse 70:24": "Dan mereka (yang menentukan bahagian) pada harta-hartanya, menjadi hak yang termaklum -",
                            "verse 70:25": "Bagi orang miskin yang meminta dan orang miskin yang menahan diri (daripada meminta);",
                            "verse 70:26": "Dan mereka yang percayakan hari pembalasan (dengan mengerjakan amal-amal yang soleh sebagai buktinya);",
                            "verse 70:27": "Dan mereka yang cemas takut daripada ditimpa azab Tuhannya, -",
                            "verse 70:28": "Kerana sesungguhnya azab Tuhan mereka, tidak patut (bagi seseorangpun) merasa aman terhadapnya;",
                            "verse 70:29": "Dan mereka yang menjaga kehormatannya, -",
                            "verse 70:30": "Kecuali kepada isterinya atau kepada hambanya, maka sesungguhnya mereka tidak tercela;",
                            "verse 70:31": "Kemudian sesiapa yang mengingini selain dari yang demikian, maka merekalah orang-orang yang melampaui batas;",
                            "verse 70:32": "Dan mereka yang menjaga amanah dan janjinya;",
                            "verse 70:33": "Dan mereka yang memberikan keterangan dengan benar lagi adil (semasa mereka menjadi saksi);",
                            "verse 70:34": "Dan mereka yang tetap memelihara sembahyangnya;",
                            "verse 70:35": "Mereka (yang demikian sifatnya) ditempatkan di dalam Syurga dengan diberikan penghormatan.",
                            "verse 70:36": "Maka apakah yang menyebabkan orang-orang kafir, yang menentangmu (wahai Muhammad) datang berkejaran ke sisimu -",
                            "verse 70:37": "(Sambil mereka) berkumpul berpuak-puak di sebelah kanan dan di sebelah kirimu.",
                            "verse 70:38": "Patutkah tiap-tiap seorang dari mereka berharap supaya dimasukkan ke dalam Syurga yang penuh nikmat (sedang dia tidak beriman)?",
                            "verse 70:39": "Tidak sekali-kali! (Mereka yang kufur ingkar tidak akan dapat memasukinya).",
                            "verse 70:40": "Maka Aku bersumpah dengan (kebesaranKu) Tuhan yang menguasai (seluruh alam, meliputi) tempat-tempat terbit (matahari dan bulan bintang) dan tempat-tempat tenggelamnya, - sesungguhnya Kami berkuasa -",
                            "verse 70:41": "(Membinasakan mereka, serta) menggantikan mereka dengan makhluk-makluk yang lebih baik dari mereka dan Kami tidak sekali-kali dapat dikalahkan atau dilemahkan.",
                            "verse 70:42": "Oleh itu, biarkanlah mereka (wahai Muhammad) tenggelam dalam kesesatannya dan leka bermain-main (dalam dunianya), sehingga mereka menemui hari yang dijanjikan kepada mereka (untuk menerima balasan)! -",
                            "verse 70:43": "Iaitu hari mereka segera keluar dari kubur masing-masing menuju (ke Padang Mahsyar) dengan keadaan seolah-olah mereka berkejaran ke (tempat) berhala-berhala (yang mereka sembah dahulu),",
                            "verse 70:44": "Sambil pandangan mereka tunduk, serta mereka diliputi kehinaan; itulah hari yang telah dijanjikan kepada mereka."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "تقاضاكننده‏اى تقاضاى عذابى كرد كه واقع شد!",
                            "verse 70:2": "اين عذاب مخصوص كافران است، و هيچ كس نمى‏تواند آن را دفع كند،",
                            "verse 70:3": "از سوى خداوند ذى المعارج ( خداوندى كه فرشتگانش بر آسمانها صعود و عروج مى‏كنند)!",
                            "verse 70:4": "فرشتگان و روح ( فرشته مقرب خداوند) بسوى او عروج مى‏كنند در آن روزى كه مقدارش پنجاه هزار سال است!",
                            "verse 70:5": "پس صبر جميل پيشه كن،",
                            "verse 70:6": "زيرا آنها آن روز را دور مى‏بينند،",
                            "verse 70:7": "و ما آن را نزديك مى‏بينيم!",
                            "verse 70:8": "همان روز كه آسمان همچون فلز گداخته مى‏شود،",
                            "verse 70:9": "و كوه‏ها مانند پشم رنگين متلاشى خواهد بود،",
                            "verse 70:10": "و هيچ دوست صميمى سراغ دوستش را نمى‏گيرد!",
                            "verse 70:11": "آنها را نشانشان مى‏دهند (ولى هر كس گرفتار كار خويشتن است)، چنان است كه گنهكار دوست مى‏دارد فرزندان خود را در برابر عذاب آن روز فدا كند،",
                            "verse 70:12": "و همسر و برادرش را،",
                            "verse 70:13": "و قبيله‏اش را كه هميشه از او حمايت مى‏كرد،",
                            "verse 70:14": "و همه مردم روى زمين را تا مايه نجاتش گردند;",
                            "verse 70:15": "اما هرگز چنين نيست (كه با اينها بتوان نجات يافت، آرى) شعله‏هاى سوزان آتش است،",
                            "verse 70:16": "دست و پاو پوست سر را مى‏كند و مى‏برد!",
                            "verse 70:17": "و كسانى را كه به فرمان خدا پشت كردند صدا مى‏زند،",
                            "verse 70:18": "و (همچنين آنها كه) اموال را جمع و ذخيره كردند!",
                            "verse 70:19": "به يقين انسان حريص و كم‏طاقت آفريده شده است،",
                            "verse 70:20": "هنگامى كه بدى به او رسد بيتابى مى‏كند،",
                            "verse 70:21": "و هنگامى كه خوبى به او رسد مانع ديگران مى‏شود (و بخل مى‏ورزد)،",
                            "verse 70:22": "مگر نمازگزاران،",
                            "verse 70:23": "آنها كه نمازها را پيوسته بجا مى‏آورند،",
                            "verse 70:24": "و آنها كه در اموالشان حق معلومى است",
                            "verse 70:25": "براى تقاضاكننده و محروم،",
                            "verse 70:26": "و آنها كه به روز جزا ايمان دارند،",
                            "verse 70:27": "و آنها كه از عذاب پروردگارشان بيمناكند،",
                            "verse 70:28": "چرا كه هيچ كس از عذاب پروردگارش در امان نيست،",
                            "verse 70:29": "و آنها كه دامان خويش را (از بى‏عفتى) حفظ مى‏كنند،",
                            "verse 70:30": "جز با همسران و كنيزان (كه در حكم همسرند آميزش ندارند)، چرا كه در بهره‏گيرى از اينها مورد سرزنش نخواهند بود!",
                            "verse 70:31": "و هر كس جز اينها را طلب كند، متجاوز است!",
                            "verse 70:32": "و آنها كه امانتها و عهد خود را رعايت مى‏كنند،",
                            "verse 70:33": "و آنها كه با اداى شهادتشان قيام مى‏نمايند،",
                            "verse 70:34": "و آنها كه بر نماز مواظبت دارند،",
                            "verse 70:35": "آنان در باغهاى بهشتى (پذيرايى و) گرامى داشته مى‏شوند",
                            "verse 70:36": "اين كافران را چه مى‏شود كه با سرعت نزد تو مى‏آيند",
                            "verse 70:37": "از راست و چپ، گروه گروه (و آرزوى بهشت دارند)!",
                            "verse 70:38": "آيا هر يك از آنها (با اين اعمال زشتش) طمع دارد كه او را در بهشت پر نعمت الهى وارد كنند؟!",
                            "verse 70:39": "هرگز چنين نيست; ما آنها را از آنچه خودشان مى‏دانند آفريده‏ايم!",
                            "verse 70:40": "سوگند به پروردگار مشرقها و مغربها كه ما قادريم",
                            "verse 70:41": "كه جاى آنان را به كسانى بدهيم كه از آنها بهترند; و ما هرگز مغلوب نخواهيم شد!",
                            "verse 70:42": "آنان را به حال خود واگذار تا در باطل خود فروروند و بازى كنند تا زمانى كه روز موعود خود را ملاقات نمايند!",
                            "verse 70:43": "همان روز كه از قبرها بسرعت خارج مى‏شوند، گويى به سوى بتها مى‏دوند",
                            "verse 70:44": "در حالى كه چشمهايشان از شرم و وحشت به زير افتاده، و پرده‏اى از ذلت و خوارى آنها را پوشانده است! اين همان روزى است كه به آنها وعده داده مى‏شد!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "Alguém inquiriu sobre um castigo iminente,",
                            "verse 70:2": "Indefensável para os incrédulos,",
                            "verse 70:3": "Que viria de Deus, o Possuidor das vias de ascensão.",
                            "verse 70:4": "Até Ele ascenderão os anjos com o Espírito (o anjo Gabriel) em um dia, cuja duração será de cinqüenta mil anos.",
                            "verse 70:5": "Persevera, pois (ó Mensageiro), dignamente!",
                            "verse 70:6": "Em verdade, eles o vêem muito remoto,",
                            "verse 70:7": "Ao passo que Nós o vemos iminente:",
                            "verse 70:8": "Nesse dia, o céu estará como metal fundido,",
                            "verse 70:9": "E as montanhas, desintegradas, tal qual (flocos de) lã (tingida).",
                            "verse 70:10": "E nenhum amigo íntimo perguntará pelo seu amigo,",
                            "verse 70:11": "Ainda que sejam colocados um perante o outro.",
                            "verse 70:12": "Da sua esposa, do seu irmão,",
                            "verse 70:13": "Dos seus parentes, que o amparavam,",
                            "verse 70:14": "E de tudo quanto existe na terra, como se isso, então, pudesse libertá-lo (do castigo).",
                            "verse 70:15": "Qual! (Este) é o fogo infernal,",
                            "verse 70:16": "Dilacerador dos membros,",
                            "verse 70:17": "Que atrai o renegado desdenhoso,",
                            "verse 70:18": "Que acumula e guarda!",
                            "verse 70:19": "Em verdade, o homem foi criado impaciente;",
                            "verse 70:20": "Quando o mal o açoita, impacienta-se;",
                            "verse 70:21": "Mas, quando o bem o acaricia, torna-se tacanho;",
                            "verse 70:22": "Salvo os que oram,",
                            "verse 70:23": "Que são constantes em suas orações,",
                            "verse 70:24": "E em cujos bens há uma parcela intrínseca,",
                            "verse 70:25": "Para o mendigo e o desafortunado,",
                            "verse 70:26": "São aqueles que crêem no Dia do Juízo,",
                            "verse 70:27": "E são reverente, por temor ao castigo do seu Senhor,",
                            "verse 70:28": "Porque sabem que o castigo do seu Senhor é iniludível.",
                            "verse 70:29": "São aqueles que observam a castidade,",
                            "verse 70:30": "Exceto para com as esposas, ou (as cativas), que as suas destras possuem- nisso não serão reprovados.",
                            "verse 70:31": "Mas aqueles que se excederam nisso, serão os transgressores.",
                            "verse 70:32": "Os que respeitam as suas obrigações e convênios,",
                            "verse 70:33": "Que são sinceros em seus testemunhos,",
                            "verse 70:34": "E os que observam as suas orações,",
                            "verse 70:35": "Estes serão honrados em jardins.",
                            "verse 70:36": "Assim, pois, que ocorre com os incrédulos que te rodeiam, empertigados,",
                            "verse 70:37": "Em grupos, pela direita e pela esquerda?",
                            "verse 70:38": "Acaso ambiciona, cada um deles, ser introduzido no Jardim do Prazer?",
                            "verse 70:39": "Qual! Em verdade, Nós os criamos do que já sabem !",
                            "verse 70:40": "Juro, pois, pelo Senhor dos Orientes e dos Ocidentes que somos Poderoso,",
                            "verse 70:41": "Para suplantá-los por outros melhores do que eles, porque somos Invencível!",
                            "verse 70:42": "Deixai-los, pois, que se entretenham, e brinquem, até que topem com o seu dia, o qual lhes foi prometido!",
                            "verse 70:43": "Dia em que sairão apressados dos seus sepulcros, como se corressem para uma meta.",
                            "verse 70:44": "Seus olhares serão de humilhação, cobertos de ignomínia."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 70:1": "Cineva care se roagã a cerut sã cadã o osândã neîndoielnicã",
                            "verse 70:2": "Peste cei necredincioși, pe care nimeni nu o poate opri",
                            "verse 70:3": "[Și care sã vinã] de la Allah, Stãpânul drumurilor înãlțãrii.",
                            "verse 70:4": "Îngerii și Duhul se vor înãlța la El într-o Zi a cãrei duratã este cât cincizeci de mii de ani.",
                            "verse 70:5": "Deci rabdã cu bunã rãbdare!",
                            "verse 70:6": "Ei o vãd departe ,",
                            "verse 70:7": "Însã Noi o vedem aproape .",
                            "verse 70:8": "În Ziua aceea va fi cerul precum arama topitã ,",
                            "verse 70:9": "Iar munții vor fi asemenea lânii scãrmãnate",
                            "verse 70:10": "Și nu-l va mai întreba prietenul pe prieten ,",
                            "verse 70:11": "Mãcar cã se vor vedea.",
                            "verse 70:12": "Cu soața sa, cu fratele sãu",
                            "verse 70:13": "Și cu neamul sãu care-i dãruiește lui adãpost,",
                            "verse 70:14": "Cu toți cei care se aflã pe pãmânt, care l-ar putea mântui.",
                            "verse 70:15": "Dar nu! Va fi o flacãrã",
                            "verse 70:16": "Ce-i va smulge pielea de pe cap",
                            "verse 70:17": "Și-l va chema pe cel care a întors spatele și s-a depãrtat",
                            "verse 70:18": "Și a adunat și a grãmãdit în vase.",
                            "verse 70:19": "Omul a fost fãcut nestatornic;",
                            "verse 70:20": "Când are parte de rãu, el este abãtut",
                            "verse 70:21": "Iar când are parte de bine, el este zgârcit ,",
                            "verse 70:22": "Afarã de cei care fac Rugãciunea,",
                            "verse 70:23": "Care sunt stãruitori în Rugãciunea lor,",
                            "verse 70:24": "Din a cãror avere este un drept hotãrât,",
                            "verse 70:25": "Pentru cerșetor și pentru cel lipsit;",
                            "verse 70:26": "Iar aceia care socotesc adevãratã Ziua Judecãții",
                            "verse 70:27": "Și aceia care se tem de osânda Domnului lor -",
                            "verse 70:28": "Cãci nu existã nici o apãrare împotriva chinului Domnului lor! -",
                            "verse 70:29": "Și aceia care își pãstreazã castitatea,",
                            "verse 70:30": "Mai puțin de soațele lor sau de cele pe care le stãpânesc dreptele lor, cãci pentru aceasta ei nu vor fi mustrați,",
                            "verse 70:31": "Iar cei care aleargã dupã mai mult decât aceasta sunt pãcãtoși ,",
                            "verse 70:32": "Și aceia care pãzesc ceea ce li se încredințeazã, precum și legãmântul lor,",
                            "verse 70:33": "Și aceia care sunt drepți în mãrturiile lor",
                            "verse 70:34": "Și aceia care împlinesc Rugãciunea lor ,",
                            "verse 70:35": "Aceia vor fi cinstiți în Grãdini .",
                            "verse 70:36": "Dar ce este cu aceia care nu au crezut cã grãbesc cu ochii îndreptați spre tine,",
                            "verse 70:37": "[Venind de] la dreapta și",
                            "verse 70:38": "la stânga, în cete?",
                            "verse 70:39": "Oare nãdãjduiește fiecare om dintre ei sã fie lãsat sã intre înGrãdina plãcerii?",
                            "verse 70:40": "Ba nu! Noi i-am creat din ceea ce știu!",
                            "verse 70:41": "Nu! Jur pe Stãpânul rãsãriturilor și al apusurilor, cã Noi suntem în stare",
                            "verse 70:42": "Sã-i schimbãm cu alții mai buni decât ei și de nimeni nu putem fi împiedicați!",
                            "verse 70:43": "Deci, lasã-i sã se afunde și sã se joace, pânã ce vor întâlni Ziua lor, cu care au fost amenințați,",
                            "verse 70:44": "Ziua în care vor ieși din morminte în grabã, ca și cum ar alerga cãtre niște pietre ridicate ,",
                            "verse 70:45": "Cu ochii plecați, acoperiți de umilințã! Aceasta este Ziua cu care au fost amenințați! ,"
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 70:1": "Unul a cerut o osândă ce va să cadă",
                            "verse 70:2": "asupra tăgăduitorilor şi nimeni să nu-i poată sta în cale,",
                            "verse 70:3": "căci vine de la Dumnezeu, Stăpânul Treptelor",
                            "verse 70:4": "pe care îngerii şi Duhul le urcă către El într-o zi cât cincizeci de mii de ani.",
                            "verse 70:5": "Rabdă-i cu cuviincioasă răbdare.",
                            "verse 70:6": "Ei o văd departe,",
                            "verse 70:7": "însă Noi o vedem aproape.",
                            "verse 70:8": "Cerul, în Ziua aceea, va fi ca argintul topit,",
                            "verse 70:9": "iar munţii ca lâna scărmănată.",
                            "verse 70:10": "Nici un prieten nu va întreba de prietenul său apropiat,",
                            "verse 70:11": "chiar de le va fi dat să se vadă.",
                            "verse 70:12": "prin soţia sa, prin fratele său,",
                            "verse 70:13": "prin obştea sa care-l adăpostea",
                            "verse 70:14": "şi prin toţi de pe pământ, numai ca el să scape.",
                            "verse 70:15": "Iată însă văpaia,",
                            "verse 70:16": "jupuitoare de ţeste,",
                            "verse 70:17": "chemându-i pe cei care au dat înapoi şi au întors spatele,",
                            "verse 70:18": "pe cei care au strâns şi au grămădit.",
                            "verse 70:19": "Omul a fost creat nestatornic:",
                            "verse 70:20": "când îl atinge răul, este neliniştit;",
                            "verse 70:21": "când îl atinge binele, este zgârcit",
                            "verse 70:22": "afară de cei rugători,",
                            "verse 70:23": "de cei care în rugăciune sunt stăruitori",
                            "verse 70:24": "şi de cei din ale căror averi au parte",
                            "verse 70:25": "creşetorul şi lipsitul,",
                            "verse 70:26": "afară de cei care socot adevărată Ziua Judecăţii",
                            "verse 70:27": "şi se tem de osânda Domnului lor",
                            "verse 70:28": "— osânda Domnului lor este fără scăpare,",
                            "verse 70:29": "de cei care îşi păzesc cele ruşinoase",
                            "verse 70:30": "şi intră numai la soţiile lor ori la roabele lor şi n-au de ce să fie dojeniţi,",
                            "verse 70:31": "pe când cei care poftesc dincolo de aceasta sunt călcători de lege,",
                            "verse 70:32": "afară de cei care păzesc cele încredinţate lor, precum şi legămintele lor;",
                            "verse 70:33": "de cei care sunt drepţi în mărturia lor,",
                            "verse 70:34": "de cei care se îngrijesc de rugăciunile lor.",
                            "verse 70:35": "Aceştia vor fi cei cinstiţi în Grădini!",
                            "verse 70:36": "De ce tăgăduitorii se grăbesc către tine,",
                            "verse 70:37": "venind în cete din dreapta şi din stânga?",
                            "verse 70:38": "Fiece ins dintre ei ar dori să intre într-o Grădină a Plăcerii!",
                            "verse 70:39": "Ba nu! Noi i-am creat din ceea ce ştiu.",
                            "verse 70:40": "Ba nu! Jur pe Domnul Răsăritului şi al Asfinţitului că Noi avem putinţa",
                            "verse 70:41": "să-i înlocuim oricând cu alţii mai buni decât ei şi nimeni nu Ne-o poate lua înainte.",
                            "verse 70:42": "Lasă-i să pălăvrăgească şi să se joace până când vor întâlni Ziua ce le-a fost făgăduită,",
                            "verse 70:43": "Ziua când vor ieşi din morminte în goană de parcă ar fugi spre pietrele înălţate,",
                            "verse 70:44": "cu ochii în pământ, prigoniţi de umilinţă."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "И вопрошающий спросил о каре",
                            "verse 70:2": "Для неверных,Которую никто не сможет отвести, —",
                            "verse 70:3": "(Идущей) от Аллаха —Владыки всех ступеней восхожденья —",
                            "verse 70:4": "(Ступеней, по которым)Ангелы и Дух к Нему восходятЗа день один длиною в пятьдесяттысячелетий.",
                            "verse 70:5": "А потому терпи терпением благим, —",
                            "verse 70:6": "(День Воскресенья) они видят стольдалеким,",
                            "verse 70:7": "Мы ж видим близким (этот День).",
                            "verse 70:8": "Тот День,Когда расплавленною медью станетнебо,",
                            "verse 70:9": "Подобно (волосинкам) шерсти,распылятся горы.",
                            "verse 70:10": "Когда о своем друге друг не спросит,",
                            "verse 70:11": "Хотя они предстанут друг преддругом.",
                            "verse 70:12": "Своей жены и брата",
                            "verse 70:13": "И рода своего, который кров емудавал и пищу.",
                            "verse 70:14": "(Ценой) всего, что на земле,Что только бы могло его спасти.",
                            "verse 70:15": "Напрасно!Это ведь Огонь,",
                            "verse 70:16": "Что вплоть до черепаВсего его поглотит!",
                            "verse 70:17": "(В пылающее пламя) приглашая тех,Кто, отвращаясь, стал спиной,",
                            "verse 70:18": "Копил добро и (в закромах его)хранил.",
                            "verse 70:19": "Поистине, был беспокойным созданчеловек.",
                            "verse 70:20": "Когда его коснется зло,Он полон (бесконечных) жалоб;",
                            "verse 70:21": "Когда ж к нему добро приходит,Становится он скуп (и недоступен).",
                            "verse 70:22": "(Но не такие те),Кто (перед Господом) в молитвепреклонился,",
                            "verse 70:23": "Те, кто в своей молитве постоянен",
                            "verse 70:24": "И в чьем имуществеВсегда есть признанная доля",
                            "verse 70:25": "Для тех, которые о помощи взывают,И тех, которые о помощи(в смирении) молчат;",
                            "verse 70:26": "И те, кто верит в День (Господнего)Суда,",
                            "verse 70:27": "И те, кто наказания Господнегострашится, —",
                            "verse 70:28": "Ведь наказания АллахаНикто не сможет избежать.",
                            "verse 70:29": "И те, кто целомудрие свое блюдет,",
                            "verse 70:30": "Довольствуясь женой или рабыней,(Которой он свободу подарили в жены принял), —С них порицанья Мы снимаем!",
                            "verse 70:31": "Но тех, кто за пределы этогостремится,(Мы) преступающими (нарекаем).",
                            "verse 70:32": "И те, которые блюдут доверенную (импоклажу)И добросовестны в своих договорах,",
                            "verse 70:33": "И те, которые тверды в (правдивости)свидетельств,",
                            "verse 70:34": "И те, кто строг в часах молитвы, —",
                            "verse 70:35": "Они все те, кто будут почтеныВ садах прекрасных Рая.",
                            "verse 70:36": "Так что ж с неверными,Которые спешат к тебе",
                            "verse 70:37": "Толпою справа и толпою слева?",
                            "verse 70:38": "Неужто все они желаютВ Садах услады пребывать?",
                            "verse 70:39": "Но нет! Конечно, они знаютИ как, (и для чего) Мы сотворили их.",
                            "verse 70:40": "Клянусь2268 Владыкой разных (фаз)восхода и заката2269,Что, истинно, Мы можем",
                            "verse 70:41": "На лучших всех их заменитьИ не допустим Мы нарушить то,Что Мы замыслили к свершенью.",
                            "verse 70:42": "Оставь же суетиться ихи пустословить,Пока свой День они не встретят —Тот День, что им обещан был.",
                            "verse 70:43": "В тот День,Когда они все выйдут из могилИ устремятся к Знаковому (месту),",
                            "verse 70:44": "Потупленными будут взоры их,Позор (всецело) их поглотит, —Таков тот День,Который им обещан был! (месту),"
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "Alguien ha pedido un castigo inmediato",
                            "verse 70:2": "para los infieles, que nadie pueda rechazar,",
                            "verse 70:3": "que venga de Alá, Señor de las gradas.",
                            "verse 70:4": "Los ángeles y el Espíritu ascienden a Él en un día que equivale a cincuenta mil años.",
                            "verse 70:5": "¡Ten, pues, digna paciencia!",
                            "verse 70:6": "Piensan que está lejos,",
                            "verse 70:7": "pero Nosotros pensamos que está cerca.",
                            "verse 70:8": "El día que el cielo parezca metal fundido,",
                            "verse 70:9": "y las montañas, copos de lana,",
                            "verse 70:10": "y nadie pregunte por su amigo ferviente.",
                            "verse 70:11": "Les será dado verles.",
                            "verse 70:12": "a su compañera, a su hermano,",
                            "verse 70:13": "Al clan que lo cobijó,",
                            "verse 70:14": "a todos los de la tierra.",
                            "verse 70:15": "¡No! Será una hoguera,",
                            "verse 70:16": "que arrancará el cuero cabelludo",
                            "verse 70:17": "y reclamará a quien retroceda y vuelva la espalda,",
                            "verse 70:18": "a quien amase y atesore.",
                            "verse 70:19": "El hombre es de natural impaciente.",
                            "verse 70:20": "Pusilánime cuando sufre un mal,",
                            "verse 70:21": "mezquino cuando la fortuna le favorece.",
                            "verse 70:22": "Se exceptúa a quienes oran",
                            "verse 70:23": "perseverando en su azalá,",
                            "verse 70:24": "parte de cuyos bienes es de derecho",
                            "verse 70:25": "para el mendigo y el indigente,",
                            "verse 70:26": "que tienen por auténtico el día del Juicio,",
                            "verse 70:27": "que temen el castigo de su Señor",
                            "verse 70:28": "-nadie debe sentirse seguro contra el castigo de su Señor-,",
                            "verse 70:29": "que se abstienen de comercio carnal,",
                            "verse 70:30": "salvo con sus esposas o con sus esclavas -en cuyo caso no incurren en reproche,",
                            "verse 70:31": "mientras que quienes desean a otras mujeres, ésos son los que violan la ley-,",
                            "verse 70:32": "que respetan los depósitos que se les confían y las promesas que hacen,",
                            "verse 70:33": "que dicen la verdad en sus testimonios,",
                            "verse 70:34": "que observan su azalá.",
                            "verse 70:35": "Esos tales estarán en jardines, honrados.",
                            "verse 70:36": "¿Qué les pasa a los infieles, que vienen hacia ti corriendo con el cuello extendido,",
                            "verse 70:37": "en grupos, por la derecha y por la izquierda?",
                            "verse 70:38": "¿Es que cada uno de ellos anhela ser introducido en un jardín de delicia?",
                            "verse 70:39": "¡No! Les creamos de lo que saben.",
                            "verse 70:40": "¡Pues no! ¡Juro por el Señor de los Orientes y de los Occidentes, que somos bien capaces",
                            "verse 70:41": "de sustituirles por otros mejores que ellos, sin que nadie pueda impedírnoslo!",
                            "verse 70:42": "¡Déjales que parloteen y jueguen hasta que les llegue el día con que se les ha amenazado,",
                            "verse 70:43": "el día que salgan de las sepulturas, rápidos como si corrieran hacia piedras erectas,",
                            "verse 70:44": "la mirada abatida, cubiertos de humillación! Tal será el día con que se les había amenazado."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "(நிராகரிப்போருக்கு) சம்பவிக்கப் போகும் வேதனை பற்றி கேள்வி கேட்பவன் ஒருவன் (ஏளனமாகக்) கேட்கிறான்.",
                            "verse 70:2": "காஃபிர்களுக்கு (அது ஏற்படும்போது) அதனைத் தடுப்பவர் எவருமில்லை.",
                            "verse 70:3": "(அவ்வேதனை) உயர் வழிகளையுடைய அல்லாஹ்வினால் (ஏற்படும்).",
                            "verse 70:4": "ஒரு நாள் மலக்குகளும், (ஜிப்ரயீலாகிய) அவ்வான்மாவும், அவனிடம் ஏறிச் செல்வார்கள் அ(த்தினத்)தின் அளவு ஐம்பதினாயிரம் ஆண்டுகள் (சமமாக) இருக்கும்.",
                            "verse 70:5": "எனவே நீர் அழகிய பொறுமையுடன் பொறுப்பீராக.",
                            "verse 70:6": "நிச்சயமாக அவர்கள் அதை வெகு தூரமாகக் காண்கின்றனர்.",
                            "verse 70:7": "ஆனால், நாமோ அதனை வெகு சமீபமாகக் காண்கிறோம்.",
                            "verse 70:8": "வானம் உருக்கப்பட்ட செம்பைப் போல் ஆகிவிடும் நாளில்-",
                            "verse 70:9": "இன்னும், மலைகள் பஞ்சைப் போல் ஆகிவிடும் (நாளில்)-",
                            "verse 70:10": "(அனுதாபமுடையவனாக இருந்த) ஒரு நண்பன் மற்றொரு நண்பனை பற்றி (அனுதாபத்துடன்) விசாரிக்கமாட்டான்.",
                            "verse 70:11": "அவர்கள் நேருக்கு நேர் காண்பார்கள், (ஆனால் விசாரித்துக் கொள்ள மாட்டார்கள்); அந்நாளின் வேதனைக்கு ஈடாகக் குற்றவாளி ஈடுகொடுக்கப் பிரியப்படுவான்: தன் மக்களையும்-",
                            "verse 70:12": "தன் மனைவியையும், தன் சகோதரனையும்-",
                            "verse 70:13": "அவனை அரவணைத்துக் கொண்டிருந்த அவனுடைய சுற்றத்தாரையும்-",
                            "verse 70:14": "இன்னும் பூமியிலுள்ள அனைவரையும் (ஈடுகொடுத்துத்) தன்னைக் காப்பாற்றிக் கொள்ள (பிரியப்படுவான்).",
                            "verse 70:15": "அவ்வாறு (ஆவது) இல்லை, ஏனெனில் நிச்சயமாக அ(ந்நரகமாவ)து கொழுந்துவிட்டு எரியும் நெருப்பாகும்.",
                            "verse 70:16": "அது (சிரசுத்) தோல்களை (எரித்து) கழற்றி விடும்.",
                            "verse 70:17": "(நேர்வழியைப்) புறக்கணித்துப் புறங்காட்டிச் சென்றோரை அ(ந்நரகத்தீயான)து அழைக்கும்.",
                            "verse 70:18": "அன்றியும், பொருளைச் சேகரித்து, பிறகு (அதைத் தக்கபடி செலவு செய்யாமல்) காத்துக் கொண்டானே (அவனையும் அது அழைக்கும்)",
                            "verse 70:19": "நிச்சயமாக மனிதன் அவசரக்காரனாகவே படைக்கப்பட்டிருக்கின்றான்.",
                            "verse 70:20": "அவனை ஒரு கெடுதி தொட்டுவிட்டால் பதறுகிறான்,",
                            "verse 70:21": "ஆனால் அவனை ஒரு நன்மை தொடுமானால் (அது பிறருக்கும் கிடைக்காதவாறு) தடுத்துக்கொள்கிறான்.",
                            "verse 70:22": "தொழுகையாளிகளைத் தவிர-",
                            "verse 70:23": "(அதாவது) தம் தொழுகையின் மீது நிலைத்திருக்கின்றார்களே அவர்கள்.",
                            "verse 70:24": "அவர்களது பொருள்களில் (பிறருக்கு) நிர்ணயிக்கப்பட்ட பங்கு உண்டு.",
                            "verse 70:25": "யாசிப்போருக்கும் வறியோருக்கும் (அவர்களின் பொருட்களில் பங்குண்டு).",
                            "verse 70:26": "அன்றியும் நியாயத் தீர்ப்பு நாள் உண்டென்பதை (மெய்ப்படுத்தி) உறுதிகொள்பவர்கள்.",
                            "verse 70:27": "இன்னும் தம்முடைய இறைவன் (வழங்கக் கூடிய) வேதனைக்கு அஞ்சியவாறு இருப்பார்களே அவர்கள்.",
                            "verse 70:28": "நிச்சயமாக அவர்களுடைய இறைவன் (வழங்கக்கூடிய) வேதனை அச்சப்படாது இருக்கக் கூடியதல்ல.",
                            "verse 70:29": "அன்றியும், தங்கள் மறைவிடங்களை (கற்பை) பேணிக் கொள்கிறார்களே அவர்கள்-",
                            "verse 70:30": "தம் மனைவியரிடத்திலும், தங்கள் வலக்கரங்கள் சொந்தமாக்கிக் கொண்டவர்களிடத்திலும் (உறவு கொள்வதைத்) தவிர, நிச்சயமாக அவர்கள் (இத்தகையோருடன் உறவு கொள்வது பற்றி) நிந்திக்கப்பட மாட்டார்கள்.",
                            "verse 70:31": "எனவே எவரேனும் இதற்கப்பால் (உறவு கொள்வதைத்) தேடினால் அவர்கள் (இறைவன் விதித்த) வரம்பை மீறியவர்கள்.",
                            "verse 70:32": "இன்னும் எவர்கள் தம் அமானிதங்களையும் தம் வாக்குறுதிகளையும் பேணிக் கொள்கின்றார்களோ அவர்கள்.",
                            "verse 70:33": "இன்னும், எவர்கள் தங்கள் சாட்சியங்களில் உறுதியுடன் இருக்கிறார்களோ அவர்கள்.",
                            "verse 70:34": "எவர்கள் தங்கள் தொழுகைகளைப் பேணிக் கொள்கின்றார்களோ அவர்கள்.",
                            "verse 70:35": "(ஆக) இத்தகையோர் தாம் சுவர்க்கங்களில் கண்ணியப் படுத்தப்பட்டவர்களாக இருப்பார்கள்.",
                            "verse 70:36": "நிராகரிப்பவர்களுக்கு என்ன? (கழுத்துகளை நீட்டியவாறு அவர்கள்) உங்கள் முன் ஓடிவருகின்றனர்.",
                            "verse 70:37": "வலப்புறமிருந்தும் இடப்புறமிருந்தும் கூட்டம் கூட்டமாக.",
                            "verse 70:38": "அவர்களில் ஒவ்வொரு மனிதனும் பாக்கியமுள்ள சுவர்க்கத்தில் - ஜன்னத்துல் நயீமில் - நுழைந்துவிட ஆசைப்படுகிறானா?",
                            "verse 70:39": "அவ்வாறு (ஆகப் போவது) இல்லை.",
                            "verse 70:40": "எனவே, கிழக்குத் திசைகள், மேற்குத் திசைகள் ஆகியவற்றின் இறைவனாகிய (நம்) மீது சத்தியமாக, நிச்சயமாக நாம் (விரும்பியவாறு செய்ய) ஆற்றலுடையோம்.",
                            "verse 70:41": "(அவர்களுக்கு பதிலாக) அவர்களை விடச் சிறந்தவர்களை நாம் மாற்றியமைப்பதில் (ஆற்றலுடையோம்) ஏனெனில் நம்மை (எவரும்) மிகைக்க இயலாது.",
                            "verse 70:42": "ஆகவே, அவர்களுக்கு வாக்களிக்கப் பட்ட அந்த நாளை அவர்கள் சந்திக்கும் வரையில், அவர்கள் விளையாடிக் கொண்டிருக்கவும் (வீணானவற்றில்) மூழ்கிக் கிடக்கவும், அவர்களை நீர் விட்டுவிடுவீராக.",
                            "verse 70:43": "நிச்சயமாக அவர்கள் (தாங்கள் ஆராதனை செய்யும்) எல்லைக் கற்களின்பால் விரைந்து செல்பவர்களைப் போல் அந்நாளில் (தங்கள்) கப்றுகளிலிருந்து விரைவாக வெளியாவார்கள்.",
                            "verse 70:44": "அவர்களுடைய பார்வைகள் கீழ் நோக்கியிருக்கும், இழிவு அவர்களைச் சூழ்ந்து கொண்டிருக்கும், அவர்கள் வாக்களிக்கப்பட்டுக் கொண்டிருந்தார்களே அது அந்த நாள்தான்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "มีคนหนึ่งได้ขอการลงโทษที่จะต้องเกิดขึ้นอย่างแน่นอน",
                            "verse 70:2": "สำหรับบรรดาผู้ปฏิเสธศรัทธานั้นไม่มีผู้ปัดป้องใด ๆ ให้พ้นจาการลงโทษไปได้",
                            "verse 70:3": "(การลงโทษนั้น) มาจากอัลลอฮ์ ผู้เป็นเจ้าของแห่งทางขึ้นสู่เบื้องสูง",
                            "verse 70:4": "มลาอิกะฮ์และอัรรูหฺ (ญิบรีล) จะขึ้นไปหาพระองค์ในวันหนึ่งซึ่งกำหนดของมันเท่ากับห้าหมื่นปี (ของโลกดุนยานี้)",
                            "verse 70:5": "ดังนั้นเจ้าจงอดทนด้วยความอดทนที่ดีงามเถิด",
                            "verse 70:6": "แท้จริงพวกเขา (มุชริกีน) มองเห็นการลงโทษว่าเป็นเรื่องห่างไกล",
                            "verse 70:7": "แต่ว่าเราเห็นมัน (การลงโทษ) นั้นเป็นเรื่องใกล้",
                            "verse 70:8": "วันที่ท้องฟ้าจะเป็นเช่นทองแดงที่หลอมละลาย",
                            "verse 70:9": "และบรรดาภูเขาจะเป็นเช่นขนสัตว์ที่ปลิวว่อน",
                            "verse 70:10": "และมิตรสหายจะไม่ถามถึงกัน",
                            "verse 70:11": "ถึงแม้ว่าพวกเขาจะประสานสายตาซึ่งกันและกันก็ตาม ผู้ประพฤติชั่วก็ใคร่จะไถ่ตน ให้พ้นจากการลงโทษของอัลลอฮ์ในวันนั้นด้วยบุตรหลานของเขา",
                            "verse 70:12": "และด้วยภริยาของเขา และด้วยพี่น้องของเขา",
                            "verse 70:13": "และด้วยญาติพี่น้องของเขา ซึ่งได้ให้ที่พักอาศัยแก่เขา",
                            "verse 70:14": "และด้วยผู้ที่อยู่ในแผ่นดินทั้งมวล เพื่อที่จะให้เขารอดพ้นจากการลงโทษ",
                            "verse 70:15": "ไม่เลยทีเดียว แท้จริงมันเป็นไฟนรกที่ลุกโซน",
                            "verse 70:16": "หนังศีรษะถูกลอก ออก (เพราะความร้อนของไฟนรก)",
                            "verse 70:17": "มันจะเรียกผู้ที่ผินหลัง และหันห่างจากความจริง",
                            "verse 70:18": "และสะสมทรัพย์สินและปิดบังไว้",
                            "verse 70:19": "แท้จริงมนุษย์นั้นถูกบังเกิดมาเป็นคนหวั่นไหว",
                            "verse 70:20": "เมื่อความทุกข์ยากประสบแก่เขา ก็ตีโพยตีพายกลัดกลุ้ม",
                            "verse 70:21": "และเมื่อคุณความดีประสบแก่เขา ก็หวงแหน",
                            "verse 70:22": "นอกจากบรรดาผู้กระทำละหมาด",
                            "verse 70:23": "บรรดาผู้ที่ดำรงมั่นอยู่ในการทำละหมาดของพวกเขาเป็นประจำ",
                            "verse 70:24": "และบรรดาผู้ที่ในทรัพย์สินของพวกเขามีส่วนที่ถูกกำหนดไว้",
                            "verse 70:25": "สำหรับผู้ที่เอ่ยขอและผู้ที่ไม่เอ่ยขอ",
                            "verse 70:26": "และบรรดาผู้ที่เชื่อมั่นต่อวันแห่งการตอบแทน (วันกิยามะฮ์)",
                            "verse 70:27": "และบรรดาผู้ที่มีความหวาดหวั่นต่อการลงโทษแห่งพระเจ้าของพวกเขา",
                            "verse 70:28": "แท้จริงการลงโทษแห่งพระเจ้าของพวกเขาไม่เป็นที่ปลอดภัย",
                            "verse 70:29": "และบรรดาผู้ที่ระวังรักษาทวารของพวกเขา",
                            "verse 70:30": "นอกจากแก่คู่ครองของพวกเขา หรือที่มือขวาของพวกเขาครอบครองในลักษณะเช่นนั้นพวกเขาจะไม่เป็นผู้ที่ถูกตำหนิ",
                            "verse 70:31": "ดังนั้นผู้ใดล่วงละเมิดนอกเหนือไปจากนั้น ชนเหล่านั้นพวกเขาเป็นผู้ละเมิด",
                            "verse 70:32": "และบรรดาผู้ที่ระวังรักษาสิ่งที่ได้รับมอบหมาย (อะมานะฮ์) ของพวกเขาและคำมั่นสัญญาของพวกเขา",
                            "verse 70:33": "และบรรดาผู้ที่ดำรงมั่นต่อการเป็นพยานของพวกเขา",
                            "verse 70:34": "และบรรดาผู้ที่ดำรงรักษาในการละหมาดของพวกเขา",
                            "verse 70:35": "ชนเหล่านั้นจะอยู่ในสวนสวรรค์อันหลากหลายเป็นผู้ได้รับเกียรติ",
                            "verse 70:36": "มีอะไรเกิดขึ้นแก่บรรดาผู้ปฏิเสธศรัทธาที่วิ่งกระหืดกระหอบมายังเจ้า (มุฮัมมัด)",
                            "verse 70:37": "พวกเขานั่งเป็นกลุ่ม ๆ ทางขวาหรือทางซ้ายของเจ้า",
                            "verse 70:38": "แต่ละคนในหมู่พวกเขาต่างก็อยากจะเข้าไปอยู่ในสวนสวรรค์อันสุขสำราญกระนั้นหรือ ?",
                            "verse 70:39": "ไม่เลยทีเดียวแท้จริงเราได้สร้างพวกเขาจากสิ่งที่พวกเขารู้กันดี",
                            "verse 70:40": "ข้าขอสาบานต่อพระเจ้าแห่งบรรดาทิศตะวันออก และบรรดาทิศตะวันตกว่า แท้จริงเรา (อัลลอฮ์) เป็นผู้เดชานุภาพอย่างแน่นอน",
                            "verse 70:41": "ต่อการที่เราจะเปลี่ยนตัวแทนซึ่งดีกว่าพวกเขาและเราจะไม่เป็นผู้หมดความสามารถ",
                            "verse 70:42": "ดังนั้น เจ้าจงปล่อยพวกเขาให้มั่วสุมและหลงระเริง จนกว่าพวกเขาจะได้พบกับวัน (กิยามะฮ์) ของพวกเขา ซึ่งพวกเขาถูกสัญญาไว้",
                            "verse 70:43": "วันที่พวกเขาจะออกมาจากหลุมฝังศพอย่างรีบเร่งคล้ายกับพวกเขาวิ่งกรูไปยังเจว็ดของพวกเขา",
                            "verse 70:44": "สายตาของพวกเขาละห้อยเศร้าสลดความอัปยศปกคลุมพวกเขา นั่นคือวันที่พวกเขาถูกสัญญาไว้"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "İnkârcılar",
                            "verse 70:2": "için;ki onu savacak yoktur,",
                            "verse 70:3": "Yükselme derecelerinin sahibi olan Allah katından.",
                            "verse 70:4": "Melekler ve Rûh (Cebrail), oraya, miktarı (dünya senesi ile) ellibin yıl olan bir günde yükselip çıkar.",
                            "verse 70:5": "(Resûlüm!) Şimdi sen güzelce sabret.",
                            "verse 70:6": "Doğrusu onlar, o azabı (ihtimalden) uzak görüyorlar.",
                            "verse 70:7": "Biz ise onu yakın görmekteyiz.",
                            "verse 70:8": "O gün gökyüzü, erimiş maden gibi olur.",
                            "verse 70:9": "Dağlar da atılmış yüne döner.",
                            "verse 70:10": "Dost, dostu sormaz.",
                            "verse 70:11": "Birbirlerine gösterilirler (fakat herkes kendi derdindedir).",
                            "verse 70:12": "Karısını ve kardeşini,",
                            "verse 70:13": "Kendisini koruyup barındıran tüm ailesini",
                            "verse 70:14": "Ve yeryüzünde kim varsa hepsini fidye olarak versin de, tek kendini kurtarsın.",
                            "verse 70:15": "Fakat ne mümkün! Bilinmeli ki, o (cehennem) alevlenen bir ateştir.",
                            "verse 70:16": "Derileri kavurup soyar.",
                            "verse 70:17": "Yüz çevirip geri döneni, (kendine) çağırır!",
                            "verse 70:18": "(Servet) toplayıp yığan kimseyi!.",
                            "verse 70:19": "Gerçekten insan, pek hırslı (ve sabırsız) yaratılmıştır.",
                            "verse 70:20": "Kendisine fenalık dokunduğunda sızlanır, feryat eder.",
                            "verse 70:21": "Ona imkân verildiğinde ise pinti kesilir.",
                            "verse 70:22": "Ancak şunlar öyle değildir: Namaz kılanlar,",
                            "verse 70:23": "Ki,",
                            "verse 70:24": "onlar namazlarında devamlıdırlar (ihmal göstermezler;).",
                            "verse 70:25": "Mallarında, belli bir hak vardır,",
                            "verse 70:26": "Sâile ve mahrûma(vermek için).",
                            "verse 70:27": "Ceza (ve hesap) gününün doğruluğuna inananlar;",
                            "verse 70:28": "Rab'lerinin azabından korkanlar,",
                            "verse 70:29": "Ki Rab'lerinin azabı(na karşı) emin olunamaz;",
                            "verse 70:30": "Irzlarını koruyanlar",
                            "verse 70:31": "Ancak eşlerine ve cariyelerine karşı müstesna; çünkü onlar kınanmaz;",
                            "verse 70:32": "Bundan",
                            "verse 70:33": "öteye (geçmek) isteyenler ise, onlar taşkınların ta kendileridir,",
                            "verse 70:34": "Emanetlerine ve ahitlerine riayet edenler;",
                            "verse 70:35": "Şahitliklerini (dosdoğru) yapanlar;",
                            "verse 70:36": "Namazlarını koruyanlar;",
                            "verse 70:37": "İşte bunlar, cennetlerde ağırlanırlar.",
                            "verse 70:38": "(Resûlüm!) O kâfirlere ne oluyor ki, sana doğru koşuyorlar?",
                            "verse 70:39": "Bölük bölük sağından ve solundan(gelip etrafını sarıyorlar)",
                            "verse 70:40": "Onlardan her biri nimet cennetine sokulacağını mı umuyor?",
                            "verse 70:41": "Hayır (hiç ummasınlar!) Şüphesiz biz onları, kendilerinin de bildikleri şeyden yarattık (fakat ibret almadılar, imana gelmediler).",
                            "verse 70:42": "Doğuların ve batıların Rabbine yemin ederim ki, bizim gücümüz yeter:",
                            "verse 70:43": "Şüphesiz onların yerine daha iyilerini getirmeye bizim gücümüz yeter ve kimse bizim önümüze geçemez.",
                            "verse 70:44": "Ama sen onları (şimdilik) bırak da, tehdit edildikleri günlerine kavuşuncaya dek dalsınlar, oynayadursunlar.",
                            "verse 70:45": "O gün onlar, sanki dikili bir şeye koşuyorlar gibi, kabirlerinden fırlaya fırlaya çıkarlar.",
                            "verse 70:46": "Gözleri",
                            "verse 70:47": "horluktan aşağı düşmüş ve kendileri zillete bürünmüş bir halde."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "ایک طلب کرنے والے نے عذاب طلب کیا جو نازل ہو کر رہے گا",
                            "verse 70:2": "ايک سائل نے ايسا عذاب طلب کيا جو واقع ہونے والا ہےo",
                            "verse 70:3": "کافروں کے لئے جسے کوئي دفع کرنے والا نہيںo",
                            "verse 70:4": "(یعنی) کافروں پر (اور) کوئی اس کو ٹال نہ سکے گا",
                            "verse 70:5": "(اور وہ) خدائے صاحب درجات کی طرف سے (نازل ہوگا)",
                            "verse 70:6": "(وہ) اللہ کي جانب سے (واقع ہوگا) جو آسماني زينوں (اور بلند مراتب درجات) کا مالک ہےo",
                            "verse 70:7": "اس (کے عرش) کي طرف فرشتے اور روح الامين عروج کرتے ہيں ايک دن ميں، جس کا اندازہ (دنيوي حساب سے) پچاس ہزار برس کا ہے?o? فِي يَومٍ اگر وَاقِعٍ کا صلہ ہو تو معني ہوگا کہ جس دن (يوم قيامت کو) عذاب واقع ہوگا اس کا دورانيہ 50 ہزار برس کے قريب ہے? اور اگر يہ تَعرُجُ کا صلہ ہو تو معني ہوگا کہ ملائکہ اور اَرواحِ مومنين جو عرشِ اِل?ہي کي طرف عروج کرتي ہيں ان کے عروج کي رفتار 50 ہزار برس يوميہ ہے، وہ پھر بھي کتني مدت ميں منزلِ مقصود تک پہنچتے ہيں? وا? أعلم بالصواب? (يہاں سے نوري سال (light year) کے تصور کا اِستنباط ہوتا ہے?)",
                            "verse 70:8": "جس کی طرف روح (الامین) اور فرشتے پڑھتے ہیں (اور) اس روز (نازل ہوگا) جس کا اندازہ پچاس ہزار برس کا ہوگا",
                            "verse 70:9": "(تو تم کافروں کی باتوں کو) قوت کے ساتھ برداشت کرتے رہو",
                            "verse 70:10": "سو (اے حبيب!) آپ (کافروں کي باتوں پر) ہر شکوہ سے پاک صبر فرمائيںo",
                            "verse 70:11": "بے شک وہ (تو) اس (دن) کو دور سمجھ رہے ہيںo",
                            "verse 70:12": "وہ ان لوگوں کی نگاہ میں دور ہے",
                            "verse 70:13": "اور ہماری نظر میں نزدیک",
                            "verse 70:14": "اور ہم اسے قريب ہي ديکھتے ہيںo",
                            "verse 70:15": "جس دن آسمان پگھلے ہوئے تانبے کي طرح ہو جائے گاo",
                            "verse 70:16": "جس دن آسمان ایسا ہو جائے گا جیسے پگھلا ہوا تانبا",
                            "verse 70:17": "اور پہاڑ (ایسے) جیسے (دھنکی ہوئی) رنگین اون",
                            "verse 70:18": "اور پہاڑ (دُھنکي ہوئي) رنگين اُون کي طرح ہو جائيں گےo",
                            "verse 70:19": "اور کوئي دوست کسي دوست کا پرساں نہ ہوگاo",
                            "verse 70:20": "اور کوئی دوست کسی دوست کا پرسان نہ ہوگا",
                            "verse 70:21": "(حالانکہ) ایک دوسرے کو سامنے دیکھ رہے ہوں گے (اس روز) گنہگار خواہش کرے گا کہ کسی طرح اس دن کے عذاب کے بدلے میں (سب کچھ) دے دے یعنی اپنے بیٹے",
                            "verse 70:22": "(حالانکہ) وہ (ايک دوسرے کو) دکھائے جا رہے ہوں گے، مجرم آرزو کرے گا کہ کاش! اس دن کے عذاب (سے رہائي) کے بدلہ ميں اپنے بيٹے دے دےo",
                            "verse 70:23": "اور اپني بيوي اور اپنا بھائي (دے ڈالے)o",
                            "verse 70:24": "اور اپنی بیوی اور اپنے بھائی",
                            "verse 70:25": "اور اپنا خاندان جس میں وہ رہتا تھا",
                            "verse 70:26": "اور اپنا (تمام) خاندان جو اُسے پناہ ديتا تھاo",
                            "verse 70:27": "اور جتنے لوگ بھي زمين ميں ہيں، سب کے سب (اپني ذات کے لئے بدلہ کر دے)، پھر يہ (فديہ) اُسے (اللہ کے عذاب سے) بچا لےo",
                            "verse 70:28": "اور جتنے آدمی زمین میں ہیں (غرض) سب (کچھ دے دے) اور اپنے تئیں عذاب سے چھڑا لے",
                            "verse 70:29": "(لیکن) ایسا ہرگز نہیں ہوگا وہ بھڑکتی ہوئی آگ ہے",
                            "verse 70:30": "ايسا ہرگز نہ ہوگا، بے شک وہ شعلہ زن آگ ہےo",
                            "verse 70:31": "سر اور تمام اَعضائے بدن کي کھال اتار دينے والي ہےo",
                            "verse 70:32": "کھال ادھیڑ ڈالنے والی",
                            "verse 70:33": "ان لوگوں کو اپنی طرف بلائے گی جنہوں نے (دین حق سے) اعراض کیا",
                            "verse 70:34": "وہ اُسے بلا رہي ہے جس نے (حق سے) پيٹھ پھيري اور رُوگرداني کيo",
                            "verse 70:35": "اور (اس نے) مال جمع کيا پھر (اسے تقسيم سے) روکے رکھاo",
                            "verse 70:36": "اور (مال )جمع کیا اور بند کر رکھا",
                            "verse 70:37": "کچھ شک نہیں کہ انسان کم حوصلہ پیدا ہوا ہے",
                            "verse 70:38": "بے شک انسان بے صبر اور لالچي پيدا ہوا ہےo",
                            "verse 70:39": "جب اسے مصيبت (يا مالي نقصان) پہنچے تو گھبرا جاتا ہےo",
                            "verse 70:40": "جب اسے تکلیف پہنچتی ہے تو گھبرا اٹھتا ہے",
                            "verse 70:41": "اور جب آسائش حاصل ہوتی ہے تو بخیل بن جاتا ہے",
                            "verse 70:42": "اور جب اسے بھلائي (يا مالي فراخي) حاصل ہو تو بخل کرتا ہےo",
                            "verse 70:43": "مگر وہ نماز ادا کرنے والےo",
                            "verse 70:44": "مگر نماز گزار",
                            "verse 70:45": "جو نماز کا التزام رکھتے (اور بلاناغہ پڑھتے) ہیں",
                            "verse 70:46": "جو اپني نماز پر ہميشگي قائم رکھنے والے ہيںo",
                            "verse 70:47": "اور وہ (ايثار کيش) لوگ جن کے اَموال ميں حصہ مقرر ہےo",
                            "verse 70:48": "اور جن کے مال میں حصہ مقرر ہے",
                            "verse 70:49": "(یعنی) مانگنے والے کا۔ اور نہ مانگے والے والا کا",
                            "verse 70:50": "مانگنے والے اور نہ مانگنے والے محتاج کاo",
                            "verse 70:51": "اور وہ لوگ جو روزِ جزا کي تصديق کرتے ہيںo",
                            "verse 70:52": "اور جو روز جزا کو سچ سمجھتے ہیں",
                            "verse 70:53": "اور جو اپنے پروردگار کے عذاب سے خوف رکھتے ہیں",
                            "verse 70:54": "اور وہ لوگ جو اپنے رب کے عذاب سے ڈرنے والے ہيںo",
                            "verse 70:55": "بے شک ان کے رب کا عذاب ايسا نہيں جس سے بے خوف ہوا جائےo",
                            "verse 70:56": "بیشک ان کے پروردگار کا عذاب ہے ہی ایسا کہ اس سے بیخوف نہ ہوا جائے",
                            "verse 70:57": "اور جو اپنی شرمگاہوں کی حفاظت کرتے ہیں",
                            "verse 70:58": "اور وہ لوگ جو اپني شرم گاہوں کي حفاظت کرتے ہيںo",
                            "verse 70:59": "سوائے اپني منکوحہ بيويوں کے يا اپني مملوکہ کنيزوں کے، سو (اِس ميں) اُن پر کوئي ملامت نہيںo",
                            "verse 70:60": "مگر اپنی بیویوں یا لونڈیوں سے کہ (ان کے پاس جانے پر) انہیں کچھ ملامت نہیں",
                            "verse 70:61": "اور جو لوگ ان کے سوا اور کے خواستگار ہوں وہ حد سے نکل جانے والے ہیں",
                            "verse 70:62": "سو جو ان کے علاوہ طلب کرے تو وہي لوگ حد سے گزرنے والے ہيںo",
                            "verse 70:63": "اور وہ لوگ جو اپني امانتوں اور اپنے وعدوں کي نگہداشت کرتے ہيںo",
                            "verse 70:64": "اور جو اپنی امانتوں اور اقراروں کا پاس کرتے ہیں",
                            "verse 70:65": "اور جو اپنی شہادتوں پر قائم رہتے ہیں",
                            "verse 70:66": "اور وہ لوگ جو اپني گواہيوں پر قائم رہتے ہيںo",
                            "verse 70:67": "اور وہ لوگ جو اپني نمازوں کي حفاظت کرتے ہيںo",
                            "verse 70:68": "اور جو اپنی نماز کی خبر رکھتے ہیں",
                            "verse 70:69": "یہی لوگ باغہائے بہشت میں عزت واکرام سے ہوں گے",
                            "verse 70:70": "يہي لوگ ہيں جو جنتوں ميں معزّز و مکرّم ہوں گےo",
                            "verse 70:71": "تو کافروں کو کيا ہو گيا ہے کہ آپ کي طرف دوڑے چلے آرہے ہيںo",
                            "verse 70:72": "تو ان کافروں کو کیا ہوا ہے کہ تمہاری طرف دوڑے چلے آتے ہیں",
                            "verse 70:73": "اور) دائیں بائیں سے گروہ گروہ ہو کر (جمع ہوتے جاتے ہیں)",
                            "verse 70:74": "دائيں جانب سے (بھي) اور بائيں جانب سے (بھي) گروہ در گروہo",
                            "verse 70:75": "کيا ان ميں سے ہر شخص يہ توقع رکھتا ہے کہ وہ (بغير ايمان و عمل کے) نعمتوں والي جنت ميں داخل کر ديا جائے گا؟o",
                            "verse 70:76": "کیا ان میں سے ہر شخص یہ توقع رکھتا ہے کہ نعمت کے باغ میں داخل کیا جائے گا",
                            "verse 70:77": "ہرگز نہیں۔ ہم نے ان کو اس چیز سے پیدا کیا ہے جسے وہ جانتے ہیں",
                            "verse 70:78": "ہرگز نہيں، بے شک ہم نے انہيں اس چيز سے پيدا کيا ہے جسے وہ (بھي) جانتے ہيںo",
                            "verse 70:79": "سو ميں مشارق اور مغارب کے رب کي قَسم کھاتا ہوں کہ بے شک ہم پوري قدرت رکھتے ہيںo",
                            "verse 70:80": "ہمیں مشرقوں اور مغربوں کے مالک کی قسم کہ ہم طاقت رکھتے ہیں",
                            "verse 70:81": "(یعنی) اس بات پر (قادر ہیں) کہ ان سے بہتر لوگ بدل لائیں اور ہم عاجز نہیں ہیں",
                            "verse 70:82": "اس پر کہ ہم بدل کر ان سے بہتر لوگ لے آئيں، اور ہم ہرگز عاجز نہيں ہيںo",
                            "verse 70:83": "سو آپ انہيں چھوڑ ديجئے کہ وہ اپني بے ہودہ باتوں اور کھيل تماشے ميں پڑے رہيں يہاں تک کہ اپنے اس دن سے آمليں جس کا ان سے وعدہ کيا جا رہا ہےo",
                            "verse 70:84": "تو (اے پیغمبر) ان کو باطل میں پڑے رہنے اور کھیل لینے دو یہاں تک کہ جس دن کا ان سے وعدہ کیا جاتا ہے وہ ان کے سامنے آ موجود ہو",
                            "verse 70:85": "اس دن یہ قبر سے نکل کر (اس طرح) دوڑیں گے جیسے (شکاری) شکار کے جال کی طرف دوڑتے ہیں",
                            "verse 70:86": "جس دن وہ قبروں سے دوڑتے ہوئے يوں نکليں گے گويا وہ بتوں کے اَستھانوں کي طرف دوڑے جا رہے ہيںo",
                            "verse 70:87": "(ان کا) حال يہ ہو گا کہ ان کي آنکھيں (شرم اور خوف سے) جھک رہي ہوں گي، ذِلت ان پر چھا رہي ہوگي، يہي ہے وہ دن جس کا ان سے وعدہ کيا جاتا تھاo",
                            "verse 70:88": "ان کی آنکھیں جھک رہی ہوں گی اور ذلت ان پر چھا رہی ہوگی۔ یہی وہ دن ہے جس کا ان سے وعدہ کیا جاتا تھا تھاo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 70:1": "Сўровчи воқеъ бўлувчи азоб ҳақида сўради.",
                            "verse 70:2": "Кофирлар устига.",
                            "verse 70:3": "У маъорижлар эгаси Аллоҳдандир.",
                            "verse 70:4": "Фаришталар ва Руҳ Унинг ҳузурига миқдори эллик минг йил бўлган кунда кўтариладир.",
                            "verse 70:5": "Бас, чиройли сабр қил.",
                            "verse 70:6": "Албатта, улар у(қиёмат)ни узоқ деб билурлар.",
                            "verse 70:7": "Ва Биз уни жуда яқин деб билурмиз.",
                            "verse 70:8": "У кунда осмон худди қора мой қолдиқларига ўхшаб қоладир.",
                            "verse 70:9": "Ва тоғлар худди титилган жунга ўхшаб қоладир.",
                            "verse 70:10": "Ва яқин дўст ўз дўстидан сўрамайдир.",
                            "verse 70:11": "Уларни кўриб турурлар.",
                            "verse 70:12": "Хотинини ва ака-укасини ҳам,",
                            "verse 70:13": "Ва уни ўзига олган қабиласини ҳам.",
                            "verse 70:14": "Ва ер юзидаги жамийки кимсаларни ҳам фидо қилишни, сўнгра ўзи нажот топишни истайдир.",
                            "verse 70:15": "Йўқ! Албатта у(жаҳаннам) кучли алангадир.",
                            "verse 70:16": "Бошнинг терисини сидириб олувчидир.",
                            "verse 70:17": "У чақирадир; орқага кетган ва юз ўгирганни.",
                            "verse 70:18": "Ва (молни) йиғиб беркитганни.",
                            "verse 70:19": "Албатта, инсон «ҳалуъ» қилиб яратилгандир.",
                            "verse 70:20": "Агар унга ёмонлик етса, чидамсиздир.",
                            "verse 70:21": "Ва агар яхшилик етса, кўп ман қилувчидир.",
                            "verse 70:22": "Магара намоз ўқувчиларгина мустаснодир.",
                            "verse 70:23": "Улар намозларида доим бўладиганлардир.",
                            "verse 70:24": "Уларнинг молу мулкларида мвълум ҳақ бордир.",
                            "verse 70:25": "Сўровчи ва бечоралар учундир.",
                            "verse 70:26": "Ва улар қиёмат кунини тасдиқлайдиганлардир.",
                            "verse 70:27": "Ва улар ўз Роббилари азобидан қўрқадиганлардир.",
                            "verse 70:28": "Албатта Роббиларининг азобидан омонлик йўқдир.",
                            "verse 70:29": "Ва улар ўз фаржларини сақлайдиганлардир.",
                            "verse 70:30": "Магарам ўз хотинлари ёки ўз мулки бўлганлар мустаснодир.",
                            "verse 70:31": "Кимки ўшандан ўзгани истаса, бас, улар чегарадан чиққанлардир.",
                            "verse 70:32": "Улар омонатларига ва аҳдларига риоя қиладиганлардир.",
                            "verse 70:33": "Ва улар гувоҳликларини тўғри берадиганлардир.",
                            "verse 70:34": "Улар намозларини муҳофаза қиладиганлардир.",
                            "verse 70:35": "Ўшалар жаннатларда ҳурматланадиганлардир.",
                            "verse 70:36": "Куфр келтирганларга нима бўлдики, бўйинларини чўзиб сен томон шошмоқдалар?!",
                            "verse 70:37": "Ўнг тарафдан ва чап тарафдан тўп-тўп бўлмоқдалар?! (Пайғамбар саллоллоҳу алайҳи васаллам Қуръон тиловат қилганларида мушриклар шошилиб келиб, тўп-тўп бўлиб ўтиришар ва кўз узмай тикилиб туришар эдилар.",
                            "verse 70:38": "Улардан ҳар бир киши наъим жаннатга киритилишни тамаъ қиладими?",
                            "verse 70:39": "Йўқ! Албатта, Биз уларни ўзлари билган нарсадан яратганмиз.",
                            "verse 70:40": "Машриқлар ва мағриблар Роббиси билан қасам ичаманки, албатта Биз қодирмиз.",
                            "verse 70:41": "Ўринларига улардан яхшироқларини алмаштиришга қодирмиз ва Биз бу ишни қилишдан ожиз эмасмиз.",
                            "verse 70:42": "Уларни тек қўй.",
                            "verse 70:43": "У кунда худди санамлар (ибодатига) шошганларидек, қабрларидан шошиб чиқурлар.",
                            "verse 70:44": "Кўзлари қўрқинчга тўлган, ўзларини хорлик қоплаган ҳолда турурлар."
                        }
                    }
                }
            }
        }
    }
}