{
    "id": 73,
    "name_simple": "Al-Muzzammil",
    "revelation_place": "makkah",
    "revelation_order": 3,
    "bismillah_pre": true,
    "verses_count": 20,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah has been so designated after the word al-muzzammil occurring in the very first verse. This is only a name and not a title of its subject matter.",
    "text": [
        "\n",
        "The Surah has been so designated after the word al-muzzammil occurring in the very first verse. This is only a name and not a title of its subject matter.",
        "\n",
        "Period of Revelation",
        "\n",
        "The two sections of this Surah were revealed in two separate periods.",
        "\n",
        "The first section (vv. 1-19) is unanimously a Makki Revelation, and this is supported both by its subject matter and by the traditions of the Hadith. As for the question, in which specific period of the life at Makkah it was revealed, it is not answered by the tradition, but the internal evidence of the subject matter of this section helps to determine the period of its revelation.",
        "\n",
        "First, in it the Holy Prophet (upon whom be peace) has been instructed to the effect: \"Arise during the night and worship Allah so that you may develop the capability to shoulder the heavy burden of Prophethood and to discharge its responsibilities.\" This shows that this Command must have been given in the earliest period of the Prophethood when training was being imparted to the Holy prophet by Allah for this office.",
        "\n",
        "Secondly, a Command has been given in it that the Qur'an be recited in, the Tahajjud Prayer for half the night, or thereabout. This Command by itself points out that by that time at least so much of the Qur'an had been revealed as could be recited for that long.",
        "\n",
        "Thirdly, in this section the Holy Prophet (upon whom be peace) has been exhorted to have patience at the excesses being committed by his opponents, and the disbelievers of Makkah have been threatened with the torment. This shows that this section was revealed at a time when the Holy Prophet (upon whom be peace) had openly started preaching Islam and the opposition to him at Makkah had grown active and strong.",
        "\n",
        "About the second section (v. 20) although many of the commentators have expressed the opinion that this too was sent down at Makkah, yet some other commentators regard it as a Madani Revelation, and this same opinion is confirmed by the subject matter of this section. For it mentions fighting in the way of Allah, and obviously, there could be no question of it at Makkah; it also contains the Command to pay the obligatory zakat, and it is fully confirmed that the zakat at a specific rate and with an exemption limit (nisab) was enjoined at Madinah.",
        "\n",
        "Theme and Subject Matter",
        "\n",
        "In the first seven verses the Holy Prophet (upon whom be peace) has been commanded to the effect: \"Prepare yourself to shoulder the responsibilities of the great Mission that has been entrusted to you; its practical form is that you should rise during the hours of night and stand up in Prayer for half the night, or for a little more or less of it.\"",
        "\n",
        "In vv. 8-14, he has been exhorted to the effect: \"Devote yourself exclusively to that God Who is the Owner of the whole universe. Entrust all your affairs to Him with full satisfaction of the heart. Bear with patience whatever your opponents may utter against you. Do not be intimate with them. Leave their affair to God: He Himself will deal with them.\"",
        "\n",
        "Then, in vv. 15-19, those of the people of Makkah, who were opposing the Holy Prophet (upon whom be peace) have been warned, so as to say: \"We have sent a Messenger to you just as We sent a Messenger to the Pharaoh. Just consider what fate the Pharaoh met when he did not accept the invitation of the Messenger of Allah. Supposing that you are not punished by a torment in this world, how will you save yourselves from the punishment for disbelief on the Day of Resurrection.\"",
        "\n",
        "This is the subject matter of the first section. The second section, according to a tradition from Hadrat Sa'id bin Jubair, was sent down ten years later, and in it the initial Command given in connection with the Tahajjud Prayer, in the beginning of the first section, was curtailed. The new Command enjoined, \"Offer as much of the Tahajjud Prayer as you easily can, but what the Muslims should particularly mind and attend to is the five times obligatory Prayer a day:, they should establish it regularly and punctually; they should discharge their zakat dues accurately; and they should spend their wealth with sincere intentions for the sake of Allah. In conclusion, the Muslims have been exhorted, saying: \"Whatever good works you do in the world, will not go waste, but they are like the provision which a traveler sends up in advance to his permanent place of residence. Whatever good you send up from the world, you will find it with Allah, and the provision thus sent up is\r\nmuch better than what you will have to leave behind in the world, and with Allah you will also get a much better and richer reward than what you have actually sent up before.\"",
        "\n"
    ],
    "description": "The surah that opens by addressing the mantled Prophet as the Enwrapped Messenger. It takes its name from the word “wrapped in mantle” (muzzammil) in verse 1. The surah describes how God relaxed the early regime of devotion first imposed on the Prophet (verse 1 .) to prepare him for the weighty message. The Prophet is urged to be patient (verse 10 .), told of the punishment that awaits the disbelievers in Hell (verse 12 .), and reminded of the punishment that befell Pharaoh in this life (verse 15 .).The surah is also known as: Bundled up, Enfolded, Folded in Garments, The Enwrapped Messenger, The Enwrapped One, The Mantled One, Wrapped in Mantle.",
    "name_complex": "Al-Muzzammil",
    "surah_name_ar": "المزمل",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 73:1": "O ti i mbështjellur (Muhammed)!",
                            "verse 73:2": "Zgjoju (lutju) Perëndisë natën, pos të paktën; -",
                            "verse 73:3": "gjysmën e saj ose edhe më pak nga ajo,",
                            "verse 73:4": "ose diçka më shumë se ajo, dhe lexo Kur’anin me kujdes dhe qartë,",
                            "verse 73:5": "Ne, me të vërtetë, do të dërgojmë ty fjalë të rënda –",
                            "verse 73:6": "sepse, zgjuarja natën, me të vërtetë, vepron më fuqishëm dhe shprehjet (mësimet) janë më të kthjellta,",
                            "verse 73:7": "meqë ti, me të vërtetë, ditën je shumë i angazhuar.",
                            "verse 73:8": "Dhe përmende emrin e Zotit tënd dhe përkushtoju krejtësisht Atij.",
                            "verse 73:9": "Ai ësht Zot i lindjes dhe i perëndimit, s’ka zot tjetër përveç Tij, dhe Atë merre për mbrojtës!",
                            "verse 73:10": "Dhe, duroji llomotitjet e atyre dhe largohu nga ata në mënyrë të bukur,",
                            "verse 73:11": "e lermëni Mua (t’i qeroj hesapet) me ata që të konsiderojnë (ty) për gënjeshtar, të cilët jetojnë në luks dhe jepju pak afat atyre:",
                            "verse 73:12": "se, padyshim, Ne kemi pranga dhe zjarr,",
                            "verse 73:13": "dhe gjellëra që ngelin në fyt, dhe dënime të dhembshme",
                            "verse 73:14": "në Ditën kur Toka dhe malet dridhen e bëhen si grumbuj të shkapërderdhur të rërës.",
                            "verse 73:15": "Ne, juve, me të vërtetë, ju kemi dërguar një Profet dëshmitar kundër jush, ashtu siç ia kemi pas dërguar një profet Faraonit,",
                            "verse 73:16": "por Faraoni e ka kundërshtuar Profetin, andaj e kemi dënuar atë me dënim të rëndë.",
                            "verse 73:17": "Qysh do të ruheni ju (nga dënimet) nëse mbeteni jobesimtarë Ditën në të cilën fëmijët bëhen të thinjët (prej tmerrit të madh)?!",
                            "verse 73:18": "Atë ditë, qielli do të çahet (nga tmerri), e premtimi i Zotit do të jetë i plotësuar.",
                            "verse 73:19": "Kjo, me të vërtetë, është këshillë; dhe kush dëshiron – le ta zgjedhin rrugën (që shpie) te Zoti i tij.",
                            "verse 73:20": "Me të vërtetë, Zoti yt e di, se ti (o Muhammed) lutesh më pak se dy të tretat e natës, ndonjëherë gjysmën ose të tretën e saj, si edhe disa prej atyre që janë me ty."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "Ey (libasına) örtünüb bürünən (əbasına bürünüb yatan Peyğəmbər)!",
                            "verse 73:2": "Gecəni - az bir hissəsi istisna olmaqla - qalxıb namaz qıl!",
                            "verse 73:3": "(Gecənin) yarısına qədər, yaxud bir qədər ondan az;",
                            "verse 73:4": "Və ya bir qədər ondan çox! (Sənin gecəni oyaq qalıb namaz qılmağın onun üçdə bir hissəsindən az, üçdə ikisindən çox olmasın!) Həm də (gecə ibadət etdiyin zaman) aramla (ağır-ağır) Qur'an oxu!",
                            "verse 73:5": "Həqiqətən, Biz sənə (məs'uliyyəti) ağır bir kəlam (Qur'an) vəhy edəcəyik.",
                            "verse 73:6": "Şübhəsiz ki, gecə (namaz qılmaq üçün) qalxmaq (çox çətin olsa da) daha əlverişli və (o zaman) söz demək (Qur'an oxumaq, dua etmək) daha münasibdir!",
                            "verse 73:7": "Cünki gündüz (ya Peyğəmbər!) sənin uzun-uzadı davam edən (dünyəvi) işlərin vardır.",
                            "verse 73:8": "Rəbbinin adını zikr et və (hər şeyi buraxıb) Ona tərəf yönəl.",
                            "verse 73:9": "O, məşriqin və məğribin Rəbbidir.",
                            "verse 73:10": "(Ya Peyğəmbər!) Onların (Məkkə müşriklərinin) sənə deyəcəklərinə (batil söz və iftiralarına) səbr et.",
                            "verse 73:11": "(Ayələrimizi) yalan sayan var-dövlət sahiblərini mənə tapşır və onlara bir az möhlət ver! (Tezliklə cəzalarına yetişərlər).",
                            "verse 73:12": "Dərgahımızda (onlardan ötrü ağır) qandallar və (alovlu) Cəhənnəm;",
                            "verse 73:13": "Boğaza tıxanıb qalan yemək (zəqqum) və (yandırıb-yaxan) şiddətli əzab vardır!",
                            "verse 73:14": "O gün (qiyamət qopandan) yer və dağlar lərzəyə gəlib titrəyəcək, dağlar (dağılıb) yumşaq qum təpəsinə dönəcəkdir.",
                            "verse 73:15": "Həqiqətən, Biz - Fir'ona peyğəmbər göndərdiyimiz kimi - sizə də (qiyamət günü Allahın hüzurunda) şahidlik edəcək peyğəmbər göndərdik.",
                            "verse 73:16": "Fir'on o peyğəmbərə (Musaya) asi oldu və Biz də onu şiddətli əzabla yaxaladıq (həm özünün, həm də onunla birlikdə olanları suda boğduq).",
                            "verse 73:17": "Elə isə əgər küfr etmiş olsanız, uşaqları ağ saçlı qocalara döndərəcək gündən (qiyamət gününün əzabından) özünüzü necə qoruyacaqsınız?!",
                            "verse 73:18": "(O gün) göy parçalanaraq, (Allahın) və'di yerinə yetəcəkdir.",
                            "verse 73:19": "Həqiqətən, bu (ayələr insanlara) öyüd-nəsihətdir.",
                            "verse 73:20": "(Ya Peyğəmbər!) Həqiqətən, Rəbbin bilir ki, sən (yatağından) qalxıb bə'zən gecənin təqribən üçdə ikisini, bə'zən yarısını, bə'zən də üçdə birini namaz qılırsan."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "O ti, umotani! -",
                            "verse 73:2": "probdij noć, osim maloga dijela;",
                            "verse 73:3": "polovinu njezinu ili malo manje od nje;",
                            "verse 73:4": "ili malo više od nje, i izgovaraj Kur’an pažljivo",
                            "verse 73:5": "Mi ćemo ti, doista, teške riječi slati -",
                            "verse 73:6": "ta ustajanje noću, zaista, jače djeluje i izgovara se jasnije,",
                            "verse 73:7": "a ti danju, doista, imaš mnogo posla.",
                            "verse 73:8": "I spominji ime Gospodara svoga i Njemu se potpuno posveti -",
                            "verse 73:9": "On je Gospodar istoka i zapada, nema boga osim Njega, i Njega uzmi za zaštitnika!",
                            "verse 73:10": "I otrpi ono što oni govore i izbjegavaj ih na prikladan način,",
                            "verse 73:11": "a Mene ostavi onima koji te u laž ugone, koji raskošno žive i daj im malo vremena;",
                            "verse 73:12": "biće u Nas, doista, okova i ognja,",
                            "verse 73:13": "i jela koje u grlu zastaje, i patnje nesnosne",
                            "verse 73:14": "na Dan kada se Zemlja i planine zatresu, i planine - pješčani humci razbacani postanu.",
                            "verse 73:15": "Mi smo vam, zaista, poslali Poslanika da bi svjedočio protiv vas isto onako kao što smo i faraonu poslanika poslali,",
                            "verse 73:16": "ali faraon nije poslušao poslanika, pa smo ga teškom kaznom kaznili.",
                            "verse 73:17": "Kako ćete se, ako ostanete nevjernici, sačuvati Dana koji će djecu sijedom učiniti?!",
                            "verse 73:18": "Nebo će se toga dana rascijepiti, prijetnja Njegova će se ispuniti.",
                            "verse 73:19": "To je, doista, pouka; i ko hoće, put ka Gospodaru svome će izabrati.",
                            "verse 73:20": "Gospodar tvoj, sigurno, zna da ti u molitvi provodiš manje od dvije trećine noći, polovinu njezinu ili trećinu njezinu, a i neki od onih koji su uz tebe."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "হে বস্ত্রাবৃত!",
                            "verse 73:2": "রাত্রিতে দন্ডায়মান হোন কিছু অংশ বাদ দিয়ে;",
                            "verse 73:3": "অর্ধরাত্রি অথবা তদপেক্ষা কিছু কম",
                            "verse 73:4": "অথবা তদপেক্ষা বেশী এবং কোরআন আবৃত্তি করুন সুবিন্যস্ত ভাবে ও স্পষ্টভাবে।",
                            "verse 73:5": "আমি আপনার প্রতি অবতীর্ণ করেছি গুরুত্বপূর্ণ বাণী।",
                            "verse 73:6": "নিশ্চয় এবাদতের জন্যে রাত্রিতে উঠা প্রবৃত্তি দলনে সহায়ক এবং স্পষ্ট উচ্চারণের অনুকূল।",
                            "verse 73:7": "নিশ্চয় দিবাভাগে রয়েছে আপনার দীর্ঘ কর্মব্যস্ততা।",
                            "verse 73:8": "আপনি আপনার পালনকর্তার নাম স্মরণ করুন এবং একাগ্রচিত্তে তাতে মগ্ন হোন।",
                            "verse 73:9": "তিনি পূর্ব ও পশ্চিমের অধিকর্তা। তিনি ব্যতীত কোন উপাস্য নেই। অতএব, তাঁকেই গ্রহণ করুন কর্মবিধায়করূপে।",
                            "verse 73:10": "কাফেররা যা বলে, তজ্জন্যে আপনি সবর করুন এবং সুন্দরভাবে তাদেরকে পরিহার করে চলুন।",
                            "verse 73:11": "বিত্ত-বৈভবের অধিকারী মিথ্যারোপকারীদেরকে আমার হাতে ছেড়ে দিন এবং তাদেরকে কিছু অবকাশ দিন।",
                            "verse 73:12": "নিশ্চয় আমার কাছে আছে শিকল ও অগ্নিকুন্ড।",
                            "verse 73:13": "গলগ্রহ হয়ে যায় এমন খাদ্য এবং যন্ত্রণাদায়ক শাস্তি।",
                            "verse 73:14": "যেদিন পৃথিবী পর্বতমালা প্রকম্পিত হবে এবং পর্বতসমূহ হয়ে যাবে বহমান বালুকাস্তুপ।",
                            "verse 73:15": "আমি তোমাদের কাছে একজন রসূলকে তোমাদের জন্যে সাক্ষী করে প্রেরণ করেছি, যেমন প্রেরণ করেছিলাম ফেরাউনের কাছে একজন রসূল।",
                            "verse 73:16": "অতঃপর ফেরাউন সেই রসূলকে অমান্য করল, ফলে আমি তাকে কঠিন শাস্তি দিয়েছি।",
                            "verse 73:17": "অতএব, তোমরা কিরূপে আত্নরক্ষা করবে যদি তোমরা সেদিনকে অস্বীকার কর, যেদিন বালককে করে দিব বৃদ্ধ?",
                            "verse 73:18": "সেদিন আকাশ বিদীর্ণ হবে। তার প্রতিশ্রুতি অবশ্যই বাস্তবায়িত হবে।",
                            "verse 73:19": "এটা উপদেশ। অতএব, যার ইচ্ছা, সে তার পালনকর্তার দিকে পথ অবলম্বন করুক।",
                            "verse 73:20": "আপনার পালনকর্তা জানেন, আপনি এবাদতের জন্যে দন্ডায়মান হন রাত্রির প্রায় দু’তৃতীয়াংশ, অর্ধাংশ ও তৃতীয়াংশ এবং আপনার সঙ্গীদের একটি দলও দন্ডায়মান হয়। আল্লাহ দিবা ও রাত্রি পরিমাপ করেন। তিনি জানেন, তোমরা এর পূর্ণ হিসাব রাখতে পার না। অতএব তিনি তোমাদের প্রতি ক্ষমা পরায়ন হয়েছেন। কাজেই কোরআনের যতটুকু তোমাদের জন্যে সহজ, ততটুকু আবৃত্তি কর। তিনি জানেন তোমাদের মধ্যে কেউ কেউ অসুস্থ হবে, কেউ কেউ আল্লাহর অনুগ্রহ সন্ধানে দেশে-বিদেশে যাবে এবং কেউ কেউ আল্লাহর পথে জেহাদে লিপ্ত হবে। কাজেই কোরআনের যতটুকু তোমাদের জন্যে সহজ ততটুকু আবৃত্তি কর। তোমরা নামায কায়েম কর, যাকাত দাও এবং আল্লাহকে উত্তম ঋণ দাও। তোমরা নিজেদের জন্যে যা কিছু অগ্রে পাঠাবে, তা আল্লাহর কাছে উত্তম আকারে এবং পুরস্কার হিসেবে বর্ধিতরূপে পাবে। তোমরা আল্লাহর কাছে ক্ষমাপ্রার্থনা কর। নিশ্চয় আল্লাহ ক্ষমাশীল, দয়ালু। করুক।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 73:1": "О, ти, който се загръщаш,",
                            "verse 73:2": "ставай [за молитва] през нощта, но не цялата,",
                            "verse 73:3": "а наполовина, или по-малко от това,",
                            "verse 73:4": "или повече, и чети Корана отмерено!",
                            "verse 73:5": "Ще ти пратим Ние тежко Слово.",
                            "verse 73:6": "Ставането [за молитва] нощем е най-силно по въздействие и най-подходящо за размисъл.",
                            "verse 73:7": "През деня ти си много зает.",
                            "verse 73:8": "И споменавай името на своя Господ, и с всеотдайност се посвети на Него -",
                            "verse 73:9": "Господа на Изтока и на Запада! Няма друг Бог освен Него.",
                            "verse 73:10": "И бъди търпелив към онова, което говорят! И ги напускай с достойнство!",
                            "verse 73:11": "И остави на Мен отричащите, които живеят в благоденствие, и им дай малка отсрочка!",
                            "verse 73:12": "При Нас има окови и пламъци,",
                            "verse 73:13": "и храна, която присяда, и болезнено мъчение",
                            "verse 73:14": "в Деня, в който ще се разтресат земята и планините, и ще станат планините купища от пясък.",
                            "verse 73:15": "Изпратихме ви Пратеник - свидетел за вас, както изпратихме при Фараона пратеник.",
                            "verse 73:16": "Но възпротиви се Фараонът на пратеника, и затова силно го сграбчихме.",
                            "verse 73:17": "И как ще се предпазите, ако сте неверници, от Деня, който ще направи и децата да посивеят?",
                            "verse 73:18": "Небето тогава ще се разцепи.",
                            "verse 73:19": "Това е напомняне.",
                            "verse 73:20": "Твоят Господ знае, че стоиш по-малко от две трети от нощта,",
                            "verse 73:21": "и половината от нея, а",
                            "verse 73:22": "и една трета, - и група от тези, които са заедно с теб."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "披衣的人啊！",
                            "verse 73:2": "你應當在夜間禮拜，除開不多的時間，",
                            "verse 73:3": "半夜或少一點，",
                            "verse 73:4": "或多一點。你應當諷誦《古蘭經》，",
                            "verse 73:5": "我必定以莊嚴的言辭授予你，",
                            "verse 73:6": "夜間的覺醒確是更適當的；夜間的諷誦確是更正確的。",
                            "verse 73:7": "你在白天忙於事務，",
                            "verse 73:8": "故你應當紀念你的主的尊名，你應當專心致志地敬事他。",
                            "verse 73:9": "他是東方和西方的主，除他之外，絕無應受崇拜的，故你應當以他為監護者。",
                            "verse 73:10": "你應當忍受他們所說的讕言，而溫和地退避他們。",
                            "verse 73:11": "你讓我處治享受安樂而否認真理的人們吧！你稍稍地寬待他們吧！",
                            "verse 73:12": "我那裡確有沉重的鐐和強烈的火，",
                            "verse 73:13": "有噎人的食物，和痛苦的刑罰。",
                            "verse 73:14": "在那日，天地和山巒都要震動，而山巒將要變成一堆散沙。",
                            "verse 73:15": "我確已派遣一個使者來教化你們，而且對你們作証，猶如我曾派遣一個使者去教化法老一樣。",
                            "verse 73:16": "但法老違抗了那個使者，故我嚴厲地懲治了他。",
                            "verse 73:17": "如果你們不信道，那末，你們怎麼防備那將使兒童白髮蒼蒼的日子呢？",
                            "verse 73:18": "天將為那日而破裂，真主的應許要實現的。",
                            "verse 73:19": "這確是一種教訓。誰願意覺悟，誰可以選擇一條通達主的道路。",
                            "verse 73:20": "你的主的確知道你禮拜的時間，不到全夜的三分之二，或二分之一，或三分之一。你的同道中，有一群人也是那樣做的。真主預定黑夜和白晝的長度，他知道你們不能計算它，故赦宥你們。你們應當誦《古蘭經》中簡易的（文辭）。他知道你們中將有一些病人，和別的許多人，或旅行四方，尋求真主的恩惠；或為真主而作戰，故你們應當諷誦其中簡易的（文辭）。你們應當謹守拜功，完納天課，並以善債借給真主。你們為自己做什麼善事，都將在真主那裡得到更好更大的報酬。你們應當向真主求饒，真主是至赦的，是至慈的。 這確是一種教訓。誰願意覺悟，誰可以選擇一條通達主的道路。"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "Ty zahalený!",
                            "verse 73:2": "Modli se v noci, kromě chvíle malé,",
                            "verse 73:3": "polovinu z ní, či uber z toho nemnoho,",
                            "verse 73:4": "či přidej k tomu něco a prozpěvuj Korán slavnostně!",
                            "verse 73:5": "Obtížíme tě záhy slovem nadmíru vážným:",
                            "verse 73:6": "na počátku noci jsou dojmy věru hlubší a přímější výrazem svým,",
                            "verse 73:7": "vždyť během dne starosti máš rozsáhlé.",
                            "verse 73:8": "Vzpomínej tedy jména Pána svého a oddej se Mu oddaně!",
                            "verse 73:9": "On Pánem je východu i západu a není božstva kromě Něho; učiň jej svým ochráncem",
                            "verse 73:10": "a trpělivě snášej to, co oni hovoří, a vzdal se od nich vhodným odchodem.",
                            "verse 73:11": "Ponech Mně na starost ty, kdož za lháře tě mají a ve slastech si žijí, a popřej jim lhůtu krátkou!",
                            "verse 73:12": "My pouta máme pro ně a výheň ohnivou,",
                            "verse 73:13": "pokrm, jenž v hrdle dáví, a trest bolestný",
                            "verse 73:14": "v den, kdy země a hory se budou třást a hory jak přesypy písečné se budou sesouvat.",
                            "verse 73:15": "A věru jsme k vám vyslali posla svědčícího proti vám, podobně jako jsme vyslali posla k Faraónovi předtím,",
                            "verse 73:16": "však Faraón neuposlechl posla tohoto; i uchvátili jsme jej uchvácením prudkým.",
                            "verse 73:17": "Jak chcete se chránit jste-li nevěřící přede dnem, jenž děti šedovlasými učiní,",
                            "verse 73:18": "v němž nebe se rozpoltí a slib o něm daný se vyplní?",
                            "verse 73:19": "Toto je vskutku připomenutí, a kdo chce, ať k Pánu svému cestu nastoupí.",
                            "verse 73:20": "Věru Pán tvůj dobře ví, že ty a skupina těch, kdož s tebou jsou, modlitbu konáte skoro dvě třetiny, polovinu či třetinu noci."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "O, gij die u omwikkelt!",
                            "verse 73:2": "Sta op in de nacht voor korte tijd.",
                            "verse 73:3": "De helft er van of minder dan dat.",
                            "verse 73:4": "Of maak het iets langer - en zeg de Koran duidelijk en aandachtig op.",
                            "verse 73:5": "Waarlijk, Wij dragen u een gewichtig Woord op.",
                            "verse 73:6": "Voorwaar, des nachts opstaan is de zekerste weg en geeft het Woord krachtige uitwerking.",
                            "verse 73:7": "Gij hebt inderdaad gedurende de dag langdurige bezigheden.",
                            "verse 73:8": "Daarom gedenk de naam van uw Heer, en geef u met volle toewijding aan Hem over.",
                            "verse 73:9": "Hij is de Heer van het Oosten en het Westen, er is geen andere God naast Hem; neem Hem daarom tot uw Beschermer.",
                            "verse 73:10": "En verdraag met geduld alles wat zij (de ongelovigen) zeggen; en verlaat hen op gepaste wijze.",
                            "verse 73:11": "En laat Mij alleen met degenen die loochenen, de bezitters van rijkdom en geef hun een wijle uitstel.",
                            "verse 73:12": "Voorzeker, bij Ons zijn zware boeien en een laaiend Vuur,",
                            "verse 73:13": "En voedsel dat verstikt, en pijnlijke straf.",
                            "verse 73:14": "Er zal een Dag komen waarop de aarde en de bergen zullen beven, en de bergen in een hoop mul zand zullen veranderen.",
                            "verse 73:15": "Waarlijk, Wij hebben tot u een boodschapper gezonden, die een getuige tegen u is, geljik Wij een boodschapper tot Pharao zonden.",
                            "verse 73:16": "Maar Pharao gehoorzaamde de boodschapper niet, daarom grepen Wij hem met een verschrikkelijke greep aan.",
                            "verse 73:17": "Hoe zult gij u, indien gij het ware geloof verwerpt, beveiligen voor de Dag, waarop de kinderen grijze haren zullen krijgen (van schrik).",
                            "verse 73:18": "En waarbij de hemel uiteen zal splijten, en Zijn belofte zal worden vervuld.",
                            "verse 73:19": "Dit is zeker een vermaning.",
                            "verse 73:20": "Waarlijk uw Heer weet dat gij bijna twee-derde van de nacht staat (te bidden), somsdehelft of ook wel een derde er van, en eveneens doet dit een deel van degenen die met u zijn."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 73:1": "O thou wrapped up in thy raiment!",
                            "verse 73:2": "Keep vigil the night long, save a little -",
                            "verse 73:3": "A half thereof, or abate a little thereof",
                            "verse 73:4": "Or add (a little) thereto - and chant the Qur’an in measure,",
                            "verse 73:5": "For we shall charge thee with a word of weight.",
                            "verse 73:6": "Lo! the vigil of the night is (a time) when impression is more keen and speech more certain.",
                            "verse 73:7": "Lo! thou hast by day a chain of business.",
                            "verse 73:8": "So remember the name of thy Lord and devote thyself with a complete devotion -",
                            "verse 73:9": "Lord of the East and the West; there is no God save Him; so choose thou Him alone for thy defender -",
                            "verse 73:10": "And bear with patience what they utter, and part from them with a fair leave-taking.",
                            "verse 73:11": "Leave Me to deal with the deniers, lords of ease and comfort (in this life); and do thou respite them awhile.",
                            "verse 73:12": "Lo! with Us are heavy fetters and a raging fire,",
                            "verse 73:13": "And food which choketh (the partaker), and a painful doom",
                            "verse 73:14": "On the day when the earth and the hills rock, and the hills become a heap of running sand.",
                            "verse 73:15": "Lo! We have sent unto you a messenger as witness against you, even as We sent unto Pharaoh a messenger.",
                            "verse 73:16": "But Pharaoh rebelled against the messenger, whereupon We seized him with no gentle grip.",
                            "verse 73:17": "Then how, if ye disbelieve, will ye protect yourselves upon the day which will turn children grey,",
                            "verse 73:18": "The very heaven being then rent asunder.",
                            "verse 73:19": "Lo! This is a Reminder.",
                            "verse 73:20": "Lo! thy Lord knoweth how thou keepest vigil sometimes nearly two-thirds of the night, or (sometimes) half or a third thereof, as do a party of those with thee."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 73:1": "O thou folded in garments!",
                            "verse 73:2": "Stand (to prayer) by night, but not all night,-",
                            "verse 73:3": "Half of it,- or a little less,",
                            "verse 73:4": "Or a little more; and recite the Qur’an in slow, measured rhythmic tones.",
                            "verse 73:5": "Soon shall We send down to thee a weighty Message.",
                            "verse 73:6": "Truly the rising by night is most potent for governing (the soul), and most suitable for (framing) the Word (of Prayer and Praise).",
                            "verse 73:7": "True, there is for thee by day prolonged occupation with ordinary duties:",
                            "verse 73:8": "But keep in remembrance the name of thy Lord and devote thyself to Him whole-heartedly.",
                            "verse 73:9": "(He is) Lord of the East and the West: there is no god but He: take Him therefore for (thy) Disposer of Affairs.",
                            "verse 73:10": "And have patience with what they say, and leave them with noble (dignity).",
                            "verse 73:11": "And leave Me (alone to deal with) those in possession of the good things of life, who (yet) deny the Truth; and bear with them for a little while.",
                            "verse 73:12": "With Us are Fetters (to bind them), and a Fire (to burn them),",
                            "verse 73:13": "And a Food that chokes, and a Penalty Grievous.",
                            "verse 73:14": "One Day the earth and the mountains will be in violent commotion.",
                            "verse 73:15": "We have sent to you, (O men!) an apostle, to be a witness concerning you, even as We sent an apostle to Pharaoh.",
                            "verse 73:16": "But Pharaoh disobeyed the apostle; so We seized him with a heavy Punishment.",
                            "verse 73:17": "Then how shall ye, if ye deny (God), guard yourselves against a Day that will make children hoary-headed?-",
                            "verse 73:18": "Whereon the sky will be cleft asunder? His Promise needs must be accomplished.",
                            "verse 73:19": "Verily this is an Admonition: therefore, whoso will, let him take a (straight) path to his Lord!",
                            "verse 73:20": "Thy Lord doth know that thou standest forth (to prayer) nigh two-thirds of the night, or half the night, or a third of the night, and so doth a party of those with thee."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 73:1": "O thou enwrapped in thy robes,",
                            "verse 73:2": "keep vigil the night, except a little",
                            "verse 73:3": "(a half of it, or diminish a little,",
                            "verse 73:4": "or add a little), and chant the Koran very distinctly;",
                            "verse 73:5": "Behold, We shall cast upon thee a weighty word;",
                            "verse 73:6": "surely the first part of the night is heavier in tread, more upright in speech,",
                            "verse 73:7": "surely in the day thou hast long business.",
                            "verse 73:8": "And remember the Name of thy Lord, and devote thyself unto Him very devoutly.",
                            "verse 73:9": "Lord of the East and the West; there is no god but He; so take Him for a Guardian.",
                            "verse 73:10": "And bear thou patiently what they say, and forsake them graciously.",
                            "verse 73:11": "Leave Me to those who cry lies, those prosperous ones, and respite them a little,",
                            "verse 73:12": "for with Us there are fetters, and a furnace,",
                            "verse 73:13": "and food that chokes, and a painful chastisement,",
                            "verse 73:14": "upon the day when the earth and the mountains shall quake and the mountains become a slipping heap of sand.",
                            "verse 73:15": "Surely We have sent unto you a Messenger as a witness over you, even as We sent to Pharaoh a Messenger,",
                            "verse 73:16": "but Pharaoh rebelled against the Messenger, so We seized him remorselessly.",
                            "verse 73:17": "If therefore you disbelieve, how will you guard yourselves against a day that shall make the children grey-headed?",
                            "verse 73:18": "Whereby heaven shall be split, and its promise shall be performed.",
                            "verse 73:19": "Surely this is a Reminder; so let him who will take unto his Lord a way.",
                            "verse 73:20": "Thy Lord knows that thou keepest vigil nearly two-thirds of the night, or a half of it, or a third of it, and a party of those with thee; and God determines the night and the day."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 73:1": "O THOU enwrapped one!",
                            "verse 73:2": "Keep awake [in prayer] at night, all but a small part",
                            "verse 73:3": "of one-half thereof – or make it a little less than that,",
                            "verse 73:4": "or add to it [at will]; and [during that time] recite the Qur’ān calmly and distinctly, with thy mind attuned to its meaning.",
                            "verse 73:5": "Behold, We shall bestow upon thee a weighty message",
                            "verse 73:6": "",
                            "verse 73:7": "verily, the hours of night impress the mind most strongly and speak with the clearest voice,",
                            "verse 73:8": "whereas by day a long chain of doings is thy portion.",
                            "verse 73:9": "But [whether by night or by day,] remember thy Sustainer’s name, and devote thyself unto Him with utter devotion.",
                            "verse 73:10": "The Sustainer of the east and the west [is He]: there is no deity save Him: hence, ascribe to Him alone the power to determine thy fate,",
                            "verse 73:11": "and endure with patience whatever people may say [against thee], and avoid them with a comely avoidance.",
                            "verse 73:12": "And leave Me alone [to deal] with those who give the lie to the truth – those who enjoy the blessings of life [without any thought of God] – and bear thou with them for a little while:",
                            "verse 73:13": "for, behold, heavy fetters [await them] with Us, and a blazing fire,",
                            "verse 73:14": "and food that chokes, and grievous suffering",
                            "verse 73:15": "on the Day when the earth and the mountains will be convulsed, and the mountains will [crumble and] become like a sand-dune on the move!",
                            "verse 73:16": "BEHOLD, [O men,] We have sent unto you an apostle who shall bear witness to the truth before you, even as We sent an apostle unto Pharaoh:",
                            "verse 73:17": "and Pharaoh rebelled against the apostle, whereupon We took him to task with a crushing grip.",
                            "verse 73:18": "How, then, if you refuse to acknowledge the truth, will you protect yourselves on that Day which shall turn the hair of children grey,",
                            "verse 73:19": "[the Day] on which the skies shall be rent asunder,",
                            "verse 73:20": "His promise [of resurrection] fulfilled?",
                            "verse 73:21": "This, verily, is a reminder: let him who wills, then set out on a way to his Sustainer!",
                            "verse 73:22": "BEHOLD, [O Prophet,] thy Sustainer knows that thou keepest awake [in prayer] nearly two-thirds of the night, or one-half of it, or a third of it, together with some of those who follow thee.",
                            "verse 73:23": "as much of it as you may do with ease, and be constant in prayer, and spend in charity, and",
                            "verse 73:24": "lend unto God a goodly loan: for whatever good deed you may offer up in your own behalf, you shall truly find it with God – yea, better, and richer in reward.",
                            "verse 73:25": "seek God’s forgiveness: behold, God is much-forgiving, a dispenser of grace!",
                            "verse 73:26": "physical attachments and bodily pleasures.",
                            "verse 73:27": "human personality (an-nafs) from attaining to the realm of the spirit and of purity.",
                            "verse 73:28": "know that I do not claim to have exhausted the meaning of these",
                            "verse 73:29": "verses by what I have stated .",
                            "verse 73:30": "v.",
                            "verse 73:31": "religion is",
                            "verse 73:32": "self-surrender unto Him” (3:19), and that “if one goes in search of a religion other than self-surrender unto God, it will never be accepted from him” (3:85)."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 73:1": "O thou who art wrapped in thy raiment.",
                            "verse 73:2": "thou who art enshrouded in thy raiment.",
                            "verse 73:3": "Keep vigil all the night save a little.",
                            "verse 73:4": "",
                            "verse 73:5": "",
                            "verse 73:6": "Keep",
                            "verse 73:7": "vigil the night long save a little.",
                            "verse 73:8": "Half the night or lessen than half a little.",
                            "verse 73:9": "half thereof, or abate a little thereof.",
                            "verse 73:10": "half of it, or take from that a little.",
                            "verse 73:11": "Or add to it, and with care and clarity chant the Koran.",
                            "verse 73:12": "add (a little) thereto and chant the Quran in measure.",
                            "verse 73:13": "add to it, and recite the Qur’an with exact recital.",
                            "verse 73:14": "Verily We shall load thee with a word of heavy weight.",
                            "verse 73:15": "Invoke the Name of thy Lord and consecrate thyself unto Him with a total consecration.",
                            "verse 73:16": "in remembrance the Name of thy Lord, and devote thyself to Him with an utter devotion.",
                            "verse 73:17": "",
                            "verse 73:18": "",
                            "verse 73:19": "",
                            "verse 73:20": "",
                            "verse 73:21": "",
                            "verse 73:22": "Lord of the east and of the west- no god but He.",
                            "verse 73:23": "Bear with patience what they say, and part from them with a courteous farewell.",
                            "verse 73:24": "…a day that shall turn the hair of children grey.",
                            "verse 73:25": "Surely this [the Revelation] is a Reminder; so let him who will, take unto his Lord a way.",
                            "verse 73:26": "this is a reminder, so let him who will take unto his Lord a way.",
                            "verse 73:27": "…whatever good ye have accomplished for yourselves in advance, ye will find it with Allah; but it will be better (than your action) and a greater recompense (than that which your action merits).",
                            "verse 73:28": "Lord knoweth that thou keepest vigil nearly two thirds of the night, or half the night or a third thereof, thou and a group of those that are with thee.",
                            "verse 73:29": "thy Lord knoweth that thou keepest vigil wellnigh two thirds of the night, and sometimes half of it or a third of it, thou and a group of those that are with thee.",
                            "verse 73:30": "group of those that are with thee.",
                            "verse 73:31": "thy Lord knoweth that thou keepest vigil nearly two thirds of the night, or its half, or a third, thou and a group of those who are with thee.",
                            "verse 73:32": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 73:33": "The Book of Certainty (1952) •",
                            "verse 73:34": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 73:35": "What is Sufism (1975) •",
                            "verse 73:36": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 73:37": "Muhammad (1983) •",
                            "verse 73:38": "Symbol and Archetype (1991) •",
                            "verse 73:39": "Sufi Poems (2004) •",
                            "verse 73:40": "Mecca (2004) •",
                            "verse 73:41": "Return to the Spirit (2005) •",
                            "verse 73:42": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 73:43": "“Proofs of Islam”(1954).",
                            "verse 73:44": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 73:45": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 73:46": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 73:47": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 73:48": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 73:49": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 73:50": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 73:51": "“The Quranic Origins of Sufism” •",
                            "verse 73:52": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 73:53": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 73:54": "“An Introduction to Islam” •",
                            "verse 73:55": "“The Universality of the Quran” •",
                            "verse 73:56": "Private Talks Books",
                            "verse 73:57": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 73:1": "O you, wrapped up in clothes,",
                            "verse 73:2": "stand at night (for prayer) except a little-",
                            "verse 73:3": "-half of it, or make it a little less,",
                            "verse 73:4": "or make it a little more; and recite the Qur’ān clearly with tartīl (in a distinct and measured tone).",
                            "verse 73:5": "We are going to send down to you a weighty discourse.",
                            "verse 73:6": "Truly, rising by night (for prayer of tahajjud) is the most effective way to subdue (one’s base self) and to make speech more upright.",
                            "verse 73:7": "Surely, in daytime, you have a lengthy work to do.",
                            "verse 73:8": "And remember the name of your Lord, and devote yourself to Him with exclusive devotion.",
                            "verse 73:9": "He is the Lord of the East and the West; there is no god but He; so take Him for (your) Guardian.",
                            "verse 73:10": "And bear patiently what they (the opponents) say, and part with them in a beautiful manner.",
                            "verse 73:11": "And leave Me alone (to deal) with the deniers, the people of luxury, and give them respite for a while.",
                            "verse 73:12": "Surely with Us are fetters and flaming fire,",
                            "verse 73:13": "and food that chokes, and a painful punishment",
                            "verse 73:14": "on the Day when the earth and the mountains will quake, and the mountains will turn into a slipping heap of sand.",
                            "verse 73:15": "(O people,) We have sent to you a messenger, as a witness over you, just as We sent a messenger to Fir‘aun (Pharaoh).",
                            "verse 73:16": "Then, Fir‘aun disobeyed the messenger; so We seized him with a severe seizure.",
                            "verse 73:17": "So, if you disbelieve, how will you save yourself from a day that will turn the small boys into grey-headed old men,",
                            "verse 73:18": "whereby the sky will burst apart.",
                            "verse 73:19": "Indeed, this is a reminder; so let anyone who so wishes, adopt a way to his Lord.",
                            "verse 73:20": "Your Lord knows that you stand (in prayer) for nearly two thirds of the night, and (at times) for half of it, and (at times) for one third of it, and (so do) a group of those who are with you."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 73:1": "O you enwrapped in your garment!",
                            "verse 73:2": "Stand vigil through the night, except a little,",
                            "verse 73:3": "a half of it, or reduce of it a little,",
                            "verse 73:4": "or add to it, and recite the Qur’ān in a measured tone.",
                            "verse 73:5": "Verily",
                            "verse 73:6": "We shall cast on you a weighty word.",
                            "verse 73:7": "Assuredly rising in the night is firmer in tread and more upright in respect to speech.",
                            "verse 73:8": "",
                            "verse 73:9": "assuredly during the day you have extended engagements.",
                            "verse 73:10": "And mention the Name of your Lord, and devote yourself",
                            "verse 73:11": "to Him with complete devotion.",
                            "verse 73:12": "Lord of the east and the west; there is no god except Him, so take Him for a Guardian,",
                            "verse 73:13": "and bear patiently what they say, and part with them in a gracious manner.",
                            "verse 73:14": "And leave Me [to deal] with the deniers, those enjoying affluence, and respite them a little.",
                            "verse 73:15": "",
                            "verse 73:16": "indeed with Us are heavy fetters, and a hell-fire,",
                            "verse 73:17": "and a food that chokes, and a painful chastisement,",
                            "verse 73:18": "on the day when the earth and the mountains will quake and the mountains will be like heaps of shifting sand.",
                            "verse 73:19": "We have indeed sent to you a Messenger to be a witness against you, just as We sent to Pharaoh a messenger.",
                            "verse 73:20": "But Pharaoh disobeyed the messenger, so We seized him with a severe seizing.",
                            "verse 73:21": "So, if you disbelieve, how will you guard against a day that will make the children grey-haired,",
                            "verse 73:22": "with the heaven being rent asunder thereon.",
                            "verse 73:23": "Indeed these are a reminder.",
                            "verse 73:24": "Assuredly your Lord knows that you stand vigil less than two thirds of the night, or [at times] a half of it or a third of it along with a group of those with you; and God measures the night and the day."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 73:1": "O mantled (Beloved!)",
                            "verse 73:2": "Rise and stand (in Prayer) at night but (for) a short while,",
                            "verse 73:3": "Half the night or decrease it a little,",
                            "verse 73:4": "Or increase a little more to it.",
                            "verse 73:5": "Soon We shall send down to you a burdensome command.",
                            "verse 73:6": "No doubt rising at night strictly subdues (the ill-commanding self), and makes the tongue deliver straight and clear speech (with the concentration of head and heart).",
                            "verse 73:7": "Of course, there are many commitments for you during the day.",
                            "verse 73:8": "And continue remembering the Name of your Lord, devoted completely to Him alone (in your heart and soul), broken away from everyone else.",
                            "verse 73:9": "He is the Lord of the east and the west.",
                            "verse 73:10": "And observe patience with what they (disbelievers) utter and turn aside from them in a fine manner.",
                            "verse 73:11": "And leave Me (to deal) with the denying rich money-mongers (to take revenge).",
                            "verse 73:12": "Surely, We have heavy shackles and the Blazing Fire (of Hell),",
                            "verse 73:13": "And food that chokes the throat and most painful torment.",
                            "verse 73:14": "The Day when the earth and the mountains shall shake violently and mountains will turn into heaps of flying away sand.",
                            "verse 73:15": "Surely, We have sent towards you a Messenger (blessings and peace be upon him) who bears witness to you (seeing thoroughly your states of being) as We sent a Messenger towards Pharaoh.",
                            "verse 73:16": "So Pharaoh disobeyed that Messenger, and We seized him with a devastating seizure.",
                            "verse 73:17": "If you continue disbelieving, then how will you save yourselves from (the torment of) that Day which will turn the children old,",
                            "verse 73:18": "(The Day) by whose severity the heaven will be split apart? His promise is bound to be fulfilled.",
                            "verse 73:19": "Verily, this (Qur’an) is an admonition.",
                            "verse 73:20": "Surely, your Lord knows that you stand (for prayer sometimes) about two-thirds of the night and (sometimes) half the night and (sometimes) a third of the night, and (also) a party of those who are with you (join in standing up for Prayer)."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "Sinä, joka olet vaippaan kääriytynyt,",
                            "verse 73:2": "nouse yöllä rukoilemaan leväten vain vähän;",
                            "verse 73:3": "valvo puolet yöstä, tai vähennä siitä hetkinen,",
                            "verse 73:4": "tai lisää siihen vähän ja lue selvästi ja tasaisesti Koraania.",
                            "verse 73:5": "Totisesti ilmoitamme sinulle tärkeän sanan.",
                            "verse 73:6": "Yöhartaudet ovat totisesti parhain keino itsensä voittamiseen ja paras tapa hallita puhettaan.",
                            "verse 73:7": "Sillä sinulla on työtä päivät pitkät.",
                            "verse 73:8": "Muista siis Herrasi nimeä öisin ja antaudu kaikella hartaudella palvomaan Häntä",
                            "verse 73:9": "idän ja lännen Herraa, jota paitsi ei ole muuta jumalaa; omaksu siis Hänet suojelijaksesi!",
                            "verse 73:10": "Ole myös järkkymätön huolimatta siitä, mitä he sanovat, ja karta heitä sopivalla tavalla!",
                            "verse 73:11": "Jätä Minun huostaani ne, jotka väittävät totuutta valheeksi ja elävät yltäkylläisyydessä, ja myönnä heille vähän armonaikaa!",
                            "verse 73:12": "Totisesti, Meillä on heidän varalleen kahleet ja helvetin tuli,",
                            "verse 73:13": "ruoka, joka tukkii kurkun, sekä tuskallinen kuritus",
                            "verse 73:14": "sinä päivänä, jolloin maa ja vuoret vapisevat, jolloin vuoret muuttuvat lentäväksi hiekaksi.",
                            "verse 73:15": "Totisesti olemme lähettänyt luoksenne julistajan, joka todistaa teitä vastaan, niinkuin lähetimme sananjulistajan faraon tykö.",
                            "verse 73:16": "Mutta farao ei totellut sanansaattajaa, ja sentähden tartuimme häneen kovalla kädellä.",
                            "verse 73:17": "Kuinka te uskottomat aiotte pelastaa itsenne, kun ette usko päivään, joka saa lastenkin hiukset harmaaksi?",
                            "verse 73:18": "Sinä päivänä taivas repeytyy kappaleiksi, mutta Hänen lupauksensa täyttyy.",
                            "verse 73:19": "Totisesti tämä on kehoitus, salli siis sen, joka haluaa, löytää tie Herransa tykö.",
                            "verse 73:20": "Totisesti Herrasi tietää, että sinä valvot miltei kaksi kolmannesta yöstä, joskus puolet siitä tai joskus kolmanneksen, ja että samoin tekee osa seuraajistasi."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 73:1": "O toi qui es enveloppé dans une étoffe !",
                            "verse 73:2": "Lève-toi pour prier durant une bonne partie de la nuit :",
                            "verse 73:3": "la moitié, ou un peu moins,",
                            "verse 73:4": "ou davantage si tu le veux, et psalmodie le Coran avec soin.",
                            "verse 73:5": "Nous allons te transmettre des paroles d'un grand poids.",
                            "verse 73:6": "Certes, la prière nocturne laisse une empreinte plus forte et les paroles y ont plus de rectitude.",
                            "verse 73:7": "Tu as, dans la journée, une longue besogne.",
                            "verse 73:8": "Invoque le Nom de ton Seigneur et dévoue-toi entièrement à Lui.",
                            "verse 73:9": "Seigneur de l'Orient et de l'Occident, il n'y a de Dieu que Lui.",
                            "verse 73:10": "Supporte patiemment leurs discours et éloigne-toi d'eux discrètement.",
                            "verse 73:11": "Laisse-Moi avec les détracteurs qui vivent dans l'aisance, et accorde-leur quelque répit.",
                            "verse 73:12": "Il y a par devers Nous des chaînes, une fournaise,",
                            "verse 73:13": "une nourriture qui suffoque et un châtiment douloureux",
                            "verse 73:14": "pour le jour où la terre et les montagnes seront ébranlées et où les montagnes deviendront des tas de sable écroulés.",
                            "verse 73:15": "Certes, Nous vous avons dépêché un envoyé qui porte témoignage contre vous, comme Nous avions dépêché un envoyé à Pharaon.",
                            "verse 73:16": "Pharaon a désobéi à l'envoyé et Nous l'avons durement saisi.",
                            "verse 73:17": "Si vous avez mécru, comment vous prémunir du jour où les cheveux des enfants blanchiront comme ceux des vieillards ?",
                            "verse 73:18": "Devant un tel prodige, le ciel se fendra de frayeur et la promesse de Dieu s'accomplira.",
                            "verse 73:19": "C'est là vraiment un rappel ! Que celui qui le veut, prenne donc un chemin vers son Seigneur !",
                            "verse 73:20": "Oui, ton Seigneur sait que toi, et un groupe de ceux qui sont avec toi, vous restez en prière près des deux tiers, ou de la moitié, ou du tiers de la nuit."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 73:1": "ô ! , toi , l’enveloppé [dans tes vêtements] !",
                            "verse 73:2": "Lève-toi [pour prier], toute la nuit, excepté une petite partie;",
                            "verse 73:3": "Sa moitié, ou un peu moins;",
                            "verse 73:4": "ou un peu plus.",
                            "verse 73:5": "Nous allons te révéler des paroles lourdes (très importantes).",
                            "verse 73:6": "La prière pendant la nuit est plus efficace et plus propice pour la récitation.",
                            "verse 73:7": "Tu as, dans la journée, à vaquer à de longues occupations.",
                            "verse 73:8": "Et rappelle-toi le nom de ton Seigneur et consacre-toi totalement à Lui,",
                            "verse 73:9": "le Seigneur du Levant et du Couchant.",
                            "verse 73:10": "Et endure ce qu’ils disent; et écarte-toi d’eux d’une façon convenable.",
                            "verse 73:11": "Et laisse-moi avec ceux qui crient au mensonge et qui vivent dans l’aisance; et accorde-leur un court répit :",
                            "verse 73:12": "Nous avons [pour eux] lourdes chaînes et Enfer,",
                            "verse 73:13": "et nourriture à faire suffoquer, et châtiment douloureux.",
                            "verse 73:14": "Le jour où la terre et les montagnes trembleront, tandis que les montagnes deviendront comme une dune de sable dispersée.",
                            "verse 73:15": "Nous vous avons envoyé un Messager pour être témoin contre vous, de même que Nous avions envoyé un Messager à Pharaon.",
                            "verse 73:16": "Pharaon désobéit alors au Messager.",
                            "verse 73:17": "Comment vous préserverez-vous, si vous mécroyez, d’un jour qui rendra les enfants comme des vieillards aux cheveux blancs ?",
                            "verse 73:18": "",
                            "verse 73:19": "durant lequel le ciel se fendra.",
                            "verse 73:20": "Ceci est un rappel .",
                            "verse 73:21": "à son Seigneur.",
                            "verse 73:22": "Ton Seigneur sait, certes, que tu (Muhammad) te tiens debout moins de deux tiers de la nuit, ou sa moitié, ou son tiers.",
                            "verse 73:23": "est possible du Coran.",
                            "verse 73:24": "sera possible."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "O du Verhüllter!",
                            "verse 73:2": "Erhebe dich und verbringe die Nacht im Gebet, stehend, bis auf ein kleines -",
                            "verse 73:3": "Die Hälfte davon, oder verringere es ein wenig,",
                            "verse 73:4": "Oder füge ein wenig hinzu - und sprich den Koran langsam und besinnlich.",
                            "verse 73:5": "Fürwahr, Wir legen dir da ein Wort auf, das gewichtig ist.",
                            "verse 73:6": "Wahrlich, die Nachtwache ist die beste Zeit zur Selbstzucht und zur Erreichung von Aufrichtigkeit in Wort.",
                            "verse 73:7": "Du hast ja gewiß während des Tages eine lange Beschäftigung.",
                            "verse 73:8": "So gedenke des Namens deines Herrn und weihe dich Ihm ausschließlich.",
                            "verse 73:9": "Herr des Ostens und des Westens - es gibt keinen Gott außer Ihm; drum nimm Ihn zum Beschützer.",
                            "verse 73:10": "Und ertrage in Geduld alles, was sie reden; und scheide dich von ihnen in geziemender Art.",
                            "verse 73:11": "Und laß Mich allein mit denen, die die Wahrheit verwerfen und in Üppigkeit und Behagen leben; und gewähre ihnen eine kleine Frist.",
                            "verse 73:12": "Bei Uns sind schwere Fesseln und ein rasendes Feuer",
                            "verse 73:13": "Und erstickende Speise und schmerzliche Strafe,",
                            "verse 73:14": "Am Tage, da die Erde und die Berge erbeben und die Berge Haufen von rinnendem Sand werden sollen.",
                            "verse 73:15": "Wahrlich, Wir haben euch einen Gesandten geschickt, der ein Zeuge ist über euch, wie Wir zu Pharao einen Gesandten schickten.",
                            "verse 73:16": "Doch Pharao widersetzte sich dem Gesandten, drum erfaßten Wir ihn mit schrecklichem Griff.",
                            "verse 73:17": "Wie wollt ihr euch, wenn ihr ungläubig seid, wohl schützen vor einem Tag, der Kinder greis macht?",
                            "verse 73:18": "(Dem Tage) da der Himmel sich spalten wird! Seine Verheißung muß in Erfüllung gehn.",
                            "verse 73:19": "Dies ist fürwahr eine Ermahnung.",
                            "verse 73:20": "Dein Herr weiß fürwahr, daß du im Gebete stehest fast zwei Drittel der Nacht, und (manchmal) eine Hälfte oder ein Drittel davon, und ein Teil derer, die mit dir sind (tun auch so)."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": ",s ¼esjs½ pknj yisVs jlwy",
                            "verse 73:2": "jkr dks ¼uekt+ ds okLrs½ [kM+s jgks exj ¼iwjh jkr ugha½",
                            "verse 73:3": "FkksM+h jkr ;k vk/kh jkr ;k blls Hkh dqN de dj nks ;k mlls dqN c<+k nks",
                            "verse 73:4": "vkSj d+qjku dks ckd+k;nk Bgj Bgj dj i<+k djks",
                            "verse 73:5": "ge vud+jhc rqe ij ,d Hkkjh gqD+e ukft+y djsaxs blesa Ód ugha fd jkr dks mBuk",
                            "verse 73:6": "[+kwc ¼u¶+l dk½ ikeky djuk vkSj cgqr fBdkus ls ft+Ø dk oD+r gS",
                            "verse 73:7": "fnu dks rks rqEgkjs cgqr cM+s cM+s v’kx+ky gSa",
                            "verse 73:8": "rks rqe vius ijojfnxkj ds uke dk ft+dz djks vkSj lcls VwV dj mlh ds gks jgks",
                            "verse 73:9": "¼ogh½ e’kfjd vkSj ex+fjc dk ekfyd gS mlds flok dksbZ ekcwn ugha rks rqe mlh dks dkjlkt+ cukvks",
                            "verse 73:10": "vkSj tks dqN yksx cdk djrs gSa ml ij lcz djks vkSj muls ck muokus Ók,Lrk vyx Fkyx jgks",
                            "verse 73:11": "vkSj eq>s mu >qBykus okyksa ls tks nkSyreUn gSa le> ysus nks vkSj mudks FkksM+h lh eksgyr ns nks",
                            "verse 73:12": "cs’kd gekjs ikl csfM+;k¡ ¼Hkh½ gSa vkSj tykus okyh vkx ¼Hkh½",
                            "verse 73:13": "vkSj xys esa Q¡lus okyk [kkuk ¼Hkh½ vkSj nq[k nsus okyk vt+kc ¼Hkh½",
                            "verse 73:14": "ftl fnu t+ehu vkSj igkM+ yjt+us yxsaxs vkSj igkM+ jsr ds Vhys ls Hkqj Hkqjs gks tk,¡xs",
                            "verse 73:15": "¼,s eDdk okyksa½ geus rqEgkjs ikl ¼mlh rjg½ ,d jlwy ¼eksgEen½ dks Hkstk tks rqEgkjs ekeys esa xokgh ns ftl rjg fQjvkÅu ds ikl ,d jlwy ¼ewlk½ dks Hkstk Fkk",
                            "verse 73:16": "rks fQjvkÅu us ml jlwy dh ukQ+jekuh dh rks geus Hkh ¼mldh lt+k esa½ mldks cgqr l[+r idM+k",
                            "verse 73:17": "rks vxj rqe Hkh u ekuksxs rks ml fnu ¼ds vt+kc½ ls D;ksa dj cpksxs tks cPpksa dks cw<+k cuk nsxk",
                            "verse 73:18": "ftl fnu vkleku QV iM+sxk ¼;s½ mldk ok;nk iwjk gksdj jgsxk",
                            "verse 73:19": "cs’kd ;s ulhgr gS rks tks Ó[+l pkgs vius ijojfnxkj dh jkg ,[+rs;kj djs",
                            "verse 73:20": "¼,s jlwy½ rqEgkjk ijojfnxkj pkgrk gS fd rqe vkSj rqEgkjs pUn lkFk ds yksx ¼dHkh½ nks frgkbZ jkr ds djhc vkSj ¼dHkh½ vk/kh jkr vkSj ¼dHkh½ frgkbZ jkr ¼uekt+ esa½ [kM+s jgrs gks vkSj [+kqnk gh jkr vkSj fnu dk vPNh rjg vUnkt+k dj ldrk gS mls ekywe gS fd rqe yksx ml ij iwjh rjg ls gkoh ugha gks ldrs rks mlus rqe ij esgjckuh dh rks ftruk vklkuh ls gks lds mruk ¼uekt+ esa½ d+qjku i<+ fy;k djks vkSj og tkurk gS fd vud+jhc rqeesa ls ckt+ chekj gks tk,¡xs vkSj ckt+ [+kqnk ds Q+t+y dh ryk’k esa :, t+ehu ij lQj ,[+rs;kj djsaxs vkSj dqN yksx [+kqnk dh jkg esa tsgkn djsaxs rks ftruk rqe vklkuh ls gks lds i<+ fy;k djks vkSj uekt+ ikcUnh ls i<+ks vkSj t+dkr nsrs jgks vkSj [+kqnk dks dt+sZ gluk nks vkSj tks usd vey vius okLrs ¼[+kqnk ds lkeus½ is’k djksxs mldks [+kqnk ds gk¡ csgrj vkSj flys esa cqt+qZx rj ikvksxs vkSj [+kqnk ls ex+Qs+jr dh nqvk ek¡xks cs’kd [+kqnk cM+k c[+’kus okyk esgjcku gS lwj, eqt+fEey [+kRe"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "Hai orang yang berselimut (Muhammad),",
                            "verse 73:2": "bangunlah (untuk sembahyang) di malam hari kecuali sedikit (daripadanya),",
                            "verse 73:3": "(yaitu) seperduanya atau kurangilah dari seperdua itu sedikit,",
                            "verse 73:4": "atau lebih dari seperdua itu.",
                            "verse 73:5": "Sesungguhnya Kami akan menurunkan kepadamu perkataan yang berat.",
                            "verse 73:6": "Sesungguhnya bangun di waktu malam adalah lebih tepat (untuk khusyuk) dan bacaan di waktu itu lebih berkesan.",
                            "verse 73:7": "Sesungguhnya kamu pada siang hari mempunyai urusan yang panjang (banyak).",
                            "verse 73:8": "Sebutlah nama Tuhanmu, dan beribadahlah kepada-Nya dengan penuh ketekunan.",
                            "verse 73:9": "(Dia-lah) Tuhan masyrik dan magrib, tiada Tuhan (yang berhak disembah) melainkan Dia, maka ambillah Dia sebagai pelindung.",
                            "verse 73:10": "Dan bersabarlah terhadap apa yang mereka ucapkan dan jauhilah mereka dengan cara yang baik.",
                            "verse 73:11": "Dan biarkanlah Aku (saja) bertindak terhadap orang-orang yang mendustakan itu, orang-orang yang mempunyai kemewahan dan beri tangguhlah mereka barang sebentar.",
                            "verse 73:12": "Karena sesungguhnya pada sisi Kami ada belenggu-belenggu yang berat dan neraka yang bernyala-nyala,",
                            "verse 73:13": "dan makanan yang menyumbat di kerongkongan dan azab yang pedih.",
                            "verse 73:14": "Pada hari bumi dan gunung-gunung bergoncangan, dan menjadilah gunung-gunung itu tumpukan-tumpukan pasir yang beterbangan.",
                            "verse 73:15": "Sesungguhnya Kami telah mengutus kepada kamu (hai orang kafir Mekah) seorang Rasul, yang menjadi saksi terhadapmu, sebagaimana Kami telah mengutus (dahulu) seorang Rasul kepada Fir’aun.",
                            "verse 73:16": "Maka Fir’aun mendurhakai Rasul itu, lalu Kami siksa dia dengan siksaan yang berat.",
                            "verse 73:17": "Maka bagaimanakah kamu akan dapat memelihara dirimu jika kamu tetap kafir kepada hari yang menjadikan anak-anak beruban.",
                            "verse 73:18": "Langit (pun) menjadi pecah belah pada hari itu karena Allah.",
                            "verse 73:19": "Sesungguhnya ini adalah suatu peringatan.",
                            "verse 73:20": "Sesungguhnya Tuhanmu mengetahui bahwasanya kamu berdiri (sembahyang) kurang dari dua pertiga malam, atau seperdua malam atau sepertiganya dan (demikian pula) segolongan dari orang-orang yang bersama kamu."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "O tu l'avvolto [nelle tue vesti] ,",
                            "verse 73:2": "veglia una parte della notte,",
                            "verse 73:3": "la metà, oppure meno,",
                            "verse 73:4": "oppure poco più.",
                            "verse 73:5": "Faremo scendere su di te parole gravi.",
                            "verse 73:6": "In verità la preghiera della notte è la più efficace e la più propizia:",
                            "verse 73:7": "durante il giorno hai occupazioni impegnative.",
                            "verse 73:8": "Menziona il Nome del tuo Signore e consacrati totalmente a Lui.",
                            "verse 73:9": "Il Signore dell'Oriente e dell'Occidente: non c'è dio all'infuori di Lui.",
                            "verse 73:10": "Sopporta con pazienza quello che dicono e allontanati dignitosamente .",
                            "verse 73:11": "LasciaMi con coloro che tacciano di menzogna, che vivono nell'agiatezza e concedi loro un po' di tempo.",
                            "verse 73:12": "Invero presso di Noi ci sono catene e la Fornace",
                            "verse 73:13": "e cibo che soffoca e doloroso castigo,",
                            "verse 73:14": "nel Giorno in cui la terra e le montagne tremeranno e in cui le montagne diventeranno come dune di sabbia fina.",
                            "verse 73:15": "In verità inviammo a voi un Messaggero, affinché testimoniasse contro di voi, così come inviammo un Messaggero a Faraone.",
                            "verse 73:16": "Ma Faraone disobbedì al Messaggero.",
                            "verse 73:17": "Come vi difenderete, voi che già non credeste nel Giorno che trasformerà i bambini in vecchi canuti",
                            "verse 73:18": "[nel Giorno in cui] si spaccherà il cielo? La promessa [di Allah] si realizzerà.",
                            "verse 73:19": "In verità questo è un Monito.",
                            "verse 73:20": "In verità il tuo Signore sa che stai ritto [in preghiera] per quasi due terzi della notte, o la metà, o un terzo e che lo stesso",
                            "verse 73:21": "una parte di coloro che sono con te."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "衣を頭から纒う者（ムハンマド）よ，",
                            "verse 73:2": "夜間に（礼拝に）立て，少時を除いて。",
                            "verse 73:3": "夜間の半分，またそれよりも少し縮めて（礼拝に立て），",
                            "verse 73:4": "あるいは，それよりも少し多く礼拝に（立て），そしてゆっくりと慎重な調子で，クルアーンを読め。",
                            "verse 73:5": "やがてわれは，荘重な御言葉（クルアーン）をあなたに下すであろう。",
                            "verse 73:6": "本当に夜間（礼拝）に起きることは，最も力強い歩みであり，御言葉を一層明確にする。",
                            "verse 73:7": "本当にあなたは，昼間は要務で長く追われる。",
                            "verse 73:8": "それであなたの主の御名を唱念し，精魂を傾けてかれに仕えなさい。",
                            "verse 73:9": "東と西の主であられ，かれの外に神はないのである。それでかれを，御槌すべき方として仰ぎなさい。",
                            "verse 73:10": "かれらの言うことを耐え忍び，かれらを離れよ，立派に身をかわせ。",
                            "verse 73:11": "現世の富にあずかって嘘付き呼ばわりする者たちをわれに委ねて，暫くの間かれらを猶与しなさい，",
                            "verse 73:12": "本当にわれの手元には鎖があり，また炎もある。",
                            "verse 73:13": "（喉に）病える食物があり，また痛ましい懲罰がある。",
                            "verse 73:14": "その日，大地と山々は震動し，山々は崩れ流れて，砂の固まりになるであろう。",
                            "verse 73:15": "本当にわれは，あなたがたの証人とするために，使徒をあなたがたに遣わした。われが且つて，フィルアウンに一人の使徒を送ったように。",
                            "verse 73:16": "だがフィルアウンはその使徒に従わなかったので，われはかれを厳しく罰して破滅させた。",
                            "verse 73:17": "もしあなたがたが依然として（アッラーを）拒否するなら，子供が（恐� のあまり）白髪になる日，あなたがたはどうして自分を守れようか。",
                            "verse 73:18": "その日，天は裂け散るであろう。かれの約束は，必ず完遂されるのである。",
                            "verse 73:19": "本当にこれは訓戒である。それで望む者に，主ヘの道を取らせなさい。",
                            "verse 73:20": "主は，あなたが夜間の殆ど3分の2，また（ある時は）2分の1，または3分の1を，（礼拝に）立つことを知っておられる。またあなたと一諸にいる一団の者も同様である。アッラーは，夜と昼を妥当に計られる。かれはあなたがたがそれを計れないことを知り，あなたがたを慈しまれる。だからあなたがたは，クルアーンを無理にならない程度に読め。かれは，あなたがたの中病める者のあることを知っておられる。また或る者はアッラーの恩恵を求めて，地上を旅し，或る者はアッラーの道のために戦っている（ことを）。だからそれを無理にならない程度に読め。礼拝の務めを守り，定めの喜捨をなし，アッラーに立派な貸付け（信仰のための散財）をしなさい。あなたがたが，自分の魂のために予め行う，どんな善いことも，アッラーの御許でそれを見い出そう。その（善行の）報奨は，最善にして最大である。あなたがたはアッラーの御赦しを請い求めるがいい。本当にアッラーは寛容にして慈悲深くあられる。 本当にこれは訓戒である。それで望む者に，主ヘの道を取らせなさい。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "망투 속에 싸여진 그대여",
                            "verse 73:2": "밤에 일어나 예배하라 그러나밤중 내내가 아니며",
                            "verse 73:3": "그것의 절반 아니면 그 이하 면 되며",
                            "verse 73:4": "그 이상이라도 좋으니라 그 리고 꾸란을 낭송하되 느리고 리 듬을 두어 읽으라",
                            "verse 73:5": "내가 그대에게 중요한 메세지 를 보내리라",
                            "verse 73:6": "실로 밤중에 일어나는 것은 어려운 일이되 예배하고 찬미하는 말을 하기에 가장 적합한 때라",
                            "verse 73:7": "실로 그대에게는 낮에 해야할임무가 있나니",
                            "verse 73:8": "그대 주님의 이름을 상기하고 온 정성을 다하여 그분만을 성기라",
                            "verse 73:9": "그분은 동쪽과 서쪽의 주님으 로 그분 외에는 신이 없나니 그분 만을 보호자로 택하라",
                            "verse 73:10": "그들이 말하는 것에 인내하 고 정중한 태도로 그들을 멀리하라",
                            "verse 73:11": "거짓하는 자들은 내게 두라 그들로 하여금 향락케 하여 잠시 만 유예하리라",
                            "verse 73:12": "나에게는 그들을 묶을 족쇠 와 그들을 태울 불이 있으며",
                            "verse 73:13": "질식시킬 음식과 고통스러운벌이 있나니",
                            "verse 73:14": "대지와 산들이 크게 동요하 는 그날 산들은 모래 산더미가 되 어 흘러 내리니라",
                            "verse 73:15": "실로 내가 그대들에게 한 선지자를 보냄은 너희를 위한 증 인이 되도록 함이니 이는 내가 파 라오에게 선지자를 보낸 것과 같 노라",
                            "verse 73:16": "그러나 파라오는 그 선지자 에게 복종하지 아니하였으매 나는 그에게 무거운 응벌을 내렸노라",
                            "verse 73:17": "너희가 하나님을 부정한다면어린이가 호호백발이 되는 그날 너희는 너희 자신을 어떻게 보호 하려 하느뇨",
                            "verse 73:18": "그때 하늘은 갈라지고 그분 의 약속은 이행되니라",
                            "verse 73:19": "실로 이것이 하나의 교훈이 니 뜻이 있는 자 주님의 길을 따 르게 하라",
                            "verse 73:20": "실로 주님은 그대가 밤의 삼 분의 이 또는 그것의 반을 때로는 삼분의 일을 예배하며 경배하는지 알고 계시며 또한 그대와 함께한 무리도 그러하니라 하나님만이 밤 낮을 운용하시며 너희가 그렇게 계산할 수 없음을 그분은 알고 계 시니라 그리하여 그분은 너희에게 자비를 베푸셨으니 꾸란을 많이 읽으라 너희에게 쉬워지리라 또 한 그분은 너희 가운데 병든자 있 고 하나님의 은혜를 추구하며 지 상을 여행하는 자 있으며 하나님 의 길에서 성전하는 자 있음을 알 고 계시나니 꾸란을 많이 읽으라 너희에게 쉬워지리라 그리고 예배 를 드리고 이슬람세를 내며 하나 님께 좋은 것으로 대부하라 너희 가 너희 영혼을 위해 바친 것은 하나님 앞에서 더 좋은 것으로 발견하리니 하나님의 은혜를 추구하라 하나님은 관용과 자비로 충만 하시니라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "ئه‌ی ئه‌وکه‌سه‌ی خۆت داپۆشیووه‌، ئه‌ی محمد صلی الله علیه وسلم",
                            "verse 73:2": "شه‌و هه‌سته نوێژ بکه مه‌گه‌ر که‌مێکی نه‌بێت.",
                            "verse 73:3": "نیوه‌ی یان که‌متر له نیوه‌ی لێ که‌م بکه‌ره‌وه‌.",
                            "verse 73:4": "یاخود زیاتری بکه‌و ده‌وری قورئان بکه‌ره‌وه به وردی و له‌سه‌رخۆ.",
                            "verse 73:5": "چونکه به‌ڕاستی ئێمه فه‌رمووده‌و گوفتارێکی سه‌نگین داده‌به‌زێنینه سه‌رت (که به‌هۆیه‌وه به‌ره‌نگاری ئه‌رك و زه‌حمه‌تی زۆر ده‌بیت).",
                            "verse 73:6": "به‌ڕاستی خۆ پێگه‌یاندن له شه‌ودا قورستره له ڕووی کردارو باشتره له ڕووی گوفتاره‌وه‌.",
                            "verse 73:7": "تۆ بۆت هه‌یه له ڕۆژدا هه‌وڵ بده‌یت (بانگه‌واز بکه‌یت) و بگه‌ڕێیت، کۆششی زۆر بکه‌یت.",
                            "verse 73:8": "تۆ هه‌میشه با ناوی په‌روه‌ردگارت ویردی سه‌ر زارت بێت، به دڵسۆزی و ملکه‌چیه‌وه ڕووی تێ بکه‌.",
                            "verse 73:9": "ئه‌و زاته‌ی که تۆی ڕه‌وانه‌کردوه‌؛ خاوه‌ن و په‌روه‌ردگاری ڕۆژهه‌ڵات و ڕۆژئاوایه‌، جگه له‌و هیچ خوایه‌کی تر نیه فه‌رمانی به‌ده‌ست بێت، که‌واته هه‌ر ئه‌و بکه به پشتیوانی خۆت و داوای یارمه‌تیی هه‌ر له‌و بکه‌.",
                            "verse 73:10": "له به‌رامبه‌ر گوفتاری ناڕه‌وای خوانه‌ناسانه‌وه هه‌رده‌م خۆ ڕاگربه‌و به شێوازێکی جوان به‌جێیان بهێڵه‌.",
                            "verse 73:11": "واز بهێنه له من و له‌و خاوه‌ن نازو نیعمه‌تانه‌ی که ئایینی من به‌درۆ ده‌زانن، تۆ که‌مێك مۆڵه‌تیان بده‌.",
                            "verse 73:12": "به‌ڕاستی ئێمه کۆت و زنجیرو دۆزه‌خمان ئاماده کردووه (بۆ ئه‌و جۆره تاوانبارانه‌).",
                            "verse 73:13": "هه‌روه‌ها خۆراکێك که له گه‌روو ده‌گیرێت، سه‌ره‌ڕای سزای به ئێش و ئازار.",
                            "verse 73:14": "له ڕۆژێکدا که زه‌وی و کێوه‌کان دێنه له‌رزه‌، سه‌رئه‌نجام کێوه‌کان وردو خاش ده‌بن و وه‌کو ته‌پۆلکه‌ی لمیان لێ دێت.",
                            "verse 73:15": "خۆ به‌ڕاستی ئێمه پێغه‌مبه‌رێکمان بۆ ڕه‌وانه‌کردوون که بوه‌ته شایه‌ت به‌سه‌رتانه‌وه هه‌روه‌کو چۆن بۆ لای فیر عه‌ونیش پێغه‌مبه‌رێکمان ڕه‌وانه کرد.",
                            "verse 73:16": "جا فیرعه‌ون یاخی بوو له‌و پێغه‌مبه‌ره‌، ئێمه‌ش به‌توندی پێچامانه‌وه‌و به‌ڵایه‌کی گه‌وره‌مان به‌سه‌ر هێنا.",
                            "verse 73:17": "(ئه‌گه‌ر ئێوه له‌سه‌ر یاخی بوونتان به‌رده‌وام بن)؛ جا چۆن خۆتان ده‌پارێزن له ڕۆژێك که منداڵ پیر ده‌کات و سه‌ری سپی ده‌بێت.",
                            "verse 73:18": "ئه‌و ڕۆژه ئاسمان به‌هه‌موو ئه‌ستێره‌و هه‌ساره‌کانیه‌وه له‌ت و په‌ت ده‌بێت، بێگومان ئه‌و به‌ڵێنه هه‌ر دێته دی.",
                            "verse 73:19": "به‌ڕاستی ئه‌م سووره‌ته‌ش یادخه‌ره‌وه‌و ئامۆژگاریه‌، بۆ ئه‌و که‌سه‌ی ده‌یه‌وێت ڕێگه به‌ره‌و په‌روه‌ردگاری بگرێته‌به‌ر.",
                            "verse 73:20": "به‌ڕاستی ئه‌و په‌روه‌ردگاره‌ت چاك ده‌زانێت که تۆ نزیکه‌ی دوو به‌شی شه‌و یاخود نیوه‌ی یان سێیه‌کی هه‌ڵده‌سیت و شه‌ونوێژ ده‌که‌یت، هه‌روه‌ها هه‌ندێك له‌وانه‌ی که له گه‌ڵتان، خوا ئه‌ندازه‌ی شه‌وو ڕۆژ دیاری ده‌کات، خوا زانیویه‌تی که ئێوه هه‌رگیز نازانن دیاریی بکه‌ن و ئاماری بکه‌ن ئه‌گه‌ر ئه‌و نه‌یکردایه‌، له‌به‌ر ئه‌وه ته‌وبه‌ی لێوه‌رگرتن، جا چه‌ندتان توانی و چۆنتان بۆ لوا له شه‌ونوێژو له کاتی تردا قورئان بخوێنن و ده‌وری بکه‌نه‌وه‌، چونکه ئه‌و خوایه میهره‌بانه‌و ده‌زانێت، له‌وانه‌یه که‌سانێکتان لێ نه‌خۆش بکه‌وێت و که‌سانی تریش ببن له زه‌ویدا بگه‌ڕێن به‌شوێن بازرگانی و فه‌زڵی خواداو که‌سانی تر له داهاتوودا بجه‌نگن بۆ لابردنی کۆسپه‌کانی سه‌ر ڕێی دینی خواو بۆ به‌ده‌ستهێنانی ڕه‌زامه‌ندی ئه‌و، که‌واته چه‌نده‌تان بۆکرا ئه‌وه‌نده قورئان بخوێنن و نوێژه‌کانتان به‌چاکی ئه‌نجام بده‌ن و زه‌کاتیش (به‌و شێوه‌یه‌ی دیاریکراوه‌) بیده‌ن و قه‌رز به‌شێوه‌یه‌کی جوان به‌خوا بده‌ن (ئه‌وه‌ی بۆ خوا ببه‌خشرێت خوای گه‌وره به‌قه‌رزێکی داده‌نێت که به‌زاتی خۆی درا بێت) هه‌ر ده‌ست پێشکه‌ریه‌کی چاکه بکه‌ن بۆ خۆتان سبه‌ی ده‌یبیننه‌وه لای خوا ده‌ستان ده‌که‌وێته‌وه به باشترو پاداشتی گه‌وره‌تر، ده داوای لێخۆشبوون هه‌ر له خوا بکه‌ن و دڵنیابن ئه‌و خوایه لێخۆشبوو میهره‌بانه‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "Wahai orang yang berselimut!.",
                            "verse 73:2": "Bangunlah sembahyang Tahajjud pada waktu malam, selain dari sedikit masa (yang tak dapat tidak untuk berehat),",
                            "verse 73:3": "Iaitu separuh dari waktu malam atau kurangkan sedikit dari separuh itu,",
                            "verse 73:4": "Ataupun lebihkan (sedikit) daripadanya dan bacalah Al-Quran dengan \"Tartil\".",
                            "verse 73:5": "(Sayugialah engkau dan pengikut-pengikutmu membiasakan diri masing-masing dengan ibadat yang berat kepada hawa nafsu, kerana) sesungguhnya Kami akan menurunkan kepadamu wahyu (Al-Quran yang mengandungi perintah-perintah) yang berat (kepada orang-orang yang tidak bersedia menyempurnakannya).",
                            "verse 73:6": "Sebenarnya sembahyang dan ibadat malam lebih kuat kesannya (kepada jiwa) dan lebih tetap betul bacaannya.",
                            "verse 73:7": "(Kami galakkan engkau dan umatmu beribadat pada waktu malam), kerana sesungguhnya engkau pada siang hari mempunyai urusan-urusan yang panjang kira bicaranya;",
                            "verse 73:8": "Dan sebutlah (dengan lidah dan hati) akan nama Tuhanmu (terus menerus siang dan malam), serta tumpukanlah (amal ibadatmu) kepadaNya dengan sebulat-bulat tumpuan.",
                            "verse 73:9": "Dialah Tuhan yang menguasai timur dan barat; tiada Tuhan melainkan Dia; maka jadikanlah Dia Penjaga yang menyempurnakan urusanmu.",
                            "verse 73:10": "Dan bersabarlah terhadap apa yang dikatakan oleh mereka (yang menentangmu), dan jauhkanlah dirimu dari mereka dengan cara yang baik.",
                            "verse 73:11": "Dan biarkanlah Aku sahaja membalas orang-orang yang mendustakan (bawaanmu) itu, orang-orang yang berada dalam kemewahan dan berilah tempoh kepada mereka sedikit masa;",
                            "verse 73:12": "Kerana sesungguhnya di sisi Kami disediakan (untuk mereka) belenggu-belenggu dan Neraka yang menjulang-julang,",
                            "verse 73:13": "Serta makanan yang menjadikan pemakannya tercekik dan azab seksa yang tidak terperi sakitnya.",
                            "verse 73:14": "(Azab itu tetap berlaku) pada hari bumi dan gunung-ganang bergoncang (serta hancur lebur) dan menjadilah gunung-ganang itu timbunan pasir yang mudah bersepah.",
                            "verse 73:15": "Sesungguhnya Kami telah mengutus kepada kamu (wahai umat Muhammad), seorang Rasul yang menjadi saksi terhadap kamu (tentang orang yang mematuhi atau menolak seruannya), sebagaimana Kami telah mengutus kepada Firaun seorang Rasul.",
                            "verse 73:16": "Maka Firaun menderhaka kepada Rasul itu, lalu Kami menyeksakannya dengan azab seksa yang seberat-beratnya.",
                            "verse 73:17": "(Sekiranya kamu tidak ditimpa azab di dunia), maka bagaimana kamu dapat menjaga dan menyelamatkan diri kamu kalau kamu kufur ingkar (dari azab) hari yang huru-haranya menyebabkan kanak-kanak menjadi tua beruban?",
                            "verse 73:18": "Langit (yang demikian besarnya) akan pecah belah dengan sebab kedahsyatan hari itu.",
                            "verse 73:19": "Sesungguhnya (keterangan-keterangan yang mengandungi amaran) ini menjadi peringatan oleh itu sesiapa yang mahukan kebaikan dirinya dapatlah dia mengambil jalan yang membawa kepada Tuhannya (dengan iman dan taat).",
                            "verse 73:20": "Sesungguhnya Tuhanmu (wahai Muhammad) mengetahui bahawasanya engkau bangun (sembahyang Tahajjud) selama kurang dari dua pertiga malam dan selama satu perduanya dan selama satu pertiganya dan (demikian juga dilakukan oleh) segolongan dari orang-orang yang bersama-samamu (kerana hendak menepati perintah yang terdahulu); padahal Allah jualah yang menentukan dengan tepat kadar masa malam dan siang."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "اى جامه به خود پيچيده!",
                            "verse 73:2": "شب را، جز كمى، بپاخيز!",
                            "verse 73:3": "نيمى از شب را، يا كمى از آن كم كن،",
                            "verse 73:4": "يا بر نصف آن بيفزا، و را با دقت و تامل بخوان;",
                            "verse 73:5": "چرا كه ما بزودى سخنى سنگين به تو القا خواهيم كرد!",
                            "verse 73:6": "مسلما نماز و عبادت شبانه پابرجاتر و با استقامت‏تر است!",
                            "verse 73:7": "و تو در روز تلاش مستمر و طولانى خواهى داشت!",
                            "verse 73:8": "و نام پروردگارت را ياد كن و تنها به او دل ببند!",
                            "verse 73:9": "همان پروردگار شرق و غرب كه معبودى جز او نيست، او را نگاهبان و وكيل خود انتخاب كن،",
                            "verse 73:10": "و در برابر آنچه (دشمنان) مى‏گويند شكيبا باش و بطرزى شايسته از آنان دورى گزين!",
                            "verse 73:11": "و مرا با تكذيب‏كنندگان صاحب نعمت واگذار، و آنها را كمى مهلت ده،",
                            "verse 73:12": "كه نزد ما غل و زنجيرها و (آتش) دوزخ است،",
                            "verse 73:13": "و غذايى گلوگير، و عذابى دردناك،",
                            "verse 73:14": "در آن روز كه زمين و كوه‏ها سخت به لرزه درمى‏آيد، و كوه‏ها (چنان درهم كوبيده مى‏شود كه) به شكل توده‏هايى از شن نرم درمى‏آيد!",
                            "verse 73:15": "ما پيامبرى به سوى شما فرستاديم كه گواه بر شماست، همان گونه كه به سوى فرعون رسولى فرستاديم!",
                            "verse 73:16": "(ولى) فرعون به مخالفت و نافرمانى آن رسول برخاست، و ما او را سخت مجازات كرديم!",
                            "verse 73:17": "شما (نيز) اگر كافر شويد، چگونه خود را (از عذاب الهى) بر كنار مى‏داريد؟! در آن روز كه كودكان را پير مى‏كند،",
                            "verse 73:18": "و آسمان از هم شكافته مى‏شود، و وعده او شدنى و حتمى است",
                            "verse 73:19": "اين هشدار و تذكرى است، پس هر كس بخواهد راهى به سوى پروردگارش برمى‏گزيند!",
                            "verse 73:20": "پروردگارت مى‏داند كه تو و گروهى از آنها كه با تو هستند نزديك دو سوم از شب يا نصف يا ثلث آن را به پا مى‏خيزند; خداوند شب و روز را اندازه‏گيرى مى‏كند; او مى‏داند كه شما نمى‏توانيد مقدار آن را (به دقت) اندازه‏گيرى كنيد (براى عبادت كردن)، پس شما را بخشيد; اكنون آنچه براى شما ميسر است بخوانيد او مى‏داند بزودى گروهى از شما بيمار مى‏شوند، و گروهى ديگر براى به دست آوردن فضل الهى (و كسب روزى) به سفر مى‏روند، و گروهى ديگر در راه خدا جهاد مى‏كنند (و از تلاوت بازمى‏مانند)، پس به اندازه‏اى كه براى شما ممكن است از آن تلاوت كنيد و نماز را بر پا داريد و زكات بپردازيد و به خدا «قرض الحسنه‏» دهيد ( در راه او انفاق نماييد) و (بدانيد) آنچه را از كارهاى نيك براى خود از پيش مى‏فرستيد نزد خدا به بهترين وجه و بزرگترين پاداش خواهيد يافت; و از خدا آمرزش بطلبيد كه خداوند آمرزنده و مهربان است!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "Ó tu, acobertado,",
                            "verse 73:2": "Levanta-te à noite (para rezar), porém não durante toda a noite;",
                            "verse 73:3": "A metade dela ou pouco menos,",
                            "verse 73:4": "Ou pouco mais, e recita fervorosamente o Alcorão.",
                            "verse 73:5": "Em verdade, vamos revelar-te uma mensagem de peso.",
                            "verse 73:6": "Em verdade, o ato de te levantares à noite para rezares é mais marcante e mais adequado.",
                            "verse 73:7": "Porque durante o dia tens muitos afazeres.",
                            "verse 73:8": "Porém, recorda-te do teu Senhor e consagra-te integralmente a Ele.",
                            "verse 73:9": "Ele é o Senhor do Oriente e do Ocidente.",
                            "verse 73:10": "E tolera tudo quanto te digam, e afasta-te dignamente deles.",
                            "verse 73:11": "E deixa por Minha conta os desmentidores, opulentos, e tolera-os por curto tempo,",
                            "verse 73:12": "Porque lhes reservamos os grilhões e o fogo,",
                            "verse 73:13": "Um alimento que engasga e um doloroso castigo.",
                            "verse 73:14": "Será o dia em que haverão de tremer a terra e as montanhas, e haverão de se converter, as montanhas, em dunas dispersas.",
                            "verse 73:15": "Sabei que vos enviamos um Mensageiro, para ser testemunha contra vós, tal como enviamos um mensageiro ao Faraó.",
                            "verse 73:16": "Porém, o Faraó desobedeceu ao mensageiro, pelo que o castigamos severamente.",
                            "verse 73:17": "Se não crerdes, como, então, vos precavereis, no dia em que envelhecerão as crianças.",
                            "verse 73:18": "E o céu se fenderá? Sabei que a Sua promessa se cumprirá!",
                            "verse 73:19": "Em verdade, esta é uma admoestação, e, quem quiser, poderá encaminhar-se para a senda do seu Senhor.",
                            "verse 73:20": "Em verdade, o teu Senhor sabe que tu te levantas para rezar, algumas vezes durante dois terços da noite, outras, metade, e outras, ainda, um terço , assim como (o faz) uma boa parte dos teus; mas Deus mede a noite e o dia, e bem sabe que não podeis precisar (as horas), pelo que vos absolve."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 73:1": "O, tu , cel învãluit [în straiele tale]!",
                            "verse 73:2": "Scoalã-te noaptea [pentru Rugãciune], afarã de puțin",
                            "verse 73:3": "-",
                            "verse 73:4": "Jumãtate din ea sau mai scade din ea puțin ,",
                            "verse 73:5": "Sau mai adaugã la ea! - și recitã Coranul cu glas tãrãgãnat și limpede!",
                            "verse 73:6": "Noi îți vom trimite cuvinte grele .",
                            "verse 73:7": "Scularea [pentru Rugãciune] în timpul nopții este mai folositoare și mai potrivitã pentru recitare;",
                            "verse 73:8": "În timpul zilei tu ai de lucru îndelung !",
                            "verse 73:9": "Și pomenește numele Domnului tãu și dãruiește-te Lui, cu totul!",
                            "verse 73:10": "Domnul Rãsãritului și al Apusului! Nu existã altã divinitate afarã deEl; deci socotește-L numai pe El Ocrotitor!",
                            "verse 73:11": "Îndurã ceea ce zic ei și depãrteazã-te de ei, plecând cuviincios!",
                            "verse 73:12": "Și lasã-Mã pe Mine cu aceia care învinuiesc de minciunã dintre cei care trãiesc în îndestulare și dã-le lor un scurt rãgaz!",
                            "verse 73:13": "Noi avem [pentru ei] fiare grele și Iadul",
                            "verse 73:14": "Și mâncare înecãcioasã și chin dureros,",
                            "verse 73:15": "În Ziua când se vor cutremura pãmântul și munții și se vor face munții ca o dunã de nisip risipit.",
                            "verse 73:16": "Noi v-am trimis un Trimis ca sã fie martor pentru voi, așa cum am trimis și la Faraon un trimis,",
                            "verse 73:17": "Însã Faraon nu i-a dat ascultare trimisului și Noi l-am lovit cu pedeapsã asprã .",
                            "verse 73:18": "Și cum voiți voi - dacã rãmâneți necredincioși - sã vã apãrați deo Zi care îi va face pe copii cãrunți,",
                            "verse 73:19": "În care cerul se va despica și fãgãduința Lui se va împlini negreșit!",
                            "verse 73:20": "Aceasta este o îndemnare și cine voiește va urma drumul cãtre Domnul sãu.",
                            "verse 73:21": "Domnul tãu, [o, Muhammed,] știe cã tu stai în picioare",
                            "verse 73:22": "aproape douã treimi din noapte, sau jumãtate din ea, sauo treime din ea, ca și o parte dintre aceia care sunt cu tine."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 73:1": "O, tu cel înfăşurat în mantie!",
                            "verse 73:2": "Scoală-te noaptea, însă nu puţin,",
                            "verse 73:3": "jumătate din ea ori mai scade puţin",
                            "verse 73:4": "ori mai adaugă şi psalmodiază Coranul!",
                            "verse 73:5": "Noi îţi vom da un cuvânt cumpănitor:",
                            "verse 73:6": "începutul nopţii este mai puternic la adâncit şi mai drept la rostit,",
                            "verse 73:7": "căci peste zi ai trudă lungă.",
                            "verse 73:8": "Aminteşte Numele Domnului tău şi Lui dăruieşte-te întru totul.",
                            "verse 73:9": "El este Domnul Răsăritului şi al Asfinţitului.",
                            "verse 73:10": "Rabdă când îi auzi ceea ce spun şi cuviincios îndepărtează-te de ei.",
                            "verse 73:11": "Lasă-Mă pe Mine cu cei care hulesc, cu cei care trăiesc în îndestulare, şi mai dă-le un scurt răgaz!",
                            "verse 73:12": "Noi avem fiare şi iad,",
                            "verse 73:13": "şi mâncare înecătoare şi osândă dureroasă",
                            "verse 73:14": "pentru ziua când pământul şi munţii se vor zgudui, când munţii vor fi asemena unei dune răvăşite.",
                            "verse 73:15": "Noi v-am trimis vouă un profet care este martor a ceea ce sunteţi, aşa cum am trimis un profet şi la Faraon.",
                            "verse 73:16": "Faraon nu i-a dat ascultare profetului şi Noi, atunci, l-am luat cu o grea lovitură.",
                            "verse 73:17": "Cum vă veţi apăra, dacă aţi fost tăgăduitori, de ziua care până şi pe prunci îi va încărunţi?",
                            "verse 73:18": "Cerul se va despica atunci, iar făgăduiala se va împlini.",
                            "verse 73:19": "Aceasta este o amintire! Cel care vrea poate apuca către Domnul său pe o cale!",
                            "verse 73:20": "Domnul tău ştie că tu şi mulţi dimpreună cu tine vă sculaţi pentru rugăciune, aproape două treimi ori o jumătate ori o treime din noapte."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "О завернувшийся в свой плащ!",
                            "verse 73:2": "Простаивай в молитве ночь,И коль не всю,",
                            "verse 73:3": "То половину, иль немногим меньше,",
                            "verse 73:4": "Иль к этому прибавь, —Коран читай размеренным(и стройным) чтеньем.",
                            "verse 73:5": "Мы скоро ниспошлем тебе Словавесомости великой.",
                            "verse 73:6": "Вставание в начальные часы ночи’И ум, и душу просветляети силу придает словам, —",
                            "verse 73:7": "Ведь день твой полон множествомзабот.",
                            "verse 73:8": "Так поминай же имя Бога своегоИ устремись к Нему всем сердцем —",
                            "verse 73:9": "Владыке и восхода, и заката, —Ведь нет другого божества, кромеНего!Возьми ж Его ты в покровители себе.",
                            "verse 73:10": "Терпимо относись к словам(неверных)И с честью отойди от них.",
                            "verse 73:11": "И предоставь Мне справитьсясо всеми,Кто, наслаждаясь благами на сей земле,Все ж истину за ложь считает.",
                            "verse 73:12": "У Нас для них тяжелые оковы и Огонь,",
                            "verse 73:13": "И удавляющие яства,И мучительные кары.",
                            "verse 73:14": "В тот ДеньЗемля и горы содрогнутся,Сыпучими холмами станут горы.",
                            "verse 73:15": "Мы к вам посланника послалиСвидетельствовать против вас,Как Мы послали (Мусу) к Фараону.",
                            "verse 73:16": "Но Фараон отверг его (призыв),За что схватили Мы его мучительноюкарой.",
                            "verse 73:17": "Так как же оградите вы себя,Коль вы в неверии живете,От Дня того,Когда (от ужаса) седыми дети станут?",
                            "verse 73:18": "Тогда расколется небесный свод,И сбудется Господне обещанье.",
                            "verse 73:19": "Ведь это — увещание (Аллаха),А потому всяк, кто того желает,Дорогой праведной идет (к Нему).",
                            "verse 73:20": "Поистине, (о Мухаммад!), Господьтвой знает,Что меньше чем две трети ночиСтоишь (в ночной молитве) ты,А то и половину или треть ее,И так же делают твои собратья."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "¡Tú, el arrebujado!",
                            "verse 73:2": "¡Vela casi toda la noche,",
                            "verse 73:3": "o media noche, o algo menos,",
                            "verse 73:4": "o más, y recita el Corán lenta y claramente!",
                            "verse 73:5": "Vamos a comunicarte algo importante:",
                            "verse 73:6": "la primera noche es más eficaz y de dicción más correcta.",
                            "verse 73:7": "Durante el día estás demasiado ocupado.",
                            "verse 73:8": "¡Y menciona el nombre de tu Señor y conságrate totalmente a Él!",
                            "verse 73:9": "El Señor del Oriente y del Occidente.",
                            "verse 73:10": "¡Ten paciencia con lo que dicen y apártate de ellos discretamente!",
                            "verse 73:11": "¡Déjame con los desmentidores, que gozan de las comodidades de la vida! ¡Concédeles aún una breve prórroga!",
                            "verse 73:12": "Disponemos de cadenas y de fuego de gehena,",
                            "verse 73:13": "de alimento que se atraganta y de castigo doloroso.",
                            "verse 73:14": "El día que tiemblen la tierra y las montañas, y se conviertan las montañas en montones dispersos de arena.",
                            "verse 73:15": "Os hemos mandado un Enviado, testigo contra vosotros, como antes habíamos mandado un enviado a Faraón.",
                            "verse 73:16": "Faraón desobedeció al enviado y le sorprendimos duramente.",
                            "verse 73:17": "Si no creéis, ¿cómo vais a libraros de un día que hará encanecer a los niños?",
                            "verse 73:18": "El cielo se entreabrirá.",
                            "verse 73:19": "Esto es un Recuerdo.",
                            "verse 73:20": "Tu Señor sabe que pasas en oración casi dos tercios de la noche, la mitad o un tercio de la misma, y lo mismo algunos de los que están contigo."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "போர்வை போர்த்திக் கொண்டிருப்பவரே!",
                            "verse 73:2": "இரவில் - சிறிது நேரம் தவிர்த்து (தொழுகைக்காக எழுந்து) நிற்பீராக,",
                            "verse 73:3": "அதில் பாதி (நேரம்) அல்லது அதில் சிறிது குறைத்துக் கொள்வீராக!",
                            "verse 73:4": "அல்லது அதைவிடச் சற்று அதிகப்படுத்திக் கொள்வீராக, மேலும் குர்ஆனைத் தெளிவாகவும், நிறுத்தி, நிறுத்தியும் ஓதுவீராக.",
                            "verse 73:5": "நிச்சயமாக, நாம் விரைவில் கனமான உறுதியான - ஒரு வாக்கை உம்மீது இறக்கி வைப்போம்.",
                            "verse 73:6": "நிச்சயமாக, இரவில் எழு(ந்திருந்து வணங்கு)வது (அகத்தையும் புறத்தையும்) ஒருங்கிணைக்க வல்லது.",
                            "verse 73:7": "நிச்சயமாகப் பகலில் உமக்கு நெடிய (கடினமான) வேலைகள் இருக்கின்றன.",
                            "verse 73:8": "எனினும் (இரவிலும், பகலிலும்) உம்முடைய இறைவனின் பெயரை தியானிப்பீராக! இன்னும் அவனளவிலேயே முற்றிலும் திரும்பியவராக இருப்பீராக.",
                            "verse 73:9": "(அவனே) கிழக்கிற்கும், மேற்கிற்கும் இறைவன்; அவனைத் தவிர வேறு நாயனில்லை ஆகவே அவனையே நீர் பாதுகாவலனாக ஆக்கிக் கொள்வீராக.",
                            "verse 73:10": "அன்றியும், அவர்கள் (உமக்கெதிராகக்) கூறுவதைப் பொறுத்துக் கொள்வீராக, மேலும், அழகான கண்ணியமான - முறையில் அவர்களை விட்டும் வெறுத்து ஒதுங்கி விடுவீராக.",
                            "verse 73:11": "என்னையும், பொய்ப்பிப்வர்களாகிய அந்தச் சுக வாசிகளையும் விட்டுவிடும்; அவர்களுக்குச் சிறிது அவகாசமும் கொடுப்பீராக.",
                            "verse 73:12": "நிச்சமயாக நம்மிடத்தில் (அவர்களுக்காக) விலங்குகளும், நரகமும் இருக்கின்றன.",
                            "verse 73:13": "(தொண்டையில்) விக்கிக் கொள்ளும் உணவும், நோவினை செய்யும் வேதனையும் இருக்கின்றன.",
                            "verse 73:14": "அந்நாளில் பூமியும், மலைகளும் அதிர்ந்து, மலைகள் சிதறி மணல் குவியல்களாகிவிடும்.",
                            "verse 73:15": "நிச்சயமாக ஃபிர்அவ்னிடம் தூதரை நாம் அனுப்பியது போல், உங்களிடமும், உங்கள் மீது சாட்சி சொல்பவராகிய தூதரை நாம் அனுப்பி வைத்தோம்.",
                            "verse 73:16": "எனினும் ஃபிர்அவ்ன் அத்தூதருக்கு மாறு செய்தான் எனவே, அவனைக் கடினமான பிடியாக, நாம் பிடித்துக் கொண்டோம்.",
                            "verse 73:17": "எனவே, நீங்கள் நிராகரித்தீர்களானால், குழந்தைகளையும் நரைத்தவர்களாக்கும் அந்த நாளிலிருந்து எவ்வாறு தப்பிக்க போகிறீர்கள்.",
                            "verse 73:18": "அதில் வானம் பிளந்து விடும் அவனுடைய வாக்குறுதி செயல்படுத்தப்படும்.",
                            "verse 73:19": "நிச்சயமாக இது நினைவூட்டும் நல்லுபபதேசமாகும் ஆகவே எவர் விரும்புகிறாரோ அவர் தம்முடைய இறைவனிடம் (செல்லும் இவ்)வழியை எடுத்துக் கொள்வாராக.",
                            "verse 73:20": "நிச்சயமாக நீரும், உம்முடன் இருப்போரில் ஒரு கூட்டத்தாரும் இரவில் மூன்றில் இரு பாகங்களுக்குச் சமீபமாகவே, இன்னும் அதில் பாதியோ இன்னும் இதில் மூன்றில் ஒரு பாகத்திலோ (வணக்கத்திற்காக) நிற்கிறீர்கள் என்பதை உம்முடைய இறைவன் நிச்சயமாக அறிவான், அல்லாஹ்வே இரவையும் பகலையும் அளவாகக் கணக்கிடுகின்றான், அதை நீங்கள் சரியாகக் கணக்கிட்டுக் கொள்ள மாட்டீர்கள் என்பதையும் அவன் அறிகிறான்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "โอ้ ผู้คลุมกายอยู่เอ๋ย !",
                            "verse 73:2": "จงยืนขึ้น (ละหมาด) เวลากลางคืน เว้นแต่เพียงเล็กน้อย (ไม่ใช่ตลอดคืน)",
                            "verse 73:3": "ครึ่งหนึ่งของเวลากลางคืน หรือน้อยกว่านั้นเพียงเล็กน้อย",
                            "verse 73:4": "หรือมากกว่านั้น และจงอ่านอัลกุรอานช้า ๆ เป็นจังหวะ (ชัดถ้อยชัดคำ)",
                            "verse 73:5": "แท้จริงเราจะประทานวจนะ (วะฮีย์ยฺ) อันหนักหน่วงแก่เจ้า",
                            "verse 73:6": "แท้จริงการตื่นขึ้นในเวลากลางคืนนั้นเป็นเวลาที่ประทับใจยิ่งและเป็นการอ่านที่ชัดเจนยิ่ง",
                            "verse 73:7": "แท้จริงสำหรับเจ้านั้นในเวลากลางวันมีภารกิจมากมาย",
                            "verse 73:8": "และจงรำลึกถึงพระนามแห่งพระเจ้าของเจ้า และจงตั้งจิตมั่นต่อพระองค์อย่างเคร่งครัด",
                            "verse 73:9": "พระเจ้าแห่งทิศตะวันออกและทิศตะวันตก ไม่มีพระเจ้าอื่นใดนอกจากพระองค์ ดังนั้นจงยึดพระองค์ให้เป็นผู้คุ้มครองเถิด",
                            "verse 73:10": "และจงอดทนต่อสิ่งที่พวกเขากล่าวร้ายและจงแยกตัวออกจากพวกเขาด้วยการแยกตัวอย่างสุภาพ",
                            "verse 73:11": "และจงปล่อยข้ากับบรรดาผู้ปฏิเสธผู้สำราญ และจงผ่อนผันให้แก่พวกเขาสักเล็กน้อย",
                            "verse 73:12": "แท้จริง ณ ที่เรานั้นมีตรวนและกองไฟลุกโชน",
                            "verse 73:13": "และอาหารที่ติดลำคอและการลงโทษอันเจ็บปวด",
                            "verse 73:14": "วันที่แผ่นดินและภูเขาจะสั่นสะเทือนและภูเขาจะกลายเป็นกองทรายไหลพรู",
                            "verse 73:15": "แท้จริงเราได้ส่งร่อซู้ลคนหนึ่งไปยังพวกเจ้า เพื่อเป็นพยานต่อพวกเจ้า ดังที่เราได้ส่งร่อซู้ลคนหนึ่งไปยังฟิรเอาน์",
                            "verse 73:16": "แต่ฟิรเอาน์ได้ฝ่าฝืนร่อซู้ลคนนั้น ดังนั้นเราจึงได้ลงโทษเขาด้วยการลงโทษอย่างหนักหน่วง",
                            "verse 73:17": "ถ้าพวกเจ้าปฏิเสธ ดังนั้นพวกเจ้าจะปกป้องตนเองต่อวันนั้นได้อย่างไรเล่า ซึ่งจะทำให้เด็กๆ กลายเป็นแก่ (มีผมสีขาวเพราะความตกใจกลัว)",
                            "verse 73:18": "(วันนั้น) ชั้นฟ้าจะปริแยกออก และสัญญาของพระองค์จะต้องเกิดขึ้น (อย่างไม่ต้องสงสัย)",
                            "verse 73:19": "แท้จริง นี่คือข้อเตือนสติ ดังนั้นผู้ใดประสงค์ก็พึงยึดถือเป็นแนวทางไปสู่พระเจ้าของเขาเถิด",
                            "verse 73:20": "และอัลลอฮ์ทรงกำหนดเวลากลางคืนและกลางวัน พระองค์ทรงรู้ดีว่าพวกเจ้าไม่สามารถที่จะกำหนดเวลาได้ ด้วยเหตุนี้พระองค์จึงทรงผ่อนผันให้แก่พวกเจ้า ดังนั้นพวกเจ้าจงอ่านอัลกุรอานตามแต่สะดวกเถิด พระองค์ทรงรู้ดีว่า อาจมีบางคนในหมู่พวกเจ้าเป็นคนป่วย และบางคนอื่น ๆ ต้องเดินทางไปดินแดนอื่น เพื่อแสวงหาจากความโปรดปรานของอัลลอฮ์ และบางคนอื่นต่อสู้ในทางของอัลลอฮ์ ดังนั้นพวกเจ้าจงอ่านตามสะดวกจากอัลกุรอานเถิด และจงดำรงไว้ซึ่งการละหมาดและจงบริจาคซะกาต และจงให้อัลลอฮ์ยืมอย่างดีเยี่ยมเถิด และความดีอันใดที่พวกเจ้าได้กระทำไว้เพื่อตัวของพวกเจ้าเองพวกเจ้าก็จะพบมัน ณ ที่อัลลอฮ์ ซึ่งเป็นความดีและผลตอบแทนก็ยิ่งใหญ่กว่า ดังนั้นพวกเจ้าจงขออภัยโทษต่ออัลลอฮ์ แท้จริงอัลลอฮ์เป็นผู้ทรงอภัย ผู้ทรงเมตตาเสมอ"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "Ey örtünüp bürünen (Resûlüm)!",
                            "verse 73:2": "Birazı hariç, geceleri kalk namaz kıl.",
                            "verse 73:3": "(Gecenin) yarısını (kıl).",
                            "verse 73:4": "Ya da bunu çoğalt ve Kur'an'ı tane tane oku.",
                            "verse 73:5": "Doğrusu biz sana (taşıması) ağır bir söz vahyedeceğiz.",
                            "verse 73:6": "Şüphesiz gece kalkışı, (kalp ve uzuvlar arasında) tam bir uyuma ve sağlam bir kıraata daha elverişlidir.",
                            "verse 73:7": "Zira gündüz vakti, sana uzun bir meşguliyet var.",
                            "verse 73:8": "Rabbinin adını an.",
                            "verse 73:9": "O, doğunun da batının da Rabbidir.",
                            "verse 73:10": "Onların (müşriklerin) söylediklerine katlan ve onlardan güzellikle ayrıl.",
                            "verse 73:11": "Nimet içinde yüzen o yalancıları bana bırak ve onlara biraz mühlet ver.",
                            "verse 73:12": "Hiç şüphesiz bizim nezdimizde (onlar için hazırlanmış) boyunduruklar, yakıcı bir ateş, var.",
                            "verse 73:13": "Boğazdan",
                            "verse 73:14": "geçmez bir yiyecek ve elem verici bir azap var.",
                            "verse 73:15": "O gün (kıyamet günü) yeryüzü ve dağlar sarsılır; dağlar çöküntü ile akıp giden kum yığınına döner.",
                            "verse 73:16": "Nasıl Firavun'a bir elçi göndermiş idiysek doğrusu size de, hakkınızda şahitlik edecek bir peygamber gönderdik.",
                            "verse 73:17": "Ama Firavun o peygambere karşı gelmiş, biz de onu ağır ve çetin bir şekilde muaheze etmiştik.",
                            "verse 73:18": "Peki inkâr ederseniz, çocukları ak saçlı ihtiyarlara çevirecek o günden kendinizi nasıl koruyabileceksiniz?",
                            "verse 73:19": "Gökyüzü bile onunla (o günün dehşetiyle) yarılacaktır.",
                            "verse 73:20": "İşte bu (anlatılanlar), şüphesiz bir öğüttür.",
                            "verse 73:21": "(Resûlüm!) Senin, gecenin üçte ikisine yakın kısmını, (bazen) yarısını, (bazen de) üçte birini yatmadan (ibadetle) geçirdiğini ve beraberinde bulunanlardan bir topluluğun da (böyle yaptığını) Rabbin elbette biliyor."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "اے (محمد) جو کپڑے میں لپٹ رہے ہو",
                            "verse 73:2": "اے کملي کي جھرمٹ والے (حبيب!)o",
                            "verse 73:3": "آپ رات کو (نماز ميں) قيام فرمايا کريں مگر تھوڑي دير (کے لئے)o",
                            "verse 73:4": "رات کو قیام کیا کرو مگر تھوڑی سی رات",
                            "verse 73:5": "(قیام) آدھی رات (کیا کرو)",
                            "verse 73:6": "آدھي رات يا اِس سے تھوڑا کم کر ديںo",
                            "verse 73:7": "يا اس پر کچھ زيادہ کر ديں اور قرآن خوب ٹھہر ٹھہر کر پڑھا کريںo",
                            "verse 73:8": "یا اس سے کچھ کم یا کچھ زیادہ اور قرآن کو ٹھہر ٹھہر کر پڑھا کرو",
                            "verse 73:9": "ہم عنقریب تم پر ایک بھاری فرمان نازل کریں گے",
                            "verse 73:10": "ہم عنقريب آپ پر ايک بھاري فرمان نازل کريں گےo",
                            "verse 73:11": "بے شک رات کا اُٹھنا (نفس کو) سخت پامال کرتا ہے اور (دِل و دِماغ کي يک سُوئي کے ساتھ) زبان سے سيدھي بات نکالتا ہےo",
                            "verse 73:12": "کچھ شک نہیں کہ رات کا اٹھنا (نفس بہیمی) کو سخت پامال کرتا ہے اور اس وقت ذکر بھی خوب درست ہوتا ہے",
                            "verse 73:13": "دن کے وقت تو تمہیں اور بہت سے شغل ہوتے ہیں",
                            "verse 73:14": "بے شک آپ کے لئے دن ميں بہت سي مصروفيات ہوتي ہيںo",
                            "verse 73:15": "اور آپ اپنے رب کے نام کا ذِکر کرتے رہيں اور (اپنے قلب و باطن ميں) ہر ايک سے ٹوٹ کر اُسي کے ہو رہيںo",
                            "verse 73:16": "تو اپنے پروردگار کے نام کا ذکر کرو اور ہر طرف سے بیتعلق ہو کر اسی کی طرف متوجہ ہوجاؤ",
                            "verse 73:17": "(وہی) مشرق اور مغرب کا مالک (ہے اور) اس کے سوا کوئی معبود نہیں تو اسی کو اپنا کارساز بناؤ",
                            "verse 73:18": "وہ مشرق و مغرب کا مالک ہے، اُس کے سوا کوئي معبود نہيں، سو اُسي کو (اپنا) کارساز بنا ليںo",
                            "verse 73:19": "اور آپ ان (باتوں) پر صبر کريں جو کچھ وہ (کفار) کہتے ہيں، اور نہايت خوبصورتي کے ساتھ ان سے کنارہ کش ہو جائيںo",
                            "verse 73:20": "اور جو جو (دل آزار) باتیں یہ لوگ کہتے ہیں ان کو سہتے رہو اور اچھے طریق سے ان سے کنارہ کش رہو",
                            "verse 73:21": "اور مجھے ان جھٹلانے والوں سے جو دولتمند ہیں سمجھ لینے دو اور ان کو تھوڑی سی مہلت دے دو",
                            "verse 73:22": "اور آپ مجھے اور جھٹلانے والے سرمايہ داروں کو (اِنتقام لينے کے لئے) چھوڑ ديں اور انہيں تھوڑي سي مہلت دے ديں (تاکہ اُن کے اَعمالِ بد اپني اِنتہاء کو پہنچ جائيں)o",
                            "verse 73:23": "بيشک ہمارے پاس بھاري بيڑياں اور (دوزخ کي) بھڑکتي ہوئي آگ ہےo",
                            "verse 73:24": "کچھ شک نہیں کہ ہمارے پاس بیڑیاں ہیں اور بھڑکتی ہوئی آگ ہے",
                            "verse 73:25": "اور گلوگیر کھانا ہے اور درد دینے والا عذاب (بھی) ہے",
                            "verse 73:26": "اور حلق ميں اٹک جانے والا کھانا اور نہايت دردناک عذاب ہےo",
                            "verse 73:27": "جس دن زمين اورپہاڑ زور سے لرزنے لگيں گے اور پہاڑ بکھرتي ريت کے ٹيلے ہو جائيں گےo",
                            "verse 73:28": "جس دن زمین اور پہاڑ کانپنے لگیں اور پہاڑ ایسے بھر بھرے (گویا) ریت کے ٹیلے ہوجائیں",
                            "verse 73:29": "(اے اہل مکہ) جس طرح ہم نے فرعون کے پاس (موسیٰ کو) پیغمبر (بنا کر) بھیجا تھا (اسی طرح) تمہارے پاس بھی (محمد) رسول بھیجے ہیں جو تمہارے مقابلے میں گواہ ہوں گے",
                            "verse 73:30": "بے شک ہم نے تمہاري طرف ايک رسول (صلي اللہ عليہ وآلہ وسلم) بھيجا ہے جو تم پر (اَحوال کا مشاہدہ فرما کر) گواہي دينے والا ہے، جيسا کہ ہم نے فرعون کي طرف ايک رسول کو بھيجا تھاo",
                            "verse 73:31": "پس فرعون نے اس رسول (عليہ السلام) کي نافرماني کي، سو ہم نے اس کو ہلاکت انگيز گرفت ميں پکڑ لياo",
                            "verse 73:32": "سو فرعون نے (ہمارے) پیغمبر کا کہا نہ مانا تو ہم نے اس کو بڑے وبال میں پکڑ لیا",
                            "verse 73:33": "اگر تم بھی (ان پیغمبروں کو) نہ مانو گے تو اس دن سے کیونکر بچو گے جو بچّوں کو بوڑھا کر دے گا",
                            "verse 73:34": "اگر تم کفر کرتے رہو تو اُس دن (کے عذاب) سے کيسے بچو گے جو بچوں کو بوڑھا کردے گاo",
                            "verse 73:35": "(جس دن کي) شدت کے باعث آسمان پھٹ جائے گا، اُس کا وعدہ پورا ہو کر رہے گاo",
                            "verse 73:36": "(اور) جس سے آسمان پھٹ جائے گا۔ یہ اس کا وعدہ (پورا) ہو کر رہے گا",
                            "verse 73:37": "یہ (قرآن) تو نصیحت ہے۔ سو جو چاہے اپنے پروردگار تک (پہنچنے کا) رستہ اختیار کرلے",
                            "verse 73:38": "بے شک يہ (قرآن) نصيحت ہے، پس جو شخص چاہے اپنے رب تک پہنچنے کا راستہ اِختيار کر لےo",
                            "verse 73:39": "بے شک آپ کا رب جانتا ہے کہ آپ (کبھي) دو تہائي شب کے قريب اور (کبھي) نصف شب اور (کبھي) ايک تہائي شب (نماز ميں) قيام کرتے ہيں، اور اُن لوگوں کي ايک جماعت (بھي) جو آپ کے ساتھ ہيں (قيام ميں شريک ہوتي ہے)، اور ا? ہي رات اور دن (کے گھٹنے اور بڑھنے) کا صحيح اندازہ رکھتا ہے، وہ جانتا ہے کہ تم ہرگز اُس کے اِحاطہ کي طاقت نہيں رکھتے، سو اُس نے تم پر (مشقت ميں تخفيف کر کے) معافي دے دي، پس جتنا آساني سے ہو سکے قرآن پڑھ ليا کرو، وہ جانتا ہے کہ تم ميں سے (بعض لوگ) بيمار ہوں گے اور (بعض) دوسرے لوگ زمين ميں سفر کريں گے تاکہ ا? کا فضل تلاش کريں اور (بعض) ديگر ا? کي راہ ميں جنگ کريں گے، سو جتنا آساني سے ہو سکے اُتنا (ہي) پڑھ ليا کرو، اور نماز قائم رکھو اور زکو?? ديتے رہو اور ا? کو قرضِ حسن ديا کرو، اور جو بھلائي تم اپنے لئے آگے بھيجو گے اُسے ا? کے حضور بہتر اور اَجر ميں بزرگ تر پا لوگے، اور ا? سے بخشش طلب کرتے رہو، ا? بہت بخشنے والا بے حد رحم فرمانے والا ہےo",
                            "verse 73:40": "تمہارا پروردگار خوب جانتا ہے کہ تم اور تمہارے ساتھ کے لوگ (کبھی) دو تہائی رات کے قریب اور (کبھی) آدھی رات اور (کبھی) تہائی رات قیام کیا کرتے ہو۔ اور خدا تو رات اور دن کا اندازہ رکھتا ہے۔ اس نے معلوم کیا کہ تم اس کو نباہ نہ سکو گے تو اس نے تم پر مہربانی کی۔ پس جتنا آسانی سے ہوسکے (اتنا) قرآن پڑھ لیا کرو۔ اس نے جانا کہ تم میں بعض بیمار بھی ہوتے ہیں اور بعض خدا کے فضل (یعنی معاش) کی تلاش میں ملک میں سفر کرتے ہیں اور بعض خدا کی راہ میں لڑتے ہیں۔ تو جتنا آسانی سے ہوسکے اتنا پڑھ لیا کرو۔ اور نماز پڑھتے رہو اور زکوٰة ادا کرتے رہو اور خدا کو نیک (اور خلوص نیت سے) قرض دیتے رہو۔ اور جو عمل نیک تم اپنے لئے آگے بھیجو گے اس کو خدا کے ہاں بہتر اور صلے میں بزرگ تر پاؤ گے۔ اور خدا سے بخشش مانگتے رہو۔ بیشک خدا بخشنے والا مہربان ہے ہےo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 73:1": "Эй ўраниб ётувчи!",
                            "verse 73:2": "Кечани озгинасидан бошқасини (ибодатда) тик туриб ўтказ!",
                            "verse 73:3": "Ярмини ёки ундан бир оз қисқароғини.",
                            "verse 73:4": "Ёки у(ярим)га яна қўш ва Қуръонни тартил билан тиловат қил.",
                            "verse 73:5": "Албатта, Биз устингга оғир сўзни ташлармиз.",
                            "verse 73:6": "Албатта, кечасиги ибодат кўпроқ мувофиқ келадир ва қироати тўғрироқ бўладир.",
                            "verse 73:7": "Албатта, кундузи сенинг узоқ ишлашинг бор.",
                            "verse 73:8": "Ва Роббингнинг исмини зикр эт ва Унинг ибодатига бутунлай ажралиб чиқ.",
                            "verse 73:9": "У машриқу мағрибнинг Роббисидир.",
                            "verse 73:10": "Ва уларнинг гапларига сабр қил ва улардан чиройли четлашла, четлаб тур.",
                            "verse 73:11": "Аҳли неъмат бўлган, ёлғонга чиқарувчиларни Ўзимга қўйиб қўй ва уларга озгина муҳлат бер.",
                            "verse 73:12": "Албатта, Бизда оғир кишанлар ва жаҳаннам бор.",
                            "verse 73:13": "Ва (томоққа) тиқиладиган таом ва аламли азоб бор.",
                            "verse 73:14": "Бир кундаки, унда еру тоғлар ларзага келадир ва тоғлар оқувчи қумтепаларга айланадир.",
                            "verse 73:15": "Албатта, Биз сизларга, худди Фиръавнга Расул юборганимиздек, сиз ҳақингизда гувоҳлик берувчи Расулни юбордик.",
                            "verse 73:16": "Бас, Фиръавн Расулга осий бўлди ва Биз уни шиддатли азоб билан тутдик.",
                            "verse 73:17": "Агар кофир бўлсангиз, болаларнинг сочини оқартиб юборадиган кундан қандай сақланасиз?! («болаларнинг сочини оқартиб юборадиган кун»–қиёмат куни экани ҳаммага маълум.",
                            "verse 73:18": "Унда осмон парчаланувчидир, У зотнинг ваъдаси амалга ошадир.",
                            "verse 73:19": "Албатта, булар эслатмадир, Ким хоҳласа, ўз Робиси томон йўл оладир.",
                            "verse 73:20": "Албатта, Роббинг сени кечанинг учдан биридан озроғини, ё ярмини, ё учдан бирини қоим бўлиб ўтказаётганингни ва сен билан бирга бўлганлардан ҳам бир тоифа (шундоқ қилаётганларини) биладир."
                        }
                    }
                }
            }
        }
    }
}