{
    "id": 74,
    "name_simple": "Al-Muddaththir",
    "revelation_place": "makkah",
    "revelation_order": 4,
    "bismillah_pre": true,
    "verses_count": 56,
    "source": "Sayyid Abul Ala Maududi - Tafhim al-Qur'an - The Meaning of the Quran",
    "short_text": "The Surah takes its name from the word al-muddaththir in the first verse. This also is only a name, not a title of its subject matter.",
    "text": [
        "The Surah takes its name from the word al-muddaththir in the first verse. This also is only a name, not a title of its subject matter.",
        "Period of Revelation",
        "The first seven verses of this Surah belong to the earliest period at Makkah. Even according to some traditions which have been related in Bukhari, Muslim, Tirmidhi, Musnad Ahmad, etc., on the authority of Hadrat Jabir bin Abdullah, these are the very earliest verses of the Qur'an to be revealed to the Holy Prophet (upon whoa be peace). But the Muslim Ummah almost unanimously agreed that the earliest Revelation to the Holy Prophet (upon whom be peace) consisted of the first five verses of Surah Al-Alaq(XCVI). However, what is established by authentic traditions is that after this first Revelation, no Revelation came down to the Holy Prophet (upon whom be peace) for quite some time. Then, when it was resumed, it started with theme verses of Surah Al- Muddaththir. Imam Zuhri has given the following details of it:",
        "\"Revelation to the Holy Prophet remained suspended for quite some time, and it was such a period of deep grief and distress for him that he started going early to the tops of the mountains to throw himself down from them. But whenever he stood on the edge of a peak, the Angel Gabriel would appear and tell him that he was Allah's Prophet. This would console him and restore to him full peace of mind.\" (Ibn Jarir).",
        "After this Imam Zuhri relates the following tradition on the authority of Hadrat Jabir bin Abdullah:",
        "\"The Holy Messenger of Allah describing the period of falrat al-wahi (break in revelation) said: One day when I was passing on the way, I suddenly heard a call from heaven. I raised my head and saw that the same Angel who had visited me in the Cave of Hira was sitting on a throne between heaven and earth. This struck terror in my heart, and reaching home quickly, I said: 'Cover me up, cover me up'. So the people of the house covered me up with a quilt (or blanket). At that time Allah sent down the Revelation: Ya ayyuhal-Muddaththiru... From then on revelation became intense and continuous.\" (Bukhari, Muslim Musnad Ahmad, Ibn Jarir).",
        "The rest of the Surah (vv. 8-56) was revealed when the first Hajj season came after public preaching of Islam had begun in Makkah. This has been fully well described in the Sirah by Ibn Hisham and we shall cite it below.",
        "Theme and Subject Matter",
        "As has been explained above, the earliest Revelation to the Holy Prophet (upon whom be peace) consisted of the first five verses of Surah Al-Alaq, in which it had been Said: \"Read (O Prophet), in the name of your Lord, Who created: created man from a clot of congealed blood. Read: and your Lord is Most Generous, Who taught knowledge by the pen, taught man what he did not know.\"",
        "This was the first experience of Revelation met with suddenly by the Holy Prophet (upon whom be peace). in this message it was not told what great mission he had been entrusted with and what duties he had to perk form in future. He was only initiated into it and then left alone for a time so that the great strain this experience had caused should pass away and he should mentally become prepared to receive the Revelation and perform the prophetic mission in the future. After this intermission when Revelation Was resumed, the first seven verses of this Surah Were revealed:In these he Was for the first time commanded to arise and warn the people of the consequences of the way of life they were following and to proclaim the greatness of God in the world where others were being magnified without any right. Along with that he was given this instruction: The demand of the Unique mission that you have to perform, now is that your life should be pure in every respect and you should carry out the duty of reforming your people sincerely irrespective of any worldly gain. Then, in the last sentence, he was exhorted to endure with patience, for the sake of his Lord, all the hardships and troubles that he might have to face while performing his mission.",
        "In the implementation of this Divine Command when the Holy Messenger of Allah began to preach Islam and recite the Qur'anic Surahs revealed successively, the people of Makkah felt alarmed, and it provoked a great storm of opposition and hostility. A few months passed in this state until the Hajj season approached. The people of Makkah feared that if Muhammad (upon whom be Allah's peace) started visiting the caravans of the pilgrims coming from all over Arabia at their halting places and reciting the spell binding and unique Revelations of the Qur'an in their assemblies on the occasion of Hajj, his message would reach every part of Arabia and influence countless people. Therefore, the Quraish chiefs held a conference and settled that they would start a propaganda campaign against the Holy Prophet (upon whom be peace) among the pilgrims as soon as they arrived.",
        "After they had agreed on this, Walid bin al-Mughirah said to the assembled people: \"If you said contradictory things about Muhammad (upon whom be Allah's peace and blessings), we all would lose our trust among the people. Therefore, let us agree upon one opinion, which we should all say without dispute.",
        "Some people said that they would call Muhammad (upon whom be Allah's peace and blessings) a soothsayer. Walid said: “No, by God, be is not a soothsayer. We have seen the soothsayers: what they murmur and what they utter has no remote resemblance with the Qur'an.”",
        "Some other people said: “Then we say he is possessed.” Walid said: He is not a possessed one: we have seen mad and insane people; the way one talks disjointedly and behaves foolishly in that state is known to all: who would believe that what Muhammad (upon whom be peace) presented was the incoherent speech of a madman?”",
        "The people said: “Then we say he is a poet.” Walid said: “No, he is not a poet, for we know poetry in all its forms, and what he presents conforms to no form of it.”",
        "The people said: “Then he is a sorcerer.” Walid said: “He is no sorcerer either: we have seen sorcerers and we also know what methods they adopt for their sorcery. This also does not apply to Muhammad.”",
        "Then he said: \"Whichever of these things you said about Muhammad, it would be known to be a false accusation. By God, his speech is sweet, his root is deep and his branches are fruitful.” At this Abu Jahl urging on Walid said: “Your people will never be pleased with you unless you say something about Muhammad.” He said: “Let me think over it awhile.”",
        "Then, after prolonged thought and consideration, he said: “The nearest thing to the truth is that you tell the Arabs that he is a sorcerer, who has brought a message by which he separates a man from his father; and from his brother, and from his wife and children, and from his family.” They all agreed on what Walid had proposed.",
        "Then, according to a scheme the men of Quraish spread among the pilgrims in the Hajj season and they warned everyone they met of the sorcery of Muhammad (upon whom be peace) and of his stirring up divisions in the families by it.\" But the result was that by their this plan the Quraish chiefs themselves made the name of the Holy Messenger known throughout Arabia. (Ibn Hisham, pp. 288-289. That Walid had made this proposal on the insistence of Abu Jahl has been related by Ibn Jarir in his Tafsir on the authority of Ikrimah).",
        "This same event has been reviewed and commented upon in the second section of this Surah. The sequence of its contents is as follows:",
        "In vv. 8-10 the deniers of Truth have been warned, saying: \"You will see the evil result of what you are doing today on the Resurrection Day.\"",
        "In vv. 11-26, without naming Walid bin al-Mughirah, it has been told how Allah had blessed him and how inimical he proved to be to true Faith. In this connection, his mental conflict has been portrayed, telling that, on the one hand, he was fully convinced of the truth of Muhammad (upon whom be Allah's peace and blessings) and the Qur'an, but, on the other, he did not want to risk his leadership and position among his people. Therefore, not only he did not believe himself but after a long-drawn-out conflict with his conscience he also came out with the proposal that in order to restrain the people from believing the Qur'an should be branded as magic. After exposing his evil nature, it has been said: \"Notwithstanding such evil inclinations and misdeeds, this person desires that he should be further blessed, whereas he has now become worthy of Hell, and never of further blessings.\"",
        "In vv. 27-48, the dreadfulness of Hell has been depicted and it has been explained as to people of what character and morals really deserve it.",
        "In vv. 49-53, the root cause of the disbelievers' aversion has been pointed out, saying: \"Since they are fearless of the Hereafter, and look upon this worldly life as an end in itself, they flee from the Qur'an as though they were wild asses fleeing away from the lion: therefore, they propose unreasonable conditions for believing, whereas even if each and every condition of theirs was fulfilled, they could not advance even an inch on the way of Faith with their denial of the Hereafter.\"",
        "In conclusion, it has been explicitly stated: Allah does not stand in need of anybody's faith that He may fulfill his conditions. The Qur'an is an admonition that has been presented before the people openly; now whoever wills may accept it. Allah has a right that the people should fear His disobedience and He alone has the power to forgive the one who adopts piety and an attitude of God consciousness even though one may have committed many acts of disobedience in the past."
    ],
    "description": "The surah that opens by addressing the enwrapped Prophet as the Shrouded Messenger. It takes its name from the word “wrapped in mantle” (muddaththir) in verse 1. The first verses of this surah (verse 1 .) were revealed after one of the Prophets first encounter with the Angel of Revelation in the Cave of Ḥirāʾ. The surah goes on, in a section from a later period, to remind the obstinate disbelievers of their fate on the Day of Judgement (verse 8 .) and a specific opponent of the Prophet is singled out (verse 11 .). The end of the surah (verse 39 .) exposes the foolishness of the disbelievers” attitude to the Revelation and the Day of Resurrection.The surah is also known as: The Cloaked One, The Enfolded, The Enfolded One, The Enveloped, The Man Wearing a Cloak, The Mantled Messenger, Wrapped in his Cloak.",
    "name_translation": "SHROUDED",
    "name_complex": "Al-Muddaththir",
    "surah_name_ar": "المدثر",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 74:1": "O ti, i mbuluar (Muhammed)!",
                            "verse 74:2": "Cou dhe lajmëroi!",
                            "verse 74:3": "Dhe Zotin tënd madhëroje!",
                            "verse 74:4": "Dhe petkat tuaja pastroji!",
                            "verse 74:5": "Dhe largoju (veprave) të këqia!",
                            "verse 74:6": "Dhe mos ndajë me qëllim që të marrësh më shumë!",
                            "verse 74:7": "Dhe për hir të Zotit tënd, duro",
                            "verse 74:8": "e, kur të fryhet në buri –",
                            "verse 74:9": "do të jetë ato ditë e rëndë,",
                            "verse 74:10": "për jobesimtarët nuk do të jetë e lehtë.",
                            "verse 74:11": "Lemëni Mua dhe atë që e kam krijuar Unë, vet,",
                            "verse 74:12": "dhe i kam dhënë pasuri kolosale,",
                            "verse 74:13": "dhe djemtë që i ka të pranishëm,",
                            "verse 74:14": "dhe nderë e prestigj i kam dhuruar",
                            "verse 74:15": "dhe përpos kësaj - dëshiron, që Unë t’ia zmadhojë (të mirat)!",
                            "verse 74:16": "Jo, kurrsesi! Me të vërtetë, ai është mohues kryeneç i ajeteve Tona;",
                            "verse 74:17": "e Unë do ta ngarkojë atë me dënime të rënda,",
                            "verse 74:18": "sepse, ka paramenduar dhe ka kurdisur (kundër Kur’anit), -",
                            "verse 74:19": "dhe, qoftë mallkuar, si e ka kurdisur!",
                            "verse 74:20": "dhe sërish – edhe njëherë, qoftë mallkuar, si e ka kurdisur! –",
                            "verse 74:21": "Pastaj ka shikuar",
                            "verse 74:22": "e, u vrejt dhe iu mrrol (fytyra)",
                            "verse 74:23": "dhe u kthye (nga mendimi i drejtë) dhe u kapardis,",
                            "verse 74:24": "dhe tha: “Ky (Kur’ani) nuk është gjë tjetër, përpos magji trashëguese,",
                            "verse 74:25": "këto janë vetëm fjalë njeriu!”",
                            "verse 74:26": "Do ta hudhi (dënojë) në Sekar (Skëterrë) –",
                            "verse 74:27": "e kush të shpjegon ty se çka është Sekari?",
                            "verse 74:28": "Ai nuk lë gjë dhe i përfshinë të gjithë (i djegë)",
                            "verse 74:29": "lëkurat iu bënë të zeza (nga të djegurit)",
                            "verse 74:30": "mbikëqyrës të tij (Skëterrës) janë nëntëmbëdhjetë (engjëj).",
                            "verse 74:31": "Na, kemi bërë rojtarë të zjarrit (engjëj) dhe kemi caktuar numrin e tyre, vetëm për t’i provuar jobesimtarët; për ‘tu bindur njerëzit, të cilëve, u është dhënë Libri, që t’u shtohet (forcohet) besimi atyre që besojnë, e mos të dyshojnë, ata, të cilëve u është dhënë Libri, - dhe për të thënë ata që janë zemërkëqinj (hipokrit) dhe jobesimtarë: “C’ka dashur Zoti (të tregojë) me këtë shembull?” Kështu, Perëndia i lë në hutim (dhe në humbje) ata që do, dhe në rrugë të drejtë e udhëzon atë që don.",
                            "verse 74:32": "Kurrsesi! Betohem në Hënën",
                            "verse 74:33": "dhe në natën që largohet,",
                            "verse 74:34": "e mëngjesin që zbardhëllon, -",
                            "verse 74:35": "ajo (skëterra), me të vërtetë, është njëra nga fatkeqësitë më të mëdha,",
                            "verse 74:36": "kjo është si këshillim –",
                            "verse 74:37": "për ata nga ju që dëshirojnë të bëjnë mirë ose të abstenojnë (në këtë)!",
                            "verse 74:38": "Cdo njeri është peng (përgjegjës) për veprat e veta,",
                            "verse 74:39": "përveç fatlumëve;",
                            "verse 74:40": "të cilët në kopshtijet e xhenneti i pyesin fajtorët:",
                            "verse 74:41": "-",
                            "verse 74:42": "“Cka u ka sjellë juve në Sekar (Skëterrë)?”",
                            "verse 74:43": "Ata do të përgjigjen: “Nuk kemi qenë nga ata që kanë bërë namaz",
                            "verse 74:44": "dhe prej atyre që i kanë ushqyer të varfërit",
                            "verse 74:45": "dhe jemi lëshuar në biseda të kota me djerraditësit (badihavxhinjtë),",
                            "verse 74:46": "dhe kemi përgënjeshtruar Ditën e Kijametit,",
                            "verse 74:47": "përderisa nuk na erdhi vdekja”.",
                            "verse 74:48": "Kurrfarë ndërmjetësimi i ndërmjetësuesve nuk do t’u ndihmojë atyre.",
                            "verse 74:49": "E, përse shmangën ata nga këshillimi,",
                            "verse 74:50": "thua se janë gomarë të egër,",
                            "verse 74:51": "të frikësuar, që kanë ikur prej luanit.",
                            "verse 74:52": "Po! Cdonjëri nga ata do të kërkojë që t’i jepet rregjistri i qartë (nga Zoti).",
                            "verse 74:53": "Kurrsesi, pasi që ata nuk i frikohen Ditës së Kijametit!",
                            "verse 74:54": "Ai (Kur’ani), në të vërtetë, është këshillë,",
                            "verse 74:55": "dhe kush të dojë, le ta pranojë,",
                            "verse 74:56": "e këshillohen vetëm ata që do Perëndia; Ai është i vetmi të cilit duhet t’i druajmë dhe Ai është i vetmi falës."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "Ey (libasına) bürünüb sarınan (Peyğəmbər)!",
                            "verse 74:2": "Qalx (qövmünü Allahın əzabı ilə) qorxut!",
                            "verse 74:3": "?z Rəbbini uca tut!",
                            "verse 74:4": "Libasını təmizlə! (Nəfsini günahlardan pak et!)",
                            "verse 74:5": "(Əzaba səbəb olacaq) pis şeylərdən uzaqlaş! (Bütləri tərk et!)",
                            "verse 74:6": "(Etdiyin yaxşılığı) çox bilib başa qalxma! (Heç kəsə minnət qoyma!)",
                            "verse 74:7": "Rəbbinin yolunda (Rəbbinin rizasını qazanmaq üçün bu yolda sənə üz verəcək bütün çətinliklərə) səbr et!",
                            "verse 74:8": "Elə ki, sur çalındı,",
                            "verse 74:9": "O gün çox ağır bir gün olacaqdır;",
                            "verse 74:10": "(O gün) kafirlər üçün asan olmayacaqdır!",
                            "verse 74:11": "(Ya Peyğəmbər!) Məni ?z yaratdığım kimsə ilə tək burax! (Vəlid ibn Müğirə kimi kafirin cəzasını yalnız Mənə tapşır!)",
                            "verse 74:12": "Mən ona bollu mal-dövlət əta etdim;",
                            "verse 74:13": "Yanında hazır duran oğullar (verdim);",
                            "verse 74:14": "Ona (hər şeyi) artıqlaması ilə müyəssər etdim (sərvət və mənsəbi ayağının altına döşədim).",
                            "verse 74:15": "(Bütün bunlardan) sonra yenə də (var-dövlətini) artırmağımı istəyir.",
                            "verse 74:16": "Xeyr (bu ola bilməz).",
                            "verse 74:17": "Mən onu məşəqqətli bir əzaba düçar edəcəyəm!",
                            "verse 74:18": "O (Qur'an barəsində) fikirləşdi və (orada deyilənləri öz ürəyində) ölçdü-biçdi.",
                            "verse 74:19": "?lüm olsun ona! Necə ölçdü-biçdi?! (Peyğəmbərə sehrbaz dedi).",
                            "verse 74:20": "Yenə də ölüm olsun ona! Necə ölçdü-biçdi?!",
                            "verse 74:21": "Sonra (qövmünün üzünə) baxdı.",
                            "verse 74:22": "Sonra üz-gözünü turşutdu, qaşqabağını tökdü.",
                            "verse 74:23": "Sonra da (imandan) üz çevirdi, (Peyğəmbərə tabe olmağa) təkəbbür göstərdi.",
                            "verse 74:24": "Və dedi: \"Bu (sehrbazlardan) öyrənilən sehrdən başqa bir şey deyildir!",
                            "verse 74:25": "Bu yalnız bəşər sözüdür!\"",
                            "verse 74:26": "Biz onu Səqərə atacağıq (orada yandıracağıq).",
                            "verse 74:27": "(Ya Peyğəmbər!) Sən nə bilirsən (haradan bilirsən) ki, nədir Səqər!",
                            "verse 74:28": "O (heç kəsi sağ) qoymaz və (salamat) buraxmaz!",
                            "verse 74:29": "İnsanı yandırıb-yaxar!",
                            "verse 74:30": "Onun üstündə on doqquz (nəfər gözətçi mələk) vardır.",
                            "verse 74:31": "Biz cəhənnəm gözətçilərini yalnız mələklərdən etdik.",
                            "verse 74:32": "Xeyr! (İş heç də bu müşriklərin zənn etdiyi kimi deyildir).",
                            "verse 74:33": "Dönüb-qayıdan (yaxud gündüzün dalınca gələn) gecəyə",
                            "verse 74:34": "Və sökülməkdə olan dan yerinə ki,",
                            "verse 74:35": "(Cəhənnəm) böyük bəlalardan biridir!",
                            "verse 74:36": "(O, Allahın əzabı ilə) qorxudur insanları -",
                            "verse 74:37": "Sizdən (yaxşı işlərdə) irəli düşmək, yaxud geri qalmaq istəyənləri!",
                            "verse 74:38": "Hər kəs öz əməlinin girovudur! (Hərə öz əməlinin əvəzini alacaqdır!)",
                            "verse 74:39": "Sağ tərəf sahibləri (əməl dəftərləri sağ əllərinə verilənlər) istisna olmaqla!",
                            "verse 74:40": "Onlar cənnətlərdədirlər; bir-birindən soruşacaqlar;",
                            "verse 74:41": "Günahkarlar barəsində (və sonra həmin günahkarlara müraciət edib belə deyəcəklər):",
                            "verse 74:42": "\"Sizi Səqərə (Cəhənnəmə) salan nədir?\"",
                            "verse 74:43": "Onlar deyəcəklər: \"Biz namaz qılanlardan deyildik;",
                            "verse 74:44": "Yoxsulu da yedirtməzdik;",
                            "verse 74:45": "Batilə dalanlarla birlikdə biz də dalardıq;",
                            "verse 74:46": "Haqq-hesab gününü yalan sayardıq.",
                            "verse 74:47": "?lüm bizi haqlayana qədər (bu vəziyyətdə qaldıq)\".",
                            "verse 74:48": "Şəfaət edənlərin şəfaəti onlara fayda verməz!",
                            "verse 74:49": "Onlara nə olub ki, öyüd-nəsihətdən üz çevirirlər (qaçırlar).",
                            "verse 74:50": "Onlar sanki vəhşi eşşəklərdir.",
                            "verse 74:51": "(O eşşəklər ki) aslandan hürküb qaçarlar!",
                            "verse 74:52": "Xeyr, onların hər biri özünə (göydən) nazil olmuş səhifələr verilməsini istəyər.",
                            "verse 74:53": "Xeyr, daha doğrusu, onlar axirətdən qorxmazlar!",
                            "verse 74:54": "Xeyr, bu (Qur'an) bir öyüd-nəsihətdir!",
                            "verse 74:55": "İstəyənlər ondan öyüd alar.",
                            "verse 74:56": "Bununla belə, Allah istəməsə, onlar əsla öyüd ala bilməzlər."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "O ti, pokriveni!",
                            "verse 74:2": "Ustani i opominji!",
                            "verse 74:3": "I Gospodara svoga veličaj!",
                            "verse 74:4": "I haljine svoje očisti!",
                            "verse 74:5": "I kumira se kloni!",
                            "verse 74:6": "I ne prigovaraj držeći da je mnogo!",
                            "verse 74:7": "I radi Gospodara svoga trpi!",
                            "verse 74:8": "A kada se u Rog puhne -",
                            "verse 74:9": "biće to naporan dan",
                            "verse 74:10": "nevjernicima, neće biti lagahan.",
                            "verse 74:11": "Meni ostavi onoga koga sam ja izuzetkom učinio",
                            "verse 74:12": "i bogatstvo mu ogromno dao",
                            "verse 74:13": "i sinove koji su s njim",
                            "verse 74:14": "i čast i ugled mu pružio -",
                            "verse 74:15": "i još žudi da uvećam!",
                            "verse 74:16": "Nikako! On, doista, prkosi ajetima našim, -",
                            "verse 74:17": "a naprtiću Ja njemu teškoće,",
                            "verse 74:18": "jer je smišljao i računao -",
                            "verse 74:19": "i, proklet bio, kako je proračunao!",
                            "verse 74:20": "i još jednom, proklet bio, kako je proračunao! -",
                            "verse 74:21": "Zatim je pogledao",
                            "verse 74:22": "pa se onda smrknuo i namrštio",
                            "verse 74:23": "i potom se okrenuo i uzoholio,",
                            "verse 74:24": "i rekao:\"Ovo nije ništa drugo do vradžbina koja se nasljeđuje,",
                            "verse 74:25": "ovo su samo čovjekove riječi!\"",
                            "verse 74:26": "U Sekar",
                            "verse 74:27": "a znaš li ti šta je Sekar?",
                            "verse 74:28": "Ništa on neće poštedjeti,",
                            "verse 74:29": "kože će crnim učiniti,",
                            "verse 74:30": "nad njim su devetnaesterica.",
                            "verse 74:31": "Mi smo čuvarima vatre meleke postavili i odredili broj njihov kao iskušenje onima koji ne vjeruju, da se oni kojima je Knjiga data uvjere, i da se onima koji vjeruju vjerovanje učvrsti, i da onima kojima je Knjiga data i oni koji su vjernic",
                            "verse 74:32": "I tako Mi Mjeseca,",
                            "verse 74:33": "i noći kada mine,",
                            "verse 74:34": "i zore kada svane -",
                            "verse 74:35": "on je, zaista, najveća nevolja,",
                            "verse 74:36": "ljudima je opomena -",
                            "verse 74:37": "onome između vas koji želi učiniti dobro ili onome koji ne želi!",
                            "verse 74:38": "Svaki čovjek je odgovoran za ono što je radio,",
                            "verse 74:39": "osim sretnika,",
                            "verse 74:40": "oni će se u džennetskim baščama raspitivati",
                            "verse 74:41": "o nevjernicima:",
                            "verse 74:42": "Šta vas je u Sekar dovelo?",
                            "verse 74:43": "Nismo - reći će - \"bili od onih koji su molitvu obavljali",
                            "verse 74:44": "i od onih koji su siromahe hranili,",
                            "verse 74:45": "i u besposlice smo se sa besposlenjacima upuštali,",
                            "verse 74:46": "i Sudnji dan smo poricali,",
                            "verse 74:47": "sve dok nam smrt nije došla.",
                            "verse 74:48": "Njima posredovanje posrednika neće biti od koristi.",
                            "verse 74:49": "Pa zašto oni pouku izbjegavaju,",
                            "verse 74:50": "kao da su divlji magarci preplašeni",
                            "verse 74:51": "koji od onih koji ih progone bježe.",
                            "verse 74:52": "Da! Svaki čovjek bi od njih htio da mu se daju listovi rašireni.",
                            "verse 74:53": "Nikada, jer oni se onoga svijeta ne plaše!",
                            "verse 74:54": "Uistinu! Kur’an je pouka,",
                            "verse 74:55": "i ko hoće, na umu će ga imati,",
                            "verse 74:56": "a na umu će ga imati samo ako Allah bude htio, On je jedini dostojan da Ga se boje i On jedini prašta."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "হে চাদরাবৃত!",
                            "verse 74:2": "উঠুন, সতর্ক করুন,",
                            "verse 74:3": "আপন পালনকর্তার মাহাত্ম্য ঘোষনা করুন,",
                            "verse 74:4": "আপন পোশাক পবিত্র করুন",
                            "verse 74:5": "এবং অপবিত্রতা থেকে দূরে থাকুন।",
                            "verse 74:6": "অধিক প্রতিদানের আশায় অন্যকে কিছু দিবেন না।",
                            "verse 74:7": "এবং আপনার পালনকর্তার উদ্দেশে সবর করুন।",
                            "verse 74:8": "যেদিন শিংগায় ফুঁক দেয়া হবে;",
                            "verse 74:9": "সেদিন হবে কঠিন দিন,",
                            "verse 74:10": "কাফেরদের জন্যে এটা সহজ নয়।",
                            "verse 74:11": "যাকে আমি অনন্য করে সৃষ্টি করেছি, তাকে আমার হাতে ছেড়ে দিন।",
                            "verse 74:12": "আমি তাকে বিপুল ধন-সম্পদ দিয়েছি।",
                            "verse 74:13": "এবং সদা সংগী পুত্রবর্গ দিয়েছি,",
                            "verse 74:14": "এবং তাকে খুব সচ্ছলতা দিয়েছি।",
                            "verse 74:15": "এরপরও সে আশা করে যে, আমি তাকে আরও বেশী দেই।",
                            "verse 74:16": "কখনই নয়! সে আমার নিদর্শনসমূহের বিরুদ্ধাচরণকারী।",
                            "verse 74:17": "আমি সত্ত্বরই তাকে শাস্তির পাহাড়ে আরোহণ করাব।",
                            "verse 74:18": "সে চিন্তা করেছে এবং মনঃস্থির করেছে,",
                            "verse 74:19": "ধ্বংস হোক সে, কিরূপে সে মনঃস্থির করেছে!",
                            "verse 74:20": "আবার ধ্বংস হোক সে, কিরূপে সে মনঃস্থির করেছে!",
                            "verse 74:21": "সে আবার দৃষ্টিপাত করেছে,",
                            "verse 74:22": "অতঃপর সে ভ্রূকুঞ্চিত করেছে ও মুখ বিকৃত করেছে,",
                            "verse 74:23": "অতঃপর পৃষ্ঠপ্রদশন করেছে ও অহংকার করেছে।",
                            "verse 74:24": "এরপর বলেছেঃ এতো লোক পরস্পরায় প্রাপ্ত জাদু বৈ নয়,",
                            "verse 74:25": "এতো মানুষের উক্তি বৈ নয়।",
                            "verse 74:26": "আমি তাকে দাখিল করব অগ্নিতে।",
                            "verse 74:27": "আপনি কি বুঝলেন অগ্নি কি?",
                            "verse 74:28": "এটা অক্ষত রাখবে না এবং ছাড়বেও না।",
                            "verse 74:29": "মানুষকে দগ্ধ করবে।",
                            "verse 74:30": "এর উপর নিয়োজিত আছে উনিশ (ফেরেশতা)।",
                            "verse 74:31": "আমি জাহান্নামের তত্ত্বাবধায়ক ফেরেশতাই রেখেছি। আমি কাফেরদেরকে পরীক্ষা করার জন্যেই তার এই সংখ্যা করেছি-যাতে কিতাবীরা দৃঢ়বিশ্বাসী হয়, মুমিনদের ঈমান বৃদ্ধি পায় এবং কিতাবীরা ও মুমিনগণ সন্দেহ পোষণ না করে এবং যাতে যাদের অন্তরে রোগ আছে, তারা এবং কাফেররা বলে যে, আল্লাহ এর দ্বারা কি বোঝাতে চেয়েছেন। এমনিভাবে আল্লাহ যাকে ইচ্ছা পথভ্রষ্ট করেন এবং যাকে ইচ্ছা সৎপথে চালান। আপনার পালনকর্তার বাহিনী সম্পর্কে একমাত্র তিনিই জানেন এটা তো মানুষের জন্যে উপদেশ বৈ নয়।",
                            "verse 74:32": "কখনই নয়। চন্দ্রের শপথ,",
                            "verse 74:33": "শপথ রাত্রির যখন তার অবসান হয়,",
                            "verse 74:34": "শপথ প্রভাতকালের যখন তা আলোকোদ্ভাসিত হয়,",
                            "verse 74:35": "নিশ্চয় জাহান্নাম গুরুতর বিপদসমূহের অন্যতম,",
                            "verse 74:36": "মানুষের জন্যে সতর্ককারী।",
                            "verse 74:37": "তোমাদের মধ্যে যে সামনে অগ্রসর হয় অথবা পশ্চাতে থাকে।",
                            "verse 74:38": "প্রত্যেক ব্যক্তি তার কৃতকর্মের জন্য দায়ী;",
                            "verse 74:39": "কিন্তু ডানদিকস্থরা,",
                            "verse 74:40": "তারা থাকবে জান্নাতে এবং পরস্পরে জিজ্ঞাসাবাদ করবে।",
                            "verse 74:41": "অপরাধীদের সম্পর্কে",
                            "verse 74:42": "বলবেঃ তোমাদেরকে কিসে জাহান্নামে নীত করেছে?",
                            "verse 74:43": "তারা বলবেঃ আমরা নামায পড়তাম না,",
                            "verse 74:44": "অভাবগ্রস্তকে আহার্য্য দিতাম না,",
                            "verse 74:45": "আমরা সমালোচকদের সাথে সমালোচনা করতাম।",
                            "verse 74:46": "এবং আমরা প্রতিফল দিবসকে অস্বীকার করতাম।",
                            "verse 74:47": "আমাদের মৃত্যু পর্যন্ত।",
                            "verse 74:48": "অতএব, সুপারিশকারীদের সুপারিশ তাদের কোন উপকারে আসবে না।",
                            "verse 74:49": "তাদের কি হল যে, তারা উপদেশ থেকে মুখ ফিরিয়ে নেয়?",
                            "verse 74:50": "যেন তারা ইতস্ততঃ বিক্ষিপ্ত গর্দভ।",
                            "verse 74:51": "হট্টগোলের কারণে পলায়নপর।",
                            "verse 74:52": "বরং তাদের প্রত্যেকেই চায় তাদের প্রত্যেককে একটি উম্মুক্ত গ্রন্থ দেয়া হোক।",
                            "verse 74:53": "কখনও না, বরং তারা পরকালকে ভয় করে না।",
                            "verse 74:54": "কখনও না, এটা তো উপদেশ মাত্র।",
                            "verse 74:55": "অতএব, যার ইচ্ছা, সে একে স্মরণ করুক।",
                            "verse 74:56": "তারা স্মরণ করবে না, কিন্তু যদি আল্লাহ চান। তিনিই ভয়ের যোগ্য এবং ক্ষমার অধিকারী। করুক।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 74:1": "О, ти, който се обвиваш [в своите одежди],",
                            "verse 74:2": "стани и предупреждавай,",
                            "verse 74:3": "и твоя Господ възвеличавай,",
                            "verse 74:4": "и дрехите си почиствай,",
                            "verse 74:5": "и скверността отбягвай,",
                            "verse 74:6": "и давайки, не се стреми да получиш вповече,",
                            "verse 74:7": "и в името на твоя Господ бъди търпелив!",
                            "verse 74:8": "И когато се протръби с Рога,",
                            "verse 74:9": "тогава този Ден ще е тежък Ден,",
                            "verse 74:10": "за неверниците - нелек.",
                            "verse 74:11": "Остави на Мен онзи, когото сътворих самотен",
                            "verse 74:12": "и комуто отредих голямо богатство,",
                            "verse 74:13": "и синове до него,",
                            "verse 74:14": "и всичко му улесних!",
                            "verse 74:15": "А после той ламти да му надбавя.",
                            "verse 74:16": "Ала не! Пред Нашите знамения той упорства.",
                            "verse 74:17": "Ще го подложа на непоносимо мъчение.",
                            "verse 74:18": "Размисли той и прецени,",
                            "verse 74:19": "и - проклет да е! - как прецени!",
                            "verse 74:20": "И отново - проклет да е! - как прецени!",
                            "verse 74:21": "После погледна.",
                            "verse 74:22": "После се намръщи и навъси.",
                            "verse 74:23": "После се отвърна и се възгордя.",
                            "verse 74:24": "И рече: Това е само разпространена магия.",
                            "verse 74:25": "Това е само хорска реч.",
                            "verse 74:26": "Ще го пека Аз в Преизподнята.",
                            "verse 74:27": "И откъде да знаеш ти какво е Преизподнята?",
                            "verse 74:28": "Тя нищо не оставя и не пощадява -",
                            "verse 74:29": "обгаря кожата.",
                            "verse 74:30": "Пазят я деветнадесет .",
                            "verse 74:31": "И сторихме пазители на Огъня само ангели, и сторихме броя им единствено за изпитание на неверниците, за да се убедят дарените с Писанието и да се усили вярата на повярвалите, и да не се съмняват дарените с Писанието и вярващите, и за да кажат онези, в чии",
                            "verse 74:32": "Ала не! Кълна се в луната",
                            "verse 74:33": "и в нощта, когато отминава,",
                            "verse 74:34": "и в утрото, когато засиява!",
                            "verse 74:35": "Този",
                            "verse 74:36": "е едно от великите изпитания",
                            "verse 74:37": "предупреждение за хората,",
                            "verse 74:38": "за всеки от вас, който пожелае да напредва или да изостава.",
                            "verse 74:39": "Всеки е заложник на онова, което е придобил,",
                            "verse 74:40": "освен владелците на десницата.",
                            "verse 74:41": "В градини те ще разпитват",
                            "verse 74:42": "за престъпниците.",
                            "verse 74:43": "Какво ви отведе в Преизподнята?",
                            "verse 74:44": "Ще рекат: Ние не бяхме сред отслужващите молитвата",
                            "verse 74:45": "и не хранехме нуждаещия се,",
                            "verse 74:46": "и затъвахме в празнословие със затъващите,",
                            "verse 74:47": "и взимахме за лъжа Съдния ден,",
                            "verse 74:48": "докато ни застигна смъртта.",
                            "verse 74:49": "Затова не ще им помогне ничие застъпничество.",
                            "verse 74:50": "Какво им е, защо се отдръпват от напомнянето,",
                            "verse 74:51": "сякаш са подплашени диви магарета,",
                            "verse 74:52": "бягащи от лъв?",
                            "verse 74:53": "И всеки от тях иска да му се даде разясняващата книга.",
                            "verse 74:54": "Ала не! Те не се страхуват от отвъдния живот.",
                            "verse 74:55": "Ала не! Той [- Коранът] е поучение.",
                            "verse 74:56": "И който пожелае, ще се поучи.",
                            "verse 74:57": "И не се поучават, без Аллах да пожелае."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "蓋被的人啊！",
                            "verse 74:2": "你應當起來，你應當警告，",
                            "verse 74:3": "你應當頌揚你的主宰，",
                            "verse 74:4": "你應當洗滌你的衣服，",
                            "verse 74:5": "你應當遠離污穢，",
                            "verse 74:6": "你不要施恩而求厚報，",
                            "verse 74:7": "你應當為你的主而堅忍。",
                            "verse 74:8": "當號角被吹嚮的時候，",
                            "verse 74:9": "在那時，將有一個艱難的日子。",
                            "verse 74:10": "那個日子對不信道的人們，是不容易渡過的。",
                            "verse 74:11": "你讓我獨自處治我所創造的那個人吧！",
                            "verse 74:12": "我賞賜他豐富的財產，",
                            "verse 74:13": "和在跟前的子嗣，",
                            "verse 74:14": "我提高了他的聲望，",
                            "verse 74:15": "而他還冀望我再多加賞賜。",
                            "verse 74:16": "絕不然，他確實是反對我的跡象的，",
                            "verse 74:17": "我將使他遭受苦難。",
                            "verse 74:18": "他碓已思考，確已計劃。",
                            "verse 74:19": "但無論他怎樣計劃，他是被棄絕的。",
                            "verse 74:20": "無論他怎樣計劃，他終是被棄絕的。",
                            "verse 74:21": "他看一看，",
                            "verse 74:22": "然後皺眉蹙額，",
                            "verse 74:23": "然後高傲地轉過身去，",
                            "verse 74:24": "而且說：「這只是傳習的魔術，",
                            "verse 74:25": "這只是凡人的言辭。」",
                            "verse 74:26": "我將使他墮入火獄，",
                            "verse 74:27": "你怎能知道火獄是什麼？",
                            "verse 74:28": "它不讓任何物存在，不許任何物留下，",
                            "verse 74:29": "它燒灼肌膚。",
                            "verse 74:30": "管理它的，共計十九名。",
                            "verse 74:31": "我只將管理火獄的成天神，我只以他們的數目，考驗不信道的人們，以便曾受天經的人們認清，而信道的人們更加篤信；以免曾受天經的人們和信道的人們懷疑；以便心中有病者和不信道者說：「真主設這個譬喻做什麼？」真主這樣使他所意欲的人誤入迷途，使他所意欲的人遵循正路。只有你的主，能知道他的軍隊，這只是人類的教訓。",
                            "verse 74:32": "真的，以月亮盟誓，",
                            "verse 74:33": "以逝去的黑夜盟誓，",
                            "verse 74:34": "以顯照的黎明盟誓，",
                            "verse 74:35": "火獄確是一個大難，",
                            "verse 74:36": "可以警告人類，",
                            "verse 74:37": "警告你們中欲前進者或欲後退者；",
                            "verse 74:38": "各人將因自己的營謀而作抵押，",
                            "verse 74:39": "惟幸福的人們除外。",
                            "verse 74:40": "他們在樂園中互相詢問，",
                            "verse 74:41": "問犯罪人們的情狀，",
                            "verse 74:42": "「你們為什麼墮入火獄呢？」",
                            "verse 74:43": "他們說：「我們沒有禮拜，",
                            "verse 74:44": "也沒有濟貧，",
                            "verse 74:45": "我們與妄言的人們一道妄言，",
                            "verse 74:46": "我們否認報應日，",
                            "verse 74:47": "一直到死亡降臨了我們。」",
                            "verse 74:48": "說情者的說情，將無益於他們。",
                            "verse 74:49": "他們怎麼退避這教訓呢？",
                            "verse 74:50": "他們好像一群驚慌的驢子，",
                            "verse 74:51": "剛逃避了一隻獅子一樣。",
                            "verse 74:52": "不然，他們中的每個人都希望獲得一些展開的天經。",
                            "verse 74:53": "絕不然，他們不畏懼後世！",
                            "verse 74:54": "真的，這《古蘭經》確是一個教誨！",
                            "verse 74:55": "誰願意，誰記憶它，",
                            "verse 74:56": "他們只因真主的意欲而記憶它。他是應受敬畏的，他是宜於赦宥的。 誰願意，誰記憶它，"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "Ty rouchem přikrytý!",
                            "verse 74:2": "Vstaň a varuj,",
                            "verse 74:3": "Pána svého oslavuj,",
                            "verse 74:4": "svůj oděv očišťuj,",
                            "verse 74:5": "hněvu Božího se varuj,",
                            "verse 74:6": "kvůli rozmnožování zisku neuštědřuj",
                            "verse 74:7": "a při Pánu svém trpělivě stůj!",
                            "verse 74:8": "Až zatroubeno bude pozounem,",
                            "verse 74:9": "ten den bude věru těžkým dnem,",
                            "verse 74:10": "pro nevěřící nelehkým břemenem.",
                            "verse 74:11": "Nech Mne s tím, jehož jsem Já jediný stvořil,",
                            "verse 74:12": "jemuž jsem majetek rozsáhlý daroval",
                            "verse 74:13": "a syny zde přítomné uštědřil",
                            "verse 74:14": "a jemuž jsem vše hladce uhladil,",
                            "verse 74:15": "a on pak ještě dychtí, abych více mu dal!",
                            "verse 74:16": "Však pozor! Vždyť proti Našim znamením on brojí,",
                            "verse 74:17": "však vyženu ho na vrch příkrý!",
                            "verse 74:18": "On věru vymýšlel a rozhodoval,",
                            "verse 74:19": "ať tedy zhyne tak, jak rozhodoval!",
                            "verse 74:20": "A znovu: ať tedy zhyne tak, jak rozhodoval!",
                            "verse 74:21": "Potom kol sebe se rozhlížel,",
                            "verse 74:22": "pak zamračil se a nasupil,",
                            "verse 74:23": "nakonec zády se obrátil a pyšně odcházel",
                            "verse 74:24": "a pravil: \"To není leč kouzlo osvojené",
                            "verse 74:25": "a slova jen bytosti smrtelné!\"",
                            "verse 74:26": "Sežehnu však já jej v ohni Saqaru!",
                            "verse 74:27": "Víš ty vůbec, co je to Saqar?",
                            "verse 74:28": "Nic nenechá a nic nepustí",
                            "verse 74:29": "a kůži smrtelníkům spálí",
                            "verse 74:30": "a devatenáct andělů nad ním bdí.",
                            "verse 74:31": "A za strážce pekla jsme pouze anděly určili a jejich počet jen pro pokušení nevěřících stanovili, aby ti, jímž dostalo se Písma, se utvrdili a rozmnožila se víra těch, kdož uvěřili, a aby věřící a ti, jimž Písmo bylo dáno, nepochybovali a aby ti, v jejichž srdcích nemoc je, a také nevěřící pravili: \"Co chtěl Bůh tímto příkladem říci?\" Takto Bůh zbloudit nechává, koho chce, a vede cestou přímou, koho chce.",
                            "verse 74:32": "Však pozor! Při měsíci,",
                            "verse 74:33": "při noci, když ustupuje,",
                            "verse 74:34": "při úsvitu, když se rozjasňuje!",
                            "verse 74:35": "Saqar je věru jeden z trestů největších,",
                            "verse 74:36": "jako varování smrtelníkům daný,",
                            "verse 74:37": "těm z vás, kdož chtějí k víře vpředu jít anebo se chtějí opozdit.",
                            "verse 74:38": "Každá duše je ručitelkou toho, co si sama vysloužila,",
                            "verse 74:39": "kromě lidi po pravici,",
                            "verse 74:40": "kteří v zahradách vzájemně se budou ptát",
                            "verse 74:41": "na hříšníky:",
                            "verse 74:42": "Co přivedlo vás do Saqaru?",
                            "verse 74:43": "odvětí: \"Nebyli jsme mezi modlitbu konajícími",
                            "verse 74:44": "ani mezi nuzné krmícími,",
                            "verse 74:45": "ale tlachali jsme mezi tlachajícími",
                            "verse 74:46": "a den soudný jsme za lež prohlásili,",
                            "verse 74:47": "až přišla na nás tato jistota!\"",
                            "verse 74:48": "A nebude jim nic platná přímluva přímluvců!",
                            "verse 74:49": "Co s nimi je, že se odvracejí od připomenutí,",
                            "verse 74:50": "jako by byli osly splašenými,",
                            "verse 74:51": "před lvem prchajícími?",
                            "verse 74:52": "Věru, chce každý z nich, aby svitky rozevřené mu byly přineseny?",
                            "verse 74:53": "Však pozor! Oni se naopak neobávají života budoucího.",
                            "verse 74:54": "Však pozor! Toto jest připomenutí,",
                            "verse 74:55": "a kdo chce, ať na ně si vzpomene!",
                            "verse 74:56": "Však vzpomenou si jen tehdy, když Bůh si to bude přát a Jemu náleží, aby se Ho báli, a Jemu patří odpuštění dát! vzpomene!"
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "O gij die u omhult!",
                            "verse 74:2": "Sta op en waarschuw,",
                            "verse 74:3": "En verkondig de Grootheid van uw Heer,",
                            "verse 74:4": "En reinig uw hart.",
                            "verse 74:5": "En vlied de onreinheid.",
                            "verse 74:6": "Bewijs geen gunsten om u daardoor te verrijken.",
                            "verse 74:7": "En wees geduldig ter wille van uw Heer.",
                            "verse 74:8": "Want als de bazuin wordt geblazen,",
                            "verse 74:9": "Die Dag zal een moeilijke dag zijn.",
                            "verse 74:10": "Niet gemakkelijk voor de ongelovigen.",
                            "verse 74:11": "Laat Mij alleen met hem die Ik schiep.",
                            "verse 74:12": "Ik heb hem overvloedig bezit gegeven.",
                            "verse 74:13": "En zonen die bij hem zijn.",
                            "verse 74:14": "En ik verschafte hem elk gemak.",
                            "verse 74:15": "Toch verlangt hij dat Ik hem nog meer zal geven.",
                            "verse 74:16": "Stellig niet; want hij was vijandig tegenover Onze boodschappen.",
                            "verse 74:17": "Hem zal Ik een zware straf opleggen.",
                            "verse 74:18": "Ziet! Hij dacht na en hij besloot!",
                            "verse 74:19": "Vervloekt zij hij, hoe besloot hij!",
                            "verse 74:20": "Nogmaals, vervloekt zij hij! Hoe be sloot hij!",
                            "verse 74:21": "Toen keek hij (om zich heen),",
                            "verse 74:22": "Daarna fronste hij zijn voorhoofd en keek nors.",
                            "verse 74:23": "Dan keerde hij zich om en toonde zich hovaardig.",
                            "verse 74:24": "Hij zeide: \"Dit is niets dan een nagebootste tovenarij.",
                            "verse 74:25": "Dit is slechts het woord van een mens.",
                            "verse 74:26": "Weldra zal Ik hem in het Vuur werpen.",
                            "verse 74:27": "En wat weet gij wat het Vuur der hel is?",
                            "verse 74:28": "Het ontziet niets, noch laat het iets (onverteerd) achter,",
                            "verse 74:29": "Het verschroeit het gezicht.",
                            "verse 74:30": "Daarover waken er negentien (engelen).",
                            "verse 74:31": "En Wij hebben niets dan engelen tot wachters van het Vuur gemaakt.",
                            "verse 74:32": "Neen, bij de maan,",
                            "verse 74:33": "En de nacht als zij heengaat",
                            "verse 74:34": "En de dageraad wanneer zij gloort,",
                            "verse 74:35": "Waarlijk, het is een der grootste tijdingen",
                            "verse 74:36": "Een waarschuwing voor de mensen.",
                            "verse 74:37": "Aan degene onder u, die vooruit wenst te gaan of degene die wil achterblijven,",
                            "verse 74:38": "Elke ziel is als een pand voor hetgeen zij doet.",
                            "verse 74:39": "Doch degenen aan de rechter hand",
                            "verse 74:40": "In tuinen (wonende) vragen zij:",
                            "verse 74:41": "Aan de schuldigen",
                            "verse 74:42": "\"Wat heeft u in de hel gebracht?\"",
                            "verse 74:43": "Zij zullen antwoorden: \"Wij behoorden niet tot hen die plachten te bidden.",
                            "verse 74:44": "Noch voedden wij de armen.",
                            "verse 74:45": "En wij plachten ijdele gesprekken te voeren met hen die ijdele gesprekken voerden.",
                            "verse 74:46": "En wij plachten de Dag des Oordeels te loochenen.",
                            "verse 74:47": "Totdat de dood ons overviel.",
                            "verse 74:48": "De tussenkomst van bemiddelaars zal hen daarom niets baten.",
                            "verse 74:49": "Wat scheelt hun dat zij zich van de vermaning afwenden",
                            "verse 74:50": "Als bange ezels,",
                            "verse 74:51": "Vluchtende voor een leeuw?",
                            "verse 74:52": "Neen, ieder van hen wenst dat hem opengeslagen bladzijden zullen worden getoond.",
                            "verse 74:53": "Voorwaar, zij vrezen het Hiernamaals niet!",
                            "verse 74:54": "Neen, waarlijk, dit is een vermaning",
                            "verse 74:55": "Die wil, trekke er lering uit.",
                            "verse 74:56": "Doch zij zullen er geen lering uit trekken tenzij God het wil."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 74:1": "O thou enveloped in thy cloak,",
                            "verse 74:2": "Arise and warn!",
                            "verse 74:3": "Thy Lord magnify,",
                            "verse 74:4": "Thy raiment purify,",
                            "verse 74:5": "Pollution shun!",
                            "verse 74:6": "And show not favour, seeking wordly gain!",
                            "verse 74:7": "For the sake of thy Lord, be patient!",
                            "verse 74:8": "For when the trumpet shall sound,",
                            "verse 74:9": "Surely that day will be a day of anguish,",
                            "verse 74:10": "Not of ease, for disbelievers.",
                            "verse 74:11": "Leave Me (to deal) with him whom I created lonely,",
                            "verse 74:12": "And then bestowed upon him ample means,",
                            "verse 74:13": "And sons abiding in his presence",
                            "verse 74:14": "And made (life) smooth for him.",
                            "verse 74:15": "Yet he desireth that I should give more.",
                            "verse 74:16": "Nay! For lo! he hath been stubborn to Our revelations.",
                            "verse 74:17": "On him I shall impose a fearful doom.",
                            "verse 74:18": "For lo! he did consider; then he planned -",
                            "verse 74:19": "(Self-)destroyed is he, how he planned!",
                            "verse 74:20": "Again (self-)destroyed is he, how he planned! -",
                            "verse 74:21": "Then looked he,",
                            "verse 74:22": "Then frowned he and showed displeasure.",
                            "verse 74:23": "Then turned he away in pride",
                            "verse 74:24": "And said: This is naught else than magic from of old;",
                            "verse 74:25": "This is naught else than speech of mortal man.",
                            "verse 74:26": "Him shall I fling unto the burning.",
                            "verse 74:27": "- Ah, what will convey unto thee what that burning is! -",
                            "verse 74:28": "It leaveth naught; it spareth naught",
                            "verse 74:29": "It shrivelleth the man.",
                            "verse 74:30": "Above it are nineteen.",
                            "verse 74:31": "We have appointed only angels to be wardens of the Fire, and their number have We made to be a stumbling-block for those who disbelieve; that those to whom the Scripture hath been given may have certainty, and that believers may increase in faith; and that those to whom the Scripture hath been given and believers may not doubt; and that those in whose hearts there is disease, and disbelievers, may say: What meaneth Allah by this similitude ? Thus Allah sendeth astray whom He will, and whom He will He guideth.",
                            "verse 74:32": "Nay, by the Moon",
                            "verse 74:33": "And the night when it withdraweth",
                            "verse 74:34": "And the dawn when it shineth forth,",
                            "verse 74:35": "Lo! this is one of the greatest (portents)",
                            "verse 74:36": "As a warning unto men,",
                            "verse 74:37": "Unto him of you who will advance or hang back.",
                            "verse 74:38": "Every soul is a pledge for its own deeds;",
                            "verse 74:39": "Save those who will stand on the right hand.",
                            "verse 74:40": "In gardens they will ask one another",
                            "verse 74:41": "Concerning the guilty:",
                            "verse 74:42": "What hath brought you to this burning ?",
                            "verse 74:43": "They will answer: We were not of those who prayed",
                            "verse 74:44": "Nor did we feed the wretched.",
                            "verse 74:45": "We used to wade (in vain dispute) with (all) waders,",
                            "verse 74:46": "And we used to deny the Day of Judgment,",
                            "verse 74:47": "Till the Inevitable came unto us.",
                            "verse 74:48": "The mediation of no mediators will avail them then.",
                            "verse 74:49": "Why now turn they away from the Admonishment,",
                            "verse 74:50": "As they were frightened asses",
                            "verse 74:51": "Fleeing from a lion ?",
                            "verse 74:52": "Nay, but everyone of them desireth that he should be given open pages (from Allah).",
                            "verse 74:53": "Nay, verily.",
                            "verse 74:54": "Nay, verily.",
                            "verse 74:55": "So whosoever will may heed.",
                            "verse 74:56": "And they will not heed unless Allah willeth (it)."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 74:1": "O thou wrapped up (in the mantle)!",
                            "verse 74:2": "Arise and deliver thy warning!",
                            "verse 74:3": "And thy Lord do thou magnify!",
                            "verse 74:4": "And thy garments keep free from stain!",
                            "verse 74:5": "And all abomination shun!",
                            "verse 74:6": "Nor expect, in giving, any increase (for thyself)!",
                            "verse 74:7": "But, for thy Lord’s (Cause), be patient and constant!",
                            "verse 74:8": "Finally, when the Trumpet is sounded,",
                            "verse 74:9": "That will be- that Day - a Day of Distress,-",
                            "verse 74:10": "Far from easy for those without Faith.",
                            "verse 74:11": "Leave Me alone, (to deal) with the (creature) whom I created (bare and) alone!-",
                            "verse 74:12": "To whom I granted resources in abundance,",
                            "verse 74:13": "And sons to be by his side!-",
                            "verse 74:14": "To whom I made (life) smooth and comfortable!",
                            "verse 74:15": "Yet is he greedy-that I should add (yet more);-",
                            "verse 74:16": "By no means! For to Our Signs he has been refractory!",
                            "verse 74:17": "Soon will I visit him with a mount of calamities!",
                            "verse 74:18": "For he thought and he plotted;-",
                            "verse 74:19": "And woe to him! How he plotted!-",
                            "verse 74:20": "Yea, Woe to him; How he plotted!-",
                            "verse 74:21": "Then he looked round;",
                            "verse 74:22": "Then he frowned and he scowled;",
                            "verse 74:23": "Then he turned back and was haughty;",
                            "verse 74:24": "Then said he: \"This is nothing but magic, derived from of old;",
                            "verse 74:25": "\"This is nothing but the word of a mortal!\"",
                            "verse 74:26": "Soon will I cast him into Hell-Fire!",
                            "verse 74:27": "And what will explain to thee what Hell-Fire is?",
                            "verse 74:28": "Naught doth it permit to endure, and naught doth it leave alone!-",
                            "verse 74:29": "Darkening and changing the colour of man!",
                            "verse 74:30": "Over it are Nineteen.",
                            "verse 74:31": "And We have set none but angels as Guardians of the Fire; and We have fixed their number only as a trial for Unbelievers,- in order that the People of the Book may arrive at certainty, and the Believers may increase in Faith,- and that no doubts may be left for the People of the Book and the Believers, and that those in whose hearts is a disease and the Unbelievers may say, \"What symbol doth God intend by this ?\" Thus doth God leave to stray whom He pleaseth, and guide whom He pleaseth: and none can know the forces of thy Lord, except He and this is no other than a warning to mankind.",
                            "verse 74:32": "Nay, verily: By the Moon,",
                            "verse 74:33": "And by the Night as it retreateth,",
                            "verse 74:34": "And by the Dawn as it shineth forth,-",
                            "verse 74:35": "This is but one of the mighty (portents),",
                            "verse 74:36": "A warning to mankind,-",
                            "verse 74:37": "To any of you that chooses to press forward, or to follow behind;-",
                            "verse 74:38": "Every soul will be (held) in pledge for its deeds.",
                            "verse 74:39": "Except the Companions of the Right Hand.",
                            "verse 74:40": "(They will be) in Gardens (of Delight): they will question each other,",
                            "verse 74:41": "And (ask) of the Sinners:",
                            "verse 74:42": "\"What led you into Hell Fire?\"",
                            "verse 74:43": "They will say: \"We were not of those who prayed;",
                            "verse 74:44": "\"Nor were we of those who fed the indigent;",
                            "verse 74:45": "\"But we used to talk vanities with vain talkers;",
                            "verse 74:46": "\"And we used to deny the Day of Judgment,",
                            "verse 74:47": "\"Until there came to us (the Hour) that is certain.",
                            "verse 74:48": "Then will no intercession of (any) intercessors profit them.",
                            "verse 74:49": "Then what is the matter with them that they turn away from admonition?-",
                            "verse 74:50": "As if they were affrighted asses,",
                            "verse 74:51": "Fleeing from a lion!",
                            "verse 74:52": "Forsooth, each one of them wants to be given scrolls (of revelation) spread out!",
                            "verse 74:53": "By no means! But they fear not the Hereafter,",
                            "verse 74:54": "Nay, this surely is an admonition:",
                            "verse 74:55": "Let any who will, keep it in remembrance!",
                            "verse 74:56": "But none will keep it in remembrance except as God wills: He is the Lord of Righteousness, and the Lord of Forgiveness."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 74:1": "O thou shrouded in thy mantle,",
                            "verse 74:2": "arise, and warn!",
                            "verse 74:3": "Thy Lord magnify",
                            "verse 74:4": "thy robes purify",
                            "verse 74:5": "and defilement flee!",
                            "verse 74:6": "Give not, thinking to gain greater",
                            "verse 74:7": "and be patient unto thy Lord.",
                            "verse 74:8": "For when the Trump is sounded",
                            "verse 74:9": "that day will be a harsh day,",
                            "verse 74:10": "for the unbelievers not easy.",
                            "verse 74:11": "Leave Me with him whom I created alone,",
                            "verse 74:12": "and appointed for him ample wealth",
                            "verse 74:13": "and sons standing before him,",
                            "verse 74:14": "and made all things smooth for him;",
                            "verse 74:15": "then he is eager that I should do more.",
                            "verse 74:16": "Nay! He is forward unto Our signs;",
                            "verse 74:17": "and I shall constrain him to a hard ascent.",
                            "verse 74:18": "Lo! He reflected, and determined --",
                            "verse 74:19": "death seize him, how he determined!",
                            "verse 74:20": "Again, death seize him, how he determined!",
                            "verse 74:21": "Then he beheld,",
                            "verse 74:22": "then he frowned, and scowled,",
                            "verse 74:23": "then he retreated, and waxed proud.",
                            "verse 74:24": "He said, ’This is naught but a trumped-up sorcery;",
                            "verse 74:25": "’this is nothing but mortal speech.",
                            "verse 74:26": "I shall surely roast him in Sakar;",
                            "verse 74:27": "and what will teach thee what is Sakar?",
                            "verse 74:28": "It spares not, neither leaves alone",
                            "verse 74:29": "scorching the flesh;",
                            "verse 74:30": "over it are nineteen.",
                            "verse 74:31": "We have appointed only angels to be masters of the Fire, and their number We have appointed only as a trial for the unbelievers, that those who were given the Book may have certainty, and that those who believe may increase in belief, and that those who were given the Book and those who believe may not be in-doubt, and that those in whose hearts there is sickness, and the unbelievers, may say, ’What did God intend by this as a similitude?’ So God leads astray whomsoever He will, and He guides whomsoever He will; and none knows the hosts of thy Lord but He.",
                            "verse 74:32": "Nay! By the moon",
                            "verse 74:33": "and the night when it retreats",
                            "verse 74:34": "and the dawn when it is white,",
                            "verse 74:35": "surely it is one of the greatest things",
                            "verse 74:36": "as a warner to mortals.",
                            "verse 74:37": "to whoever of you desires to go forward or lag behind.",
                            "verse 74:38": "Every soul shall be pledged for what it has earned,",
                            "verse 74:39": "save the Companions of the Right;",
                            "verse 74:40": "in Gardens they will question",
                            "verse 74:41": "concerning the sinners,",
                            "verse 74:42": "’What thrusted you into Sakar?’",
                            "verse 74:43": "They shall say, ’We were not of those who prayed, and",
                            "verse 74:44": "we fed not the needy,",
                            "verse 74:45": "and we plunged along with the plungers,",
                            "verse 74:46": "and we cried lies to the Day of Doom,",
                            "verse 74:47": "till the Certain came to us.",
                            "verse 74:48": "Then the intercession of the intercessors shall not profit them.",
                            "verse 74:49": "What ails them, that they turn away from the Reminder,",
                            "verse 74:50": "as if they were startled asses",
                            "verse 74:51": "fleeing -- before a lion?",
                            "verse 74:52": "Nay, every man of them desires to be -- given -- scrolls unrolled.",
                            "verse 74:53": "No indeed; but they do not fear the Hereafter.",
                            "verse 74:54": "No indeed; surely it is a Reminder;",
                            "verse 74:55": "so whoever wills shall remember it.",
                            "verse 74:56": "And they will not remember, except that God wills; He is worthy to be feared, -- worthy to forgive."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 74:1": "O THOU [in thy solitude] enfolded!",
                            "verse 74:2": "Arise and warn!",
                            "verse 74:3": "And thy Sustainer’s greatness glorify!",
                            "verse 74:4": "And thine inner self purify!",
                            "verse 74:5": "And all defilement shun!",
                            "verse 74:6": "And do not through giving seek thyself to gain,",
                            "verse 74:7": "but unto thy Sustainer turn in patience.",
                            "verse 74:8": "And [warn all men that] when the trumpet-call [of resurrection] is sounded,",
                            "verse 74:9": "that very Day shall be a day of anguish,",
                            "verse 74:10": "not of ease, for all who",
                            "verse 74:11": "deny the truth!",
                            "verse 74:12": "LEAVE Me alone [to deal] with him whom I have created alone,",
                            "verse 74:13": "and to whom I have granted resources vast,",
                            "verse 74:14": "and children as",
                            "verse 74:15": "witnesses,",
                            "verse 74:16": "and to whose life I gave so wide a scope:",
                            "verse 74:17": "and yet, he greedily desires that I give yet more!",
                            "verse 74:18": "Nay, verily, it is against Our messages that he knowingly, stubbornly sets himself",
                            "verse 74:19": "[and so] I shall constrain him to endure a painful uphill climb!",
                            "verse 74:20": "Behold, [when Our messages are conveyed to one who is bent on denying the truth,] he reflects and meditates [as to how to disprove them]",
                            "verse 74:21": "and thus he destroys himself, the way he meditates:",
                            "verse 74:22": "yea, he destroys himself, the way he meditates!",
                            "verse 74:23": "and then he looks [around for new arguments],",
                            "verse 74:24": "and then he frowns and glares,",
                            "verse 74:25": "and in the end he turns his back [on Our message], and glories in his arrogance,",
                            "verse 74:26": "and says, \"All this is mere spellbinding eloquence handed down [from olden times]!",
                            "verse 74:27": "This is nothing but the word of mortal man!\"",
                            "verse 74:28": "",
                            "verse 74:29": "I shall cause him to endure hell-fire [in the life to come]!",
                            "verse 74:30": "And what could make thee conceive what hell-fire is?",
                            "verse 74:31": "It does not allow to live, and neither leaves [to die],",
                            "verse 74:32": "making [all truth] visible to mortal man.",
                            "verse 74:33": "Over it are nineteen .",
                            "verse 74:34": "For We have caused none but angelic powers to lord over the fire [of hell]; and We have not caused their number to be aught but a trial for those who are bent on denying the truth – to the end that they who have been granted revelation aforetime might be convinced [of the truth of this divine writ]; and that they who have attained to faith [in it] might grow yet more firm in their faith; and that",
                            "verse 74:35": "they who have been granted the earlier revelation and they who believe [in this one] might be freed of all doubt; and that they in whose hearts is disease and they who deny the truth outright might ask, \"What does",
                            "verse 74:36": "God mean by this parable?\" In this way God lets go astray him that wills [to go astray],and guides aright him that wills [to be guided].",
                            "verse 74:37": "NAY, but consider the moon!",
                            "verse 74:38": "Consider the night when it departs,",
                            "verse 74:39": "and the morn when it dawns!",
                            "verse 74:40": "Verily, that",
                            "verse 74:41": "is indeed one of the great",
                            "verse 74:42": "a warning to mortal man",
                            "verse 74:43": "to every one of you, whether he chooses to come forward or to hang back!",
                            "verse 74:44": "[On the Day of Judgment,] every human being will be held in pledge for whatever",
                            "verse 74:45": "he has wrought",
                            "verse 74:46": "save only those who shall have attained to righteousness:",
                            "verse 74:47": "",
                            "verse 74:48": "in gardens [of paradise], they will inquire",
                            "verse 74:49": "of those who were lost in sin:",
                            "verse 74:50": "\"What has brought you into hell-fire?\"",
                            "verse 74:51": "They will answer: \"We were not among those who prayed,",
                            "verse 74:52": "and neither did we feed the needy;",
                            "verse 74:53": "and we were wont to indulge in sinning together with all [the others] who indulged in it;",
                            "verse 74:54": "and the Day of Judgment we were wont to call a lie",
                            "verse 74:55": "until certainty came upon us [in death].",
                            "verse 74:56": "And so, of no benefit to them could be the intercession of any that would intercede for them.",
                            "verse 74:57": "WHAT, THEN, is amiss with them that they turn away from all admonition",
                            "verse 74:58": "as though they were terrified asses",
                            "verse 74:59": "fleeing from a lion?",
                            "verse 74:60": "Yea, every one of them claims that he",
                            "verse 74:61": "ought to have been given revelations unfolded!",
                            "verse 74:62": "Nay, but they do not [believe in and, hence, do not] fear the life to come.",
                            "verse 74:63": "Nay, verily, this is an admonition",
                            "verse 74:64": "and whoever wills may take it to heart.",
                            "verse 74:65": "(56) But they [who do not believe in the life to come] will not take it to heart unless God so wills:",
                            "verse 74:66": "He is the Fount of all God-consciousness, and the Fount of all forgiveness.",
                            "verse 74:67": "commentators, the meaning [of this verse] is, ‘purify thy heart of all that is blameworthy’.",
                            "verse 74:68": "out in a",
                            "verse 74:69": "spread” – i.",
                            "verse 74:70": "visible.",
                            "verse 74:71": "verses dealing with these allegories (hādhihi ’l-mutashābihāt)”: hence my compromise rendering “all this."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 74:1": "O thou who art wrapped in thy cloak.",
                            "verse 74:2": "",
                            "verse 74:3": "Arise and warn!",
                            "verse 74:4": "",
                            "verse 74:5": "Thy Lord magnify!",
                            "verse 74:6": "Thy raiment purify!",
                            "verse 74:7": "Defilement shun!",
                            "verse 74:8": "For when the trumpet shall be blown.",
                            "verse 74:9": "That shall be a day of anguish.",
                            "verse 74:10": "Not of ease, for disbelievers.",
                            "verse 74:11": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 74:12": "The Book of Certainty (1952) •",
                            "verse 74:13": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 74:14": "What is Sufism (1975) •",
                            "verse 74:15": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 74:16": "Muhammad (1983) •",
                            "verse 74:17": "Symbol and Archetype (1991) •",
                            "verse 74:18": "Sufi Poems (2004) •",
                            "verse 74:19": "Mecca (2004) •",
                            "verse 74:20": "Return to the Spirit (2005) •",
                            "verse 74:21": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 74:22": "“Proofs of Islam”(1954).",
                            "verse 74:23": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 74:24": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 74:25": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 74:26": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 74:27": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 74:28": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 74:29": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 74:30": "“The Quranic Origins of Sufism” •",
                            "verse 74:31": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 74:32": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 74:33": "“An Introduction to Islam” •",
                            "verse 74:34": "“The Universality of the Quran” •",
                            "verse 74:35": "Private Talks Books",
                            "verse 74:36": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 74:1": "O you, enveloped in a mantle,",
                            "verse 74:2": "stand up and warn,",
                            "verse 74:3": "and pronounce the greatness of your Lord,",
                            "verse 74:4": "and purify your clothes,",
                            "verse 74:5": "and keep away from filth,",
                            "verse 74:6": "and do not do a favour (to anyone merely) to seek more (in return).",
                            "verse 74:7": "And for the sake of your Lord, observe patience.",
                            "verse 74:8": "For when the trumpet will be blown,",
                            "verse 74:9": "that day will be a difficult day,",
                            "verse 74:10": "not easy for the disbelievers.",
                            "verse 74:11": "Leave me alone (to deal) with the one whom I created lonely,",
                            "verse 74:12": "and gave him extensive wealth,",
                            "verse 74:13": "and sons present before (his) eyes,",
                            "verse 74:14": "and extended (power and honour) to him pretty well.",
                            "verse 74:15": "Still, he aspires that I should give him more.",
                            "verse 74:16": "Never! He is inimical towards Our verses.",
                            "verse 74:17": "I will force him to climb the mountain Sa‘ūd.",
                            "verse 74:18": "He pondered and surmised.",
                            "verse 74:19": "Death onto him! How (bad) is the surmise he put forward!",
                            "verse 74:20": "Again, death unto him! How (bad) is the surmise he put forward!",
                            "verse 74:21": "Then he looked (to those around him,)",
                            "verse 74:22": "then he frowned and scowled,",
                            "verse 74:23": "then turned his back, and waxed proud,",
                            "verse 74:24": "then said, “This is nothing but traditional magic;",
                            "verse 74:25": "this is nothing but saying of a mortal.",
                            "verse 74:26": "I will put him into Saqar (Hell).",
                            "verse 74:27": "And what can let you know what Saqar is?",
                            "verse 74:28": "It neither spares (anything inside it from burning) nor leaves (any disbeliever outside).",
                            "verse 74:29": "It will disfigure the skins.",
                            "verse 74:30": "Appointed on it are nineteen (wardens).",
                            "verse 74:31": "And We did not make wardens of the Fire but (from) angels, and did not fix their number but as a test for those who disbelieve, so that those who are given the Book may come to believe, and those who believe may improve in belief, and so that those who are given the Book and those who believe may not doubt (its correctness), and so that those having malady in their hearts and the disbelievers say, “What has Allah meant by this strange statement?” Thus Allah lets go astray whomever He wills, and leads to the right path whomever He wills.",
                            "verse 74:32": "Truly, I swear by the moon,",
                            "verse 74:33": "and by the night when it goes back,",
                            "verse 74:34": "and by the morning when it becomes bright,",
                            "verse 74:35": "it (Saqar : Hell) is one of the greatest things",
                            "verse 74:36": "as a warning to the mankind,",
                            "verse 74:37": "to the one from among you who wishes to come forward (towards good deeds) or to go back (from them).",
                            "verse 74:38": "Everyone will be detained (in the Hell) because of what he did,",
                            "verse 74:39": "except the People of the Right, (i.",
                            "verse 74:40": "who will be in gardens, asking",
                            "verse 74:41": "about the guilty persons,",
                            "verse 74:42": "“What has brought you to Saqar? (Hell)”",
                            "verse 74:43": "They will say, “We were not among those who offered Salāh , (obligatory prayer)",
                            "verse 74:44": "and we did not give food to the needy,",
                            "verse 74:45": "and we indulged (in mocking at the truth) along with those who indulged,",
                            "verse 74:46": "and we used to deny the Day of Requital,",
                            "verse 74:47": "until when we were overtaken by that which is certain.",
                            "verse 74:48": "Then intercession of intercessors will not benefit them.",
                            "verse 74:49": "So what has happened to them that they are turning away from the Reminder,",
                            "verse 74:50": "as if they were wild donkeys,",
                            "verse 74:51": "fleeing from a lion?",
                            "verse 74:52": "Rather, every one of them wishes that he should be given unrolled (divine) scriptures.",
                            "verse 74:53": "Never! But they do not fear the Hereafter.",
                            "verse 74:54": "Never! Indeed, this is a Reminder.",
                            "verse 74:55": "So, whoever so wishes may take advice from it.",
                            "verse 74:56": "And they will not take advice unless Allah so wills."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 74:1": "O you enveloped in your mantle,",
                            "verse 74:2": "arise and warn,",
                            "verse 74:3": "and magnify your Lord,",
                            "verse 74:4": "and purify your clothes,",
                            "verse 74:5": "and shun",
                            "verse 74:6": "defilement.",
                            "verse 74:7": "And do not grant a favour seeking greater gain,",
                            "verse 74:8": "and endure patiently for the sake of your Lord.",
                            "verse 74:9": "For when the trumpet is sounded,",
                            "verse 74:10": "that day will be a harsh day",
                            "verse 74:11": "for the disbelievers, not at all easy.",
                            "verse 74:12": "Leave Me [to deal] with him whom I created lonely,",
                            "verse 74:13": "and",
                            "verse 74:14": "assigned him ample means,",
                            "verse 74:15": "and sons present [by his side],",
                            "verse 74:16": "and facilitated for him greatly.",
                            "verse 74:17": "Still he is eager that I should give",
                            "verse 74:18": "more.",
                            "verse 74:19": "Nay! He is indeed stubborn to Our signs.",
                            "verse 74:20": "",
                            "verse 74:21": "I shall burden him with a trying chastisement.",
                            "verse 74:22": "Indeed he pondered and decided.",
                            "verse 74:23": "Perish he, how he decided!",
                            "verse 74:24": "Again, perish he, how he decided!",
                            "verse 74:25": "Then he contemplated.",
                            "verse 74:26": "Then he frowned and scowled.",
                            "verse 74:27": "Then he turned his back in disdain,",
                            "verse 74:28": "and said, ‘This is nothing but handed-down sorcery;",
                            "verse 74:29": "this is nothing but the speech of humans’.",
                            "verse 74:30": "I shall",
                            "verse 74:31": "admit him into Saqar!",
                            "verse 74:32": "And how would you know what is Saqar?",
                            "verse 74:33": "It neither spares nor leaves behind.",
                            "verse 74:34": "It burns away the flesh.",
                            "verse 74:35": "There are nineteen",
                            "verse 74:36": "standing over it.",
                            "verse 74:37": "And We have appointed only angels as wardens of the Fire, and We have made their number only as a stumbling-block for those who disbelieve, so that those who were given the Scripture may be certain, and that those who believe may increase in faith, and that those given the Scripture and the believers may not be in doubt, and that those in whose hearts there is a sickness, and the disbelievers may say, ‘What did God mean by this similitude?’ Thus, God leads astray whom He will and guides whom He will.",
                            "verse 74:38": "Nay, by the moon!",
                            "verse 74:39": "And by the night when it returns!",
                            "verse 74:40": "And by the dawn when it appears!",
                            "verse 74:41": "Verily it is one of the enormities —",
                            "verse 74:42": "a warning to",
                            "verse 74:43": "humans;",
                            "verse 74:44": "",
                            "verse 74:45": "to those of you who wish to advance or linger behind.",
                            "verse 74:46": "Every soul is held to ransom by what it earns,",
                            "verse 74:47": "except those of the right ,",
                            "verse 74:48": "in gardens, questioning one another,",
                            "verse 74:49": "about the guilty:",
                            "verse 74:50": "‘What has landed you in Saqar?’",
                            "verse 74:51": "They will say, ‘We were not of those who prayed.",
                            "verse 74:52": "Nor did we",
                            "verse 74:53": "feed the needy.",
                            "verse 74:54": "And we used to delve along with those who delved,",
                            "verse 74:55": "and we used to deny the Day of Judgement,",
                            "verse 74:56": "until",
                            "verse 74:57": "the inevitable came to us’.",
                            "verse 74:58": "Thus the intercession of the intercessors will not avail them.",
                            "verse 74:59": "So what is wrong with them that they turn away from the Reminder",
                            "verse 74:60": "as if they were wild asses",
                            "verse 74:61": "fleeing from a lion?",
                            "verse 74:62": "Nay, but everyone of them desires to be given unrolled scrolls.",
                            "verse 74:63": "No indeed! Rather they do not fear the Hereafter.",
                            "verse 74:64": "No indeed! Assuredly it is a Reminder.",
                            "verse 74:65": "So whoever wills shall remember it.",
                            "verse 74:66": "And they will not remember unless God wills .",
                            "verse 74:67": "He is [the One] worthy of",
                            "verse 74:68": "fear, and [the One] worthy to forgive."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 74:1": "O enwrapped (Beloved!)",
                            "verse 74:2": "Rise and give warning (to the people).",
                            "verse 74:3": "And glorify the Greatnesss (and Majesty) of your Lord.",
                            "verse 74:4": "And (always) keep your (visible and spiritual) attire purified and cleansed (as before).",
                            "verse 74:5": "And keep away from the idols (and sins as usual).",
                            "verse 74:6": "And do not do a favour (to anyone with the purpose of) seeking more from him.",
                            "verse 74:7": "And observe patience for the sake of your Lord.",
                            "verse 74:8": "Then when the Trumpet will be blown (a second time),",
                            "verse 74:9": "So that Day (the Day of Resurrection) will be an extremely hard day,",
                            "verse 74:10": "Not at all easy for the disbelievers.",
                            "verse 74:11": "Leave Me (to take revenge) on him whom I have created alone,",
                            "verse 74:12": "And I provided him wealth in abundance,",
                            "verse 74:13": "And (gave) him sons remaining present (before him),",
                            "verse 74:14": "And granted him affluence (in sources of luxury).",
                            "verse 74:15": "Yet he desires that I should give him more.",
                            "verse 74:16": "No way! He has certainly been inimical to Our Revelations.",
                            "verse 74:17": "Soon I shall afflict him with (the punishment of) a severe toil.",
                            "verse 74:18": "Surely, he reflected and devised a plot.",
                            "verse 74:19": "So let (Allah’s) curse be on him! How he plotted!",
                            "verse 74:20": "Let again (Allah’s) curse be on him! How he plotted!",
                            "verse 74:21": "Then he pondered (over his scheme again).",
                            "verse 74:22": "Then he frowned and twisted his face.",
                            "verse 74:23": "Then he turned back (from the truth) and showed arrogance.",
                            "verse 74:24": "Then he said: ‘This (Qur’an) is nothing but magic which is being transmitted from the past (magicians).",
                            "verse 74:25": "This (Qur’an) is nothing (else) but the words of a human being.",
                            "verse 74:26": "I will soon cast him into Hell.",
                            "verse 74:27": "And who has told you what Saqar (the Fire of Hell) is?",
                            "verse 74:28": "That (is the Fire which) does not spare, nor does it leave out.",
                            "verse 74:29": "(That) scorches the skin and blackens it.",
                            "verse 74:30": "There are nineteen (angels appointed as guards) over it.",
                            "verse 74:31": "And We have appointed only angels as guards of Hell.",
                            "verse 74:32": "Yes! By the moon (whose increase, decrease and disappearance is evidence),",
                            "verse 74:33": "And by the night when it backs away to depart,",
                            "verse 74:34": "And by the morning when it brightens,",
                            "verse 74:35": "Surely, this (Hell) is one of the greatest calamities.",
                            "verse 74:36": "It is a warning to mankind,",
                            "verse 74:37": "For any of you who seeks to advance forward (in piety) or who lags behind (trapped in evil);",
                            "verse 74:38": "Everyone is held in pledge for (the deeds) that he has earned,",
                            "verse 74:39": "Except for those on the Right Side.",
                            "verse 74:40": "(They) will be in Gardens and will be asking one another,",
                            "verse 74:41": "About the evildoers.",
                            "verse 74:42": "(And they will say:) ‘What has brought you into Hell?’",
                            "verse 74:43": "They will say: ‘We were not of those who used to offer Prayers.",
                            "verse 74:44": "Nor did we feed the poor.",
                            "verse 74:45": "And we indulged in vain activities with those who had cast themselves into vain activities.",
                            "verse 74:46": "And we rejected the Day of Reward and Punishment,",
                            "verse 74:47": "Until that (death), which was certain to come, came upon us.",
                            "verse 74:48": "So (now) the intercession of the intercessors will not be of any benefit to them.",
                            "verse 74:49": "Then what is the matter with these (disbelievers that even then) they turn away from the Reminder,",
                            "verse 74:50": "As if they were startled (wild) donkeys,",
                            "verse 74:51": "Fleeing away from a lion?",
                            "verse 74:52": "In fact, every one of them desires that he should be given (directly) open scrolls of (heavenly) scriptures.",
                            "verse 74:53": "That is not possible at all.",
                            "verse 74:54": "There is no doubt that this (Qur’an) is a Reminder.",
                            "verse 74:55": "So whoever wills may remember it.",
                            "verse 74:56": "And they will not remember (it) unless Allah so wills."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "Sinä, joka olet viittaan kiedottu,",
                            "verse 74:2": "nouse ja varoita,",
                            "verse 74:3": "ylistä Herraasi,",
                            "verse 74:4": "puhdista vaatteesi,",
                            "verse 74:5": "karta epäpuhdasta,",
                            "verse 74:6": "älä jaa antimia saadaksesi ne runsaampina takaisin,",
                            "verse 74:7": "vaan pysy lujana Jumalan asiassa.",
                            "verse 74:8": "Sillä kun pasuunaan puhalletaan,",
                            "verse 74:9": "on se päivä oleva ankara päivä,",
                            "verse 74:10": "epäuskoisille kaikkea muuta kuin otollinen.",
                            "verse 74:11": "Jätä Minun huostaani hänet, jonka olen luonut,",
                            "verse 74:12": "jolle olen antanut runsaasti rikkauksia",
                            "verse 74:13": "ja poikia silmien iloksi,",
                            "verse 74:14": "jonka asioita olen parhain päin sovitellut",
                            "verse 74:15": "ja joka vain haluaa yhä enemmän.",
                            "verse 74:16": "Mutta totisesti ei! Sillä hän uhmaa tunnusmerkkejämme;",
                            "verse 74:17": "Minä panen hänen kestettäväkseen raskaan kurituksen.",
                            "verse 74:18": "Kylläpä hän mietti ja mietti;",
                            "verse 74:19": "voi, miten hän harkitsikaan!",
                            "verse 74:20": "Ja kuinka hän punnitsi mielessään!",
                            "verse 74:21": "Sitten hän katsahti ympärilleen,",
                            "verse 74:22": "sitten rypisti otsaansa ja näytti tuimalta,",
                            "verse 74:23": "sitten hän kääntyi pois ja paisui ylpeydestä",
                            "verse 74:24": "ja sanoi: »Tämä on pelkkää opittua noituutta,",
                            "verse 74:25": "pelkkiä sanoja kuolevaisen suusta.",
                            "verse 74:26": "Minä syöksen hänet helvetin liekkeihin.",
                            "verse 74:27": "Mutta kuinka saisin sinut käsittämään, mikä tuo palo on?",
                            "verse 74:28": "Se ei jätä jäljelle mitään eikä säästä ketään;",
                            "verse 74:29": "se kärventää kuolevaisen kokonaan,",
                            "verse 74:30": "ja sen yläpuolella on yhdeksäntoista.",
                            "verse 74:31": "Tulen vartijoiksi asetimme vain enkeleitä, ja heidän lukunsa asetimme vain koetukseksi niille, jotka eivät usko, jotta ne, joille on annettu Pyhä kirja, olisivat varmoja, ja ne, jotka uskovat, kasvaisivat uskossa; jotta Pyhän kirjan saaneet sekä uskovaiset eivät epäilisi, ja taasen ne, joiden sydämissä on sairaus ja epäusko, sanoisivat: »Mitä tarkoittaa Jumala tällä vertauksella?» Näin johtaa Jumala harhaan kenet haluaa ja ohjaa ketä mielii, eikä Herrasi sotajoukkoja tunne kukaan muu kuin Hän itse, tämä on vain muistutus kuolevaisille.",
                            "verse 74:32": "Ei milloinkaan!",
                            "verse 74:33": "Vakuutan kuun ja valkenevan yön nimessä",
                            "verse 74:34": "sekä aamun nimessä, kun sen valkeus sarastaa:",
                            "verse 74:35": "tämä on totisesti ankarampia asioista,",
                            "verse 74:36": "varoitus ihmiselle,",
                            "verse 74:37": "jokaiselle teistä, joka tahtoo päästä eteenpäin tai jäädä jälkeen:",
                            "verse 74:38": "jokainen sielu on vastuussa teoistaan,",
                            "verse 74:39": "paitsi ne, jotka ovat (Jumalan) oikealla puolella.",
                            "verse 74:40": "Ollessaan paratiisissa nämä kyselevät toisiltaan",
                            "verse 74:41": "syntisten kohtaloa:",
                            "verse 74:42": "»Mikä on saattanut teidät tulen ruoaksi?»",
                            "verse 74:43": "Ja nämä vastaavat: »Me emme kuuluneet niihin, jotka rukoilivat,",
                            "verse 74:44": "emmekä niihin, jotka ruokkivat köyhiä,",
                            "verse 74:45": "vaan haastoimme joutavia niiden kanssa, jotka turhia puhuivat;",
                            "verse 74:46": "me pidimme puhetta tuomiopäivästä valheena,",
                            "verse 74:47": "kunnes kuolema yllätti meidät.",
                            "verse 74:48": "Niinpä ei heitä enää hyödytä puolustajain apu.",
                            "verse 74:49": "Mutta miksi he kääntyvät pois muistuttajasta",
                            "verse 74:50": "kuin säikkyneet aasit,",
                            "verse 74:51": "jotka pakenevat kuullessaan leijonan karjunnan?",
                            "verse 74:52": "Jokainen heistä odottaa erikoiskutsua.",
                            "verse 74:53": "Mutta eiväthän he pelkää tulevaa elämää.",
                            "verse 74:54": "Ei! Tämä on totisesti varoitus,",
                            "verse 74:55": "ja kukin halukas voi painaa sen mieleensä.",
                            "verse 74:56": "Mutta he eivät tahdo pitää sitä mielessään, ellei se ole Jumalan tahto."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 74:1": "O toi qui es couvert d'un manteau !",
                            "verse 74:2": "Lève-toi et avertis !",
                            "verse 74:3": "Magnifie ton Seigneur !",
                            "verse 74:4": "Purifie tes vêtements !",
                            "verse 74:5": "Fuis l'abomination !",
                            "verse 74:6": "Ne donne pas pour obtenir davantage.",
                            "verse 74:7": "Sois patient envers ton Seigneur !",
                            "verse 74:8": "Lorsqu'on sonnera de la trompette,",
                            "verse 74:9": "ce Jour sera un Jour pénible,",
                            "verse 74:10": "un Jour peu facile pour les mécréants.",
                            "verse 74:11": "Laisse-Moi seul avec celui que J'ai créé à Moi seul,",
                            "verse 74:12": "que j'ai pourvu d'une vaste fortune",
                            "verse 74:13": "et de fils pour l'entourer.",
                            "verse 74:14": "Pour lui J'ai tout aplani,",
                            "verse 74:15": "et il voudrait davantage.",
                            "verse 74:16": "Rien de cela !, car il s'est obstiné à nier Nos signes ;",
                            "verse 74:17": "bientôt, Je lui ferai gravir une montagne de calamités.",
                            "verse 74:18": "Il a bien réfléchi et il a décidé.",
                            "verse 74:19": "Qu'il périsse donc comme il a décidé !",
                            "verse 74:20": "De vrai, comme il a décidé !",
                            "verse 74:21": "Ensuite, il a regardé,",
                            "verse 74:22": "puis il a froncé le sourcil et s'est renfrogné ;",
                            "verse 74:23": "puis il a tourné le dos et s'est enflé d'orgueil.",
                            "verse 74:24": "Il a dit : \" Ce n'est que magie apprise des Anciens !",
                            "verse 74:25": "Ce n'est que la parole d'un mortel ! \"",
                            "verse 74:26": "Je vais le jeter dans le Feu ardent (Saqar)",
                            "verse 74:27": "Mais qui te fera connaître ce qu'est Saqar ?",
                            "verse 74:28": "Il ne laisse rien subsister et il ne lâche pas prise ;",
                            "verse 74:29": "il brûle la peau des mortels et la noircit.",
                            "verse 74:30": "Dix-neuf y sont assignés.",
                            "verse 74:31": "Nous n'avons pris comme gardiens du Feu que des anges, et Nous n'avons choisi ce nombre que pour éprouver ceux qui mécroient, et afin que ceux qui ont reçu le Livre acquièrent la certitude ; pour qu'augmente la foi des croyants ; pour que ceux qui ont reçu le Livre et les croyants ne doutent plus ; pour que ceux dont les cœurs sont atteints d'un mal disent, avec les mécréants : \" Que Dieu veut-il signifier par cette parabole ? \" C'est ainsi que Dieu égare qui Il veut et qu'Il dirige qui Il veut.",
                            "verse 74:32": "Assurément, [J'en jure] par la lune,",
                            "verse 74:33": "et par la nuit quand elle se retire,",
                            "verse 74:34": "et par l'aurore quand elle jaunit !",
                            "verse 74:35": "Il s'agit là d'une chose gravissime,",
                            "verse 74:36": "d'un avertissement pour les mortels,",
                            "verse 74:37": "pour ceux d'entre vous qui veulent avancer ou rester en arrière.",
                            "verse 74:38": "Toute âme se porte caution pour ce qu'elle a accompli,",
                            "verse 74:39": "à l'exception des compagnons de la droite.",
                            "verse 74:40": "Ceux-ci, dans les Jardins, s'interrogent entre eux",
                            "verse 74:41": "au sujet des coupables :",
                            "verse 74:42": "\" Qu'est-ce qui vous a conduits dans Saqar ? \"",
                            "verse 74:43": "Ils répondront : \" Nous n'étions pas au nombre de ceux qui prient ;",
                            "verse 74:44": "nous ne nourrissions pas le pauvre ;",
                            "verse 74:45": "nous discutions vainement avec des beaux parleurs ;",
                            "verse 74:46": "nous traitions de mensonge le Jour du Jugement",
                            "verse 74:47": "jusqu'à ce que nous vienne la certitude \".",
                            "verse 74:48": "La médiation des intercesseurs ne leur servira de rien.",
                            "verse 74:49": "Qu'ont-ils donc à se détourner du Rappel,",
                            "verse 74:50": "comme des onagres affolés",
                            "verse 74:51": "s'enfuient devant un lion ?",
                            "verse 74:52": "Chacun d'eux voudrait qu'on lui apporte des feuillets déployés.",
                            "verse 74:53": "Certes non !.",
                            "verse 74:54": "Certes non!.",
                            "verse 74:55": "Quiconque le veut s'en souviendra.",
                            "verse 74:56": "Mais ils ne s'en souviendront que si Dieu le veut, Lui qui seul est digne d'être craint et capable d'accorder le pardon ! souviendra."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 74:1": "ô, toi (Muhammad) ! Le revêtu d’un manteau !",
                            "verse 74:2": "Lève-toi et avertis.",
                            "verse 74:3": "Et de ton Seigneur, célèbre la grandeur.",
                            "verse 74:4": "Et tes vêtements, purifie-les.",
                            "verse 74:5": "Et de tout péché, écarte-toi.",
                            "verse 74:6": "Et ne donne pas dans le but de recevoir davantage.",
                            "verse 74:7": "Et pour ton Seigneur, endure.",
                            "verse 74:8": "Quand on sonnera du Clairon,",
                            "verse 74:9": "alors, ce jour-là sera un jour difficile,",
                            "verse 74:10": "pas facile pour les mécréants.",
                            "verse 74:11": "Laisse-Moi avec celui que J’ai créé seul,",
                            "verse 74:12": "et à qui J’ai donné des biens étendus,",
                            "verse 74:13": "et des enfants qui lui tiennent toujours compagnie,",
                            "verse 74:14": "pour qui aussi J’ai aplani toutes difficultés.",
                            "verse 74:15": "Cependant, il convoite [de Moi] que Je lui donne davantage.",
                            "verse 74:16": "Pas du tout ! Car il reniait nos versets (le Coran) avec entêtement.",
                            "verse 74:17": "Je vais le contraindre à gravir une pente.",
                            "verse 74:18": "Il a réfléchi.",
                            "verse 74:19": "Qu’il périsse ! Comme il a décidé !",
                            "verse 74:20": "Encore une fois, qu’il périsse; comme il a décidé !",
                            "verse 74:21": "Ensuite, il a regardé.",
                            "verse 74:22": "Et il s’est renfrogné et a durci son visage.",
                            "verse 74:23": "Ensuite il a tourné le dos et s’est enflé d’orgueil.",
                            "verse 74:24": "Puis il a dit : «Ceci (le Coran) n’est que magie apprise",
                            "verse 74:25": "ce n’est là que la parole d’un humain».",
                            "verse 74:26": "Je vais le brûler dans le Feu intense (Saqar).",
                            "verse 74:27": "Et qui te dira ce qu’est Saqar ?",
                            "verse 74:28": "Il ne laisse rien et n’épargne rien;",
                            "verse 74:29": "Il brûle la peau et la noircit.",
                            "verse 74:30": "Ils sont dix neuf à y veiller.",
                            "verse 74:31": "Nous n’avons assigné comme gardiens du Feu que les Anges.",
                            "verse 74:32": "Non ! .",
                            "verse 74:33": "Et par la nuit quand elle se retire !",
                            "verse 74:34": "Et par l’aurore quand elle se découvre !",
                            "verse 74:35": "",
                            "verse 74:36": "est l’un des plus grandes",
                            "verse 74:37": "un avertissement, pour les humains.",
                            "verse 74:38": "Pour qui d’entre vous, veut avancer ou reculer.",
                            "verse 74:39": "Toute âme est l’otage de ce qu’elle a acquis.",
                            "verse 74:40": "Sauf les gens de la droite (les élus) :",
                            "verse 74:41": "dans des Jardins, ils s’interrogeront",
                            "verse 74:42": "au sujet des criminels :",
                            "verse 74:43": "«Qu’est-ce qui vous a acheminés à Saqar ? »",
                            "verse 74:44": "Ils diront : «Nous n’étions pas de ceux qui faisaient la Salat,",
                            "verse 74:45": "et nous ne nourrissions pas le pauvre,",
                            "verse 74:46": "et nous nous associions à ceux qui tenaient des conversations futiles,",
                            "verse 74:47": "et nous traitions de mensonge le jour de la Rétribution,",
                            "verse 74:48": "jusqu’à ce que nous vînt la vérité évidente [la mort]».",
                            "verse 74:49": "Ne leur profitera point donc, l’intercession des intercesseurs.",
                            "verse 74:50": "Qu’ont-ils à se détourner du Rappel ?",
                            "verse 74:51": "Ils sont comme des onagres épouvantés,",
                            "verse 74:52": "s’enfuyant devant un lion.",
                            "verse 74:53": "Chacun d’eux voudrait plutôt qu’on lui apporte des feuilles tout étalées.",
                            "verse 74:54": "Ah ! Non ! C’est plutôt qu’ils ne craignent pas l’au-delà.",
                            "verse 74:55": "Ah ! Non ! Ceci est vraiment un Rappel.",
                            "verse 74:56": "Quiconque veut, qu’il se le rappelle.",
                            "verse 74:57": "Mais ils ne se rappelleront que si Dieu veut."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "O du in den Mantel Gehüllter!",
                            "verse 74:2": "Erhebe dich und warne.",
                            "verse 74:3": "Deinen Herrn verherrliche.",
                            "verse 74:4": "Dein Herz läutere.",
                            "verse 74:5": "Meide den Götzendienst.",
                            "verse 74:6": "Und erweise nicht Huld, indem du Mehrung suchst.",
                            "verse 74:7": "Und dulde standhaft um deines Herrn willen;",
                            "verse 74:8": "Denn, wenn in die Posaune gestoßen wird,",
                            "verse 74:9": "Der Tag wird ein schwerer Tag sein,",
                            "verse 74:10": "Für die Ungläubigen alles eher als leicht.",
                            "verse 74:11": "Laß Mich allein mit dem, den Ich geschaffen,",
                            "verse 74:12": "Und dem Ich Besitz in Fülle verlieh,",
                            "verse 74:13": "Und Söhne, die immer da waren,",
                            "verse 74:14": "Und für den Ich alle Bequemlichkeit bereitete.",
                            "verse 74:15": "Dennoch wünscht er, daß Ich noch mehr gebe.",
                            "verse 74:16": "Mit nichten! denn er ist feindselig gewesen gegen Unsere Zeichen.",
                            "verse 74:17": "Aufbürden will Ich ihm bald schreckliche Mühsal.",
                            "verse 74:18": "Siehe, er sann und er wog!",
                            "verse 74:19": "Verderben über ihn! Wie wog er!",
                            "verse 74:20": "Verderben über ihn abermals! Wie wog er!",
                            "verse 74:21": "Dann schaute er,",
                            "verse 74:22": "Dann runzelte er die Stirn und blickte verdrießlich,",
                            "verse 74:23": "Dann wandte er sich ab und war hoffärtig",
                            "verse 74:24": "Und sprach: «Das ist nichts als Zauberei, die weitergetragen wird;",
                            "verse 74:25": "Das ist nur Menschenwort.",
                            "verse 74:26": "Bald werde Ich ihn ins Feuer der Hölle werfen.",
                            "verse 74:27": "Und wie kannst du wissen, was Höllenfeuer ist?",
                            "verse 74:28": "Es verschont nichts und läßt nichts übrig;",
                            "verse 74:29": "Es versengt das Gesicht.",
                            "verse 74:30": "Über ihm sind neunzehn,",
                            "verse 74:31": "Und Wir haben einzig und allein Engel zu Hütern des Feuers gemacht.",
                            "verse 74:32": "Nein, bei dem Mond,",
                            "verse 74:33": "Und bei der Nacht, wenn sie sich entfernt,",
                            "verse 74:34": "Und bei der Morgendämmerung, wenn sie scheint,",
                            "verse 74:35": "Wahrlich, es ist eine der größten (Heimsuchungen) -",
                            "verse 74:36": "Eine Warnung für den Menschen,",
                            "verse 74:37": "Für den unter euch, der vorwärts schreiten oder zurückbleiben will.",
                            "verse 74:38": "Jede Seele ist ein Pfand für das, was sie verdient hat;",
                            "verse 74:39": "Ausgenommen die zur Rechten,",
                            "verse 74:40": "In Gärten einander befragend",
                            "verse 74:41": "Nach den Sündern:",
                            "verse 74:42": "«Was hat euch in das Feuer der Hölle gebracht?»",
                            "verse 74:43": "Sie werden sprechen: «Wir waren nicht unter denen, die beteten,",
                            "verse 74:44": "Noch speisten wir die Armen.",
                            "verse 74:45": "Und wir ergingen uns in eitlem Geschwätz mit den Schwätzern.",
                            "verse 74:46": "Und wir pflegten den Tag des Gerichtes zu leugnen,",
                            "verse 74:47": "Bis der Tod uns ereilte.",
                            "verse 74:48": "Drum wird ihnen die Fürsprache der Fürsprecher nicht nützen.",
                            "verse 74:49": "Was ist ihnen denn, daß sie sich von der Ermahnung abwenden,",
                            "verse 74:50": "Als wären sie erschreckte Esel,",
                            "verse 74:51": "Die vor einem Löwen flüchten?",
                            "verse 74:52": "Nein, jedermann von ihnen wünscht, es möchten ihm offene Tafeln der Offenbarung gegeben werden.",
                            "verse 74:53": "Keineswegs! wahrlich, sie fürchten nicht das Jenseits.",
                            "verse 74:54": "Keineswegs! wahrlich, dies ist eine Ermahnung.",
                            "verse 74:55": "So möge, wer da will, ihrer gedenken.",
                            "verse 74:56": "Und sie werden sich nicht ermahnen lassen, bis Allah so will."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": ",s ¼esjs½ diM+k vks<+us okys ¼jlwy½ mBks",
                            "verse 74:2": "vkSj yksxksa dks ¼vt+kc ls½ Mjkvks",
                            "verse 74:3": "vkSj vius ijojfnxkj dh cM+kbZ djks",
                            "verse 74:4": "vkSj vius diM+s ikd j[kks",
                            "verse 74:5": "vkSj xUnxh ls vyx jgks",
                            "verse 74:6": "vkSj blh rjg ,glku u djks fd T+;knk ds [+kkLrxkj cuks",
                            "verse 74:7": "vkSj vius ijojfnxkj ds fy, lcz djks",
                            "verse 74:8": "fQj tc lwj Qw¡dk tk,xk",
                            "verse 74:9": "rks og fnu dkfQ+jksa ij l[+r fnu gksxk",
                            "verse 74:10": "vklku ugha gksxk",
                            "verse 74:11": "¼,s jlwy½ eq>s vkSj ml Ó[+l dks NksM+ nks ftls eSus vdsyk iSnk fd;k",
                            "verse 74:12": "vkSj mls cgqr lk eky fn;k",
                            "verse 74:13": "vkSj ut+j ds lkeus jgus okys csVs ¼fn,½",
                            "verse 74:14": "vkSj mls gj rjg ds lkeku ls oqlvr nh",
                            "verse 74:15": "fQj ml ij Hkh og rekv j[krk gS fd eSa vkSj c<+kÅ¡",
                            "verse 74:16": ";s gjfxt+ u gksxk ;s rks esjh vk;rksa dk nq’eu Fkk",
                            "verse 74:17": "rks eSa vud+jhc ml l[+r vt+kc esa eqfCryk d:¡xk",
                            "verse 74:18": "mlus fQdz dh vkSj ;s rtoht+ dh",
                            "verse 74:19": "rks ;s ¼dEc[+r½ ekj Mkyk tk,",
                            "verse 74:20": "mlus D;ksa dj rtoht+ dh",
                            "verse 74:21": "fQj x+kSj fd;k",
                            "verse 74:22": "fQj R;ksjh p<+kbZ vkSj eq¡g cuk fy;k",
                            "verse 74:23": "fQj ihB Qsj dj pyk x;k vkSj vdM+ cSBk",
                            "verse 74:24": "fQj dgus yxk ;s cl tknw gS tks ¼vxyksa ls½ pyk vkrk gS",
                            "verse 74:25": ";s rks cl vkneh dk dyke gS",
                            "verse 74:26": "¼[+kqnk dk ugha½ eSa mls vud+jhc tgUuqe esa >ksad nw¡xk",
                            "verse 74:27": "vkSj rqe D;k tkuksa fd tgUuqe D;k gS",
                            "verse 74:28": "og u ckd+h j[ksxh u NksM+ nsxh",
                            "verse 74:29": "vkSj cnu dks tyk dj fl;kg dj nsxh",
                            "verse 74:30": "ml ij mUuhl ¼Q+fj’rs eqv¸;u½ gSa",
                            "verse 74:31": "vkSj geus tgUuqe dk fuxsgcku rks cl Qfj’rksa dks cuk;k gS vkSj mudk ;s Óqekj Hkh dkfQjksa dh vkt+ekb’k ds fy, eqd+jZj fd;k rkfd ,gys fdrkc ¼QkSju½ ;d+hu dj ysa vkSj eksfeuks dk bZeku vkSj T+;knk gks vkSj vgys fdrkc vkSj eksfeuhu ¼fdlh rjg½ Ód u djsa vkSj ftu yksxksa ds fny esa ¼fuQ+kd dk½ et+Z gS ¼og½ vkSj dkfQj yksx dg cSBs fd bl ely ¼ds c;ku djus½ ls [+kqnk dk D;k eryc gS ;w¡ [+kqnk ftls pkgrk gS xqejkgh esa NksM+ nsrk gS vkSj ftls pkgrk gS fgnk;r djrk gS vkSj rqEgkjs ijojfnxkj ds y’kdjksa dks mlds flok dksbZ ugha tkurk vkSj ;s rks vknfe;ksa ds fy, cl ulhgr gS",
                            "verse 74:32": "lqu j[kks ¼gesa½ pk¡n dh d+le",
                            "verse 74:33": "vkSj jkr dh tc tkus yxs",
                            "verse 74:34": "vkSj lqcg dh tc jkS’ku gks tk,",
                            "verse 74:35": "fd og ¼tgUuqe½ Hkh ,d cgqr cM+h ¼vkQ+r½ gS",
                            "verse 74:36": "¼vkSj½ yksxksa ds Mjkus okyh gS",
                            "verse 74:37": "¼lcds fy, ughsa cfYd½ rqeesa ls og tks Ó[+l ¼usdh dh rjQ+½ vkxs c<+uk",
                            "verse 74:38": "vkSj ¼cqjkbZ ls½ ihNs gVuk pkgs gj Ó[+l vius vkeky ds cnys fxnZ gS",
                            "verse 74:39": "exj nkfgus gkFk ¼esa uke, vey ysus½ okys",
                            "verse 74:40": "¼csfg’r ds½ ckx+ksa esa xqusgxkjksa ls ckge iwN jgs gksaxs",
                            "verse 74:41": "fd vkf[+kj rqEgsa nkst+[+k esa dkSu lh pht+ ¼?klhV½ yk;h",
                            "verse 74:42": "og yksx dgsaxs",
                            "verse 74:43": "fd ge u rks uekt+ i<+k djrs Fks",
                            "verse 74:44": "vkSj u eksgrktksa dks [kkuk f[kykrs Fks",
                            "verse 74:45": "vkSj ,gys ckfry ds lkFk ge Hkh cM+ss dke esa ?kql iM+rs Fks",
                            "verse 74:46": "vkSj jkst+ tt+k dks >qByk;k djrs Fks ¼vkSj ;w¡ gh jgs½",
                            "verse 74:47": ";gk¡ rd fd gesa ekSr vk x;h",
                            "verse 74:48": "rks ¼ml oD+r½ mUgsa flQ+kfj’k djus okyksa dh flQ+kfj’k dqN dke u vk,xh",
                            "verse 74:49": "vkSj mUgsa D;k gks x;k gS fd ulhgr ls eq¡g eksM+s gq, gSa",
                            "verse 74:50": "xks;k og og’kh x/ks gSa",
                            "verse 74:51": "fd Ósj ls ¼nqe nck dj½ Hkkxrs gSa",
                            "verse 74:52": "vly ;s gS fd muesa ls gj Ó[+l bldk eqrebuh gS fd mls [kqyh gq;h ¼vklekuh½ fdrkcsa vrk dh tk,¡",
                            "verse 74:53": ";s rks gjfxt+ u gksxk cfYd ;s rks vk[+ksjr gh ls ugha Mjrs",
                            "verse 74:54": "gk¡ gk¡ cs’kd ;s ¼d+qjku ljk lj½ ulhgr gS",
                            "verse 74:55": "rks tks pkgs mls ;kn j[ks",
                            "verse 74:56": "vkSj [+kqnk dh e’kh;r ds cx+Sj ;s yksx ;kn j[kus okys ugha ogh ¼cUnksa ds½ Mjkus ds d+kfcy vkSj cf[+Ó’k dk ekfyd gS"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "Hai orang yang berkemul (berselimut),",
                            "verse 74:2": "bangunlah, lalu berilah peringatan!",
                            "verse 74:3": "dan Tuhanmu agungkanlah,",
                            "verse 74:4": "dan pakaianmu bersihkanlah,",
                            "verse 74:5": "dan perbuatan dosa (menyembah berhala) tinggalkanlah,",
                            "verse 74:6": "dan janganlah kamu memberi (dengan maksud) memperoleh (balasan) yang lebih banyak.",
                            "verse 74:7": "Dan untuk (memenuhi perintah) Tuhanmu, bersabarlah.",
                            "verse 74:8": "Apabila ditiup sangkakala,",
                            "verse 74:9": "maka waktu itu adalah waktu (datangnya) hari yang sulit,",
                            "verse 74:10": "bagi orang-orang kafir lagi tidak mudah.",
                            "verse 74:11": "Biarkanlah Aku bertindak terhadap orang yang Aku telah menciptakannya sendirian.",
                            "verse 74:12": "Dan Aku jadikan baginya harta benda yang banyak,",
                            "verse 74:13": "dan anak-anak yang selalu bersama dia,",
                            "verse 74:14": "dan Ku lapangkan baginya (rezeki dan kekuasaan) dengan selapang-lapangnya,",
                            "verse 74:15": "kemudian dia ingin sekali supaya Aku menambahnya.",
                            "verse 74:16": "Sekali-kali tidak (akan Aku tambah), karena sesungguhnya dia menentang ayat-ayat Kami (Al Qur'an).",
                            "verse 74:17": "Aku akan membebaninya mendaki pendakian yang memayahkan.",
                            "verse 74:18": "Sesungguhnya dia telah memikirkan dan menetapkan (apa yang ditetapkannya),",
                            "verse 74:19": "maka celakalah dia! Bagaimanakah dia menetapkan?,",
                            "verse 74:20": "Kemudian celakalah dia! Bagaimanakah dia menetapkan?,",
                            "verse 74:21": "Kemudian dia memikirkan,",
                            "verse 74:22": "sesudah itu dia bermasam muka dan merengut,",
                            "verse 74:23": "kemudian dia berpaling (dari kebenaran) dan menyombongkan diri,",
                            "verse 74:24": "lalu dia berkata: \"(Al Qur'an) ini tidak lain hanyalah sihir yang dipelajari (dari orang-orang dahulu),",
                            "verse 74:25": "ini tidak lain hanyalah perkataan manusia\".",
                            "verse 74:26": "Aku akan memasukkannya ke dalam (neraka) Saqar.",
                            "verse 74:27": "Tahukah kamu apa (neraka) Saqar itu?",
                            "verse 74:28": "Saqar itu tidak meninggalkan dan tidak membiarkan.",
                            "verse 74:29": "(Neraka Saqar) adalah pembakar kulit manusia.",
                            "verse 74:30": "Di atasnya ada sembilan belas (malaikat penjaga).",
                            "verse 74:31": "Dan tiada Kami jadikan penjaga neraka itu melainkan dari malaikat; dan tidaklah Kami menjadikan bilangan mereka itu melainkan untuk jadi cobaan bagi orang-orang kafir, supaya orang-orang yang diberi Al Kitab menjadi yakin dan supaya orang yang beriman bertambah imannya dan supaya orang-orang yang diberi Al-Kitab dan orang-orang mu’min itu tidak ragu-ragu dan supaya orang-orang yang di dalam hatinya ada penyakit dan orang-orang kafir (mengatakan): \"Apakah yang dikehendaki Allah dengan bilangan ini sebagai suatu perumpamaan?\" Demikianlah Allah menyesatkan orang-orang yang dikehendaki-Nya dan memberi petunjuk kepada siapa yang dikehendaki-Nya.",
                            "verse 74:32": "Sekali-kali tidak, demi bulan,",
                            "verse 74:33": "dan malam ketika telah berlalu,",
                            "verse 74:34": "dan subuh apabila mulai terang.",
                            "verse 74:35": "Sesungguhnya Saqar itu adalah salah satu bencana yang amat besar,",
                            "verse 74:36": "sebagai ancaman bagi manusia.",
                            "verse 74:37": "(yaitu) bagi siapa di antaramu yang berkehendak akan maju atau mundur.",
                            "verse 74:38": "Tiap-tiap diri bertanggung jawab atas apa yang telah diperbuatnya,",
                            "verse 74:39": "kecuali golongan kanan,",
                            "verse 74:40": "berada di dalam surga, mereka tanya menanya,",
                            "verse 74:41": "tentang (keadaan) orang-orang yang berdosa,",
                            "verse 74:42": "\"Apakah yang memasukkan kamu ke dalam Saqar (neraka)?\"",
                            "verse 74:43": "Mereka menjawab: \"Kami dahulu tidak termasuk orang-orang yang mengerjakan shalat,",
                            "verse 74:44": "dan kami tidak (pula) memberi makan orang miskin,",
                            "verse 74:45": "dan adalah kami membicarakan yang batil, bersama dengan orang-orang yang membicarakannya,",
                            "verse 74:46": "dan adalah kami mendustakan hari pembalasan,",
                            "verse 74:47": "hingga datang kepada kami kematian\".",
                            "verse 74:48": "Maka tidak berguna lagi bagi mereka syafa’at dari orang-orang yang memberikan syafa’at.",
                            "verse 74:49": "Maka mengapa mereka (orang-orang kafir) berpaling dari peringatan (Allah)?\",",
                            "verse 74:50": "seakan-akan mereka itu keledai liar yang lari terkejut,",
                            "verse 74:51": "lari daripada singa.",
                            "verse 74:52": "Bahkan tiap-tiap orang dari mereka berkehendak supaya diberikan kepadanya lembaran-lembaran yang terbuka.",
                            "verse 74:53": "Sekali-kali tidak.",
                            "verse 74:54": "Sekali-kali tidak demikian halnya.",
                            "verse 74:55": "Maka barang siapa menghendaki, niscaya dia mengambil pelajaran daripadanya (Al Qur'an).",
                            "verse 74:56": "Dan mereka tidak akan mengambil pelajaran daripadanya kecuali (jika) Allah menghendakinya."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "O tu che sei avvolto nel mantello,",
                            "verse 74:2": "alzati e ammonisci,",
                            "verse 74:3": "e il tuo Signore magnifica,",
                            "verse 74:4": "e le tue vesti purifica,",
                            "verse 74:5": "allontanati dall'abiezione .",
                            "verse 74:6": "Non dar nulla sperando di ricevere di più,",
                            "verse 74:7": "ma sopporta con pazienza per il tuo Signore!",
                            "verse 74:8": "Quando sarà soffiato nella Corno,",
                            "verse 74:9": "quello sarà un Giorno difficile,",
                            "verse 74:10": "niente affatto facile per i miscredenti.",
                            "verse 74:11": "LasciaMi solo con colui che ho creato ,",
                            "verse 74:12": "cui ho concesso abbondanza di beni,",
                            "verse 74:13": "e figli al suo fianco,",
                            "verse 74:14": "al quale ho facilitato ogni cosa,",
                            "verse 74:15": "e che ancora desidera che gli dia di più.",
                            "verse 74:16": "No, invero è stato refrattario ai Nostri segni:",
                            "verse 74:17": "lo costringerò a una dura salita .",
                            "verse 74:18": "Ha ponderato e l'ha definito .",
                            "verse 74:19": "Perisca per come l'ha definito,",
                            "verse 74:20": "Sí, perisca per come l'ha definito!",
                            "verse 74:21": "Quindi ha guardato,",
                            "verse 74:22": "si è accigliato e rabbuiato.",
                            "verse 74:23": "Ha volto le spalle, si è fatto altero",
                            "verse 74:24": "e ha detto: « Questo non è che magia appresa;",
                            "verse 74:25": "non è altro che un discorso di un uomo » .",
                            "verse 74:26": "Lo getterò nel Calore che brucia .",
                            "verse 74:27": "Chi mai ti dirà cos'è il Calore che brucia ?",
                            "verse 74:28": "Nulla risparmia, non lascia nulla;",
                            "verse 74:29": "carbonizza gli uomini.",
                            "verse 74:30": "Gli stanno a guardia diciannove .",
                            "verse 74:31": "",
                            "verse 74:32": "Non ponemmo che angeli a guardia del fuoco, fissando il loro numero solo per tentare i miscredenti, affinché credessero con fermezza quelli cui è stato dato il Libro e aumentasse la fede dei credenti e non dubitassero coloro cui è stata data la Scrittura e i credenti, e affinché coloro che hanno morbo nel cuore e i miscredenti dicessero: « Cosa vuol significare Allah con questa metafora ?».",
                            "verse 74:33": "No, per la luna,",
                            "verse 74:34": "per la notte quando volge al termine,",
                            "verse 74:35": "e per l'aurora quando si mostra,",
                            "verse 74:36": "[il Calore è davvero uno dei più segni più grandi,",
                            "verse 74:37": "un monito per gli uomini,",
                            "verse 74:38": "per chi di voi vuole avanzare [nella fede] o indietreggiare.",
                            "verse 74:39": "Ogni anima è pegno di quello che ha compiuto,",
                            "verse 74:40": "eccetto i compagni della destra;",
                            "verse 74:41": "",
                            "verse 74:42": "nei Giardini e si interpelleranno a vicenda",
                            "verse 74:43": "a proposito dei colpevoli:",
                            "verse 74:44": "« Cosa mai vi ha condotti al Calore che brucia?».",
                            "verse 74:45": "Risponderanno: « Non eravamo tra coloro che eseguivamo l'orazionet,",
                            "verse 74:46": "né nutrivamo il povero,",
                            "verse 74:47": "e chiacchieravamo vanamente con i chiacchieroni",
                            "verse 74:48": "e tacciavamo di menzogna il Giorno del Giudizio,",
                            "verse 74:49": "finché non ci pervenne la certezza».",
                            "verse 74:50": "Non gioverà loro l'intercessione di intercessori.",
                            "verse 74:51": "Ma perché mai si scostano dal Monito?",
                            "verse 74:52": "Sembravano onagri spaventati",
                            "verse 74:53": "che fuggono davanti a un leone!",
                            "verse 74:54": "Ciascuno di loro vorrebbe che gli fossero dati fogli dispiegati .",
                            "verse 74:55": "No, non hanno invece alcun timore dell'Altra vita!",
                            "verse 74:56": "No, in verità questo è un Monito.",
                            "verse 74:57": "Se ne ricordi dunque chi vuole.",
                            "verse 74:58": "Ma non se ne ricorderanno altrimenti che se Allah vuole."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "（大衣に）包る者よ，",
                            "verse 74:2": "立ち上って警告しなさい。",
                            "verse 74:3": "あなたの主を讃えなさい。",
                            "verse 74:4": "またあなたの衣を清潔に保ちなさい。",
                            "verse 74:5": "不浄を避けなさい。",
                            "verse 74:6": "見返りを期待して施してはならない。",
                            "verse 74:7": "あなたの主の（道の）ために，耐え忍びなさい。",
                            "verse 74:8": "ラッパが吹かれる時，",
                            "verse 74:9": "その日は苦難の日。",
                            "verse 74:10": "不信者たちにとり，安らぎのない（日である）。",
                            "verse 74:11": "われが創った者を，われ一人に任せなさい。",
                            "verse 74:12": "われは，かれに豊かな富を授け，",
                            "verse 74:13": "またその回りに，息子たちを侍らせ，",
                            "verse 74:14": "かれのために，（物事を）円満容易にした。",
                            "verse 74:15": "それでもかれは，われが更に豊かにするよう欲した。",
                            "verse 74:16": "断じて許されない。かれは，わが印に対し頑迷であった。",
                            "verse 74:17": "やがてわれは，酪い痛苦でかれを悩ますであろう。",
                            "verse 74:18": "かれは想を練り，策謀した。",
                            "verse 74:19": "かれは滅びるであろう。何と（惑意をもって）かれらは策謀したことよ。",
                            "verse 74:20": "重ねていう。かれは滅びるであろう。何とかれは策謀したことよ。",
                            "verse 74:21": "その時，かれはちらっと（クルアーンを）眺め，",
                            "verse 74:22": "眉をひそめ，苦い顔をして，",
                            "verse 74:23": "それから，高慢に背を向けて去った。",
                            "verse 74:24": "かれは言った。「これは昔からの魔術に過ぎません。",
                            "verse 74:25": "どうみても人間の言葉に過ぎません。」",
                            "verse 74:26": "やがてわれは地獄の火て，かれを焼くであろう。",
                            "verse 74:27": "地獄の火が何であるかを，あなたに理解させるものは何か。",
                            "verse 74:28": "それは何ものも免れさせず，また何ものも残さない。",
                            "verse 74:29": "人の皮膚を，黒く焦がす。",
                            "verse 74:30": "その上には19（の天使が看守る）。",
                            "verse 74:31": "われが業火の看守として，天使たちの外に誰も命じなかった。またかれらの数を限定したことは，不信心の者たちに対する一つの試みに過ぎない。（それにより）啓典を授けられた者たちを確信させ，また信じる者の信仰を深めるためである。また啓典を授けられた者や信者たちが，疑いを残さず，またその心に病の宿る者や，不信者たちに，「アッラーはこの比喩で，何を御望みになるのでしょうか。」と言わせるためである。このようにアッラーは，御自分の望みの者を迷わせ，また望みの者を導かれる。そしてかれの外誰もあなたの主の軍勢を知らないのである。本当にこれは人間に対する訓戒に外ならない。",
                            "verse 74:32": "いや，月に誓けて，",
                            "verse 74:33": "退こうとする，夜に誓けて，",
                            "verse 74:34": "また輝こうとする，暁に誓けて（誓う）。",
                            "verse 74:35": "それは大きな（徴の）一つであり，",
                            "verse 74:36": "人間への警告。",
                            "verse 74:37": "あなたがたの中，前に進むことを望む者，また後に残ることを願う者への（警告である）。",
                            "verse 74:38": "それぞれの魂は，その行ったことに対し，（アッラーに）担保を提供している。",
                            "verse 74:39": "右手の仲間は別である。",
                            "verse 74:40": "（かれらは）楽園の中にいて，互いに尋ね合うであろう。",
                            "verse 74:41": "罪を犯した者たちに就いて，",
                            "verse 74:42": "「何が，あなたがたを烈火の中に導いたのですか。」と。",
                            "verse 74:43": "かれらは（答えて）言う。「わたしたちは礼拝を捧げていませんでした。",
                            "verse 74:44": "わたしたちはまた，貧者を養いませんでした。",
                            "verse 74:45": "わたしたちは空論の徒と共に無駄話に耽り，",
                            "verse 74:46": "常に審判の日を否定していました。",
                            "verse 74:47": "遂に真実が，わたしたちに到来しました。」",
                            "verse 74:48": "それで執り成す者の執り成しも，かれらに役立たないであろう。",
                            "verse 74:49": "一体訓戒から背き去るとは，かれらはどうしたのであろう。",
                            "verse 74:50": "かれらは丁度獅子を見て恐� に陥ったロバのように，",
                            "verse 74:51": "一目散に逃げ出すかのようであった。",
                            "verse 74:52": "いや，かれらはそれぞれ開かれた書巻が授けられることを望んでいる。",
                            "verse 74:53": "いや断してそうではない。かれらは来世を恐れていないのである。",
                            "verse 74:54": "いや，これは正に訓戒である。",
                            "verse 74:55": "だから誰でも欲する者には，それを肝に銘じさせなさい。",
                            "verse 74:56": "だが，アッラーが望まれる者の外は，留意しないであろう。かれは畏るべき御方よく許して下される御方である。 だから誰でも欲する者には，それを肝に銘じさせなさい。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "망투를 걸친 자여",
                            "verse 74:2": "일어나서 경고하라",
                            "verse 74:3": "그리고 그대 주님만을 찬양하고",
                            "verse 74:4": "그대의 망투를 청결케 할 것 이며",
                            "verse 74:5": "부정한 것을 피하고",
                            "verse 74:6": "필요 이상의 것을 주지 말며",
                            "verse 74:7": "주님을 위해 인내하라",
                            "verse 74:8": "나팔이 부는 그때",
                            "verse 74:9": "그날은 곧 재앙의 날이 될 것이라",
                            "verse 74:10": "그것은 불신자들을 위한 것 으로 평탄한 것이 아니라",
                            "verse 74:11": "내가 홀로 창조한 그를 내게맡기라",
                            "verse 74:12": "실로 나는 그에게 풍성함을 베풀어 주었고",
                            "verse 74:13": "자손들이 그와 함께 거주하 게 하였으니",
                            "verse 74:14": "내가 그에게 안락한 생활을 베풀었노라",
                            "verse 74:15": "그런데도 그는 내가 더하여 주기를 바라고 있느뇨",
                            "verse 74:16": "결코 그렇게 될 수 없나니 하나님의 예증들을 거역하였노라",
                            "verse 74:17": "곧 내가 그에게 산더미 같은재앙들을 가져다 주리라",
                            "verse 74:18": "그는 숙고하고서도 음모하 였으니",
                            "verse 74:19": "음모한 그에게 재앙이 있으 리라",
                            "verse 74:20": "그러하니라 음모하는 자에게재앙이 있을 것이라",
                            "verse 74:21": "그런 후 그는 생각하고",
                            "verse 74:22": "눈살을 찌푸리고 불쾌한 표 정을 하더라",
                            "verse 74:23": "외면하며 오만해 하더라",
                            "verse 74:24": "이것은 옛 선조들로부터 유 래된 마술에 불과하다고 말하고",
                            "verse 74:25": "이것은 한 인간의 말에 불과하다고 하였더라",
                            "verse 74:26": "그러므로 내가 곧 그를 볼지옥으로 이르게 하리라",
                            "verse 74:27": "그 불지옥이 무엇인지 무엇 이 그대에게 설명하여 주리요",
                            "verse 74:28": "그것은 아무것도 남기지 아 니하면 어느 누구도 남겨두지 아 니한 곳으로",
                            "verse 74:29": "인간을 그슬러 버리며",
                            "verse 74:30": "그 위에는 열 아홉이 있노라",
                            "verse 74:31": "하나님은 천사들을 불지옥의수호자들로 두었노라 그 숫자를 둔 것은 믿지 아니한 불신자들을 위한 시련으로써 그리고 성서의 백성들을 확신시키고 믿는 사람들의 신앙을 더하며 성서의 백성들 과 믿는 신도들이 의심하지 아니 하고 마음이 병든 자들과 불신자 들이 하나님은 이 비유로 무엇을 의도하려 하느뇨 라고 말하는 그 들을 시험하기 위해서라 이렇듯 하나님은 그분이 원하는 자를 방 황케 하사 그분이 원하는 자를 인도하시니 그분 외에는 어느 누구 도 주님의 수호자들을 알 수 없 노라 이것은 인간을 위한 교훈에 불과하니라",
                            "verse 74:32": "달을 두고 맹세하사",
                            "verse 74:33": "사라져 가는 밤을 두고 맹세하며",
                            "verse 74:34": "빛나는 아침을 두고 맹세하 나니",
                            "verse 74:35": "실로 그것은 가장 중대한 재앙 중의 하나라",
                            "verse 74:36": "그것은 인간을 위한 하나의 경고로",
                            "verse 74:37": "너희 중에 앞서려는 자와 유예하려는 자들을 위한 것이라",
                            "verse 74:38": "모든 인간은 그가 행한 행위 에 의해 저당이 되나",
                            "verse 74:39": "우편의 동료들은 제외로",
                            "verse 74:40": "이들은 천국으로 들어가 서 로가 서로에게 질문을 하며",
                            "verse 74:41": "죄인들에 관하여 묻고",
                            "verse 74:42": "무엇이 너희로 하여금 불지 옥에 들게 하였느뇨 라고 물으니",
                            "verse 74:43": "그들은 대답하길 저희는 예 배하는 자 중에 있지 아니하였으 며",
                            "verse 74:44": "가난한 사람들에게 자선을 베풀지 아니하고",
                            "verse 74:45": "무익한 잡담을 하는 자들과 공론을 하곤 했으며",
                            "verse 74:46": "심판의 날을 믿지 않고",
                            "verse 74:47": "심판의 날이 온다는 것을 부 인하였습니까",
                            "verse 74:48": "그리하여 어떤 중재자들의 중재도 그들에게 유용하지 못하리라",
                            "verse 74:49": "교훈을 거역한 그들이 어떻 게 되었느뇨",
                            "verse 74:50": "그들은 마치 놀란 당나귀들 이",
                            "verse 74:51": "한마리의 사자에 놀라 도망 치는 것과 같더라",
                            "verse 74:52": "실로 이들 각자는 펼쳐진 성서가 그들에게도 내려지기를 원하고 있느뇨",
                            "verse 74:53": "그것은 불가능한 것으로 그 들은 내세를 두려워 하지 않노라",
                            "verse 74:54": "실로 이것이 교훈이니",
                            "verse 74:55": "그것을 지키려 하는 자 그것을 기억케 하리라",
                            "verse 74:56": "그러나 하나님이 원하는 자 외에는 어느 누구도 그것을 기억 하려 하지 아니 하리라 그분은 두려워 해야 할 주님이요 관용의 주님이시라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "ئه‌ی ئه‌و که‌سه‌ی خۆت پێچاوه‌ته‌وه‌، ئه‌ی محمد صلی الله علیه وسلم",
                            "verse 74:2": "هه‌سته‌و خه‌ڵکی بێداربکه‌ره‌وه (ڕاستیه‌کان ڕوون بکه‌ره‌وه‌).",
                            "verse 74:3": "په‌روه‌ردگارت به گه‌وره ناوببه (الله اکبر، با دروشمت بێت، مه‌زنی ئه‌و زاته ڕوون بکه‌ره‌وه‌).",
                            "verse 74:4": "پۆشاکت (دڵ و ده‌روونت، ڕه‌فتارت، هه‌ر هه‌مووی) خاوێن بکه (خۆت و شوێنکه‌وتووانت).",
                            "verse 74:5": "به‌رده‌وام به له‌سه‌ر واز هێنان له گوناه.",
                            "verse 74:6": "منه‌تیش مه‌که (به‌سه‌ر که‌سدا) چاکه‌و به‌خشینه‌کانت به‌زۆر مه‌زانه له کاتێکدا به‌ته‌مای زیاتر بیت.",
                            "verse 74:7": "هه‌وڵ بده له‌به‌ر خاترو ڕێزی په‌روه‌ردگارت خۆگرو ئارامگربه‌.",
                            "verse 74:8": "جا کاتێك فوو ده‌کرێت به (صور) داو ده‌زگای تایبه‌تی لێ ده‌درێت.",
                            "verse 74:9": "ئه‌و ڕۆژه ڕۆژێکی زۆر گران و سه‌خته (که به‌سه‌ر دانیشتوانی زه‌ویدا دێت).",
                            "verse 74:10": "له‌سه‌ر کافران هیچ ئاسان نی یه (به‌ڵکو زۆر سه‌غڵه‌تیان ده‌کات).",
                            "verse 74:11": "واز له من و ئه‌و که‌سه بهێنه که به‌ته‌نهایی (تاقانه‌) دروستم کردووه (هیچی نه‌بوو، که وه‌لیدی کوڕی موغه‌یره‌یه‌).",
                            "verse 74:12": "له‌وه‌ودوا ماڵ و سامانی زۆرو زه‌به‌نده‌م پێبه‌خشی.",
                            "verse 74:13": "چه‌نده‌ها کوڕو نه‌وه‌ش که هه‌میشه ئاماده‌ن له نزیکیدا.",
                            "verse 74:14": "له هه‌موو که‌ل و په‌ل و نازو نیعمه‌تێك به‌هره‌وه‌رم کرد.",
                            "verse 74:15": "له پاش ئه‌وه‌ش به‌ته‌مایه بۆی زیاتر بکه‌م.",
                            "verse 74:16": "نه‌خێر، به‌ڕاستی ئه‌و به‌رامبه‌ر فه‌رمانه‌کانی ئێمه هه‌ر سه‌رکه‌ش و که‌لله ڕه‌ق و سه‌رسه‌خته‌.",
                            "verse 74:17": "ئه‌وسا سزای سه‌ختی پێ ئه‌چێژم.",
                            "verse 74:18": "به‌ڕاستی ئه‌و بیری کرده‌وه‌و په‌یامه‌که‌ی هه‌ڵسه‌نگاند (به‌ڵام به‌هه‌ڵه‌).",
                            "verse 74:19": "به‌کوشت چێ و سه‌ره‌و نگوون بێت، چۆن هه‌ڵسه‌نگاندنێکی کرد.",
                            "verse 74:20": "پاشان هه‌ر به‌کوشت بچێت بۆ خۆی و هه‌ڵسه‌نگاندنێك که کردی بۆ قورئان.",
                            "verse 74:21": "ئینجا بیری لێ کرده‌وه‌و ورد بۆوه‌و ته‌ماشای ده‌وروبه‌ری کرد.",
                            "verse 74:22": "ئینجا ناوچاوی هێنایه‌وه یه‌ك (وه‌ك یه‌کێك به‌قووڵی بیربکاته‌وه‌) ڕه‌ش داگیرسا.",
                            "verse 74:23": "پاشان ڕووی وه‌رگێڕاو خۆی به‌زلزانی.",
                            "verse 74:24": "به‌هه‌موو عه‌قڵیه‌وه وتی!! ئه‌م قورئانه جگه جادوو نه‌بێت که وه‌رده‌گیرێت هیچی تر نی یه‌!!.",
                            "verse 74:25": "ئه‌مه هه‌ر قسه‌ی به‌شه‌ره و هیچی تر نی یه‌؟!",
                            "verse 74:26": "(ئه‌و بێ ویژدانه به‌سه‌ریه‌وه ناچێت) ده‌بێت بیگه‌یه‌نمه ناو دۆزه‌خ.",
                            "verse 74:27": "جا تۆ نازانیت دۆزه‌خ چیه‌.",
                            "verse 74:28": "هیچ ئه‌ندامێك ناهێڵێته‌وه‌و ده‌ست هه‌ڵناگرێت.",
                            "verse 74:29": "پێستیان هه‌ڵده‌قرچێنێت و ڕه‌شی ده‌کات و ده‌ری ده‌خات.",
                            "verse 74:30": "نۆزده فریشته سه‌رپه‌رشتی دۆزه‌خ ده‌که‌ن.",
                            "verse 74:31": "جا ئێمه وه‌نه‌بێت کار گوزارانی دۆزه‌خمان له که‌سانی تر جگه له فریشته به‌دی هێنابێت، ئه‌و ژماره‌یه‌شمان ته‌نها بۆ تاقیکردنه‌وه دیاری کردووه بۆ ئه‌وانه‌ی که بێ باوه‌ڕ بوون، هه‌روه‌ها بۆ ئه‌وه‌ی ئه‌وانه‌ی کتێبیان پێدراوه دڵنیابن له ڕاستی ئه‌م قورئانه (چونکه له ته‌ورات و ئینجیلدا ئه‌و باسه هه‌یه‌) و بۆ ئه‌وه‌ش که ئیمانداران زیاتر باوه‌ڕیان دامه‌زراو بێت و ئه‌وانه‌ش که کتێبیان پێدراوه ئیماندارانیش حه‌ق نیه تووشی دوو دڵی ببن، با ئه‌وانه‌ی دڵ و ده‌روونیان نه‌خۆشه له دووڕووه‌کان و بێ باوه‌ڕان هه‌ر بۆ خۆیان قسه بکه‌ن و بڵێن: نیازی خوا چی یه به‌م ژماره‌یه‌؟ به‌و شێوه‌یه باسکرا خوا هه‌ر که‌سێکی بوێت گومڕای ده‌کات، هه‌ر که‌سێکیشی بوێت ڕێنموویی ده‌کات، که‌س ژماره‌ی سه‌ربازانی په‌روه‌ردگارت نازانێت جگه له زاتی خۆی، ئه‌و ئایه‌ت و فه‌رموودانه ته‌نها په‌ندو ئامۆژگارین بۆ ئاده‌می.",
                            "verse 74:32": "نه‌خێر، سوێند به مانگ (ئه‌و خه‌ڵکه چاك هه‌ستی پێ ناکه‌ن).",
                            "verse 74:33": "به شه‌ویش کاتێك که تێ په‌ڕی (زۆربه‌یان باوه‌ڕیان به قیامه‌ت نیه‌).",
                            "verse 74:34": "به به‌ره‌به‌یان کاتێك که خۆی ده‌نوێنێت.",
                            "verse 74:35": "به‌ڕاستی_سه‌قه‌ر_ یه‌کێکه له شته سامناك و گه‌وره‌کان.",
                            "verse 74:36": "بۆ ترساندنی سه‌رجه‌م خه‌ڵکانه‌.",
                            "verse 74:37": "جا ئیتر ئه‌وه‌ی ده‌یه‌وێت با به‌ره‌و پێش بچێت (پێشبڕکێ بکات له چاکه‌کاریدا) یان خۆی دوا بخات (له‌و بواره‌دا).",
                            "verse 74:38": "چونکه له قیامه‌تدا هه‌موو که‌س بارمته‌ی ده‌ستپێشکه‌ری خۆیه‌تی (کرده‌وه‌کانی دێنه‌وه ڕێی).",
                            "verse 74:39": "جگه له ده‌سته‌ی ڕاستان و ئیماندارانی کرده‌وه چاك.",
                            "verse 74:40": "له‌ناو به‌هه‌شته‌کاندان و پرسیار ده‌که‌ن له یه‌کتر.",
                            "verse 74:41": "له باره‌ی تاوانبارانه‌وه‌.",
                            "verse 74:42": "ئه‌وه چی بوو ئێوه‌ی ڕاپێچی دۆزه‌خ کرد؟!",
                            "verse 74:43": "به که‌ساسیه‌وه ده‌ڵێن: ئێمه له نوێژگه‌ران نه‌بووین.",
                            "verse 74:44": "خۆراکمان به هه‌ژاران نه‌ده‌به‌خشی.",
                            "verse 74:45": "ئێمه له‌گه‌ڵ ده‌م درێژو بێ ئابڕووه‌کاندا قسه‌ی خۆمان ده‌کردو له بابه‌تی ئه‌وانمان ده‌گوت و ڕه‌خنه‌ی بێ جێمان ده‌گرت له گه‌ڵیان ڕۆده‌چووین.",
                            "verse 74:46": "ئێمه بڕوامان به ڕۆژی پاداشت نه‌بوو.",
                            "verse 74:47": "هه‌تا مردن یه‌خه‌ی پێگرتن و ڕۆژگاری ته‌مه‌نمان کۆتایی هات.",
                            "verse 74:48": "که‌واته ئیتر تکای تکاکاران سوودیان پێ ناگه‌یه‌نێت.",
                            "verse 74:49": "باشه‌، ئه‌وه بۆچی له یادخستنه‌وه پشت هه‌ڵده‌که‌ن و ڕوو وه‌رده‌گێڕن.",
                            "verse 74:50": "ده‌ڵێی گه‌له گوێدرێژی کێوین و ده‌سڵه‌مێنه‌وه‌.",
                            "verse 74:51": "له ترسی شێر هه‌ڵهاتوون.",
                            "verse 74:52": "به‌ڵکو هه‌ریه‌ك له‌وان ده‌یه‌وێت له ئاسمانه‌وه چه‌نده‌ها نامه‌ی کراوه‌ی بۆ بێت؟",
                            "verse 74:53": "نه‌خێر ئه‌وانه به‌هیچ شتێك داناچڵه‌کێن به‌ڵکو له دواڕۆژ ناترسن.",
                            "verse 74:54": "نه‌خێر ئه‌وانه به‌سه‌ریانه‌وه ناچێت، چونکه ئه‌و قورئانه ئامۆژگاریه‌.",
                            "verse 74:55": "جا ئه‌وه‌ی ده‌یه‌وێت با یادی بگرێت و شوێنی بکه‌وێت (چه‌ندی توانی له‌به‌ری بکات).",
                            "verse 74:56": "جا ئه‌و خه‌ڵکه یاداوه‌ری وه‌رناگرێت و بیر له‌م ڕاستیانه ناکاته‌وه مه‌گه‌ر ویستی خوای له‌سه‌ر بێت (که له‌گه‌ڵ ویستی ئینسانه به‌خته‌وه‌ره‌کاندا یه‌ك ده‌که‌وێت) جا هه‌ر ئه‌و زاته‌ش شایسته‌ی ئه‌وه‌یه که خه‌ڵکی حسابی بۆ بکه‌ن و له خه‌شمی بترسن و هه‌ر ئه‌ویش له خۆی گرتووه که لێخۆشبوو بێت (له ئیماندارانی گوناهبار، کاتێك ته‌وبه ده‌که‌ن)."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "Wahai orang yang berselimut!",
                            "verse 74:2": "Bangunlah serta berilah peringatan dan amaran (kepada umat manusia).",
                            "verse 74:3": "Dan Tuhanmu, maka ucaplah dan ingatlah kebesaranNya!",
                            "verse 74:4": "Dan pakaianmu, maka hendaklah engkau bersihkan.",
                            "verse 74:5": "Dan segala kejahatan, maka hendaklah engkau jauhi.",
                            "verse 74:6": "Dan janganlah engkau memberi (sesuatu, dengan tujuan hendak) mendapat lebih banyak daripadanya.",
                            "verse 74:7": "Dan bagi (menjalankan perintah) Tuhanmu, maka hendaklah engkau bersabar (terhadap tentangan musuh)!",
                            "verse 74:8": "Kerana apabila telah ditiup sangkakala,",
                            "verse 74:9": "Maka saat yang demikian adalah saat (berlakunya) hari yang sukar -",
                            "verse 74:10": "Kepada orang-orang kafir, lagi tidak mudah (mengelak azabnya).",
                            "verse 74:11": "(Jangan engkau bimbang wahai Muhammad) biarkanlah Aku sahaja membalas orang (yang menentangmu) yang Aku ciptakan dia (dalam keadaan) seorang diri (tidak berharta dan anak pinak),",
                            "verse 74:12": "Dan Aku jadikan baginya harta kekayaan yang banyak,",
                            "verse 74:13": "Serta anak pinak (yang ramai), yang sentiasa ada di sisinya.",
                            "verse 74:14": "Dan Aku mudahkan baginya (mendapat kekayaan dan kekuasaan) dengan semudah-mudahnya.",
                            "verse 74:15": "Kemudian dia ingin sangat, supaya Aku tambahi lagi;",
                            "verse 74:16": "Tidak sekali-kali (akan ditambahi)! Kerana sesungguhnya dia menentang dengan degilnya akan ayat-ayat Kami (Al-Quran, yang disampaikan oleh Rasul Kami).",
                            "verse 74:17": "Aku akan menyeksanya (dengan azab) yang memuncak beratnya.",
                            "verse 74:18": "Kerana sesungguhnya dia telah memikirkan dan mereka-reka berbagai tuduhan terhadap Al-Quran) -",
                            "verse 74:19": "Maka binasalah dia hendaknya! Bagaimanakah dia berani mereka-reka (yang demikian)?",
                            "verse 74:20": "Sekali lagi: Binasalah dia hendaknya! Bagaimana dia berani mereka-reka (tuduhan-tuduhan itu)?",
                            "verse 74:21": "Kemudian dia merenung dan memikirkan (berkali-kali: Jalan-jalan mencaci Al-Quran, tetapi dia gagal);",
                            "verse 74:22": "Setelah itu dia memasamkan mukanya serta dia bertambah masam berkerut;",
                            "verse 74:23": "Kemudian dia berpaling (dari kebenaran) dan berlaku sombong angkuh,",
                            "verse 74:24": "Serta dia berkata: (Al-Quran) ini tidak lain hanyalah sihir yang dituntut serta dipelajari (dari ahli-ahlinya);",
                            "verse 74:25": "Ini tidak lain hanyalah kata-kata (rekaan) manusia!",
                            "verse 74:26": "(Disebabkan kekufurannya itu) Aku akan masukkan dia ke dalam Neraka Saqar.",
                            "verse 74:27": "Dan apa jalannya engkau dapat mengetahui kedahsyatan Neraka Saqar itu?",
                            "verse 74:28": "Ia membakar mangsanya dengan tidak meninggalkan sisa dan tidak membiarkannya (binasa terus)",
                            "verse 74:29": "Ia terus-menerus membakar kulit manusia!",
                            "verse 74:30": "Pengawal dan penjaganya adalah sembilan belas (malaikat).",
                            "verse 74:31": "Dan (ketahuilah bahawa hikmat) Kami tidak menjadikan pengawal-pengawal Neraka itu melainkan (dari kalangan) malaikat, (kerana merekalah sekuat-kuat dan sebenar-benar makhluk yang menjalankan perintah Kami) dan (hikmat) Kami tidak menerangkan bilangan mereka melainkan dengan satu bilangan yang menyebabkan kesesatan dan kesengsaraan orang-orang kafir itu, supaya orang-orang yang diberi Kitab (Yahudi dan Nasrani) boleh percaya dengan yakin (akan kebenaran Al-Quran) dan supaya orang-orang yang beriman bertambah imannya dan juga supaya orang-orang yang diberi Kitab dan orang-orang yang beriman itu tidak ragu-ragu (tentang kebenaran keterangan itu) dan (sebaliknya) supaya orang-orang (munafik) yang ada penyakit (ragu-ragu) dalam hatinya dan orang-orang kafir berkata: Apakah yang di maksudkan oleh Allah dengan menyebutkan bilangan ganjil ini? Demikianlah Allah menyesatkan sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya) dan memberi hidayat petunjuk kepada sesiapa yang dikehendakiNya (menurut undang-undang peraturanNya) dan tiada yang mengetahui tentera Tuhanmu melainkan Dialah sahaja.",
                            "verse 74:32": "Sebenarnya! Demi bulan,",
                            "verse 74:33": "Dan malam apabila ia balik melenyapkan diri,",
                            "verse 74:34": "Dan waktu subuh apabila ia terang-benderang,",
                            "verse 74:35": "Sesungguhnya Neraka Saqar itu adalah salah satu (malapetaka) yang amat besar,",
                            "verse 74:36": "Yang menjadi amaran bagi umat manusia,",
                            "verse 74:37": "(Iaitu) bagi sesiapa di antara kamu yang mahu maju (dalam mengerjakan kebaikan) atau yang mahu mundur (daripada mengerjakannya).",
                            "verse 74:38": "Tiap-tiap diri terikat, tidak terlepas daripada (balasan buruk bagi amal jahat) yang dikerjakannya,",
                            "verse 74:39": "Kecuali puak Kanan,",
                            "verse 74:40": "(Mereka ditempatkan) di dalam Syurga (yang penuh nikmat), mereka bertanya-tanya,",
                            "verse 74:41": "Tentang (tempat tinggal) orang-orang yang bersalah,",
                            "verse 74:42": "(Setelah melihat orang-orang yang bersalah itu, mereka berkata): Apakah yang menyebabkan kamu masuk ke dalam (Neraka) Saqar?",
                            "verse 74:43": "Orang-orang yang bersalah itu menjawab: Kami tidak termasuk dalam kumpulan orang-orang yang mengerjakan sembahyang;",
                            "verse 74:44": "Dan kami tidak pernah memberi makan orang-orang miskin;",
                            "verse 74:45": "Dan kami dahulu selalu mengambil bahagian memperkatakan perkara yang salah, bersama-sama orang-orang yang memperkatakannya;",
                            "verse 74:46": "Dan kami sentiasa mendustakan hari pembalasan,",
                            "verse 74:47": "Sehinggalah kami didatangi oleh perkara yang tetap diyakini.",
                            "verse 74:48": "Maka tidak akan berguna kepada mereka sebarang syafaat pertolongan (kalaulah ditakdirkan ada) sesiapa yang boleh memberikan syafaat itu.",
                            "verse 74:49": "(Kalau demikianlah halnya orang-orang yang bersalah), maka mengapa mereka berpaling lari dari peringatan (Al-Quran) ?",
                            "verse 74:50": "Seolah-olah mereka sekawan keldai liar yang lari,",
                            "verse 74:51": "Melarikan diri (ketakutan) dari singa!",
                            "verse 74:52": "(Mereka tidak merasa cukup dengan peringatan itu) bahkan tiap-tiap seorang di antaranya mahu supaya diberi kepadanya lembaran surat yang terbuka (yang diturunkan dari langit untuk dibaca oleh mereka sendiri).",
                            "verse 74:53": "Sebenarnya! (Bukan kerana kemahuan mereka tidak berhasil), bahkan mereka (tidak percaya dan) tidak takut akan hari akhirat.",
                            "verse 74:54": "Ketahuilah! Sesungguhnya Al-Quran itu adalah satu peringatan (yang sangat besar pengajarannya);",
                            "verse 74:55": "Oleh itu sesiapa yang mahu (beringat) dapatlah dia mengambil peringatan daripadanya.",
                            "verse 74:56": "Dan (dalam pada itu) tiadalah mereka dapat beringat melainkan jika dikehendaki Allah; Dialah Tuhan yang berhak dipatuhi perintahNya dan Dialah jua yang berhak memberi keampunan (kepada orang-orang yang beriman dan taat)."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "اى جامه خواب به خود پيچيده (و در بستر آرميده)!",
                            "verse 74:2": "برخيز و انذار كن (و عالميان را بيم ده)،",
                            "verse 74:3": "و پروردگارت را بزرگ بشمار،",
                            "verse 74:4": "و لباست را پاك كن،",
                            "verse 74:5": "و از پليدى دورى كن،",
                            "verse 74:6": "و منت مگذار و فزونى مطلب،",
                            "verse 74:7": "و بخاطر پروردگارت شكيبايى كن!",
                            "verse 74:8": "هنگامى كه در «صور» دميده شود،",
                            "verse 74:9": "آن روز، روز سختى است،",
                            "verse 74:10": "و براى كافران آسان نيست!",
                            "verse 74:11": "مرا با كسى كه او را خود به تنهايى آفريده‏ام واگذار!",
                            "verse 74:12": "همان كسى كه براى او مال گسترده‏اى قرار دادم،",
                            "verse 74:13": "و فرزندانى كه همواره نزد او (و در خدمت او) هستند،",
                            "verse 74:14": "و وسايل زندگى را از هر نظر براى وى فراهم ساختم!",
                            "verse 74:15": "باز هم طمع دارد كه بر او بيفزايم!",
                            "verse 74:16": "هرگز چنين نخواهد شد; چرا كه او نسبت به آيات ما دشمنى مى‏ورزد!",
                            "verse 74:17": "و بزودى او را مجبور مى‏كنم كه از قله زندگى بالا رود (سپس او را به زير مى‏افكنم)!",
                            "verse 74:18": "او (براى مبارزه با ) انديشه كرد و مطلب را آماده ساخت!",
                            "verse 74:19": "مرگ بر او باد! چگونه (براى مبارزه با حق) مطلب را آماده كرد!",
                            "verse 74:20": "باز هم مرگ بر او، چگونه مطلب (و نقشه شيطانى خود را) آماده نمود!",
                            "verse 74:21": "سپس نگاهى افكند،",
                            "verse 74:22": "بعد چهره درهم كشيد و عجولانه دست به كار شد;",
                            "verse 74:23": "سپس پشت (به حق) كرد و تكبر ورزيد،",
                            "verse 74:24": "و سرانجام گفت: «اين () چيزى جز افسون و سحرى همچون سحرهاى پيشينيان نيست!",
                            "verse 74:25": "اين فقط سخن انسان است (نه گفتار خدا)!»",
                            "verse 74:26": "(اما) بزودى او را وارد سقر ( دوزخ) مى‏كنم!",
                            "verse 74:27": "و تو نمى‏دانى «سقر» چيست!",
                            "verse 74:28": "(آتشى است كه) نه چيزى را باقى مى‏گذارد و نه چيزى را رها مى‏سازد!",
                            "verse 74:29": "پوست تن را بكلى دگرگون مى‏كند!",
                            "verse 74:30": "نوزده نفر (از فرشتگان عذاب) بر آن گمارده شده‏اند!",
                            "verse 74:31": "ماموران دوزخ را فقط فرشتگان (عذاب) قرار داديم، و تعداد آنها را جز براى آزمايش كافران معين نكرديم تا اهل كتاب ( يهود و نصارى) يقين پيدا كنند و بر ايمان مؤمنان بيفزايد، و اهل كتاب و مؤمنان (در حقانيت اين كتاب آسمانى) ترديد به خود راه ندهند، و بيماردلان و كافران بگويند: «خدا از اين توصيف چه منظورى دارد؟!» (آرى) اين گونه خداوند هر كس را بخواهد گمراه مى‏سازد و هر كس را بخواهد هدايت مى‏كند! و لشكريان پروردگارت را جز او كسى نمى‏داند، و اين جز هشدار و تذكرى براى انسانها نيست!",
                            "verse 74:32": "اينچنين نيست كه آنها تصور مى‏كنند سوگند به ماه،",
                            "verse 74:33": "و به شب، هنگامى كه (دامن برچيند و) پشت كند،",
                            "verse 74:34": "و به صبح هنگامى كه چهره بگشايد،",
                            "verse 74:35": "كه آن (حوادث هولناك قيامت) از مسائل مهم است!",
                            "verse 74:36": "هشدار و انذارى است براى همه انسانها،",
                            "verse 74:37": "براى كسانى از شما كه مى‏خواهند پيش افتند يا عقب بمانند ( بسوى هدايت و نيكى پيش روند يا نروند)!",
                            "verse 74:38": "(آرى) هر كس در گرو اعمال خويش است،",
                            "verse 74:39": "مگر «اصحاب يمين‏» (كه نامه اعمالشان را به نشانه ايمان و تقوايشان به دست راستشان مى‏دهند)!",
                            "verse 74:40": "آنها در باغهاى بهشتند، و سؤال مى‏كنند",
                            "verse 74:41": "از مجرمان:",
                            "verse 74:42": "چه چيز شما را به دوزخ وارد ساخت؟!»",
                            "verse 74:43": "مى‏گويند: «ما از نمازگزاران نبوديم،",
                            "verse 74:44": "و اطعام مستمند نمى‏كرديم،",
                            "verse 74:45": "و پيوسته با اهل باطل همنشين و همصدا بوديم،",
                            "verse 74:46": "و همواره روز جزا را انكار مى‏كرديم،",
                            "verse 74:47": "تا زمانى كه مرگ ما فرا رسيد!»",
                            "verse 74:48": "از اين رو شفاعت شفاعت‏كنندگان به حال آنها سودى نمى‏بخشد",
                            "verse 74:49": "چرا آنها از تذكر روى گردانند؟!",
                            "verse 74:50": "گويى گورخرانى رميده‏اند،",
                            "verse 74:51": "كه از (مقابل) شيرى فرار كرده‏اند!",
                            "verse 74:52": "بلكه هر كدام از آنها انتظار دارد نامه جداگانه‏اى (از سوى خدا) براى او فرستاده شود!",
                            "verse 74:53": "چنين نيست كه آنان مى‏گويند، بلكه آنها از آخرت نمى‏ترسند!",
                            "verse 74:54": "چنين نيست كه آنها مى‏گويند، آن () يك تذكر و يادآورى است!",
                            "verse 74:55": "هر كس بخواهد از آن پند مى‏گيرد;",
                            "verse 74:56": "و هيچ كس پند نمى‏گيرد مگر اينكه خدا بخواهد; او اهل تقوا و اهل آمرزش است!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "Ó tu, emantado!",
                            "verse 74:2": "Levante-te e admoesta!",
                            "verse 74:3": "E enaltece o teu Senhor!",
                            "verse 74:4": "E purifica as tuas vestimentas!",
                            "verse 74:5": "E foge da abominação!",
                            "verse 74:6": "E não esperes qualquer aumento (em teu interesse),",
                            "verse 74:7": "Mas persevera, pela causa do teu Senhor,",
                            "verse 74:8": "Pois, quando for tocada a trombeta,",
                            "verse 74:9": "Esse dia será um dia nefasto,",
                            "verse 74:10": "Insuportável para os incrédulos.",
                            "verse 74:11": "Deixa por Minha conta aquele que criei solitário,",
                            "verse 74:12": "Que depois agraciei com infinitos bens,",
                            "verse 74:13": "E filhos, ao seu lado,",
                            "verse 74:14": "E que agraciei liberalmente,",
                            "verse 74:15": "E que ainda pretende que lhe sejam acrescentados (os bens)!",
                            "verse 74:16": "Qual! Por Ter sido insubmisso quanto aos Nossos versículos,",
                            "verse 74:17": "Infligir-lhe-ei um acúmulo de vicissitudes,",
                            "verse 74:18": "Porque meditou e planejou.",
                            "verse 74:19": "Que pereça, pois, por planejar,",
                            "verse 74:20": "E, uma vez mais, que pereça por planejar!",
                            "verse 74:21": "Então, refletiu;",
                            "verse 74:22": "Depois, tornou-se austero e ameaçador;",
                            "verse 74:23": "Depois, renegou e se ensoberbeceu;",
                            "verse 74:24": "E disse: Este (Alcorão) não é mais do que magia, oriunda do passado;",
                            "verse 74:25": "Esta não é mais do que a palavra de um mortal!",
                            "verse 74:26": "Por isso, introduzi-lo-ei no tártaro!",
                            "verse 74:27": "E o que te fará compreender o que é o tártaro?",
                            "verse 74:28": "Nada deixa perdurar e nada deixa a sós!",
                            "verse 74:29": "Carbonizador do humanos,",
                            "verse 74:30": "Guardado por dezenove.",
                            "verse 74:31": "E não designamos guardiães do fogo, senão os anjos, e não fixamos o seu número, senão como prova para os incrédulos, para que os adeptos do Livro se convençam; para que os fiéis aumentem em sua fé e para que os adeptos do Livro, assim como os fiéis, não duvidem; e para que os que abrigam a morbidez em seus corações, bem como os incrédulos, digam: Que quer dizer Deus com esta prova? Assim Deus extravia quem quer e encaminha quem Lhe apraz e ninguém, senão Ele, conhece os exércitos do teu Senhor.",
                            "verse 74:32": "Qual! Pela lua,",
                            "verse 74:33": "E pela noite, quando se extingue,",
                            "verse 74:34": "E pela manhã, quando surge,",
                            "verse 74:35": "Que isto é um doa maiores portentos,",
                            "verse 74:36": "Admoestação para o gênero humano,",
                            "verse 74:37": "E para aquele, dentre vós, que se antecipa ou se atrasa!",
                            "verse 74:38": "Toda a alma é depositária das suas ações,",
                            "verse 74:39": "Salvo as que estiverem à mão direita,",
                            "verse 74:40": "Que estarão nos jardins das delícias.",
                            "verse 74:41": "Aos pecadores:",
                            "verse 74:42": "O que foi que vos introduziu no tártaro?",
                            "verse 74:43": "Responder-lhes-ão: Não nos contávamos entre os que oravam,",
                            "verse 74:44": "Nem alimentávamos o necessitado;",
                            "verse 74:45": "Ao contrário, dialogávamos sobre futilidades, com palradores,",
                            "verse 74:46": "E negávamos o Dia do Juízo,",
                            "verse 74:47": "Até que nos chegou a (Hora) infalível!",
                            "verse 74:48": "De nada, então, valerá, a intercessão dos mediadores.",
                            "verse 74:49": "Porque, pois, desdenham a admoestação,",
                            "verse 74:50": "Como se fossem asnos espantados,",
                            "verse 74:51": "Fugindo de um leão?",
                            "verse 74:52": "Porém, cada um deles quereria receber (agora) páginas abertas (com a revelação).",
                            "verse 74:53": "Qual! Em verdade não temem a outra vida.",
                            "verse 74:54": "Qual! Sabei que (o Alcorão) é uma admoestação.",
                            "verse 74:55": "Quem quiser, pois, que o recorde!",
                            "verse 74:56": "Porém, não o recordarão, a menos que Deus o queira, porque é o Senhor do temor e o Senhor da remissão."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 74:1": "O, tu cel acoperit!",
                            "verse 74:2": "Ridicã-te și îndeamnã!",
                            "verse 74:3": "Pe Domnul tãu preamãrește-L,",
                            "verse 74:4": "Veșmintele tale curãțește-le",
                            "verse 74:5": "Și de nelegiuire stai departe",
                            "verse 74:6": "Și nu dãrui, cãutând sã dobândești mai mult,",
                            "verse 74:7": "Și pentru Domnul tãu îndurã!",
                            "verse 74:8": "Când se va sufla în trâmbițã,",
                            "verse 74:9": "Aceea va fi atunci o Zi grea,",
                            "verse 74:10": "Deloc ușoarã pentru necredincioși!",
                            "verse 74:11": "Lasã-Mã cu cel pe care l-am creat singur",
                            "verse 74:12": "Și cãruia i-am dãruit avere îndestulãtoare",
                            "verse 74:13": "Și fii care-l însoțesc tot timpul",
                            "verse 74:14": "Și cãruia i le-am netezit pe toate",
                            "verse 74:15": "Și care poftește ca Eu sã-i dau și mai mult .",
                            "verse 74:16": "Dar nu! Cãci el a tãgãduit versetele Noastre cu încãpãțânare,",
                            "verse 74:17": "Iar Eu îl voi sili sã urce .",
                            "verse 74:18": "El a cugetat și a hotãrât!",
                            "verse 74:19": "Și omorât sã fie! Dupã cum el a hotãrât!",
                            "verse 74:20": "Omorât sã fie! Dupã cum el a hotãrât!",
                            "verse 74:21": "Apoi el a mai cugetat ,",
                            "verse 74:22": "Apoi s-a posomorât și s-a încruntat,",
                            "verse 74:23": "Apoi s-a întors și s-a arãtat trufaș",
                            "verse 74:24": "Și a zis: \"Aceasta nu este decât vrãjitorie care se învațã!",
                            "verse 74:25": "Aceasta nu este decât vorbã a unui om!\"",
                            "verse 74:26": "Îl voi face sã ardã în focul Iadului?!",
                            "verse 74:27": "Și de unde sã știi ce este focul Iadului?",
                            "verse 74:28": "El nu lasã și nu cruțã ,",
                            "verse 74:29": "Arzând și înnegrind pielea",
                            "verse 74:30": "Și peste el vegheazã nouãsprezece!",
                            "verse 74:31": "Și nu am pus Noi ca pãzitori peste Foc decât îngeri și nu amstabilit numãrul lor decât ca încercare pentru cei care nu cred și pentru cei cãrora le-a fost trimisã Cartea, sã fie în",
                            "verse 74:32": "Nu! Jur pe Lunã",
                            "verse 74:33": "Și pe noaptea care se duce",
                            "verse 74:34": "Și pe zorile care se ivesc!",
                            "verse 74:35": "El este una din cele mai mari",
                            "verse 74:36": "O prevenire pentru oameni,",
                            "verse 74:37": "Pentru acela dintre voi care voiește sã meargã înainte sau sã rãmânã în urmã!",
                            "verse 74:38": "Fiecare suflet este zãlog pentru ceea ce și-a agonisit,",
                            "verse 74:39": "Afarã de aleșii dreptei,",
                            "verse 74:40": "Care vor întreba în Grãdini",
                            "verse 74:41": "Despre cei nelegiuiți:",
                            "verse 74:42": "\"Ce v-a adus pe voi în focul Iadului?\"",
                            "verse 74:43": "Iar ei vor rãspunde: \"Noi nu am fost dintre aceia care au împlinitRugãciunea",
                            "verse 74:44": "Și noi nu l-am hrãnit pe cel sãrman",
                            "verse 74:45": "Și noi am ponegrit laolaltã cu bârfitorii",
                            "verse 74:46": "Și noi am socotit drept minciunã Ziua de Apoi,",
                            "verse 74:47": "Pânã ce ne-a venit nouã ceea ce este sigur!\"",
                            "verse 74:48": "Și nu le va fi lor de nici un folos mijlocirea mijlocitorilor .",
                            "verse 74:49": "Oare de ce se întorc ei de la Îndemnare,",
                            "verse 74:50": "De parcã ar fi niște mãgari sãlbatici speriați",
                            "verse 74:51": "Ce fug de leu?",
                            "verse 74:52": "Fiecare om dintre ei ar voi sã i se dea niște foi întinse .",
                            "verse 74:53": "Dar nu! Ei mai degrabã nu se tem de Viața de Apoi!",
                            "verse 74:54": "Dar nu! El este cu adevãrat o Îndemnare!",
                            "verse 74:55": "Și cine voiește îl pomenește .",
                            "verse 74:56": "Însã nu îl pomenesc decât dacã Allah voiește."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 74:1": "O, tu cel acoperit cu mantie!",
                            "verse 74:2": "Scoală-te şi previne!",
                            "verse 74:3": "Preamăreşte-L pe Domnul tău!",
                            "verse 74:4": "Curătă-ţi veşmintele!",
                            "verse 74:5": "Fugi de întinăciune!",
                            "verse 74:6": "Nu dărui ca să capeţi mai mult!",
                            "verse 74:7": "Pentru Domnul tău rabdă!",
                            "verse 74:8": "Când se va suna din trâmbiţă,",
                            "verse 74:9": "acea zi va fi o zi grea,",
                            "verse 74:10": "pentru tăgăduitori nu va fi uşoară.",
                            "verse 74:11": "Lasă-mă cu cel pe care singur l-am creat!",
                            "verse 74:12": "O avere întinsă i-am dat",
                            "verse 74:13": "şi fiii care să-i fie martori.",
                            "verse 74:14": "Şi i-am făcut orice înlesnire,",
                            "verse 74:15": "însă el se lăcomeşte să-i dau mai mult!",
                            "verse 74:16": "Ba nu! El s-a încăpăţânat înaintea semnelor Noastre,",
                            "verse 74:17": "însă Eu îl voi sili la greu urcuş!",
                            "verse 74:18": "S-a gândit şi a hotărât.",
                            "verse 74:19": "Să fie omorât precum a hotărât!",
                            "verse 74:20": "Da! Să fie omorât precum a hotărât!",
                            "verse 74:21": "Apoi s-a uitat,",
                            "verse 74:22": "s-a încruntat şi s-a întunecat,",
                            "verse 74:23": "şi spatele a întors îngâmfat.",
                            "verse 74:24": "El spuse: “Nu este decât o vrajă care se leagă!",
                            "verse 74:25": "Nu este decât spusa unui om!”",
                            "verse 74:26": "Îl voi azvârli în Focul mistuitor!",
                            "verse 74:27": "Cum vei şti tu oare ce este Focul mistuitor?",
                            "verse 74:28": "El nu cruţă şi nu lasă,",
                            "verse 74:29": "el este cel care îi înegreşte pe oameni,",
                            "verse 74:30": "iar asupra lui sunt nouăsprezece (păzitori).",
                            "verse 74:31": "Am pus păzitori ai Focului numai îngeri şi n-am făcut din numărul lor decât o încercare pentru cei care au tăgăduit, pentru ca cei care au primit Cartea să se convingă, pentru ca cei care cred să crească în credinţă, pentru ca cei care au primit Cartea şi cei credincioşi să nu se mai îndoiască, pentru ca cei care au boala în inimă şi tăgăduitorii să spună: “Ce voieşte Dumnezeu cu aceasta ca pildă?” Astfel, Dumnezeu rătăceşte pe cine voieşte şi călăuzeşte pe cine voieşte.",
                            "verse 74:32": "Ba nu!.",
                            "verse 74:33": "Pe noapte când se risipeşte!",
                            "verse 74:34": "Pe dimineaţă când mijeşte!",
                            "verse 74:35": "Acela este unul dintre cele mai mari.",
                            "verse 74:36": "Aceasta este o predică oamenilor,",
                            "verse 74:37": "celor dintre voi care vor să iasă înainte ori care vor să rămână în urmă.",
                            "verse 74:38": "Fiece suflet pentru ceea ce a agonisit este chezaş,",
                            "verse 74:39": "afară de cei de-a dreapta.",
                            "verse 74:40": "Aceştia în Grădini se vor întreba",
                            "verse 74:41": "despre nelegiuiţi:",
                            "verse 74:42": "“Cine v-a mânat în Focul mistuitor?”",
                            "verse 74:43": "Ei vor răspunde: “Noi nu am fost dintre cei rugători,",
                            "verse 74:44": "nu am fost printre cei care au ospătat sărmanul,",
                            "verse 74:45": "ci la palavre am stat cu palavragii.",
                            "verse 74:46": "Noi am socotit Ziua Judecăţii o minciună",
                            "verse 74:47": "până când ne-a venit adeverirea.",
                            "verse 74:48": "Atunci mijlocirea celor mijlocitori nu le va fi de folos.",
                            "verse 74:49": "La ce le-a folosit dacă s-au împotrivit Amintirii,",
                            "verse 74:50": "ca nişte măgari care o iau razna",
                            "verse 74:51": "fugind din faţa leului?",
                            "verse 74:52": "Ba, fiecare dintre ei ar vrea să i se aducă suluri desfăşurate!",
                            "verse 74:53": "Ba nu, căci ei nu se tem de Viaţa de Apoi!",
                            "verse 74:54": "Ba nu, căci aceasta este numai o Amintire,",
                            "verse 74:55": "iar cel care voieşte şi-o aminteşte.",
                            "verse 74:56": "Oamenii nu-şi vor aminti însă decât dacă va voi Dumnezeu, Cel vrednic de temut şi dăruitor de iertare! aminteşte."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "О ты, укрывшийся плащом!",
                            "verse 74:2": "Встань и неси предупрежденье",
                            "verse 74:3": "И славь Владыку своего!",
                            "verse 74:4": "И в чистоте блюди свои одежды2279,",
                            "verse 74:5": "От мерзости беги",
                            "verse 74:6": "И (благ) не раздавайВ надежде получить (с лихвой)обратно.",
                            "verse 74:7": "В Господнем деле проявляй терпенье.",
                            "verse 74:8": "Когда раздастся трубный глас,",
                            "verse 74:9": "Настанет День — день тяжкий,",
                            "verse 74:10": "День, нелегкий для неверных.",
                            "verse 74:11": "И одного Меня оставь с тем(человеком)2279а,Кого Я одиноким создал,",
                            "verse 74:12": "Потом пространное богатство даровал",
                            "verse 74:13": "И сыновей, стоящих рядом (в радостии в горе),",
                            "verse 74:14": "И гладко перед ним простер (дорогужизни).",
                            "verse 74:15": "И все же жадничает он.",
                            "verse 74:16": "Увы! К знаменьям Нашим он упрями дерзок.",
                            "verse 74:17": "Я возложу (как наказанье) на негоподъем2280, —",
                            "verse 74:18": "Ведь он2281 замыслил все и рассчитал.",
                            "verse 74:19": "Да будет убиен он!Как он все устроил!",
                            "verse 74:20": "И вновь — пусть будет он убит!Как рассчитал он все!",
                            "verse 74:21": "Затем он поглядел вокруг,",
                            "verse 74:22": "Затем нахмурился и сдвинул брови,",
                            "verse 74:23": "Затем спиною встал и возгордился,",
                            "verse 74:24": "Затем сказал:«Сие2281а — не боле колдовства,Пришедшего с времен далеких;",
                            "verse 74:25": "Не боле чем людская речь!»",
                            "verse 74:26": "Я в са’каре его сожгу!",
                            "verse 74:27": "Как объяснить тебе, что «са’кар»значит?",
                            "verse 74:28": "Его нельзя ни вытерпетьи ни покинуть2282,",
                            "verse 74:29": "Сжигает (кожу человека) он,",
                            "verse 74:30": "Над ним же — девятнадцать(стражей)2283.",
                            "verse 74:31": "Мы во властители Огнялишь ангелов призвали,Назначив точно их числоДля искушения неверных,Чтоб убедить людей Писания2283а(Уверовать в пророка и Коран),Чтобы усилить веру в тех, кто верует,И чтобы никаких сомненийне осталосьНи в праведных сердцах, ни у людейПисаний,И чтоб неверные и те,Сердца которых недугом объяты,Сказать могли:«Какую ж суть Аллах нам этойпритчей выражает?»Так позволяет Он (в грехах) блуждатьтому, кто этого захочет,И ясною стезей ведет того, кто милЕму.",
                            "verse 74:32": "В знак (Моего знамения) — луны,",
                            "verse 74:33": "И уходящей ночи,",
                            "verse 74:34": "И пламенеющей зари, —",
                            "verse 74:35": "Ведь это — (всего) одиниз величайших (Моих знаков)",
                            "verse 74:36": "И увещанье для людей,",
                            "verse 74:37": "Для тех, кто во главе (к добру) идет,(А равно) и для тех, кто остается сзади.",
                            "verse 74:38": "Ведь каждая душа заложницей своихдеяний будет, —",
                            "verse 74:39": "Помимо (братьев) правой стороны.",
                            "verse 74:40": "Вступая в сад (прекрасный Рая),Они друг друга воспрошают",
                            "verse 74:41": "И грешникам (вопрос свой задают):",
                            "verse 74:42": "«Что привело вас в са’кар?»",
                            "verse 74:43": "Они ответят:«Мы не были средь тех,Кто совершал молитву,",
                            "verse 74:44": "И не были средь тех,Кто бедняков кормил.",
                            "verse 74:45": "Мы пустословьем с болтунамизанимались",
                            "verse 74:46": "И ложью нарекали Судный День,",
                            "verse 74:47": "Пока нас не постигла смерть».",
                            "verse 74:48": "И тут ничье заступничество имне поможет.",
                            "verse 74:49": "Так что ж от увещаний НашихИх заставляет отвернуться,",
                            "verse 74:50": "Подобно перепуганным ослам,",
                            "verse 74:51": "От льва спасающимся бегством?",
                            "verse 74:52": "Поистине, любой из них хотел бы,Чтобы (Аллах) лишь одному емупослалРазвернутые свитки Откровений.",
                            "verse 74:53": "Увы! В них страха нет передпоследней жизнью.",
                            "verse 74:54": "Да будет так! Ведь сей (Коран),поистине,Является напоминаньем.",
                            "verse 74:55": "И кто захочет, тот его услышит,",
                            "verse 74:56": "Но не услышит ни один из них,Если Аллах того не пожелает."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "¡Tú, el envuelto en un manto!",
                            "verse 74:2": "¡Levántate y advierte!",
                            "verse 74:3": "A tu Señor, ¡ensálzale!",
                            "verse 74:4": "Tu ropa, ¡purifícala!",
                            "verse 74:5": "La abominación, ¡huye de ella!",
                            "verse 74:6": "¡No des esperando ganancia!",
                            "verse 74:7": "La decisión de tu Señor, ¡espérala paciente!",
                            "verse 74:8": "Cuando suene la trompeta,",
                            "verse 74:9": "ése será, entonces, un día difícil",
                            "verse 74:10": "para los infieles, no fácil.",
                            "verse 74:11": "¡Déjame solo con Mi criatura,",
                            "verse 74:12": "a quien he dado una gran hacienda,",
                            "verse 74:13": "e hijos varones que están presentes!",
                            "verse 74:14": "Todo se lo he facilitado,",
                            "verse 74:15": "pero aún anhela que le dé más.",
                            "verse 74:16": "¡No! Se ha mostrado hostil a Nuestros signos.",
                            "verse 74:17": "Le haré subir por una cuesta.",
                            "verse 74:18": "Ha reflexionado y tomado una decisión,",
                            "verse 74:19": "pero ¡qué decisión! ¡Maldito sea!",
                            "verse 74:20": "Sí, ¡qué decisión! ¡Maldito sea!",
                            "verse 74:21": "Luego, ha mirado.",
                            "verse 74:22": "Luego, se ha puesto ceñudo y triste.",
                            "verse 74:23": "Luego, ha vuelto la espalda, lleno de altivez.",
                            "verse 74:24": "Y ha dicho: «¡Esto no es sino magia aprendida!",
                            "verse 74:25": "¡No es sino la palabra de un mortal!»",
                            "verse 74:26": "¡Lo entregaré al ardor del saqar !",
                            "verse 74:27": "Y ¿cómo sabrás qué es el saqar ?",
                            "verse 74:28": "No deja residuos, no deja nada.",
                            "verse 74:29": "Abrasa al mortal.",
                            "verse 74:30": "Hay diecinueve que lo guardan.",
                            "verse 74:31": "No hemos puesto sino a ángeles como guardianes del Fuego y no los hemos puesto en ese número sino para tentar a los infieles, para que los que han recibido la Escritura crean firmemente, para que los creyentes se fortifiquen en su fe, para que no duden ni los que han recibido la Escritura ni los creyentes, para que los enfermos de corazón y los infieles digan: «¿Qué es lo que se propone Alá con esta parábola?» Así es como Alá extravía a quien Él quiere y dirige a quien Él quiere.",
                            "verse 74:32": "¡No! ¡Por la luna!",
                            "verse 74:33": "¡Por la noche cuando declina!",
                            "verse 74:34": "¡Por la mañana cuando apunta!",
                            "verse 74:35": "Es, sí, una de las mayores,",
                            "verse 74:36": "a modo de advertencia para los mortales,",
                            "verse 74:37": "para aquéllos de vosotros que quieran adelantarse o rezagarse.",
                            "verse 74:38": "Cada uno será responsable de lo que haya cometido.",
                            "verse 74:39": "Pero los de la derecha,",
                            "verse 74:40": "en jardines, se preguntarán unos a otros",
                            "verse 74:41": "acerca de los pecadores.",
                            "verse 74:42": "«¿Qué es lo que os ha conducido al saqar ?»",
                            "verse 74:43": "Dirán: «No éramos de los que oraban,",
                            "verse 74:44": "no dábamos de comer al pobre,",
                            "verse 74:45": "parloteábamos con los parlones",
                            "verse 74:46": "y desmentíamos el día del Juicio,",
                            "verse 74:47": "hasta que vino a nosotros la cierta».",
                            "verse 74:48": "Los intercesores no podrán hacer nada por ellos.",
                            "verse 74:49": "¿Por qué han tenido que apartarse del Recuerdo,",
                            "verse 74:50": "como asnos espantados",
                            "verse 74:51": "que huyen del león?",
                            "verse 74:52": "Todos ellos quisieran que se les trajeran hojas desplegadas.",
                            "verse 74:53": "Pero ¡no! No temen la otra vida.",
                            "verse 74:54": "¡No! Es un Recuerdo,",
                            "verse 74:55": "que recordará quien quiera.",
                            "verse 74:56": "Pero no lo tendrán en cuenta, a menos que Alá quiera."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "(போர்வை) போர்த்திக் கொண்டு இருப்பவரே!",
                            "verse 74:2": "நீர் எழுந்து (மக்களுக்கு அச்சமூட்டி) எச்சரிக்கை செய்வீராக.",
                            "verse 74:3": "மேலும், உம் இறைவனைப் பெருமைப் படுத்துவீராக.",
                            "verse 74:4": "உம் ஆடைகளைத் தூய்மையாக ஆக்கி வைத்துக் கொள்வீராக.",
                            "verse 74:5": "அன்றியும் அசுத்தத்தை வெறுத்து (ஒதுக்கி) விடுவீராக.",
                            "verse 74:6": "(பிறருக்குக் கொடுப்பதையும் விட அவர்களிடமிருந்து) அதிமாகப் பொறும் (நோக்கோடு) உபகாரம் செய்யாதீர்.",
                            "verse 74:7": "இன்னும், உம் இறைவனுக்காகப் பொறுமையுடன் இருப்பீராக.",
                            "verse 74:8": "மேலும், எக்காளத்தில் ஊதப்படும்போது-",
                            "verse 74:9": "அந்நாள் மிகக் கடினமான நாள் ஆகும்.",
                            "verse 74:10": "காஃபிர்களுக்கு (அந்நாள்) இலேசானதல்ல.",
                            "verse 74:11": "என்னையும், நான் தனித்தே படைத்தவனையும் விட்டுவிடும்.",
                            "verse 74:12": "இன்னும் அவனுக்கு விசாலமாகப் பொருளையும் கொடுத்தேன்.",
                            "verse 74:13": "அவனிடம் இருக்கிறவர்களாகவுள்ள புதல்வர்களையும் (கொடுத்தேன்).",
                            "verse 74:14": "இன்னும் அவனுக்கு (வசதியான) தயாரிப்புகளை அவனுக்காகத் தயார் செய்தளித்தேன்.",
                            "verse 74:15": "பின்னரும், அவனுக்கு(ச் செல்வங்களை) நான் அதிகமாக்க வேண்டுமென்று அவன் ஆசைப்படுகிறான்.",
                            "verse 74:16": "அவ்வாறில்லை! நிச்சயமாக அவன் நம் வசனங்களுக்கு முரண்பட்டவனாகவே இருக்கின்றான்.",
                            "verse 74:17": "விரைவிலேயே, அவனைக் கடினமான ஒரு சிகரத்தின் மேல் ஏற்றுவேன்.",
                            "verse 74:18": "நிச்சயமாக அவன் (குர்ஆனுக்கு எதிராகச்) சிந்தித்து (ஒரு திட்டத்தை) ஏற்படுத்திக் கொண்டான்.",
                            "verse 74:19": "அவன் அழிவானாக! எப்படி அவன் ஏற்படுத்திக் கொண்டான்?",
                            "verse 74:20": "பின்னரும், அவன் அழிவானாக! எப்படி அவன் ஏற்படுத்திக் கொண்டான்?",
                            "verse 74:21": "பிறகும் (குர்ஆனின் வசனங்களை) அவன் நோட்டமிட்டான்.",
                            "verse 74:22": "பின்னர், (அதுபற்றிக் குறை கூற இயலாதவனாக) கடுகடுத்தான், இன்னும் (முகஞ்) சுளித்தான்.",
                            "verse 74:23": "அதன் பின்னர் (சத்தியத்தை ஏற்காமல்) புறமுதுகு காட்டினான்; இன்னும் பெருமை கொண்டான்.",
                            "verse 74:24": "அப்பால் அவன் கூறினான்: \"இது (பிறரிடமிருந்து கற்றுப்) பேசப்படும் சூனியமே அன்றி வேறில்லை.",
                            "verse 74:25": "\"இது மனிதனின் சொல்லல்லாமலும் வேறில்லை\" (என்றும் கூறினான்.",
                            "verse 74:26": "அவனை நான் \"ஸகர்\" (என்னும்) நரகில் புகச் செய்வேன்.",
                            "verse 74:27": "\"ஸகர்\" என்னவென்பதை உமக்கு எது விளக்கும்?",
                            "verse 74:28": "அது (எவரையும்) மிச்சம் வைக்காது, விட்டு விடவும் செய்யாது.",
                            "verse 74:29": "(அது சுட்டுக் கரித்து மனிதனின்) மேனியையே உருமாற்றி விடும்.",
                            "verse 74:30": "அதன் மீது பத்தொன்பது (வானவர்கள் நியமிக்கப்பட்டு) இருக்கின்றனர்.",
                            "verse 74:31": "அன்றியும், நரகக் காவலாளிகளை மலக்குகள் அல்லாமல் நாம் ஆக்கவில்லை, காஃபிர்களுக்கு அவர்களுடைய எண்ணிக்கையை ஒரு சோதனையாகவே ஆக்கினோம் - வேதம் கொடுக்கப்பட்டவர்கள் - உறுதிகொள்வதற்கும், ஈமான் கொண்டவர்கள், ஈமானை அதிகரித்துக் கொள்வதற்கும் வேதம் கொடுக்கப்பட்டவர்களும், முஃமின்களும் சந்தேகம் கொள்ளாமல் இருப்பதற்கும் (நாம் இவ்வாறு ஆக்கினோம்); எனினும் எவர்களுடைய இருதயங்களில் நோய் இருக்கிறதோ, அவர்களும் காஃபிர்களும்; \"அல்லாஹ் (பத்தொன்பது எனும் இந்த எண்ணிக்கையின்) உதாரணத்தைக் கொண்டு எ(ன்ன கருத்)தை நாடினான்?\" என கேட்பதற்காகவுமே (இவ்வாறு ஆக்கினோம்).",
                            "verse 74:32": "(ஸகர் என்னும் நரகு நிராகரிப்போர் கூறுவது போல்) அல்ல, இன்னும் சந்திரன் மீது சத்தியமாக.",
                            "verse 74:33": "இரவின் மீதும் சத்தியமாக - அது பின்னோக்கிச் செல்லும் பொழுது.",
                            "verse 74:34": "விடியற் காலையின் மீது சத்தியமாக - அது வெளிச்சமாகும் பொழுது,",
                            "verse 74:35": "நிச்சயமாக அ(ந்த ஸகரான)து மிகப் பெரியவற்றுள் ஒன்றாகும்.",
                            "verse 74:36": "(அது) மனிதர்களுக்கு அச்சமூட்டி எச்சரிக்கை செய்கின்றது-",
                            "verse 74:37": "உங்களில் எவன் (அதை) முன்னோக்கியோ, அல்லது (அதிலிருந்து) பின்வாங்கியோ செல்ல விரும்புகிறானோ அவனை (அது எச்சரிக்கிறது).",
                            "verse 74:38": "ஒவ்வொரு மனிதனும் தான் சம்பாதிப்பதற்குப் பிணையாக இருக்கின்றான்.",
                            "verse 74:39": "வலக்கைப்புறத்துத் தோழர்களைத் தவிர",
                            "verse 74:40": "(அவர்கள்) சுவர்க்கச் சோலைகளில் (இருப்பார்கள்; எனினும்) விசாரித்தும் கொள்வார்கள்-",
                            "verse 74:41": "குற்றவாளிகளைக் குறித்து-",
                            "verse 74:42": "\"உங்களை ஸகர் (நரகத்தில்) நுழைய வைத்தது எது?\" (என்று கேட்பார்கள்.",
                            "verse 74:43": "அவர்கள் (பதில்) கூறுவார்கள்; \"தொழுபவர்களில் நின்றும் நாங்கள் இருக்கவில்லை.",
                            "verse 74:44": "\"அன்றியும், ஏழைகளுக்கு நாங்கள் உணவும் அளிக்கவில்லை.",
                            "verse 74:45": "\"(வீணானவற்றில்) மூழ்கிக்கிடந்தோருடன், நாங்களும் மூழ்கிக்கிடந்தோம்.",
                            "verse 74:46": "\"இந்த நியாயத் தீர்ப்பு நாளை நாங்கள் பொய்யாக்கிக் கொண்டும் இருந்தோம்.",
                            "verse 74:47": "\"உறுதியான (மரணம்) எங்களிடம் வரும்வரையில் (இவ்வாறாக இருந்தோம்\" எனக் கூறுவர்).",
                            "verse 74:48": "ஆகவே, சிபாரிசு செய்வோரின் எந்த சிபாரிசும் அவர்களுக்குப் பயனளிக்காது.",
                            "verse 74:49": "நல்லுபதேசத்தை விட்டும் முகம் திருப்புகிறார்களே - இவர்களுக்கு என்ன நேர்ந்தது?",
                            "verse 74:50": "அவர்கள் வெருண்டு ஓடும் காட்டுக்கழுதைகளைப் போல்-",
                            "verse 74:51": "(அதுவும்) சிங்கத்தைக் கண்டு வெருண்டு ஓடும் (காட்டுக் கழுதை போல் இருக்கின்றனர்).",
                            "verse 74:52": "ஆனால், அவர்களில் ஒவ்வொரு மனிதனும் விரிக்கப்பட்ட வேதங்கள் தனக்கும் கொடுக்கப்பட வேண்டும் என்று நாடுகிறான்.",
                            "verse 74:53": "அவ்வாறில்லை: மறுமையைப் பற்றி அவர்கள் பயப்படவில்லை.",
                            "verse 74:54": "அப்படியல்ல: நிச்சயமாக இது நல்லுபதேசமாகும்.",
                            "verse 74:55": "(எனவே நல்லுபதேசம் பெற) எவர் விரும்புகிறாரோ அவர் இதை நினைவில் வைத்துக் கொள்ளட்டும்,",
                            "verse 74:56": "இன்னும், அல்லாஹ் நாடினாலன்றி அவர்கள் நல்லுபதேசம் பெற முடியாது."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "โอ้ผู้ห่มกายอยู่เอ๋ย !",
                            "verse 74:2": "จงลุกขึ้น แล้วประกาศตักเตือน",
                            "verse 74:3": "และแด่พระเจ้าของเจ้า จงให้ความเกียงไกร (ต่อพระองค์)",
                            "verse 74:4": "และเสื้อผ้าของเจ้า จงทำให้สะอาด",
                            "verse 74:5": "และสิ่งสกปรกก็จงหลบหลีกให้ห่างเสีย",
                            "verse 74:6": "และอย่าทำคุณ เพื่อหวังการตอบแทนอันมากมาย",
                            "verse 74:7": "และเพื่อพระเจ้าของเจ้าเท่านั้นจงอดทน",
                            "verse 74:8": "ในที่สุด เมื่อเสียงเป่าถูกเป่าขึ้น",
                            "verse 74:9": "นั่นคือ วันนั้น วันแห่งความยากลำบาก",
                            "verse 74:10": "แก่บรรดาผู้ปฏิเสธศรัทธา มิใช่เป็นเรื่องง่าย",
                            "verse 74:11": "จงปล่อยข้าไว้กับผู้ที่ข้าได้สร้างเขาไว้แต่ลำพังเถิด",
                            "verse 74:12": "และข้าได้ทำให้เขามีทรัพย์สมบัติอย่างล้นเหลือ",
                            "verse 74:13": "และลูกหลานอย่างพรั่งพร้อม",
                            "verse 74:14": "และข้าได้ทำให้เขาสุขสบายอย่างราบรื่น",
                            "verse 74:15": "แล้วเขายังโลภที่จะให้ข้าเพิ่มพูนแก่เขาอีก",
                            "verse 74:16": "เปล่าเลย ! เพราะว่าเขาเป็นผู้ดื้อรั้นต่อสัญญาณต่าง ๆ ของเรา",
                            "verse 74:17": "ในไม่ช้าข้าจะเพิ่มพูนความยากลำบากแก่เขา",
                            "verse 74:18": "แท้จริงเขาได้ใคร่ครวญและคาดคะเน",
                            "verse 74:19": "ดังนั้นเขาได้รับความหายนะ เขาจะคาดคะเนได้อย่างไร ?",
                            "verse 74:20": "แล้วเขาได้รับความหายนะ เขาจะคาดคะเนได้อย่างไร ?",
                            "verse 74:21": "แล้วเขาได้ตรึกตรอง",
                            "verse 74:22": "แล้วเขาทำหน้าบูดบึ้ง และทำหน้านิ่วคิ้วขมวด",
                            "verse 74:23": "แล้วเขาก็ผินหลังออกไป และหยิ่งผยอง",
                            "verse 74:24": "แล้วเขากล่าวว่า นี่มิใช่อื่นนอกจากเป็นมายากลที่สืบทอดกันมา",
                            "verse 74:25": "นี่มิใช่อื่นใดนอกจากเป็นคำพูดของปุถุชน",
                            "verse 74:26": "ในไม่ช้าข้าจะโยนเขาเข้าสู่กองไฟที่เผาไหม้",
                            "verse 74:27": "และอันใดเล่าทำให้เจ้ารู้ได้ว่า สิ่งที่เผาไหม้นั้นคืออะไร ?",
                            "verse 74:28": "มันจะไม่เหลืออะไรเลย และมันจะไม่ปล่อยผู้ใดให้คงเหลือไว้ (เช่นกัน)",
                            "verse 74:29": "มันจะเผาไหม้ผิวหนังจนเกรียมดำ",
                            "verse 74:30": "เหนือมันมีมลาอิกะฮ์สิบเก้าท่าน",
                            "verse 74:31": "และเรามิได้แต่งตั้งผู้ใดเป็นยามเฝ้าประตูนรก นอกจากมลาอิกะฮ์เท่านั้น และเรามิได้กำหนดจำนวนของพวกเขาไว้ เว้นแต่เพื่อเป็นการทดสอบแก่บรรดาผู้ปฏิเสธศรัทธา เพื่อบรรดาอะฮ์ลุลกิตาบจะได้เชื่อมั่น และบรรดาผู้ศรัทธาจะได้เพิ่มพูนการศรัทธา และบรรดาอะฮ์ลุลกิตาบรวมทั้งบรรดาผู้ศรัทธาจะไม่ต้องสงสัย และเพื่อบรรดาผู้ในหัวใจของพวกเขามีโรคอีกทั้งบรรดาผู้ปฏิเสธศรัทธาจะกล่าวว่า อัลลอฮ์ทรงประสงค์อะไรด้วยอุปมานี้ เช่นนั้นแหละอัลลอฮ์จะทรงให้หลงทางผู้ที่พระองค์ทรงประสงค์ และจะทรงชี้แนะทางแก่ผู้ที่พระองค์ทรงประสงค์และไม่มีผู้ใดรู้จำนวนไพร่พลของพระเจ้าของเจ้านอกจากพระองค์ และนี่มิใช่อื่นใดนอกจากเป็นข้อตักเตือนแก่มนุษย์",
                            "verse 74:32": "เปล่าเลย ขอสาบานด้วยดวงจันทร์",
                            "verse 74:33": "ขอสาบานด้วยกลางคืนเมือมันคล้อยไป",
                            "verse 74:34": "ขอสาบานด้วยยามเช้าเมื่อมันทอแสง",
                            "verse 74:35": "แท้จริงนรกนั้นแน่นอนเป็นหนึ่งในความหายนะอันใหญ่หลวง",
                            "verse 74:36": "เพื่อเป็นการเตือนสำทับแก่มนุษย์",
                            "verse 74:37": "สำหรับผู้ที่ประสงค์ในหมู่พวกเจ้าจะรุดหน้า (ไปสู่ความดี) หรือจะรั้งท้าย (เพื่อกระทำความชั่ว)",
                            "verse 74:38": "แต่ละชีวิตย่อมถูกค้ำประกันกับสิ่งที่มันขวนขวายไป",
                            "verse 74:39": "ยกเว้นบรรดาผู้อยู่เบื้องขวา",
                            "verse 74:40": "อยู่ในสวนสวรรค์หลากหลาย พวกเขาจะไต่ถามซึ่งกันและกัน",
                            "verse 74:41": "เกี่ยวกับพวกที่กระทำความผิด",
                            "verse 74:42": "อะไรที่นำพวกท่านเข้าสู่กองไฟที่เผาไหม้",
                            "verse 74:43": "พวกเขากล่าวว่า เรามิได้อยู่ในหมู่ผู้ทำละหมาด",
                            "verse 74:44": "เรามิได้ให้อาหารแก่บรรดาผู้ขัดสน",
                            "verse 74:45": "และพวกเราเคยมั่วสุมอยู่กับพวกที่มั่วสุม",
                            "verse 74:46": "และเราเคยปฏิเสธวันแห่งการตอบแทน",
                            "verse 74:47": "จนกระทั่งความตายได้มาเยือนเรา",
                            "verse 74:48": "ดังนั้นการชะฟาอะฮ์ของบรรดาผู้มีชะฟาอะฮ์จะไม่เกิดประโยชน์อันใดแก่พวกเขา",
                            "verse 74:49": "ดังนั้นเกิดอะไรขึ้นแก่พวกเขา โดยทีพวกเขาผินหลังออกห่างจากการเตือนสติ",
                            "verse 74:50": "ประหนึ่งว่าพวกเขาเป็นลาเปรียวที่ตื่นตระหนก",
                            "verse 74:51": "หนีจากเสือสิงห์",
                            "verse 74:52": "แท้จริงแล้วทุกคนในหมู่พวกเขาต้องการที่จะมีแผ่นกระดาษกางแผ่ยืนมาให้แก่เขา",
                            "verse 74:53": "ไม่เลยทีเดียว! ยิ่งไปกว่านั้นพวกเขายังไม่กลัววันปรโลกอีกด้วย",
                            "verse 74:54": "เปล่ามิได้! แท้จริงนั่นคือข้อเตือนสติ",
                            "verse 74:55": "ฉะนั้นผู้ใดประสงค์เขาก็จะจดจำรำลึกไว้",
                            "verse 74:56": "และพวกเขาจะไม่จดจำรำลึกได้ เว้นแต่อัลลอฮ์จะทรงประสงค์ พระองค์เท่านั้นคือพระเจ้าแห่งการยำเกรงและพระเจ้าแห่งการให้อภัย"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "Ey bürünüp sarınan (Resûlüm)!",
                            "verse 74:2": "Kalk, ve (insanları) uyar.",
                            "verse 74:3": "Sadece Rabbini büyük tanı.",
                            "verse 74:4": "Elbiseni tertemiz tut.",
                            "verse 74:5": "Kötü şeyleri terket.",
                            "verse 74:6": "Yaptığın iyiliği çok görerek başa kakma.",
                            "verse 74:7": "Rabbinin rızasına ermek için sabret.",
                            "verse 74:8": "O Sûr'a üfürüldüğü zaman var ya,",
                            "verse 74:9": "İşte o gün zorlu bir gündür.",
                            "verse 74:10": "Kâfirler için (hiç de) kolay değildir.",
                            "verse 74:11": "Tek olarak yarattığım, kimseyi bana bırak,",
                            "verse 74:12": "Kendisine geniş servet verdim,",
                            "verse 74:13": "Göz önünde duran oğullar (verdim),",
                            "verse 74:14": "Kendisine",
                            "verse 74:15": "bir döşeyiş döşedim.",
                            "verse 74:16": "Üstelik o (nimetlerimi) daha da arttırmamı umuyor.",
                            "verse 74:17": "Asla (ummasın)! Çünkü o, bizim âyetlerimize karşı alabildiğine inatçıdır.",
                            "verse 74:18": "Ben onu sarp bir yokuşa sardıracağım!",
                            "verse 74:19": "Zira o, düşündü taşındı, ölçtü biçti.",
                            "verse 74:20": "Canı çıkasıca, ne biçim ölçtü biçti!",
                            "verse 74:21": "Sonra, canı çıkasıca tekrar (ölçtü biçti); nasıl ölçtü biçtiyse!",
                            "verse 74:22": "Sonra baktı.",
                            "verse 74:23": "Sonra kaşlarını çattı, suratını astı.",
                            "verse 74:24": "En sonunda, kibirini yenemeyip sırt çevirdi.",
                            "verse 74:25": "\"Bu (Kur'an) dedi, olsa olsa (sihirbazlardan öğrenilip) nakledilen bir sihirdir.",
                            "verse 74:26": "Bu, insan sözünden başka bir şey değil.",
                            "verse 74:27": "Ben onu sekara (cehenneme) sokacağım.",
                            "verse 74:28": "Sen biliyor musun sekar nedir?",
                            "verse 74:29": "Hem (bütün bedeni helâk eder, hiçbir şey) bırakmaz, hem (eski hale getirip tekrar azap etmekten) vazgeçmez o.",
                            "verse 74:30": "İnsanın derisini kavurur.",
                            "verse 74:31": "Üzerinde ondokuz (muhafız melek) vardır.",
                            "verse 74:32": "Biz cehennemin işlerine bakmakla ancak melekleri görevlendirmişizdir.",
                            "verse 74:33": "Hayır hayır (öğüt almazlar).",
                            "verse 74:34": "Dönüp gitmekte olan geceye,",
                            "verse 74:35": "Ağarmakta olan sabaha andolsun ki,",
                            "verse 74:36": "O (cehennem), büyük musibetlerden biridir.",
                            "verse 74:37": "İnsanlık için, uyarıcıdır.",
                            "verse 74:38": "Sizden ileri gitmek ya da geri kalmak isteyen kimseler için (uyarıcıdır) .",
                            "verse 74:39": "Her nefis, kazandığına karşılık bir rehindir;",
                            "verse 74:40": "Ancak sağdakiler başka.",
                            "verse 74:41": "Onlar cennetler içinde sorarlar.",
                            "verse 74:42": "Günahkârların durumunu:",
                            "verse 74:43": "\"Sizi şu yakıcı ateşe sokan nedir?\" diye",
                            "verse 74:44": "Onlar şöyle cevap verirler: Biz namaz kılanlardan değildik,",
                            "verse 74:45": "Yoksulu doyurmuyorduk,",
                            "verse 74:46": "(Bâtıla) dalanlarla birlikte dalıyorduk,",
                            "verse 74:47": "Ceza gününü de yalan sayıyorduk,",
                            "verse 74:48": "Sonunda bize ölüm geldi çattı.",
                            "verse 74:49": "Artık şefaatçilerin şefaati onlara fayda vermez.",
                            "verse 74:50": "Böyle iken onlara ne oluyor ki, öğütten yüz çeviriyorlar?",
                            "verse 74:51": "Kaçan yaban eşekleri gibi,",
                            "verse 74:52": "Âdeta arslandan ürkmüş.",
                            "verse 74:53": "Daha doğrusu onlardan her biri, kendisine, (önünde) açılmış sahifeler (ilâhî vahiy) verilmesini istiyor.",
                            "verse 74:54": "Hayır! Aslında onlar ahiretten korkmuyorlar.",
                            "verse 74:55": "Asla (düşündükleri gibi değil)! Bilsinler ki bu, gerçekten bir ikazdır!",
                            "verse 74:56": "Dileyen ondan (düşünüp) öğüt alır.",
                            "verse 74:57": "Bununla beraber, Allah dilemeksizin onlar öğüt alamazlar."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "اے (محمد) جو کپڑا لپیٹے پڑے ہو",
                            "verse 74:2": "اے چادر اوڑھنے والے (حبيب!)o",
                            "verse 74:3": "اُٹھيں اور (لوگوں کو اللہ کا) ڈر سنائيںo",
                            "verse 74:4": "اُٹھو اور ہدایت کرو",
                            "verse 74:5": "اور اپنے پروردگار کی بڑائی کرو",
                            "verse 74:6": "اور اپنے رب کي بڑائي (اور عظمت) بيان فرمائيںo",
                            "verse 74:7": "اور اپنے (ظاہر و باطن کے) لباس (پہلے کي طرح ہميشہ) پاک رکھيںo",
                            "verse 74:8": "اور اپنے کپڑوں کو پاک رکھو",
                            "verse 74:9": "اور ناپاکی سے دور رہو",
                            "verse 74:10": "اور (حسبِ سابق گناہوں اور) بتوں سے الگ رہيںo",
                            "verse 74:11": "اور (اس غرض سے کسي پر) احسان نہ کريں کہ اس سے زيادہ کے طالب ہوںo",
                            "verse 74:12": "اور (اس نیت سے) احسان نہ کرو کہ اس سے زیادہ کے طالب ہو",
                            "verse 74:13": "اور اپنے پروردگار کے لئے صبر کرو",
                            "verse 74:14": "اور آپ اپنے رب کے لئے صبر کيا کريںo",
                            "verse 74:15": "پھر جب (دوبارہ) صور ميں پھونک ماري جائے گيo",
                            "verse 74:16": "جب صور پھونکا جائے گا",
                            "verse 74:17": "وہ دن کا مشکل دن ہوگا",
                            "verse 74:18": "سو وہ دن (يعني روزِ قيامت) بڑا ہي سخت دن ہوگاo",
                            "verse 74:19": "کافروں پر ہرگز آسان نہ ہوگاo",
                            "verse 74:20": "(یعنی) کافروں پر آسان نہ ہوگا",
                            "verse 74:21": "ہمیں اس شخص سے سمجھ لینے دو جس کو ہم نے اکیلا پیدا کیا",
                            "verse 74:22": "آپ مجھے اور اس شخص کو جسے ميں نے اکيلا پيدا کيا (اِنتقام لينے کے لئے) چھوڑ ديںo",
                            "verse 74:23": "اور ميں نے اسے بہت وسيع مال مہيا کيا تھاo",
                            "verse 74:24": "اور مال کثیر دیا",
                            "verse 74:25": "اور (ہر وقت اس کے پاس) حاضر رہنے والے بیٹے دیئے",
                            "verse 74:26": "اور (اس کے سامنے) حاضر رہنے والے بيٹے (دئيے) تھےo",
                            "verse 74:27": "اور ميں نے اسے (سامانِ عيش و عشرت ميں) خوب وُسعت دي تھيo",
                            "verse 74:28": "اور ہر طرح کے سامان میں وسعت دی",
                            "verse 74:29": "ابھی خواہش رکھتا ہے کہ اور زیادہ دیں",
                            "verse 74:30": "پھر (بھي) وہ حرص رکھتا ہے کہ ميں اور زيادہ کروںo",
                            "verse 74:31": "ہرگز (ايسا) نہ ہوگا، بے شک وہ ہماري آيتوں کا دشمن رہا ہےo",
                            "verse 74:32": "ایسا ہرگز نہیں ہوگا۔ یہ ہماری آیتیں کا دشمن رہا ہے",
                            "verse 74:33": "ہم اسے صعود پر چڑھائیں گے",
                            "verse 74:34": "عنقريب ميں اسے سخت مشقت (کے عذاب) کي تکليف دوں گاo",
                            "verse 74:35": "بے شک اس نے سوچ بچار کي اور ايک سازش وضع کرليo",
                            "verse 74:36": "اس نے فکر کیا اور تجویز کی",
                            "verse 74:37": "یہ مارا جائے اس نے کیسی تجویز کی",
                            "verse 74:38": "بس اس پر (اللہ کي) مار (يعني لعنت) ہو، اس نے کيسي سازش تيار کيo",
                            "verse 74:39": "اس پر پھر (اللہ کي) مار (يعني لعنت) ہو، اس نے (يہ) کيسي سازش کيo",
                            "verse 74:40": "پھر یہ مارا جائے اس نے کیسی تجویز کی",
                            "verse 74:41": "پھر تامل کیا",
                            "verse 74:42": "پھر اس نے (اپني تجويز پر دوبارہ) غور کياo",
                            "verse 74:43": "پھر تيوري چڑھائي اور منہ بگاڑاo",
                            "verse 74:44": "پھر تیوری چڑھائی اور منہ بگاڑ لیا",
                            "verse 74:45": "پھر پشت پھیر کر چلا اور (قبول حق سے) غرور کیا",
                            "verse 74:46": "پھر (حق سے) پيٹھ پھير لي اور تکبّر کياo",
                            "verse 74:47": "پھر کہنے لگا کہ يہ (قرآن) جادو کے سوا کچھ نہيں جو (اگلے جادوگروں سے) نقل ہوتا چلا آرہا ہےo",
                            "verse 74:48": "پھر کہنے لگا کہ یہ تو جادو ہے جو (اگلوں سے) منتقل ہوتا آیا ہے",
                            "verse 74:49": "(پھر بولا) یہ (خدا کا کلام نہیں بلکہ) بشر کا کلام ہے",
                            "verse 74:50": "يہ (قرآن) بجز اِنسان کے کلام کے (اور کچھ) نہيںo",
                            "verse 74:51": "ميں عنقريب اسے دوزخ ميں جھونک دوں گاo",
                            "verse 74:52": "ہم عنقریب اس کو سقر میں داخل کریں گے",
                            "verse 74:53": "اور تم کیا سمجھے کہ سقر کیا ہے؟",
                            "verse 74:54": "اور آپ کو کس نے بتايا ہے کہ سَقَر کيا ہےo",
                            "verse 74:55": "وہ (ايسي آگ ہے جو) نہ باقي رکھتي ہے اور نہ چھوڑتي ہےo",
                            "verse 74:56": "(وہ آگ ہے کہ) نہ باقی رکھے گی اور نہ چھوڑے گی",
                            "verse 74:57": "اور بدن جھلس کر سیاہ کردے گی",
                            "verse 74:58": "(وہ) جسماني کھال کو جھلسا کر سياہ کر دينے والي ہےo",
                            "verse 74:59": "اس پر اُنيس (19 فرشتے داروغے مقرر) ہيںo",
                            "verse 74:60": "اس پر اُنیس داروغہ ہیں",
                            "verse 74:61": "اور ہم نے دوزخ کے داروغہ فرشتے بنائے ہیں۔ اور ان کا شمار کافروں کی آزمائش کے لئے مقرر کیا ہے (اور) اس لئے کہ اہل کتاب یقین کریں اور مومنوں کا ایمان اور زیادہ ہو اور اہل کتاب اور مومن شک نہ لائیں۔ اور اس لئے کہ جن لوگوں کے دلوں میں (نفاق کا) مرض ہے اور (جو) کافر (ہیں) کہیں کہ اس مثال (کے بیان کرنے) سے خدا کا مقصد کیا ہے؟ اسی طرح خدا جس کو چاہتا ہے گمراہ کرتا ہے اور جس کو چاہتا ہے ہدایت کرتا ہے اور تمہارے پروردگار کے لشکروں کو اس کے سوا کوئی نہیں جانتا۔ اور یہ تو بنی آدم کے لئے نصیحت ہے",
                            "verse 74:62": "اور ہم نے دوزخ کے داروغے صرف فرشتے ہي مقرر کئے ہيں اور ہم نے ان کي گنتي کافروں کے لئے محض آزمائش کے طور پر مقرر کي ہے تاکہ اہلِ کتاب يقين کر ليں (کہ قرآن اور نبوتِ محمدي صلي اللہ عليہ وآلہ وسلم حق ہے کيونکہ ان کي کتب ميں بھي يہي تعداد بيان کي گئي تھي) اور اہلِ ايمان کا ايمان (اس تصديق سے) مزيد بڑھ جائے، اور اہلِ کتاب اور مومنين (اس کي حقانيت ميں) شک نہ کر سکيں، اور تاکہ وہ لوگ جن کے دلوں ميں (نفاق کي) بيماري ہے اور کفار يہ کہيں کہ اس (تعداد کي) مثال سے اللہ کي مراد کيا ہے؟ اسي طرح اللہ (ايک ہي بات سے) جسے چاہتا ہے گمراہ ٹھہراتا ہے اور جسے چاہتا ہے ہدايت فرماتا ہے، اور آپ کے رب کے لشکروں کو اس کے سوا کوئي نہيں جانتا، اور يہ (دوزخ کا بيان) اِنسان کي نصيحت کے لئے ہي ہےo",
                            "verse 74:63": "ہاں، چاند کي قَسم (جس کا گھٹنا، بڑھنا اور غائب ہو جانا گواہي ہے)o",
                            "verse 74:64": "ہاں ہاں (ہمیں) چاند کی قسم",
                            "verse 74:65": "اور رات کی جب پیٹھ پھیرنے لگے",
                            "verse 74:66": "اور رات کي قَسم جب وہ پيٹھ پھير کر رخصت ہونے لگےo",
                            "verse 74:67": "اور صبح کي قَسم جب وہ روشن ہو جائےo",
                            "verse 74:68": "اور صبح کی جب روشن ہو",
                            "verse 74:69": "کہ وہ (آگ) ایک بہت بڑی (آفت) ہے",
                            "verse 74:70": "بے شک يہ (دوزخ) بہت بڑي آفتوں ميں سے ايک ہےo",
                            "verse 74:71": "انسان کو ڈرانے والي ہےo",
                            "verse 74:72": "(اور) بنی آدم کے لئے مؤجب خوف",
                            "verse 74:73": "جو تم میں سے آگے بڑھنا چاہے یا پیچھے رہنا چاہے",
                            "verse 74:74": "(يعني) اس شخص کے لئے جو تم ميں سے (نيکي ميں) آگے بڑھنا چاہے يا جو (بدي ميں پھنس کر) پيچھے رہ جائےo",
                            "verse 74:75": "ہر شخص اُن (اَعمال) کے بدلے جو اُس نے کما رکھے ہيں گروي ہےo",
                            "verse 74:76": "ہر شخص اپنے اعمال کے بدلے گرو ہے",
                            "verse 74:77": "مگر داہنی طرف والے (نیک لوگ)",
                            "verse 74:78": "سوائے دائيں جانب والوں کےo",
                            "verse 74:79": "(وہ) باغات ميں ہوں گے، اور آپس ميں پوچھتے ہوں گےo",
                            "verse 74:80": "(کہ) وہ باغہائے بہشت میں (ہوں گے اور) پوچھتے ہوں گے",
                            "verse 74:81": "(یعنی آگ میں جلنے والے) گنہگاروں سے",
                            "verse 74:82": "مجرموں کے بارے ميںo",
                            "verse 74:83": "(اور کہيں گے:) تمہيں کيا چيز دوزخ ميں لے گئيo",
                            "verse 74:84": "کہ تم دوزخ میں کیوں پڑے؟",
                            "verse 74:85": "وہ جواب دیں گے کہ ہم نماز نہیں پڑھتے تھے",
                            "verse 74:86": "وہ کہيں گے: ہم نماز پڑھنے والوں ميں نہ تھےo",
                            "verse 74:87": "اور ہم محتاجوں کو کھانا نہيں کھلاتے تھےo",
                            "verse 74:88": "اور نہ فقیروں کو کھانا کھلاتے تھے",
                            "verse 74:89": "اور اہل باطل کے ساتھ مل کر (حق سے) انکار کرتے تھے",
                            "verse 74:90": "اور بيہودہ مشاغل والوں کے ساتھ (مل کر) ہم بھي بيہودہ مشغلوں ميں پڑے رہتے تھےo",
                            "verse 74:91": "اور ہم روزِ جزا کو جھٹلايا کرتے تھےo",
                            "verse 74:92": "اور روز جزا کو جھٹلاتے تھے",
                            "verse 74:93": "یہاں تک کہ ہمیں موت آگئی",
                            "verse 74:94": "يہاں تک کہ ہم پر جس کا آنا يقيني تھا (وہ موت) آپہنچيo",
                            "verse 74:95": "سو (اب) شفاعت کرنے والوں کي شفاعت انہيں کوئي نفع نہيں پہنچائے گيo",
                            "verse 74:96": "(تو اس حال میں) سفارش کرنے والوں کی سفارش ان کے حق میں کچھ فائدہ نہ دے گی",
                            "verse 74:97": "ان کو کیا ہوا ہے کہ نصیحت سے روگرداں ہو رہے ہیں",
                            "verse 74:98": "تو ان (کفّار) کو کيا ہوگيا ہے کہ (پھر بھي) نصيحت سے رُوگرداني کئے ہوئے ہيںo",
                            "verse 74:99": "گويا وہ بِدکے ہوئے (وحشي) گدھے ہيںo",
                            "verse 74:100": "گویا گدھے ہیں کہ بدک جاتے ہیں",
                            "verse 74:101": "(یعنی) شیر سے ڈر کر بھاگ جاتے ہیں",
                            "verse 74:102": "جو شير سے بھاگ کھڑے ہوئے ہيںo",
                            "verse 74:103": "بلکہ ان ميں سے ہر ايک شخص يہ چاہتا ہے کہ اُسے (براہِ راست) کھلے ہوئے (آسماني) صحيفے دے دئيے جائيںo",
                            "verse 74:104": "اصل یہ ہے کہ ان میں سے ہر شخص یہ چاہتا ہے کہ اس کے پاس کھلی ہوئی کتاب آئے",
                            "verse 74:105": "ایسا ہرگز نہیں ہوگا۔ حقیقت یہ ہے کہ ان کو آخرت کا خوف ہی نہیں",
                            "verse 74:106": "ايسا ہرگز ممکن نہيں، بلکہ (حقيقت يہ ہے کہ) وہ لوگ آخرت سے ڈرتے ہي نہيںo",
                            "verse 74:107": "کچھ شک نہيں کہ يہ (قرآن) نصيحت ہےo",
                            "verse 74:108": "کچھ شک نہیں کہ یہ نصیحت ہے",
                            "verse 74:109": "تو جو چاہے اسے یاد رکھے",
                            "verse 74:110": "پس جو چاہے اِسے ياد رکھےo",
                            "verse 74:111": "اور يہ لوگ (اِسے) ياد نہيں رکھيں گے مگر جب اللہ چاہے گا، وُہي تقو?ي (و پرہيزگاري) کا مستحق ہے اور مغفرت کا مالک ہےo",
                            "verse 74:112": "اور یاد بھی تب ہی رکھیں گے جب خدا چاہے۔ وہی ڈرنے کے لائق اور بخشش کا مالک ہے ہےo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 74:1": "Эй бурканиб ётган!",
                            "verse 74:2": "Тур ва огоҳлантир!",
                            "verse 74:3": "Ва Роббингни улуғла!",
                            "verse 74:4": "Ва кийимингни покла!",
                            "verse 74:5": "Ва азоб(сабабчиси)дан четлан!",
                            "verse 74:6": "Ва кўп (иш)қилган бўлсанг ҳам, миннат қилма!",
                            "verse 74:7": "Ва Роббинг учун сабр қил!",
                            "verse 74:8": "Ва қачонки дудга пуфланса.",
                            "verse 74:9": "Ўшал кун, қийин кундир.",
                            "verse 74:10": "У кофирларга осон эмасдир.",
                            "verse 74:11": "Мени, Ўзим якка яратган кимса бидан қўйиб қўй.",
                            "verse 74:12": "Ва унга кўплаб молу дунё.",
                            "verse 74:13": "Ва ҳозиру нозир фарзандлар бериб қўйдим.",
                            "verse 74:14": "Ва унга (ҳамма нарсани) осонлаштириб қўйдим.",
                            "verse 74:15": "Сўнгра, яна зиёда қилишимни тамаъ қиладир.",
                            "verse 74:16": "Йўқ! Чунки, у Бизнинг оятларимизга саркаш эди.",
                            "verse 74:17": "Тезда уни машаққатли чиқишла ҳоритарман.",
                            "verse 74:18": "Албатта, у тафаккур қилди ва чамалаб кўрди.",
                            "verse 74:19": "Лаънат бўлсин унга, қандоқ ҳам чамалаб кўрди!",
                            "verse 74:20": "Сўнгра яна лаънат бўлсин унга, қандоқ ҳам чамалаб кўрди.",
                            "verse 74:21": "Сўнгра назар солди.",
                            "verse 74:22": "Сўнгра юзини буриштирди ва қавоғини солди.",
                            "verse 74:23": "Сўнгра юз ўгирди ва такаббурлик қилди.",
                            "verse 74:24": "Бас, бу асар қолган сеҳрдан ўзга ҳеч нарса эмас.",
                            "verse 74:25": "Бу башар сўзидан ўзга ҳеч нарса эмас, деди.",
                            "verse 74:26": "Тезда уни сақар (дўзахи)га киритаман.",
                            "verse 74:27": "Ва сақар нималигини сенга нима билдирди?",
                            "verse 74:28": "У (сақар) боқий қолдирмас ва тарк ҳам қилмас.",
                            "verse 74:29": "У терини кўп куйдирувчидир.",
                            "verse 74:30": "Унинг устида ўн тўққизта (фаришта) бордир.",
                            "verse 74:31": "Дўзах соҳибларини фаришталардан қилганимиз ва уларнинг адади ҳам фақат кофирларни санаш учундир.",
                            "verse 74:32": "Йўқ! Ой билан қасам.",
                            "verse 74:33": "Ва чекинаётган тун билан қасам.",
                            "verse 74:34": "Ва ёришаётган тонг билан қасам.",
                            "verse 74:35": "Албатта у(дўзах) улкан(азоб) ларнинг биридир.",
                            "verse 74:36": "Башарият учун огоҳлантирувчидир.",
                            "verse 74:37": "Сизлардан пешқадам бўлишни ёки ортда қолишни хоҳлаётган кимсалар учун ҳамдир.",
                            "verse 74:38": "Ҳар бир шахс ўз касбининг гаровидир.",
                            "verse 74:39": "Магар ўнг тараф соҳиблари мустаснодир.",
                            "verse 74:40": "Улар жаннатларда сўрарлар.",
                            "verse 74:41": "Гуноҳкорлардан.",
                            "verse 74:42": "Сизларни дўзахга нима киритди?",
                            "verse 74:43": "Улар:«Намоз ўқийдиганлардан бўлмаган эдик.",
                            "verse 74:44": "Ва мискинларга таом бермаган эдик.",
                            "verse 74:45": "Ва ботилга шунғувчилар билан бирга шўнғир эдик.",
                            "verse 74:46": "Ва қиёмат куни ёлғонга чиқарган эдик.",
                            "verse 74:47": "Токи бизга ўлим келгунича», дерлар.",
                            "verse 74:48": "Бас, уларга шафоатчиларнинг шафоати манфаат бермас.",
                            "verse 74:49": "Уларга не бўлдики, эслатмадан юз ўрирурлар?!",
                            "verse 74:50": "Худди қаттиқ қўрққан эшаклар.",
                            "verse 74:51": "Арслондан қочгани каби.",
                            "verse 74:52": "Балки улардан ҳар бири ўзига нашр қилинган саҳифалар берилишини ирода қиладир.",
                            "verse 74:53": "Йўқ! Балки улар охиратдан қўрқмаслар.",
                            "verse 74:54": "Йўқ! Албатта у(Қуръон) эслатмадир.",
                            "verse 74:55": "Бас, ким хоҳласа уни эслайдир.",
                            "verse 74:56": "Ва фақат Аллоҳ хоҳласагина эслайдилар."
                        }
                    }
                }
            }
        }
    }
}