{
    "surah_name": "Al-Mutaffifîn",
    "surah_name_ar": "المطففين",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 83:1": "Mjer për ata që kur masin – mungojnë,",
                            "verse 83:2": "të cilët e marrin masën e plotë kur është e marrin vetveten,",
                            "verse 83:3": "e, kur t’iu masin të tjerëve me litër ose me kandar – ju pakësojnë.",
                            "verse 83:4": "A nuk mendojnë ata se do të ringjallen",
                            "verse 83:5": "në një Ditë të madhe (të Kijametit),",
                            "verse 83:6": "atë Ditë kur njerëzit do të dalin para Zotit të gjithësisë!",
                            "verse 83:7": "Po, po, me të vërtetë, Libri i mëkatarëve është në Sixh-xhin,",
                            "verse 83:8": "e, ata e di ti se ç’është Sixh-xhin?",
                            "verse 83:9": "(Ai është) Libri i shkruar!",
                            "verse 83:10": "Mjer atë ditë për përgënjeshtarët,",
                            "verse 83:11": "që kanë mohuar Ditën e Kijametit –",
                            "verse 83:12": "e atë, e mohon vetëm kundërvajtësi, mëkatari (i madh),",
                            "verse 83:13": "i cili, kur i janë lexuar ajetet Tona, ka thënë: “Trillime të popujve të lashtë!”",
                            "verse 83:14": "E, nuk është ashtu! Por, veprat e tyre (të këqia) i kanë ndryshkur zemrat e tyre (i kanë nxirë).",
                            "verse 83:15": "Jo, jo, atë ditë, me të vërtetë, ata do të jenë të penguar që ta shohin Zotin e tyre,",
                            "verse 83:16": "pastaj, me siguri, do të hyjnë në skëterrë,",
                            "verse 83:17": "e do t’ju thuhet (nga engjëjt e skëterrës): “Qe, kjo është ajo që e keni mohuar!”",
                            "verse 83:18": "Po, po, me të vërtetë, Libri i të ndershmëve është në Il-lijjin,",
                            "verse 83:19": "E, a e di ti se ç’është Il-lijjin?",
                            "verse 83:20": "Ai është Libri i shkruar",
                            "verse 83:21": "që e dëshmojnë të afërmit (engjëjt) e Perëndisë.",
                            "verse 83:22": "Me të vërtetë, të mirët (njerëz) do të gjenden në xhennet,",
                            "verse 83:23": "e nga divanet – kanapet do të shikojnë,",
                            "verse 83:24": "në fytyrat e tyre do të njohësh freskinë e begative,",
                            "verse 83:25": "atyre do t’u jepet të pinë nga pijet e mbyllura (të ruajtura),",
                            "verse 83:26": "vula e të cilave është misk (parfem), - dhe për këtë, le të bëjnë gara garuesit! –",
                            "verse 83:27": "(pija) do të jetë e përzier me ujin e Tesnimit,",
                            "verse 83:28": "nga burimi i të cilit do të pinë të afërmit e Perëndisë (të mirët).",
                            "verse 83:29": "Me të vërtetë, mëkatarët qeshnin (në jetën e kësaj bote), me ata që besonin;",
                            "verse 83:30": "kur kalonin pranë tyre, njëri-tjetrit ia bënin me sy,",
                            "verse 83:31": "e kur ktheheshin te familjet e tyre, ata argëtoheshin në formë tallëse (me besimtarët);",
                            "verse 83:32": "ata (mëkatarët), kur i shihnin (besimtarët), thonin: “Këta, me të vërtetë, janë të humbur”, -",
                            "verse 83:33": "e, ata nuk janë dërguar për kujdestarë të tyre (besimtarëve).",
                            "verse 83:34": "Sot, ata që kanë besuar, do t’i përqeshin mohuesit,",
                            "verse 83:35": "e, nga divanet (kanapet) do të shikojnë",
                            "verse 83:36": "a janë shpërblyer meritueshëm mohuesit, për veprat që kanë punuar?! (Po)."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Vay halına çəkidə və ölçüdə aldadanların!",
                            "verse 83:2": "O kəslər ki, özlərini insanlardan (bir şey) aldıqları zaman onu tam ölçüb alar,",
                            "verse 83:3": "Onlar üçün ölçdükdə və ya çəkdikdə isə (onu) əskildərlər.",
                            "verse 83:4": "Məgər onlar (öləndən sonra) diriləcəklərini düşünmürlərmi?!",
                            "verse 83:5": "?zü də dəhşətli bir gündə?!",
                            "verse 83:6": "O gün bütün insanlar (haqq-hesab üçün) aləmlərin Rəbbinin (Allahın) hüzurunda duracaqlar!",
                            "verse 83:7": "Xeyr! Şübhəsiz ki, pis əməllərə uyanların (kafirlərin) əməl dəftəri (şeytanların əməllərinin yazıldığı və ya Cəhənnəmin ən alt təbəqəsi olan) Siccindədir!",
                            "verse 83:8": "Sən nə bilirsən (haradan bilirsən) ki, Siccin nədir?! (Və ya: Siccin nədir, bilirsənmi?)",
                            "verse 83:9": "O, yazılı bir kitabdır!",
                            "verse 83:10": "O gün vay halına yalan sayanların!",
                            "verse 83:11": "O kəslər ki, haqq-hesab gününü yalan sayarlar.",
                            "verse 83:12": "Bunu isə ancaq həddini aşan, günaha batan yalan sayar.",
                            "verse 83:13": "Ayələrimiz ona oxunduğu zaman: \"(Bunlar) qədimlərin əfsanələridir (uydurmalarıdır!)\" - deyər.",
                            "verse 83:14": "Xeyr (belə deyildir).",
                            "verse 83:15": "Xeyr, o gün Rəbbinin mərhəmətindən məhrum olacaqlar!",
                            "verse 83:16": "Sonra Cəhənnəmə varid qalacaqlar.",
                            "verse 83:17": "Sonra da onlara: \"Bu sizin (dünyada) yalan saydığınız (Cəhənnəmdir)!\" deyiləcəkdir.",
                            "verse 83:18": "Xeyr! (Mö'minlərlə kafirlər eyni ola bilməzlər).",
                            "verse 83:19": "Sən nə bilirsən (haradan bilirsən) ki, İlliyyun nədir?!",
                            "verse 83:20": "O, yazılı bir kitabdır.",
                            "verse 83:21": "Onu ancaq (Allaha) yaxın olan mələklər görə bilər!",
                            "verse 83:22": "Həqiqətən, yaxşı əməl və itaət sahibi olan mö'minlər Nəim cənnətlərində olacaqlar.",
                            "verse 83:23": "Onlar taxtlar üstündə (əyləşib Allahın hazır etdiyi ne'mətlərə) tamaşa edəcəklər.",
                            "verse 83:24": "Sən (ey Peyğəmbər!) onların üzlərində cənnət sevinci görəcəksən!",
                            "verse 83:25": "Onlara (gözəl ətirli, təmiz) möhürlü (qablarda olan) şərab (rəhiq) içirdiləcəkdir.",
                            "verse 83:26": "Onun (içində rəhiq olan qabın) möhürü müşkdür.",
                            "verse 83:27": "Ona təsnim (suyu) qatılmışdır.",
                            "verse 83:28": "O (təsnim) elə bir çeşmədir ki, ondan (təmiz halda) yalnız (Allaha) yaxın olanlar içər (qalanlara isə o rəhiq şərabına qatılıb verirlər).",
                            "verse 83:29": "Həqiqətən, günahkarlar iman gətirmiş kimsələrə (dünyada) gülürdülər.",
                            "verse 83:30": "(Mö'minlərin) yanlarından keçərkən (onları dolamaq məqsədilə) bir-birinə qaş-göz edirdilər.",
                            "verse 83:31": "Ailələrinin (yaxın adamlarının) yanına qayıtdıqda isə (onları doladıqları üçün) kefləri kök qayıdırdılar.",
                            "verse 83:32": "Onlar (mö'minləri) gördükdə: \"Doğrusu, bunlar (haqq yoldan) azanlardır!\" - deyirdilər.",
                            "verse 83:33": "Halbuki onlara (mö'minlərə) nəzarətçi göndərilməmişdir.",
                            "verse 83:34": "Bu gün isə mö'minlər kafirlərə güləcəklər.",
                            "verse 83:35": "Onlar taxtlar üstündə (əyləşib) baxacaqlar (ki, görsünlər).",
                            "verse 83:36": "Kafirlər öz əməllərinin cəzasını aldılarmı?! (Əlbəttə, aldılar!)"
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Teško onima koji pri mjerenju zakidaju,",
                            "verse 83:2": "koji punu mjeru uzimaju kada od drugih kupuju,",
                            "verse 83:3": "a kada drugima mjere na litar ili na kantar - zakidaju.",
                            "verse 83:4": "Kako ne pomisle da će oživljeni biti",
                            "verse 83:5": "na Dan veliki,",
                            "verse 83:6": "na Dan kada će se ljudi zbog Gospodara svjetova dići!",
                            "verse 83:7": "Uistinu! Knjiga grješnika je u Sidždžinu,",
                            "verse 83:8": "a znaš li ti šta je Sidždžin?",
                            "verse 83:9": "Knjiga ispisana!",
                            "verse 83:10": "Teško toga dana onima koji su poricali -",
                            "verse 83:11": "koji su onaj svijet poricali -",
                            "verse 83:12": "a njega može poricati samo prijestupnik, grješnik,",
                            "verse 83:13": "koji je, kada su mu ajeti naši kazivani, govorio: \"Izmišljotine naroda drevnih!\"",
                            "verse 83:14": "A nije tako! Ono što su radili prekrilo je srca njihova,",
                            "verse 83:15": "uistinu, oni će toga dana od milosti Gospodara svoga zakonjeni biti,",
                            "verse 83:16": "zatim će, sigurno, u oganj ući,",
                            "verse 83:17": "pa će im se reći: \"Eto, to je ono što ste poricali!\"",
                            "verse 83:18": "Uistinu! Knjiga čestitih je u Ilijjunu,",
                            "verse 83:19": "a znaš li ti šta je Ilijjun?",
                            "verse 83:20": "Knjiga ispisana! -",
                            "verse 83:21": "nad njom bdiju oni Allahu bliski.",
                            "verse 83:22": "Dobri će, zaista, u nasladama boraviti.",
                            "verse 83:23": "sa divana gledati,",
                            "verse 83:24": "na licima njihovim prepoznaćeš radost sretna života,",
                            "verse 83:25": "daće im se pa će piće zapečaćeno piti,",
                            "verse 83:26": "čiji će pečat mošus biti - i neka se za to natječu oni koji se hoće natjecati! -",
                            "verse 83:27": "pomiješano sa vodom iz Tesnima",
                            "verse 83:28": "sa izvora iz kojeg će Allahu bliski piti.",
                            "verse 83:29": "Grješnici se smiju onima koji vjeruju;",
                            "verse 83:30": "kada pored njih prolaze, jedni drugima namiguju,",
                            "verse 83:31": "a kada se porodicama svojim vraćaju, šale zbijajući vraćaju se;",
                            "verse 83:32": "kada ih vide, onda govore: \"Ovi su, doista, zalutali!\" -",
                            "verse 83:33": "a oni nisu poslani da motre na njih.",
                            "verse 83:34": "Danas će oni koji su vjerovali - nevjernicima se podsmijavati,",
                            "verse 83:35": "sa divana će gledati.",
                            "verse 83:36": "Zar će nevjernici biti drugačije kažnjeni nego prema onome kako su postupali! gledati."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "যারা মাপে কম করে, তাদের জন্যে দুর্ভোগ,",
                            "verse 83:2": "যারা লোকের কাছ থেকে যখন মেপে নেয়, তখন পূর্ণ মাত্রায় নেয়",
                            "verse 83:3": "এবং যখন লোকদেরকে মেপে দেয় কিংবা ওজন করে দেয়, তখন কম করে দেয়।",
                            "verse 83:4": "তারা কি চিন্তা করে না যে, তারা পুনরুত্থিত হবে।",
                            "verse 83:5": "সেই মহাদিবসে,",
                            "verse 83:6": "যেদিন মানুষ দাঁড়াবে বিশ্ব পালনকর্তার সামনে।",
                            "verse 83:7": "এটা কিছুতেই উচিত নয়, নিশ্চয় পাপাচারীদের আমলনামা সিজ্জীনে আছে।",
                            "verse 83:8": "আপনি জানেন, সিজ্জীন কি?",
                            "verse 83:9": "এটা লিপিবদ্ধ খাতা।",
                            "verse 83:10": "সেদিন দুর্ভোগ মিথ্যারোপকারীদের,",
                            "verse 83:11": "যারা প্রতিফল দিবসকে মিথ্যারোপ করে।",
                            "verse 83:12": "প্রত্যেক সীমালংঘনকারী পাপিষ্ঠই কেবল একে মিথ্যারোপ করে।",
                            "verse 83:13": "তার কাছে আমার আয়াতসমূহ পাঠ করা হলে সে বলে, পুরাকালের উপকথা।",
                            "verse 83:14": "কখনও না, বরং তারা যা করে, তাই তাদের হৃদয় মরিচা ধরিয়ে দিয়েছে।",
                            "verse 83:15": "কখনও না, তারা সেদিন তাদের পালনকর্তার থেকে পর্দার অন্তরালে থাকবে।",
                            "verse 83:16": "অতঃপর তারা জাহান্নামে প্রবেশ করবে।",
                            "verse 83:17": "এরপর বলা হবে, একেই তো তোমরা মিথ্যারোপ করতে।",
                            "verse 83:18": "কখনও না, নিশ্চয় সৎলোকদের আমলনামা আছে ইল্লিয়্যীনে।",
                            "verse 83:19": "আপনি জানেন ইল্লিয়্যীন কি?",
                            "verse 83:20": "এটা লিপিবদ্ধ খাতা।",
                            "verse 83:21": "আল্লাহর নৈকট্যপ্রাপ্ত ফেরেশতাগণ একে প্রত্যক্ষ করে।",
                            "verse 83:22": "নিশ্চয় সৎলোকগণ থাকবে পরম আরামে,",
                            "verse 83:23": "সিংহাসনে বসে অবলোকন করবে।",
                            "verse 83:24": "আপনি তাদের মুখমন্ডলে স্বাচ্ছন্দ্যের সজীবতা দেখতে পাবেন।",
                            "verse 83:25": "তাদেরকে মোহর করা বিশুদ্ধ পানীয় পান করানো হবে।",
                            "verse 83:26": "তার মোহর হবে কস্তুরী। এ বিষয়ে প্রতিযোগীদের প্রতিযোগিতা করা উচিত।",
                            "verse 83:27": "তার মিশ্রণ হবে তসনীমের পানি।",
                            "verse 83:28": "এটা একটা ঝরণা, যার পানি পান করবে নৈকট্যশীলগণ।",
                            "verse 83:29": "যারা অপরাধী, তারা বিশ্বাসীদেরকে উপহাস করত।",
                            "verse 83:30": "এবং তারা যখন তাদের কাছ দিয়ে গমন করত তখন পরস্পরে চোখ টিপে ইশারা করত।",
                            "verse 83:31": "তারা যখন তাদের পরিবার-পরিজনের কাছে ফিরত, তখনও হাসাহাসি করে ফিরত।",
                            "verse 83:32": "আর যখন তারা বিশ্বাসীদেরকে দেখত, তখন বলত, নিশ্চয় এরা বিভ্রান্ত।",
                            "verse 83:33": "অথচ তারা বিশ্বাসীদের তত্ত্বাবধায়করূপে প্রেরিত হয়নি।",
                            "verse 83:34": "আজ যারা বিশ্বাসী, তারা কাফেরদেরকে উপহাস করছে।",
                            "verse 83:35": "সিংহাসনে বসে, তাদেরকে অবলোকন করছে,",
                            "verse 83:36": "কাফেররা যা করত, তার প্রতিফল পেয়েছে তো? করছে,"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 83:1": "Горко на ощетяващите,",
                            "verse 83:2": "които щом взимат от хората, изпълват мярката,",
                            "verse 83:3": "а щом им отмерват или им претеглят, причиняват загуба!",
                            "verse 83:4": "Не допускат ли тези, че ще бъдат възкресени",
                            "verse 83:5": "за великия Ден -",
                            "verse 83:6": "Деня, в който хората ще застанат пред Господа на световете?",
                            "verse 83:7": "Не! Книгата [за делата] на разпътниците е в Сиджжин.",
                            "verse 83:8": "Но откъде да знаеш ти какво е Сиджжин?",
                            "verse 83:9": "Книга ясно записана.",
                            "verse 83:10": "Горко в този Ден за отричащите,",
                            "verse 83:11": "които взимат за лъжа Съдния ден!",
                            "verse 83:12": "Взима го за лъжа само всеки престъпник, грешник.",
                            "verse 83:13": "Когато му четат Нашите знамения, казва: Легенди на предците!",
                            "verse 83:14": "Ала не! Сърцата им с ръжда покрива онова, което са придобили.",
                            "verse 83:15": "Ала не! Тогава не ще бъдат допуснати до своя Господ.",
                            "verse 83:16": "После ще горят в Ада.",
                            "verse 83:17": "После ще се каже: Това е, което отричахте!",
                            "verse 83:18": "Ала не! Книгата [за делата] на праведниците е в Иллийун.",
                            "verse 83:19": "Но откъде да знаеш ти какво е Иллийун?",
                            "verse 83:20": "Книга ясно записана.",
                            "verse 83:21": "Свидетелстват за нея приближените.",
                            "verse 83:22": "Праведниците са в блаженство,",
                            "verse 83:23": "от престоли гледат [към техния Господ].",
                            "verse 83:24": "Ще узнаеш по лицата им сиянието на блаженството.",
                            "verse 83:25": "Ще им се поднесе запечатано, пребистро питие.",
                            "verse 83:26": "Дори утайката му е като [ухание на] мускус.",
                            "verse 83:27": "Сместа му е от Тасним -",
                            "verse 83:28": "извор, от който пият приближените.",
                            "verse 83:29": "Онези, които престъпиха, се смееха на онези, които повярваха.",
                            "verse 83:30": "И когато минаваха край тях, си смигваха.",
                            "verse 83:31": "И когато се завръщаха при своите хора, те се завръщаха развеселени.",
                            "verse 83:32": "И когато ги виждаха, казваха: Тези са заблудени.",
                            "verse 83:33": "А те не бяха пратени за техни надзиратели.",
                            "verse 83:34": "Но в този Ден вярващите се смеят на неверниците.",
                            "verse 83:35": "От престоли гледат.",
                            "verse 83:36": "Не се ли въздаде на неверниците за онова, което са вършили? гледат."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "傷哉！稱量不公的人們。",
                            "verse 83:2": "當他們從別人稱量進來的時候，他們稱量得很充足；",
                            "verse 83:3": "當他們量給別人或稱給別人的時候，他們不稱足不量足。",
                            "verse 83:4": "難道他們不信自己將復活，",
                            "verse 83:5": "在一個重大的日子嗎？",
                            "verse 83:6": "在那日，人們將為全世界的主而起立。",
                            "verse 83:7": "絕不然，惡人們的紀錄，將在一本惡行簿中。",
                            "verse 83:8": "你怎能知道惡行簿是什麼？",
                            "verse 83:9": "是一本封存的簿子。",
                            "verse 83:10": "在那日，傷哉否認的人們——",
                            "verse 83:11": "否認報應日的人們！",
                            "verse 83:12": "只有每個過分的犯罪的人，否認它。",
                            "verse 83:13": "當別人對他宣讀我的跡象的時候，他說：「這是古人的故事。」",
                            "verse 83:14": "絕不然，但他們所犯的罪惡，已像銹樣蒙敝他們的心。",
                            "verse 83:15": "真的，在那日，他們必受阻攔，不得覲見他們的主。",
                            "verse 83:16": "然後，他們必墮入烈火之中。",
                            "verse 83:17": "然後，或者將對他們說：「這就是你們所否認的。」",
                            "verse 83:18": "真的，善人們的記錄，確在善行簿中。",
                            "verse 83:19": "你怎能知道善行簿是什麼？",
                            "verse 83:20": "是一本封存的簿子，",
                            "verse 83:21": "真主所親近的天神們將作証它。",
                            "verse 83:22": "善人們必在恩澤中，",
                            "verse 83:23": "靠在床上注視著，",
                            "verse 83:24": "你能在他們的面目上認識恩澤的光華。",
                            "verse 83:25": "他們將飲封存的天醇，",
                            "verse 83:26": "封瓶口的，是麝香。教貪愛這種幸福的人們，爭先為善吧！",
                            "verse 83:27": "天醇的混合物，是由太斯尼姆來的，",
                            "verse 83:28": "那是一洞泉水，真主所親近的人將飲它。",
                            "verse 83:29": "犯罪的人們常常嘲笑信士們，",
                            "verse 83:30": "當信士們從他們的面前走過的時候，他們以目互相示意；",
                            "verse 83:31": "當他們回家的時候，洋洋得意地回去；",
                            "verse 83:32": "當他們遇見信士們的時候，他們說：「這等人確是迷誤的。」",
                            "verse 83:33": "他們沒有被派去監視信士們。",
                            "verse 83:34": "故今日信士們，嘲笑不信道的人們，",
                            "verse 83:35": "他們靠在床上注視著，",
                            "verse 83:36": "「不信道的人們已獲得他們的行為的報酬了嗎？」 他們靠在床上注視著，"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Běda těm, kdo míru zkracují,",
                            "verse 83:2": "kteří když jim je měřeno plnou míru od lidí žádají,",
                            "verse 83:3": "však když pro druhé měří či váží, ztrátu jim působí!",
                            "verse 83:4": "Což si myslí, že nebudou vzkříšeni",
                            "verse 83:5": "pro den nesmírný,",
                            "verse 83:6": "pro den, kdy lidé před Pána vesmíru předstoupí?",
                            "verse 83:7": "Však pozor, vždyť věru kniha hříšníků je v Sidždžínu!",
                            "verse 83:8": "Víš ty vůbec, co je to Sidždžín?",
                            "verse 83:9": "Kniha označkovaná!",
                            "verse 83:10": "Běda v ten den těm, kdož za lež prohlašují",
                            "verse 83:11": "a za výmysl den soudný pokládají!",
                            "verse 83:12": "Nepokládá jej za výmysl nikdo kromě všech protivníků hříšných,",
                            "verse 83:13": "kteří - když jsou jim přednášena Naše znamení - říkají: \"To jsou povídačky starých!\"",
                            "verse 83:14": "Však pozor! Naopak srdce jejich zrezivěla od toho, co si vysloužila.",
                            "verse 83:15": "Však pozor! Věru že budou v ten den od svého Pána odděleni závěsem",
                            "verse 83:16": "a potom budou hořet v ohni pekelném",
                            "verse 83:17": "a posléze jim bude řečeno: \"Hle, zde máte, co nazývali jste výmyslem!\"",
                            "verse 83:18": "Však pozor! Vždyť věru kniha zbožných je v ´Illijún!",
                            "verse 83:19": "Víš ty vůbec, co je to ´Illijún?",
                            "verse 83:20": "Kniha označkovaná,",
                            "verse 83:21": "na vlastní oči ji spatří ten, kdo k Pánu bude přiblížen.",
                            "verse 83:22": "A zbožní vskutku budou ve slastech,",
                            "verse 83:23": "na pohovkách ležíce se budou rozhlížet.",
                            "verse 83:24": "Na jejich tvářích uzříš svěžest slastí,",
                            "verse 83:25": "napájeni budou vínem silným, zapečetěným",
                            "verse 83:26": "z pižma pečetí - o to nechť soutěží ti, kdož soutěží -",
                            "verse 83:27": "s vodou Tasnímu smíseným,",
                            "verse 83:28": "pramene, z něhož pijí jen přiblížení.",
                            "verse 83:29": "Věru že se hříšníci posmívali těm, kdož uvěřili,",
                            "verse 83:30": "a když je míjeli; vzájemně na sebe pomrkávali,",
                            "verse 83:31": "a když se ke svým rodinám vrátili, smích si tropili,",
                            "verse 83:32": "a když je viděli, volali: \"Věru jsou to zbloudilí!\",",
                            "verse 83:33": "A přec nebyli posláni k věřícím, aby je střežili.",
                            "verse 83:34": "Dnes však se nevěřícím posmívají ti, kdož věřili,",
                            "verse 83:35": "a na pohovkách ležíce se rozhlížejí.",
                            "verse 83:36": "Dostalo se nevěřícím odměny za to, co činili? rozhlížejí."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Wee hen die anderen tekort doen.",
                            "verse 83:2": "Wanneer zij voor zichzelf wegen, nemen zij volle maat;",
                            "verse 83:3": "Indien zij voor anderen uitmeten of afwegen, geven zij minder (dan behoort).",
                            "verse 83:4": "Weten zulke mensen niet dat zij zullen herrijzen",
                            "verse 83:5": "Op een grote Dag,",
                            "verse 83:6": "De Dag, waarop de mensheid voor de Heer der Werelden zal staan?",
                            "verse 83:7": "Neen! Het gedenkschrift over de bozen is in Sidjdjien.",
                            "verse 83:8": "En wat weet gij er van wat Sidjdjien is?",
                            "verse 83:9": "Het is een geschreven boek.",
                            "verse 83:10": "Wee, op die Dag de loochenaars,",
                            "verse 83:11": "Die de Dag des Oordeels loochenen.",
                            "verse 83:12": "En niemand behalve de zondige overtreder loochent die (Dag),",
                            "verse 83:13": "Die zegt, als Onze woorden aan hem worden voorgedragen: \"Fabelen der ouden.",
                            "verse 83:14": "Neen, maar hetgeen zij plachten te verdienen heeft zich als roest aan hun hart gehecht.",
                            "verse 83:15": "Neen, zij zullen die Dag zeker van hun Heer worden uitgesloten.",
                            "verse 83:16": "Voorwaar, dan zullen zij in de hel branden,",
                            "verse 83:17": "En er zal tot hen worden gezegd: \"Dit is hetgeen gij placht te loochenen!\"",
                            "verse 83:18": "Neen, het gedenkschrift der deugdzamen is voorzeker in \"Illijjien.",
                            "verse 83:19": "En wat weet gij er van wat\"Illijjien\" is?",
                            "verse 83:20": "Een geschreven boek.",
                            "verse 83:21": "De nabij (God) zijnden zullen het zien.",
                            "verse 83:22": "Voorwaar, de deugdzamen onder zegeningen,",
                            "verse 83:23": "Op hoge sofa’s zullen zij elkander aanschouwen,",
                            "verse 83:24": "Gij zult in hun gezicht de glans der gelukzaligheid herkennen.",
                            "verse 83:25": "Hun wordt zuivere verzegelde wijn te drinken gegeven.",
                            "verse 83:26": "Welks zegel muskus is.",
                            "verse 83:27": "En hij zal vermengd worden met water van Tasniem;",
                            "verse 83:28": "Een bron waaruit de nabij (God) zijnden drinken.",
                            "verse 83:29": "Waarlijk, de schuldigen plachten de gelovigen uit te lachen,",
                            "verse 83:30": "En wanneer zij hen voorbijgingen, knipoogden zij tegen elkander.",
                            "verse 83:31": "En wanneer zij tot de hunnen terugkeerden, keerden zij opgetogen terug;",
                            "verse 83:32": "En wanneer zij hen zagen, zeiden zij: \"Dit zijn inderdaad de dwalenden.",
                            "verse 83:33": "Maar zij waren niet als bewakers over hen gezonden.",
                            "verse 83:34": "Daarom zullen op deze Dag de gelovigen over de ongelovigen lachen,",
                            "verse 83:35": "Op hoge sofa’s zittende zullen zij aanschouwen;",
                            "verse 83:36": "Voorzeker wordt de ongelovigen vergolden voor hetgeen zij plachten te doen! aanschouwen;"
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 83:1": "Woe unto the defrauders:",
                            "verse 83:2": "Those who when they take the measure from mankind demand it full,",
                            "verse 83:3": "But if they measure unto them or weight for them, they cause them loss.",
                            "verse 83:4": "Do such (men) not consider that they will be raised again",
                            "verse 83:5": "Unto an Awful Day,",
                            "verse 83:6": "The day when (all) mankind stand before the Lord of the Worlds ?",
                            "verse 83:7": "Nay, but the record of the vile is in Sijjin -",
                            "verse 83:8": "Ah! what will convey unto thee what Sijjin is! -",
                            "verse 83:9": "A written record.",
                            "verse 83:10": "Woe unto the repudiators on that day!",
                            "verse 83:11": "Those who deny the Day of Judgment",
                            "verse 83:12": "Which none denieth save each criminal transgressor,",
                            "verse 83:13": "Who, when thou readest unto him Our revelations, saith: (Mere) fables of the men of old.",
                            "verse 83:14": "Nay, but that which they have earned is rust upon their hearts.",
                            "verse 83:15": "Nay, but surely on that day they will be covered from (the mercy of) their Lord.",
                            "verse 83:16": "Then lo! they verily will burn in hell,",
                            "verse 83:17": "And it will be said (unto them): This is that which ye used to deny.",
                            "verse 83:18": "Nay, but the record of the righteous is in ’Illiyin -",
                            "verse 83:19": "Ah, what will convey unto thee what ’Illiyin is! -",
                            "verse 83:20": "A written record,",
                            "verse 83:21": "Attested by those who are brought near (unto their Lord).",
                            "verse 83:22": "Lo! the righteous verily are in delight,",
                            "verse 83:23": "On couches, gazing,",
                            "verse 83:24": "Thou wilt know in their faces the radiance of delight.",
                            "verse 83:25": "They are given to drink of a pure wine, sealed,",
                            "verse 83:26": "Whose seal is musk - for this let (all) those strive who strive for bliss -",
                            "verse 83:27": "And mixed with water of Tasnim,",
                            "verse 83:28": "A spring whence those brought near (to Allah) drink.",
                            "verse 83:29": "Lo! the guilty used to laugh at those who believed,",
                            "verse 83:30": "And wink one to another when they passed them;",
                            "verse 83:31": "And when they returned to their own folk, they returned jesting;",
                            "verse 83:32": "And when they saw them they said: Lo! these have gone astray.",
                            "verse 83:33": "Yet they were not sent as guardians over them.",
                            "verse 83:34": "This day it is those who believe who have the laugh of disbelievers,",
                            "verse 83:35": "On high couches, gazing.",
                            "verse 83:36": "Are not the disbelievers paid for what they used to do ? gazing."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 83:1": "Woe to those that deal in fraud,-",
                            "verse 83:2": "Those who, when they have to receive by measure from men, exact full measure,",
                            "verse 83:3": "But when they have to give by measure or weight to men, give less than due.",
                            "verse 83:4": "Do they not think that they will be called to account?-",
                            "verse 83:5": "On a Mighty Day,",
                            "verse 83:6": "A Day when (all) mankind will stand before the Lord of the Worlds?",
                            "verse 83:7": "Day! Surely the record of the wicked is (preserved) in Sijjin.",
                            "verse 83:8": "And what will explain to thee what Sijjin is?",
                            "verse 83:9": "(There is) a Register (fully) inscribed.",
                            "verse 83:10": "Woe, that Day, to those that deny-",
                            "verse 83:11": "Those that deny the Day of Judgment.",
                            "verse 83:12": "And none can deny it but the Transgressor beyond bounds the Sinner!",
                            "verse 83:13": "When Our Signs are rehearsed to him, he says, \"Tales of the ancients!\"",
                            "verse 83:14": "By no means! but on their hearts is the stain of the (ill) which they do!",
                            "verse 83:15": "Verily, from (the Light of) their Lord, that Day, will they be veiled.",
                            "verse 83:16": "Further, they will enter the Fire of Hell.",
                            "verse 83:17": "Further, it will be said to them: \"This is the (reality) which ye rejected as false!",
                            "verse 83:18": "Day, verily the record of the Righteous is (preserved) in ’Illiyin.",
                            "verse 83:19": "And what will explain to thee what ’Illiyun is?",
                            "verse 83:20": "(There is) a Register (fully) inscribed,",
                            "verse 83:21": "To which bear witness those Nearest (to God).",
                            "verse 83:22": "Truly the Righteous will be in Bliss:",
                            "verse 83:23": "On Thrones (of Dignity) will they command a sight (of all things):",
                            "verse 83:24": "Thou wilt recognise in their faces the beaming brightness of Bliss.",
                            "verse 83:25": "Their thirst will be slaked with Pure Wine sealed:",
                            "verse 83:26": "The seal thereof will be Musk: And for this let those aspire, who have aspirations:",
                            "verse 83:27": "With it will be (given) a mixture of Tasnim:",
                            "verse 83:28": "A spring, from (the waters) whereof drink those Nearest to God.",
                            "verse 83:29": "Those in sin used to laugh at those who believed,",
                            "verse 83:30": "And whenever they passed by them, used to wink at each other (in mockery);",
                            "verse 83:31": "And when they returned to their own people, they would return jesting;",
                            "verse 83:32": "And whenever they saw them, they would say, \"Behold! These are the people truly astray!\"",
                            "verse 83:33": "But they had not been sent as keepers over them!",
                            "verse 83:34": "But on this Day the Believers will laugh at the Unbelievers:",
                            "verse 83:35": "On Thrones (of Dignity) they will command (a sight) (of all things).",
                            "verse 83:36": "Will not the Unbelievers have been paid back for what they did?"
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 83:1": "Woe to the stinters who,",
                            "verse 83:2": "when they measure against the people, take full measure",
                            "verse 83:3": "but, when they measure for them or weigh for them, do skimp.",
                            "verse 83:4": "Do those not think that they shall be raised up",
                            "verse 83:5": "unto a mighty day",
                            "verse 83:6": "a day when mankind shall stand before the Lord of all Being?",
                            "verse 83:7": "No indeed; the Book of the libertines is in Sijjin;",
                            "verse 83:8": "and what shall teach thee what is Sijjin?",
                            "verse 83:9": "A book inscribed.",
                            "verse 83:10": "Woe that day unto those who cry it lies,",
                            "verse 83:11": "who cry lies to the Day of Doom;",
                            "verse 83:12": "and none cries lies to it but every guilty aggressor.",
                            "verse 83:13": "When our signs are recited to him, he says, ’Fairy-tales of the ancients!’",
                            "verse 83:14": "No indeed; but that they were earning has rusted upon their hearts.",
                            "verse 83:15": "No indeed; but upon that day they shall be veiled from their Lord,",
                            "verse 83:16": "then they shall roast in Hell.",
                            "verse 83:17": "Then it shall be said to them, ’This is that you cried lies to.",
                            "verse 83:18": "No indeed; the book of the pious is in Illiyun;",
                            "verse 83:19": "and what shall teach thee what is Illiyun?",
                            "verse 83:20": "A book inscribed,",
                            "verse 83:21": "witnessed by those brought nigh.",
                            "verse 83:22": "Surely the pious shall be in bliss,",
                            "verse 83:23": "upon couches gazing;",
                            "verse 83:24": "thou knowest in their faces the radiancy of bliss",
                            "verse 83:25": "as they are given to drink of a wine sealed",
                            "verse 83:26": "whose seal is musk -- so after that let the strivers strive --",
                            "verse 83:27": "and whose mixture is Tasnim,",
                            "verse 83:28": "a fountain at which do drink those brought nigh.",
                            "verse 83:29": "Behold, the sinners were laughing at the believers,",
                            "verse 83:30": "when them passed them by winking at one another,",
                            "verse 83:31": "and when they returned to their people they returned blithely,",
                            "verse 83:32": "and when they saw them they said, ’Lo, these men are astray!’",
                            "verse 83:33": "Yet they were not sent as watchers over them.",
                            "verse 83:34": "So today the believers are laughing at the unbelievers,",
                            "verse 83:35": "upon couches gazing.",
                            "verse 83:36": "Have the unbelievers been rewarded what they were doing? gazing."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 83:1": "WOE UNTO THOSE who give short measure:",
                            "verse 83:2": "those who, when they are to receive their due from",
                            "verse 83:3": "people, demand that it be given in full –",
                            "verse 83:4": "but when they have to measure or weigh whatever they owe to others, give less than what is due!",
                            "verse 83:5": "Do they not know that they are bound to be raised from the dead",
                            "verse 83:6": "[and called to account] on an awesome Day –",
                            "verse 83:7": "the Day when all men shall stand before the Sustainer of all the worlds?",
                            "verse 83:8": "NAY, VERILY, the record of the wicked is indeed [set down] in a mode inescapable!",
                            "verse 83:9": "And what could make thee conceive what that mode inescapable will be?",
                            "verse 83:10": "A record",
                            "verse 83:11": "inscribed!",
                            "verse 83:12": "Woe on that Day unto those who give the lie to the truth –",
                            "verse 83:13": "those who give the lie to the [coming of] Judgment Day:",
                            "verse 83:14": "for none gives the lie to it but such as are wont to transgress against all that is right [and are] immersed in sin:",
                            "verse 83:15": "[and so,] whenever Our messages are conveyed to them, they but say, \"Fables of ancient times!\"",
                            "verse 83:16": "Nay, but their hearts are corroded by all [the evil] that they were wont to do!",
                            "verse 83:17": "Nay, verily, from [the grace of] their Sustainer shall they on that Day be debarred;",
                            "verse 83:18": "and then, behold, they shall enter the blazing fire",
                            "verse 83:19": "and be told: \"This is the [very thing] to which you were wont to give the lie!\"",
                            "verse 83:20": "NAY, VERILY, the record of the truly virtuous is [set down] in a mode most lofty!",
                            "verse 83:21": "And what could make thee conceive what that mode most lofty will be?",
                            "verse 83:22": "A record",
                            "verse 83:23": "inscribed,",
                            "verse 83:24": "witnessed by all who have",
                            "verse 83:25": "been drawn close unto God.",
                            "verse 83:26": "Behold, [in the life to come] the truly virtuous will indeed be in bliss:",
                            "verse 83:27": "",
                            "verse 83:28": "on couches, they will look up [to God]:",
                            "verse 83:29": "upon their faces thou wilt see the brightness of bliss.",
                            "verse 83:30": "They will be given a drink of pure wine whereon the seal [of God] will have been set,",
                            "verse 83:31": "pouring forth with a fragrance of musk.",
                            "verse 83:32": "for it is composed of all that is most exalting –",
                            "verse 83:33": "a source [of bliss] whereof those who are drawn close unto God shall drink.",
                            "verse 83:34": "BEHOLD, those who have abandoned themselves to sin are wont to laugh at such as have attained to faith;",
                            "verse 83:35": "and whenever they pass by them, they wink at one another ;",
                            "verse 83:36": "and whenever they return to people of their own kind, they return full of jests;",
                            "verse 83:37": "and whenever they see those [who believe,] they say, \"Behold, these",
                            "verse 83:38": "have indeed gone astray!\"",
                            "verse 83:39": "And, withal, they have no call to watch over [the beliefs of] others.",
                            "verse 83:40": "But on the Day [of Judgment], they who had attained to faith will [be able to] laugh at the",
                            "verse 83:41": "deniers of the truth:",
                            "verse 83:42": "[for, resting in paradise] on couches, they will look on [and say to themselves]:",
                            "verse 83:43": "\"Are these deniers of the truth being",
                            "verse 83:44": "requited for [aught but] what they were wont to do?\"",
                            "verse 83:45": "was [or “became”] high” or “lofty” or – tropically – “exalted”: thus in the well-known idiomatic phrase, huwa min ‘illiyyat qawmihi, “he is among the",
                            "verse 83:46": "exalted of his people.",
                            "verse 83:47": "or “made",
                            "verse 83:48": "lofty” – points, rather, to the effect which the “wine” of divine knowledge will have on those who “drink” of it in paradise.",
                            "verse 83:49": "people.",
                            "verse 83:50": "in their bosoms” (7:43 and 15:47)."
                        }
                    },
                    "5": {
                        "Martin Lings": {
                            "verse 83:1": "…the iniquitious.",
                            "verse 83:2": "When Our Revelations are recited unto him, he saith: Tales of the men of old.",
                            "verse 83:3": "Nay, but their earnings are even as rust over their hearts.",
                            "verse 83:4": "…the righteous.",
                            "verse 83:5": "…those brought near to God.",
                            "verse 83:6": "They are given to drink of a pure wine sealed.",
                            "verse 83:7": "Whose seal is musk – for this let the strivers strive.",
                            "verse 83:8": "And its flavour cometh from Tasnim.",
                            "verse 83:9": "A fountain whence drink they that are brought nigh.",
                            "verse 83:10": "Used• Unpublished Material (1938-2005) BOOKS•",
                            "verse 83:11": "The Book of Certainty (1952) •",
                            "verse 83:12": "A Sufi Saint of the Twentieth Century (1961) •",
                            "verse 83:13": "What is Sufism (1975) •",
                            "verse 83:14": "The Quranic Art of Calligraphy and Illumination (1976) •",
                            "verse 83:15": "Muhammad (1983) •",
                            "verse 83:16": "Symbol and Archetype (1991) •",
                            "verse 83:17": "Sufi Poems (2004) •",
                            "verse 83:18": "Mecca (2004) •",
                            "verse 83:19": "Return to the Spirit (2005) •",
                            "verse 83:20": "Splendours of Qur’an Calligraphy and Illumination (2005) ARTICLES•",
                            "verse 83:21": "“Proofs of Islam”(1954).",
                            "verse 83:22": "“The Islamic and Christian Conceptions of the March of Time” (1954) The Islamic Quarterly, Vol.",
                            "verse 83:23": "“The Origins of Sufism (1956) The Islamic Quarterly, Vol.",
                            "verse 83:24": "“Sufism”: Religion in the Middle East (1969); ed.",
                            "verse 83:25": "“Sufi Answers to Questions On Ultimate Reality”: Studies in Comparative Religions 1979 Summer/Autumn •",
                            "verse 83:26": "“The Nature and Origin of Sufism”: Islamic Spirituality (1985) •",
                            "verse 83:27": "“Mystical Poetry”: The Cambridge History of Arabic Literature, Vol.",
                            "verse 83:28": "“The Quranic Doctrine of the Afterlife” •",
                            "verse 83:29": "“The Quranic Origins of Sufism” •",
                            "verse 83:30": "“Human Origins and Destinies According to the Great Religions of the World” •",
                            "verse 83:31": "“Metaphysics and the Perennial Philosophy” •",
                            "verse 83:32": "“An Introduction to Islam” •",
                            "verse 83:33": "“The Universality of the Quran” •",
                            "verse 83:34": "Private Talks Books",
                            "verse 83:35": "without Quranic Ayaat• Collected Poems• Ancient Beliefs and Modern Superstitions• The Eleventh Hour• The Secret of ShakespeareArticles without Quranic Ayaat• “Signs of the Times”: Studies in Comparative Religions 1970 Winter• “Ibn Aliwah” Encyclopedia of Islam, Second Edition• “Kabd” Encyclopedia of Islam, Second Edition Books"
                        }
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 83:1": "Woe to the curtailers",
                            "verse 83:2": "who, when they measure something to receive from people, take it in full,",
                            "verse 83:3": "and when they measure or weigh something to give it to them, give less than due.",
                            "verse 83:4": "Do they not think that they have to be raised up",
                            "verse 83:5": "on a Great Day,",
                            "verse 83:6": "the Day when all the people will stand before the Lord of the worlds?",
                            "verse 83:7": "Never! (i.",
                            "verse 83:8": "And what may let you know what Sijjīn is?",
                            "verse 83:9": "A register, inscribed!",
                            "verse 83:10": "Woe that day to the deniers,",
                            "verse 83:11": "who deny the Day of Requital!",
                            "verse 83:12": "And none denies it but every sinful transgressor.",
                            "verse 83:13": "When Our verses are recited to him, he says, “(These are) tales of the ancients.",
                            "verse 83:14": "No! But that which they used to commit has covered their hearts with rust.",
                            "verse 83:15": "No! Indeed they will be screened off from their Lord on that Day.",
                            "verse 83:16": "Then they will have to enter the Hell.",
                            "verse 83:17": "Then it will be said, “This is what you used to deny.",
                            "verse 83:18": "No! The record of deeds of the righteous is in ‘Illiyyūn .",
                            "verse 83:19": "And what may let you know what ‘Illiyyūn is ?",
                            "verse 83:20": "A register inscribed,",
                            "verse 83:21": "attended by those (angels) who are blessed with nearness to Allah!",
                            "verse 83:22": "Indeed the righteous will be in absolute bliss.",
                            "verse 83:23": "While (sitting) on thrones they will be watching (the scenes of Paradise).",
                            "verse 83:24": "You will recognize the glamour of bliss on their faces.",
                            "verse 83:25": "They will be served with a pure sealed wine to drink,",
                            "verse 83:26": "the seal of which will be of musk.",
                            "verse 83:27": "-and it will be blended with (a drink from) Tasnīm ,",
                            "verse 83:28": "a spring from which will drink those who are blessed with nearness.",
                            "verse 83:29": "Indeed those who were guilty used to laugh at those who believed,",
                            "verse 83:30": "and when they passed by them, they used to wink at one another,",
                            "verse 83:31": "and when they went back to their family, they went enjoying their mockery,",
                            "verse 83:32": "and when they saw them, they said, “Surely these are the ones who have gone astray”",
                            "verse 83:33": "while they were not sent as watchmen over them.",
                            "verse 83:34": "So, today those who believed will laugh at the disbelievers.",
                            "verse 83:35": "While (sitting) on thrones, they will be seeing",
                            "verse 83:36": "whether the disbelievers have been paid back for what they used to do."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 83:1": "Woe to the defrauders:",
                            "verse 83:2": "those who, when they take measure from people, demand",
                            "verse 83:3": "in full;",
                            "verse 83:4": "but",
                            "verse 83:5": "when they measure for them or weigh for them, they cause",
                            "verse 83:6": "loss.",
                            "verse 83:7": "Do such",
                            "verse 83:8": "not know for certain that they will be resurrected",
                            "verse 83:9": "for an awful day,",
                            "verse 83:10": "a day when mankind will rise before the Lord of the Worlds?",
                            "verse 83:11": "Nay! The record of the profligates is in Sijjīn.",
                            "verse 83:12": "And what would tell you what Sijjīn is?",
                            "verse 83:13": "[It is] a sealed book.",
                            "verse 83:14": "Woe to the deniers on that day,",
                            "verse 83:15": "who deny the Day of Judgement;",
                            "verse 83:16": "and none deny it but every sinful transgressor.",
                            "verse 83:17": "When Our signs are recited to him, he says, ‘",
                            "verse 83:18": "fables of the ancients!’",
                            "verse 83:19": "No indeed! Rather there has slayed their hearts that which they earned.",
                            "verse 83:20": "Nay! They, on that day will be screened off from their Lord.",
                            "verse 83:21": "Then they will be exposed to Hell-fire,",
                            "verse 83:22": "then it will be said: ‘This is that which you used to deny!’",
                            "verse 83:23": "Nay! The record of the pious is in ‘Illiyyūn;",
                            "verse 83:24": "and what will tell you, what ‘Illiyyūn is?,",
                            "verse 83:25": "[It is] a sealed book,",
                            "verse 83:26": "witnessed by those brought near.",
                            "verse 83:27": "Assuredly the pious will be amid bliss,",
                            "verse 83:28": "upon couches, gazing.",
                            "verse 83:29": "You will perceive in their faces the radiancy of bliss,",
                            "verse 83:30": "as they are given to drink a nectar [that is] sealed,",
                            "verse 83:31": "whose seal is musk — so for such",
                            "verse 83:32": "let the viers vie —",
                            "verse 83:33": "and whose mixture is of Tasnīm:",
                            "verse 83:34": "a spring from which those brought near will drink.",
                            "verse 83:35": "Verily the guilty used to laugh at the believers;",
                            "verse 83:36": "and when they passed them by, they would wink at one another;",
                            "verse 83:37": "and when they returned to their folks they would return blithely;",
                            "verse 83:38": "and when they see them, they say, ‘Lo! these",
                            "verse 83:39": "are astray!’",
                            "verse 83:40": "Yet they were not sent as watchers over them.",
                            "verse 83:41": "So today the believers will be laughing at the disbelievers,",
                            "verse 83:42": "upon couches, gazing.",
                            "verse 83:43": "Have the disbelievers been requited for what they used to do? gazing."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 83:1": "Woe to those who give less in measure or weight!",
                            "verse 83:2": "When (they) take by measure from others, they take (from them) full.",
                            "verse 83:3": "And when they (themselves) give by measure or weigh to others, they give them less.",
                            "verse 83:4": "Do they not believe that they will be raised up (again after death),",
                            "verse 83:5": "For a Terrible Day,",
                            "verse 83:6": "The Day when all mankind will stand before the Lord of all the worlds?",
                            "verse 83:7": "It is true that the record of the evildoers is kept in Sijjin (the ante-chamber of Hell).",
                            "verse 83:8": "And what do you know what Sijjin is?",
                            "verse 83:9": "It is an inscribed book (set down in the large ante-chamber of the prison of Hell, with the names and evil deeds of every inmate of Hell registered in it).",
                            "verse 83:10": "Woe to the deniers on that Day,",
                            "verse 83:11": "Those who deny the Day of Recompense!",
                            "verse 83:12": "And no one else denies it except every defiant and sinner.",
                            "verse 83:13": "When Our Revelations are read out to him, he says (or thinks) that (they are) tales of the ancients.",
                            "verse 83:14": "That is not at all (the case); rather (the fact is that the evil deeds) which they earned have rusted their hearts.",
                            "verse 83:15": "The truth is that they will be screened off (to deprive them of) the sight of their Lord.",
                            "verse 83:16": "Then they will be cast into Hell.",
                            "verse 83:17": "Then it will be said to them: ‘This is (the punishment of Hell) which you used to belie.",
                            "verse 83:18": "This is (also) true that the record of the truly pious is for sure maintained in ‘Illiyyin (the ante-chamber of Paradise).",
                            "verse 83:19": "And what do you know what ‘Illiyyin is?",
                            "verse 83:20": "It is an inscribed book (set down in the large ante-chamber of a lofty mansion of Paradise with the names and pious deeds of those who will be allocated superior stations in Paradise).",
                            "verse 83:21": "The angels closest (to Allah) remain present here.",
                            "verse 83:22": "Indeed, the truly pious, (joyful and glad,) will be in blissful Paradise,",
                            "verse 83:23": "Reclining on couches, enjoying the wonderful sights.",
                            "verse 83:24": "You will find on their faces the glow and freshness of bliss and delight.",
                            "verse 83:25": "They shall be served with securely sealed delicious and holy beverage.",
                            "verse 83:26": "Its seal will be musk.",
                            "verse 83:27": "And this (beverage of Paradise) will be mixed with the water of Tasnim.",
                            "verse 83:28": "(This Tasnim) is a fountain at which only those drawn close will drink.",
                            "verse 83:29": "Surely (in the worldly life), the evildoers used to ridicule the believers,",
                            "verse 83:30": "And winked at one another when they passed by them.",
                            "verse 83:31": "And when they went back to their families, they used to exult over the believers (by comparing the believers’ destitution and their own affluence) and returned speaking of them with jests.",
                            "verse 83:32": "And when they (the arrogant people) saw these (the indigent believers), they used to say: ‘They have gone astray,’ (i.",
                            "verse 83:33": "Yet they had not been sent to watch over their (state of affairs).",
                            "verse 83:34": "So (see) Today the believers are laughing at the disbelievers.",
                            "verse 83:35": "Reclining on ornamented couches, they are viewing the sight (comparing their own prosperity and the disbelievers’ impoverishment).",
                            "verse 83:36": "So, have the disbelievers been rewarded in full for (the mockery), which they used to inflict upon (the believers)? impoverishment)."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Voi väärintekijöitä mitattaessa tai punnittaessa",
                            "verse 83:2": "jotka vaativat täyden mitan, kun mittaavat toisilta omaksi hyväkseen,",
                            "verse 83:3": "mutta antavat vajaan mitan, kun mittaavat tai punnitsevat muille!",
                            "verse 83:4": "Eivätkö nämä ihmiset usko, että heidät herätetään kuolleista",
                            "verse 83:5": "kohtalokkaana päivänä,",
                            "verse 83:6": "päivänä, jona ihmisten on seistävä maailmojen Herran edessä?",
                            "verse 83:7": "Ei! Totisesti on jumalattomien nimiluettelo Sidzinissä.",
                            "verse 83:8": "Mutta tiedätkö, mikä Sidzin on?",
                            "verse 83:9": "Se on selkeästi kirjoitettu kirja.",
                            "verse 83:10": "Voi sinä päivänä niitä, jotka hylkivät totuutta,",
                            "verse 83:11": "niitä, jotka pitävät valheena Tuomion päivää!",
                            "verse 83:12": "Mutta valheena sitä pitää vain julkea syntinen,",
                            "verse 83:13": "joka sanoo, kun ilmoituksemme julistetaan hänelle: »Vanhojen taruja.",
                            "verse 83:14": "Totisesti ei! Heidän tekonsa ovat kuin ruoste tärvelleet heidän sydämensä.",
                            "verse 83:15": "Totisesti ei heitä päästetä Herransa luokse sinä päivänä,",
                            "verse 83:16": "vaan he saavat astua helvetin ahjoon.",
                            "verse 83:17": "Silloin sanotaan: »Tämä on se, jota te olemattomaksi väititte.",
                            "verse 83:18": "Mutta hurskaitten nimiluettelo on Illijunissa.",
                            "verse 83:19": "Tiedätkö, mikä Illijun on?",
                            "verse 83:20": "Kirjoitettu kirja korkeuksissa.",
                            "verse 83:21": "Jumalan valiojoukko sen todistaa.",
                            "verse 83:22": "Totisesti saavat hurskaat elää autuudessa,",
                            "verse 83:23": "katsellen ympärilleen lepokorokkeiltaan.",
                            "verse 83:24": "Sinä olet näkevä autuuden kirkkauden heidän kasvoillaan.",
                            "verse 83:25": "He saavat nauttia puhdasta, muilta sinetöityä juomaa,",
                            "verse 83:26": "jonka sinetti on myskiä - tätä juomaa kaikki kaivaten kaivatkoot -",
                            "verse 83:27": "tämä sekoitus tulee ylhäältä,",
                            "verse 83:28": "lähteestä, josta Jumalaa lähelle pääsevät juovat.",
                            "verse 83:29": "Totisesti syntiset nauroivat uskovaisia,",
                            "verse 83:30": "kun he kulkivat näiden ohi, iskivät he toisilleen silmää;",
                            "verse 83:31": "palatessaan omiensa luo he olivat tyytyväisiä",
                            "verse 83:32": "ja heidät nähdessään he sanoivat: »Totisesti nuo ovat harhateillä.",
                            "verse 83:33": "Mutta totisesti emme Me lähettänyt tuommoisia heidän kaitsijoikseen,",
                            "verse 83:34": "ja sinä päivänä saavat ne, jotka uskoivat, nauraa epäuskoisille",
                            "verse 83:35": "ja katsella ylhäisiltä lepokorokkeilta ympärilleen.",
                            "verse 83:36": "Mutta epäuskoiset saavat totisesti tekojensa palkan."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 83:1": "Malheur aux fraudeurs !",
                            "verse 83:2": "Ceux qui, lorsqu'ils se font servir par d'autres, exigent une pleine mesure,",
                            "verse 83:3": "et lorsqu'ils mesurent ou pèsent pour d'autres, leur causent une perte.",
                            "verse 83:4": "Ces gens ne pensent-ils pas qu'ils seront ressuscités",
                            "verse 83:5": "en un Jour terrible,",
                            "verse 83:6": "le Jour où les hommes se tiendront debout devant le Seigneur des mondes ?",
                            "verse 83:7": "Que non ! Certes, le Livre des libertins est dans Sijjîn ;",
                            "verse 83:8": "mais qu'est-ce qui te fera connaître ce qu'est Sijjîn ?",
                            "verse 83:9": "C'est un registre tenu avec soin.",
                            "verse 83:10": "Malheur, ce jour-là, à ceux qui crient au mensonge,",
                            "verse 83:11": "ceux qui traitent de mensonge le Jour du Jugement :",
                            "verse 83:12": "seul un transgresseur, un pécheur invétéré le traite de mensonge !",
                            "verse 83:13": "Quand on lui récite Nos versets, il s'écrie : \" Fables d'anciens ! \"",
                            "verse 83:14": "Que non ! Mais leurs cœurs ont été endurcis par leurs propres œuvres.",
                            "verse 83:15": "Que non ! Ils seront, ce Jour-là, séparés de leur Seigneur par un voile,",
                            "verse 83:16": "puis ils brûleront dans la Fournaise.",
                            "verse 83:17": "On leur dira alors : \" C'est là ce que vous traitiez de mensonge ! \"",
                            "verse 83:18": "Que non ! Certes, le Livre des justes est dans Illiyoun ;",
                            "verse 83:19": "mais qu'est-ce qui te fera connaître ce qu'est Illiyoun ?",
                            "verse 83:20": "C'est un registre tenu avec soin.",
                            "verse 83:21": "Ceux qui sont proches de Dieu le contemplent.",
                            "verse 83:22": "Certes, les justes sont placés dans un lieu de délice ;",
                            "verse 83:23": "étendus sur des lits d'apparat, ils regardent.",
                            "verse 83:24": "Tu reconnais sur leurs visages l'éclat de la béatitude.",
                            "verse 83:25": "On leur sert à boire un nectar scellé",
                            "verse 83:26": "par un cachet de musc.",
                            "verse 83:27": "Il est mélangé à l'eau de Tasnîm,",
                            "verse 83:28": "une fontaine où s'abreuvent ceux qui sont proches de Dieu.",
                            "verse 83:29": "De vrai, les criminels riaient de ceux qui croient ;",
                            "verse 83:30": "lorsqu'ils passaient près d'eux, ils échangeaient des clins d'œil,",
                            "verse 83:31": "et ils rentraient dans leur famille en plaisantant.",
                            "verse 83:32": "Ils disaient en les regardant : \" Ce sont là des égarés ! \"",
                            "verse 83:33": "Pourtant, on ne les a pas envoyés pour être leurs gardiens.",
                            "verse 83:34": "Mais aujourd'hui ce sont les croyants qui rient des mécréants :",
                            "verse 83:35": "couchés sur des lits d'apparat, ils regardent.",
                            "verse 83:36": "Les mécréants ont-ils été rétribués pour leurs actions ?"
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 83:1": "Malheur aux fraudeurs",
                            "verse 83:2": "qui, lorsqu’ils font mesurer pour eux-mêmes exigent la pleine mesure,",
                            "verse 83:3": "et qui lorsqu’eux-mêmes mesurent ou pèsent pour les autres,",
                            "verse 83:4": "causent perte.",
                            "verse 83:5": "Ceux-là ne pensent-ils pas qu’ils seront ressuscités,",
                            "verse 83:6": "en un jour terrible,",
                            "verse 83:7": "le jour où les gens se tiendront debout devant le Seigneur de l’Univers ?",
                            "verse 83:8": "Non.",
                            "verse 83:9": "et qui te dira ce qu’est le Sijjin ? -",
                            "verse 83:10": "un livre déjà cacheté (achevé).",
                            "verse 83:11": "Malheur, ce jour-là, aux négateurs,",
                            "verse 83:12": "qui démentent le jour de la Rétribution.",
                            "verse 83:13": "Or, ne le dément que tout transgresseur, pécheur :",
                            "verse 83:14": "qui, lorsque Nos versets lui sont récités, dit : «[Ce sont] des contes d’anciens ! »",
                            "verse 83:15": "Pas du tout, mais ce qu’ils ont accompli couvre leurs coeurs .",
                            "verse 83:16": "Qu’ils prennent garde ! En vérité ce jour-là un voile les empêchera de voir leur Seigneur,",
                            "verse 83:17": "ensuite, ils brûleront certes, dans la Fournaise;",
                            "verse 83:18": "",
                            "verse 83:19": "dira alors : «Voilà ce que vous traitiez de mensonge ! »",
                            "verse 83:20": "Qu’ils prennent garde ! Le livre des bons sera dans l’Illiyoun -",
                            "verse 83:21": "et qui te dira ce qu’est l’Illiyoun ? -",
                            "verse 83:22": "un livre cacheté !",
                            "verse 83:23": "Les rapprochés (de Dieu : les Anges) en témoignent.",
                            "verse 83:24": "Les bons seront dans [un jardin] de délice,",
                            "verse 83:25": "sur les divans, ils regardent.",
                            "verse 83:26": "Tu reconnaîtras sur leurs visages, l’éclat de la félicité.",
                            "verse 83:27": "On leur sert à boire un nectar pur, cacheté,",
                            "verse 83:28": "laissant un arrière-goût de musc.",
                            "verse 83:29": "Il est mélangé à la boisson de Tasnim ,",
                            "verse 83:30": "source dont les rapprochés boivent.",
                            "verse 83:31": "Les criminels riaient de ceux qui croyaient,",
                            "verse 83:32": "et, passant près d’eux, ils se faisaient des oeillades,",
                            "verse 83:33": "et, retournant dans leurs familles, ils retournaient en plaisantant,",
                            "verse 83:34": "et les voyant, ils disaient : «Ce sont vraiment ceux-là les égarés».",
                            "verse 83:35": "Or, ils n’ont pas été envoyés pour être leurs gardiens.",
                            "verse 83:36": "Aujourd’hui, donc, ce sont ceux qui ont cru qui rient des infidèles",
                            "verse 83:37": "sur les divans, ils regardent.",
                            "verse 83:38": "Est-ce que les infidèles ont eu la récompense de ce qu’ils faisaient ? regardent."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Wehe den kurzes Maß Gebenden!",
                            "verse 83:2": "Die, wenn sie sich von den Leuten zumessen lassen, volles Maß verlangen;",
                            "verse 83:3": "Wenn sie ihnen jedoch ausmessen oder auswägen, dann verkürzen sie es.",
                            "verse 83:4": "Wissen solche nicht, daß sie auferweckt werden sollen",
                            "verse 83:5": "Zu einem Großen Tag,",
                            "verse 83:6": "Dem Tag, da die Menschheit vor dem Herrn der Welten stehen wird?",
                            "verse 83:7": "Nein! das (Sünden-)Verzeichnis der Frevler ist in Sidschín.",
                            "verse 83:8": "Und was lehrt dich wissen, was Sidschín ist? -",
                            "verse 83:9": "Ein geschriebenes Buch.",
                            "verse 83:10": "Wehe an jenem Tage den Leugnern!",
                            "verse 83:11": "Die den Tag des Gerichts leugnen.",
                            "verse 83:12": "Und es leugnet ihn keiner als ein jeder sündhafter Übertreter,",
                            "verse 83:13": "(Der) wenn ihm Unsere Zeichen vorgetragen werden, spricht: «Fabeln der Alten!»",
                            "verse 83:14": "Nein, jedoch das, was sie zu wirken pflegten, hat auf ihre Hetzen Rost gelegt.",
                            "verse 83:15": "Nein, sie werden an jenem Tage gewiß von ihrem Herrn getrennt sein.",
                            "verse 83:16": "Dann werden sie fürwahr in die Hölle eingehen.",
                            "verse 83:17": "Und es wird gesprochen werden: «Dies ist's, was ihr zu leugnen pflegtet!»",
                            "verse 83:18": "Nein! das Verzeichnis der Rechtschaffenen ist gewißlich in Ìllijun.",
                            "verse 83:19": "Und was lehrt dich wissen, was Ìllijun ist?",
                            "verse 83:20": "Ein geschriebenes Buch.",
                            "verse 83:21": "Die Erwählten (Gottes) werden es schauen.",
                            "verse 83:22": "Wahrlich, die Tugendhaften werden in Wonne sein.",
                            "verse 83:23": "Auf hohen Pfühlen werden sie zuschauen.",
                            "verse 83:24": "Erkennen wirst du auf ihren Gesichtern den Glanz der Seligkeit.",
                            "verse 83:25": "Ihnen wird gegeben ein reiner, versiegelter Trank,",
                            "verse 83:26": "Dessen Siegel Moschus ist - und dies mögen die Begehrenden erstreben -,",
                            "verse 83:27": "Und es wird ihm Tasním beigemischt sein:",
                            "verse 83:28": "Ein Quell, aus dem die Erwählten trinken werden.",
                            "verse 83:29": "Die Sünder pflegten über die zu lachen, die glaubten;",
                            "verse 83:30": "Und wenn sie an ihnen vorübergingen, blinzelten sie einander zu;",
                            "verse 83:31": "Und wenn sie zu den Ihren zurückkehrten, kehrten sie frohlockend zurück;",
                            "verse 83:32": "Und wenn sie sie sahen, sprachen sie; «Das sind fürwahr die Irregegangenen!»",
                            "verse 83:33": "Aber sie sind nicht als Wächter über sie gesandt.",
                            "verse 83:34": "Heute drum sind es die Gläubigen, die über die Ungläubigen lachen werden.",
                            "verse 83:35": "Auf hohen Pfühlen werden sie zuschauen.",
                            "verse 83:36": "Wird den Ungläubigen nicht vergolten, was sie zu tun pflegten? zuschauen."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "uki rkSy esa deh djus okyksa dh [+kjkch gS",
                            "verse 83:2": "tks vkSjsa ls uki dj ysa rks iwjk iwjk ysa",
                            "verse 83:3": "vkSj tc mudh uki ;k rkSy dj nsa rks de dj nsa",
                            "verse 83:4": "D;k ;s yksx bruk Hkh [+;ky ugha djrs",
                            "verse 83:5": "fd ,d cM+s ¼l[+r½ fnu ¼d+;ker½ esa mBk, tk,¡xs",
                            "verse 83:6": "ftl fnu reke yksx lkjs tgk¡u ds ijojfnxkj ds lkeus [kM+s gksaxs",
                            "verse 83:7": "lqu j[kks fd cndkjksa ds uke , veky flTthu esa gSa",
                            "verse 83:8": "rqedks D;k ekywe flTthu D;k pht+ gS",
                            "verse 83:9": ",d fy[kk gqvk nQ+rj gS ftlesa Ó;krhu ds ¼vkeky ntZ gSa½",
                            "verse 83:10": "ml fnu >qBykus okyksa dh [+kjkch gS",
                            "verse 83:11": "tks yksx jksts+ tt+k dks >qBykrs gSa",
                            "verse 83:12": "gkykWfd mldks gn ls fudy tkus okys xqukgxkj ds flok dksbZ ugha >qBykrk",
                            "verse 83:13": "tc mlds lkeus gekjh vk;rsa i<+h tkrh gSa rks dgrk gS fd ;s rks vxyksa ds vQlkus gSa",
                            "verse 83:14": "ugha ugha ckr ;s gS fd ;s yksx tks vkeky ¼cn½ djrs gSa mudk muds fnyksa ij tax cSB x;k gS",
                            "verse 83:15": "cs’kd ;s yksx ml fnu vius ijojfnxkj ¼dh jger ls½ jksd fn, tk,¡xs",
                            "verse 83:16": "fQj ;s yksx t+:j tgUuqe okfly gksaxs",
                            "verse 83:17": "fQj muls dgk tk,xk fd ;s ogh pht+ rks gS ftls rqe >qByk;k djrs Fks",
                            "verse 83:18": ";s Hkh lqu j[kks fd usdks ds uke , veky bYyh;hu esa gksaxs",
                            "verse 83:19": "vkSj rqedks D;k ekywe fd bYyh;hu D;k gS og ,d fy[kk gqvk nQ+rj gS",
                            "verse 83:20": "ftlesa usdksa ds vkeky ntZ gSa",
                            "verse 83:21": "mlds ikl eqd+fjZc ¼Q+fj’rs½ gkft+j gSa",
                            "verse 83:22": "cs’kd usd yksx usverksa esa gksaxs",
                            "verse 83:23": "r[+rksa ij cSBs ut+kjs djsaxs",
                            "verse 83:24": "rqe muds psgjksa gh ls jkgr dh rkt+xh ekywe dj yksxs",
                            "verse 83:25": "mudks lj c eksgj [+kkfyl Ójkc fiyk;h tk,xh",
                            "verse 83:26": "ftldh eksgj fe’d dh gksxh vkSj mldh rjQ vycRrk Ó;kd+hu dks jx+cr djuh pkfg,",
                            "verse 83:27": "vkSj ml ¼Ójkc½ esa rluhe ds ikuh dh vkesft+’k gksxh",
                            "verse 83:28": "og ,d p’ek gS ftlesa eqd+jschu fi;saxs",
                            "verse 83:29": "cs’kd tks xqukgxkj eksfeuksa ls g¡lh fd;k djrs Fks",
                            "verse 83:30": "vkSj tc muds ikl ls xqt+jrs rks mu ij p’ked djrs Fks",
                            "verse 83:31": "vkSj tc vius yM+ds okyksa dh rjQ+ ykSV dj vkrs Fks rks brjkrs gq,",
                            "verse 83:32": "vkSj tc mu eksfeuhu dks ns[krs rks dg cSBrs Fks fd ;s rks ;d+huh xqejkg gSa",
                            "verse 83:33": "gkykWfd ;s yksx mu ij dqN fuxjk¡ cuk ds rks Hksts ugha x, Fks",
                            "verse 83:34": "rks vkt ¼d+;ker esa½ bZekunkj yksx dkfQ+jksa ls g¡lh djsaxs",
                            "verse 83:35": "¼vkSj½ r[+rksa ij cSBs ut+kjs djsaxs",
                            "verse 83:36": "fd vc rks dkfQ+jksa dks muds fd, dk iwjk iwjk cnyk fey x;k"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Kecelakaan besarlah bagi orang-orang yang curang,",
                            "verse 83:2": "(yaitu) orang-orang yang apabila menerima takaran dari orang lain mereka minta dipenuhi,",
                            "verse 83:3": "dan apabila mereka menakar atau menimbang untuk orang lain, mereka mengurangi.",
                            "verse 83:4": "Tidakkah orang-orang itu yakin, bahwa sesungguhnya mereka akan dibangkitkan,",
                            "verse 83:5": "pada suatu hari yang besar,",
                            "verse 83:6": "(yaitu) hari (ketika) manusia berdiri menghadap Tuhan semesta alam?",
                            "verse 83:7": "Sekali-kali jangan curang, karena sesungguhnya kitab orang yang durhaka tersimpan dalam sijjin.",
                            "verse 83:8": "Tahukah, kamu apakah sijjin itu?",
                            "verse 83:9": "(Ialah) kitab yang bertulis.",
                            "verse 83:10": "Kecelakaan yang besarlah pada hari itu bagi orang-orang yang mendustakan,",
                            "verse 83:11": "(yaitu) orang-orang yang mendustakan hari pembalasan.",
                            "verse 83:12": "Dan tidak ada yang mendustakan hari pembalasan itu melainkan setiap orang yang melampaui batas lagi berdosa,",
                            "verse 83:13": "yang apabila dibacakan kepadanya ayat-ayat Kami, ia berkata: \"Itu adalah dongengan orang-orang yang dahulu\".",
                            "verse 83:14": "Sekali-kali tidak (demikian), sebenarnya apa yang selalu mereka usahakan itu menutup hati mereka.",
                            "verse 83:15": "Sekali-kali tidak, sesungguhnya mereka pada hari itu benar-benar terhalang dari (melihat) Tuhan mereka.",
                            "verse 83:16": "Kemudian, sesungguhnya mereka benar-benar masuk neraka.",
                            "verse 83:17": "Kemudian, dikatakan (kepada mereka): \"Inilah azab yang dahulu selalu kamu dustakan\".",
                            "verse 83:18": "Sekali-kali tidak, sesungguhnya kitab orang-orang berbakti itu (tersimpan) dalam `Illiyyin.",
                            "verse 83:19": "Tahukah kamu apakah `Illiyyin itu?",
                            "verse 83:20": "(Yaitu) kitab yang bertulis,",
                            "verse 83:21": "yang disaksikan oleh malaikat-malaikat yang didekatkan (kepada Allah).",
                            "verse 83:22": "Sesungguhnya orang yang berbakti itu benar-benar berada dalam keni'matan yang besar (surga),",
                            "verse 83:23": "mereka (duduk) di atas dipan-dipan sambil memandang.",
                            "verse 83:24": "Kamu dapat mengetahui dari wajah mereka kesenangan hidup mereka yang penuh kenikmatan.",
                            "verse 83:25": "Mereka diberi minum dari khamar murni yang dilak (tempatnya),",
                            "verse 83:26": "laknya adalah kesturi; dan untuk yang demikian itu hendaknya orang berlomba-lomba.",
                            "verse 83:27": "Dan campuran khamar murni itu adalah dari tasnim,",
                            "verse 83:28": "(yaitu) mata air yang minum daripadanya orang-orang yang didekatkan kepada Allah.",
                            "verse 83:29": "Sesungguhnya orang-orang yang berdosa, adalah mereka yang dahulunya (di dunia) menertawakan orang-orang yang beriman.",
                            "verse 83:30": "Dan apabila orang-orang yang beriman lalu di hadapan mereka, mereka saling mengedip-ngedipkan matanya.",
                            "verse 83:31": "Dan apabila orang-orang berdosa itu kembali kepada kaumnya, mereka kembali dengan gembira.",
                            "verse 83:32": "Dan apabila mereka melihat orang-orang mukmin, mereka mengatakan: \"Sesungguhnya mereka itu benar-benar orang-orang yang sesat\",",
                            "verse 83:33": "padahal orang-orang yang berdosa itu tidak dikirim untuk penjaga bagi orang-orang mu’min.",
                            "verse 83:34": "Maka pada hari ini, orang-orang yang beriman menertawakan orang-orang kafir,",
                            "verse 83:35": "mereka (duduk) di atas dipan-dipan sambil memandang.",
                            "verse 83:36": "Sesungguhnya orang-orang kafir telah diberi ganjaran terhadap apa yang dahulu mereka kerjakan."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Guai ai frodatori,",
                            "verse 83:2": "che quando comprano esigono colma la misura,",
                            "verse 83:3": "ma quando sono loro a misurare o a pesare, truffano.",
                            "verse 83:4": "Non pensano che saranno resuscitati,",
                            "verse 83:5": "in un Giorno terribile,",
                            "verse 83:6": "il Giorno in cui le genti saranno ritte davanti al Signore dei mondi?",
                            "verse 83:7": "No, in verità il registro dei peccatori è nella Segreta ;",
                            "verse 83:8": "e chi mai ti farà comprendere cos'è la Segreta ?",
                            "verse 83:9": "E' uno scritto vergato.",
                            "verse 83:10": "Guai, in quel Giorno, a coloro che tacciano di menzogna,",
                            "verse 83:11": "che tacciano di menzogna il Giorno del Giudizio.",
                            "verse 83:12": "Non lo taccia di menzogna altri che il peccatore inveterato,",
                            "verse 83:13": "che, quando gli sono recitati i Nostri versetti, dice: « Favole degli antichi!»",
                            "verse 83:14": "Niente affatto: è piuttosto quello che fanno che copre i loro cuori.",
                            "verse 83:15": "Niente affatto: in verità in quel Giorno un velo li escluderà dal vedere il loro Signore,",
                            "verse 83:16": "e poi cadranno nella Fornace.",
                            "verse 83:17": "Sarà detto loro: « Ecco quello che tacciavate di menzogna!».",
                            "verse 83:18": "Niente affatto: il registro dei caritatevoli sarà nelle Altezze ,",
                            "verse 83:19": "E chi mai ti farà comprendere cosa sono le Altezze?",
                            "verse 83:20": "E' uno scritto vergato.",
                            "verse 83:21": "I ravvicinati ne renderanno testimonianza.",
                            "verse 83:22": "I giusti saranno nella delizia,",
                            "verse 83:23": "",
                            "verse 83:24": "su alti divani guarderanno.",
                            "verse 83:25": "Sui loro volti vedrai il riflesso della Delizia",
                            "verse 83:26": "Berranno un nettare puro, suggellato",
                            "verse 83:27": "con suggello di muschio - che vi aspirino coloro che ne sono degni-",
                            "verse 83:28": "[un nettare] mescolato con Tasnîm ,",
                            "verse 83:29": "fonte di cui berranno i ravvicinati.",
                            "verse 83:30": "Invero i malvagi schernivano i credenti ;",
                            "verse 83:31": "quando passavano nei loro pressi si davano occhiate,",
                            "verse 83:32": "ritornando dalla loro gente, si burlavano di loro;",
                            "verse 83:33": "e quando li vedevano, dicevano: « Davvero sono fuorviati!».",
                            "verse 83:34": "Certo non hanno avuto l'incarico di vegliare su di loro.",
                            "verse 83:35": "Oggi invece sono i credenti a ridere dei miscredenti:",
                            "verse 83:36": "",
                            "verse 83:37": "su alti divani guarderanno.",
                            "verse 83:38": "I miscredenti non sono forse compensati per quello che hanno fatto?"
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "災いなるかな，量を減らす者こそは。",
                            "verse 83:2": "かれらは人から計って受け取る時は，十分に取り，",
                            "verse 83:3": "（相手にわたす）量や重さを計るときは，少なく計量する者たちである。",
                            "verse 83:4": "これらの者は，甦ることを考えないのか，",
                            "verse 83:5": "偉大なる日に。",
                            "verse 83:6": "その日，（凡ての）人間は，万有の主の御前に立つのではないか。",
                            "verse 83:7": "断じていけない。罰ある者の記録は，スィッジーンの中に（保管して）ある。",
                            "verse 83:8": "スィッジーンが何であるかを，あなたに理解させるものは何か。",
                            "verse 83:9": "（そこには完全に）書かれた一つの記録（がある）。",
                            "verse 83:10": "災いなるかな，その日，嘘であると言って来た者たちよ，",
                            "verse 83:11": "審判の日を，嘘であると言って来た者たちこそは。",
                            "verse 83:12": "これを嘘であると言って来た者は，反逆者，罪人に外ならない。",
                            "verse 83:13": "わが印が，かれらに読誦された時，かれらは，「昔の物語だ。」と言った。",
                            "verse 83:14": "断じてそうではない。思うにかれらの行った（悪）事が，その心の(鋳?)となったのである。",
                            "verse 83:15": "いや，本当にかれらは，その日，主（の御光）から締め出される。",
                            "verse 83:16": "次にかれらは，地獄できっと焼かれよう。",
                            "verse 83:17": "そこで，かれらに，「これが，あなたがたが嘘であると言ってきたことである。」と告げられるであろう。",
                            "verse 83:18": "これに引き替え敬虔な者の記録は，イッリッイーンの中に（保管して）ある。",
                            "verse 83:19": "イッリッイーンが何であるかを，あなたに理解させるものは何か。",
                            "verse 83:20": "（そこには完全に）書かれた一つの記録（があり），",
                            "verse 83:21": "（主の）側近者たちが，それを立証する。",
                            "verse 83:22": "本当に敬虔な者は，必ず至福の中におり，",
                            "verse 83:23": "かれらは寝床に寄って，見渡すであろう。",
                            "verse 83:24": "あなたはかれらの顔に至福の輝きを認めよう。",
                            "verse 83:25": "かれらは，封印された純良な酒を注がれる。",
                            "verse 83:26": "その封印はジャコウである。これを求め熱望する者に熱望させなさい。",
                            "verse 83:27": "それにはタスニームが混ぜられよう。",
                            "verse 83:28": "（アッラーに）近い者たち（善行者）は，その泉から飲もう。",
                            "verse 83:29": "本当に罪ある者たちは，信仰する者を嘲笑っていた。",
                            "verse 83:30": "そしてかれら（信者）の傍を過ぎると，互いに（嘲笑して）目くばせし，",
                            "verse 83:31": "家族の許へ帰る時，笑い草にしたものである。",
                            "verse 83:32": "かれらはかれら（信者）を見かけると，「本当にこれらの者は迷っています。」と言う。",
                            "verse 83:33": "だがかれらは，かれら（信者）の監視者として遣わされた者ではない。",
                            "verse 83:34": "だがこの日は，信仰する者が不信者たちを笑い，",
                            "verse 83:35": "かれらは寝床に寄って，見渡すであろう。",
                            "verse 83:36": "不信者たちは，その行いの報いを受けたであろうかと。 かれらは寝床に寄って，見渡すであろう。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "저울을 속이는 자들에게 재앙이 있을것이라",
                            "verse 83:2": "그들은 사람들로부터 받을 때저울을 넘치게 하여 받으나",
                            "verse 83:3": "그들이 사람들에게 줄 때는 무게를 낮추어서 주노라",
                            "verse 83:4": "그들은 그들이 부활되리라 생 각지 않느뇨",
                            "verse 83:5": "그날은 위대한 날로",
                            "verse 83:6": "모든 인간이 만유의 주님앞에 서는 날이며",
                            "verse 83:7": "사악한 자들의 기록은 씨진 에 보관되어 있노라",
                            "verse 83:8": "씨진이 무엇인지 무엇이 그대 에게 알려주리요",
                            "verse 83:9": "그곳에 기록된 기록부가 있노 라",
                            "verse 83:10": "그날에는 불신한 그들에게 재앙이 있을 것이요",
                            "verse 83:11": "심판의 날을 부정하는 자들 에게도 재앙이 있을 것이라",
                            "verse 83:12": "어느 누구도 그것을 부정하 지 아니하나 오만한 자들은 영역 을 벗어난 죄인들이라",
                            "verse 83:13": "하나님의 말씀이 그에게 낭 송될 때 이것은 옛 선조들의 우화 요 라고 말하더라",
                            "verse 83:14": "그렇지 않노라 그들의 마음 들이 죄악으로 물들어 있노라",
                            "verse 83:15": "실로 그날 그들은 베일로 가리워져 바라보지도 못하며",
                            "verse 83:16": "그들은 불지옥으로 들어가게되니",
                            "verse 83:17": "이것은 너희가 거짓이라 거 역했던 현실이라는 말씀이 있을 것이라",
                            "verse 83:18": "그러나 의로운 자들의 기록 은 일린에 보관되나니",
                            "verse 83:19": "일린이 무엇인가를 무엇이 그대에게 설명하여 주리요",
                            "verse 83:20": "그곳에 기록된 기록부가 있 노라",
                            "verse 83:21": "하나님 가까이에 있는 그들 이 그것을 증언할 것이니",
                            "verse 83:22": "의로운 자들은 축복속에 있 게 될 것이며",
                            "verse 83:23": "그들은 안락 의자에서 바라 볼 것이라",
                            "verse 83:24": "너희는 그들의 얼굴에서 밝 은 축복의 빛을 인식할 것이며",
                            "verse 83:25": "봉인된 순수한 술로써 그들 의 갈증을 식힐 것이며",
                            "verse 83:26": "최후의 음료수는 미스크가 될 것이니 그것을 소망하는 자 갖게 하리라",
                            "verse 83:27": "거기에 타쓰님이 혼합되어 지니",
                            "verse 83:28": "그것은 하나님 가까이에 있 는 자들이 마시는 샘물이라",
                            "verse 83:29": "죄인들은 민음을 가졌던 자 들을 비웃어",
                            "verse 83:30": "그들 옆을 지나갈 때면 눈짓으로 조롱하곤 하였고",
                            "verse 83:31": "그들이 무리에게로 돌아왔을때는 우물 댔노라",
                            "verse 83:32": "믿는자를 볼 때면 보라 이들이 방황한 자들이라 하더라",
                            "verse 83:33": "그러나 불신자들은 믿는자를감시하기 위해 보내어진 자가 아 니매",
                            "verse 83:34": "오늘은 믿음을 가진 자들이 그 불신자들을 조롱하리라",
                            "verse 83:35": "이들은 안락의자에 앉아 바 라다 보리라",
                            "verse 83:36": "불신자들은 그들이 행하였던대로 보상을 되돌려 받지 않느뇨"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "‌‌هاوارو ئاهو ناڵه بۆ ته‌رازووبازه‌کان، بۆ ئه‌وانه‌ی که له‌کێشان و پێواندا له‌کڕین و فرۆشتندا ته‌رازوو بازی و فێڵ ده‌که‌ن (یان له هه‌ڵسه‌نگاندنی خه‌ڵکیدا ڕاست ناڵێن).",
                            "verse 83:2": "ئه‌وانه‌ی کاتێك شت له خه‌ڵکی ده‌کڕن به ته‌واوی، به زیاده‌وه ڵێیان وه‌رده‌گرن.",
                            "verse 83:3": "به‌ڵام کاتێك شتیان بۆ ده‌پێون یان ده‌کێشن لێی ده‌دزنه‌وه و که‌میان ده‌ده‌نێ و فێڵیان لێده‌که‌ن.",
                            "verse 83:4": "ئایا ئه‌وانه گومان نابه‌ن که به‌ڕاستی زیندوو ده‌کرێنه‌وه (تا سه‌رئه‌نجامی خیانه‌ت و فێڵیان وه‌ربگرن).",
                            "verse 83:5": "بۆ ڕۆژێکی زۆر سامناک و ترسناک و گه‌وره‌.",
                            "verse 83:6": "ئه‌و ڕۆژه‌ی که هه‌موو خه‌ڵکی به پێوه ده‌وه‌ستن له‌به‌رده‌م ده‌سه‌ڵاتی په‌روه‌ردگاری جیهانیاندا.",
                            "verse 83:7": "واز بهێنن له ته‌رازووبازی، چونکه به‌ڕاستی نامه‌ی کرده‌وه‌ی تاوانباران له (سجین) دایه‌.",
                            "verse 83:8": "جا تۆ چووزانی (سجین) چیه‌؟",
                            "verse 83:9": "نامه‌یه‌کی (دیاری و ئاشکرایه هه‌ر به‌ڕواڵه‌تیدا دیاره که خێری تیادا نیه‌)، مۆرکراوو لۆک کراویشه‌.",
                            "verse 83:10": "هاوارو ئاهوناڵه له‌و ڕۆژه‌دا بۆ ئه‌وانه‌ی بڕوایان نیه و، به‌رنامه‌ی خوا به‌درۆ ده‌زانن.",
                            "verse 83:11": "ئه‌وانه‌ی که بڕوایان به ڕۆژی قیامه‌ت و زیندوو بوونه‌وه نیه و هه‌میشه به‌درۆی ده‌زانن.",
                            "verse 83:12": "که‌سیش به‌رپا بوونی ئه‌و ڕۆژه به‌درۆ نازانێت، مه‌گه‌ر هه‌موو سته‌مکارێکی گوناهبار نه‌بێت.",
                            "verse 83:13": "ئه‌وجۆره که‌سانه‌ی کاتێک ئایه‌ت و فه‌رمانه‌کانی ئێمه‌یان به‌سه‌ردا ده‌خوێنرێته‌وه‌، ده‌ڵێن: ئه‌مه ئه‌فسانه‌ی پێشینانه و (به‌سه‌رچووه‌).",
                            "verse 83:14": "نه‌خێر، وانیه (ئه‌و نه‌فامانه تێناگه‌ن و داناچڵه‌کێن) به‌ڵکو دڵیان ژه‌نگی هێناوه‌و چڵکی گوناه دایپۆشیوه له سه‌ره‌نجامی ئه‌و کاروکرده‌وانه‌ی که ده‌یانکرد.",
                            "verse 83:15": "نه‌خێڕ، ڕزگاربوونیان نیه‌، چونکه به‌ڕاستی ئه‌و ڕۆژه به‌ربه‌ست هه‌یه له‌نێوان تاوانباران و په‌روه‌ردگاریاندا و بێ به‌ش ده‌بن له‌بینینی ئه‌و زاته‌.",
                            "verse 83:16": "له‌وه‌ودوا بێگومان ده‌خرێنه ناو ئاگری دۆزه‌خه‌وه‌.",
                            "verse 83:17": "پاشان پێیان ده‌وترێت: ئائه‌مه ئه‌و شوێنه‌یه که بڕواتان پێی نه‌بوو به‌ڕاستتان نه‌ده‌زانی.",
                            "verse 83:18": "نه‌خێر (ده‌سته‌ی سه‌رفرازان دوورن له‌و ته‌نگانه‌یه‌) به‌ڵکو نامه‌ی کرده‌وه‌کانیان، دۆسیه‌ی ڕه‌فتاریان وا له شوێنه به‌رزو بڵنده‌کاندا.",
                            "verse 83:19": "جا تۆ چووزانی (علیون) چیه‌و چۆنه‌.",
                            "verse 83:20": "نامه‌یه‌کی (دیارو ئاشکرایه‌، هه‌ر به ڕواڵه‌تیدا دیاره که خاوه‌نی سه‌رفرازو به‌خته‌وه‌ره‌) مۆرکراوو لۆک کراویشه‌.",
                            "verse 83:21": "ئه‌و نامه‌یه فریشته نزیکه به‌ڕێزه‌کانی لای خوا ده‌یکه‌نه‌وه‌و (به‌سه‌رسامی و خۆشیه‌وه سه‌رنجی چاکه و خواپه‌رستی چاکان ده‌ده‌ن و) شایه‌تی له‌سه‌ر ده‌ده‌ن.",
                            "verse 83:22": "به‌ڕاستی چاکان، خواناسان له‌ناو نازو نیعمه‌تدا ژیانی خۆشی و شادی ده‌به‌نه سه‌ر.",
                            "verse 83:23": "له‌سه‌ر کورسی و قه‌نه‌فه ڕازاوه‌کان ته‌ماشای ده‌وروبه‌ری خۆیان ده‌که‌ن (سه‌رنجی دیمه‌نی جوان و باخات و باخچه و گوڵ و گوڵزارو تاڤگه و ڕووبارو نازو نیعمه‌ته نه‌بڕاوه و بێشوماره‌کان ده‌ده‌ن).",
                            "verse 83:24": "خۆشی و خۆشگوزه‌رانی ناسک په‌روه‌ری له ڕووخساریاندا ده‌بینیت.",
                            "verse 83:25": "شه‌رابێکیان پێشکه‌ش ده‌کرێت، که پاک و سه‌رمۆره‌.",
                            "verse 83:26": "که نۆشکرا بۆنی میسک ئه‌و ناوه پڕده‌کات، (پێچه‌وانه‌ی شه‌رابی دنیایه که بخۆرو ده‌وروبه‌ریش بۆگه‌ن ده‌کات)، جا با له پێناوی ئه‌وه‌دا پێشبڕکێکه‌ران پێشبڕکێ بکه‌ن.",
                            "verse 83:27": "هه‌روه‌ها ئه‌و شه‌رابه ئاوێته‌که‌ی له (تسنیم)ه‌.",
                            "verse 83:28": "(تسنیم) یش سه‌رچاوه‌یه‌که ته‌نها خۆشه‌ویستان و نزیککراوه‌کان لێی ده‌خۆنه‌وه‌.",
                            "verse 83:29": "بێگومان ئه‌وانه‌ی که تاوانیان ده‌کرد گاڵته‌یان به ئیمانداران ده‌هات و پێیان پێده‌که‌نین.",
                            "verse 83:30": "کاتێکیش به‌لایاندا تێپه‌ڕ بوونایه ده‌یانکرده چپه‌چپ و سرته سرت و به چاو ئیشاره‌تیان ده‌کرد.",
                            "verse 83:31": "کاتێکیش ده‌گه‌ڕانه‌وه بۆ باڵه‌وه، به‌ده‌م پێکه‌نین و گاڵته‌وه ده‌گه‌ڕانه‌وه (هه‌ر باسیان ده‌کردن).",
                            "verse 83:32": "کاتێکیش ئیمانداران ده‌بیننه‌وه‌، ده‌ڵێن: به‌ڕاستی ئه‌وانه گومران و له‌ڕێگه‌ی باو وباپیران لایانداوه‌!!",
                            "verse 83:33": "خۆ ئه‌و خوانه‌ناسانه ڕه‌وانه نه‌کراون تا چاودێربن به‌سه‌ر ئیماندارانه‌وه‌.",
                            "verse 83:34": "(ئه‌مڕۆ ئیتر نۆره‌ی ئیماندارانه‌) جا ئه‌مڕۆ ئه‌وانه‌ی باوه‌ڕدار بوون به‌کافران پێده‌که‌نن.",
                            "verse 83:35": "له‌سه‌ر کورسی و قه‌نه‌فه (ڕازاوه‌کان) ته‌ماشا ده‌که‌ن (دۆزه‌خیه‌کان ده‌بینن له‌سه‌ر شاشه‌ی تایبه‌تی پێیان ده‌ڵێن):",
                            "verse 83:36": "باشه ئایا کافران پاداشتی ئه‌وه‌ی که ده‌یانکرد درانه‌وه‌؟! ده‌ڵێن):"
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Kecelakaan besar bagi orang-orang yang curang (dalam timbangan dan sukatan),",
                            "verse 83:2": "Iaitu mereka yang apabila menerima sukatan (gantang cupak) dari orang lain mereka mengambilnya dengan cukup,",
                            "verse 83:3": "Dan (sebaliknya) apabila mereka menyukat atau menimbang untuk orang lain, mereka kurangi.",
                            "verse 83:4": "Tidakkah mereka menyangka bahawa mereka akan dibangkitkan (hidup semula sesudah mati)?",
                            "verse 83:5": "Pada hari (kiamat) yang amat besar (huru-haranya),",
                            "verse 83:6": "Hari berdiri manusia untuk mengadap Tuhan sekalian alam?",
                            "verse 83:7": "Tidak sepatutnya (mereka melakukan perbuatan yang salah itu dan melalaikan hari akhirat)! Sesungguhnya \"kitab suratan amal\" orang-orang yang berdosa itu (didaftarkan) dalam \"Sijjiin\".",
                            "verse 83:8": "Dan apa jalannya engkau dapat mengetahui: Apa dia \"Sijjiin\" itu,",
                            "verse 83:9": "Ialah (tempat simpanan) kitab catitan yang jelas nyata, (yang menghimpunkan amalan orang-orang yang berdosa).",
                            "verse 83:10": "Kecelakaan besar, pada hari itu, bagi orang-orang yang mendustakan -",
                            "verse 83:11": "Iaitu mereka yang mendustakan hari pembalasan.",
                            "verse 83:12": "Dan tiada yang mendustakannya melainkan tiap-tiap orang yang melampaui batas (kebenaran), lagi amat derhaka!",
                            "verse 83:13": "(Sehingga) apabila dia dibacakan kepadanya ayat-ayat Kami, dia berkata: Ini ialah dongeng orang-orang dahulu kala!",
                            "verse 83:14": "Sebenarnya! (Ayat-ayat Kami itu tidak ada cacatnya) bahkan mata hati mereka telah diselaputi kekotoran (dosa), dengan sebab (perbuatan kufur dan maksiat) yang mereka kerjakan.",
                            "verse 83:15": "Jangan lagi mereka berlaku demikian! (kalau tidak), mereka pada hari itu, tetap terdinding dari (rahmat) Tuhannya.",
                            "verse 83:16": "Kemudian, sesungguhnya mereka akan menderita bakaran Neraka.",
                            "verse 83:17": "Akhirnya dikatakan (kepada mereka): Inilah dia (azab seksa) yang kamu dustakan dahulu.",
                            "verse 83:18": "Ingatlah wahai manusia! Sesungguhnya \"kitab suratan amal\" orang-orang yang berbakti (dengan taat dan amal kebajikan), adalah (didaftarkan) dalam \"Illiyyiin\".",
                            "verse 83:19": "Dan apa jalannya engkau dapat mengetahui, apa dia \"Illiyyiin\" itu?",
                            "verse 83:20": "Ialah (tempat simpanan) kitab catitan yang jelas nyata,",
                            "verse 83:21": "Yang disaksikan oleh sekumpulan malaikat, yang didampingkan Tuhan di sisinya.",
                            "verse 83:22": "Sesungguhnya orang-orang yang berbakti (dengan taat dan amal kebajikan), tetap berada di dalam Syurga yang penuh nikmat:",
                            "verse 83:23": "Mereka berehat di atas pelamin-pelamin (yang berhias), sambil melihat (segala keindahan dan kemuliaan yang disediakan untuk mereka di situ).",
                            "verse 83:24": "Engkau dapat melihat pada muka mereka: Cahaya nikmat yang mereka perolehi.",
                            "verse 83:25": "Mereka diberi minum dari satu minuman yang termeterai bekasnya,",
                            "verse 83:26": "Meterainya kasturi; dan untuk (memperolehi nikmat kesenangan) itu hendaknya berlumba-lumba mereka yang ingin merebut kelebihan dan kesenangan;",
                            "verse 83:27": "Dan campuran minuman itu adalah dari \"Tasnim\":",
                            "verse 83:28": "laitu mata air yang diminum daripadanya oleh orang-orang yang di dampingkan (Tuhan di sisiNya).",
                            "verse 83:29": "Sesungguhnya orang-orang yang derhaka, mereka selalu tertawakan orang-orang yang beriman.",
                            "verse 83:30": "Dan apabila orang-orang yang beriman lalu dekat mereka, mereka mengerling dan memejam celikkan mata sesama sendiri (mencemuhnya).",
                            "verse 83:31": "Dan apabila mereka kembali kepada kaum keluarganya, mereka kembali dengan riang gembira;",
                            "verse 83:32": "Dan apabila mereka melihat orang-orang yang beriman, mereka berkata: Sesungguhnya orang-orang itu adalah golongan yang sesat!",
                            "verse 83:33": "Pada hal mereka tidak diutus untuk menjaga sesat atau tidaknya orang-orang yang beriman itu!",
                            "verse 83:34": "Maka pada hari ini, orang-orang yang beriman pula tertawakan orang yang kafir itu.",
                            "verse 83:35": "Sambil mereka berehat di atas pelamin-pelamin (yang berhias), serta melihat (hal yang berlaku kepada musuhnya).",
                            "verse 83:36": "(Untuk menambahkan kegembiraan mereka, mereka ditanya): Bukankah orang-orang yang kafir itu telah dibalas akan apa yang mereka telah kerjakan dahulu?"
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "واى بر كم‏فروشان!",
                            "verse 83:2": "آنان كه وقتى براى خود پيمانه مى‏كنند، حق خود را بطور كامل مى‏گيرند;",
                            "verse 83:3": "اما هنگامى كه مى‏خواهند براى ديگران پيمانه يا وزن كنند، كم مى‏گذارند!",
                            "verse 83:4": "آيا آنها گمان نمى‏كنند كه برانگيخته مى‏شوند،",
                            "verse 83:5": "در روزى بزرگ;",
                            "verse 83:6": "روزى كه مردم در پيشگاه پروردگار جهانيان مى‏ايستند",
                            "verse 83:7": "چنين نيست كه آنها (درباره قيامت) مى‏پندارند، به يقين نامه اعمال بدكاران در «سجين‏» است!",
                            "verse 83:8": "تو چه مى‏دانى «سجين‏» چيست؟",
                            "verse 83:9": "نامه‏اى است رقم زده شده و سرنوشتى است حتمى!",
                            "verse 83:10": "واى در آن روز بر تكذيب‏كنندگان!",
                            "verse 83:11": "همانها كه روز جزا را انكار مى‏كنند",
                            "verse 83:12": "تنها كسى آن را انكار مى‏كند كه متجاوز و گنهكار است!",
                            "verse 83:13": "(همان كسى كه) وقتى آيات ما بر او خوانده مى‏شود مى‏گويد: «اين افسانه‏هاى پيشينيان است!; س‏ذللّه",
                            "verse 83:14": "چنين نيست كه آنها مى‏پندارند، بلكه اعمالشان چون زنگارى بر دلهايشان نشسته است!",
                            "verse 83:15": "چنين نيست كه مى‏پندارند، بلكه آنها در آن روز از پروردگارشان محجوبند!",
                            "verse 83:16": "سپس آنها به يقين وارد دوزخ مى‏شوند!",
                            "verse 83:17": "بعد به آنها گفته مى‏شود: «اين همان چيزى است كه آن را انكار مى‏كرديد!»",
                            "verse 83:18": "چنان نيست كه آنها (درباره معاد) مى‏پندارند، بلكه نامه اعمال نيكان در «عليين‏» است!",
                            "verse 83:19": "و تو چه مى‏دانى «عليين‏» چيست!",
                            "verse 83:20": "نامه‏اى است رقم‏خورده و سرنوشتى است قطعى،",
                            "verse 83:21": "كه مقربان شاهد آنند!",
                            "verse 83:22": "مسلما نيكان در انواع نعمت‏اند:",
                            "verse 83:23": "بر تختهاى زيباى بهشتى تكيه كرده و (به زيباييهاى بهشت) مى‏نگرند!",
                            "verse 83:24": "در چهره‏هايشان طراوت و نشاط نعمت را مى‏بينى و مى‏شناسى!",
                            "verse 83:25": "آنها از شراب (طهور) زلال دست‏نخورده و سربسته‏اى سيراب مى‏شوند!",
                            "verse 83:26": "مهرى كه بر آن نهاده شده از مشك است; و در اين نعمتهاى بهشتى راغبان بايد بر يكديگر پيشى گيرند!",
                            "verse 83:27": "اين شراب (طهور) آميخته با «تسنيم‏» است،",
                            "verse 83:28": "همان چشمه‏اى كه مقربان از آن مى‏نوشند",
                            "verse 83:29": "بدكاران (در دنيا) پيوسته به مؤمنان مى‏خنديدند،",
                            "verse 83:30": "و هنگامى كه از كنارشان مى‏گذشتند آنان را با اشاره تمسخر مى‏كردند،",
                            "verse 83:31": "و چون به سوى خانواده خود بازمى‏گشتند مسرور و خندان بودند،",
                            "verse 83:32": "و هنگامى كه آنها را مى‏ديدند مى‏گفتند: «اينها گمراهانند!»",
                            "verse 83:33": "در حالى كه هرگز مامور مراقبت و متكفل آنان ( مؤمنان) نبودند!",
                            "verse 83:34": "ولى امروز مؤمنان به كفار مى‏خندند،",
                            "verse 83:35": "در حالى كه بر تختهاى آراسته بهشتى نشسته و (به سرنوشت شوم آنها) مى‏نگرند!",
                            "verse 83:36": "آيا (با اين حال) كافران پاداش اعمال خود را گرفتند؟!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Ai dos fraudadores,",
                            "verse 83:2": "Aqueles que, quando alguém lhes mede algo, exigem a medida plena.",
                            "verse 83:3": "Porém, quando eles medem ou pesam para os demais, burlam-nos.",
                            "verse 83:4": "Porventura, não consideram que serão ressuscitados,",
                            "verse 83:5": "Para o Dia terrível?",
                            "verse 83:6": "Dia em que os seres comparecerão perante o Senhor do Universo?",
                            "verse 83:7": "Qual! Sabei que o registro dos ignóbeis estará preservado em Sijjin.",
                            "verse 83:8": "E o que te fará entender o que é Sijjin?",
                            "verse 83:9": "É um registro escrito",
                            "verse 83:10": "Ai, nesse dia, dos desmentidores!",
                            "verse 83:11": "Que negam o Dia do Juízo,",
                            "verse 83:12": "Coisa que ninguém nega, senão o transgressor, pecador.",
                            "verse 83:13": "É aquele que, quando lhe são recitados os Nossos versículos, diz: São meras fábulas dos primitivos!",
                            "verse 83:14": "Qual! Em seus corações há a ignomínia, pelo que cometeram.",
                            "verse 83:15": "Qual! Em verdade, nesse dia, estar-lhes-á vedado contemplar o seu Senhor.",
                            "verse 83:16": "Então, entrarão na fogueira.",
                            "verse 83:17": "Em seguida, ser-lhes-á dito: Esta é a (realidade) que negáveis!",
                            "verse 83:18": "Qual! Sabei que o registro dos piedosos está preservado em Il’lilin!",
                            "verse 83:19": "E o que te fará entender o que é Il’lilin?",
                            "verse 83:20": "É um registro manuscrito,",
                            "verse 83:21": "Atestado por aqueles que estão próximos (ao seu Senhor).",
                            "verse 83:22": "Em verdade, os piedosos estarão em deleite,",
                            "verse 83:23": "Reclinados sobre almofadas, olhando-se de frente.",
                            "verse 83:24": "Reconhecerás, em seus rostos o esplendor do deleite.",
                            "verse 83:25": "Ser-lhes-á dado a beber um néctar (de um frasco) lacrado,",
                            "verse 83:26": "Cujo lacre será de almíscar - que os que aspiram a isso rivalizem em aspirá-lo -",
                            "verse 83:27": "Em cuja mistura vem do Tasnim,",
                            "verse 83:28": "Que é uma fonte, da qual beberão os que estão próximos (a Deus).",
                            "verse 83:29": "Sabei que os pecadores burlavam os fiéis.",
                            "verse 83:30": "E quando passavam junto a eles, piscavam os olhos, uns para os outros,",
                            "verse 83:31": "E quando voltavam aos seus, voltavam ridicularizando (os fiéis);",
                            "verse 83:32": "E quando os viam, diziam: Em verdade, estes estão extraviados!",
                            "verse 83:33": "Embora não estivessem destinados a ser os seus guardiães.",
                            "verse 83:34": "Porém, hoje, os fiéis rirão dos incrédulos.",
                            "verse 83:35": "E, reclinados sobre almofadas, observarão.",
                            "verse 83:36": "Acaso, os incrédulos não serão punidos, por tudo quanto tiverem cometido?"
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 83:1": "Vai acelora care înșalã la mãsurã ,",
                            "verse 83:2": "Aceia care, dacã li se mãsoarã de cãtre",
                            "verse 83:3": "oameni, voiesc mãsurã întreagã,",
                            "verse 83:4": "Însã atunci când ei mãsoarã și cântãresc, dau mai puțin!",
                            "verse 83:5": "Oare nu cred aceia cã ei vor fi înviați",
                            "verse 83:6": "Într-o Zi mare,",
                            "verse 83:7": "O Zi în care oamenii vor sta înaintea Stãpânului lumilor?",
                            "verse 83:8": "Dar nu! Celor nelegiuiți le este scris cã se vor afla în Sijjin! -",
                            "verse 83:9": "Dar de unde sã știi tu ce este Sijjin? -",
                            "verse 83:10": "Într-o carte scrisã limpede!",
                            "verse 83:11": "Vai în Ziua aceea pentru cei care tãgãduiesc,",
                            "verse 83:12": "Pentru cei care tãgãduiesc Ziua Judecãții!",
                            "verse 83:13": "Însã nu o tãgãduiește pe ea decât cel nelegiuit și pãcãtos,",
                            "verse 83:14": "Care, atunci când i se recitã lui versetele Noastre, zice: \"Povești ale celor de demult!\"",
                            "verse 83:15": "Dar nu! S-au acoperit de ruginã inimile lor cu cele pe care le-au agonisit!",
                            "verse 83:16": "Nu! În Ziua aceea ei vor fi împiedicați de la vederea Domnuluilor!",
                            "verse 83:17": "Apoi ei vor fi cei care ard în Iad",
                            "verse 83:18": "Și atunci li se va zice :",
                            "verse 83:19": "\"Aceasta este ceea ce ați tãgãduit!\"",
                            "verse 83:20": "Dar nu! Celor drepți le este scris cã ei se vor afla în Illiyyin.",
                            "verse 83:21": "Dar de unde sã știi tu ce este Illiyyin?",
                            "verse 83:22": "Într-o carte scrisã limpede!",
                            "verse 83:23": "Vor face mãrturie pentru ea cei apropiați [de Allah].",
                            "verse 83:24": "Cei drepți se vor afla în",
                            "verse 83:25": "plãcerii.",
                            "verse 83:26": "Îi vor privi de pe divanuri.",
                            "verse 83:27": "Pe fețele lor vei recunoaște strãlucirea Raiului.",
                            "verse 83:28": "Li se va da sã bea dintr-un nectar pecetluit,",
                            "verse 83:29": "A cãrui pecete este moscul.",
                            "verse 83:30": "Iar amestecul lui este din Tasnim.",
                            "verse 83:31": "Un izvor din care beau cei apropiați [de Allah].",
                            "verse 83:32": "Cei ce sunt nelegiuiți au râs de cei care cred,",
                            "verse 83:33": "Iar când au trecut pe lângã ei, și-au fãcut semne,",
                            "verse 83:34": "Iar când s-au întors la familiile lor, s-au întors ei batjocorind,",
                            "verse 83:35": "Iar când i-au vãzut pe ei, au zis: \"Aceștia sunt în rãtãcire!\"",
                            "verse 83:36": "Or ei nu au fost trimiși ca pãzitori asupra lor!",
                            "verse 83:37": "În Ziua aceasta cei care cred vor râde de necredincioși,",
                            "verse 83:38": "Privind de pe divanuri.",
                            "verse 83:39": "[Nu-i așa cã] sunt rãsplãtiți necredincioșii pentru ceea ce au sãvârșit? divanuri."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 83:1": "Vai celor înşelători!",
                            "verse 83:2": "Când cumpără, cer oamenilor să le umple măsura,",
                            "verse 83:3": "însă când ei măsoară ori cântăresc, îi înşală!",
                            "verse 83:4": "Nu-şi dau seama că vor fi sculaţi",
                            "verse 83:5": "într-o Zi mare,",
                            "verse 83:6": "într-o Zi când oamenii vor sta drepţi înaintea Domnului lumilor?",
                            "verse 83:7": "Nu! Cartea celor desfrânaţi este Siggin;",
                            "verse 83:8": "Cum vei şti tu oare ce este Siggin?",
                            "verse 83:9": "Este o carte scrisă!",
                            "verse 83:10": "Vai celor care hulesc, în Ziua aceea,",
                            "verse 83:11": "vai celor care socot Ziua Judecăţii de Apoi minciună!",
                            "verse 83:12": "Doar cel care încalcă Legea şi este plin de păcate o socoate minciună.",
                            "verse 83:13": "Când i se recită în faţă din versetele Noastre, el spune: “Sunt doar poveşti ale celor dintâi!”",
                            "verse 83:14": "Nu! Inimile le-au fost pecetluite de ceea ce au dobândit.",
                            "verse 83:15": "Nu! În Ziua aceea, vor fi despărţiţi de Domnul lor",
                            "verse 83:16": "şi aruncaţi în Iad.",
                            "verse 83:17": "Li se va spune atunci: “Iată cea ce voi socoteaţi minciună!”",
                            "verse 83:18": "Nu! Cartea celor curaţi este Illiyun!",
                            "verse 83:19": "Şi cum vei şti tu oare ce este Illiyun?",
                            "verse 83:20": "Este o carte scrisă!",
                            "verse 83:21": "Cei care sunt aproape de Dumnezeu o pot mărturisi.",
                            "verse 83:22": "Da! Cei curaţi vor trăi în Plăcere,",
                            "verse 83:23": "întinşi pe paturi, vor privi în jurul lor.",
                            "verse 83:24": "Vei vedea pe chipurile lor strălucirea prea-fericirii.",
                            "verse 83:25": "Li se va da să bea nectar pecetluit,",
                            "verse 83:26": "cu pecete de mosc — pentru aceasta să se întreacă cei care se iau la întrecere! —",
                            "verse 83:27": "amestecat cu apă din Tasmin,",
                            "verse 83:28": "un izvor din care beau doar cei apropiaţi de Dumnezeu.",
                            "verse 83:29": "Nelegiuiţii râdeau de credincioşi,",
                            "verse 83:30": "făcându-şi unii altora cu ochiul, când treceau pe lângă ei,",
                            "verse 83:31": "iar când se întorceau la ai lor, se întorceau chicotind.",
                            "verse 83:32": "Când îi vedeau, spuneau: “Aceştia sunt cei rătăciţi!”",
                            "verse 83:33": "Ei nu au fost trimişi însă să fie asupra lor păzitori!",
                            "verse 83:34": "Astăzi, credincioşii râd însă de tăgăduitori.",
                            "verse 83:35": "Întinşi pe paturi de nuntă, privesc",
                            "verse 83:36": "cum sunt răsplătiţi tăgăduitorii pentru ceea ce-au făcut."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Проклятье плутам,",
                            "verse 83:2": "Кто при отмеривании для себяберет сполна,",
                            "verse 83:3": "А отмеряя для других, сбавляетвес иль меру!",
                            "verse 83:4": "Ужель не ведают они,Что и для них наступит Воскресенье,",
                            "verse 83:5": "Великий День,",
                            "verse 83:6": "Тот День,Когда предстанут людипред Владыкой мира?",
                            "verse 83:7": "Поистине, в сиджжинеКнига скверных!",
                            "verse 83:8": "Как объяснить тебе, что значитсей «сиджжин»?",
                            "verse 83:9": "Исчертанная письменами Книга!",
                            "verse 83:10": "И горе темВ тот День,Кто ложью называл,",
                            "verse 83:11": "Кто ложью Судный День нарек.",
                            "verse 83:12": "Отвергнуть же его способенЛишь преступник грешный,(пределы все переступив).",
                            "verse 83:13": "Когда читают им знаменья Наши,говорят они:«Все это — сказы первых!»",
                            "verse 83:14": "Но нет! От их деяний злыхНа их сердца спустилась темнаязавеса.",
                            "verse 83:15": "Поистине,В тот ДеньОтделены они завесой будут от взорасвоего Владыки.",
                            "verse 83:16": "Потом они войдут в пылающее пламя(Ада),",
                            "verse 83:17": "Потом им скажут:«Это — то, что вы считали ложью».",
                            "verse 83:18": "И, истинно, хранится в ильлийинеправедников книга!",
                            "verse 83:19": "Как объяснить тебе, что значит«ильлийин»?",
                            "verse 83:20": "Исчертанная письменами Книга!",
                            "verse 83:21": "Про то свидетельствуют те,Которые приближены (к Аллаху).",
                            "verse 83:22": "Поистине, там праведники пребыватьв блаженстве будут.",
                            "verse 83:23": "На возвышающихся ложахОткроется им созерцанье(всех вещей).",
                            "verse 83:24": "Ты в лицах их узнаешь светблаженства.",
                            "verse 83:25": "И чистым запечатанным виномдадут им жажду утолять,",
                            "verse 83:26": "И в завершение — сам мускус2309.",
                            "verse 83:27": "И будет смешан он с водой таснима —",
                            "verse 83:28": "Источника, откуда пьют лишь те,Которые приближены (к Аллаху).",
                            "verse 83:29": "Смеялись скверные над теми,Которые уверовали (в Бога),",
                            "verse 83:30": "И, когда мимо проходили,Мигали (понимающе) друг другу,",
                            "verse 83:31": "А приходя в свой круг людей,Они к насмешкам возвращались.",
                            "verse 83:32": "При виде их они обычно говорили:«Они, поистине, заблудшие в семмире!»",
                            "verse 83:33": "Но скверным не дано нестинад верными опеку.",
                            "verse 83:34": "И над невернымиВ тот ДеньСмеяться праведные будут.",
                            "verse 83:35": "На возвышающихся ложахОткроется им созерцанье (всех вещей).",
                            "verse 83:36": "И разве скверным не воздастсяЗа все содеянное (на земле)?! вещей)."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "¡Ay de los defraudadores,",
                            "verse 83:2": "que, cuando piden a otros la medida, la exigen exacta,",
                            "verse 83:3": "pero que, cuando ellos miden o pesan para otros, dan menos de lo debido!",
                            "verse 83:4": "¿No cuentan con ser resucitados",
                            "verse 83:5": "un día terrible,",
                            "verse 83:6": "el día que comparezcan los hombres ante el Señor del universo?",
                            "verse 83:7": "¡No! La Escritura de los pecadores está, ciertamente, en Sichchín.",
                            "verse 83:8": "Y ¿cómo sabrás qué es Sichchín?",
                            "verse 83:9": "Es una Escritura marcada.",
                            "verse 83:10": "Ese día, ¡ay de los desmentidores,",
                            "verse 83:11": "que desmienten el día del Juicio!",
                            "verse 83:12": "Y no lo desmiente sino todo violador de la ley, pecador,",
                            "verse 83:13": "que, al serle recitadas Nuestras aleyas, dice: «¡Patrañas de los antiguos!»",
                            "verse 83:14": "Pero ¡no! Lo que han cometido ha cubierto de herrumbre sus corazones.",
                            "verse 83:15": "¡No! Ese día serán separados de su Señor por un velo.",
                            "verse 83:16": "Luego, arderán, sí, en el fuego de la gehena.",
                            "verse 83:17": "Luego, se dirá: «¡He aquí lo que desmentíais!»",
                            "verse 83:18": "¡No! La Escritura de los justos está, ciertamente, en Illiyyun.",
                            "verse 83:19": "Y ¿cómo sabrás qué es Illiyyun?",
                            "verse 83:20": "Es una Escritura marcada,",
                            "verse 83:21": "que verán con sus propios ojos los allegados.",
                            "verse 83:22": "Sí, los justos estarán en delicia,",
                            "verse 83:23": "en sofás, observando.",
                            "verse 83:24": "Se reconocerá en sus rostros el brillo de la delicia.",
                            "verse 83:25": "Se les dará de beber un vino generoso y sellado,",
                            "verse 83:26": "con un dejo de almizcle -¡que lo codicien los codiciosos!-,",
                            "verse 83:27": "mezclado con agua de Tasnim,",
                            "verse 83:28": "fuente de la que beberán los allegados.",
                            "verse 83:29": "Los pecadores se reían de los creyentes.",
                            "verse 83:30": "Cuando pasaban junto a ellos, se guiñaban el ojo,",
                            "verse 83:31": "cuando regresaban a los suyos, regresaban burlándose,",
                            "verse 83:32": "cuando les veían, decían: «¡Sí, están extraviados!»",
                            "verse 83:33": "Pero no han sido enviados para velar por ellos.",
                            "verse 83:34": "Ese día, los creyentes se reirán de los infieles,",
                            "verse 83:35": "en sofás, observando.",
                            "verse 83:36": "¿No han sido retribuidos los infieles según sus obras?"
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "அளவு (எடையில்) மோசம் செய்பவர்களுக்கு கேடுதான்.",
                            "verse 83:2": "அவர்கள் மனிதர்களிடமிருந்து அளந்து வாங்கும் போது நிறைவாக அளந்து வாங்குகின்றனர்.",
                            "verse 83:3": "ஆனால், அவர்கள் அளந்தோ, நிறுத்தோ கொடுக்கும்போது குறை(த்து நஷ்டமுண்டா)க்குகிறார்கள்.",
                            "verse 83:4": "நிச்சயமாக அவர்கள் எழுப்பப்படுபவர்களென்பதை அவர்கள் கருத்தில் கொள்ளவில்லையா?",
                            "verse 83:5": "மகத்தான ஒரு நாளுக்காக,",
                            "verse 83:6": "அகிலத்தாரின் இறைவன் முன் மனிதர்கள் நிற்கும் நாள்-",
                            "verse 83:7": "ஆகவே, நிச்சயமாக தீயோர்களின் பதிவேடு ஸிஜ்ஜீனில் இருக்கிறது",
                            "verse 83:8": "'ஸிஜ்ஜீன்' என்பது என்னவென்று உமக்கு எது அறிவிக்கும்?",
                            "verse 83:9": "அது (செயல்கள்) எழுதப்பட்ட ஏடாகும்.",
                            "verse 83:10": "பொய்ப்பிப்பவர்களுக்கு அந்நாளில் கேடுதான்.",
                            "verse 83:11": "அவர்கள் நியாயத் தீர்ப்பு நாளையும் பொய்ப்பிக்கிறார்கள்.",
                            "verse 83:12": "வரம்பு மீறிய, பெரும் பாவியைத் தவிர வேறெவரும் அதைப் பொய்ப்பிக்க மாட்டார்.",
                            "verse 83:13": "நம்முடைய வசனங்கள் அவனுக்கு ஓதிக் காண்பிக்கப்பட்டால், \"அவை முன்னோர்களின் கட்டுக் கதைகளே\" என்று கூறுகின்றான்.",
                            "verse 83:14": "அப்படியல்ல: அவர்கள் சம்பாதித்துக் கொண்டிருந்தவை அவர்களுடைய இருதயங்கள் மீது துருவாகப் படிந்து விட்டன.",
                            "verse 83:15": "(தீர்ப்புக்குரிய) அந்நாளில் அவர்கள் தங்கள் இறைவனை விட்டும் திரையிடப்பட்டவர்களாவார்கள்.",
                            "verse 83:16": "பின்னர் நிச்சயமாக அவர்கள் நரகில் புகுவார்கள்.",
                            "verse 83:17": "\"எதை நீங்கள் பொய்ப்பித்துக் கொண்டு இருந்தீர்களோ, அதுதான் இது\" என்று பின் அவர்களுக்குச் சொல்லப்படும்.",
                            "verse 83:18": "நிச்சயமாக நல்லோர்களின் பதிவேடும் \"இல்லிய்யீ\"னில் இருக்கிறது.",
                            "verse 83:19": "\"இல்லிய்யுன்' என்பது என்னவென்று உமக்கு எது அறிவிக்கும்?",
                            "verse 83:20": "(அது) செயல்கள் எழுதப்பட்ட ஏடாகும்.",
                            "verse 83:21": "(அல்லாஹ்விடம்) நெருங்கிய (கண்ணியம் மிக்க வான)வர்கள் அதை பார்ப்பார்கள்.",
                            "verse 83:22": "நிச்சயமாக அப்ரார்கள் (நல்லவர்கள்) 'நயீம்' என்னும் சுவர்க்கத்தில் இருப்பார்கள்.",
                            "verse 83:23": "ஆசனங்களில் அமர்ந்து (சுவர்க்கக் காட்சிகளைப்) பார்ப்பார்கள்.",
                            "verse 83:24": "அவர்களுடைய முகங்களிலிருந்தே (அவர்களுக்குக் கிட்டிய) பாக்கியத்தின் செழுமையை நீர் அறிவீர்.",
                            "verse 83:25": "(பரிசுத்த) முத்திரையிடப்பட்ட தெளிவான (போதையோ, களங்கமோ அற்ற) மதுவிலிருந்து அவர்கள் புகட்டப்படுவார்கள்.",
                            "verse 83:26": "அதன் முத்திரை கஸ்தூரியாகும், எனவே (அதற்காக) ஆர்வம் கொள்பவர்கள், (அதைப் பெற்றுக் கொள்வதற்கான நல்ல அமல்களில்) ஆர்வம் கொள்ளட்டும்.",
                            "verse 83:27": "இன்னும், அதனுடைய கலவை தஸ்னீமில் நின்றுள்ளதாகும்.",
                            "verse 83:28": "அது (தஸ்னீம், ஓர் இனிய) நீர்ச்சுனையாகும்.",
                            "verse 83:29": "நிச்சயமாக, குற்றமிழைத்தார்களே அவர்கள், ஈமான் கொண்டவர்களைப் பார்த்து (உலகில்) சிரித்துக் கொண்டிருந்தார்கள்.",
                            "verse 83:30": "அன்றியும், அவர்கள் அண்மையில் சென்றால், (ஏளனமாக) ஒருவருக்கொருவர் கண்சாடை செய்துகொள்வார்கள்.",
                            "verse 83:31": "இன்னும் அவர்கள் தம் குடும்பத்தார்பால் திரும்பிச் சென்றாலும், (தாங்கள் செய்தது பற்றி) மகிழ்வுடனேயே திரும்பிச் செல்வார்கள்.",
                            "verse 83:32": "மேலும் அவர்கள் (முஃமின்களைப்) பார்த்தால், \"நிச்சமயாக இவர்களே வழி தவறியவர்கள்\" என்றும் கூறுவார்கள்.",
                            "verse 83:33": "(முஃமின்களின் மீது) அவர்கள் பாதுகாவலர்களாக அனுப்பப்படவில்லையே!",
                            "verse 83:34": "ஆனால் (மறுமை) நாளில் ஈமான் கொண்டவர்கள் காஃபிர்களைப் பார்த்து சிரிப்பார்கள்.",
                            "verse 83:35": "ஆசனங்களில் அமர்ந்து (அவர்கள் நிலையைப்) பார்ப்பார்கள்.",
                            "verse 83:36": "காஃபிர்களுக்கு, அவர்கள் செய்து கொண்டிருந்தவற்றுக்கு தக்க கூலி கொடுக்கப்பட்டதா? (என்றும் கேட்கப்படும்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "ความหายนะจงประสบแด่บรรดาผู้ทำให้พร่อง (ในการตวงและการชั่ง)",
                            "verse 83:2": "คือบรรดาผู้ที่เมื่อพวกเขาตวงเอาจากคนอื่นก็ตวงเอาเต็ม",
                            "verse 83:3": "และเมื่อพวกเขาตวงหรือชั่งให้คนอื่นก็ทำให้ขาด",
                            "verse 83:4": "ชนเหล่านั้นมิได้คิดบ้างหรือว่าพวกเขาจะถูกให้ฟื้นคืนชีพ",
                            "verse 83:5": "สำหรับวันอันยิ่งใหญ่",
                            "verse 83:6": "วันที่มนุษย์จะยืนต่อหน้าพระเจ้าแห่งสากลโลก",
                            "verse 83:7": "มิใช่เช่นนั้น แท้จริงบันทึกของบรรดาคนชั่วนั้นอยู่ในสิจญีน",
                            "verse 83:8": "และอันใดเล่าทำให้เจ้ารู้ได้ว่าสิจญีนนั้นคืออะไร?",
                            "verse 83:9": "คือบันทึกที่ถูกจารึกไว้",
                            "verse 83:10": "ความหายนะในวันนั้นจงประสบแด่บรรดาผู้ปฏิเสธ",
                            "verse 83:11": "คือบรรดาผู้ปฏิเสธวันแห่งการตอบแทน",
                            "verse 83:12": "และไม่ไม่ใครปฏิเสธวันแห่งการตอบแทนนั้น นอกจากทุกคนที่ละเมิดที่กระทำความผิด",
                            "verse 83:13": "เมื่อบรรดาอายาตของเราถูกอ่านแก่เขา เขาจะกล่าวว่านี่คือนิยายเหลวไหวสมัยก่อน",
                            "verse 83:14": "มิใช่เช่นนั้น แต่ว่าสิ่งที่พวกเขาได้ขวนขวายไว้นั้นได้เป็นสนิมบนหัวใจของพวกเขา",
                            "verse 83:15": "มิใช่เช่นนั้น แท้จริงพวกเขาในวันนั้นจะถูกกั้นจากพระเจ้าของพวกเขา",
                            "verse 83:16": "แล้วแท้จริงพวกเขาจะเข้าไปอยู่ในนรกที่มีเปลวไฟลุกโซน",
                            "verse 83:17": "แล้วจะมีเสียงกล่าวขึ้นว่า นี่คือสิ่งที่พวกเจ้าได้ปฏิเสธมันไว้",
                            "verse 83:18": "มิใช่เช่นนั้น แท้จริงบันทึกของบรรดาผู้ทรงคุณธรรมอยู่ในอิลลียีนอย่างแน่นอน",
                            "verse 83:19": "และอันใดเล่าทำให้เจ้ารู้ได้ว่าอิลลียีนคืออะไร",
                            "verse 83:20": "คือบันทึกที่ถูกจารึกไว้",
                            "verse 83:21": "บรรดาผู้ที่อยู่ใกล้ชิด (มลาอิกะฮ์) จะเป็นผู้ดูแลรักษา",
                            "verse 83:22": "แท้จริงบรรดาผู้ทรงคุณธรรมจะอยู่ในความโปรดปรานอย่างแน่นอน",
                            "verse 83:23": "พวกเขาจะมองดูจากบนเตียง",
                            "verse 83:24": "เจ้าจะรู้ได้ถึงการมีความสดชื่นแห่งความสุขสำราญที่ปรากฏอยู่บนใบหน้าของพวกเขา",
                            "verse 83:25": "พวกเขาจะได้ดื่มสุราอันบริสุทธิ์ ซึ่งถูกผนึกไว้",
                            "verse 83:26": "ที่ใช้ผนึกมันนั้นคือชะมดเชียง และในการนี้บรรดาผู้แข่งขัน (ที่จะให้ได้มาซึ่งความสุขสำราญนี้) จงแข่งขันกันเถิด",
                            "verse 83:27": "ที่ใช้ผสมสุรานั้นมาจากตัสนีม",
                            "verse 83:28": "คือตาน้ำแห่งหนึ่งซึ่งบรรดาผู้ใกล้ชิด (อัลลอฮ์) เท่านั้นจะได้ดื่มมัน",
                            "verse 83:29": "แท้จริงบรรดาผู้กระทำผิดนั้น เคยหัวเราะเยาะบรรดาผู้ศรัทธา",
                            "verse 83:30": "และเมื่อบรรดาผู้ศรัทธาเดินผ่านพวกเขาไป พวกเขาจะหลิ่วตาเย้ยหยัน",
                            "verse 83:31": "และเมื่อพวกเขากลับไปยังพวกพ้องของพวกเขา พวกเขาก็กลับไปอย่างตลกคะนอง",
                            "verse 83:32": "และเมื่อพวกเขาเห็นบรรดาผู้ศรัทธาพวกเขาก็กล่าวว่า แท้จริงชนเหล่านี้เป็นผู้หลงทางแน่นอน",
                            "verse 83:33": "และพวกเขา (ผู้ปฏิเสธศรัทธา) มิได้ถูกส่งมาเพื่อเป็นผู้ปกปักรักษาผู้ศรัทธาเหล่านั้น",
                            "verse 83:34": "ดังนั้น วันนี้บรรดาผู้ศรัทธาก็จะหัวเราะเยาะพวกปฏิเสธศรัทธาบ้าง",
                            "verse 83:35": "พวกเขา (บรรดาผู้ศรัทธา) จะมองดูอยู่บนเตียง",
                            "verse 83:36": "บรรดาผู้ปฏิเสธจะได้รับการตอบแทนตามที่ได้ปฏิบัติมามิใช่หรือ"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Eksik ölçüp noksan yapan hilekârlara yazıklar olsun!",
                            "verse 83:2": "Onlar insanlardan alırken ölçüp tarttıklarında tam, 3.",
                            "verse 83:3": "Onlar düşünmezler mi ki, tekrar diriltilecekler!",
                            "verse 83:4": "Büyük",
                            "verse 83:5": "bir günde",
                            "verse 83:6": "Öyle",
                            "verse 83:7": "bir gün ki, insanlar o günde âlemlerin Rabbinin huzurunda divan duracaklardır.",
                            "verse 83:8": "Doğrusu günahkârların yazısı, muhakkak Siccîn'de olmaktır.",
                            "verse 83:9": "Siccîn nedir, bilir misin?",
                            "verse 83:10": "(O günahkârların yazısı) Amellerin sayılıp yazıldığı bir kitaptır.",
                            "verse 83:11": "O gün vay haline yalancıların!",
                            "verse 83:12": "Ki onlar, ceza gününü yalan sayarlar.",
                            "verse 83:13": "Onu ancak hükümleri çiğneyen ve günaha dalan kimseler yalanlar.",
                            "verse 83:14": "Böyle birine âyetlerimiz okununca \"Eskilerin masalları\" derdi.",
                            "verse 83:15": "Hayır! Bilakis onların işlemekte oldukları (kötülükler) kalplerini kirletmiştir.",
                            "verse 83:16": "Hayır! Onlar şüphesiz o gün Rablerinden (O'nu görmekten) mahrum kalmışlardır.",
                            "verse 83:17": "Sonra onlar cehenneme girerler.",
                            "verse 83:18": "Sonra onlara: \"İşte yalanlamış olduğunuz (cehennem) budur\" denilir.",
                            "verse 83:19": "Hayır! Andolsun iyilerin kitabı İlliyyûn'dadır.",
                            "verse 83:20": "İlliyyûn nedir, bilir misin?",
                            "verse 83:21": "(O İlliyyûn'daki kitap) İçinde ameller kaydedilmiş bir kitaptır.",
                            "verse 83:22": "O kitabı, Allah'a yakın olanlar görür.",
                            "verse 83:23": "İyiler kesinkes cennettedir.",
                            "verse 83:24": "Onlar orada koltuklar üzerinde etrafa bakarlar.",
                            "verse 83:25": "Onların yüzünde nimetlerin sevincini görürsün.",
                            "verse 83:26": "Kendilerine mühürlü hâlis bir içki sunulur.",
                            "verse 83:27": "Onun içiminin sonunda misk kokusu vardır.",
                            "verse 83:28": "Karışımı Tesnîm'dendir.",
                            "verse 83:29": "(O Tesnîm Allah'a) Yakın olanların içecekleri bir kaynaktır.",
                            "verse 83:30": "Şüphesiz günahkârlar, (dünyada) iman edenlere gülerlerdi.",
                            "verse 83:31": "Onlarla karşılaştıklarında kaş göz hareketiyle alay ederlerdi.",
                            "verse 83:32": "Ailelerine döndüklerinde, (alaylarından dolayı) keyiflenerek dönerlerdi.",
                            "verse 83:33": "Müminleri gördüklerinde: \"Şüphesiz bunlar sapıtmış\" derlerdi.",
                            "verse 83:34": "Halbuki onlar, müminleri denetleyici olarak gönderilmediler.",
                            "verse 83:35": "İşte o gün (ahirette) de iman edenler kâfirlere gülerler.",
                            "verse 83:36": "Koltuklar üzerinde etrafa bakarlar.",
                            "verse 83:37": "Kâfirler yaptıklarının cezasını bulduar mı! (Elbette buldular)."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "ناپ اور تول میں کمی کرنے والوں کے لیے خرابی ہے",
                            "verse 83:2": "بربادي ہے ناپ تول ميں کمي کرنے والوں کے لئےo",
                            "verse 83:3": "يہ لوگ جب (دوسرے) لوگوں سے ناپ ليتے ہيں تو (ان سے) پورا ليتے ہيںo",
                            "verse 83:4": "جو لوگوں سے ناپ کر لیں تو پورا لیں",
                            "verse 83:5": "اور جب ان کو ناپ کر یا تول کر دیں تو کم کر دیں",
                            "verse 83:6": "اور جب انہيں (خود) ناپ کر يا تول کر ديتے ہيں تو گھٹا کر ديتے ہيںo",
                            "verse 83:7": "کيا يہ لوگ اس بات کا يقين نہيں رکھتے کہ وہ (مرنے کے بعد دوبارہ) اٹھائے جائيں گےo",
                            "verse 83:8": "کیا یہ لوگ نہیں جانتے کہ اٹھائے بھی جائیں گے",
                            "verse 83:9": "(یعنی) ایک بڑے (سخت) دن میں",
                            "verse 83:10": "ايک بڑے سخت دن کے لئےo",
                            "verse 83:11": "جس دن سب لوگ تمام جہانوں کے رب کے حضور کھڑے ہوں گےo",
                            "verse 83:12": "جس دن (تمام) لوگ رب العالمین کے سامنے کھڑے ہوں گے",
                            "verse 83:13": "سن رکھو کہ بدکارروں کے اعمال سجّین میں ہیں",
                            "verse 83:14": "يہ حق ہے کہ بدکرداروں کا نام? اعمال سجين (يعني ديوان خان? جہنم) ميں ہےo",
                            "verse 83:15": "اور آپ نے کيا جانا کہ سجين کيا ہےo",
                            "verse 83:16": "اور تم کیا جانتے ہوں کہ سجّین کیا چیز ہے؟",
                            "verse 83:17": "ایک دفتر ہیکھلا ہوا",
                            "verse 83:18": "(يہ قيد خان? دوزخ ميں اس بڑے ديوان کے اندر) لکھي ہوئي (ايک) کتاب ہے (جس ميں ہر جہنمي کا نام اور اس کے اعمال درج ہيں)o",
                            "verse 83:19": "اس دن جھٹلانے والوں کے لئے تباہي ہوگيo",
                            "verse 83:20": "اس دن جھٹلانے والوں کی خرابی ہے",
                            "verse 83:21": "(یعنی) جو انصاف کے دن کو جھٹلاتے ہیں",
                            "verse 83:22": "جو لوگ روزِ جزا کو جھٹلاتے ہيںo",
                            "verse 83:23": "اور اسے کوئي نہيں جھٹلاتا سوائے ہر اس شخص کے جو سرکش و گنہگار ہےo",
                            "verse 83:24": "اور اس کو جھٹلاتا وہی ہے جو حد سے نکل جانے والا گنہگار ہے",
                            "verse 83:25": "جب اس کو ہماری آیتیں سنائی جاتی ہیں تو کہتا ہے کہ یہ تو اگلے لوگوں کے افسانے ہیں",
                            "verse 83:26": "جب اس پر ہماري آيتيں پڑھ کر سنائي جاتي ہيں تو کہتا (يا سمجھتا) ہے کہ (يہ تو) اگلے لوگوں کي کہانياں ہيںo",
                            "verse 83:27": "(ايسا) ہرگز نہيں بلکہ (حقيقت يہ ہے کہ) ان کے دلوں پر ان اَعمالِ (بد) کا زنگ چڑھ گيا ہے جو وہ کمايا کرتے تھے (اس ليے آيتيں ان کے دل پر اثر نہيں کرتيں)o",
                            "verse 83:28": "دیکھو یہ جو (اعمال بد) کرتے ہیں ان کا ان کے دلوں پر زنگ بیٹھ گیا ہے",
                            "verse 83:29": "بیشک یہ لوگ اس روز اپنے پروردگار (کے دیدار) سے اوٹ میں ہوں گے",
                            "verse 83:30": "حق يہ ہے کہ بيشک اس دن انہيں اپنے ر ب کے ديدار سے (محروم کرنے کے لئے) پسِ پردہ کر ديا جائے گاo",
                            "verse 83:31": "پھر وہ دوزخ ميں جھونک ديئے جائيں گےo",
                            "verse 83:32": "پھر دوزخ میں جا داخل ہوں گے",
                            "verse 83:33": "پھر ان سے کہا جائے گا کہ یہ وہی چیز ہے جس کو تم جھٹلاتے تھے",
                            "verse 83:34": "پھر ان سے کہا جائے گا: يہ وہ (عذابِ جہنم) ہے جسے تم جھٹلايا کرتے تھےo",
                            "verse 83:35": "يہ (بھي) حق ہے کہ بيشک نيکوکاروں کا نوشتہ اعمال علّيّين (يعني ديوان خان? جنت) ميں ہےo",
                            "verse 83:36": "(یہ بھی) سن رکھو کہ نیکوکاروں کے اعمال علیین میں ہیں",
                            "verse 83:37": "اور تم کو کیا معلوم کہ علیین کیا چیز ہے؟",
                            "verse 83:38": "اور آپ نے کيا جانا کہ علّيّين کيا ہےo",
                            "verse 83:39": "(يہ جنت کے اعلي? درجہ ميں اس بڑے ديوان کے اندر) لکھي ہوئي (ايک) کتاب ہے (جس ميں ان جنتيوں کے نام اور اَعمال درج ہيں جنہيں اعلي? مقامات دئيے جائيں گے)o",
                            "verse 83:40": "ایک دفتر ہے لکھا ہوا",
                            "verse 83:41": "جس کے پاس مقرب (فرشتے) حاضر رہتے ہیں",
                            "verse 83:42": "اس جگہ (اللہ کے) مقرب فرشتے حاضر رہتے ہيںo",
                            "verse 83:43": "بيشک نيکوکار (راحت و مسرت سے) نعمتوں والي جنت ميں ہوں گےo",
                            "verse 83:44": "بیشک نیک لوگ چین میں ہوں گے",
                            "verse 83:45": "تختوں پر بیٹھے ہوئے نظارے کریں گے",
                            "verse 83:46": "تختوں پر بيٹھے نظارے کر رہے ہوں گےo",
                            "verse 83:47": "آپ ان کے چہروں سے ہي نعمت و راحت کي رونق اور شگفتگي معلوم کر ليں گےo",
                            "verse 83:48": "تم ان کے چہروں ہی سے راحت کی تازگی معلوم کر لو گے",
                            "verse 83:49": "ان کو خالص شراب سربمہر پلائی جائے گی",
                            "verse 83:50": "انہيں سر بہ مہر بڑي لذيذ شرابِ طہور پلائي جائے گيo",
                            "verse 83:51": "اس کي مُہر کستوري کي ہوگي، اور (يہي وہ شراب ہے) جس کے حصول ميں شائقين کو جلد کوشش کر کے سبقت ليني چاہيے (کوئي شرابِ نعمت کا طالب و شائق ہے، کوئي شرابِ قربت کا اور کوئي شرابِ ديدار کا? ہر کسي کو اس کے شوق کے مطابق پلائي جائے گي)o",
                            "verse 83:52": "جس کی مہر مشک کی ہو گی تو (نعمتوں کے) شائقین کو چاہیے کہ اسی سے رغبت کریں",
                            "verse 83:53": "اور اس میں تسنیم (کے پانی) کی آمیزش ہو گی",
                            "verse 83:54": "اور اس (شراب) ميں آبِ تسنيم کي آميزش ہوگيo",
                            "verse 83:55": "(يہ تسنيم) ايک چشمہ ہے جہاں سے صرف اہلِ قربت پيتے ہيںo",
                            "verse 83:56": "وہ ایک چشمہ ہے جس میں سے (خدا کے) مقرب پیئیں گے",
                            "verse 83:57": "جو گنہگار (یعنی کفار) ہیں وہ (دنیا میں) مومنوں سے ہنسی کیا کرتے تھے",
                            "verse 83:58": "بيشک مجرم لوگ ايمان والوں کا (دنيا ميں) مذاق اڑايا کرتے تھےo",
                            "verse 83:59": "اور جب ان کے پاس سے گزرتے تو آپس ميں آنکھوں سے اشارہ بازي کرتے تھےo",
                            "verse 83:60": "اور جب ان کے پاس سے گزرتے تو حقارت سے اشارے کرتے",
                            "verse 83:61": "اور جب اپنے گھر کو لوٹتے تو اتراتے ہوئے لوٹتے",
                            "verse 83:62": "اور جب اپنے گھر والوں کي طرف لوٹتے تو (مومنوں کي تنگ دستي اور اپني خوش حالي کا موازنہ کر کے) اِتراتے اور دل لگي کرتے ہوئے پلٹتے تھےo",
                            "verse 83:63": "اور جب يہ (مغرور لوگ) ان (کمزور حال مومنوں) کو ديکھتے تو کہتے: يقيناً يہ لوگ راہ سے بھٹک گئے ہيں (يعني يہ دنيا گنوا بيٹھے ہيں اور آخرت تو ہے ہي فقط افسانہ)o",
                            "verse 83:64": "اور جب ان( مومنوں) کو دیکھتے تو کہتے کہ یہ تو گمراہ ہیں",
                            "verse 83:65": "حالانکہ وہ ان پر نگراں بنا کر نہیں بھیجے گئے تھے",
                            "verse 83:66": "حالانکہ وہ ان (کے حال) پر نگہبان بنا کر نہيں بھيجے گئے تھےo",
                            "verse 83:67": "پس آج (ديکھو) اہلِ ايمان کافروں پر ہنس رہے ہيںo",
                            "verse 83:68": "تو آج مومن کافروں سے ہنسی کریں گے",
                            "verse 83:69": "(اور) تختوں پر (بیٹھے ہوئے ان کا حال) دیکھ رہے ہوں گے",
                            "verse 83:70": "سجے ہوئے تختوں پر بيٹھے (اپني خوش حالي اور کافروں کي بدحالي کا) نظارہ کر رہے ہيںo",
                            "verse 83:71": "سو کيا کافروں کو اس (مذاق) کا پورا بدلہ دے ديا گيا جو وہ (مسلمانوں سے) کيا کرتے تھےo",
                            "verse 83:72": "تو کافروں کو ان کے عملوں کا (پورا پورا )بدلہ مل گیا تھےo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 83:1": "Вайл (вой) бўлсин, ўлчовдан уриб қолувчиларга.",
                            "verse 83:2": "Улар одамлардан нарса ўлчаб олсалар, тўлиқ оларлар.",
                            "verse 83:3": "Ва агар одамларга ўлчаб ёки тортиб берсалар, камайтирарлар.",
                            "verse 83:4": "Ана шулар, албатта, қайта тирилтирилишларини ўйламайдиларми?",
                            "verse 83:5": "Улуғ бир кунда.",
                            "verse 83:6": "У кунда, одамлар оламлар Роббиси ҳузурида тик турарлар.",
                            "verse 83:7": "Йўқ! Албатта фожирларларнинг китоби «сижжин»дадир.",
                            "verse 83:8": "«Сижжин» қандай нарса эканини сенга нима билдирди?! (Сижжин нима эканини қаердан ҳам билардинг, унинг моҳияти шундоқ каттаки, сен уни идрок эта олмайсан.",
                            "verse 83:9": "У ёзилган китобдур.",
                            "verse 83:10": "Ўша кунда ёлғонга чиқарувчиларга вайл бўлсин!",
                            "verse 83:11": "Улар жазо кунини ёлғонга чиқарарлар.",
                            "verse 83:12": "У кунни ҳаддан ошувчи ва ўта гуноҳкорлардан бошқалар ёлғонга чиқармаслар.",
                            "verse 83:13": "Қачон унга оятларимиз тиловат қилинса, «авалгиларнинг афсоналари», дер.",
                            "verse 83:14": "Йўқ! Уларнинг қилган касблари қалбларига моғор бўлиб ўрнашиб қолган, холос.",
                            "verse 83:15": "Йўқ! Албатта, улар ўша кунда ўз Роббиларини кўришдан тўсиларлар.",
                            "verse 83:16": "Сўнгра улар албатта жаҳиймга кирувчидирлар.",
                            "verse 83:17": "Сўнгра, мана бу, сизлар ёлғонга чиқариб юрган нарса, дейилар.",
                            "verse 83:18": "Йўқ! Албатта аброрларнинг китоби «Иллиййун»дадир.",
                            "verse 83:19": "«Иллиййун» қандоқ нарса эканини сенга нима билдирди?!",
                            "verse 83:20": "У ёзилган китобдур.",
                            "verse 83:21": "Унга муқарраб(фаришта)лар шоҳид бўларлар.",
                            "verse 83:22": "Албатта, аброрлар жаннати найимдадирлар.",
                            "verse 83:23": "Пардали баланд сўрилар устида назар солиб турарлар.",
                            "verse 83:24": "Уларнинг чеҳраларидан жаннат равнақини билиб оларсан.",
                            "verse 83:25": "Улар муҳрланган, ниҳоятда пок, шаробдан ичарлар.",
                            "verse 83:26": "У(шароб)нинг хотимаси мискдир.",
                            "verse 83:27": "У(шароб)нинг аралашмаси «тасним»дандир.",
                            "verse 83:28": "У(Тасним) бир булоқдирки, ундан муқарраблар ичарлар.",
                            "verse 83:29": "Албатта жиноят қилганлар иймон келтирганлар устидан кулар эдилар.",
                            "verse 83:30": "Агар ул(мўмин)лар аларнинг ёнидан ўтсалар, масхаралаб, ишоралар қила эдилар.",
                            "verse 83:31": "Агар у(кофир)лар ўз аҳллари ҳузурига қайтиб борсалар, ҳузурланиб қайтиб борар эдилар.",
                            "verse 83:32": "Ва агар у(мўмин)ларни кўрсалар, «албатта ановилар адашганлар», дер эдилар.",
                            "verse 83:33": "Ҳолбуки, улар а(мўмин)лар устидан кузатувчи қилиб юборилган эмаслар!",
                            "verse 83:34": "Энди, бу Кунда иймон келтирганлар кофирлар устидан куларлар.",
                            "verse 83:35": "Пардали, баланд сўрилар устида назар солиб турарлар.",
                            "verse 83:36": "Кофирлар қилган ишларининг «савобини» олар миканлар?! турарлар."
                        }
                    }
                }
            }
        }
    }
}