{
    "surah_name": "Al-Bayyinah",
    "surah_name_ar": "البينة",
    "verses": {
        "languages": {
            "albanian": {
                "translators": {
                    "1": {
                        "Efendi Nahi": {
                            "verse 98:1": "Nuk u larguan nga feja e tyre – mohuesit, që ishin nga idhtarët e Librit, si dhe paganët, deri sa ju erdhi argumenti i qartë:",
                            "verse 98:2": "Pejgamberi nga Perëndia, i cili lexon broshurat e pastra (nga gabimet),",
                            "verse 98:3": "në të cilat ka kapituj me dispozita të çmueshme.",
                            "verse 98:4": "E u ndanë (nuk u pajtuan) ata që patën Librin, vetëm atëherë kur u erdhi argumenti i qartë,",
                            "verse 98:5": "e janë urdhëruar ata që t’i luten vetëm Perëndisë, që sinqerisht, si besimtarë të vërtetë, të predikojnë fenë dhe të bëjnë namaz, dhe të ndajnë lëmoshën (zeqatin); e kjo është feja e drejtë.",
                            "verse 98:6": "Ata që nuk besojnë, si ata që patën Libër ashtu edhe paganët, ata, me siguri do të gjenden në zjarrin e skëterrës, në te do të mbeten përherë, ata janë krijesat më të këqia.",
                            "verse 98:7": "E, me të vërtetë, ata që besojnë dhe punojnë vepra të mira – ata janë krijesat më të mira,",
                            "verse 98:8": "shpërblimi i tyre te Zoti i tyre janë kopshtet (xhennetet) e Adnit, nëpër të cilat rrjedhin lumenjt ku do të banojnë përherë dhe përgjithmonë."
                        }
                    }
                }
            },
            "azerbaijani": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Kitab əhlindən (yəhudilərdən və xaçpərəstlərdən) kafir olanlar və müşriklər özlərinə açıq-aşkar bir dəlil gəlməyənə qədər (dinlərindən) ayrılan deyildilər.",
                            "verse 98:2": "(Bu açıq-aşkar dəlil isə) pak səhifələri onlara oxuyan, Allah tərəfindən göndərilmiş peyğəmbərdir (Muhəmməd əleyhissəlamdır).",
                            "verse 98:3": "O səhifələrdə doğru-dürüst hökmlər vardır.",
                            "verse 98:4": "Kitab əhli yalnız özlərinə açıq-aydın dəlil (Peyğəmbər və Qur'an) gəldikdən sonra (dində) ayrılığa düşdülər (onlardan kimisi Peyğəmbərə iman gətirdi, kimisi onu inkar etdi, kimisi də şəkk-şübhə içində qaldı).",
                            "verse 98:5": "Halbuki onlara əmr edilmişdir ki, Allaha - dini yalnız Ona məxsus edərək, batildən haqqa (islama) dönərək - ibadət etsinlər, namaz qılıb zəkat versinlər.",
                            "verse 98:6": "Həqiqətən, kitab əhlindən kafir olanların və müşriklərin yeri cəhənnəm odudur.",
                            "verse 98:7": "İman gətirib yaxşı əməllər edənlər isə yaradılmışların ən yaxşılarıdır.",
                            "verse 98:8": "Onlardan öz Rəbbi yanındakı mükafatı (ağacları) altından çaylar axan Ədn cənnətləridir."
                        }
                    }
                }
            },
            "bosnian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Nisu se nevjernici između sljedbenika Knjige i mnogobošci odvojili, sve dok im nije došao dokaz jasni;",
                            "verse 98:2": "od Allaha Poslanik, koji čita listove čiste,",
                            "verse 98:3": "u kojima su propisi ispravni.",
                            "verse 98:4": "A podvojili su se oni kojima je data Knjiga baš onda kada im je došao dokaz jasni,",
                            "verse 98:5": "a naređeno im je da se samo Allahu klanjaju, da Mu iskreno, kao pravovjerni, vjeru ispovijedaju, i da molitvu obavljaju, i da milostinju udjeljuju; a to je - ispravna vjera.",
                            "verse 98:6": "Oni koji ne vjeruju između sljedbenika Knjige i mnogobošci biće, sigurno, u vatri džehennemskoj, u njoj će vječno ostati; oni su najgora stvorenja.",
                            "verse 98:7": "A oni koji vjeruju i čine dobra djela - oni su, zbilja, najbolja stvorenja,",
                            "verse 98:8": "njih nagrada u Gospodara njihova čeka; edenski vrtovi kroz koji će rijeke teći, u kojima će vječno i zauvijek boraviti; Allah će biti njima zadovoljan, a i oni će biti Njime zadovoljni."
                        }
                    }
                }
            },
            "bengali": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "আহলে-কিতাব ও মুশরেকদের মধ্যে যারা কাফের ছিল, তারা প্রত্যাবর্তন করত না যতক্ষণ না তাদের কাছে সুস্পষ্ট প্রমাণ আসত।",
                            "verse 98:2": "অর্থাৎ আল্লাহর একজন রসূল, যিনি আবৃত্তি করতেন পবিত্র সহীফা,",
                            "verse 98:3": "যাতে আছে, সঠিক বিষয়বস্তু।",
                            "verse 98:4": "অপর কিতাব প্রাপ্তরা যে বিভ্রান্ত হয়েছে, তা হয়েছে তাদের কাছে সুস্পষ্ট প্রমাণ আসার পরেই।",
                            "verse 98:5": "তাদেরকে এছাড়া কোন নির্দেশ করা হয়নি যে, তারা খাঁটি মনে একনিষ্ঠভাবে আল্লাহর এবাদত করবে, নামায কায়েম করবে এবং যাকাত দেবে। এটাই সঠিক ধর্ম।",
                            "verse 98:6": "আহলে-কিতাব ও মুশরেকদের মধ্যে যারা কাফের, তারা জাহান্নামের আগুনে স্থায়ীভাবে থাকবে। তারাই সৃষ্টির অধম।",
                            "verse 98:7": "যারা ঈমান আনে ও সৎকর্ম করে, তারাই সৃষ্টির সেরা।",
                            "verse 98:8": "তাদের পালনকর্তার কাছে রয়েছে তাদের প্রতিদান চিরকাল বসবাসের জান্নাত, যার তলদেশে নির্ঝরিণী প্রবাহিত। তারা সেখানে থাকবে অনন্তকাল। আল্লাহ তাদের প্রতি সন্তুষ্ট এবং তারা আল্লাহর প্রতি সন্তুষ্ট। এটা তার জন্যে, যে তার পালনকর্তাকে ভয় কর। সেরা।"
                        }
                    }
                }
            },
            "bulgarian": {
                "translators": {
                    "1": {
                        "Tzvetan Theophanov": {
                            "verse 98:1": "Онези от хората на Писанието и съдружаващите, които не вярваха, не се разделиха [с неверието си], докато при тях не дойде ясният знак -",
                            "verse 98:2": "Пратеник от Аллах, четящ пречистени свитъци [от Корана],",
                            "verse 98:3": "в които има правдиви писания.",
                            "verse 98:4": "И дарените с Писанието се разединиха едва след като при тях дойде ясният знак.",
                            "verse 98:5": "И бе им повелено да се прекланят единствено пред Аллах, предани Нему в религията, правоверни, и да отслужват молитвата, и да дават милостинята закат.",
                            "verse 98:6": "Онези от хората на Писанието и от съдружаващите, които не вярваха, ще бъдат в Огъня на Ада, там ще пребивават вечно.",
                            "verse 98:7": "Онези, които вярват и вършат праведни дела, те са най-добрите от творенията.",
                            "verse 98:8": "Въздаянието им при техния Господ ще са Градините на Адн, сред които реки текат, там ще пребивават вечно и завинаги."
                        }
                    }
                }
            },
            "chinese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "信奉天經者和以物配主者，他們中不信道的人沒有離開自己原有的信仰，直到明証來臨他們。",
                            "verse 98:2": "那個明証是真主所派遣的一個使者，他誦讀純潔的冊頁，",
                            "verse 98:3": "其中有許多正確的經文。",
                            "verse 98:4": "信奉天經者，沒有分離，直到明証來臨他們。",
                            "verse 98:5": "他們只奉命崇拜真主，虔誠敬意，恪遵正教，謹守拜功，完納天課，這是正教。",
                            "verse 98:6": "信奉天經者和以物配主者，他們中不信道的人，必入火獄，而永居其中；這等人是最惡的人。",
                            "verse 98:7": "信道而行善的人，是最善的人，",
                            "verse 98:8": "他們在他們的主那裡的報酬是下臨諸河的常住的樂園，他們將永居其中，真主喜悅他們，他們也喜悅他；這是畏懼真主者所有的。 信道而行善的人，是最善的人，"
                        }
                    }
                }
            },
            "czech": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Ti, kdož z vlastníků Písma a z modloslužebníků jsou nevěřícími, se nezačali uvolňovat, pokud k nim nepřišel důkaz jasný,",
                            "verse 98:2": "posel od Boha, jenž přednášel jim listy očištěné,",
                            "verse 98:3": "obsahující Písmo nezměnitelné.",
                            "verse 98:4": "A nerozdělili se ti, jimž bylo dáno Písmo, leč až poté, co k nim přišel důkaz jasný.",
                            "verse 98:5": "A přitom jim bylo pouze poručeno, aby uctívali Boha, zasvěcujíce mu upřímně svou víru jako hanífové, aby dodržovali modlitbu a dávali almužnu - a toto je náboženství neměnné.",
                            "verse 98:6": "A věru ti, kdož jsou nevěřící z vlastníků Písma a z modloslužebníků, přijdou do ohně pekelného a budou v něm nesmrtelní, a to jsou ti nejhorší ze všech stvoření!",
                            "verse 98:7": "Avšak ti, kdož uvěřili a zbožné skutky konali, to jsou ti nejlepší ze všech stvoření.",
                            "verse 98:8": "Odměnou jejich u Pána jejich budou zahrady Edenu, pod nimiž řeky tekou a v nichž zůstanou navěky nesmrtelní."
                        }
                    }
                }
            },
            "dutch": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "De ongelovigen onder de mensen van het Boek en onder de afgodendienaren konden niet worden bevrijd, vóórdat een duidelijk bewijs tot hen gekomen was,",
                            "verse 98:2": "Een boodschapper van God, die aan hen de zuivere bladzijden voordroeg.",
                            "verse 98:3": "Waarin alle geschriften verzameld zijn.",
                            "verse 98:4": "En de mensen van het Boek werden eerst onenig, nadat het duidelijke teken tot hen gekomen was.",
                            "verse 98:5": "En daarin werd hun slechts geboden God te aanbidden, oprecht zijnde in gehoorzaamheid jegens Hem, oprecht het gebed te onderhouden en de Zakaat te betalen.",
                            "verse 98:6": "Voorwaar, de ongelovigen onder de mensen van het Boek en de afgodendienaren zullen in het Vuur der hel geworpen worden, daarin zullen zij verblijven.",
                            "verse 98:7": "Doch zij die geloven en goede werken doen, zij zijn de beste der schepselen.",
                            "verse 98:8": "Hun beloning is bij hun Heer; tuinen der eeuwigheid waardoor rivieren stromen en waarin zij voor altijd zullen vertoeven."
                        }
                    }
                }
            },
            "english": {
                "translators": {
                    "1": {
                        "Marmaduke Pickthall": {
                            "verse 98:1": "Those who disbelieve among the People of the Scripture and the idolaters could not have left off (erring) till the clear proof came unto them,",
                            "verse 98:2": "A messenger from Allah, reading purified pages",
                            "verse 98:3": "Containing correct scriptures.",
                            "verse 98:4": "Nor were the People of the Scripture divided until after the clear proof came unto them.",
                            "verse 98:5": "And they are ordered naught else than to serve Allah, keeping religion pure for Him, as men by nature upright, and to establish worship and to pay the poor-due.",
                            "verse 98:6": "Lo! those who disbelieve, among the People of the Scripture and the idolaters, will abide in fire of hell.",
                            "verse 98:7": "(And) lo! those who believe and do good works are the best of created beings.",
                            "verse 98:8": "Their reward is with their Lord: Gardens of Eden underneath which rivers flow, wherein they dwell for ever."
                        }
                    },
                    "2": {
                        "Abdullah Yusuf Ali": {
                            "verse 98:1": "Those who reject (Truth), among the People of the Book and among the Polytheists, were not going to depart (from their ways) until there should come to them Clear Evidence,-",
                            "verse 98:2": "An apostle from God, rehearsing scriptures kept pure and holy:",
                            "verse 98:3": "Wherein are laws (or decrees) right and straight.",
                            "verse 98:4": "Nor did the People of the Book make schisms, until after there came to them Clear Evidence.",
                            "verse 98:5": "And they have been commanded no more than this: To worship God, offering Him sincere devotion, being true (in faith); to establish regular prayer; and to practise regular charity; and that is the Religion Right and Straight.",
                            "verse 98:6": "Those who reject (Truth), among the People of the Book and among the Polytheists, will be in Hell-Fire, to dwell therein (for aye).",
                            "verse 98:7": "Those who have faith and do righteous deeds,- they are the best of creatures.",
                            "verse 98:8": "Their reward is with God: Gardens of Eternity, beneath which rivers flow; they will dwell therein for ever; God well pleased with them, and they with Him: all this for such as fear their Lord and Cherisher."
                        }
                    },
                    "3": {
                        "Arthur J. Arberry": {
                            "verse 98:1": "The unbelievers of the People of the Book and the idolaters would never leave off; till the Clear Sign came to them,",
                            "verse 98:2": "a Messenger from God, reciting pages purified,",
                            "verse 98:3": "therein true Books.",
                            "verse 98:4": "And they scattered not, those that were given the Book, excepting after the Clear Sign came to them.",
                            "verse 98:5": "They were commanded only to serve God, making the religion His sincerely, men of pure faith, and to perform the prayer, and pay the alms -- that is the religion of the True.",
                            "verse 98:6": "The unbelievers of the People of the Book and the idolaters shall be in the Fire of Gehenna, therein dwelling forever; those are the worst of creatures.",
                            "verse 98:7": "But those who believe, and do righteous deeds, those are the best of creatures;",
                            "verse 98:8": "their recompense is with their Lord-Gardens of Eden, underneath which rivers flow, therein dwelling for ever and ever."
                        }
                    },
                    "4": {
                        "Muhammad Asad": {
                            "verse 98:1": "IT IS NOT",
                            "verse 98:2": "that such as are bent on denying the truth – [be they] from among the followers of earlier revelation or from among those who ascribe divinity to aught beside God – should ever be abandoned [by Him] ere there comes unto them the",
                            "verse 98:3": "evidence of the truth:",
                            "verse 98:4": "an apostle from God, conveying [unto them] revelations blest with purity,",
                            "verse 98:5": "wherein there are ordinances of ever-true soundness and clarity.",
                            "verse 98:6": "Now those who have been vouchsafed revelation aforetime did break up their unity [of faith] after such an evidence of the truth had come to them.",
                            "verse 98:7": "And withal, they were not enjoined aught but that they should worship God, sincere in their faith in Him alone, turning away from all that is false; and that they should be constant in prayer; and that they should spend in charity: for this is a moral law endowed with ever-true soundness and clarity.",
                            "verse 98:8": "Verily, those who [despite all evidence] are bent on denying the truth – [be they] from among the followers of earlier revelation or from among those who ascribe divinity to aught beside God – will find themselves in the fire of hell, therein to abide: they are the worst of all creatures.",
                            "verse 98:9": "",
                            "verse 98:10": "verily, those who have attained to faith and do righteous deeds – it is they, they who are the best of all creatures.",
                            "verse 98:11": "Their reward [awaits them] with God: gardens of perpetual bliss, through which running waters flow, therein to abide beyond the count of time; well-pleased is God with them, and well-pleased are they with Him: all this awaits him who of his Sustainer stands in awe!"
                        }
                    },
                    "5": {
                        "Martin Lings": {}
                    },
                    "6": {
                        "Mufti Muhammad Taqi Uthmani": {
                            "verse 98:1": "Those who disbelieved from among the People of the Book and the polytheists were not (expected) to desist (from their wrong beliefs) unless there comes to them a clear proof,",
                            "verse 98:2": "a messenger from Allah who recites the purified scrolls",
                            "verse 98:3": "containing (right and) straight writings.",
                            "verse 98:4": "And those who were given the Book did not disagree but after the clear proof came to them,",
                            "verse 98:5": "while they were not ordered but to worship Allah, making their submission exclusive for him with no deviation, and to establish Salāh and pay Zakāh .",
                            "verse 98:6": "Surely those who disbelieved from among the People of the Book and the polytheists will be in the fire of Jahannam , in which they will be living forever.",
                            "verse 98:7": "As for those who believed and did righteous deeds, they are the best of all human beings.",
                            "verse 98:8": "Their reward, with their Lord, is gardens of eternity beneath which rivers flow, in which they will be abiding forever."
                        }
                    },
                    "7": {
                        "Royal Aal al-Bayt Institute Translation": {
                            "verse 98:1": "The disbelievers from among the People of the Scripture and the idolaters were not going to leave off until the clear proof should come to them;",
                            "verse 98:2": "a messenger from God reciting pages purified,",
                            "verse 98:3": "wherein are upright precepts.",
                            "verse 98:4": "And those who were given the Scripture did not become divided, except after the clear proof had come to them.",
                            "verse 98:5": "And they were only commanded to worship God devoting religion purely to Him as ?an?fs and to establish prayer and pay the alms.",
                            "verse 98:6": "Truly the disbelievers from among the People of the Scripture and the idolaters shall be in the fire of Hell, to abide therein — those are the worst of creatures.",
                            "verse 98:7": "Truly those who believe and perform righteous deeds — they are the best of creatures.",
                            "verse 98:8": "Their reward with their Lord will be Gardens of Eden underneath which rivers flow, wherein they shall abide forever."
                        }
                    },
                    "8": {
                        "Recitations of Ibrahim walk from saheeh international": {
                            "verse 98:1": "The disbelievers from amongst the People of the Book and the idolaters would not desist (from disbelief) until clear proof came to them.",
                            "verse 98:2": "That (proof) is the (last) Messenger from Allah, who recites (to them) holy pages (of the Glorious Qur’an),",
                            "verse 98:3": "In which are (written) correct and firm commandments.",
                            "verse 98:4": "These People of the Book did not dissent amongst themselves (with regard to believing in the Prophethood and Messengership of the Last Messenger and recognizing his holy status), until after the clear proof (of the Prophethood of Muhammad [blessings and peace be upon him]) had come to them.",
                            "verse 98:5": "Whereas they were commanded to worship only Allah, making their Din (faith and devotion) sincerely His (dissociating from every falsehood) to establish Prayer and to pay Zakat (the Alms-due) regularly.",
                            "verse 98:6": "Indeed, those who disbelieve from amongst the People of the Book and the polytheists (all) will be (abiding) in the Fire of Hell.",
                            "verse 98:7": "Indeed, those who believe and keep doing pious actions, it is they who are the best of the creation.",
                            "verse 98:8": "Their reward is the Gardens of eternal living in the presence of their Lord, with streams flowing under them."
                        }
                    }
                }
            },
            "finnish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Uskottomat sekä Kirjoituksen saaneiden että pakanain keskuudessa eivät epäilleet, ennenkuin tuli selvä todistus,",
                            "verse 98:2": "Jumalan lähetti, joka luki heille väärentämättömät kirjoitukset,",
                            "verse 98:3": "jotka sisältävät oikeat määräykset.",
                            "verse 98:4": "Ja ne, joille Kirjoitus oli annettu, jakaantuivat lahkokuntiin vasta, kun selvä todistus oli tullut heidän osakseen,",
                            "verse 98:5": "eikä heille annettu muuta käskyä kuin palvella Jumalaa, olla kuuliaisia yksin Hänelle, vilpittöminä suorittaa rukoukset ja uhrata säädetyt almut, sillä tämä on oikea usko.",
                            "verse 98:6": "Totisesti ne, jotka eivät usko, sekä Kirjoituksen saaneet että pakanat, joutuvat helvetin tuleen ja jäävät sinne ikuisiksi ajoiksi.",
                            "verse 98:7": "Ne, jotka uskovat ja tekevät hyviä töitä, ovat totisesti parhaita olentoja.",
                            "verse 98:8": "Heidän palkkansa heidän Herransa luona ovat ikiautuuden puutarhat, joita virrat vilvoittavat ja joissa he saavat asua ikuisesti."
                        }
                    }
                }
            },
            "french": {
                "translators": {
                    "1": {
                        "Jean-Louis Michon": {
                            "verse 98:1": "Les mécréants appartenant aux Gens du Livre et aux associateurs ne peuvent cesser de mécroire tant que la Preuve décisive ne leur est pas parvenue.",
                            "verse 98:2": "[Mais voici qu'] un Envoyé de Dieu récite des feuillets purifiés",
                            "verse 98:3": "contenant des Ecritures pérennes.",
                            "verse 98:4": "Ceux qui avaient reçu le Livre ne se sont divisés qu'après que la Preuve décisive leur fut parvenue.",
                            "verse 98:5": "Pourtant, il leur a seulement été ordonné d'adorer Dieu comme des croyants sincères, Lui rendant un culte pur, de s'acquitter de la prière et de faire l'aumône.",
                            "verse 98:6": "Certes, les mécréants appartenant aux Gens du Livre et aux associateurs séjourneront à jamais dans le feu de la Géhenne.",
                            "verse 98:7": "Certes, ceux qui croient et accomplissent des œuvres pies, ceux-là sont les meilleurs des êtres créés.",
                            "verse 98:8": "Leur récompense auprès de leur Seigneur sera les Jardins d'Eden sous lesquels coulent les fleuves, où ils demeureront à jamais."
                        }
                    },
                    "2": {
                        "Muhammad Hamidullah ": {
                            "verse 98:1": "Les infidèles parmi les gens du Livre, ainsi que les Associateurs, ne cesseront pas de mécroire jusqu’à ce que leur vienne la Preuve évidente :",
                            "verse 98:2": "un Messager, de la part de Dieu, qui leur récite des feuilles purifiées,",
                            "verse 98:3": "dans lesquelles se trouvent des prescriptions d’une rectitude parfaite.",
                            "verse 98:4": "Et ceux à qui le Livre a été donné ne se sont divisés qu’après que la preuve leur fut venue.",
                            "verse 98:5": "Il ne leur a été commandé, cependant, que d’adorer Dieu, Lui vouant un culte exclusif, d’accomplir la Salat et d’acquitter la Zakat.",
                            "verse 98:6": "Les infidèles parmi les gens du Livre, ainsi que les Associateurs iront au feu de l’Enfer, pour y demeurer éternellement.",
                            "verse 98:7": "Quant à ceux qui croient et accomplissent les bonnes oeuvres, ce sont les meilleurs de toute la création.",
                            "verse 98:8": "Leur récompense auprès de Dieu sera les Jardins de séjour, sous lesquels coulent les ruisseaux, pour y demeurer éternellement."
                        }
                    }
                }
            },
            "german": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Die ungläubig sind unter dem Volk der Schrift und den Götzendienern, konnten (von ihrem Irrtum) nicht eher befreit werden, als bis ein deutlicher Beweis zu ihnen kam:",
                            "verse 98:2": "Ein Gesandter von Allah, der (ihnen) die reinen Schriften vorliest,",
                            "verse 98:3": "Worinnen die ewigen Gebote sind.",
                            "verse 98:4": "Und die, denen die Schrift gegeben ward, waren nicht eher gespalten, als nachdem der deutliche Beweis zu ihnen gekommen war.",
                            "verse 98:5": "Und doch war ihnen nichts anderes befohlen, als Allah zu dienen, in lauterem Gehorsam gegen Ihn und aufrechtem Glauben, und das Gebet zu verrichten und die Zakat zu zahlen.",
                            "verse 98:6": "Wahrlich, jene, die ungläubig sind unter dem Volk der Schrift und den Götzendienern, werden im Feuer der Hölle sein, um darin zu bleiben.",
                            "verse 98:7": "Die aber glauben und gute Werke üben, sie sind die besten Geschöpfe.",
                            "verse 98:8": "Ihr Lohn ist bei ihrem Herrn: Gärten der Ewigkeit, von Strömen durchflossen; darin werden sie weilen auf immer."
                        }
                    }
                }
            },
            "hindi": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "vgys fdrkc vkSj eq’kfjdksa ls tks yksx dkfQj Fks tc rd fd muds ikl [kqyh gq;h nyhysa u igq¡ps og ¼vius dqÝ ls½ ckt+ vkus okys u Fks",
                            "verse 98:2": "¼;kfu½ [+kqnk ds jlwy tks ikd vkSjkd+ i<+rs gSa ¼vk, vkSj½",
                            "verse 98:3": "muesa ¼tks½ iqjt+ksj vkSj n:Lr ckrsa fy[kh gq;h gSa ¼lquk;s½",
                            "verse 98:4": "vgys fdrkc eqrkQ+fjZd+ gq, Hkh rks tc muds ikl [kqyh gq;h nyhy vk pqdh",
                            "verse 98:5": "¼rc½ vkSj mUgsa rks cl ;s gqDe fn;k x;k Fkk fd fujk [+kqjk mlh dk ,rd+kn j[k ds ckfry ls drjk ds [k+qnk dh bcknr djs vkSj ikcUnh ls uekt+ i<+s vkSj t+dkr vnk djrk jgs vkSj ;gh lPpk nhu gS",
                            "verse 98:6": "cs’kd vgys fdrkc vkSj eq’kjsdhu ls tks yksx ¼vc rd½ dkfQ+j gSa og nkst+[+k dh vkx esa ¼gksaxs½ ges’kk mlh esa jgsaxs ;gh yksx cnrjhu [+kyk,d+ gSa",
                            "verse 98:7": "cs’kd tks yksx bZeku yk, vkSj vPNs dke djrs jgs ;gh yksx csgrjhu [k+yk,d+ gSa",
                            "verse 98:8": "mudh tt+k muds ijojfnxkj ds ;gk¡ ges’kk jgus ¼lgus½ ds ckx+ gSa ftuds uhps ugjsa tkjh gSa vkSj og vkcknqy vkckn ges’kk mlh esa jgsaxs [k+qnk muls jkt+h vkSj og [+kqnk ls [+kq’k ;s ¼tt+k½ [k+kl ml Ó[+l dh gS tks vius ijojfnxkj ls Mjs"
                        }
                    }
                }
            },
            "indonesian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Orang-orang kafir yakni ahli kitab dan orang-orang musyrik (mengatakan bahwa mereka) tidak akan meninggalkan (agamanya) sebelum datang kepada mereka bukti yang nyata,",
                            "verse 98:2": "(yaitu) seorang Rasul dari Allah (Muhammad) yang membacakan lembaran-lembaran yang disucikan (Al Qur’an),",
                            "verse 98:3": "di dalamnya terdapat (isi) kitab-kitab yang lurus.",
                            "verse 98:4": "Dan tidaklah berpecah belah orang-orang yang didatangkan Al Kitab (kepada mereka) melainkan sesudah datang kepada mereka bukti yang nyata.",
                            "verse 98:5": "Padahal mereka tidak disuruh kecuali supaya menyembah Allah dengan memurnikan keta’atan kepada-Nya dalam (menjalankan) agama dengan lurus dan supaya mereka mendirikan shalat dan menunaikan zakat; dan yang demikian itulah agama yang lurus.",
                            "verse 98:6": "Sesungguhnya orang-orang kafir yakni ahli Kitab dan orang-orang musyrik (akan masuk) ke neraka Jahannam; mereka kekal di dalamnya.",
                            "verse 98:7": "Sesungguhnya orang-orang yang beriman dan mengerjakan amal saleh mereka itu adalah sebaik-baik makhluk.",
                            "verse 98:8": "Balasan mereka di sisi Tuhan mereka ialah surga ’Adn yang mengalir di bawahnya sungai-sungai; mereka kekal di dalamnya selama-lamanya."
                        }
                    }
                }
            },
            "italian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "I miscredenti fra la gente della Scrittura e gli associatori , non cesseranno , finché che non giunga loro la Prova Evidente .",
                            "verse 98:2": "un Messaggero, da parte di Allah, che legge fogli purissimi ,",
                            "verse 98:3": "contenenti precetti immutabili.",
                            "verse 98:4": "Coloro cui fu data la Scrittura non si divisero, finché non giunse loro la Prova Evidente ;",
                            "verse 98:5": "eppure non ricevettero altro comando che di adorare Allah, tributandoGli un culto esclusivo e sincero , di eseguire l'orazione e di versare la decima .",
                            "verse 98:6": "In verità i miscredenti fra gente della Scrittura e gli associatori, saranno nel fuoco dell'Inferno, dove rimarranno in perpetuo.",
                            "verse 98:7": "Quelli che invece credono e compiono il bene sono i migliori di tutta la creazione.",
                            "verse 98:8": "Presso il loro Signore, la loro ricompensa saranno i Giardini di Eden, dove scorrono i ruscelli, in cui rimarranno in perpetuo."
                        }
                    }
                }
            },
            "japanese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "啓典の民の中（真理を）拒否した者も多神教徒も，かれらに明証が来るまで，（道から）離れようとしなかった。",
                            "verse 98:2": "またアッラーからの使徒が，純聖な書巻を，読んで聞かせるまでは。",
                            "verse 98:3": "その中には，不滅の正しい記録（� ）がある。",
                            "verse 98:4": "啓典を授かっている者たちが，分派したのは，明証がかれらに来てから後のことであった。",
                            "verse 98:5": "かれらの命じられたことは，只アッラーに仕え，かれに信心の誠を尽し，純正に服従，帰依して，礼拝の務めを守り，定めの喜捨をしなさいと，言うだけのことであった。これこそ真正の教えである。",
                            "verse 98:6": "啓典の民の中（真理を）拒否した者も，多神教徒も，地獄の火に（投げ込まれ）て，その中に永遠に住む。これらは，衆生の中最悪の者である。",
                            "verse 98:7": "だが信仰して善行に勤しむ者たち，これらは，衆生の中最善の者である。",
                            "verse 98:8": "かれらへの報奨は，主の御許の，川が下を流れる永遠の園である。永遠にその中に住むであろう。アッラーはかれらを喜ばれ，かれらもかれに満悦する。それは主を畏れる者（への報奨）である。 だが信仰して善行に勤しむ者たち，これらは，衆生の中最善の者である。"
                        }
                    }
                }
            },
            "korean": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "성서의 백성들 가운데 진리 를 거역한 자들과 불신자들은 분 명한 예증이 그들에게 이를 때 까지 그들은 길을 떠나려 하지 아니 하였노라",
                            "verse 98:2": "이 예증은 성스러운 말씀을 낭송할 하나님의 선지자로",
                            "verse 98:3": "그 안에는 올바른 율법이 있 노라",
                            "verse 98:4": "성서의 백성들은 그들에게 분명한 예증이 이를 때 까지 의견을달리하지 아니 했으니",
                            "verse 98:5": "그들에게 주어진 명령은 하 나님을 경배하고 진실한 믿음이 되도록 그분께 헌신하며 기도를 드리고 이슬람세를 바치는 것들이참된 신앙이라",
                            "verse 98:6": "실로 성서의 백성들 중에 진 리를 거역한 자들과 불신자들은 불지옥에 있게 되리니 그들은 그 안에서 영주하매 가장 사악한 무 리들이라",
                            "verse 98:7": "그러나 믿음으로 선을 실천하는 자들은 가장 의로운 자들로",
                            "verse 98:8": "그들을 위해 주님의 보상이 있나니 밑으로 강물이 흐르는 영 생할 에덴의 천국이라 하나님은 그들로 기뻐하시고 그들은 그분으로 기뻐하리니 그것은 주님을 두 려워하는 자에 대한 보상이라"
                        }
                    }
                }
            },
            "kurdish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "ئه‌وانه‌ی بێ باوه‌ڕ بوون له خاوه‌نی کتێبه‌کان له‌گه‌ڵ موشریك و هاوه‌ڵگه‌ران، وازیان له بیرو باوه‌ڕی خۆیان هێنا، هه‌تا به‌ڵگه‌و نیشانه‌ی ڕوون و ئاشکرایان بۆ نه‌هات (ده‌رباره‌ی دواهه‌مین پێغه‌مبه‌ر).",
                            "verse 98:2": "(ئه‌ویش) پێغه‌مبه‌رێکه له‌لایه‌ن خواوه کتێب و نامه‌ی پاك و بێگه‌ردیان به‌سه‌ردا ده‌خوێنێته‌وه (که قورئانه‌).",
                            "verse 98:3": "چه‌نده‌ها په‌یامی پڕ له ڕێنموویی به نرخی له توێدا هه‌یه‌.",
                            "verse 98:4": "جا خاوه‌ن کتێبه‌کان ده‌سته ده‌سته‌و پارچه پارچه نه‌بوون، دوای ئه‌وه نه‌بێت که به‌ڵگه‌و نیشانه‌ی ئاشکرایان بۆ هات (ده‌رباره‌ی پێغه‌مبه‌رو قورئان).",
                            "verse 98:5": "فه‌رمانیشیان پێنه‌درابوو جگه به‌وه‌ی که خواپه‌رستی بکه‌ن و به‌پاکی و دڵسۆزی و ملکه‌چی فه‌رمانبه‌رداری ئاین و به‌رنامه‌که بن و لابده‌ن له هه‌موو ئایینێك و ته‌نها پابه‌ندی ئایینی ئیسلام بن، نوێژیش به‌ڕێك و پێکی ئه‌نجام بده‌ن، زه‌کاتیش له ماڵ و سامانیان ده‌ربکه‌ن، ئه‌وه‌یه ئاینی نامه ڕاست و به‌نرخه‌کانی خوا.",
                            "verse 98:6": "به‌ڕاستی ئه‌وانه‌ی بێ باوه‌ڕ بوون له خاوه‌ن کتێبه‌کان و موشریك و هاوه‌ڵگه‌ران ده‌خرێنه ناو ئاگری دۆزه‌خه‌وه‌و به نه‌مری تیایدا بۆ هه‌میشه ده‌مێننه‌وه‌، هه‌ر ئه‌وانه‌ن تاوانبارترین و خراپترینی خه‌ڵکانی سه‌رزه‌وی.",
                            "verse 98:7": "بێگومان ئه‌وانه‌ی ئیمان و باوه‌ڕیان هێناوه‌و کارو کرده‌وه چاکه‌کانیان ئه‌نجامداوه‌، هه‌ر ئه‌وانه‌ن چاکترین و پاکترینی خه‌ڵکانی سه‌ر زه‌وی.",
                            "verse 98:8": "پاداشتیان لای په‌روه‌ردگاریان به‌هه‌شتی پڕ له باخی چڕه (که کۆشك و ته‌لاره‌کان تیایدا ون بوون)، چه‌نده‌ها ڕووباریش به‌ژێر دره‌خت و به‌به‌رده‌م کۆشکه‌کانیدا ده‌ڕوات و له‌وێ ژیانی هه‌میشه‌یی و به‌رده‌وام بۆ هه‌تا هه‌تایی ده‌به‌نه سه‌ر، ئه‌وانه خوا ڕازیه لێیان، ئه‌وانیش له‌و ڕازین (چۆن ڕازی نابن ئه‌ی په‌روه‌ردگاری ئازیز، به‌ڕاستی نازانین به‌چ زمانێك سوپاسگوزارت بین) بێگومان ئه‌و ڕێزو قه‌دره بۆ ئه‌و که‌سه‌یه که له په‌روه‌ردگاری ترساوه‌و فه‌رمانه‌کانی به‌جێ هێناوه‌."
                        }
                    }
                }
            },
            "malay": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Orang-orang yang kafir dari Ahli Kitab (Yahudi dan Nasrani) serta orang-orang musyrik, tidak akan terlepas (dari kepercayaan dan amalan masing-masing) sehingga datang kepada mereka bukti yang jelas nyata, -",
                            "verse 98:2": "Iaitu seorang Rasul dari Allah yang membacakan (kepada mereka) Lembaran-lembaran Suci,",
                            "verse 98:3": "Terkandung di dalamnya pelajaran-pelajaran dan hukum-hukum yang benar.",
                            "verse 98:4": "Dan orang-orang (Yahudi dan Nasrani) yang diberi Kitab (Taurat dan Injil) itu, tidak berpecah-belah melainkan setelah datang kepada mereka bukti yang jelas nyata.",
                            "verse 98:5": "Pada hal mereka tidak diperintahkan melainkan supaya menyembah Allah dengan mengikhlaskan ibadat kepadaNya, lagi tetap teguh di atas tauhid dan supaya mereka mendirikan sembahyang serta memberi zakat dan yang demikian itulah agama yang benar.",
                            "verse 98:6": "Sesungguhnya orang-orang yang kafir dari Ahli Kitab dan orang-orang musyrik itu akan ditempatkan di dalam Neraka Jahannam, kekallah mereka di dalamnya.",
                            "verse 98:7": "Sesungguhnya orang-orang yang beriman dan beramal soleh, mereka itulah sebaik-baik makhluk.",
                            "verse 98:8": "Balasan mereka di sisi Tuhannya ialah Syurga Adn (tempat tinggal yang tetap), yang mengalir di bawahnya beberapa sungai; kekallah mereka di dalamnya selama-lamanya; Allah reda akan mereka dan merekapun reda (serta bersyukur) akan nikmat pemberianNya."
                        }
                    }
                }
            },
            "persian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "كافران از اهل كتاب و مشركان (مى‏گفتند:) دست از آيين خود برنمى‏دارند تا دليل روشنى براى آنها بيايد،",
                            "verse 98:2": "پيامبرى از سوى خدا (بيايد) كه صحيفه‏هاى پاكى را (بر آنها) بخواند،",
                            "verse 98:3": "و در آن نوشته‏هاى صحيح و پرارزشى باشد! (ولى هنگامى كه آمد ايمان نياوردند، مانند اهل كتاب)",
                            "verse 98:4": "اهل كتاب (نيز در دين خدا) اختلاف نكردند مگر بعد از آنكه دليل روشن براى آنان آمد!",
                            "verse 98:5": "و به آنها دستورى داده نشده بود جز اينكه خدا را بپرستند در حالى كه دين خود را براى او خالص كنند و از شرك به توحيد بازگردند، نماز را برپا دارند و زكات را بپردازند; و اين است آيين مستقيم و پايدار!",
                            "verse 98:6": "كافران از اهل كتاب و مشركان در آتش دوزخند، جاودانه در آن مى‏مانند; آنها بدترين مخلوقاتند!",
                            "verse 98:7": "(اما) كسانى كه ايمان آوردند و اعمال صالح انجام دادند، بهترين مخلوقات (خدا)يند!",
                            "verse 98:8": "پاداش آنها نزد پروردگارشان باغهاى بهشت جاويدان است كه نهرها از زير درختانش جارى است; هميشه در آن مى‏مانند! (هم) خدا از آنها خشنود است و (هم) آنها از خدا خشنودند; و اين (مقام والا) براى كسى است كه از پروردگارش بترسد!"
                        }
                    }
                }
            },
            "portuguese": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Os incrédulos, entre os adeptos do Livro, bem como os idólatras, não desistiriam da sua religião, a não ser quando lhes chegasse a Evidência:",
                            "verse 98:2": "Um Mensageiro de Deus, que lhes recitasse páginas purificadas,",
                            "verse 98:3": "Que contivessem escrituras corretas.",
                            "verse 98:4": "Os adeptos do Livro não se dividiram, senão depois de lhes ter chegado a Evidência,",
                            "verse 98:5": "E lhes foi ordenado que adorassem sinceramente a Deus, fossem monoteístas, observassem a oração e pagassem o zakat; esta é a verdadeira religião.",
                            "verse 98:6": "Em verdade, os incrédulos, entre os adeptos do Livro, bem como os idólatras, entrarão no fogo infernal, onde permanecerão eternamente.",
                            "verse 98:7": "Por outra, os fiéis, que praticam o bem, são as melhores criaturas,",
                            "verse 98:8": "Cuja recompensa está em seu Senhor: Jardins do Éden, abaixo dos quais correm os rios, onde morarão eternamente."
                        }
                    }
                }
            },
            "romanian": {
                "translators": {
                    "1": {
                        "Lucrarea (traducere úi editare) a fost realizată de către": {
                            "verse 98:1": "Cei care nu au crezut dintre oamenii Cãrții , ca și idolatrii , nu au încetat sã nu creadã pânã nu le-a venit lor Dovada cea limpede:",
                            "verse 98:2": "Un Trimis din partea lui Allah , care sã le citeascã foi curãțite ,",
                            "verse 98:3": "În care sunt scripturi cu judecatã dreaptã.",
                            "verse 98:4": "Și nu s-au despãrțit cei cãrora le-a fost datã Cartea, decât dupã ce le-a venit lor dovada cea limpede .",
                            "verse 98:5": "Și nu li s-a poruncit decât sã-L adore pe Allah, cu credințã curatã șistatornicã în religia Lui, sã împlineascã Rugãciunea",
                            "verse 98:6": "și sãachite Dania .",
                            "verse 98:7": "Și a",
                            "verse 98:8": "Cei care nu cred dintre oamenii Cãrții, ca și idolatrii, în veci vorpetrece în focul Gheenei.",
                            "verse 98:9": "Aceia care cred și împlinesc fapte bune, aceia sunt cei mai buni dintre toate fãpturile.",
                            "verse 98:10": "Rãsplata lor de la Domnul lor sunt Grãdinile Edenului, pe sub care curg pâraie, și în ele vor petrece veșnic, cãci Allah este mulțumit de ei , iar ei sunt mulțumiți de El."
                        }
                    },
                    "2": {
                        "George Grigore, Coranul": {
                            "verse 98:1": "Cei dintre oamenii Cărţii care tăgăduiesc, precum şi închinătorii la idoli, nu se vor răsfira până ce nu le va veni dovada desluşită:",
                            "verse 98:2": "un trimis de la Dumnezeu care recită din suluri prea-curate",
                            "verse 98:3": "cu scrieri nestemate.",
                            "verse 98:4": "Celor cărora le-a fost dată Cartea nu s-au despărţit decât după ce le-a venit dovada.",
                            "verse 98:5": "Nu li s-a poruncit decât să se închine lui Dumnezeu, curaţi Lui în credinţă, precum credincioşii dintâi, să-şi facă rugăciunea şi să dea milostenie.",
                            "verse 98:6": "Cei dintre oamenii Cărtii care tăgăduiesc, precum şi închinătorii la idoli, în focul Gheenei vor veşnici, căci ei sunt tot ce este mai rău pe lume.",
                            "verse 98:7": "Cei care cred şi săvârşesc fapte bune, ei sunt tot ce este mai bun pe lume.",
                            "verse 98:8": "Ei vor avea, drept răsplată, de la Domnul lor, grădinile Edenului pe sub care curg râuri, unde vor veşnici."
                        }
                    }
                }
            },
            "russian": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Неверные из тех, кто получилПисанье,И многобожникиНе отошли бы (от своих учений)До той поры, пока к ним не пришлоОткрытое свидетельство (Господне) —",
                            "verse 98:2": "Посланник от Аллаха, читающий имСвитки2333В их праведности и чистоте,",
                            "verse 98:3": "В которых с ясностью даныУстановления Господни.",
                            "verse 98:4": "И не делились меж собоюлюди Книги,А (разделение пришло),Когда явилось Ясное Знаменье.",
                            "verse 98:5": "И было им повелено уверовать(в Аллаха)И в поклонении Аллаху искренностьблюсти,Быть верным в правоверии своем,И по часам творить молитву,И править милостыню для очищенья.",
                            "verse 98:6": "Неверные из тех, кто получил Писанье,И многобожникиГореть навечно будут в адовом огне, —Поистине, они — сквернейшиеиз всех созданий!",
                            "verse 98:7": "Те ж, кто уверовал в АллахаИ праведные действия вершит, —Прекраснейшие из созданий (Бога)!",
                            "verse 98:8": "Господнею наградой им — Эдемскиесады,Потоками речными омовенны,Где пребывать навечно им."
                        }
                    }
                }
            },
            "spanish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Los que no creen, tanto gente de la Escritura como asociadores, no podían renunciar hasta que les viniera la prueba clara:",
                            "verse 98:2": "Un Enviado de Dios, que recitara hojas purificadas,",
                            "verse 98:3": "que contenían Escrituras verdaderas.",
                            "verse 98:4": "Y quienes recibieron la Escritura no se dividieron sino después de venir a ellos la prueba clara.",
                            "verse 98:5": "Pero no se les ordenó sino que sirvieran a Dios, rindiéndole culto sincero comohanifes, que hicieran la azalá y dieran el azaque.",
                            "verse 98:6": "Los que no crean, tanto gente de la Escritura como asociadores estarán, eternamente, en el fuego de la gehena.",
                            "verse 98:7": "En cambio, los que crean y obren bien, ésos son lo mejor de la creación,",
                            "verse 98:8": "y tendrán como retribución, junto a su Señor, los jardines del edén, por cuyos bajos fluyen arroyos, en los que estarán eternamente, para siempre."
                        }
                    }
                }
            },
            "tamil": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "வேதக்காரர்களிலும், முஷ்ரிக்குகளிலும் எவர்கள் நிராகரிக்கின்றார்களோ, அவர்கள் தங்களிடம் தெளிவான ஆதாரம் வரும் வரை (தம் வழிகளிலிருந்து) விலகுபவர்கள் அல்லர்.",
                            "verse 98:2": "(அத் தெளிவான ஆதாரம்) அல்லாஹ்விடமிருந்து வந்த தூதர், அவர்களுக்கு பரிசுத்தமான ஆகமங்களை ஓதிக் காண்பிக்கிறார் (என்பது).",
                            "verse 98:3": "அவற்றில் நிலையான சட்டதிட்டங்கள் வரையப்பட்டுள்ளன.",
                            "verse 98:4": "எனினும் வேதக்காரர்கள் அவர்களுக்குத் தெளிவான (இந்த) ஆதாரம் வந்த பின்னரேயன்றி அவர்கள் பிளவுபடவில்லை.",
                            "verse 98:5": "\"அல்லாஹ்வுக்கு வணக்கத்தை தூய்மையாக்கியவர்களாக (தவறான வழியிலிருந்து விலகி சரியான வழியில்) பிடிப்புள்ளவர்களாக அல்லாஹ்வை அவர்கள் வணங்க வேண்டும், மேலும் தொழுகையை அவர்கள் நிலைநாட்டவேண்டும், மேலும் ஜகாத்தை அவர்கள் வழங்க வேண்டும் என்பதைத் தவிர (வேறெதுவும்) அவர்களுக்குக் கட்டளையிடப்படவில்லை.",
                            "verse 98:6": "நிச்சயமாக வேதக்காரர்களிலும் முஷ்ரிக்குகளிலும் எவர்கள் நிராகரிக்கிறார்களோ அவர்கள் நரக நெருப்பில் இருப்பார்கள் - அதில் என்றென்றும் இருப்பார்கள் - இத்தகையவர்கள்தாம் படைப்புகளில் மிகக் கெட்டவர்கள் ஆவார்கள்.",
                            "verse 98:7": "நிச்சயமாக, எவர்கள் ஈமான் கொண்டு, ஸாலிஹான (நல்ல) அமல்கள் செய்கிறார்களோ, அவர்கள் தாம் படைப்புகளில் மிக மேலானவர்கள் ஆவார்கள்.",
                            "verse 98:8": "அவர்களுடைய நற்கூலி, அவர்களுடைய இறைவனிடத்திலுள்ள அத்னு என்னும் சுவர்க்கச் சோலைகளாகும்."
                        }
                    }
                }
            },
            "thai": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "บรรดาผู้ปฏิเสธศรัทธาในหมู่อะฮ์ลุลกิตาบและพวกบูชาเจว็ดนั้นจะไม่พ้นจาก (หลักศรัทธาของพวกเขา) จนกว่าจะได้มีหลักฐานอันชัดแจ้งมายังพวกเขา",
                            "verse 98:2": "คือร่อซู้ลคนหนึ่งจากอัลลอฮ์เพื่ออ่านคัมภีร์อันบริสุทธิ์",
                            "verse 98:3": "ในคัมภีร์นั้นมีบัญญัติอันเที่ยงตรง",
                            "verse 98:4": "และบรรดาผู้ที่ได้รับคัมภีร์ (อะฮ์ลุลกิตาบ) นั้น มิได้แตกแยกกัน เว้นแต่หลังจากที่ได้มีหลักฐานอันชัดแจ้งมายังพวกเขาแล้ว",
                            "verse 98:5": "และพวกเขามิได้ถูกบัญชาให้กระทำอื่นใดนอกจากเพื่อเคารพภักดีต่ออัลลอฮ์ เป็นผู้มีเจตนาบริสุทธิ์ในการภักดีต่อพระองค์ เป็นผู้อยู่ในแนวทางที่เที่ยงตรงและดำรงการละหมาด และจ่ายซะกาต และนั่นแหละคือศาสนาอันเที่ยงธรรม",
                            "verse 98:6": "แท้จริงบรรดาผู้ปฏิเสธศรัทธาในหมู่อะฮ์ลุลกิตาบและบูชาเจว็ดนั้นจะอยู่ในนรกญะฮันนัม พวกเขาเป็นผู้พำนักอยู่ในนั้นตลอดกาล ชนเหล่านั้นพวกเขาเป็นมนุษย์ที่ชั่วช้ายิ่ง",
                            "verse 98:7": "แท้จริง บรรดาผู้ศรัทธาและประกอบความดีทั้งหลาย ชนเหล่านั้น พวกเขาเป็นมนุษย์ที่ดียิ่ง",
                            "verse 98:8": "การตอบแทนของพวกเขา ณ ที่พระเจ้าของพวกเขาคือสวนสวรรค์หลากหลายอันสถาพร ณ เบื้องล่างของมันมีลำน้ำหลายสายไหลผ่าน พวกเขาเป็นผู้พำนักอยู่ในนั้นตลอดกาล อัลลอฮ์ทรงปิติต่อพวกเขา และพวกเขาก็ยินดีในพระองค์ นั่นคือสำหรับผู้ที่กลัวเกรงพระเจ้าของพวกเขา"
                        }
                    }
                }
            },
            "turkish": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Apaçık delil kendilerine gelinceye kadar ehl-i kitaptan ve müşriklerden inkârcılar (küfürden) ayrılacak değillerdi.",
                            "verse 98:2": "(İşte o apaçık delil,) Allah tarafından gönderilen ve tertemiz sahifeleri okuyan bir elçidir.",
                            "verse 98:3": "En doğru hükümler vardır şu sahifelerde.",
                            "verse 98:4": "Kendilerine kitap verilenler ancak o açık delil (Peygamber) kendilerine geldikten sonra ayrılığa düştüler.",
                            "verse 98:5": "Halbuki onlara ancak, dini yalnız O'na has kılarak ve hanifler olarak Allah'a kulluk etmeleri, namaz kılmaları ve zekât vermeleri emrolunmuştu.",
                            "verse 98:6": "Ehl-i kitap ve müşriklerden olan inkârcılar, içinde ebedî olarak kalacakları cehennem ateşindedirler.",
                            "verse 98:7": "İman edip sâlih ameller işleyenlere gelince, halkın en hayırlısı da onlardır.",
                            "verse 98:8": "Onların Rableri katındaki mükâfatları, zemininden ırmaklar akan, içinde devamlı olarak kalacakları Adn cennetleridir."
                        }
                    }
                }
            },
            "urdu": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "جو لوگ کافر ہیں (یعنی) اہل کتاب اور مشرک وہ (کفر سے) باز رہنے والے نہ تھے جب تک ان کے پاس کھلی دلیل (نہ) آتی",
                            "verse 98:2": "اہلِ کتاب ميں سے جو لوگ کافر ہو گئے اور مشرکين اس وقت تک (کفر سے) الگ ہونے والے نہ تھے جب تک ان کے پاس روشن دليل (نہ) آجاتيo",
                            "verse 98:3": "(وہ دليل) ا? کي طرف سے رسول (آخر الزماں صلي اللہ عليہ وآلہ وسلم) ہيں جو (ان پر) پاکيزہ اوراقِ (قرآن) کي تلاوت فرماتے ہيںo",
                            "verse 98:4": "(یعنی) خدا کے پیغمبر جو پاک اوراق پڑھتے ہیں",
                            "verse 98:5": "جن میں( مستحکم) آیتیں لکھی ہوئی ہیں",
                            "verse 98:6": "جن ميں درست اور مستحکم احکام (درج) ہيںo",
                            "verse 98:7": "(ان) اہل کتاب ميں (نبي آخر الزماں صلي اللہ عليہ وآلہ وسلم کي نبوت و رسالت پر ايمان لانے اور آپ کي شانِ اقدس کو پہچاننے کے بارے ميں پہلے) کوئي پھوٹ نہ پڑي تھي مگر اس کے بعد کہ جب (بعثتِ محمدي صلي اللہ عليہ وآلہ وسلم کي) روشن دليل ان کے پاس آگئي (تو وہ باہم بٹ گئے کوئي ان پر ايمان لے آيا اور کوئي حسد کے باعث منکر و کافر ہوگيا)o",
                            "verse 98:8": "اور اہل کتاب جو متفرق (و مختلف) ہوئے ہیں تو دلیل واضح آنے کے بعد( ہوئے ہیں)",
                            "verse 98:9": "اور ان کو حکم تو یہی ہوا تھا کہ اخلاص عمل کے ساتھ خدا کی عبادت کریں (اور) یکسو ہو کراورنماز پڑھیں اور زکوٰة دیں اور یہی سچا دین ہے",
                            "verse 98:10": "حالانکہ انہيں فقط يہي حکم ديا گيا تھا کہ صرف اسي کے لئے اپنے دين کو خالص کرتے ہوئے ا? کي عبادت کريں، (ہر باطل سے جدا ہو کر) حق کي طرف يک سُوئي پيدا کريں اور نماز قائم کريں اور زکو?? ديا کريں اور يہي سيدھا اور مضبوط دين ہےo",
                            "verse 98:11": "بيشک جو لوگ اہلِ کتاب ميں سے کافر ہوگئے اور مشرکين (سب) دوزخ کي آگ ميں (پڑے) ہوں گے وہ ہميشہ اسي ميں رہنے والے ہيں، يہي لوگ بد ترين مخلوق ہيںo",
                            "verse 98:12": "جو لوگ کافر ہیں (یعنی) اہل کتاب اور مشرک وہ دوزخ کی آگ میں پڑیں گے (اور) ہمیشہ اس میں رہیں گے۔ یہ لوگ سب مخلوق سے بدتر ہیں",
                            "verse 98:13": "(اور) جو لوگ ایمان لائے اور نیک عمل کرتے رہے وہ تمام خلقت سے بہتر ہیں",
                            "verse 98:14": "بيشک جو لوگ ايمان لائے اور نيک عمل کرتے رہے وہي لوگ ساري مخلوق سے بہتر ہيںo",
                            "verse 98:15": "ان کي جزا ان کے رب کے حضور دائمي رہائش کے باغات ہيں جن کے نيچے سے نہريں رواں ہيں، وہ ان ميں ہميشہ ہميشہ رہيں گے، ا? اُن سے راضي ہوگيا ہے اور وہ لوگ اس سے راضي ہيں، يہ (مقام) اس شخص کے لئے ہے جو اپنے رب سے خائف رہاo",
                            "verse 98:16": "ان کا صلہ ان کے پروردگار کے ہاں ہمیشہ رہنے کے باغ ہیں جن کے نیچے نہریں بہہ رہی ہیں ابدالاباد ان میں رہیں گے۔ خدا ان سے خوش اور وہ اس سے خوش۔ یہ (صلہ) اس کے لیے ہے جو اپنے پروردگار سے ڈرتا رہا رہاo"
                        }
                    }
                }
            },
            "uzbek": {
                "translators": {
                    "1": {
                        "null": {
                            "verse 98:1": "Аҳли китоб ва мушриклардан бўлган куфр келтирганларга «баййина» келмагунча ажралмасдилар.",
                            "verse 98:2": "У (баййина) Аллоҳ тарафидан юборилган Расул бўлиб, покланган саҳифаларни тиловат қиладир.",
                            "verse 98:3": "Уларда ажойиб битиклар бордир.",
                            "verse 98:4": "Китоб берилганлар уларга «баййина» келганидан сўнггина бўлиниб кетишди.",
                            "verse 98:5": "Ҳолбуки, улар фақат Аллоҳгагина ибодат қилишга, Унинг динигагина ихлос қилишга, бошқа динларга мойил бўлмасликка, намозни тўлиқ ўқишга, закот беришга буюрилган эдилар.",
                            "verse 98:6": "Албатта, аҳли китоб ва мушриклардан бўлган куфр келтирганлар жаҳаннам ўтидадурлар, у ерда абадий қолурлар.",
                            "verse 98:7": "Албатта, иймон келтирганлар ва солиҳ амалларни қилганлар, ана ўшалар, халойиқнинг энг яхшиларидир.",
                            "verse 98:8": "Уларнинг мукофотлари Роббилари ҳузуридаги остидан анҳорлар оқиб турган жаннат «адн»дир."
                        }
                    }
                }
            }
        }
    }
}